000001$SET LIST MAPINFO XREF LINEINFO ERRORLIMIT = 100                  001000      
000002*$SET TARGET=LEVEL2                                               002000      
000003$SET LIST                                                         003000      
000004*$SET TADS                                                        004000      
000005 IDENTIFICATION DIVISION.                                         005000      
000006 PROGRAM-ID.             LEE-ARCHMOVYDES.                         006000      
000007 AUTHOR.                 FT.                                      007000      
000008 INSTALLATION.           BANAMEX                                  008000      
000009                         INGENIERIA DE SISTEMAS                   009000      
000010                         CENTRO DE DESARROLLO LEON.               010000      
000011 DATE-WRITTEN.           OCTUBRE 2020.                            011000      
000012 DATE-COMPILED.                                                   012000      
000013 SECURITY.               COPYRIGHT 2020.                          013000      
000014 ENVIRONMENT DIVISION.                                            014000      
000015 CONFIGURATION SECTION.                                           015000      
000016 SOURCE-COMPUTER.        A10.                                     016000      
000017 OBJECT-COMPUTER.        A10.                                     017000      
000018 INPUT-OUTPUT SECTION.                                            018000      
000019 FILE-CONTROL.                                                    019000      
000020      SELECT S151MOVANT        ASSIGN TO DISK                     020000      
000021                               ACCESS MODE IS SEQUENTIAL.         021000      
000022      SELECT S151DESANT        ASSIGN TO DISK                     022000      
000023                               RESERVE 0 AREAS                    023000      
000024                               ORGANIZATION IS SEQUENTIAL         024000      
000025                               ACCESS MODE IS RANDOM              025000      
000026                               ACTUAL KEY IS LOG-KEY.             026000      
000027      SELECT REPORTE           ASSIGN TO DISK                     027000      
000028                               ACCESS MODE IS SEQUENTIAL.         028000      
000029 DATA DIVISION.                                                   029000      
000030 FILE SECTION.                                                    030000      
000031*                                                                 031000      
000032 FD S151MOVANT                                                    032000      
000033    VALUE OF                                                      033000      
000034          SECURITYTYPE IS PUBLIC                                  034000      
000035          TITLE WKS-ETI-S151-MOVANT                               035000      
000036          DEPENDENTSPECS IS TRUE.                                 036000      
000037                                                                  037000      
000038*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000039*    COPY "S151/FORMATO/ARCHIVO/MOVTOS".                          038000      
000040                                                                  000100      
000041******************************************************************000200      
000042**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000043**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000044**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000045******************************************************************000600      
000046                                                                  000700      
000047 01 A00-R00-HDR-MOV .                                             000800      
000048    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000049    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000050    02 FILLER                          PIC  X(08).                001100      
000051    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000052    02 FILLER                          PIC  X(430).               001300      
000053                                                                  001400      
000054 01 A00-R01-REGMOV .                                              001500      
000055    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000056    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000057    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000058                                                                  001900      
000059    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000060    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000061                                       PIC  9(04)      COMP.      002200      
000062    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000063                                       PIC  9(04)      COMP.      002400      
000064                                                                  002500      
000065    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000066    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000067                                       PIC  9(02)      COMP.      002800      
000068    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000069                                       PIC  9(02)      COMP.      003000      
000070    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000071    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000072                                       A00-R01-SERVICIO-ALERTA.   003060      
000073       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000074       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000075    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000076    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000077    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000078                                       PIC  9(04)      COMP.      003420      
000079    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000080    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000081                                       PIC  9(04)      COMP.      003520      
000082    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000083    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000084    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000085                                       PIC  9(02)      COMP.      003900      
000086                                                                  004000      
000087    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000088    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000089       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000090          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000091          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000092          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000093          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000094          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000095          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000096          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000097                                                                  005100      
000098    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000099       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000100       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000101       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000102       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000103       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000104       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000105       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000106                                                                  006000      
000107       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000108       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000109       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000110       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000111       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000112       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000113       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000114                                                                  006800      
000115       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000116       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000117       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000118       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000119       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000120       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000121       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000122                                                                  007600      
000123       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000124       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000125       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000126       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000127       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000128       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000129       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000130                                                                  008400      
000131       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000132       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000133       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000134       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000135       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000136       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000137       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000138                                                                  009200      
000139    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000140    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000141    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000142    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000143    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000144    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000145       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000146    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000147    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000148    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000149    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000150    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000151    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000152    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000153    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000154       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000155       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000156    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000157    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000158    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000159    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000160    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000161    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000162    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000163    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000164    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000165    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000166    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000167    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000168    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000169    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000170                                       PIC X(10).                 012600      
000171    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000172       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000173       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000174    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000175    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000176    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000177    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000178       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000179       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000180                                                                  013300      
000181    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000182    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000183                                       PIC  X(09).                013600      
000184    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000185                                       PIC  9(18)      COMP.      013800      
000186    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000187    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000188                                       PIC  X(9).                 014100      
000189    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000190    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000191                                       PIC  X(05).                014400      
000192    03 A00-R01-NIO                     PIC  X(16).                014500      
000193    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000194    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000195    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000196       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000197    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000198    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000199       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000200    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000201    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000202    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000203    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000204    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000205    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000206                                       PIC  X(04).                015900      
000207    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000208    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000209    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000210                                       PIC  9(04)      COMP.      016300      
000211    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000212    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000213    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000214    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000215    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000216                                                                  016900      
000217    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000218    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000219       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000220    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000221                                                                  017400      
000222    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000223       05 FILLER                       PIC X(96).                 017510      
000224       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000225       05 FILLER                       PIC X(67).                 017700      
000226                                                                  017702      
000227    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000228       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000229       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000230       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000231       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000232       06 WKS-MOV-FILS084              PIC X(154).                017714      
000233                                                                  017800      
000234    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000235       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000236       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000237       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000238       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000239       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000240       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000241       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000242       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000243       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000244*      CAMPOS NUEVOS                                              018160      
000245       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000246       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000247       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000248       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000249       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000250       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000251       05 FILLER                       PIC X(40).                 018167      
000252*       05 FILLER                       PIC X(62).                018170      
000253       05 A00-R01-CTE-087              PIC X(07).                 018210      
000254       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000255          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000256          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000257          07 FILLER                    PIC X(01).                 018281      
000258       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000259       05 FILLER                       PIC X(61).                 018400      
000260                                                                  018500      
000261    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000262       05 FILLER                       PIC  X(96).                018610      
000263       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000264       05 FILLER                       PIC  X(65).                018630      
000265                                                                  018640      
000266    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000267       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000268       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000269       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000270       05 FILLER                       PIC  X(141).               018910      
000271                                                                  019100      
000272    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000273       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000274       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000275       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000276       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000277       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000278       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000279       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000280       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000281       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000282       05 FILLER                       PIC  X(69).                020200      
000283                                                                  020300      
000284    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000285       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000286       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000287       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000288       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000289       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000290       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000291       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000292       05 FILLER                       PIC  X(77).                021200      
000293                                                                  021300      
000294    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000295       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000296       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000297       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000298       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000299       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000300       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000301       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000302       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000303       05 FILLER                       PIC  X(69).                022300      
000304                                                                  022400      
000305    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000306       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000307       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000308       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000309       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000310       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000311       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000312       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000313       05 FILLER                       PIC  X(85).                023300      
000314                                                                  023400      
000315    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000316       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000317       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000318       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000319       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000320       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000321       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000322       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000323       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000324       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000325       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000326       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000327       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000328       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000329       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000330       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000331       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000332       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000333       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000334       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000335       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000336       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000337       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000338       05 FILLER                       PIC  X(05).                023492      
000339                                                                  023497      
000340    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000341       05 A00-R01-4CEROS               PIC  9(04).                023600      
000342       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000343       05 FILLER                       PIC  X(157).               023800      
000344                                                                  023900      
000345    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000346       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000347        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000348       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000349       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000350       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000351       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000352       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000353       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000354       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000355       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000356       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000357       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000358       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000359       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000360       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000361       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000362       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000363       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000364       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000365       05 A00-R01-FILLER               PIC  X(41).                025850      
000366       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000367       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000368       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000369       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000370       05 FILLER                       PIC  X(01).                026210      
000371       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000372       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000373       05 FILLER                       PIC  X(52).                026300      
000374                                                                  026400      
000375    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000376       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000377       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000378       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000379       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000380       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000381       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000382       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000383       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000384       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000385       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000386       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000387       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000388       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000389          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000390          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000391       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000392       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000393          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000394       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000395          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000396       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000397          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000398       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000399          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000400       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000401          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000402       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000403          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000404       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000405          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000406       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000407          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000408       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000409          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000410       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000411          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000412          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000413       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000414       05 FILLER                       PIC X(01).                 030101      
000415       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000416       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000417       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000418       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000419       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000420       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000421       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000422       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000423          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000424       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000425       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000426       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000427       05 FILLER                       PIC X(14).                 030700      
000428                                                                  030800      
000429    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000430       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000431       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000432       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000433       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000434       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000435       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000436       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000437       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000438       05 FILLER                       PIC  X(140).               031600      
000439                                                                  031700      
000440    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000441       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000442       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000443       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000444       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000445       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000446       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000447       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000448       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000449       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000450       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000451          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000452          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000453          07 FILLER                    PIC  X(08).                032740      
000454       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000455       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000456       05 A00-R01-NOMORD               PIC  X(30).                033000      
000457       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000458       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000459       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000460       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000461       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000462          A00-R01-NUM-ORD-PAGO.                                   033800      
000463          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000464          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000465                                                                  034100      
000466    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000467       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000468       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000469       05 FILLER                       PIC  X(151).               034180      
000470                                                                  034190      
000471    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000472       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000473       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000474                                       A00-R01-DATOS-S701.        034500      
000475          07 A00-R01-ID                PIC X(30).                 034600      
000476          07 A00-R01-FECREC            PIC 9(06).                 034700      
000477          07 A00-R01-REF1              PIC X(20).                 034800      
000478          07 A00-R01-REF2              PIC X(20).                 034900      
000479          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000480          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000481                                       A00-R01-TIPOPAGO.          035200      
000482             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000483             09 A00-R01-SEQ            PIC 9(02).                 035400      
000484          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000485          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000486          07 A00-R01-EBPP              PIC 9(03).                 035700      
000487          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000488          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000489          07 FILLER                    PIC X(01).                 035728      
000490          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000491          07 FILLER                    PIC X(18).                 035760      
000492       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000493                                       A00-R01-DATOS-S701.        035900      
000494          07 A00-R01-RFC               PIC X(13).                 036000      
000495          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000496          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000497          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000498          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000499          07 FILLER                    PIC X(85).                 036200      
000500       05 FILLER                       PIC X(49).                 036300      
000501                                                                  036400      
000502    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000503       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000504       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000505       05 FILLER                       PIC X(113).                036710      
000506                                                                  036720      
000507    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000508       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000509       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000510       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000511       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000512       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000513       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000514       05 FILLER                       PIC X(72).                 036800      
000515                                                                  036810      
000516                                                                  036820      
000517    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000518       05 A00-R01-TRUI-S711.                                      036915      
000519          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000520          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000521          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000522           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000523          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000524       05 A00-R01-MICR-S711.                                      036945      
000525          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000526          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000527          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000528          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000529          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000530          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000531          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000532          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000533       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000534       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000535       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000536       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000537       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000538       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000539       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000540                                                                  036990      
000541    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000542       05 A00-R01-RFC-502              PIC  X(13).                037100      
000543       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000544          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000545          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000546          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000547          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000548          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000549          07 FILLER                    PIC  9(01) COMP.           037650      
000550       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000551       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000552       05 FILLER                       PIC  X(06).                038680      
000553                                                                  038682      
000554    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000555       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000556       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000557       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000558       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000559       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000560       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000561       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000562       05 FILLER                       PIC  X(81).                038750      
000563                                                                  038755      
000564    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000565       05 A00-R01-COP                  PIC  9(13)        .        038900      
000566       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000567       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000568       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000569       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000570       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000571       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000572       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000573       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000574       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000575       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000576       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000577       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000578       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000579       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000580       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000581       05 FILLER                       PIC  X(81)        .        040800      
000582                                                                  040810      
000583    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000584       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000585       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000586       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000587       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000588       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000589       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000590       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000591       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000592       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000593       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000594       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000595       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000596       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000597       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000598       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000599       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000600       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000601       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000602       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000603       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000604       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000605       05 FILLER                       PIC  X(18).                041040      
000606                                                                  041400      
000607    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000608    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000609*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000610                                                                  039000      
000611 FD S151DESANT                                                    040000      
000612    VALUE OF TITLE IS WKS-ETI-S151-DESANT                         041000      
000613    VALUE OF DEPENDENTSPECS IS TRUE.                              042000      
000614                                                                  043000      
000615*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000616*     COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/DATOSADIC".           044000      
000617 01 A01-R00-HDR-DES .                                             000100      
000618     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000619     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000620     03 FILLER                         PIC X(530).                000400      
000621 01 A01-R01-DATOS.                                                000500      
000622     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000623     03 A01-R01-DATOS-1.                                          000610      
000624        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000625        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000626           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000627        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000628           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000629           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000630           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000631              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000632              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000633           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000634                                       PIC X(12).                 001290      
000635           07 FILLER                   PIC X(04).                 001300      
000636        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000637           07 FILLER                   PIC X(02).                 001500      
000638           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000639        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000640        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000641        05 A01-R01-SDO-FIN.                                       003720      
000642           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000643           07 FILLER                   PIC X(05).                 003760      
000644        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000645           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000646           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000647        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000648        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000649        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000650           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000651           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000652           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000653           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000654           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000655        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000656        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000657        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000658        05 A01-R01-DATOS-2.                                       004450      
000659           07 A01-R01-LEY1             PIC X(40).                 004500      
000660           07 A01-R02-LEY2             PIC X(40).                 004600      
000661           07 A01-R02-LEY3             PIC X(40).                 004700      
000662           07 A01-R02-LEY4             PIC X(40).                 004800      
000663           07 A01-R02-LEY5             PIC X(40).                 004900      
000664           07 A01-R01-FILXAPL          PIC X(120).                004910      
000665           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000666              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000667              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000668              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000669              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000670              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000671              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000672              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000673              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000674              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000675              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000676              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000677              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000678              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000679              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000680              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000681              09 FILLER                PIC X(15).                 004944      
000682                                                                  004946      
000683*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000684*             09 A01-R01-TRUI-S711.                               004949      
000685*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000686*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000687*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000688*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000689*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000690*             09 A01-R01-MICR-S711.                               004955      
000691*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000692*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000693*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000694*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000695*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000696*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000697*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000698*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000699*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000700*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000701*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000702*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000703*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000704                                                                  004969      
000705           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000706              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000707              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000708              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000709              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000710              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000711              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000712              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000713                                                                  004978      
000714           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000715              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000716              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000717              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000718              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000719              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000720              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000721              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000722              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000723              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000724              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000725              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000726              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000727              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000728              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000729              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000730                                                                  004995      
000731           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000732              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000733              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000734              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000735* INI VML                                                         005000      
000736              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000737                              A01-R01-CVE-RASTREO-S500.           005002      
000738                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000739                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000740                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000741                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000742* FIN VML                                                         005009      
000743              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000744        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000745           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000746           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000747           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000748           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000749           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000750           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000751           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000752           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000753           07 A01-R01-POBLACION        PIC X(40).                 005030      
000754           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000755           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000756           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000757           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000758           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000759           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000760           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000761           07 A01-R01-COLONIA          PIC X(30).                 005046      
000762           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000763           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000764           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000765           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000766           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000767           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000768           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000769     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000770        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000771        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000772        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000773        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000774        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000775        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000776        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000777        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000778        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000779        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000780        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000781        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000782        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000783        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000784        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000785        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000786        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000787        05 FILLER                      PIC X(358).                005098      
000788                                                                  005100      
000789     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000790        05 A01-R01-TRUI.                                          005104      
000791           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000792           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000793           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000794           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000795           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000796        05 A01-R01-MICR.                                          005116      
000797           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000798           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000799           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000800           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000801           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000802           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000803           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000804           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000805        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000806        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000807        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000808        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000809        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000810        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000811        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000812        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000813        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000814        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000815        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).                005160      
000816                                                                  005170      
000817     03 FILLER                         PIC X(01).                 005198      
000818     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000819     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000820                                                                  005400      
000821*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000822                                                                  045000      
000823 FD REPORTE                                                       046000      
000824    VALUE OF     SECURITYTYPE IS PUBLIC                           047000      
000825                 TITLE IS WKS-EXTMOV                              048000      
000826                 MAXRECSIZE   IS  200                             048100      
000827    BLOCK CONTAINS        200 RECORDS.                            048200      
000828 01 REG-REPORTE                   PIC X(200).                     049000      
000829*                                                                 050000      
000830 WORKING-STORAGE SECTION.                                         051000      
000831                                                                  052000      
000832                                                                  052002      
000833  01 WKS-FECHA-MAQUINA            PIC X(10) TYPE IS NUMERIC-DATE. 052004      
000834  01 WKS-FECHA-MAQUINA-R          REDEFINES WKS-FECHA-MAQUINA.    052006      
000835     03 WKS-FECMAQ-MM             PIC 9(02).                      052008      
000836     03 WKS-DIAGONAL1             PIC X(01).                      052010      
000837     03 WKS-FECMAQ-DD             PIC 9(02).                      052012      
000838     03 WKS-DIAGONAL2             PIC X(01).                      052014      
000839     03 WKS-FECMAQ-AAAA           PIC 9(04).                      052016      
000840     03 WKS-FECMAQ-AAAA-R         REDEFINES WKS-FECMAQ-AAAA.      052018      
000841        05 WKS-FECMAQ-CC          PIC 9(02).                      052020      
000842        05 WKS-FECMAQ-AA          PIC 9(02).                      052022      
000843                                                                  052024      
000844  01 WKS-HR-MAQUINA               PIC 9(08) TYPE IS NUMERIC-TIME. 052050      
000845  01 WKS-HR-MAQUINA-R             REDEFINES WKS-HR-MAQUINA.       052100      
000846     03 WKS-HH-MAQUINA            PIC 9(02).                      052150      
000847     03 FILLER                    PIC X(01).                      052200      
000848     03 WKS-MM-MAQUINA            PIC 9(02).                      052250      
000849     03 FILLER                    PIC X(01).                      052300      
000850     03 WKS-SS-MAQUINA            PIC 9(02).                      052350      
000851                                                                  052355      
000852  01 WKS-FECHA-ARCH.                                              052360      
000853     03 WKS-AAAA-ARCH             PIC 9(04).                      052365      
000854     03 WKS-MM-ARCH               PIC 9(02).                      052370      
000855     03 WKS-DD-ARCH               PIC 9(02).                      052375      
000856                                                                  052380      
000857  01 WKS-HORA-MAQ.                                                052400      
000858     03 WKS-MAQ-HH                PIC 9(02).                      052450      
000859     03 WKS-MAQ-MM                PIC 9(02).                      052500      
000860     03 WKS-MAQ-SS                PIC 9(02).                      052550      
000861                                                                  052600      
000862 77 LOG-KEY                 PIC 9(08).                            053000      
000863                                                                  054000      
000864 01 WKS-EXTMOV.                                                   055000      
000865    03 WKS-ARCH-INTELAR.                                          055100      
000866      05 FILLER             PIC X(16) VALUE "(S151)S151/FILE/".   056000      
000867      05 FILLER             PIC X(14) VALUE "INTS/15110S01/".     058000      
000868      05 WKS-CSI            PIC 9(02).                            060000      
000869      05 FILLER             PIC X(07) VALUE "/EXTMOV".            061000      
000870      05 WKS-SIS            PIC 9(03).                            062000      
000871      05 FILLER             PIC X(01) VALUE "/".                  063000      
000872      05 WKS-FECHA          PIC 9(08).                            064000      
000873      05 FILLER             PIC X(01) VALUE "/".                  064100      
000874      05 WKS-HHMMSS         PIC 9(06).                            064200      
000875      05 FILLER             PIC X(13) VALUE "/CSV ON CMEMP".      065000      
000876    03 FILLER               PIC X(01) VALUE ".".                  066000      
000877 01 WKS-DET-EXTMOV.                                               067000      
000878    03 WKS-DET-SUC          PIC 9(04).                            068000      
000879    03 FILLER               PIC X(01) VALUE ",".                  069000      
000880    03 WKS-DET-CAJA         PIC 9(04).                            070000      
000881    03 FILLER               PIC X(01) VALUE ",".                  071000      
000882    03 WKS-DET-SPROM        PIC 9(04).                            072000      
000883    03 FILLER               PIC X(01) VALUE ",".                  073000      
000884    03 WKS-DET-CTO          PIC 9(12).                            074000      
000885    03 FILLER               PIC X(01) VALUE ",".                  074100      
000886    03 WKS-DET-SUCMDA       PIC 9(04).                            074200      
000887    03 FILLER               PIC X(01) VALUE ",".                  075000      
000888    03 WKS-DET-CTAMDA       PIC 9(16).                            076000      
000889    03 FILLER               PIC X(01) VALUE ",".                  077000      
000890    03 WKS-DET-AUTS500      PIC 9(08).                            078000      
000891    03 FILLER               PIC X(01) VALUE ",".                  079000      
000892    03 WKS-DET-CLAVE        PIC 9(04).                            080000      
000893    03 FILLER               PIC X(01) VALUE ",".                  081000      
000894    03 WKS-DET-IMPORTE      PIC 9(14).9(02).                      082000      
000895    03 FILLER               PIC X(01) VALUE ",".                  083000      
000896    03 WKS-DET-REFNUM       PIC 9(18).                            084000      
000897    03 FILLER               PIC X(01) VALUE ",".                  085000      
000898    03 WKS-DET-FECHA        PIC 9(08).                            086000      
000899    03 FILLER               PIC X(01) VALUE ",".                  087000      
000900    03 WKS-DET-HORA         PIC 9(06).                            088000      
000901    03 FILLER               PIC X(01) VALUE ",".                  088100      
000902    03 WKS-DET-NATS028      PIC 9(02).                            088200      
000903    03 FILLER               PIC X(01) VALUE ",".                  088300      
000904    03 WKS-DET-INDALFA      PIC 9(02).                            088400      
000905    03 FILLER               PIC X(01) VALUE ",".                  088500      
000906    03 WKS-DET-NATALFA      PIC 9(02).                            088600      
000907    03 FILLER               PIC X(01) VALUE ",".                  088605      
000908    03 WKS-DET-ORIGEN       PIC 9(02).                            088610      
000909    03 FILLER               PIC X(01) VALUE ",".                  088615      
000910    03 WKS-DET-SUCTRAN      PIC 9(04).                            088620      
000911    03 FILLER               PIC X(01) VALUE ",".                  088625      
000912    03 WKS-DET-SUCOPE       PIC 9(04).                            088630      
000913    03 FILLER               PIC X(01) VALUE ",".                  088635      
000914    03 WKS-DET-MON          PIC 9(04).                            088650      
000915    03 FILLER               PIC X(01) VALUE ",".                  088655      
000916    03 WKS-DET-FECMOV       PIC 9(08).                            088660      
000917    03 FILLER               PIC X(01) VALUE ",".                  088665      
000918    03 WKS-DET-HORMOV       PIC 9(06).                            088670      
000919    03 FILLER               PIC X(01) VALUE ",".                  088675      
000920    03 WKS-DET-AUTS151      PIC 9(08).                            088680      
000921    03 FILLER               PIC X(01) VALUE ",".                  088685      
000922    03 WKS-DET-PROD         PIC 9(04).                            088687      
000923    03 FILLER               PIC X(01) VALUE ",".                  088689      
000924    03 WKS-DET-INST         PIC 9(02).                            088691      
000925    03 FILLER               PIC X(01) VALUE ",".                  088692      
000926    03 WKS-DET-STATUS       PIC 9(02).                            088693      
000927                                                                  088700      
000928 01 WKS-ENCABEZADO.                                               089000      
000929    02 FILLER               PIC X(59) VALUE                       089100      
000930    "Suc,Caja,Suc Prom,Contrato,Suc mda,Cuenta,Autorizacion,Clav".089200      
000931    02 FILLER               PIC X(59) VALUE                       089300      
000932    "e,Importe,Ref numerica,Fecha,Hora,Nat 28,Ind ALFA,Nat ALFA,".089400      
000933    02 FILLER               PIC X(59) VALUE                       089500      
000934    "Orig,Suc Trans,Suc Ope,Moneda,Fecha,Hora,Aut 151,Prod,Inst,".089600      
000935    02 FILLER               PIC X(07) VALUE                       089700      
000936    "Estatus".                                                    089800      
000937                                                                  089900      
000938 01 WKS-LINEA-ERROR.                                              089920      
000939    03 FILLER               PIC X(30) VALUE SPACES.               089925      
000940    03 FILLER               PIC X(51) VALUE                       089930      
000941    "PARAMETROS INVALIDOS PARA LA GENERACION DEL ARCHIVO".        089940      
000942                                                                  089960      
000943 01 WKS-ETI-S151-MOVANT.                                          090000      
000944    02 FILLER               PIC X(14) VALUE                       091000      
000945    "S151/FILE/MOVS".                                             092000      
000946    02 WKS-S151-MOVSIS      PIC 9(03).                            093000      
000947    02 FILLER               PIC X(01) VALUE "/".                  094000      
000948    02 WKS-S151-FEMOV       PIC 9(06) VALUE ZERO.                 095000      
000949    02 FILLER               PIC X(04) VALUE " ON ".               096000      
000950    02 WKS-S151-PKMOV       PIC X(17).                            097000      
000951    02 FILLER               PIC X(01) VALUE ".".                  098000      
000952                                                                  099000      
000953 01 WKS-ETI-S151-DESANT.                                          100000      
000954    02 FILLER               PIC X(14) VALUE                       101000      
000955    "S151/FILE/DESS".                                             102000      
000956    02 WKS-S151-DESSIS      PIC 9(03).                            103000      
000957    02 FILLER               PIC X(01) VALUE "/".                  104000      
000958    02 WKS-S151-FEDES       PIC 9(06) VALUE ZERO.                 105000      
000959    02 FILLER               PIC X(04) VALUE " ON ".               106000      
000960    02 WKS-S151-PKDES       PIC X(17).                            107000      
000961    02 FILLER               PIC X(01) VALUE ".".                  108000      
000962                                                                  109000      
000963*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000964* COPY "S151/FORMATO/LLAMADO/MOVTOS.".                            110000      
000965                                                                  001000      
000966                                                                  002000      
000967                                                                  003000      
000968                                                                  004000      
000969******************************************************************005000      
000970*                                                                *006000      
000971*   FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS         *007000      
000972*   LOS SISTEMAS:                                                *008000      
000973*   - LONGITUD DEL REGISTRO 540 CARACTERES                       *009000      
000974*     - LONGITUD DE DATOS GENERALES   180 CARACTERES             *010000      
000975*     - LONGITUD DE DATOS ADICIONALES 360 CARACTERES             *011000      
000976*                                                                *012000      
000977******************************************************************013000      
000978                                                                  014000      
000979 01 WKS-MOV-DATOS WITH LOWER-BOUNDS.                              015000      
000980*01 WKS-MOV-DATOS.                                                015010      
000981    03 WKS-MOV-FUNCION                 PIC  9(02)      COMP.      016000      
000982    03 WKS-MOV-SISTEMA                 PIC  9(04)      COMP.      017000      
000983    03 WKS-MOV-PRODUCTO                PIC  9(04)      COMP.      018000      
000984    03 WKS-MOV-INSTRUMENTO             PIC  9(02)      COMP.      019000      
000985    03 WKS-MOV-SUCPROM                 PIC  9(04)      COMP.      020000      
000986    03 WKS-MOV-CONTRATO                PIC  9(16)      COMP.      021000      
000987                                                                  022000      
000988    03 WKS-TAB-CVEIMP                  OCCURS 5 TIMES.            023000      
000989       04 WKS-MOV-CVETRAN              PIC  9(04)      COMP.      024000      
000990       04 WKS-MOV-INDLEY               PIC  9(02)      COMP.      025000      
000991       04 WKS-MOV-ESQCON               PIC  9(04)      COMP.      026000      
000992       04 WKS-MOV-IMPORTE              PIC  9(14)V99   COMP.      027000      
000993                                                                  028000      
000994    03 WKS-MOV-FECMOV                  PIC  9(06)      COMP.      029000      
000995    03 WKS-MOV-HORMOV                  PIC  9(06)      COMP.      030000      
000996    03 WKS-MOV-FECCONT                 PIC  9(06)      COMP.      031000      
000997    03 WKS-MOV-FECCONT-R               REDEFINES WKS-MOV-FECCONT. 032000      
000998       04 WKS-MOV-FECCONT-AAMM         PIC  9(04)      COMP.      033000      
000999       04 WKS-MOV-FECCONT-DD           PIC  9(02)      COMP.      034000      
001000    03 WKS-MOV-FECVAL                  PIC  9(06)      COMP.      035000      
001001    03 WKS-MOV-AUTORIZA                PIC  9(08)      COMP.      036000      
001002    03 WKS-MOV-AUT3ER                  PIC  9(08)      COMP.      037000      
001003    03 WKS-MOV-REFNUM                  PIC  9(20)      COMP.      038000      
001004    03 WKS-MOV-REFNUM-S087             REDEFINES WKS-MOV-REFNUM.  038552      
001005       04 WKS-MOV-IND-EFEC             PIC  9(02)      COMP.      038554      
001006       04 FILLER                       PIC  X(01).                038555      
001007       04 WKS-MOV-PM                   PIC  9(02)      COMP.      038556      
001008       04 WKS-MOV-REF                  PIC  9(14)      COMP.      038558      
001009    03 WKS-MOV-REFNUM-S500             REDEFINES WKS-MOV-REFNUM.  038600      
001010       04 WKS-MOV-CHVV                 PIC  9(04)      COMP.      038610      
001011       04 WKS-MOV-REFERENCIA           PIC  9(16)      COMP.      038620      
001012    03 WKS-MOV-REFNUM-S404             REDEFINES WKS-MOV-REFNUM.  038670      
001013       04 WKS-MOV-IND-EFECTIVO         PIC  9(02)      COMP.      038720      
001014       04 WKS-MOV-ZEROS                PIC  9(12)      COMP.      038770      
001015       04 WKS-MOV-REF-S404             PIC  9(06)      COMP.      038820      
001016    03 WKS-MOV-REFNUM-S701             REDEFINES WKS-MOV-REFNUM.  038840      
001017       04 FILLER                       PIC  X(03).                038860      
001018       04 WKS-MOV-IND-EFE701           PIC  9(02)      COMP.      038880      
001019       04 WKS-MOV-REF-S701             PIC  9(12)      COMP.      038900      
001020    03 WKS-MOV-CVEMDA                  PIC  9(02)      COMP.      039000      
001021    03 WKS-MOV-NUMMDA                  PIC  9(20)      COMP.      040000      
001022    03 WKS-MOV-NUMMDA-R                REDEFINES WKS-MOV-NUMMDA.  041000      
001023       05 WKS-MOV-MDA-SUC              PIC  9(04)      COMP.      042000      
001024       05 WKS-MOV-MDA-CTA              PIC  9(16)      COMP.      043000      
001025    03 WKS-MOV-CVEMDE                  PIC  9(02)      COMP.      044000      
001026    03 WKS-MOV-SUC-INIC                PIC  9(04)      COMP.      045000      
001027    03 WKS-MOV-CAJA-INIC               PIC  9(02)      COMP.      046000      
001028    03 WKS-MOV-SUCOPER                 PIC  9(04)      COMP.      047000      
001029    03 WKS-MOV-CAJAOPER                PIC  9(02)      COMP.      048000      
001030    03 WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.      049000      
001031    03 WKS-MOV-CAJATRAN                PIC  9(02)      COMP.      050000      
001032    03 WKS-MOV-NOMINA-OPE              PIC  9(08)      COMP.      051000      
001033    03 WKS-MOV-ORIGEN                  PIC  9(02)      COMP.      052000      
001034    03 WKS-MOV-MONEDA                  PIC  9(04)      COMP.      053000      
001035    03 WKS-MOV-AUT-S151                PIC  9(08)      COMP.      054000      
001036    03 WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.      055000      
001037    03 WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.      056000      
001038    03 WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.      057000      
001039    03 WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.      058000      
001040    03 WKS-MOV-CVEAVISO                PIC  9(04)      COMP.      059000      
001041    03 WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.      060000      
001042    03 WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.      061000      
001043    03 WKS-MOV-IND-CONTA               PIC  9(02)      COMP.      062000      
001044    03 WKS-MOV-FEC-ULTMOV              PIC  9(08)      COMP.      062100      
001045    03 WKS-MOV-FEC-ULTMOV-R REDEFINES WKS-MOV-FEC-ULTMOV.         062200      
001046       05 WKS-MOV-IND-NUMREN           PIC  9(02)      COMP.      063000      
001047       05 WKS-MOV-ACTIVIDAD            PIC  9(06)      COMP.      064000      
001048    03 WKS-MOV-SECTOR                  PIC  9(02)      COMP.      065000      
001049    03 WKS-MOV-BANCA                   PIC  9(02)      COMP.      066000      
001050    03 WKS-MOV-FIL-FUTURO              PIC  X(10).                067000      
001051    03 WKS-MOV-REDEF-S264 REDEFINES WKS-MOV-FIL-FUTURO.           067010      
001052       05 FILLER                       PIC  X(03).                067030      
001053       05 WKS-BCO-S264                 PIC  9(06) COMP.           067050      
001054       05 FILLER                       PIC  X(01).                067060      
001055       05 WKS-MOV-BORI-S264            PIC  9(03) COMP.           067070      
001056       05 WKS-MOV-BDES-S264            PIC  9(03) COMP.           067090      
001057    03 WKS-MOV-REDEF-S087 REDEFINES WKS-MOV-FIL-FUTURO.           067100      
001058       05 FILLER                       PIC  X(03).                067150      
001059       05 WKS-MOV-CLIENTE              PIC  9(14)      COMP.      067200      
001060       05 WKS-MOV-REDEF-S701 REDEFINES WKS-MOV-CLIENTE.           067400      
001061          07 FILLER                    PIC  X(03).                067450      
001062          07 WKS-MOV-CTE-701           PIC  9(08)      COMP.      067500      
001063       05 WKS-MOV-REDEF-087 REDEFINES WKS-MOV-CLIENTE.            067512      
001064          07 WKS-MOV-FEC-VEN           PIC  9(06)      COMP.      067514      
001065          07 WKS-MOV-SUFIJO            PIC  9(04)      COMP.      067516      
001066          07 FILLER                    PIC  X(02).                067518      
001067    03 WKS-MOV-REDEF-S500 REDEFINES WKS-MOV-FIL-FUTURO.           067520      
001068       05 FILLER                       PIC  X(03).                067540      
001069       05 WKS-MOV-S015                 PIC  9(06) COMP.           067560      
001070       05 FILLER                       PIC  X(01).                067570      
001071       05 WKS-MOV-BCO-ORI              PIC  9(03) COMP.           067580      
001072       05 WKS-MOV-BCO-DES              PIC  9(03) COMP.           067600      
001073    03 WKS-MOV-REDEF-S501 REDEFINES WKS-MOV-FIL-FUTURO.           067620      
001074       05 FILLER                       PIC  X(03).                067640      
001075       05 WKS-MOV-CAJA-S501            PIC  9(04)      COMP.      067660      
001076       05 FILLER                       PIC  X(05).                067680      
001077    03 WKS-MOV-REDEF-S403 REDEFINES WKS-MOV-FIL-FUTURO.           067700      
001078       05 FILLER                       PIC  X(03).                067720      
001079       05 WKS-MOV-FOLIO-S403           PIC  9(04)       COMP.     067740      
001080       05 WKS-MOV-RENGLON-S403         PIC  9(02)       COMP.     067760      
001081       05 WKS-MOV-SCVECON-S403         PIC  9(04)       COMP.     067780      
001082       05 FILLER                       PIC  X(02).                067800      
001083    03 WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.      068000      
001084    03 WKS-MOV-APU-DESC                PIC  9(08)      COMP.      069000      
001085    03 WKS-MOV-STATUS                  PIC  9(02)      COMP.      070000      
001086                                                                  071000      
001087    03 WKS-MOV-DATOS-ADIC              PIC  X(354).               072000      
001088    03 WKS-MOV-MOV-DATOS-ADIC-R   REDEFINES WKS-MOV-DATOS-ADIC.   073000      
001089       05 WKS-MOV-NOMINA-FUN1          PIC  9(08)      COMP.      074000      
001090       05 WKS-MOV-NOMINA-FUN2          PIC  9(08)      COMP.      075000      
001091       05 WKS-MOV-SIST-ORIG            PIC  9(04)      COMP.      076000      
001092       05 WKS-MOV-PROD-ORIG            PIC  9(04)      COMP.      077000      
001093       05 WKS-MOV-INST-ORIG            PIC  9(02)      COMP.      078000      
001094       05 WKS-MOV-CVECON-YREFLOC       PIC  X(26).                078100      
001095       05 WKS-MOV-CVECON-Y-REF   REDEFINES WKS-MOV-CVECON-YREFLOC.078200      
001096          06 WKS-MOV-CVETR-ORIG        PIC  9(04)      COMP.      079000      
001097          06 WKS-MOV-CONT-ORIG         PIC  9(20)      COMP.      080000      
001098          06 WKS-MOV-REFLOC-BNM        PIC  X(14).                081000      
001099          06 WKS-MOV-REFLOC-OC         REDEFINES                  081100      
001100             WKS-MOV-REFLOC-BNM.                                  081200      
001101             07 WKS-MOV-REFLOC-PZA     PIC  9(03)      COMP.      081300      
001102             07 WKS-MOV-REFLOC-SUC     PIC  9(03)      COMP.      081400      
001103             07 WKS-MOV-REFLOC-TERM    PIC  X(04).                081500      
001104             07 WKS-MOV-REFLOC-AUT     PIC  9(06)      COMP.      081600      
001105             07 WKS-MOV-REFLOC-VF      PIC  9(01)      COMP.      081700      
001106             07 WKS-MOV-REFLOC-TCHQ    PIC  9(01)      COMP.      081800      
001107             07 FILLER                 PIC  X(03).                081900      
001108       05 WKS-MOV-CONTYREFLOC    REDEFINES WKS-MOV-CVECON-YREFLOC.081910      
001109          06 WKS-MOV-PRODGEN           PIC  9(03)      COMP.      081920      
001110          06 WKS-MOV-SUBPRODGEN        PIC  9(03)      COMP.      081930      
001111          06 WKS-MOV-CRE-FOLIO         PIC  9(04)      COMP.      081940      
001112          06 WKS-MOV-CONSECUTIVO       OCCURS 5 TIMES.            081950      
001113             07 WKS-MOV-CONSEC         PIC  9(08)      COMP.      081960      
001114          06 WKS-MOV-MON-CONSTRUC      PIC  9(02)      COMP.      081970      
001115       05 WKS-MOV-FILLERXAPLI          PIC  X(96).                082000      
001116                                                                  083000      
001117       05 WKS-MOV-REDS084          REDEFINES WKS-MOV-FILLERXAPLI. 083100      
001118          06 WKS-MOV-SUCEJE            PIC 9(04)       COMP.      083200      
001119          06 WKS-MOV-CTAEJE            PIC 9(12)       COMP.      083300      
001120          06 WKS-MOV-MENSUALIDAD       PIC 9(04)       COMP.      083350      
001121          06 WKS-MOV-ASESOR            PIC 9(02)       COMP.      083370      
001122          06 WKS-MOV-FILS084           PIC X(85).                 083400      
001123                                                                  083500      
001124       05 WKS-MOV-REDS087          REDEFINES WKS-MOV-FILLERXAPLI. 084000      
001125          06 WKS-MOV-PZO               PIC 9(04)       COMP.      085000      
001126          06 WKS-MOV-EMISION           PIC 9(08)       COMP.      086000      
001127          06 WKS-MOV-FILS087           PIC X(90).                 087000      
001128                                                                  088000      
001129       05 WKS-MOV-REDS408          REDEFINES WKS-MOV-FILLERXAPLI. 089000      
001130          06 WKS-MOV-FOLIO             PIC  9(04)      COMP.      090000      
001131          06 WKS-MOV-NUMLIN            PIC  9(04)      COMP.      091000      
001132          06 WKS-MOV-TASA-S408         PIC  9(4)V9(4)  COMP.      091200      
001133          06 WKS-MOV-FINI-S408         PIC  9(08)      COMP.      091300      
001134          06 WKS-MOV-FFIN-S408         PIC  9(08)      COMP.      091400      
001135          06 WKS-MOV-IMPORTE-S408      PIC  9(12)V99   COMP.      091500      
001136          06 WKS-MOV-FILS408           PIC  X(73).                092000      
001137                                                                  093000      
001138       05 WKS-MOV-REDS500          REDEFINES WKS-MOV-FILLERXAPLI. 094000      
001139          06 WKS-MOV-CVECAUSA          PIC  9(04)      COMP.      095000      
001140          06 WKS-MOV-FECDEV            PIC  9(06)      COMP.      096000      
001141          06 WKS-MOV-BCO               PIC  9(04)      COMP.      097000      
001142          06 WKS-MOV-NOMORD            PIC  X(30).                098000      
001143          06 WKS-MOV-CAUSAORD          PIC  X(50).                099000      
001144          06 WKS-MOV-SUCORD            PIC  9(04)      COMP.      100000      
001145          06 WKS-MOV-FILS500           PIC  X(07).                101000      
001146                                                                  102000      
001147       05 WKS-MOV-REDS403           REDEFINES WKS-MOV-FILLERXAPLI.102050      
001148          06 WKS-MOV-OPCION         PIC  9(02)    COMP.           102100      
001149          06 WKS-MOV-FECCOTI        PIC  9(06)    COMP.           102150      
001150          06 WKS-MOV-FIDEICO        PIC  9(06)    COMP.           102200      
001151          06 WKS-MOV-IMPVAL         PIC  9(14)V99 COMP.           102250      
001152          06 WKS-MOV-SUCADIC        PIC  9(04)    COMP.           102300      
001153          06 WKS-MOV-CAJAADIC       PIC  9(02)    COMP.           102350      
001154          06 WKS-MOV-PROGRAMA       PIC  9(04)    COMP.           102400      
001155          06 WKS-MOV-PLAZO          PIC  9(04)    COMP.           102450      
001156          06 WKS-MOV-TIPOPLAZO      PIC  9(02)    COMP.           102500      
001157          06 WKS-MOV-TASAREF        PIC  9(04)V99 COMP.           102550      
001158          06 WKS-MOV-TASAREAL       PIC  9(04)V99 COMP.           102600      
001159          06 WKS-MOV-CTE            PIC  9(12)    COMP.           102650      
001160          06 WKS-VALUDI-PRODNAT     REDEFINES WKS-MOV-CTE.        102660      
001161             07 WKS-MOV-VAL-UDI     PIC  9(02)V9(06) COMP.        102670      
001162             07 WKS-MOV-PRODUCTONAT PIC  9(04)    COMP.           102680      
001163          06 WKS-MOV-CRE-CAUSACV    PIC  9(02)    COMP.           102700      
001164          06 WKS-PAG-NUMPAGOS       OCCURS 5 TIMES.               102702      
001165             07 WKS-PAG-PAGNUM      PIC 9(04)     COMP.           102704      
001166          06 WKS-CRE-STA            OCCURS 5 TIMES.               102708      
001167             07 WKS-CRE-STATUS      PIC 9(02)     COMP.           102710      
001168          06 WKS-CRE-FAS            OCCURS 5 TIMES.               102712      
001169             07 WKS-CRE-FASE        PIC 9(02)     COMP.           102714      
001170          06 WKS-PAG-ESTATUS        OCCURS 5 TIMES.               102716      
001171             07 WKS-PAG-STATUS      PIC 9(02)     COMP.           102718      
001172          06 WKS-PAG-ESTATUS-MEN    OCCURS 5 TIMES.               102720      
001173             07 WKS-PAG-STAVEN      PIC 9(02)     COMP.           102722      
001174          06 WKS-MOV-ESTATUS-CARVEN OCCURS 5 TIMES.               102724      
001175             07 WKS-PAG-STACARVEN   PIC 9(02)     COMP.           102726      
001176          06 WKS-MOV-CONCEPTOS      OCCURS 5 TIMES.               102728      
001177             07 WKS-MOV-CONCEPTO    PIC 9(04)     COMP.           102730      
001178          06 WKS-MOV-TIPMOV         OCCURS 5 TIMES.               102732      
001179             07 WKS-MOV-TM          PIC 9(02)     COMP.           102734      
001180          06 WKS-MOV-MOVIMIENTOS    OCCURS 5 TIMES.               102736      
001181             07 WKS-MOV-MOVIMIENTO  PIC 9(04)     COMP.           102738      
001182                                                                  102750      
001183       05 WKS-MOV-REDS701          REDEFINES WKS-MOV-FILLERXAPLI. 103000      
001184          06 WKS-MOV-DATOS-S701        PIC  X(95).                104000      
001185          06 MOV-MOV-PAG-SERV      REDEFINES WKS-MOV-DATOS-S701.  105000      
001186             07 WKS-MOV-S701-ID        PIC  X(30).                106000      
001187             07 WKS-MOV-S701-FCHREC    PIC  9(06).                107000      
001188             07 WKS-MOV-S701-REF1      PIC  X(20).                108000      
001189             07 WKS-MOV-S701-REF2      PIC  X(20).                109000      
001190             07 WKS-MOV-S701-TIPPAG    PIC  9(06).                110000      
001191             07 WKS-MOV-S701-TIPPAG-R  REDEFINES                  111000      
001192                WKS-MOV-S701-TIPPAG.                              112000      
001193                08 WKS-MOV-S701-ESTAB  PIC  9(04).                113000      
001194                08 WKS-MOV-S701-SEQ    PIC  9(02).                114000      
001195             07 WKS-MOV-S701-AUT       PIC  9(08).                114050      
001196             07 WKS-MOV-S701-FPAGO     PIC  9(02).                114100      
001197             07 WKS-MOV-S701-EBPP      PIC  9(03).                114200      
001198          06 WKS-MOV-PAG-IMPT       REDEFINES WKS-MOV-DATOS-S701. 115000      
001199             07 WKS-MOV-S701-RFC       PIC  X(13).                116000      
001200             07 WKS-MOV-S701-FORMULARI PIC  X(10).                117000      
001201             07 FILLER                 PIC  X(72).                118000      
001202          06 WKS-MOV-FILS701           PIC  X(01).                119000      
001203       05 WKS-MOV-LEYENDAS             PIC  X(200).               119100      
001204       05 WKS-MOV-LEYENDAS-R           REDEFINES WKS-MOV-LEYENDAS.119200      
001205          06 WKS-MOV-LEY1              PIC  X(40).                120000      
001206          06 WKS-MOV-LEY2              PIC  X(40).                121000      
001207          06 WKS-MOV-LEY3              PIC  X(40).                122000      
001208          06 WKS-MOV-LEY4              PIC  X(40).                123000      
001209          06 WKS-MOV-LEY5              PIC  X(40).                124000      
001210       05 WKS-MOV-LEYENDAS-R1          REDEFINES WKS-MOV-LEYENDAS.124100      
001211          06 WKS-MOV-ELEM-LEY          OCCURS 5 TIMES.            124200      
001212             07 WKS-MOV-LEY            PIC  X(40).                124300      
001213             07 WKS-MOV-LEY-R          REDEFINES WKS-MOV-LEY.     124400      
001214                08 WKS-MOV-CHQEXE      PIC  9(10).                124500      
001215                08 WKS-MOV-CHQGIR      PIC  9(10).                124600      
001216                08 WKS-MOV-FILL        PIC  X(20).                124700      
001217       05 WKS-MOV-PRODUCTO-S016        PIC  9(04) COMP.           124800      
001218       05 WKS-MOV-INSTRUMENTO-S016     PIC  9(04) COMP.           124900      
001219       05 FILLER                       PIC  X(15).                125000      
001220    03 WKS-MOV-NUM-CTE                 PIC  9(12) COMP.           125500      
001221                                                                  126000      
001222******************************************************************127000      
001223* DATOS REQUERIDOS PARA:                                          128000      
001224*                                                                 129000      
001225* INICIO, FIN Y ELIMINACION DE PROCESO:                           130000      
001226*    WKS-MOV-FUNCION                                              131000      
001227*    WKS-MOV-SISTEMA                                              132000      
001228*    WKS-MOV-TIPO-PROC                                            133000      
001229*    WKS-MOV-FECCONT                                              134000      
001230*                                                                 135000      
001231*                                                                 136000      
001232* ELIMINACION A PARTIR DE UNA AUTORIZACION DEL S151               137000      
001233*    WKS-MOV-FUNCION                                              138000      
001234*    WKS-MOV-SISTEMA                                              139000      
001235*    WKS-MOV-FECCONT                                              140000      
001236*    WKS-MOV-AUT-AELIM-S151                                       141000      
001237*    NUMERO DE AUTORIZACION INICIAL A ELIMINAR                    142000      
001238*    WKS-MOV-AUT-ANT-S151                                         143000      
001239*    NUMERO DE AUTORIZACION FINAL   A ELIMINAR                    144000      
001240*    (SI ESTE CAMPO ES IGUAL A CEROS LA ELIMINACION ES DESDE EL   145000      
001241*     AUTORIZACION INICIAL A ELIMINAR HASTA EL FIN DE ARCHIVO)    146000      
001242*                                                                 147000      
001243******************************************************************148000      
001244*    MOVE "S151L002R" TO WKS-LIBID-NOMB.                          148050      
001245*    ACCEPT LOG-SISTEMA                                           148100      
001246*    MOVE LOG-SISTEMA TO WKS-LIBID-SIST.                          148150      
001247*    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           148200      
001248*                                     WKS-CTLVER-NOMLIB           148250      
001249*                              GIVING W77-CTLVER-RSLT.            148300      
001250*    IF W77-CTLVER-RSLT = 0                                       148350      
001251*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148400      
001252*                                 WKS-CTLVER-NOMLIB               148450      
001253*    ELSE                                                         148500      
001254*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148550      
001255*       "(S151)S151/OBJECT/L002/REGISTRASNNN/01MTP00  ON CMEMP.". 148600      
001256*                                                                 148650      
001257*                                                                 148700      
001258*    CALL "CARGAMOV1 IN LIB-REGISTRA"  USING LOG-DATOS            149000      
001259*                               GIVING WS-151-RESULT              150000      
001260*                                                                 151000      
001261                                                                  152000      
001262                                                                  153000      
001263                                                                  154000      
001264                                                                  155000      
001265                                                                  156000      
001266*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001267                                                                  111000      
001268***************************************************************** 112000      
001269**           PARAMETROS PARA LIBRERIA CLTVERS                  ** 113000      
001270***************************************************************** 114000      
001271*                                                                 115000      
001272 01 WKS-CTLVER-NUMREG              PIC 9(02).                     116000      
001273 01 WKS-CTLVER-LIBID               PIC X(12).                     117000      
001274 01 WKS-CTLVER-NOMLIB              PIC X(72).                     118000      
001275 77 W77-CTLVER-RSLT                PIC S9(11) BINARY.             119000      
001276 77 W77-IND                        PIC 9(05).                     120000      
001277 77 W77-FIN                        PIC 9(02)  COMP VALUE ZEROS.   121000      
001278 77 W77-EOF                        PIC 9(02).                     121100      
001279 77 W77-RES-LIBREG                 PIC S9(11) BINARY.             122000      
001280 77 W77-REG-CALL                   PIC 9(06)  VALUE ZEROS.        123000      
001281 77 W77-IMP-CALL                   PIC 9(14)V99 VALUE ZEROS.      124000      
001282                                                                  125000      
001283*==========================================================       126000      
001284*         VARIABLES LIBRERIA SOPORTECOMS                  =       127000      
001285*==========================================================       128000      
001286                                                                  129000      
001287 01  WKS-SOPCOMS.                                                 130000      
001288     03 WKS-NUMCSI                 PIC 9(02).                     131000      
001289     03 WKS-NOMEQUIPO              PIC X(10).                     132000      
001290     03 WKS-NOMCSI                 PIC X(26).                     133000      
001291     03 WKS-LINEA-BATCH            PIC X(05).                     134000      
001292                                                                  135000      
001293*==========================================================       136000      
001294*         VARIABLES LIBRERIA DE DESPLIEGE                 =       137000      
001295*==========================================================       138000      
001296                                                                  139000      
001297*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001298* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           140000      
001299**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001300  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001301  01 MENSAJE-LJ.                                                  100300      
001302     02 SISTEMA-LJ     PIC X(04).                                 100400      
001303     02 FILLER         PIC X VALUE "/".                           100500      
001304     02 PASO-LJ        PIC X(04).                                 100600      
001305     02 FILLER         PIC X VALUE "/".                           100700      
001306     02 MTP-LJ         PIC 9(03).                                 100800      
001307     02 FILLER         PIC X VALUE ":".                           100900      
001308     02 TIPO-LJ        PIC X.                                     101000      
001309     02 FILLER         PIC X VALUE ">".                           101100      
001310     02 CODIGO-LJ      PIC 9(06).                                 101200      
001311     02 FILLER         PIC X VALUE "<".                           101300      
001312     02 TEXTO-LJ       PIC X(250).                                101400      
001313*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001314                                                                  141000      
001315*==========================================================       142000      
001316*         VARIABLES LIBRERIA DE CONTROL                   =       143000      
001317*==========================================================       144000      
001318*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001319* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  145000      
001320*================================================================ 000100      
001321*         ENTRY-POINT CONSISDIA :                               = 000200      
001322*                                                                 000300      
001323* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001324* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001325* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001326* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001327* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001328* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001329* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001330* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001331* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001332* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001333*                                                               = 001400      
001334*================================================================ 001500      
001335                                                                  001600      
001336                                                                  001700      
001337*================================================================ 001800      
001338* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001339*                                                               = 002000      
001340* ENTRADA REQUERIDA :                                           = 002100      
001341*                                                               = 002200      
001342*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001343*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001344*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001345*================================================================ 002600      
001346 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001347    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001348    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001349    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001350    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001351    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001352    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001353    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001354    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001355    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001356    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001357    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001358    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001359    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001360    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001361    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001362    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001363    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001364    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001365    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001366    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001367       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001368       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001369       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001370       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001371*==============================================================   005200      
001372*                                                             =   005300      
001373* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001374*                                                             =   005500      
001375* CAMPOS REQUERIDOS :                                         =   005600      
001376*                                                             =   005700      
001377* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001378* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001379* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001380* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001381*==============================================================   006200      
001382 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001383    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001384    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001385    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001386    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001387                                                                  006800      
001388*==============================================================   006900      
001389*                                                             =   007000      
001390* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001391*                                                             =   007200      
001392* CAMPOS REQUERIDOS :                                         =   007300      
001393*                                                             =   007400      
001394* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001395* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001396* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001397* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001398*==============================================================   007900      
001399 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001400    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001401    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001402    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001403    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001404                                                                  008500      
001405*==============================================================   008600      
001406*                                                             =   008700      
001407* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001408*                                                             =   008900      
001409* CAMPOS REQUERIDOS :                                         =   009000      
001410*                                                             =   009100      
001411* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001412* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001413* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001414* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001415*==============================================================   009600      
001416 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001417    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001418    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001419    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001420    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001421                                                                  010200      
001422*============================================================     010300      
001423* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001424*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001425*                                                           =     010600      
001426*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001427*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001428*                                                           =     010900      
001429*  ENTRADA REQUERIDA.                                       =     011000      
001430*                                                           =     011100      
001431*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001432*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001433*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001434*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001435*============================================================     011600      
001436                                                                  011700      
001437 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001438     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001439     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001440     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001441     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001442                                                                  012300      
001443*=============================================================    012400      
001444*                                                            =    012500      
001445* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001446*             B01-SIS-FECARMOV.                              =    012700      
001447*                                                            =    012800      
001448* ENTRADA REQUERIDAD :                                       =    012900      
001449*                                                            =    013000      
001450*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001451*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001452*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001453*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001454*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001455*=============================================================    013600      
001456                                                                  013700      
001457 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001458     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001459     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001460     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001461     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001462     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001463*================================================================ 014400      
001464*                                                               = 014500      
001465* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001466*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001467*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001468*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001469*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001470*                                                               = 015100      
001471* ENTRADA REQUERIDA :                                           = 015200      
001472*                                                               = 015300      
001473* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001474* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001475* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001476* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001477* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001478*================================================================ 015900      
001479 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001480    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001481    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001482    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001483    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001484    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001485                                                                  016600      
001486*============================================================     016700      
001487*                                                           =     016800      
001488* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001489*                                                           =     017000      
001490* DATOS REQUERIDOS :                                        =     017100      
001491*                                                           =     017200      
001492* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001493* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001494* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001495* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001496* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001497*============================================================     017800      
001498                                                                  017900      
001499 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001500     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001501     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001502     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001503     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001504     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001505                                                                  018600      
001506*============================================================     018700      
001507*                                                           =     018800      
001508* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001509*                                                           =     019000      
001510* DATOS REQUERIDOS :                                        =     019100      
001511*                                                           =     019200      
001512* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001513* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001514* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001515* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001516* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001517*============================================================     019800      
001518                                                                  019900      
001519 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001520     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001521     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001522     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001523     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001524     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001525                                                                  020600      
001526*===============================================================  020700      
001527*                                                              =  020800      
001528* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001529*              MOVIMIENTOS.                                    =  021000      
001530* DATOS REQUERIDOS :                                           =  021100      
001531*                                                              =  021200      
001532* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001533* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001534* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001535* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001536* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001537* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001538*==============================================================   021900      
001539                                                                  022000      
001540 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001541     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001542     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001543     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001544     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001545     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001546     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001547*==============================================================   022800      
001548*                                                             =   022900      
001549* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001550*                                                             =   023100      
001551* CAMPOS REQUERIDOS :                                         =   023200      
001552*                                                             =   023300      
001553* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001554* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001555* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001556* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001557*==============================================================   023800      
001558 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001559    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001560    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001561    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001562    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001563                                                                  024304      
001564*=================================================================024306      
001565*                ENTRY POINT CONSISB01                           =024308      
001566*                                                                =024310      
001567*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001568*                                                                =024314      
001569*  FUNCIONES DISPONIBLES :                                       =024316      
001570*                                                                =024318      
001571*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001572*                                                                =024322      
001573*  PARAMETROS REQUERIDOS                                         =024324      
001574*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001575*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001576*=================================================================024330      
001577                                                                  024332      
001578 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001579     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001580     03 WKS-CON-CSI                PIC 9(02).                     024336      
001581     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001582     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001583        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001584        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001585        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001586        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001587        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001588                                                                  024400      
001589*=================================================================024500      
001590*                ENTRY POINT B02ARCINTER                         =024600      
001591*                                                                =024700      
001592*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001593*                                                                =024900      
001594*  FUNCIONES DISPONIBLES :                                       =025000      
001595*                                                                =025100      
001596*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001597* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001598* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001599* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001600*                                                                =025600      
001601*  PARAMETROS REQUERIDOS                                         =025700      
001602*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001603*                                                                =025900      
001604*=================================================================026000      
001605 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001606     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001607     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001608     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001609     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001610     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001611     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001612     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001613     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001614     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001615     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001616     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001617     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001618     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001619     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001620     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001621     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001622     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001623     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001624     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001625     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001626     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001627     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001628     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001629     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001630     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001631     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001632     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001633     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001634                                                                  029000      
001635*=================================================================029100      
001636*                ENTRY POINT B04SISTEMA                          =029200      
001637*                                                                =029300      
001638*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001639*                                                                =029500      
001640*  FUNCIONES DISPONIBLES :                                       =029600      
001641*                                                                =029700      
001642*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001643*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001644*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001645*                                                                =030100      
001646*  PARAMETROS REQUERIDOS                                         =030200      
001647*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001648*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001649*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001650*                                                                =030600      
001651*=================================================================030700      
001652 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001653     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001654     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001655     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001656     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001657     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001658     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001659     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001660                                                                  031600      
001661*================================================================ 031700      
001662*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001663*                                                               = 031900      
001664*  FUNCION                                                      = 032000      
001665*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001666*   19       ALTAS.                                             = 032200      
001667*   22       BAJAS                                              = 032300      
001668*   37       CAMBIOS.                                           = 032400      
001669*                                                               = 032500      
001670*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001671*                      FECHA DE PROCESO                         = 032700      
001672*                      NUMERO DE PROCESO                        = 032800      
001673*                      FECHA INICIO                             = 032900      
001674*                      REGISTRO INICIAL                         = 033000      
001675*================================================================ 033100      
001676                                                                  033200      
001677 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001678     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001679     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001680     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001681     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001682     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001683     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001684     03 WKS-B05-MIX                PIC 9(08).                     034000      
001685     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001686     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001687     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001688     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001689     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001690     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001691                                                                  034700      
001692                                                                  034800      
001693*================================================================ 034900      
001694*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001695*                                                               = 035100      
001696*  FUNCION                                                      = 035200      
001697*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001698*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001699*                                                               = 035500      
001700*================================================================ 035600      
001701                                                                  035700      
001702 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001703     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001704     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001705     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001706     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001707     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001708     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001709                                                                  036500      
001710*===============================================================  036600      
001711*                                                              =  036700      
001712*         ENTRY-POINT CONSISMEN                                =  036800      
001713*                                                              =  036900      
001714*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001715*                      SISTEMA                                 =  037100      
001716*                                                              =  037200      
001717*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001718*                                                              =  037400      
001719*===============================================================  037500      
001720 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001721     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001722     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001723     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001724     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001725     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001726     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001727     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001728     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001729     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001730     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001731     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001732     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001733     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001734     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001735     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001736        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001737        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001738        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001739        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001740        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001741        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001742        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001743                                                                  039900      
001744*=====================================================            040000      
001745*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001746*=====================================================            040200      
001747 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001748     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001749     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001750     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001751                                                                  040700      
001752*=====================================================            040800      
001753*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001754*=====================================================            041000      
001755 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001756     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001757     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001758     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001759                                                                  041500      
001760*=====================================================            041600      
001761*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001762*=====================================================            041800      
001763 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001764     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001765     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001766     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001767*=====================================================            042300      
001768*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001769*=====================================================            042500      
001770 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001771     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001772     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001773     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001774                                                                  043000      
001775*=====================================================            043100      
001776*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001777*=====================================================            043300      
001778 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001779     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001780     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001781     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001782                                                                  043800      
001783*=====================================================            043900      
001784*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001785*=====================================================            044100      
001786 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001787     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001788     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001789     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001790                                                                  044600      
001791*=====================================================            044700      
001792*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001793*=====================================================            044900      
001794 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001795     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001796     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001797     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001798                                                                  045400      
001799*=====================================================            045500      
001800*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001801*=====================================================            045700      
001802 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001803     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001804     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001805     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001806                                                                  046200      
001807*=====================================================            046300      
001808*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001809*=====================================================            046500      
001810 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001811     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001812     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001813     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001814                                                                  047000      
001815*=====================================================            047100      
001816*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001817*=====================================================            047300      
001818 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001819     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001820     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001821     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001822                                                                  047800      
001823*=====================================================            047900      
001824*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001825*=====================================================            048100      
001826 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001827     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001828     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001829     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001830                                                                  048600      
001831*=====================================================            048700      
001832*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001833*=====================================================            048900      
001834 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001835     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001836     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001837     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001838                                                                  049400      
001839*=====================================================            049500      
001840*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001841*=====================================================            049700      
001842 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001843     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001844     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001845     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001846     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001847     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001848     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001849     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001850     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001851     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001852     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001853                                                                  050900      
001854*=====================================================            051000      
001855*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001856*=====================================================            051200      
001857 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001858     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001859     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001860     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001861     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001862                                                                  051800      
001863*=====================================================            051900      
001864*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001865*=====================================================            052100      
001866 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001867     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001868     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001869     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001870     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001871                                                                  052700      
001872*=====================================================            052800      
001873*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001874*=====================================================            053000      
001875 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001876     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001877     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001878     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001879     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001880                                                                  053600      
001881*=====================================================            053700      
001882*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001883*=====================================================            053900      
001884 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001885     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001886     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001887     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001888     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001889                                                                  054500      
001890*=====================================================            054600      
001891*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001892*=====================================================            054800      
001893 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001894     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001895     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001896     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001897     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001898                                                                  055400      
001899*=====================================================            055500      
001900*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001901*=====================================================            055700      
001902 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001903     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001904     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001905     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001906     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001907                                                                  056300      
001908*=====================================================            056400      
001909*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001910*=====================================================            056600      
001911 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001912     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001913     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001914     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001915     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001916                                                                  057200      
001917 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001918*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001919                                                                  146000      
001920*==========================================================       147000      
001921*         VARIABLES LIBRERIA CONTROL DE VERSIONES         =       148000      
001922*==========================================================       149000      
001923 01  WKS-LIBID                     PIC X(12).                     150000      
001924 01  WKS-NOMLIB                    PIC X(72).                     151000      
001925 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             152000      
001926 77  W77-NUMSIS                    PIC 9(04).                     153000      
001927 77  W77-FUN-CTL                   PIC 9(02).                     154000      
001928 77  W77-ERROR                     PIC 9(02).                     155000      
001929***************************************************************** 155020      
001930*          CATALOGOS PARAMETRICOS  S080                         * 155040      
001931***************************************************************** 155060      
001932 77 S080-CP-SISTEMA                PIC S9(11) BINARY.             155080      
001933 77 S080-CP-PROGRAMA               PIC S9(11) BINARY.             155100      
001934 77 S080-CP-RESULT                 PIC S9(11) BINARY.             155120      
001935 01 S080-CP-PARAMETRO-ENT.                                        155140      
001936    02 S080-CPPE-CATALOGO          PIC 9(06) COMP.                155160      
001937    02 S080-CPPE-CLAVE             PIC 9(02) COMP.                155180      
001938    02 S080-CPPE-ORDEN-BUSQ        PIC 9(02) COMP.                155200      
001939    02 S080-CPPE-REGISTROS         PIC 9(02) COMP.                155220      
001940    02 S080-CPPE-LLAVE1            PIC 9(12).                     155240      
001941    02 S080-CPPE-LLAVE2            PIC 9(12).                     155260      
001942    02 S080-CPPE-LLAVE2-A REDEFINES S080-CPPE-LLAVE2  PIC X(12).  155280      
001943    02 S080-CPPE-LLAVE3            PIC X(12).                     155300      
001944    02 S080-CPPE-LLAVE4            PIC X(12).                     155320      
001945    02 S080-CPPE-LLAVE5            PIC X(12).                     155340      
001946    02 S080-CPPE-LLAVE6            PIC X(12).                     155360      
001947    02 S080-CPPE-FECHA-VIG         PIC 9(06) COMP.                155380      
001948    02 S080-CPPE-FECHA-CONS        PIC 9(06) COMP.                155400      
001949    02 S080-CPPE-NIVEL-INI         PIC 9(02) COMP.                155420      
001950    02 FILLER                      PIC X(11).                     155440      
001951                                                                  156000      
001952 01 S080-CP-PARAMETRO-SAL.                                        156050      
001953    02 S080-CPPS-NUM-REGISTRO      PIC 9(02) COMP.                156100      
001954    02 S080-CPPS-NUM-CATALOGO      PIC 9(06) COMP.                156150      
001955    02 S080-CPPS-FECHA-CONS        PIC 9(06) COMP.                156200      
001956    02 S080-CPPS-NIVEL-INI         PIC 9(02) COMP.                156250      
001957    02 FILLER                      PIC X(22).                     156300      
001958    02 S080-CPPS-REGISTROS.                                       156350      
001959       04 S080-CPPS-DATOS OCCURS 28 TIMES PIC 9(12).              156400      
001960       04 S080-CPPS-DATOS-A REDEFINES  S080-CPPS-DATOS            156450      
001961                   OCCURS 28 TIMES PIC X(12).                     156500      
001962       04 S080-CPPS-FECHA-ALTA     PIC 9(06) COMP.                156550      
001963       04 S080-CPPS-FECHA-BAJA     PIC 9(06) COMP.                156600      
001964       04 S080-CPPS-FECHA-ULTMOD   PIC 9(06) COMP.                156650      
001965       04 S080-CPPS-FECHA-VIG      PIC 9(06) COMP.                156700      
001966       04 FILLER                   PIC X(500).                    156750      
001967                                                                  156755      
001968 01 WKS-CATALOGO.                                                 156760      
001969    03 WKS-CAT-TIPO                PIC 9(02).                     156765      
001970    03 WKS-CAT-NUMERO              PIC 9(06).                     156770      
001971    03 WKS-CAT-FORMATO             PIC 9(02).                     156775      
001972                                                                  156800      
001973 01 WKS-DATOS-CATRAN.                                             156820      
001974    02 WKS-GRUPO-PARAM OCCURS 10000 TIMES.                        156830      
001975       05 WKS-PT-NATS028              PIC 9(02).                  156840      
001976       05 WKS-PT-INDS250              PIC 9(02).                  156860      
001977       05 WKS-PT-NATALFA              PIC 9(02).                  156880      
001978                                                                  156900      
001979 01  WKS-ESPACIOS                  PIC X(17) VALUE SPACES.        157000      
001980 01  WKS-NULOS                     PIC X(17).                     158000      
001981 77  W77-CONTADOR                  PIC 9(02).                     159000      
001982                                                                  160000      
001983  01 WKS-INTE-ARCHIVO              PIC X(80).                     160020      
001984  77 WKS-INTE-ENTREGA              PIC S9(11) BINARY VALUE 7.     160040      
001985  77 WKS-INTE-EDO-ENTREGA          PIC S9(11) BINARY.             160060      
001986  77 WKS-INTE-RCV                  PIC S9(11) BINARY.             160080      
001987  77 WKS-INTE-ACT                  PIC S9(11) BINARY.             160100      
001988  77 W77-INTE-SNT                  PIC S9(11) BINARY.             160120      
001989                                                                  160140      
001990 01 WKS-PARAM-SIS                  PIC 9(03).                     160200      
001991 01 WKS-PARAM-FECHA                PIC 9(08).                     160300      
001992 01 WKS-PARAM-FECINI               PIC 9(08).                     160350      
001993 01 WKS-PARAM-HRINI                PIC 9(06).                     160400      
001994 01 WKS-PARAM-FECFIN               PIC 9(08).                     160450      
001995 01 WKS-PARAM-HRFIN                PIC 9(06).                     160500      
001996 01 WKS-PARAM-SUC                  PIC 9(04).                     160600      
001997 01 WKS-PARAM-CAJA                 PIC 9(02).                     160700      
001998 01 WKS-PARAM-CVETRAN              PIC 9(06).                     160800      
001999                                                                  162000      
002000 77  W77-NUMMOVS                   PIC 9(06).                     163000      
002001                                                                  164000      
002002 PROCEDURE DIVISION USING WKS-PARAM-SIS   ,                       165000      
002003                          WKS-PARAM-FECHA ,                       166000      
002004                          WKS-PARAM-FECINI,                       166100      
002005                          WKS-PARAM-HRINI ,                       167000      
002006                          WKS-PARAM-FECFIN,                       167100      
002007                          WKS-PARAM-HRFIN ,                       168000      
002008                          WKS-PARAM-SUC   ,                       169000      
002009                          WKS-PARAM-CAJA  ,                       170000      
002010                          WKS-PARAM-CVETRAN.                      170100      
002011                                                                  171000      
002012 000000-INIC-PROGRAMA.                                            172000      
002013   MOVE "P726"                   TO PASO-LJ   .                   173000      
002014   MOVE "S151"                   TO SISTEMA-LJ.                   174000      
002015   MOVE "001"                    TO MTP-LJ    .                   175000      
002016   MOVE "I"                      TO TIPO-LJ   .                   175100      
002017   MOVE ZERO                     TO W77-NUMMOVS.                  176000      
002018   PERFORM 00050-INICIO.                                          177000      
002019   PERFORM 00100-CATALOGOS.                                       177100      
002020   PERFORM 00200-PROC  .                                          178000      
002021   PERFORM 00999-TERMINA.                                         179000      
002022                                                                  180000      
002023 00050-INICIO.                                                    181000      
002024   MOVE WKS-PARAM-FECHA          TO WKS-S151-FEMOV                182000      
002025                                    WKS-S151-FEDES.               183000      
002026   MOVE WKS-PARAM-SIS            TO W77-NUMSIS                    185000      
002027                                    WKS-SIS                       187000      
002028                                    WKS-B01-SISTEMA               188000      
002029                                    WKS-S151-MOVSIS               189000      
002030                                    WKS-S151-DESSIS.              190000      
002031   ACCEPT  WKS-HR-MAQUINA        FROM TIME.                       191000      
002032   MOVE WKS-HH-MAQUINA           TO WKS-MAQ-HH.                   191100      
002033   MOVE WKS-MM-MAQUINA           TO WKS-MAQ-MM.                   191200      
002034   MOVE WKS-SS-MAQUINA           TO WKS-MAQ-SS.                   191300      
002035   MOVE WKS-HORA-MAQ             TO WKS-HHMMSS.                   191400      
002036                                                                  191500      
002037   ACCEPT WKS-FECHA-MAQUINA      FROM TODAYS-DATE.                191550      
002038   MOVE WKS-FECMAQ-MM            TO WKS-MM-ARCH  .                191600      
002039   MOVE WKS-FECMAQ-DD            TO WKS-DD-ARCH  .                191650      
002040   MOVE WKS-FECMAQ-AAAA          TO WKS-AAAA-ARCH.                191700      
002041   MOVE WKS-FECHA-ARCH           TO WKS-FECHA.                    191750      
002042                                                                  191800      
002043   CHANGE ATTRIBUTE LIBACCESS    OF "ADMONXFERS" TO BYFUNCTION.   191820      
002044   CHANGE ATTRIBUTE FUNCTIONNAME OF "ADMONXFERS"                  191840      
002045                                 TO "ADMONXFERS".                 191860      
002046                                                                  191880      
002047   CHANGE ATTRIBUTE LIBACCESS OF "CTRLVERS" TO BYFUNCTION.        192000      
002048   CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".      193000      
002049                                                                  194000      
002050   CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.  195000      
002051   CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO              196000      
002052                                    "SOPORTECOMS".                197000      
002053   CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                        198000      
002054          "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".         199000      
002055                                                                  200000      
002056   CALL "CSIID IN SOPORTECOMS" USING WKS-SOPCOMS.                 201000      
002057   CANCEL "SOPORTECOMS".                                          202000      
002058   MOVE WKS-NUMCSI                TO WKS-CSI                      203000      
002059                                     WKS-B01-CSI.                 204000      
002060                                                                  205000      
002061   MOVE "S151L001CTL"            TO WKS-LIBID.                    206000      
002062   CALL "DAME_TIT IN CTRLVERS"   USING  WKS-LIBID,                207000      
002063                                        WKS-NOMLIB                208000      
002064                                 GIVING W77-ERR-CTLVER.           209000      
002065   IF W77-ERR-CTLVER = 0                                          210000      
002066      CHANGE ATTRIBUTE TITLE  OF "LIB-CONTROL" TO WKS-NOMLIB      211000      
002067   ELSE                                                           212000      
002068      CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                  213000      
002069       "(S151)S151/OBJECT/L001/CONTROL ON CMEMP".                 214000      
002070   MOVE 1                               TO WKS-B01-FUNCION.       215000      
002071   CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA       216000      
002072                                   GIVING W77-RESULT-LIBCON.      217000      
002073   IF W77-RESULT-LIBCON = 0                                       218000      
002074      MOVE  WKS-B01-NOMPACMOV           TO WKS-S151-PKMOV         219000      
002075                                           WKS-S151-PKDES.        220000      
002076   IF WKS-PARAM-FECHA = 0                                         220100      
002077      MOVE  WKS-B01-FECPRO              TO WKS-PARAM-FECHA.       220200      
002078                                                                  220300      
002079   IF WKS-PARAM-HRFIN > 0 AND WKS-PARAM-FECFIN = 0                220400      
002080      MOVE  WKS-B01-FECPRO              TO WKS-PARAM-FECFIN.      220500      
002081                                                                  220600      
002082   CHANGE ATTRIBUTE TITLE OF S151MOVANT TO WKS-ETI-S151-MOVANT.   221000      
002083   CHANGE ATTRIBUTE TITLE OF S151DESANT TO WKS-ETI-S151-DESANT.   222000      
002084                                                                  223000      
002085   MOVE "S080BD01CON"                    TO WKS-LIBID.            223020      
002086   CALL "DAME_TIT IN CTRLVERS"                                    223040      
002087        USING  WKS-LIBID,                                         223060      
002088               WKS-NOMLIB                                         223080      
002089        GIVING W77-ERR-CTLVER.                                    223100      
002090                                                                  223120      
002091   IF W77-ERR-CTLVER < 0                                          223140      
002092      MOVE "ERROR AL OBTENER NOMBRE LIB S080 "                    223180      
002093                                         TO TEXTO-LJ              223200      
002094      MOVE 020901                        TO CODIGO-LJ             223220      
002095      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ         223240      
002096      CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                     223320      
002097   ELSE                                                           223340      
002098      CHANGE ATTRIBUTE TITLE OF "S080BD01CON" TO                  223360      
002099             WKS-NOMLIB.                                          223380      
002100                                                                  223400      
002101   OPEN INPUT S151MOVANT S151DESANT                               224000      
002102   OPEN OUTPUT REPORTE.                                           225000      
002103   PERFORM 01600-LEE-S151MOVANT.                                  226000      
002104                                                                  227000      
002105   IF W77-FIN = ZEROS                                             228000      
002106      PERFORM 01600-LEE-S151MOVANT.                               229000      
002107                                                                  229020      
002108 00100-CATALOGOS.                                                 229040      
002109*================                                                 229060      
002110      PERFORM 00110-CAT-CATALOGOS.                                229080      
002111      IF W77-EOF = 1                                              229090      
002112         PERFORM 00120-CAT-TRANS.                                 229100      
002113                                                                  229120      
002114 00110-CAT-CATALOGOS.                                             229140      
002115*====================                                             229160      
002116     MOVE 523                       TO S080-CPPE-CATALOGO         229180      
002117     MOVE 20                        TO S080-CPPE-CLAVE            229200      
002118     MOVE 1                         TO S080-CPPE-ORDEN-BUSQ       229220      
002119     MOVE 1                         TO S080-CPPE-REGISTROS        229240      
002120     MOVE WKS-PARAM-SIS             TO S080-CPPE-LLAVE1           229260      
002121     MOVE 0                         TO S080-CPPE-LLAVE2           229280      
002122                                       S080-CPPE-LLAVE3           229300      
002123                                       S080-CPPE-LLAVE4           229320      
002124                                       S080-CPPE-LLAVE5           229340      
002125                                       S080-CPPE-LLAVE6           229360      
002126     MOVE 0                         TO S080-CPPE-FECHA-VIG        229380      
002127     MOVE 0                         TO S080-CPPE-FECHA-CONS       229400      
002128                                       S080-CPPE-NIVEL-INI        229420      
002129     MOVE 0                         TO W77-EOF.                   229422      
002130     PERFORM 00112-CARGA-CATALOGO-CAT UNTIL W77-EOF > 0.          229424      
002131                                                                  229426      
002132 00112-CARGA-CATALOGO-CAT.                                        229428      
002133*========================                                         229430      
002134     CALL "L710_CONSUL_DETALLE IN S080BD01CON"                    229432      
002135          USING  S080-CP-SISTEMA          S080-CP-PROGRAMA        229434      
002136                 S080-CP-PARAMETRO-ENT    S080-CP-PARAMETRO-SAL   229436      
002137          GIVING S080-CP-RESULT.                                  229438      
002138     IF S080-CP-RESULT = 0 OR = 1                                 229440      
002139        IF S080-CPPS-DATOS(2) = 1                                 229442      
002140           MOVE 1                     TO W77-EOF                  229444      
002141           MOVE S080-CPPS-DATOS(3)  TO  WKS-CAT-TIPO              229446      
002142           MOVE S080-CPPS-DATOS(4)  TO  WKS-CAT-NUMERO            229448      
002143           MOVE S080-CPPS-DATOS(5)  TO  WKS-CAT-FORMATO           229450      
002144        ELSE                                                      229452      
002145           MOVE S080-CPPS-DATOS(1)        TO S080-CPPE-LLAVE1     229454      
002146           MOVE S080-CPPS-DATOS(2)        TO S080-CPPE-LLAVE2     229500      
002147           MOVE S080-CPPS-DATOS(3)        TO S080-CPPE-LLAVE3     229510      
002148           MOVE S080-CPPS-DATOS(4)        TO S080-CPPE-LLAVE4     229520      
002149           MOVE S080-CPPS-DATOS(5)        TO S080-CPPE-LLAVE5     229530      
002150           MOVE S080-CPPS-DATOS(6)        TO S080-CPPE-LLAVE6     229540      
002151           MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI  229550      
002152           MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS 229560      
002153           MOVE S080-CPPS-FECHA-VIG       TO S080-CPPE-FECHA-VIG  229570      
002154     ELSE                                                         229575      
002155        MOVE 2                            TO W77-EOF              229580      
002156        MOVE "NO SE LOCALIZO EL CATALOGO DE TRANSACIONES"         229585      
002157                                          TO TEXTO-LJ             229587      
002158        MOVE 020901                       TO CODIGO-LJ            229589      
002159        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      229591      
002160                                                                  229600      
002161 00120-CAT-TRANS.                                                 229700      
002162*================                                                 229800      
002163    IF WKS-CAT-FORMATO = 2                                        229805      
002164       MOVE WKS-PARAM-SIS      TO S080-CPPE-LLAVE1                229807      
002165       MOVE 1                  TO S080-CPPE-ORDEN-BUSQ            229810      
002166       MOVE 0                  TO S080-CPPE-LLAVE2                229812      
002167    ELSE                                                          229815      
002168       MOVE WKS-PARAM-SIS      TO S080-CPPE-LLAVE2                229816      
002169       MOVE 2                  TO S080-CPPE-ORDEN-BUSQ            229817      
002170       MOVE 0                  TO S080-CPPE-LLAVE1.               229818      
002171    MOVE 151                   TO S080-CP-SISTEMA                 229823      
002172    MOVE 606                   TO S080-CP-PROGRAMA                229828      
002173    MOVE WKS-CAT-NUMERO        TO S080-CPPE-CATALOGO,             229830      
002174    MOVE 20                    TO S080-CPPE-CLAVE                 229835      
002175    MOVE 1                     TO S080-CPPE-REGISTROS             229840      
002176    MOVE 20                    TO S080-CPPE-CLAVE                 229845      
002177    MOVE ZERO                  TO S080-CPPE-LLAVE3                229850      
002178                                  S080-CPPE-LLAVE4                229855      
002179                                  S080-CPPE-LLAVE5                229860      
002180                                  S080-CPPE-LLAVE6                229865      
002181                                  S080-CPPE-FECHA-VIG             229870      
002182                                  S080-CPPE-FECHA-CONS            229875      
002183                                  S080-CPPE-NIVEL-INI             229877      
002184                                  W77-EOF                         229879      
002185                                  W77-IND.                        229880      
002186    PERFORM 00122-CARGA-TRANSACCIONES UNTIL W77-EOF > 0.          229885      
002187                                                                  229890      
002188 00122-CARGA-TRANSACCIONES.                                       229895      
002189*==========================                                       229900      
002190   CALL "L710_CONSUL_DETALLE IN S080BD01CON"                      229902      
002191        USING  S080-CP-SISTEMA                                    229904      
002192               S080-CP-PROGRAMA                                   229906      
002193               S080-CP-PARAMETRO-ENT                              229908      
002194               S080-CP-PARAMETRO-SAL                              229910      
002195        GIVING S080-CP-RESULT.                                    229912      
002196                                                                  229914      
002197   IF WKS-CAT-FORMATO = 2                                         229916      
002198       MOVE S080-CPPS-DATOS(2) TO W77-IND                         229918      
002199    ELSE                                                          229924      
002200       MOVE S080-CPPS-DATOS(1) TO W77-IND.                        229926      
002201                                                                  229932      
002202   IF S080-CP-RESULT = 0 OR = 1                                   229950      
002203      MOVE S080-CPPS-NIVEL-INI       TO S080-CPPE-NIVEL-INI       229952      
002204      MOVE S080-CPPS-FECHA-CONS      TO S080-CPPE-FECHA-CONS      229954      
002205      MOVE S080-CPPS-FECHA-VIG       TO S080-CPPE-FECHA-VIG       229956      
002206      IF W77-IND < 9999                                           229958      
002207         MOVE S080-CPPS-DATOS(11)    TO WKS-PT-NATS028  (W77-IND) 229960      
002208         MOVE S080-CPPS-DATOS(12)    TO WKS-PT-INDS250  (W77-IND) 229962      
002209         MOVE S080-CPPS-DATOS(06)    TO WKS-PT-NATALFA  (W77-IND) 229964      
002210      ELSE                                                        229966      
002211        NEXT SENTENCE                                             229968      
002212   ELSE                                                           229970      
002213      MOVE 1                         TO W77-EOF.                  229972      
002214    MOVE S080-CPPS-DATOS(1)    TO S080-CPPE-LLAVE1     .          230420      
002215    MOVE S080-CPPS-DATOS(2)    TO S080-CPPE-LLAVE2     .          230440      
002216    MOVE S080-CPPS-DATOS(3)    TO S080-CPPE-LLAVE3     .          230450      
002217    MOVE S080-CPPS-DATOS(4)    TO S080-CPPE-LLAVE4     .          230500      
002218    MOVE S080-CPPS-DATOS(5)    TO S080-CPPE-LLAVE5     .          230550      
002219    MOVE S080-CPPS-DATOS(6)    TO S080-CPPE-LLAVE6     .          230600      
002220    MOVE S080-CPPS-NIVEL-INI   TO S080-CPPE-NIVEL-INI  .          230650      
002221    MOVE S080-CPPS-FECHA-CONS  TO S080-CPPE-FECHA-CONS .          230700      
002222    MOVE S080-CPPS-FECHA-VIG   TO S080-CPPE-FECHA-VIG  .          230750      
002223                                                                  230800      
002224 00200-PROC.                                                      231000      
002225*==========                                                       232000      
002226   MOVE ZERO              TO W77-FIN.                             232050      
002227   WRITE REG-REPORTE      FROM WKS-ENCABEZADO.                    232070      
002228   IF WKS-PARAM-FECINI= 0 AND                                     232100      
002229      WKS-PARAM-HRINI = 0 AND                                     233000      
002230      WKS-PARAM-FECFIN= 0 AND                                     233100      
002231      WKS-PARAM-HRFIN = 0 AND                                     234000      
002232      WKS-PARAM-SUC   = 0 AND                                     235000      
002233      WKS-PARAM-CAJA  = 0 AND                                     236000      
002234      WKS-PARAM-CVETRAN = 0                                       236100      
002235      PERFORM 01000-CON-X-DIA UNTIL W77-FIN = 1                   237000      
002236   ELSE                                                           237050      
002237   IF WKS-PARAM-FECINI= 0 AND                                     237070      
002238      WKS-PARAM-HRINI = 0 AND                                     237100      
002239      WKS-PARAM-FECFIN= 0 AND                                     237120      
002240      WKS-PARAM-HRFIN = 0 AND                                     237150      
002241      WKS-PARAM-SUC   > 0 AND                                     237200      
002242      WKS-PARAM-CAJA  = 0 AND                                     237250      
002243      WKS-PARAM-CVETRAN = 0                                       237260      
002244      PERFORM 01010-CON-X-SUC UNTIL W77-FIN = 1                   237300      
002245   ELSE                                                           237350      
002246   IF WKS-PARAM-FECINI= 0 AND                                     237370      
002247      WKS-PARAM-HRINI = 0 AND                                     237400      
002248      WKS-PARAM-FECFIN= 0 AND                                     237420      
002249      WKS-PARAM-HRFIN = 0 AND                                     237450      
002250      WKS-PARAM-SUC   > 0 AND                                     237500      
002251      WKS-PARAM-CAJA  > 0 AND                                     237550      
002252      WKS-PARAM-CVETRAN = 0                                       237560      
002253      PERFORM 01020-CON-X-SUCCAJ UNTIL W77-FIN = 1                237600      
002254   ELSE                                                           238000      
002255   IF WKS-PARAM-FECINI> 0 AND                                     238100      
002256      WKS-PARAM-HRINI > 0 AND                                     239000      
002257      WKS-PARAM-FECFIN= 0 AND                                     239100      
002258      WKS-PARAM-HRFIN = 0 AND                                     240000      
002259      WKS-PARAM-SUC   = 0 AND                                     241000      
002260      WKS-PARAM-CAJA  = 0 AND                                     242000      
002261      WKS-PARAM-CVETRAN = 0                                       242010      
002262      PERFORM 01100-CON-X-HR-INI UNTIL W77-FIN = 1                243000      
002263   ELSE                                                           244000      
002264   IF WKS-PARAM-FECINI> 0 AND                                     244100      
002265      WKS-PARAM-HRINI > 0 AND                                     245000      
002266      WKS-PARAM-FECFIN> 0 AND                                     245100      
002267      WKS-PARAM-HRFIN > 0 AND                                     246000      
002268      WKS-PARAM-SUC   = 0 AND                                     248000      
002269      WKS-PARAM-CAJA  = 0 AND                                     249000      
002270      WKS-PARAM-CVETRAN = 0                                       249010      
002271      PERFORM 01200-CON-X-RANGO  UNTIL W77-FIN = 1                250000      
002272   ELSE                                                           251000      
002273   IF WKS-PARAM-FECINI> 0 AND                                     251100      
002274      WKS-PARAM-HRINI > 0 AND                                     252000      
002275      WKS-PARAM-FECFIN= 0 AND                                     252100      
002276      WKS-PARAM-HRFIN = 0 AND                                     253000      
002277      WKS-PARAM-SUC   > 0 AND                                     254000      
002278      WKS-PARAM-CAJA  = 0 AND                                     255000      
002279      WKS-PARAM-CVETRAN = 0                                       255010      
002280      PERFORM 01300-CON-X-SUC-HRINI UNTIL W77-FIN = 1             256000      
002281   ELSE                                                           257000      
002282   IF WKS-PARAM-FECINI> 0 AND                                     257100      
002283      WKS-PARAM-HRINI > 0 AND                                     258000      
002284      WKS-PARAM-FECFIN> 0 AND                                     258100      
002285      WKS-PARAM-HRFIN = 0 AND                                     259000      
002286      WKS-PARAM-SUC   > 0 AND                                     260000      
002287      WKS-PARAM-CAJA  > 0 AND                                     261000      
002288      WKS-PARAM-CVETRAN = 0                                       261010      
002289      PERFORM 01400-CON-X-SCAJ-HRINI UNTIL W77-FIN = 1            262000      
002290   ELSE                                                           263000      
002291   IF WKS-PARAM-FECINI> 0 AND                                     263010      
002292      WKS-PARAM-HRINI > 0 AND                                     263020      
002293      WKS-PARAM-FECFIN> 0 AND                                     263030      
002294      WKS-PARAM-HRFIN = 0 AND                                     263040      
002295      WKS-PARAM-SUC   = 0 AND                                     263050      
002296      WKS-PARAM-CAJA  = 0 AND                                     263060      
002297      WKS-PARAM-CVETRAN = 0                                       263061      
002298      PERFORM 01450-CON-X-MOV-HRINI UNTIL W77-FIN = 1             263070      
002299   ELSE                                                           263080      
002300   IF WKS-PARAM-FECINI> 0 AND                                     263100      
002301      WKS-PARAM-HRINI > 0 AND                                     264000      
002302      WKS-PARAM-FECFIN> 0 AND                                     264100      
002303      WKS-PARAM-HRFIN > 0 AND                                     265000      
002304      WKS-PARAM-SUC   > 0 AND                                     267000      
002305      WKS-PARAM-CAJA  > 0 AND                                     268000      
002306      WKS-PARAM-CVETRAN = 0                                       268010      
002307      PERFORM 01500-CON-X-SCAJ-TIEMPO UNTIL W77-FIN = 1           269000      
002308   ELSE                                                           270000      
002309   IF WKS-PARAM-FECINI> 0 AND                                     270100      
002310      WKS-PARAM-HRINI > 0 AND                                     271000      
002311      WKS-PARAM-FECFIN> 0 AND                                     271100      
002312      WKS-PARAM-HRFIN > 0 AND                                     272000      
002313      WKS-PARAM-SUC   > 0 AND                                     274000      
002314      WKS-PARAM-CAJA  = 0 AND                                     275000      
002315      WKS-PARAM-CVETRAN = 0                                       275010      
002316      PERFORM 01600-CON-X-SUC-TIEMPO UNTIL W77-FIN = 1            276000      
002317   ELSE                                                           276001      
002318   IF WKS-PARAM-FECINI= 0 AND                                     276002      
002319      WKS-PARAM-HRINI = 0 AND                                     276003      
002320      WKS-PARAM-FECFIN= 0 AND                                     276004      
002321      WKS-PARAM-HRFIN = 0 AND                                     276005      
002322      WKS-PARAM-SUC   = 0 AND                                     276006      
002323      WKS-PARAM-CAJA  = 0 AND                                     276007      
002324      WKS-PARAM-CVETRAN > 0                                       276008      
002325      PERFORM 01700-CON-X-AUT UNTIL W77-FIN = 1                   276010      
002326   ELSE                                                           276011      
002327   IF WKS-PARAM-FECINI> 0 AND                                     276012      
002328      WKS-PARAM-HRINI = 0 AND                                     276013      
002329      WKS-PARAM-FECFIN= 0 AND                                     276014      
002330      WKS-PARAM-HRFIN = 0 AND                                     276015      
002331      WKS-PARAM-SUC   = 0 AND                                     276016      
002332      WKS-PARAM-CAJA  = 0 AND                                     276017      
002333      WKS-PARAM-CVETRAN > 0                                       276018      
002334      PERFORM 01800-CON-X-AUT-FEC UNTIL W77-FIN = 1               276020      
002335   ELSE                                                           276100      
002336      WRITE REG-REPORTE FROM WKS-LINEA-ERROR.                     276200      
002337                                                                  277000      
002338   IF W77-FIN = 1                                                 277100      
002339      CLOSE REPORTE WITH SAVE                                     277150      
002340      PERFORM 03000-ENVIA-INTELAR.                                277200      
002341                                                                  277300      
002342 01000-CON-X-DIA.                                                 278000      
002343*================                                                 279000      
002344     ADD 1                         TO W77-NUMMOVS.                280000      
002345     IF  A00-R01-FUNCION   = 1                                    281000      
002346*         A00-R01-STATUS    = 1              AND                  282000      
002347*        (A00-R01-ORIGEN    = 1 OR 2)                             283000      
002348         PERFORM 01700-CONSULTA-MOVTOS.                           284000      
002349                                                                  285000      
002350     PERFORM 01600-LEE-S151MOVANT.                                286000      
002351                                                                  287000      
002352 01010-CON-X-SUC.                                                 287050      
002353*================                                                 287100      
002354     ADD 1                         TO W77-NUMMOVS.                287150      
002355     IF  A00-R01-FUNCION   = 1              AND                   287200      
002356*         A00-R01-STATUS    = 1              AND                  287250      
002357*        (A00-R01-ORIGEN    = 1 OR 2)        AND                  287300      
002358         A00-R01-SUC-INIC  = WKS-PARAM-SUC                        287350      
002359         PERFORM 01700-CONSULTA-MOVTOS.                           287400      
002360                                                                  287450      
002361     PERFORM 01600-LEE-S151MOVANT.                                287500      
002362                                                                  287550      
002363 01020-CON-X-SUCCAJ.                                              287600      
002364*===================                                              287650      
002365    ADD 1                         TO W77-NUMMOVS.                 287700      
002366    IF  A00-R01-FUNCION   = 1              AND                    287750      
002367*        A00-R01-STATUS    = 1              AND                   287800      
002368*       (A00-R01-ORIGEN    = 1 OR 2)        AND                   287850      
002369        A00-R01-SUC-INIC  = WKS-PARAM-SUC  AND                    287900      
002370        A00-R01-CAJA-INIC = WKS-PARAM-CAJA                        287950      
002371        PERFORM 01700-CONSULTA-MOVTOS.                            287960      
002372                                                                  287970      
002373    PERFORM 01600-LEE-S151MOVANT.                                 287980      
002374                                                                  287990      
002375 01100-CON-X-HR-INI.                                              288000      
002376*===================                                              289000      
002377    ADD 1                          TO W77-NUMMOVS.                290000      
002378    IF  A00-R01-FUNCION   = 1                  AND                291000      
002379*        A00-R01-STATUS    = 1                  AND               292000      
002380*       (A00-R01-ORIGEN    = 1 OR 2)            AND               293000      
002381      ((A00-R01-FECMOV    = WKS-PARAM-FECINI OR                   293100      
002382        A00-R01-FECMOV    > WKS-PARAM-FECINI)  AND                293200      
002383       (A00-R01-HORMOV    = WKS-PARAM-HRINI OR                    294000      
002384        A00-R01-HORMOV    > WKS-PARAM-HRINI))                     295000      
002385        PERFORM 01700-CONSULTA-MOVTOS.                            296000      
002386                                                                  297000      
002387     PERFORM 01600-LEE-S151MOVANT.                                298000      
002388                                                                  299000      
002389 01200-CON-X-RANGO.                                               300000      
002390*===================                                              301000      
002391   ADD 1                           TO W77-NUMMOVS.                302000      
002392   IF WKS-PARAM-FECFIN > WKS-PARAM-FECINI                         302100      
002393      IF A00-R01-FUNCION   = 1                   AND              303000      
002394*         A00-R01-STATUS    = 1                   AND             304000      
002395*        (A00-R01-ORIGEN    = 1 OR 2)             AND             305000      
002396      (((A00-R01-FECMOV    = WKS-PARAM-FECINI  AND                305020      
002397        (A00-R01-HORMOV    > WKS-PARAM-HRINI   OR                 305040      
002398         A00-R01-HORMOV    = WKS-PARAM-HRINI))                    306000      
002399      OR                                                          307050      
002400        (A00-R01-FECMOV     > WKS-PARAM-FECINI AND                307060      
002401         A00-R01-FECMOV     < WKS-PARAM-FECFIN)                   307070      
002402      OR                                                          307080      
002403        (A00-R01-FECMOV    = WKS-PARAM-FECFIN  AND                307100      
002404        (A00-R01-HORMOV    = WKS-PARAM-HRFIN   OR                 307200      
002405         A00-R01-HORMOV    < WKS-PARAM-HRFIN))))                  308000      
002406        PERFORM 01700-CONSULTA-MOVTOS                             310000      
002407      ELSE                                                        310050      
002408         NEXT SENTENCE                                            310100      
002409   ELSE                                                           310150      
002410   IF  WKS-PARAM-FECFIN = WKS-PARAM-FECINI      AND               310200      
002411       A00-R01-FUNCION   = 1                   AND                310220      
002412       A00-R01-STATUS    = 1                   AND                310240      
002413     ((A00-R01-FECMOV    > WKS-PARAM-FECINI OR                    310250      
002414       A00-R01-FECMOV    = WKS-PARAM-FECINI)  AND                 310300      
002415      (A00-R01-HORMOV    = WKS-PARAM-HRINI  OR                    310350      
002416       A00-R01-HORMOV    > WKS-PARAM-HRINI))  AND                 310400      
002417      (A00-R01-HORMOV    = WKS-PARAM-HRFIN OR                     310450      
002418       A00-R01-HORMOV    < WKS-PARAM-HRFIN)                       310500      
002419       PERFORM 01700-CONSULTA-MOVTOS.                             310550      
002420                                                                  311000      
002421   PERFORM 01600-LEE-S151MOVANT.                                  312000      
002422                                                                  313000      
002423 01300-CON-X-SUC-HRINI.                                           314000      
002424*======================                                           315000      
002425   ADD 1                           TO W77-NUMMOVS.                316000      
002426   IF  A00-R01-FUNCION   = 1                     AND              317000      
002427*       A00-R01-STATUS    = 1                     AND             318000      
002428*      (A00-R01-ORIGEN    = 1 OR 2)               AND             319000      
002429     ((A00-R01-FECMOV    = WKS-PARAM-FECINI  OR                   319100      
002430       A00-R01-FECMOV    > WKS-PARAM-FECINI) AND                  319200      
002431      (A00-R01-HORMOV    = WKS-PARAM-HRINI   OR                   320000      
002432       A00-R01-HORMOV    > WKS-PARAM-HRINI))     AND              321000      
002433       A00-R01-SUC-INIC  = WKS-PARAM-SUC                          322000      
002434       PERFORM 01700-CONSULTA-MOVTOS.                             323000      
002435                                                                  324000      
002436   PERFORM 01600-LEE-S151MOVANT.                                  325000      
002437                                                                  326000      
002438 01400-CON-X-SCAJ-HRINI.                                          327000      
002439*=======================                                          328000      
002440   ADD 1                           TO W77-NUMMOVS.                329000      
002441   IF WKS-PARAM-FECFIN > WKS-PARAM-FECINI                         329100      
002442      IF A00-R01-FUNCION   = 1                  AND               330000      
002443*         A00-R01-STATUS    = 1                  AND              331000      
002444*        (A00-R01-ORIGEN    = 1 OR 2)            AND              332000      
002445       ((A00-R01-FECMOV    = WKS-PARAM-FECINI   AND               332100      
002446        (A00-R01-HORMOV    = WKS-PARAM-HRINI   OR                 333000      
002447         A00-R01-HORMOV    > WKS-PARAM-HRINI))                    334000      
002448       OR                                                         334100      
002449        (A00-R01-FECMOV     > WKS-PARAM-FECINI AND                334200      
002450         A00-R01-FECMOV     < WKS-PARAM-FECFIN)                   334300      
002451       OR                                                         334400      
002452         A00-R01-FECMOV    = WKS-PARAM-FECFIN)  AND               334500      
002453         A00-R01-SUC-INIC  = WKS-PARAM-SUC      AND               335000      
002454         A00-R01-CAJA-INIC = WKS-PARAM-CAJA                       336000      
002455         PERFORM 01700-CONSULTA-MOVTOS                            337000      
002456      ELSE                                                        337050      
002457         NEXT SENTENCE                                            337100      
002458   ELSE                                                           337150      
002459   IF WKS-PARAM-FECFIN = WKS-PARAM-FECINI                         337200      
002460      IF A00-R01-FUNCION   = 1                  AND               337250      
002461         A00-R01-STATUS    = 1                  AND               337300      
002462        (A00-R01-ORIGEN    = 1 OR 2)            AND               337350      
002463        (A00-R01-FECMOV    = WKS-PARAM-FECINI   AND               337400      
002464        (A00-R01-HORMOV    = WKS-PARAM-HRINI   OR                 337450      
002465         A00-R01-HORMOV    > WKS-PARAM-HRINI))  AND               337500      
002466         A00-R01-SUC-INIC  = WKS-PARAM-SUC      AND               337550      
002467         A00-R01-CAJA-INIC = WKS-PARAM-CAJA                       337600      
002468         PERFORM 01700-CONSULTA-MOVTOS.                           337650      
002469                                                                  338000      
002470   PERFORM 01600-LEE-S151MOVANT.                                  339000      
002471                                                                  339010      
002472 01450-CON-X-MOV-HRINI.                                           339020      
002473*=======================                                          339040      
002474   ADD 1                           TO W77-NUMMOVS.                339060      
002475   IF WKS-PARAM-FECFIN > WKS-PARAM-FECINI                         339080      
002476      IF A00-R01-FUNCION   = 1                  AND               339100      
002477*         A00-R01-STATUS    = 1                  AND              339120      
002478*        (A00-R01-ORIGEN    = 1 OR 2)            AND              339140      
002479       ((A00-R01-FECMOV    = WKS-PARAM-FECINI   AND               339160      
002480        (A00-R01-HORMOV    = WKS-PARAM-HRINI   OR                 339180      
002481         A00-R01-HORMOV    > WKS-PARAM-HRINI))                    339200      
002482       OR                                                         339220      
002483        (A00-R01-FECMOV     > WKS-PARAM-FECINI AND                339240      
002484         A00-R01-FECMOV     < WKS-PARAM-FECFIN)                   339260      
002485       OR                                                         339280      
002486         A00-R01-FECMOV    = WKS-PARAM-FECFIN)                    339300      
002487         PERFORM 01700-CONSULTA-MOVTOS                            339360      
002488      ELSE                                                        339380      
002489         NEXT SENTENCE                                            339400      
002490   ELSE                                                           339420      
002491   IF WKS-PARAM-FECFIN = WKS-PARAM-FECINI                         339470      
002492      IF A00-R01-FUNCION   = 1                  AND               339520      
002493         A00-R01-STATUS    = 1                  AND               339570      
002494        (A00-R01-ORIGEN    = 1 OR 2)            AND               339620      
002495        (A00-R01-FECMOV    = WKS-PARAM-FECINI   AND               339670      
002496        (A00-R01-HORMOV    = WKS-PARAM-HRINI   OR                 339720      
002497         A00-R01-HORMOV    > WKS-PARAM-HRINI))                    339770      
002498         PERFORM 01700-CONSULTA-MOVTOS.                           339820      
002499                                                                  339870      
002500   PERFORM 01600-LEE-S151MOVANT.                                  339920      
002501                                                                  340000      
002502 01500-CON-X-SCAJ-TIEMPO.                                         341000      
002503*========================                                         342000      
002504   ADD 1                           TO W77-NUMMOVS.                343000      
002505   IF WKS-PARAM-FECFIN > WKS-PARAM-FECINI                         343100      
002506      IF  A00-R01-FUNCION   = 1                   AND             344000      
002507*          A00-R01-STATUS    = 1                   AND            345000      
002508*         (A00-R01-ORIGEN    = 1 OR 2)             AND            346000      
002509        ((A00-R01-FECMOV    = WKS-PARAM-FECINI AND                346100      
002510         (A00-R01-HORMOV    > WKS-PARAM-HRINI  OR                 347000      
002511          A00-R01-HORMOV    = WKS-PARAM-HRINI))                   348000      
002512      OR                                                          348100      
002513        (A00-R01-FECMOV     > WKS-PARAM-FECINI AND                348120      
002514         A00-R01-FECMOV     < WKS-PARAM-FECFIN)                   348140      
002515      OR                                                          348160      
002516         (A00-R01-FECMOV    = WKS-PARAM-FECFIN AND                348200      
002517         (A00-R01-HORMOV    = WKS-PARAM-HRFIN  OR                 349000      
002518          A00-R01-HORMOV    < WKS-PARAM-HRFIN)))  AND             350000      
002519          A00-R01-SUC-INIC  = WKS-PARAM-SUC       AND             351000      
002520          A00-R01-CAJA-INIC = WKS-PARAM-CAJA                      352000      
002521          PERFORM 01700-CONSULTA-MOVTOS                           353000      
002522      ELSE                                                        353100      
002523         NEXT SENTENCE                                            353200      
002524   ELSE                                                           353300      
002525      IF  A00-R01-FUNCION   = 1                   AND             353305      
002526          A00-R01-STATUS    = 1                   AND             353310      
002527         (A00-R01-ORIGEN    = 1 OR 2)             AND             353315      
002528         (A00-R01-FECMOV    > WKS-PARAM-FECINI OR                 353320      
002529          A00-R01-FECMOV    = WKS-PARAM-FECINI) AND               353325      
002530        ((A00-R01-HORMOV    > WKS-PARAM-HRINI  OR                 353330      
002531          A00-R01-HORMOV    = WKS-PARAM-HRINI) AND                353335      
002532         (A00-R01-HORMOV    = WKS-PARAM-HRFIN  OR                 353340      
002533          A00-R01-HORMOV    < WKS-PARAM-HRFIN))   AND             353345      
002534          A00-R01-SUC-INIC  = WKS-PARAM-SUC       AND             353350      
002535          A00-R01-CAJA-INIC = WKS-PARAM-CAJA                      353355      
002536          PERFORM 01700-CONSULTA-MOVTOS.                          353360      
002537                                                                  354000      
002538   PERFORM 01600-LEE-S151MOVANT.                                  355000      
002539                                                                  356000      
002540 01600-CON-X-SUC-TIEMPO.                                          357000      
002541*=======================                                          358000      
002542   ADD 1                           TO W77-NUMMOVS.                359000      
002543   IF WKS-PARAM-FECFIN > WKS-PARAM-FECINI                         359100      
002544      IF A00-R01-FUNCION   = 1                 AND                360000      
002545*         A00-R01-STATUS    = 1                 AND               361000      
002546*        (A00-R01-ORIGEN    = 1 OR 2)           AND               362000      
002547      (((A00-R01-FECMOV    > WKS-PARAM-FECINI OR                  363000      
002548         A00-R01-FECMOV    = WKS-PARAM-FECINI) AND                364000      
002549        (A00-R01-HORMOV    > WKS-PARAM-HRINI OR                   365000      
002550         A00-R01-HORMOV    = WKS-PARAM-HRINI))                    366000      
002551      OR                                                          366100      
002552        (A00-R01-FECMOV     > WKS-PARAM-FECINI AND                366120      
002553        A00-R01-FECMOV     < WKS-PARAM-FECFIN)                    366140      
002554      OR                                                          366160      
002555       ((A00-R01-FECMOV    < WKS-PARAM-FECFIN  OR                 366200      
002556         A00-R01-FECMOV    = WKS-PARAM-FECFIN)  AND               366300      
002557        (A00-R01-HORMOV    = WKS-PARAM-HRFIN OR                   366400      
002558         A00-R01-HORMOV    < WKS-PARAM-HRFIN)))                   366500      
002559      AND                                                         366600      
002560         A00-R01-SUC-INIC  = WKS-PARAM-SUC                        367000      
002561         PERFORM 01700-CONSULTA-MOVTOS                            368000      
002562      ELSE                                                        369000      
002563         NEXT SENTENCE                                            369100      
002564   ELSE                                                           369200      
002565   IF WKS-PARAM-FECFIN = WKS-PARAM-FECINI                         369300      
002566      IF  A00-R01-FUNCION   = 1                 AND               369310      
002567          A00-R01-STATUS    = 1                 AND               369320      
002568         (A00-R01-ORIGEN    = 1 OR 2)           AND               369330      
002569         (A00-R01-FECMOV    > WKS-PARAM-FECINI OR                 369340      
002570          A00-R01-FECMOV    = WKS-PARAM-FECINI) AND               369350      
002571        ((A00-R01-HORMOV    > WKS-PARAM-HRINI  OR                 369360      
002572          A00-R01-HORMOV    = WKS-PARAM-HRINI) OR                 369370      
002573         (A00-R01-HORMOV    < WKS-PARAM-HRFIN  OR                 369380      
002574          A00-R01-HORMOV    = WKS-PARAM-HRFIN)) AND               369400      
002575          A00-R01-SUC-INIC  = WKS-PARAM-SUC                       369500      
002576          PERFORM 01700-CONSULTA-MOVTOS.                          369600      
002577                                                                  369700      
002578   PERFORM 01600-LEE-S151MOVANT.                                  370000      
002579                                                                  371000      
002580 01700-CON-X-AUT.                                                 371010      
002581*====================                                             371020      
002582     ADD 1                         TO W77-NUMMOVS.                371030      
002583     IF  A00-R01-FUNCION   = 1                                    371040      
002584         PERFORM 01700-CONSULTA-MOVTOS2.                          371050      
002585                                                                  371060      
002586     PERFORM 01600-LEE-S151MOVANT.                                371070      
002587                                                                  371080      
002588 01800-CON-X-AUT-FEC.                                             371090      
002589*====================                                             371100      
002590     ADD 1                         TO W77-NUMMOVS.                371110      
002591     IF  A00-R01-FUNCION   = 1 AND                                371120      
002592         A00-R01-FECMOV    = WKS-PARAM-FECINI                     371130      
002593         PERFORM 01700-CONSULTA-MOVTOS2.                          371140      
002594     PERFORM 01600-LEE-S151MOVANT.                                371150      
002595                                                                  371160      
002596                                                                  371170      
002597 01600-LEE-S151MOVANT.                                            372000      
002598*====================                                             373000      
002599   READ S151MOVANT AT END                                         374000      
002600        MOVE 1          TO W77-FIN.                               375000      
002601                                                                  376000      
002602   IF W77-FIN = ZEROS                                             377000      
002603      IF A00-R01-REGMOV = 99                                      378000      
002604         MOVE 1          TO W77-FIN.                              379000      
002605                                                                  380000      
002606                                                                  381000      
002607 01700-CONSULTA-MOVTOS.                                           382000      
002608*======================                                           383000      
002609   PERFORM 02000-MUEVE-DATOS                                      384000      
002610           VARYING W77-IND FROM 1 BY 1                            385000      
002611           UNTIL   W77-IND > 5 OR                                 386000      
002612                   A00-R01-CVETRAN(W77-IND) = 0.                  387000      
002613                                                                  387010      
002614 01700-CONSULTA-MOVTOS2.                                          387020      
002615*======================                                           387030      
002616   PERFORM 02000-VAL-CVETRAN                                      387040      
002617           VARYING W77-IND FROM 1 BY 1                            387050      
002618           UNTIL   W77-IND > 5 OR                                 387060      
002619                   A00-R01-CVETRAN(W77-IND) = 0.                  387070      
002620                                                                  387080      
002621 02000-VAL-CVETRAN.                                               387090      
002622*======================                                           387100      
002623   IF A00-R01-CVETRAN(W77-IND) = WKS-PARAM-CVETRAN                387110      
002624      PERFORM 02000-MUEVE-DATOS.                                  387120      
002625                                                                  388000      
002626 02000-MUEVE-DATOS.                                               389000      
002627*====================                                             390000      
002628   MOVE SPACES                        TO REG-REPORTE          .   391000      
002629   MOVE A00-R01-SUC-INIC              TO WKS-DET-SUC          .   392000      
002630   MOVE A00-R01-CAJA-INIC             TO WKS-DET-CAJA         .   393000      
002631   MOVE A00-R01-SUCPROM               TO WKS-DET-SPROM        .   394000      
002632   MOVE A00-R01-CONTRATO              TO WKS-DET-CTO          .   395000      
002633   MOVE A00-R01-MDA-SUC               TO WKS-DET-SUCMDA       .   395100      
002634   MOVE A00-R01-MDA-CTA               TO WKS-DET-CTAMDA       .   396000      
002635   MOVE A00-R01-AUTORIZA              TO WKS-DET-AUTS500      .   397000      
002636   MOVE A00-R01-CVETRAN(W77-IND)      TO WKS-DET-CLAVE        .   398000      
002637   MOVE A00-R01-IMPORTE(W77-IND)      TO WKS-DET-IMPORTE      .   399000      
002638   MOVE A00-R01-REFNUM                TO WKS-DET-REFNUM       .   400000      
002639   MOVE A00-R01-FECMOV                TO WKS-DET-FECHA        .   401000      
002640   MOVE A00-R01-HORMOV                TO WKS-DET-HORA         .   402000      
002641   MOVE WKS-PT-NATS028(WKS-DET-CLAVE) TO WKS-DET-NATS028      .   402100      
002642   MOVE WKS-PT-INDS250(WKS-DET-CLAVE) TO WKS-DET-INDALFA      .   402200      
002643   MOVE WKS-PT-NATALFA(WKS-DET-CLAVE) TO WKS-DET-NATALFA      .   402300      
002644   MOVE A00-R01-ORIGEN                TO WKS-DET-ORIGEN       .   402400      
002645   MOVE A00-R01-SUCTRAN               TO WKS-DET-SUCTRAN      .   402450      
002646   MOVE A00-R01-SUCOPER               TO WKS-DET-SUCOPE       .   402500      
002647   MOVE A00-R01-MONEDA                TO WKS-DET-MON          .   402600      
002648   MOVE A00-R01-FECMOV                TO WKS-DET-FECMOV       .   402650      
002649   MOVE A00-R01-HORMOV                TO WKS-DET-HORMOV       .   402700      
002650   MOVE A00-R01-AUT-S151              TO WKS-DET-AUTS151      .   402750      
002651   MOVE A00-R01-PRODUCTO              TO WKS-DET-PROD         .   402800      
002652   MOVE A00-R01-INSTRUMENTO           TO WKS-DET-INST         .   402850      
002653   MOVE A00-R01-STATUS                TO WKS-DET-STATUS       .   402900      
002654   WRITE REG-REPORTE FROM WKS-DET-EXTMOV.                         403000      
002655                                                                  404000      
002656 03000-ENVIA-INTELAR.                                             404050      
002657*====================                                             404100      
002658   MOVE ZERO                          TO W77-INTE-SNT    .        404150      
002659   MOVE SPACES                        TO WKS-INTE-ARCHIVO.        404170      
002660   MOVE WKS-ARCH-INTELAR              TO WKS-INTE-ARCHIVO.        404200      
002661   CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO        404250      
002662                                   GIVING W77-INTE-SNT.           404300      
002663   IF W77-INTE-SNT = 0                                            404350      
002664      NEXT SENTENCE                                               404400      
002665   ELSE                                                           404450      
002666      MOVE "ERROR EN ENVIO DE ARCHIVO S151/FILE/INTS/15110S01"    404500      
002667                                      TO TEXTO-LJ                 404600      
002668      MOVE 020901                     TO CODIGO-LJ                404700      
002669      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.        404800      
002670                                                                  404900      
002671 00999-TERMINA.                                                   405000      
002672*=============                                                    406000      
002673  CLOSE S151MOVANT S151DESANT WITH LOCK.                          407000      
002674  STOP RUN.                                                       409000      
