000001$SET LIST LISTOMITTED OLDCODE                                     000100      
000002*$$ SET OPTIMIZE FEDLEVEL = 5                                     000600      
000003 IDENTIFICATION DIVISION.                                         000700      
000004 PROGRAM-ID. S151-P312.                                           000800      
000005******************************************************************000900      
000006* OBJETIVO : PROPORCIONAR ARCHIVO DE SALDOS PARA EL SISTEMA S084 *001000      
000007*            DE LA COBERTURA MONTERREY.                TER 10/08 *001100      
000008*                                                                *001110      
000009* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *001112      
000010* 20141208 15MTP001 MJGRG                                        *001114      
000011* 20191017 19MTP001 STF.                                         *001116      
000012******************************************************************001200      
000013 ENVIRONMENT DIVISION.                                            001300      
000014 INPUT-OUTPUT SECTION.                                            001400      
000015*                                                                 001500      
000016 FILE-CONTROL.                                                    001600      
000017                                                                  001700      
000018  SELECT SALDOS084     ASSIGN       TO DISK.                      001800      
000019*                                                                 002200      
000020 DATA DIVISION.                                                   002300      
000021 FILE SECTION.                                                    002400      
000022*                                                                 002500      
000023 FD SALDOS084                                                     002600      
000024    BLOCK CONTAINS 150 RECORDS                                    002700      
000025    VALUE OF SECURITYTYPE IS PUBLIC                               002800      
000026    VALUE OF TITLE IS WKS-TIT-SDOS084.                            002900      
000027                                                                  003000      
000028 01 REG-SALDOS084.                                                003100      
000029    02 REG-KEY-SDOS84.                                            003200      
000030       04 REG-KEY-ID       PIC 9(22) COMP.                        003300      
000031       04 REG-KEY-CTO      PIC 9(20) COMP.                        003400      
000032    02 REG-RESTO-SDOS84    PIC X(397).                            003500      
000033*                                                                 003600      
000034 DATA-BASE SECTION.                                               003700      
000035*                                                                 003800      
000036 DB BASESDO = S151BD11SDOS151.                                    003900      
000037                                                                  004000      
000038 WORKING-STORAGE SECTION.                                         004100      
000039*INICIA CODIGO DE RENOVACION CRONOS 2000                          004200      
000040*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004500      
000041                                                                  004600      
000042*=========================================================        004700      
000043*         VARIABLES PARA CONTROL DE VERSIONES            =        004800      
000044*=========================================================        004900      
000045                                                                  005000      
000046 01  WKS-LIBID                     PIC X(12).                     005100      
000047 01  WKS-NOMBLIB                   PIC X(72).                     005200      
000048 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             005300      
000049                                                                  005400      
000050*=========================================================        005500      
000051*         VARIABLES PARA LIBRERIA DE CONTROL             =        005600      
000052*=========================================================        005700      
000053                                                                  005800      
000054*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000055* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  005900      
000056*================================================================ 000100      
000057*         ENTRY-POINT CONSISDIA :                               = 000200      
000058*                                                                 000300      
000059* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000060* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000061* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000062* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000063* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000064* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000065* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000066* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000067* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000068* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000069*                                                               = 001400      
000070*================================================================ 001500      
000071                                                                  001600      
000072                                                                  001700      
000073*================================================================ 001800      
000074* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000075*                                                               = 002000      
000076* ENTRADA REQUERIDA :                                           = 002100      
000077*                                                               = 002200      
000078*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000079*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000080*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000081*================================================================ 002600      
000082 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000083    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000084    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000085    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000086    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000087    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000088    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000089    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000090    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000091    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000092    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000093    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000094    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000095    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000096    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000097    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000098    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000099    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000100    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000101    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000102    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000103       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000104       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000105       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000106       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000107*==============================================================   005200      
000108*                                                             =   005300      
000109* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000110*                                                             =   005500      
000111* CAMPOS REQUERIDOS :                                         =   005600      
000112*                                                             =   005700      
000113* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000114* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000115* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000116* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000117*==============================================================   006200      
000118 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000119    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000120    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000121    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000122    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000123                                                                  006800      
000124*==============================================================   006900      
000125*                                                             =   007000      
000126* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000127*                                                             =   007200      
000128* CAMPOS REQUERIDOS :                                         =   007300      
000129*                                                             =   007400      
000130* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000131* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000132* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000133* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000134*==============================================================   007900      
000135 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000136    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000137    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000138    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000139    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000140                                                                  008500      
000141*==============================================================   008600      
000142*                                                             =   008700      
000143* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000144*                                                             =   008900      
000145* CAMPOS REQUERIDOS :                                         =   009000      
000146*                                                             =   009100      
000147* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000148* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000149* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000150* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000151*==============================================================   009600      
000152 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000153    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000154    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000155    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000156    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000157                                                                  010200      
000158*============================================================     010300      
000159* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000160*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000161*                                                           =     010600      
000162*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000163*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000164*                                                           =     010900      
000165*  ENTRADA REQUERIDA.                                       =     011000      
000166*                                                           =     011100      
000167*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000168*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000169*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000170*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000171*============================================================     011600      
000172                                                                  011700      
000173 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000174     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000175     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000176     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000177     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000178                                                                  012300      
000179*=============================================================    012400      
000180*                                                            =    012500      
000181* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000182*             B01-SIS-FECARMOV.                              =    012700      
000183*                                                            =    012800      
000184* ENTRADA REQUERIDAD :                                       =    012900      
000185*                                                            =    013000      
000186*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000187*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000188*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000189*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000190*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000191*=============================================================    013600      
000192                                                                  013700      
000193 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000194     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000195     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000196     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000197     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000198     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000199*================================================================ 014400      
000200*                                                               = 014500      
000201* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000202*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000203*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000204*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000205*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000206*                                                               = 015100      
000207* ENTRADA REQUERIDA :                                           = 015200      
000208*                                                               = 015300      
000209* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000210* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000211* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000212* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000213* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000214*================================================================ 015900      
000215 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000216    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000217    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000218    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000219    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000220    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000221                                                                  016600      
000222*============================================================     016700      
000223*                                                           =     016800      
000224* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000225*                                                           =     017000      
000226* DATOS REQUERIDOS :                                        =     017100      
000227*                                                           =     017200      
000228* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000229* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000230* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000231* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000232* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000233*============================================================     017800      
000234                                                                  017900      
000235 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000236     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000237     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000238     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000239     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000240     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000241                                                                  018600      
000242*============================================================     018700      
000243*                                                           =     018800      
000244* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000245*                                                           =     019000      
000246* DATOS REQUERIDOS :                                        =     019100      
000247*                                                           =     019200      
000248* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000249* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000250* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000251* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000252* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000253*============================================================     019800      
000254                                                                  019900      
000255 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000256     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000257     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000258     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000259     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000260     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000261                                                                  020600      
000262*===============================================================  020700      
000263*                                                              =  020800      
000264* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000265*              MOVIMIENTOS.                                    =  021000      
000266* DATOS REQUERIDOS :                                           =  021100      
000267*                                                              =  021200      
000268* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000269* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000270* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000271* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000272* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000273* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000274*==============================================================   021900      
000275                                                                  022000      
000276 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000277     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000278     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000279     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000280     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000281     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000282     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000283*==============================================================   022800      
000284*                                                             =   022900      
000285* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000286*                                                             =   023100      
000287* CAMPOS REQUERIDOS :                                         =   023200      
000288*                                                             =   023300      
000289* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000290* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000291* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000292* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000293*==============================================================   023800      
000294 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000295    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000296    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000297    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000298    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000299                                                                  024304      
000300*=================================================================024306      
000301*                ENTRY POINT CONSISB01                           =024308      
000302*                                                                =024310      
000303*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000304*                                                                =024314      
000305*  FUNCIONES DISPONIBLES :                                       =024316      
000306*                                                                =024318      
000307*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000308*                                                                =024322      
000309*  PARAMETROS REQUERIDOS                                         =024324      
000310*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000311*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000312*=================================================================024330      
000313                                                                  024332      
000314 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000315     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000316     03 WKS-CON-CSI                PIC 9(02).                     024336      
000317     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000318     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000319        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000320        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000321        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000322        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000323        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000324                                                                  024400      
000325*=================================================================024500      
000326*                ENTRY POINT B02ARCINTER                         =024600      
000327*                                                                =024700      
000328*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000329*                                                                =024900      
000330*  FUNCIONES DISPONIBLES :                                       =025000      
000331*                                                                =025100      
000332*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000333* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000334* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000335* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000336*                                                                =025600      
000337*  PARAMETROS REQUERIDOS                                         =025700      
000338*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000339*                                                                =025900      
000340*=================================================================026000      
000341 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000342     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000343     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000344     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000345     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000346     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000347     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000348     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000349     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000350     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000351     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000352     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000353     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000354     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000355     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000356     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000357     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000358     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000359     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000360     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000361     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000362     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000363     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000364     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000365     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000366     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000367     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000368     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000369     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000370                                                                  029000      
000371*=================================================================029100      
000372*                ENTRY POINT B04SISTEMA                          =029200      
000373*                                                                =029300      
000374*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000375*                                                                =029500      
000376*  FUNCIONES DISPONIBLES :                                       =029600      
000377*                                                                =029700      
000378*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000379*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000380*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000381*                                                                =030100      
000382*  PARAMETROS REQUERIDOS                                         =030200      
000383*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000384*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000385*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000386*                                                                =030600      
000387*=================================================================030700      
000388 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000389     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000390     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000391     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000392     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000393     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000394     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000395     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000396                                                                  031600      
000397*================================================================ 031700      
000398*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000399*                                                               = 031900      
000400*  FUNCION                                                      = 032000      
000401*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000402*   19       ALTAS.                                             = 032200      
000403*   22       BAJAS                                              = 032300      
000404*   37       CAMBIOS.                                           = 032400      
000405*                                                               = 032500      
000406*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000407*                      FECHA DE PROCESO                         = 032700      
000408*                      NUMERO DE PROCESO                        = 032800      
000409*                      FECHA INICIO                             = 032900      
000410*                      REGISTRO INICIAL                         = 033000      
000411*================================================================ 033100      
000412                                                                  033200      
000413 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000414     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000415     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000416     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000417     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000418     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000419     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000420     03 WKS-B05-MIX                PIC 9(08).                     034000      
000421     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000422     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000423     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000424     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000425     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000426     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000427                                                                  034700      
000428                                                                  034800      
000429*================================================================ 034900      
000430*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000431*                                                               = 035100      
000432*  FUNCION                                                      = 035200      
000433*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000434*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000435*                                                               = 035500      
000436*================================================================ 035600      
000437                                                                  035700      
000438 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000439     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000440     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000441     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000442     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000443     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000444     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000445                                                                  036500      
000446*===============================================================  036600      
000447*                                                              =  036700      
000448*         ENTRY-POINT CONSISMEN                                =  036800      
000449*                                                              =  036900      
000450*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000451*                      SISTEMA                                 =  037100      
000452*                                                              =  037200      
000453*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000454*                                                              =  037400      
000455*===============================================================  037500      
000456 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000457     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000458     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000459     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000460     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000461     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000462     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000463     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000464     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000465     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000466     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000467     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000468     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000469     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000470     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000471     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000472        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000473        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000474        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000475        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000476        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000477        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000478        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000479                                                                  039900      
000480*=====================================================            040000      
000481*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000482*=====================================================            040200      
000483 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000484     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000485     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000486     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000487                                                                  040700      
000488*=====================================================            040800      
000489*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000490*=====================================================            041000      
000491 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000492     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000493     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000494     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000495                                                                  041500      
000496*=====================================================            041600      
000497*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000498*=====================================================            041800      
000499 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000500     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000501     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000502     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000503*=====================================================            042300      
000504*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000505*=====================================================            042500      
000506 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000507     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000508     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000509     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000510                                                                  043000      
000511*=====================================================            043100      
000512*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000513*=====================================================            043300      
000514 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000515     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000516     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000517     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000518                                                                  043800      
000519*=====================================================            043900      
000520*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000521*=====================================================            044100      
000522 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000523     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000524     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000525     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000526                                                                  044600      
000527*=====================================================            044700      
000528*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000529*=====================================================            044900      
000530 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000531     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000532     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000533     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000534                                                                  045400      
000535*=====================================================            045500      
000536*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000537*=====================================================            045700      
000538 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000539     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000540     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000541     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000542                                                                  046200      
000543*=====================================================            046300      
000544*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000545*=====================================================            046500      
000546 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000547     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000548     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000549     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000550                                                                  047000      
000551*=====================================================            047100      
000552*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000553*=====================================================            047300      
000554 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000555     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000556     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000557     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000558                                                                  047800      
000559*=====================================================            047900      
000560*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000561*=====================================================            048100      
000562 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000563     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000564     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000565     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000566                                                                  048600      
000567*=====================================================            048700      
000568*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000569*=====================================================            048900      
000570 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000571     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000572     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000573     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000574                                                                  049400      
000575*=====================================================            049500      
000576*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000577*=====================================================            049700      
000578 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000579     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000580     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000581     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000582     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000583     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000584     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000585     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000586     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000587     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000588     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000589                                                                  050900      
000590*=====================================================            051000      
000591*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000592*=====================================================            051200      
000593 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000594     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000595     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000596     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000597     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000598                                                                  051800      
000599*=====================================================            051900      
000600*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000601*=====================================================            052100      
000602 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000603     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000604     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000605     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000606     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000607                                                                  052700      
000608*=====================================================            052800      
000609*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000610*=====================================================            053000      
000611 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000612     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000613     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000614     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000615     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000616                                                                  053600      
000617*=====================================================            053700      
000618*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000619*=====================================================            053900      
000620 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000621     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000622     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000623     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000624     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000625                                                                  054500      
000626*=====================================================            054600      
000627*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000628*=====================================================            054800      
000629 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000630     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000631     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000632     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000633     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000634                                                                  055400      
000635*=====================================================            055500      
000636*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000637*=====================================================            055700      
000638 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000639     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000640     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000641     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000642     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000643                                                                  056300      
000644*=====================================================            056400      
000645*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000646*=====================================================            056600      
000647 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000648     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000649     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000650     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000651     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000652                                                                  057200      
000653 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000654*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000655                                                                  006000      
000656*=========================================================        006010      
000657*         VARIABLES PARA LIBRERIA DE DESPLIEGE DE MSG    =        006020      
000658*=========================================================        006030      
000659*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000660* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           006040      
000661**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000662  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000663  01 MENSAJE-LJ.                                                  100300      
000664     02 SISTEMA-LJ     PIC X(04).                                 100400      
000665     02 FILLER         PIC X VALUE "/".                           100500      
000666     02 PASO-LJ        PIC X(04).                                 100600      
000667     02 FILLER         PIC X VALUE "/".                           100700      
000668     02 MTP-LJ         PIC 9(03).                                 100800      
000669     02 FILLER         PIC X VALUE ":".                           100900      
000670     02 TIPO-LJ        PIC X.                                     101000      
000671     02 FILLER         PIC X VALUE ">".                           101100      
000672     02 CODIGO-LJ      PIC 9(06).                                 101200      
000673     02 FILLER         PIC X VALUE "<".                           101300      
000674     02 TEXTO-LJ       PIC X(250).                                101400      
000675*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000676                                                                  006050      
000677*=========================================================        006100      
000678*         ERRORES Y MENSAJES DE DMSII                    =        006200      
000679*=========================================================        006300      
000680*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000681* COPY "S151/FORMATO/ERROR/DMSII." FROM 1000 TO  60000.           006400      
000682                                                                  001000      
000683                                                                  002000      
000684                                                                  003000      
000685*=================================================================004000      
000686*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
000687*=================================================================006000      
000688                                                                  007000      
000689                                                                  008000      
000690                                                                  009000      
000691 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
000692 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
000693 01 WKS-TAB-ERRDMSII.                                             012000      
000694    02 FILLER                      PIC X(20)     VALUE            013000      
000695    "NOTFOUND          01".                                       014000      
000696    02 FILLER                      PIC X(20)     VALUE            015000      
000697    "DUPLICATES        02".                                       016000      
000698    02 FILLER                      PIC X(20)     VALUE            017000      
000699    "DEADLOCK          03".                                       018000      
000700    02 FILLER                      PIC X(20)     VALUE            019000      
000701    "DATAERROR         04".                                       020000      
000702    02 FILLER                      PIC X(20)     VALUE            021000      
000703    "NOTLOCKED         05".                                       022000      
000704    02 FILLER                      PIC X(20)     VALUE            023000      
000705    "KEYCHANGE         06".                                       024000      
000706    02 FILLER                      PIC X(20)     VALUE            025000      
000707    "SYSTEMERROR       07".                                       026000      
000708    02 FILLER                      PIC X(20)     VALUE            027000      
000709    "READONLY          08".                                       028000      
000710    02 FILLER                      PIC X(20)     VALUE            029000      
000711    "IOERROR           09".                                       030000      
000712    02 FILLER                      PIC X(20)     VALUE            031000      
000713    "LIMITERROR        10".                                       032000      
000714    02 FILLER                      PIC X(20)     VALUE            033000      
000715    "OPENERROR         11".                                       034000      
000716    02 FILLER                      PIC X(20)     VALUE            035000      
000717    "CLOSEERROR        12".                                       036000      
000718    02 FILLER                      PIC X(20)     VALUE            037000      
000719    "NORECORD          13".                                       038000      
000720    02 FILLER                      PIC X(20)     VALUE            039000      
000721    "INUSE             14".                                       040000      
000722    02 FILLER                      PIC X(20)     VALUE            041000      
000723    "AUDITERROR        15".                                       042000      
000724    02 FILLER                      PIC X(20)     VALUE            043000      
000725    "ABORT             16".                                       044000      
000726    02 FILLER                      PIC X(20)     VALUE            045000      
000727    "SECURITYERROR     17".                                       046000      
000728    02 FILLER                      PIC X(20)     VALUE            047000      
000729    "VERSIONERROR      18".                                       048000      
000730    02 FILLER                      PIC X(20)     VALUE            049000      
000731    "FATALERROR        19".                                       050000      
000732    02 FILLER                      PIC X(20)     VALUE            051000      
000733    "INTEGRITY ERROR   20".                                       052000      
000734    02 FILLER                      PIC X(20)     VALUE            053000      
000735    "INTLIBERROR       21".                                       054000      
000736 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
000737    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
000738       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
000739       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
000740                                                                  059000      
000741 01 WKS-ERR-BD                     PIC 9(04).                     059100      
000742 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
000743                                                                  060000      
000744*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000745 01  WKS-TIPO-ERROR               PIC 9(04).                      006500      
000746 01  WKS-NOMB-ESTRUCT             PIC X(17).                      006600      
000747                                                                  006650      
000748 01  WKS-INFADI-S500               PIC X(146).                    006700      
000749 01  WKS-INFADI-S500-R REDEFINES   WKS-INFADI-S500.               006800      
000750     03 WKS-ADI500-DIASCICLO       PIC 9(03).                     006900      
000751     03 WKS-ADI500-DIASANO         PIC 9(03).                     007000      
000752     03 WKS-ADI500-TASRENET        PIC 9(04)V9(04).               007100      
000753     03 WKS-ADI500-TASREBRU        PIC 9(04)V9(04).               007200      
000754     03 WKS-ADI500-TASREANO        PIC 9(04)V9(04).               007300      
000755     03 WKS-ADI500-CTACON          PIC 9(04).                     007400      
000756     03 WKS-ADI500-MONEDA          PIC 9(04).                     007500      
000757                                                                  007600      
000758*==========================================================       007700      
000759*         VARIABLE DE RESULTADO DE LA FUNCION             =       007800      
000760*==========================================================       007900      
000761 77  W77-ERROR-BASE                PIC 9(02).                     008000      
000762 77  W77-ERROR-ARCH                PIC 9(02).                     008100      
000763 77  W77-IND                       PIC 9(04).                     008200      
000764 77  W77-IND1                      PIC 9(04).                     008300      
000765 77  W77-IND2                      PIC 9(04).                     008400      
000766 77  W77-IND3                      PIC 9(04).                     008500      
000767 77  W77-CONCEPTO                  PIC 9(04).                     008600      
000768 77  W77-NUMMAX-APUIMP             PIC 9(02).                     008700      
000769 77  W77-FECHA-VALIDA              PIC 9(01).                     008800      
000770 88  W88-FECHA-VALIDA              VALUE 1.                       008900      
000771                                                                  009000      
000772 77  W77-CONCEPTOS-VALIDOS         PIC 9(02).                     009100      
000773 88  W88-CONCEPTOS                 VALUE 02, 13, 15,              009200      
000774                                         29, 30, 34, 35, 36, 43,  009300      
000775                                         44, 45, 5, 6, 7, 8, 9.   009400      
000776 77 WKS-SDO-FECHAA8                PIC 9(08).                     009500      
000777 01 WKS-DATOS-LIB.                                                009600      
000778    03 WKS-FECHA-PROC PIC 9(08).                                  009700      
000779    03 WKS-FECHA-PROCESO REDEFINES WKS-FECHA-PROC.                009800      
000780       05 WKS-AAMM-PROC            PIC 9(06).                     009900      
000781       05 WKS-AAMM-PROC-R REDEFINES WKS-AAMM-PROC.                010000      
000782          07 WKS-AA-PROC           PIC 9(04).                     010100      
000783          07 WKS-MM-PROC           PIC 9(02).                     010200      
000784       05 WKS-DD-PROC              PIC 9(02).                     010300      
000785    03 WKS-FECHA-LINEA             PIC 9(08).                     010400      
000786    03 WKS-FECHA-CAMD    REDEFINES WKS-FECHA-LINEA.               010500      
000787       05 WKS-FECHA-CC             PIC 9(02).                     010600      
000788       05 WKS-FECHA-AAMMDD         PIC 9(06).                     010700      
000789    03 WKS-SISTEMA                 PIC 9(04).                     010800      
000790    03 WKS-ABRE-SDO                PIC 9(02) VALUE ZERO.          010900      
000791    03 WKS-ESPACIOS                PIC X(25) VALUE SPACES.        011000      
000792    03 WKS-NULOS                   PIC X(25).                     011100      
000793    03 WKS-INICIO                  PIC 9(02) VALUE ZERO.          011200      
000794 01 WKS-NOMBASE-SDO.                                              011300      
000795    02 FILLER                      PIC X(06) VALUE "(S151)".      011400      
000796    02 WKS-NOMBD                   PIC X(17).                     011500      
000797    02 FILLER                      PIC X(10) VALUE                011600      
000798       " ON CMEMP.".                                              011700      
000799                                                                  011800      
000800 01 WKS-DATOS-HOST.                                               011900      
000801    03 WKS-NUMCSI                  PIC 9(02).                     012000      
000802    03 WKS-NOMEQUIPO               PIC X(10).                     012100      
000803    03 WKS-NOMCSI                  PIC X(26).                     012200      
000804    03 WKS-LINEA-BATCH             PIC X(05).                     012300      
000805*                                                                 012400      
000806 01 WKS-FIN                        PIC 9(02).                     012500      
000807 01 WKS-CONT-GRAB                  PIC 9(06).                     012600      
000808*                                                                 012700      
000809*************************************************************     012800      
000810******     NOMBRE EXTERNO DE ARCHIVO SALDOS  S084   *********     012900      
000811*************************************************************     013000      
000812*                                                                 013100      
000813 01  WKS-TIT-SDOS084.                                             013200      
000814     02  FILLER                        PIC X(21) VALUE            013300      
000815                                      "(S151)S151/FILE/S084/".    013400      
000816     02  WKS-NODO-ORIGEN-S084          PIC 9(02) VALUE 04.        013500      
000817     02  FILLER                        PIC X     VALUE "/".       013600      
000818     02  WKS-FEC-S084                  PIC 9(06) VALUE 0.         013700      
000819     02  FILLER                        PIC X     VALUE ".".       013800      
000820*                                                                 013900      
000821*                                                                 014000      
000822*==========================================================       014100      
000823*         FORMATO REGISTROS  S084                         =       014200      
000824*==========================================================       014300      
000825*                                                                 014400      
000826 01  WKS-HED-SDOS084.                                             014500      
000827     02 WKS-HED-FUNCION            PIC 9(02) COMP.                014600      
000828     02 WKS-HED-SISORIGEN          PIC 9(04) COMP.                014700      
000829     02 WKS-HED-SISTEMA            PIC 9(04) COMP.                014800      
000830     02 WKS-HED-FECHA              PIC 9(08) COMP.                014900      
000831     02 FILLER                     PIC X(409).                    015000      
000832                                                                  015100      
000833 01  WKS-DET-SDOS084.                                             015200      
000834     02 WKS-DET-KEYID.                                            015300      
000835        04 WKS-DET-FUNCION         PIC 9(02)       COMP.          015400      
000836        04 WKS-DET-SISORIGEN       PIC 9(04)       COMP.          015500      
000837        04 WKS-DET-SISTEMA         PIC 9(04)       COMP.          015600      
000838        04 WKS-DET-PRODUCTO        PIC 9(04)       COMP.          015700      
000839        04 WKS-DET-INSTRUMENTO     PIC 9(04)       COMP.          015800      
000840        04 WKS-DET-MONEDA          PIC 9(04)       COMP.          015900      
000841     02 WKS-DET-KEYCTO.                                           016000      
000842        04 WKS-DET-CONTRATO        PIC 9(20)       COMP.          016100      
000843     02 WKS-DET-RESTO.                                            016200      
000844        04 WKS-DET-FECHA           PIC 9(06)       COMP.          016300      
000845        04 WKS-DET-CONCEPTOS       PIC 9(02)       COMP.          016400      
000846        04 WKS-DET-CONTRATOS.                                     016500      
000847           06 WKS-DET-SUCPROM      PIC 9(04)       COMP.          016600      
000848           06 WKS-DET-DIAS-CICLO   PIC 9(02)       COMP.          016700      
000849           06 WKS-DET-CHQ-EXENTOS  PIC 9(06)       COMP.          016800      
000850           06 WKS-DET-TASANETA     PIC 9(04)V9(04) COMP.          016900      
000851           06 WKS-DET-TASABRUTA    PIC 9(04)V9(04) COMP.          017000      
000852           06 WKS-DET-NETAANUAL    PIC 9(04)V9(04) COMP.          017100      
000853           06 WKS-DET-CONCEPTOS OCCURS 25 TIMES.                  017200      
000854              08 WKS-DET-CLAVE     PIC 9(04)       COMP.          017300      
000855              08 WKS-DET-NUMMOV    PIC 9(08)       COMP.          017400      
000856              08 WKS-DET-IMPORTE   PIC S9(15)V99   COMP.          017500      
000857                                                                  017600      
000858 01  WKS-TRA-SDOS084.                                             017700      
000859     02 WKS-TRA-FUNCION            PIC 9(02)       COMP.          017800      
000860     02 WKS-TRA-TOTREG             PIC 9(08)       COMP.          017900      
000861     02 FILLER                     PIC X(413)          .          018000      
000862                                                                  018100      
000863*                                                                 018200      
000864*================================================================ 018300      
000865*             REGISTRO DE ENTRADA Y SALIDA DE LA LIBRERIA       = 018400      
000866*================================================================ 018500      
000867*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000868* COPY "S151/FORMATO/LIBRERIA/CONSULTA/SALDOS.".                  018600      
000869                                                                  000100      
000870*================================================================ 000200      
000871*   VARIABLES PARA LIBRERIA DE CONSULTA SALDOS X CONTRATO       = 000300      
000872*                                                               = 000400      
000873*                                                               = 000500      
000874*  EL CAMPO DE FUNCION ESPECIFICA EL TIPO DE ACCION A REALIZAR, = 000600      
000875*  LOS POSIBLES VALORES QUE PUEDE ASUMIR DICHO CAMPO SON :      = 000700      
000876*                                                               = 000800      
000877*  01 INICIO DE PROCESO   ( PRIMERA FUNCION A ENVIAR )          = 000900      
000878*  02 CONSULTA POR SISTEMA-PRODUCTO-INSTRUMENTO-MONEDA          = 001000      
000879*                                                               = 001300      
000880*================================================================ 001400      
000881                                                                  001500      
000882 77  W77-RESULT-S151               PIC S9(11) BINARY.             001550      
000883                                                                  001570      
000884 01  WKS-SDO-X-CONTRATO.                                          001600      
000885     03 WKS-SDO-FUNCION            PIC 9(02) COMP.                001700      
000886     03 WKS-SDO-SISTORIG           PIC 9(04) COMP.                001800      
000887     03 WKS-SDO-SISTEMA            PIC 9(04) COMP.                001900      
000888     03 WKS-SDO-PRODUCTO           PIC 9(04) COMP.                002000      
000889     03 WKS-SDO-INSTRUMENTO        PIC 9(04) COMP.                002100      
000890     03 WKS-SDO-MONEDA             PIC 9(04) COMP.                002200      
000891     03 WKS-SDO-CONTRATO           PIC 9(20) COMP.                002300      
000892     03 WKS-SDO-FECHA              PIC 9(06) COMP.                002400      
000893     03 WKS-SDO-CONCEPTO           PIC 9(02) COMP.                002450      
000894     03 WKS-SDO-DATOS.                                            002500      
000895        05 WKS-SDO-SUCPROM         PIC 9(04) COMP.                002600      
000896        05 WKS-SDO-DIAS-CICLO      PIC 9(02) COMP.                002700      
000897        05 WKS-SDO-CHQ-EXENTOS     PIC 9(06) COMP.                002800      
000898        05 WKS-SDO-TASANETA        PIC 9(04)V9(04) COMP.          002900      
000899        05 WKS-SDO-TASABRUTA       PIC 9(04)V9(04) COMP.          003000      
000900        05 WKS-SDO-NETAANUAL       PIC 9(04)V9(04) COMP.          003100      
000901        05 WKS-SDO-CONCEPTOS       OCCURS 25 TIMES.               003200      
000902           07 WKS-SDO-CLAVE        PIC 9(04) COMP.                003300      
000903           07 WKS-SDO-NUMMOV       PIC 9(08) COMP.                003400      
000904           07 WKS-SDO-IMPORTE      PIC S9(15)V9(02) COMP.         003500      
000905                                                                  003600      
000906*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000907                                                                  018700      
000908*=================================================================018800      
000909*                  INICIA PROCEDURE DIVISION                     =018900      
000910*=================================================================019000      
000911                                                                  019100      
000912 PROCEDURE DIVISION.                                              019200      
000913                                                                  019300      
000914 00000-INICIO.                                                    019400      
000915*=============                                                    019500      
000916*                                                                 019600      
000917    PERFORM 01000-PROC-INICIO.                                    019700      
000918    PERFORM 02000-PROCESO.                                        019800      
000919    PERFORM 03000-PROC-FIN.                                       019900      
000920    STOP RUN.                                                     020000      
000921*                                                                 020100      
000922 01000-PROC-INICIO.                                               020200      
000923*==================                                               020300      
000924*    MOVE "S151"                  TO SISTEMA-LJ.                  020400      
000925     MOVE "P312"                  TO PASO-LJ   .                  020410      
000926     MOVE 1                       TO MTP-LJ    .                  020420      
000927     MOVE "O"                     TO TIPO-LJ   .                  020430      
000928     MOVE 040401                  TO CODIGO-LJ .                  020440      
000929     MOVE SPACES                  TO TEXTO-LJ  .                  020450      
000930                                                                  020460      
000931     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     020500      
000932     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      020600      
000933                                                                  020620      
000934     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      020640      
000935            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".       020660      
000936                                                                  020680      
000937     MOVE "S151L001CTL"            TO WKS-LIBID.                  020700      
000938     CALL "DAME_TIT IN CTLVER"  USING  WKS-LIBID, WKS-NOMBLIB     020800      
000939                                GIVING W77-ERR-CTLVER.            020900      
000940     IF W77-ERR-CTLVER = 0                                        021000      
000941        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    021100      
000942     ELSE                                                         021200      
000943        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                021300      
000944               "(S151)S151/OBJECT/L001/LIBCONTROL ON CMEMP".      021400      
000945                                                                  021500      
000946     MOVE ZERO                     TO W77-RESULT-LIBCON.          021600      
000947     MOVE 01                       TO WKS-B01-FUNCION             021700      
000948     MOVE 500                      TO WKS-B01-SISTEMA             021800      
000949                                                                  021900      
000950                                                                  022000      
000951     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     022100      
000952                                     GIVING W77-RESULT-LIBCON.    022200      
000953                                                                  022300      
000954     MOVE WKS-B01-FECCON           TO WKS-FECHA-LINEA.            022400      
000955     MOVE WKS-B01-FECPRO151        TO WKS-FECHA-PROC.             022500      
000956     MOVE ZERO                     TO W77-RESULT-LIBCON.          022600      
000957     MOVE 01                       TO WKS-B03-FUNCION             022700      
000958     MOVE 500                      TO WKS-B03-SISTEMA             022800      
000959     CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN     022900      
000960                                     GIVING W77-RESULT-LIBCON.    023000      
000961     IF W77-RESULT-LIBCON = 0                                     023100      
000962        MOVE WKS-B03-NOMBDSAL     TO WKS-NOMBD.                   023200      
000963                                                                  023300      
000964     CHANGE ATTRIBUTE TITLE       OF BASESDO TO WKS-NOMBASE-SDO   023400      
000965     OPEN INQUIRY BASESDO                                         023500      
000966          ON EXCEPTION                                            023600      
000967             MOVE 1                TO W77-ERROR-BASE              023700      
000968             MOVE 3                TO W77-RESULT-S151             023800      
000969             PERFORM 900000-CHE-STA.                              023900      
000970                                                                  024000      
000971     MOVE WKS-FECHA-AAMMDD         TO WKS-FEC-S084.               024100      
000972     CHANGE ATTRIBUTE TITLE OF SALDOS084 TO WKS-TIT-SDOS084.      024200      
000973                                                                  024300      
000974     OPEN OUTPUT SALDOS084.                                       024400      
000975                                                                  024500      
000976     PERFORM 01100-GRABA-HED.                                     024600      
000977*                                                                 024700      
000978 01100-GRABA-HED.                                                 024800      
000979*===============                                                  024900      
000980*                                                                 025000      
000981     MOVE 01            TO    WKS-HED-FUNCION                     025100      
000982     MOVE 151           TO    WKS-HED-SISORIGEN                   025200      
000983     MOVE 084           TO    WKS-HED-SISTEMA                     025300      
000984     MOVE WKS-FECHA-PROC TO   WKS-HED-FECHA                       025400      
000985                                                                  025500      
000986     WRITE REG-SALDOS084 FROM WKS-HED-SDOS084.                    025600      
000987*                                                                 025700      
000988 02000-PROCESO.                                                   025800      
000989*=============                                                    025900      
000990*                                                                 026000      
000991     SET B80SXEDOCTA   TO BEGINNING.                              026100      
000992     PERFORM 02100-DET-PROC UNTIL WKS-FIN = 1.                    026200      
000993*                                                                 026300      
000994 02100-DET-PROC.                                                  026400      
000995*==============                                                   026500      
000996*                                                                 026600      
000997     PERFORM 02110-LIMPIA-VARIABLES.                              026700      
000998                                                                  026800      
000999     PERFORM 02120-LEE-NEXT-B80.                                  026900      
001000                                                                  027000      
001001     IF WKS-FIN = 0                                               027100      
001002        PERFORM 02130-DATOS-B80                                   027200      
001003        PERFORM 02140-DATOS-B20                                   027300      
001004        IF B20-SDO-APUIMP > 0                                     027400      
001005           PERFORM 02150-DATOS-B21                                027500      
001006           PERFORM 02160-DET-B21 UNTIL W77-ERROR-BASE > 0         027600      
001007           PERFORM 02170-GRABA-REGDET.                            027700      
001008*                                                                 027800      
001009 02110-LIMPIA-VARIABLES.                                          027900      
001010*=======================                                          028000      
001011*                                                                 028100      
001012     MOVE ZERO                     TO WKS-DET-SUCPROM             028200      
001013                                      WKS-DET-DIAS-CICLO          028300      
001014                                      WKS-DET-TASANETA            028400      
001015                                      WKS-DET-TASABRUTA           028500      
001016                                      WKS-DET-NETAANUAL           028600      
001017                                      W77-IND                     028700      
001018                                      W77-FECHA-VALIDA            028800      
001019                                      W77-ERROR-BASE              028900      
001020                                      WKS-DET-CHQ-EXENTOS.        029000      
001021     PERFORM 02110-LIMPIA-CONCEPTOS                               029100      
001022             VARYING W77-IND2 FROM 1 BY 1                         029200      
001023             UNTIL W77-IND2 > 15.                                 029300      
001024                                                                  029400      
001025     MOVE 02               TO         WKS-DET-FUNCION.            029500      
001026     MOVE 151              TO         WKS-DET-SISORIGEN.          029600      
001027     MOVE 084              TO         WKS-DET-SISTEMA.            029700      
001028     MOVE 1                TO         WKS-DET-PRODUCTO            029800      
001029                                      WKS-SDO-PRODUCTO            029900      
001030                                      WKS-DET-MONEDA              030000      
001031                                      WKS-SDO-MONEDA.             030100      
001032     MOVE 3                TO         WKS-DET-INSTRUMENTO         030200      
001033                                      WKS-SDO-INSTRUMENTO.        030300      
001034 02110-LIMPIA-CONCEPTOS.                                          030400      
001035*=======================                                          030500      
001036*                                                                 030600      
001037     MOVE ZERO             TO         WKS-DET-CLAVE(W77-IND2)     030700      
001038                                      WKS-DET-NUMMOV(W77-IND2)    030800      
001039                                      WKS-DET-IMPORTE(W77-IND2).  030900      
001040                                                                  031000      
001041 02120-LEE-NEXT-B80.                                              031100      
001042*==================                                               031200      
001043                                                                  031300      
001044     FIND NEXT B80SXEDOCTA AT                                     031400      
001045                         B80-SDO-PRD    = WKS-SDO-PRODUCTO        031500      
001046                     AND B80-SDO-INS    = WKS-SDO-INSTRUMENTO     031600      
001047       ON EXCEPTION                                               031700      
001048          MOVE 1                  TO  WKS-FIN.                    031800      
001049                                                                  031900      
001050*                                                                 032000      
001051 02130-DATOS-B80.                                                 032100      
001052*===============                                                  032200      
001053*                                                                 032300      
001054       MOVE B80-SDO-KEYCON        TO  WKS-DET-CONTRATO            032400      
001055                                      WKS-SDO-CONTRATO.           032500      
001056       MOVE B80-SDO-FECCON        TO  WKS-FECHA-PROC.             032600      
001057       MOVE WKS-FECHA-AAMMDD      TO  WKS-DET-FECHA.              032700      
001058       MOVE B80-SDO-DATOS         TO  WKS-INFADI-S500.            032800      
001059       MOVE WKS-ADI500-DIASCICLO  TO  WKS-DET-DIAS-CICLO.         032900      
001060       MOVE WKS-ADI500-TASRENET   TO  WKS-DET-TASANETA.           033000      
001061       MOVE WKS-ADI500-TASREBRU   TO  WKS-DET-TASABRUTA.          033100      
001062       MOVE WKS-ADI500-TASREANO   TO  WKS-DET-NETAANUAL.          033200      
001063*                                                                 033300      
001064 02140-DATOS-B20.                                                 033400      
001065*===============                                                  033500      
001066*                                                                 033600      
001067    PERFORM 02142-FIND-B20.                                       033700      
001068                                                                  033800      
001069    IF W77-ERROR-BASE = 0                                         033900      
001070       MOVE B20-SDO-SUCPRO TO WKS-DET-SUCPROM                     034000      
001071       MOVE ZERO           TO W77-IND3                            034100      
001072       PERFORM 02144-MUEVE-CONCEPTOS                              034200      
001073                        VARYING W77-IND FROM 1 BY 1               034300      
001074                        UNTIL W77-IND > 10.                       034400      
001075*                                                                 034500      
001076 02142-FIND-B20.                                                  034600      
001077*==============                                                   034700      
001078*                                                                 034800      
001079     FIND FIRST B20SXSDOMENCON AT                                 034900      
001080                B20-SDO-KEYCON   = WKS-SDO-CONTRATO    AND        035000      
001081                B20-SDO-KEYAM    = WKS-AAMM-PROC       AND        035100      
001082                B20-SDO-KEYPRD   = WKS-SDO-PRODUCTO    AND        035200      
001083                B20-SDO-KEYINS   = WKS-SDO-INSTRUMENTO AND        035300      
001084                B20-SDO-KEYMON   = WKS-SDO-MONEDA                 035400      
001085             ON EXCEPTION                                         035500      
001086                MOVE 1             TO W77-ERROR-BASE              035600      
001087                IF DMSTATUS(NOTFOUND)                             035700      
001088                   NEXT SENTENCE                                  035800      
001089                ELSE                                              035900      
001090                   MOVE 6          TO W77-RESULT-S151             036000      
001091                   PERFORM 900000-CHE-STA.                        036100      
001092                                                                  036200      
001093     IF W77-ERROR-BASE = 0                                        036300      
001094        MOVE ZERO                  TO W77-IND3                    036400      
001095        PERFORM 02144-MUEVE-CONCEPTOS                             036500      
001096                                   VARYING W77-IND FROM 1 BY 1    036600      
001097                                   UNTIL W77-IND > 10             036700      
001098                                                                  036800      
001099        IF B20-SDO-APUIMP > 0                                     036900      
001100           PERFORM 02150-DATOS-B21                                037000      
001101           PERFORM 02160-DET-B21                                  037100      
001102                                   UNTIL W77-ERROR-BASE > 0.      037200      
001103*                                                                 037300      
001104 02144-MUEVE-CONCEPTOS.                                           037400      
001105*=====================                                            037500      
001106*                                                                 037600      
001107     MOVE W77-IND                 TO W77-CONCEPTOS-VALIDOS.       037700      
001108     IF W88-CONCEPTOS                                             037800      
001109        IF B20-SDO-SD(W77-IND) > 0 OR B20-SDO-CNTMOV(W77-IND) > 0 037900      
001110           COMPUTE W77-IND3 = W77-IND3 + 1                        038000      
001111           MOVE W77-IND            TO WKS-DET-CLAVE(W77-IND3)     038100      
001112           MOVE B20-SDO-CNTMOV(W77-IND) TO                        038200      
001113                                     WKS-DET-NUMMOV(W77-IND3)     038300      
001114           MOVE B20-SDO-SD(W77-IND) TO                            038400      
001115                                     WKS-DET-IMPORTE(W77-IND3).   038500      
001116 02150-DATOS-B21.                                                 038600      
001117*===============                                                  038700      
001118*                                                                 038800      
001119     FIND FIRST B21SXSDMENCON1 AT                                 038900      
001120                B21-SDO-KEYCON        = WKS-SDO-CONTRATO      AND 039000      
001121                B21-SDO-KEYAM         = WKS-AAMM-PROC         AND 039100      
001122                B21-SDO-KEYPRD        = WKS-SDO-PRODUCTO      AND 039200      
001123                B21-SDO-KEYINS        = WKS-SDO-INSTRUMENTO       039300      
001124             ON EXCEPTION                                         039400      
001125                MOVE 1             TO W77-ERROR-BASE              039500      
001126                IF DMSTATUS(NOTFOUND)                             039600      
001127                   NEXT SENTENCE                                  039700      
001128                ELSE                                              039800      
001129                   MOVE 6          TO W77-RESULT-S151             039900      
001130                   PERFORM 900000-CHE-STA.                        040000      
001131                                                                  040100      
001132                                                                  040200      
001133 02160-DET-B21.                                                   040300      
001134*=============                                                    040400      
001135*                                                                 040500      
001136     MOVE B21-SDO-KEYIND           TO W77-IND.                    040600      
001137     PERFORM 02162-RESTO-B21                                      040700      
001138             VARYING W77-IND1 FROM 1 BY 1                         040800      
001139             UNTIL   W77-IND1 > 12 OR                             040900      
001140                     W77-IND3 = 25.                               041000      
001141                                                                  041100      
001142     PERFORM 02164-NEXT-B21.                                      041200      
001143                                                                  041300      
001144 02162-RESTO-B21.                                                 041400      
001145*================                                                 041500      
001146*                                                                 041600      
001147     COMPUTE W77-CONCEPTO = W77-IND * 12 + W77-IND1 - 2.          041700      
001148     MOVE W77-CONCEPTO          TO W77-CONCEPTOS-VALIDOS.         041800      
001149     IF W88-CONCEPTOS                                             041900      
001150        IF B21-SDO-SD(W77-IND1) > 0 OR B21-SDO-CNTMOV(W77-IND1) >0042000      
001151           COMPUTE W77-IND3 = W77-IND3 + 1                        042100      
001152           MOVE W77-CONCEPTO          TO WKS-DET-CLAVE(W77-IND3)  042200      
001153           MOVE B21-SDO-CNTMOV(W77-IND1)                          042300      
001154                                   TO WKS-DET-NUMMOV(W77-IND3)    042400      
001155           MOVE B21-SDO-SD(W77-IND1)                              042500      
001156                                   TO WKS-DET-IMPORTE(W77-IND3).  042600      
001157*                                                                 042700      
001158 02164-NEXT-B21.                                                  042800      
001159*==============                                                   042900      
001160*                                                                 043000      
001161     FIND NEXT  B21SXSDMENCON1 AT                                 043100      
001162                B21-SDO-KEYCON        = WKS-SDO-CONTRATO      AND 043200      
001163                B21-SDO-KEYAM         = WKS-AAMM-PROC         AND 043300      
001164                B21-SDO-KEYPRD        = WKS-SDO-PRODUCTO      AND 043400      
001165                B21-SDO-KEYINS        = WKS-SDO-INSTRUMENTO       043500      
001166             ON EXCEPTION                                         043600      
001167                MOVE 1             TO W77-ERROR-BASE              043700      
001168                IF DMSTATUS(NOTFOUND)                             043800      
001169                   NEXT SENTENCE                                  043900      
001170                ELSE                                              044000      
001171                   MOVE 6          TO W77-RESULT-S151             044100      
001172                   PERFORM 900000-CHE-STA.                        044200      
001173*                                                                 044300      
001174  02170-GRABA-REGDET.                                             044400      
001175*===================                                              044500      
001176                                                                  044600      
001177     MOVE WKS-DET-KEYID   TO REG-KEY-ID.                          044700      
001178     MOVE WKS-DET-KEYCTO  TO REG-KEY-CTO.                         044800      
001179     MOVE WKS-DET-RESTO   TO REG-RESTO-SDOS84.                    044900      
001180     MOVE ZERO            TO W77-ERROR-ARCH                       045000      
001181     WRITE REG-SALDOS084  .                                       045100      
001182     ADD 1             TO WKS-CONT-GRAB.                          045400      
001183*                                                                 045500      
001184  03000-PROC-FIN.                                                 045600      
001185*===============                                                  045700      
001186*                                                                 045800      
001187     MOVE  09            TO   WKS-TRA-FUNCION.                    045900      
001188     MOVE  WKS-CONT-GRAB TO   WKS-TRA-TOTREG.                     046000      
001189     WRITE REG-SALDOS084 FROM WKS-TRA-SDOS084.                    046100      
001190                                                                  046200      
001191     CLOSE SALDOS084 WITH SAVE.                                   046300      
001192     CLOSE  BASESDO.                                              046400      
001193*                                                                 046500      
001194*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001195* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO   78000.         046600      
001196 900000-CHE-STA.                                                  068000      
001197     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
001198     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
001199     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
001200                                                                  069300      
001201     IF WKS-ERR-DMSII > ZEROS                                     070000      
001202        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
001203                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
001204                           " " WKS-ERR-DMSII                      073000      
001205                "TIPO        " WKS-ERR-BD                         074000      
001206                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
001207        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
001208        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
001209                                                                  078000      
001210*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001211                                                                  046700      
