000001$SET LIST LINEINFO MAP XREF                                       000100      
000002$SET OPTIMIZE                                                     000200      
000003$SET LISTOMITTED                                                  000300      
000004***************************************************************** 000400      
000005**                                                             ** 000500      
000006**         @@@@@@   @@@@@@     @@@@@@@@    @@@@@@              ** 000600      
000007**         @@    @@ @ @@@@     @@   @@@    @ @@@@              ** 000700      
000008**         @@         @@@@     @@            @@@@              ** 000800      
000009**          @@@@@@    @@@@      @@@@@@@      @@@@              ** 000900      
000010**               @@   @@@@            @@     @@@@              ** 001000      
000011**        @@     @@   @@@@      @@    @@     @@@@              ** 001100      
000012**          @@@@@@   @@@@@@      @@@@@@     @@@@@@             ** 001200      
000013***************************************************************** 001300      
000014***************************************************************** 001400      
000015**              @@@@    @@@@@    @@@@@     @@@@@               ** 001500      
000016**             @@  @@  @@   @@   @@  @@   @@   @@              ** 001600      
000017**             @@  @@  @@   @@       @@   @@   @@              ** 001700      
000018**             @@@@@   @@   @@   @@@@@@   @@   @@              ** 001800      
000019**             @@      @@   @@   @@       @@   @@              ** 001900      
000020**             @@      @@   @@   @@       @@   @@              ** 002000      
000021**             @@       @@@@@     @@@@@    @@@@@               ** 002100      
000022**                                                             ** 002200      
000023***************************************************************** 002300      
000024**       RECEPCION DE MENSAJES PARA REGISTRO A LA L002         ** 002400      
000025***************************************************************** 002500      
000026 IDENTIFICATION DIVISION.                                         002600      
000027 PROGRAM-ID.        S151-P020.                                    002700      
000028 AUTHOR.            CHRISTIAN DUENAS.                             002800      
000029 DATE-WRITTEN.      FEBRERO 2018.                                 002900      
000030 ENVIRONMENT DIVISION.                                            003000      
000031 INPUT-OUTPUT SECTION.                                            003100      
000032 FILE-CONTROL.                                                    003200      
000033     SELECT L02-MONITOR ASSIGN TO DISK.                           003300      
000034     SELECT L01-DISPLAY ASSIGN TO DISK.                           003400      
000035                                                                  003500      
000036 DATA DIVISION.                                                   003600      
000037 FILE SECTION.                                                    003700      
000038     FD L01-DISPLAY VALUE OF PROTECTION    IS PROTECTED,          003800      
000039                    VALUE TITLE IS WKS-RUT-L01.                   003900      
000040                                                                  004000      
000041     01 REG-DISPLAY                   PIC X(180).                 004100      
000042                                                                  004200      
000043     FD L02-MONITOR VALUE OF PROTECTION    IS PROTECTED,          004300      
000044                    VALUE TITLE IS WKS-RUT-L02.                   004400      
000045     01 REG-MONITOR.                                              004500      
000046          05 WKS-SENTIDO-MSG            PIC X(30).                004600      
000047          05 WKS-ESPACIO1               PIC X(01).                004700      
000048          05 WKS-FEC-MON                PIC 9(06).                004800      
000049          05 WKS-HRS-MON                PIC 9(08).                004900      
000050          05 WKS-ESPACIO2               PIC X(01).                005000      
000051          05 WKS-LLAVE-MSG              PIC X(10).                005100      
000052          05 WKS-ESPACIO3               PIC X(01).                005200      
000053          05 WKS-DATOS-MSJ              PIC X(1000).              005300      
000054                                                                  005400      
000055 WORKING-STORAGE SECTION.                                         005500      
000056   01 WKS-REG-MSG                PIC X(864) WITH LOWER-BOUNDS.    005600      
000057   01 WKS-REG-MSG-R REDEFINES WKS-REG-MSG.                        005700      
000058       03 WKS-HDR-MSG.                                            005800      
000059           05 WKS-HDR-PREFIJO                       PIC X(001).   005900      
000060           05 WKS-HDR-APLDEST                       PIC X(001).   006000      
000061           05 WKS-HDR-CCRDEST                       PIC 9(002).   006100      
000062           05 WKS-HDR-LSNORGN                       PIC 9(004).   006200      
000063           05 WKS-HDR-LSNORGN-H REDEFINES                         006300      
000064         WKS-HDR-LSNORGN                       PIC 9(08) COMP.    006400      
000065           05 WKS-HDR-STATION                       PIC X(008).   006500      
000066           05 WKS-HDR-STATION-R REDEFINES WKS-HDR-STATION.        006600      
000067               07 WKS-HDR-STA-TIPO                  PIC X(001).   006700      
000068               07 WKS-HDR-STA-SUC                   PIC 9(004).   006800      
000069               07 WKS-HDR-STA-PRIV                  PIC X(001).   006900      
000070               07 WKS-HDR-STA-CAJA                  PIC 9(002).   007000      
000071           05 WKS-HDR-CCRORGN                       PIC 9(002).   007100      
000072           05 WKS-HDR-COPORGN                       PIC 9(002).   007200      
000073           05 WKS-HDR-FACULTAD                      PIC X(002).   007300      
000074           05 WKS-HDR-APLORIG                       PIC X(001).   007400      
000075           05 WKS-HDR-RSLTDO                        PIC 9(002).   007500      
000076               88 W88-HDR-VINO-TERM             VALUE 11, 12.     007600      
000077               88 W88-HDR-VINO-APLI             VALUE 02, 04.     007700      
000078               88 W88-MSGRES-REDFOR             VALUE 12.         007800      
000079               88 W88-MSGRES-MAS                VALUE 3.          007900      
000080               88 W88-MSGRES-TER                VALUE 1.          008000      
000081               88 W88-MSGRES-ERR                VALUE 31, 32, 33. 008100      
000082           05 WKS-HDR-MASCARA                       PIC X(005).   008200      
000083           05 WKS-HDR-PASSWORD                      PIC X(006).   008300      
000084       03 WKS-MSG-TEXTO                             PIC X(828).   008400      
000085       03 WKS-MSG-TEXTO-R REDEFINES WKS-MSG-TEXTO.                008500      
000086           05 WKS-ACA.                                            008600      
000087               10 WKS-ACA-DESTINO                  PIC 9(06).     008700      
000088               10 WKS-ACA-ORIGEN                   PIC 9(06).     008800      
000089           05 WKS-SA0.                                            008900      
000090               10 WKS-SA0-TRN-DEST                 PIC 9(09).     009000      
000091               10 WKS-SA0-TRN-DEST-R REDEFINES WKS-SA0-TRN-DEST.  009100      
000092                   15 WKS-SA0-TRN-DSIS             PIC 9(04).     009200      
000093                       88 W88-SA0-TRN-DSIS-S151     VALUE 0151.   009300      
000094                   15 WKS-SA0-TRN-DCOD             PIC 9(02).     009400      
000095                   15 WKS-SA0-TRN-DSCOD            PIC 9(03).     009500      
000096               10 WKS-SA0-TRN-ORIG                 PIC 9(09).     009600      
000097               10 WKS-SA0-TRN-DEST-O REDEFINES WKS-SA0-TRN-ORIG.  009700      
000098                   15 WKS-SA0-TRN-OSIS             PIC 9(04).     009800      
000099                   15 WKS-SA0-TRN-OCOD             PIC 9(02).     009900      
000100                   15 WKS-SA0-TRN-OSCOD            PIC 9(03).     010000      
000101               10 WKS-SA0-DIRECCION                PIC 9(01).     010100      
000102                   88 W88-SA0-ALTA                 VALUE  1.      010200      
000103                   88 W88-SA0-RESP                 VALUE  2.      010300      
000104                   88 W88-SA0-BAJA                 VALUE  3.      010400      
000105                   88 W88-SA0-RES-BAJA             VALUE  4.      010500      
000106               10 WKS-SA0-LONG                     PIC 9(04).     010600      
000107               10 WKS-SA0-TIEMPO-ESPERA            PIC 9(05).     010700      
000108               10 WKS-SA0-RESPUESTA                PIC 9(02).     010800      
000109           05 WKS-SA2.                                            010900      
000110               10 WKS-SA2-ID-FMT.                                 011000      
000111                   15 WKS-SA2-IDENT-FMT             PIC 9(02).    011100      
000112                   15 WKS-SA2-RECONOC               PIC 9(01).    011200      
000113               10 WKS-SA2-VERSION                  PIC X(01).     011300      
000114               10 WKS-SA2-CLASE                    PIC 9(01).     011400      
000115               10 WKS-SA2-RESULTADO                PIC 9(01).     011500      
000116               10 WKS-SA2-MODO                     PIC 9(01).     011600      
000117               10 WKS-SA2-IDENTIFICACION.                         011700      
000118                   15 WKS-SA2-SUCURSAL             PIC 9(04).     011800      
000119                   15 WKS-SA2-IDEN-CAJA            PIC 9(03).     011900      
000120                   15 WKS-SA2-IDEN-CAJA-R                         012000      
000121                                     REDEFINES WKS-SA2-IDEN-CAJA. 012100      
000122                       20 WKS-SA2-PRIV              PIC X(01).    012200      
000123                       20 WKS-SA2-CAJA              PIC 9(02).    012300      
000124                   15 WKS-SA2-TRN-NUM              PIC 9(08).     012400      
000125                   15 WKS-SA2-FEC-HR               PIC 9(12).     012500      
000126                   15 WKS-SA2-FEC-HR-R REDEFINES  WKS-SA2-FEC-HR. 012600      
000127                       20 WKS-SA2-FECHA             PIC 9(06).    012700      
000128                       20 WKS-SA2-HORA              PIC 9(06).    012800      
000129               10 WKS-SA2-MODALIDAD                PIC 9(02).     012900      
000130               10 WKS-SA2-IEFE-NOPE                PIC X(10).     013000      
000131               10 WKS-SA2-IEFE-NOPE-R              REDEFINES      013100      
000132                   WKS-SA2-IEFE-NOPE.                             013200      
000133                   15 WKS-SA2-INDEFECTIVO          PIC X(01).     013300      
000134                   15 WKS-SA2-FILLER               PIC X(01).     013400      
000135                   15 WKS-SA2-OPERADOR             PIC X(08).     013500      
000136               10 WKS-SA2-VER-OPC                  PIC X(01).     013600      
000137           05 WKS-AREA-USUARIO                     PIC X(739).    013700      
000138****************************************************************  013800      
000139*                   VARIABLES DIALOGO S264 l-737               *  013900      
000140****************************************************************  014000      
000141 01 WKS-DATOS-S151.                                               014100      
000142    05 A01-MOV-FUNCION           PIC 9(02).                       014200      
000143    05 A01-MOV-SISTEMA           PIC 9(04).                       014300      
000144    05 A01-MOV-PRODUCTO          PIC 9(04).                       014400      
000145    05 A01-MOV-INSTRUMENTO       PIC 9(02).                       014500      
000146    05 A01-MOV-SUCPROM           PIC 9(04).                       014600      
000147    05 A01-MOV-CONTRATO          PIC 9(16).                       014700      
000148    05 A01-MOV-CONTRATO-R REDEFINES A01-MOV-CONTRATO.             014800      
000149       07 FILLER                 PIC X(04).                       014900      
000150       07 A01-MOV-CONTRATO-SUC   PIC 9(04).                       015000      
000151       07 A01-MOV-CONTRATO-NUM   PIC 9(08).                       015100      
000152    05 A01-MOV-CVETRAN1          PIC 9(04).                       015200      
000153    05 A01-MCTRAN1 REDEFINES  A01-MOV-CVETRAN1 PIC 9(04).         015300      
000154    05 A01-MOV-IND-LEYE1         PIC 9(02).                       015400      
000155    05 A01-MOV-ESQ-CONT1         PIC 9(04).                       015500      
000156    05 A01-MOV-IMPORTE1          PIC 9(14)V99.                    015600      
000157    05 A01-MIMP1 REDEFINES  A01-MOV-IMPORTE1 PIC 9(14)V99.        015700      
000158    05 A01-MOV-CVETRAN2          PIC 9(04).                       015800      
000159    05 A01-MOV-IND-LEYE2         PIC 9(02).                       015900      
000160    05 A01-MOV-ESQ-CONT2         PIC 9(04).                       016000      
000161    05 A01-MOV-IMPORTE2          PIC 9(14)V99.                    016100      
000162    05 A01-MOV-CVETRAN3          PIC 9(04).                       016200      
000163    05 A01-MOV-IND-LEYE3         PIC 9(02).                       016300      
000164    05 A01-MOV-ESQ-CONT3         PIC 9(04).                       016400      
000165    05 A01-MOV-IMPORTE3          PIC 9(14)V99.                    016500      
000166    05 A01-MOV-CVETRAN4          PIC 9(04).                       016600      
000167    05 A01-MOV-IND-LEYE4         PIC 9(02).                       016700      
000168    05 A01-MOV-ESQ-CONT4         PIC 9(04).                       016800      
000169    05 A01-MOV-IMPORTE4          PIC 9(14)V99.                    016900      
000170    05 A01-MOV-CVETRAN5          PIC 9(04).                       017000      
000171    05 A01-MOV-IND-LEYE5         PIC 9(02).                       017100      
000172    05 A01-MOV-ESQ-CONT5         PIC 9(04).                       017200      
000173    05 A01-MOV-IMPORTE5          PIC 9(14)V99.                    017300      
000174    05 A01-MOV-FECMOV            PIC 9(06).                       017400      
000175    05 A01-MOV-HORAMOV           PIC 9(06).                       017500      
000176    05 A01-MOV-FECCONT           PIC 9(06).                       017600      
000177    05 A01-MOV-FECVAL            PIC 9(06).                       017700      
000178    05 A01-MOV-NUM-AUTORIZA      PIC 9(08).                       017800      
000179    05 A01-MOV-NUM-AUT     REDEFINES A01-MOV-NUM-AUTORIZA.        017900      
000180       06 A01-MOV-AUTORIZA       PIC 9(07).                       018000      
000181       06 A01-MOV-AUTORIZA-FILL  PIC 9(01).                       018100      
000182    05 A01-MOV-AUTORI-3ERNIV     PIC 9(08).                       018200      
000183    05 A01-MOV-REFEREN           PIC 9(20).                       018300      
000184    05 A01-MOV-REFEREN-R REDEFINES A01-MOV-REFEREN.               018400      
000185       07 A01-MOV-INICIA-EFE     PIC 9(02).                       018500      
000186       07 A01-MOV-REFERENCIA     PIC 9(18).                       018600      
000187    05 A01-MOV-REF1 REDEFINES A01-MOV-REFEREN PIC 9(20).          018700      
000188    05 A01-MOV-CVEMDA            PIC 9(02).                       018800      
000189    05 A01-MOV-MDA-SUC           PIC 9(04).                       018900      
000190    05 A01-MOV-MDA-CTA           PIC 9(16).                       019000      
000191    05 A01-MOV-CVEMDE            PIC 9(02).                       019100      
000192    05 A01-MOV-SUC-INIC          PIC 9(04).                       019200      
000193    05 A01-MOV-CAJA-INIC         PIC 9(02).                       019300      
000194    05 A01-MOV-SUCOPER           PIC 9(04).                       019400      
000195    05 A01-MOV-CAJA-OPER         PIC 9(02).                       019500      
000196    05 A01-MOV-SUCTRAN           PIC 9(04).                       019600      
000197    05 A01-MOV-CAJA-TRAN         PIC 9(02).                       019700      
000198    05 A01-MOV-NOMINA-OPE        PIC 9(08).                       019800      
000199    05 A01-NOMOPE REDEFINES A01-MOV-NOMINA-OPE PIC 9(08).         019900      
000200    05 A01-MOV-ORIGEN            PIC 9(02).                       020000      
000201    05 A01-MOV-MONEDA            PIC 9(04).                       020100      
000202    05 A01-MOV-AUT-S151          PIC 9(08).                       020200      
000203    05 A01-MOVAUTS151 REDEFINES A01-MOV-AUT-S151.                 020300      
000204       06 A01-MOV-AUT-S151-2     PIC 9(02).                       020400      
000205       06 A01-MOV-AUT-S151-6     PIC 9(06).                       020500      
000206    05 A01-MOV-AUT-ELIM-S151     PIC 9(08).                       020600      
000207    05 A01-MOV-AUT-ANT-S151      PIC 9(08).                       020700      
000208    05 A01-MOV-TIPO-PROC         PIC 9(02).                       020800      
000209    05 A01-MOV-IND-SOBREGIRO     PIC 9(02).                       020900      
000210    05 A01-MOV-CVE-AVISO         PIC 9(04).                       021000      
000211    05 A01-MOV-IND-EDOCTA        PIC 9(02).                       021100      
000212    05 A01-MOV-IND-DATOS-ADIC    PIC 9(02).                       021200      
000213    05 A01-MOV-IND-CONTABILIZA   PIC 9(02).                       021300      
000214    05 A01-MOV-NUM-RENGLON       PIC 9(02).                       021400      
000215    05 A01-MOV-ACTIVIDAD         PIC 9(06).                       021500      
000216    05 A01-MOV-SECTOR            PIC 9(02).                       021600      
000217    05 A01-MOV-BANCA             PIC 9(02).                       021700      
000218    05 A01-MOV-FILLER-FUTURO     PIC X(16).                       021800      
000219    05 A01-MOV-FILLER-FUTURO-R REDEFINES A01-MOV-FILLER-FUTURO.   021900      
000220       07 FILLER                 PIC X(03).                       022000      
000221       07 A01-MOV-BCO-S264       PIC 9(06).                       022100      
000222       07 FILLER                 PIC X(01).                       022200      
000223       07 A01-MOV-BORI-S264      PIC 9(03).                       022300      
000224       07 A01-MOV-BDES-S264      PIC 9(03).                       022400      
000225    05 A01-MOV-NODO-ORIG         PIC 9(02).                       022500      
000226    05 A01-MOV-FILLER-USO-S151   PIC 9(10).                       022600      
000227    05 A01-MOV-FILLER-USO-S151R REDEFINES A01-MOV-FILLER-USO-S151.022700      
000228       07 A01-MOV-APU-DESC       PIC 9(08).                       022800      
000229       07 A01-MOV-STATUS         PIC 9(02).                       022900      
000230    05 A01-MOV-NOMINA-FUN1       PIC 9(08).                       023000      
000231    05 A01-MOV-NOMINA-FUN2       PIC 9(08).                       023100      
000232    05 A01-MOV-SIST-ORIG         PIC 9(04).                       023200      
000233    05 A01-MOV-PROD-ORIG         PIC 9(04).                       023300      
000234    05 A01-MOV-INST-ORIG         PIC 9(02).                       023400      
000235    05 A01-MOV-CVETR-ORIG        PIC 9(04).                       023500      
000236    05 A01-MOV-CONTRATO-TRAS     PIC 9(20).                       023600      
000237    05 A01-MOV-REFLOC-BNM        PIC X(14).                       023700      
000238    05 A01-USO-APLICACION        PIC X(96).                       023800      
000239    05 A01-MOV-LEYENDA1          PIC X(40).                       023900      
000240    05 A01-MOV-LEYENDA2          PIC X(40).                       024000      
000241    05 A01-MOV-LEYENDA3          PIC X(40).                       024100      
000242    05 A01-MOV-LEYENDA4          PIC X(40).                       024200      
000243    05 A01-MOV-LEYENDA5          PIC X(40).                       024300      
000244    05 A01-MOV-FILLER2-REDEFINES PIC X(19).                       024400      
000245****************************************************************  024500      
000246 01 MSG-SAL    PIC X(739).                                        024600      
000247 01 WKS-AREA-MSG-OBL-RES-L002 REDEFINES MSG-SAL.                  024700      
000248    03 MSG-SAL-RESULT-L002       PIC 9(02).                       024800      
000249    03 MSG-SAL-MENSAJE           PIC X(737).                      024900      
000250                                                                  025000      
000251 01 WS-ERRORES.                                                   025100      
000252    03 WS-ER01 PIC X(31) VALUE "SISTEMA NO HABILITADO EN S151  ". 025200      
000253    03 WS-ER02 PIC X(31) VALUE "FUNCION NO VALIDA              ". 025300      
000254    03 WS-ER03 PIC X(31) VALUE "TRANSACCION NO CATALOGADA      ". 025400      
000255    03 WS-ER04 PIC X(31) VALUE "FECHA CONTABLE NO VALIDA       ". 025500      
000256    03 WS-ER05 PIC X(31) VALUE "FALTA LA SUCURSAL PROMOTORA    ". 025600      
000257    03 WS-ER06 PIC X(31) VALUE "FALTA LA SUCURSAL OPERADORA    ". 025700      
000258    03 WS-ER07 PIC X(31) VALUE "EL IMPORTE ES 0                ". 025800      
000259    03 WS-ER08 PIC X(31) VALUE "FALTA REF S151 PARA ELIMINAR   ". 025900      
000260    03 WS-ER09 PIC X(31) VALUE "MOVIMINETO A ELIMINAR NO EXISTE". 026000      
000261 01 WS-ERRORES-R REDEFINES WS-ERRORES.                            026100      
000262    03 WS-ERROR PIC X(31) OCCURS 9 TIMES.                         026200      
000263                                                                  026300      
000264 01 W77-RESULT-B01               PIC 9(08).                       026400      
000265 01 WKS-ACA-DESTINO-ANT          PIC 9(06).                       026500      
000266 01 WKS-ACA-ORIGEN-ANT           PIC 9(06).                       026600      
000267 01 WKS-HDR-CCRDEST-ANT          PIC 9(02).                       026640      
000268 01 WKS-HDR-COPORGN-ANT          PIC 9(02).                       026680      
000269 77 W77-151-RESULT                PIC S9(11) BINARY.              026700      
000270                                                                  026800      
000271***************************************************************** 026900      
000272**                VARIABLES DE TRABAJO                         ** 027000      
000273***************************************************************** 027100      
000274 01 WKS-PRIMER-VEZ               PIC 9(02).                       027200      
000275                                                                  027300      
000276 77 W77-HI                       PIC 9(02) VALUE 0.               027400      
000277    88 W88-HI-2              VALUE 2.                             027500      
000278    88 W88-HI-3              VALUE 3.                             027600      
000279    88 W88-HI-4              VALUE 4,6.                           027700      
000280    88 W88-HI-6              VALUE 6.                             027800      
000281                                                                  027900      
000282 01 CONT-REG-DISPLAY             PIC 9(06).                       028000      
000283 01 WKS-STATUS                   PIC 9(02).                       028100      
000284*VARIABLES DE FECHA Y HORA DE PASO                                028200      
000285 01 WKS-DATO                     PIC 9(06).                       028300      
000286 01 WKS-DATOR              REDEFINES WKS-DATO.                    028400      
000287   10 WKS-DATO-AMO               PIC 9(02).                       028500      
000288   10 WKS-DATO-MES               PIC 9(02).                       028600      
000289   10 WKS-DATO-DIA               PIC 9(02).                       028700      
000290                                                                  028800      
000291 01 WKS-HORMAQ-HMSD              PIC 9(08).                       028900      
000292 01 WKS-HORA-R             REDEFINES WKS-HORMAQ-HMSD.             029000      
000293      10  WKS-HORA-H             PIC 9(02).                       029100      
000294      10  WKS-HORA-M             PIC 9(02).                       029200      
000295      10  WKS-HORA-S             PIC 9(02).                       029300      
000296      10  WKS-HORA-D             PIC 9(02).                       029400      
000297                                                                  029500      
000298 01  WKS-FECHR-MAQ.                                               029600      
000299       05  WKS-FEC-MAQ-DG        PIC 9(06).                       029700      
000300       05  WKS-HR-MAQ-DG         PIC 9(08).                       029800      
000301 01  WKS-FECHR-ENV-DG      REDEFINES WKS-FECHR-MAQ.               029900      
000302       05  WKS-FEC-ENV-MQDG      PIC 9(12).                       030000      
000303       05  WKS-HR-ENV-DG         PIC 9(02).                       030100      
000304                                                                  030200      
000305 01 WKS-DIS-TEXTO                PIC X(140) .                     030300      
000306                                                                  030400      
000307 01 REGISTRO-DIS-DETALLE.                                         030500      
000308    10 WKS-DIS-FECHA-S           PIC ZZ.                          030600      
000309    10 WKS-DIS-FECHA-A           PIC ZZ.                          030700      
000310    10 FILLER                    PIC X(01) VALUE "/".             030800      
000311    10 WKS-DIS-FECHA-M           PIC ZZ.                          030900      
000312    10 FILLER                    PIC X(01) VALUE "/".             031000      
000313    10 WKS-DIS-FECHA-D           PIC ZZ.                          031100      
000314    10 FILLER                    PIC X(05) VALUE SPACES.          031200      
000315    10 WKS-DIS-HORA              PIC 9(02).                       031300      
000316    10 FILLER                    PIC X(01) VALUE ":".             031400      
000317    10 WKS-DIS-MINUTO            PIC 9(02) .                      031500      
000318    10 FILLER                    PIC X(03) VALUE SPACES.          031600      
000319    10 FILLER                    PIC X(01) VALUE "P".             031700      
000320    10 WKS-DIS-PASO              PIC 9(03) VALUE 020.             031800      
000321    10 FILLER                    PIC X(03) VALUE SPACES.          031900      
000322    10 WKS-DIS-MENSAJE           PIC X(140).                      032000      
000323                                                                  032100      
000324****************************************************************  032200      
000325*              RUTINAS PARA LIBRERIA CONCEPTOS                 *  032300      
000326****************************************************************  032400      
000327 01 WKS-CTLVER-LIBID             PIC X(12).                       032500      
000328 01 WKS-CTLVER-NOMLIB            PIC X(72).                       032600      
000329 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               032700      
000330                                                                  032800      
000331*HEADER DEL DISPLAY                                               032900      
000332 01 REGISTRO-DIS-HEADER.                                          033000      
000333    10 FILLER                    PIC X(05) VALUE "FECHA".         033100      
000334    10 FILLER                    PIC X(10) VALUE SPACES.          033200      
000335    10 FILLER                    PIC X(04) VALUE "HORA".          033300      
000336    10 FILLER                    PIC X(04) VALUE SPACES.          033400      
000337    10 FILLER                    PIC X(05) VALUE "PASO ".         033500      
000338    10 FILLER                    PIC X(02) VALUE SPACES.          033600      
000339    10 FILLER                    PIC X(07) VALUE "MENSAJE".       033700      
000340                                                                  033800      
000341*************************************************************     033900      
000342*               ENCIENDE/APAGA MONITOR                      *     034000      
000343*************************************************************     034100      
000344 01 WKS-STATUS-MONITOR              PIC 9(02).                    034200      
000345 01 WKS-ID-CTLVER.                                                034300      
000346    03 FILLER                     PIC X(09) VALUE "S151L002R".    034400      
000347    03 WKS-ID-SISTEMA             PIC 9(03).                      034500      
000348 77 W77-STATUS-KEY               PIC 9(04).                       034600      
000349 01 MY-ID                         PIC X(10) VALUE "S151/P020>".   034700      
000350******************************************************************034800      
000351*             NOMBRE DE ARCHIVO DE ERRORES                       *034900      
000352*                                                                *035000      
000353******************************************************************035100      
000354  01 WKS-RUT-L01.                                                 035200      
000355     10 FILLER                    PIC X(27) VALUE                 035300      
000356         "S151/FILE/L01/DISPLAY/P020/".                           035400      
000357     10 WKS-RUT-L01-CSI           PIC X(03).                      035500      
000358     10 FILLER                    PIC X(01) VALUE "/".            035600      
000359     10 WKS-RUT-L01-FCH           PIC 9(06).                      035700      
000360     10 FILLER                    PIC X(01) VALUE "/".            035800      
000361     10 WKS-RUT-L01-HORA          PIC 9(08)   .                   035900      
000362     10 FILLER                    PIC X(01) VALUE ".".            036000      
000363                                                                  036100      
000364******************************************************************036200      
000365*               NOMBRE DE ARCHIVO MONITOR                        *036300      
000366*                                                                *036400      
000367******************************************************************036500      
000368   01 WKS-RUT-L02.                                                036600      
000369      10 FILLER                    PIC X(27) VALUE                036700      
000370          "S151/FILE/L02/MONITOR/P020/".                          036800      
000371      10 WKS-RUT-L02-CSI           PIC X(03).                     036900      
000372      10 FILLER                    PIC X(01) VALUE "/".           037000      
000373      10 WKS-RUT-L02-FCH           PIC 9(06).                     037100      
000374      10 FILLER                    PIC X(01) VALUE "/".           037200      
000375      10 WKS-RUT-L02-HORA          PIC 9(08).                     037300      
000376      10 FILLER                    PIC X(01) VALUE ".".           037400      
000377                                                                  037500      
000378                                                                  037600      
000379***************************************************************   037700      
000380*                 FECHA DE PROCESO                            *   037800      
000381***************************************************************   037900      
000382 01 WKS-FECPRO                   PIC 9(08).                       038000      
000383 01 WKS-FECHA-PROCESO      REDEFINES WKS-FECPRO.                  038100      
000384    03 WKS-FECPRO-CC             PIC 9(02).                       038200      
000385    03 WKS-FECPRO-6D             PIC 9(06).                       038300      
000386    03 WKS-FECPRO-6D-R     REDEFINES WKS-FECPRO-6D.               038400      
000387       05 WKS-FECPRO-AA          PIC 9(02).                       038500      
000388       05 WKS-FECPRO-MM          PIC 9(02).                       038600      
000389       05 WKS-FECPRO-DD          PIC 9(02).                       038700      
000390                                                                  038800      
000391******************************************************************038900      
000392*             VARIABLES ARCHIVO TASKFILE                         *039000      
000393******************************************************************039100      
000394 01  WKS-TIT-TASKFILE.                                            039200      
000395     03 FILLER                     PIC X(30) VALUE                039300      
000396         "FILE TASKFILE (USERBACKUPNAME=".                        039400      
000397     03 FILLER                     PIC X(30) VALUE                039500      
000398         "TRUE,TITLE=S151/TASKFILE/P020/".                        039600      
000399     03 WKS-TSK-NODO               PIC 9(02).                     039700      
000400     03 WKS-TSK-SUBN               PIC 9(02) VALUE ZERO.          039800      
000401     03 FILLER                     PIC X(06) VALUE                039900      
000402         "/R000/".                                                040000      
000403     03 WKS-TSK-FECHA              PIC 9(06).                     040100      
000404     03 FILLER                     PIC X(01) VALUE "/".           040200      
000405     03 WKS-TSK-MXNB               PIC 9(07).                     040300      
000406     03 FILLER                     PIC X(01) VALUE "/".           040400      
000407     03 WKS-TSK-MNEMONICO          PIC X(14) VALUE                040500      
000408         "001TASKFILE );".                                        040600      
000409                                                                  040700      
000410 01 WKS-FECHAS.                                                   040800      
000411   03 WKS-FECHA-MAQUINA         PIC X(10) TYPE IS NUMERIC-DATE.   040900      
000412   03 WKS-FECHA-MAQUINA-R REDEFINES WKS-FECHA-MAQUINA.            041000      
000413      05 WKS-FECMAQ-MM          PIC 9(02).                        041100      
000414      05 WKS-DIAGONAL1          PIC X(01).                        041200      
000415      05 WKS-FECMAQ-DD          PIC 9(02).                        041300      
000416      05 WKS-DIAGONAL2          PIC X(01).                        041400      
000417      05 WKS-FECMAQ-AAAA        PIC 9(04).                        041500      
000418      05 WKS-FECMAQ-AAAA-R      REDEFINES WKS-FECMAQ-AAAA.        041600      
000419         07 WKS-FECMAQ-CC       PIC 9(02).                        041700      
000420         07 WKS-FECMAQ-AA       PIC 9(02).                        041800      
000421   03 WKS-FECHA-MAQ-8D.                                           041900      
000422      05 WKS-CC-MAQ             PIC 9(02).                        042000      
000423      05 WKS-FECHA-MAQ-6D.                                        042100      
000424         07 WKS-AA-MAQ          PIC 9(02).                        042200      
000425         07 WKS-MM-MAQ          PIC 9(02).                        042300      
000426         07 WKS-DD-MAQ          PIC 9(02).                        042400      
000427      05 WKS-FECHA-MAQ-6D-R REDEFINES WKS-FECHA-MAQ-6D PIC 9(06). 042500      
000428   03 WKS-FECHA-MAQ-ANT-8D.                                       042600      
000429      05 WKS-CC-MAQ-ANT         PIC 9(02).                        042700      
000430      05 WKS-FECHA-MAQ-ANT-6D.                                    042800      
000431         07 WKS-AA-MAQ-ANT      PIC 9(02).                        042900      
000432         07 WKS-MM-MAQ-ANT      PIC 9(02).                        043000      
000433         07 WKS-DD-MAQ-ANT      PIC 9(02).                        043100      
000434****************************************************************  043200      
000435*                       CSI COMS                               *  043300      
000436****************************************************************  043400      
000437 01 WKS-DATOS-HOST.                                               043500      
000438    03 WKS-NUMCSI-HOST           PIC 9(02).                       043600      
000439    03 WKS-NOMEQUIPO             PIC X(10).                       043700      
000440    03 WKS-NOMCSI                PIC X(26).                       043800      
000441    03 WKS-LINEA-BATCH           PIC X(05).                       043900      
000442                                                                  044000      
000443 77 W77-RESULT-COMS              PIC 9(06).                       044100      
000444 77 W77-CONTROL                  PIC 9(02) VALUE ZEROS.           044200      
000445 01 WKS-BASURA                   PIC X(10).                       044300      
000446 01 WKS-ESPERACOMS-TIPO-EVENTO   PIC 9(11).                       044400      
000447 01 WKS-COMS-IN-STATUS-KEY       PIC X(22).                       044500      
000448                                                                  044600      
000449                                                                  044700      
000450***************************************************************** 044800      
000451*                     VAR. CHECA VERSIONES                     ** 044900      
000452***************************************************************** 045000      
000453 01 WKS-CTRV-LIBRERIA              PIC X(12) VALUE "S151P020".    045100      
000454 01 WKS-CTRV-TITULO                PIC X(72) VALUE "23MTP004".    045200      
000455 01 WKS-CTRV-STATUS                PIC S9(11) BINARY.             045300      
000456 77 W77-ERROR                      PIC 9(02).                     045400      
000457                                                                  045500      
000458                                                                  045600      
000459                                                                  045700      
000460***************************************************************** 045800      
000461*                   VARIABLES DE TRABAJO                       ** 045900      
000462***************************************************************** 046000      
000463 01 W77-FIN                        PIC 9(04).                     046100      
000464 01 WKS-FEC-NAT                   PIC 9(06).                      046200      
000465 01 WKS-HRS-ACT                   PIC 9(08).                      046300      
000466 01 WKS-HRS-ANT                   PIC 9(08).                      046400      
000467 01 WKS-SMCOMS-TRABAJO             PIC X(132).                    046500      
000468 01 WKS-RECIBI-MSG                PIC 9(01).                      046550      
000469***********   VARAIBLE AUXILIAR PARA JUSTIFICACION   *************046600      
000470 01 WKS-CSIDEST                   PIC 9(02).                      046700      
000471                                                                  046800      
000472***************************************************************   046900      
000473*          copies                                            **   047000      
000474*  PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ   **   047100      
000475***************************************************************   047200      
000476*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000477* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           047300      
000478**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000479  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000480  01 MENSAJE-LJ.                                                  100300      
000481     02 SISTEMA-LJ     PIC X(04).                                 100400      
000482     02 FILLER         PIC X VALUE "/".                           100500      
000483     02 PASO-LJ        PIC X(04).                                 100600      
000484     02 FILLER         PIC X VALUE "/".                           100700      
000485     02 MTP-LJ         PIC 9(03).                                 100800      
000486     02 FILLER         PIC X VALUE ":".                           100900      
000487     02 TIPO-LJ        PIC X.                                     101000      
000488     02 FILLER         PIC X VALUE ">".                           101100      
000489     02 CODIGO-LJ      PIC 9(06).                                 101200      
000490     02 FILLER         PIC X VALUE "<".                           101300      
000491     02 TEXTO-LJ       PIC X(250).                                101400      
000492*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000493****************************************************************  047400      
000494*   DESCRIPCION DE FORMATOS DE LLAMADO A LIBRERIA DE CONTROL   *  047500      
000495****************************************************************  047600      
000496*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000497* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         047700      
000498*================================================================ 000100      
000499*         ENTRY-POINT CONSISDIA :                               = 000200      
000500*                                                                 000300      
000501* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000502* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000503* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000504* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000505* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000506* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000507* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000508* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000509* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000510* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000511*                                                               = 001400      
000512*================================================================ 001500      
000513                                                                  001600      
000514                                                                  001700      
000515*================================================================ 001800      
000516* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000517*                                                               = 002000      
000518* ENTRADA REQUERIDA :                                           = 002100      
000519*                                                               = 002200      
000520*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000521*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000522*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000523*================================================================ 002600      
000524 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000525    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000526    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000527    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000528    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000529    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000530    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000531    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000532    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000533    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000534    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000535    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000536    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000537    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000538    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000539    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000540    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000541    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000542    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000543    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000544    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000545       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000546       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000547       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000548       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000549*==============================================================   005200      
000550*                                                             =   005300      
000551* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000552*                                                             =   005500      
000553* CAMPOS REQUERIDOS :                                         =   005600      
000554*                                                             =   005700      
000555* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000556* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000557* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000558* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000559*==============================================================   006200      
000560 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000561    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000562    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000563    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000564    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000565                                                                  006800      
000566*==============================================================   006900      
000567*                                                             =   007000      
000568* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000569*                                                             =   007200      
000570* CAMPOS REQUERIDOS :                                         =   007300      
000571*                                                             =   007400      
000572* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000573* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000574* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000575* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000576*==============================================================   007900      
000577 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000578    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000579    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000580    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000581    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000582                                                                  008500      
000583*==============================================================   008600      
000584*                                                             =   008700      
000585* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000586*                                                             =   008900      
000587* CAMPOS REQUERIDOS :                                         =   009000      
000588*                                                             =   009100      
000589* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000590* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000591* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000592* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000593*==============================================================   009600      
000594 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000595    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000596    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000597    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000598    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000599                                                                  010200      
000600*============================================================     010300      
000601* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000602*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000603*                                                           =     010600      
000604*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000605*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000606*                                                           =     010900      
000607*  ENTRADA REQUERIDA.                                       =     011000      
000608*                                                           =     011100      
000609*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000610*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000611*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000612*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000613*============================================================     011600      
000614                                                                  011700      
000615 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000616     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000617     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000618     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000619     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000620                                                                  012300      
000621*=============================================================    012400      
000622*                                                            =    012500      
000623* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000624*             B01-SIS-FECARMOV.                              =    012700      
000625*                                                            =    012800      
000626* ENTRADA REQUERIDAD :                                       =    012900      
000627*                                                            =    013000      
000628*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000629*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000630*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000631*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000632*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000633*=============================================================    013600      
000634                                                                  013700      
000635 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000636     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000637     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000638     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000639     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000640     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000641*================================================================ 014400      
000642*                                                               = 014500      
000643* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000644*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000645*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000646*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000647*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000648*                                                               = 015100      
000649* ENTRADA REQUERIDA :                                           = 015200      
000650*                                                               = 015300      
000651* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000652* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000653* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000654* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000655* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000656*================================================================ 015900      
000657 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000658    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000659    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000660    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000661    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000662    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000663                                                                  016600      
000664*============================================================     016700      
000665*                                                           =     016800      
000666* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000667*                                                           =     017000      
000668* DATOS REQUERIDOS :                                        =     017100      
000669*                                                           =     017200      
000670* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000671* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000672* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000673* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000674* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000675*============================================================     017800      
000676                                                                  017900      
000677 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000678     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000679     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000680     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000681     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000682     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000683                                                                  018600      
000684*============================================================     018700      
000685*                                                           =     018800      
000686* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000687*                                                           =     019000      
000688* DATOS REQUERIDOS :                                        =     019100      
000689*                                                           =     019200      
000690* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000691* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000692* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000693* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000694* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000695*============================================================     019800      
000696                                                                  019900      
000697 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000698     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000699     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000700     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000701     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000702     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000703                                                                  020600      
000704*===============================================================  020700      
000705*                                                              =  020800      
000706* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000707*              MOVIMIENTOS.                                    =  021000      
000708* DATOS REQUERIDOS :                                           =  021100      
000709*                                                              =  021200      
000710* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000711* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000712* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000713* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000714* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000715* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000716*==============================================================   021900      
000717                                                                  022000      
000718 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000719     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000720     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000721     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000722     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000723     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000724     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000725*==============================================================   022800      
000726*                                                             =   022900      
000727* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000728*                                                             =   023100      
000729* CAMPOS REQUERIDOS :                                         =   023200      
000730*                                                             =   023300      
000731* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000732* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000733* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000734* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000735*==============================================================   023800      
000736 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000737    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000738    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000739    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000740    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000741                                                                  024304      
000742*=================================================================024306      
000743*                ENTRY POINT CONSISB01                           =024308      
000744*                                                                =024310      
000745*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000746*                                                                =024314      
000747*  FUNCIONES DISPONIBLES :                                       =024316      
000748*                                                                =024318      
000749*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000750*                                                                =024322      
000751*  PARAMETROS REQUERIDOS                                         =024324      
000752*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000753*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000754*=================================================================024330      
000755                                                                  024332      
000756 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000757     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000758     03 WKS-CON-CSI                PIC 9(02).                     024336      
000759     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000760     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000761        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000762        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000763        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000764        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000765        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000766                                                                  024400      
000767*=================================================================024500      
000768*                ENTRY POINT B02ARCINTER                         =024600      
000769*                                                                =024700      
000770*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000771*                                                                =024900      
000772*  FUNCIONES DISPONIBLES :                                       =025000      
000773*                                                                =025100      
000774*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000775* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000776* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000777* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000778*                                                                =025600      
000779*  PARAMETROS REQUERIDOS                                         =025700      
000780*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000781*                                                                =025900      
000782*=================================================================026000      
000783 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000784     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000785     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000786     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000787     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000788     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000789     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000790     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000791     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000792     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000793     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000794     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000795     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000796     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000797     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000798     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000799     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000800     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000801     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000802     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000803     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000804     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000805     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000806     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000807     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000808     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000809     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000810     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000811     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000812                                                                  029000      
000813*=================================================================029100      
000814*                ENTRY POINT B04SISTEMA                          =029200      
000815*                                                                =029300      
000816*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000817*                                                                =029500      
000818*  FUNCIONES DISPONIBLES :                                       =029600      
000819*                                                                =029700      
000820*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000821*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000822*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000823*                                                                =030100      
000824*  PARAMETROS REQUERIDOS                                         =030200      
000825*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000826*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000827*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000828*                                                                =030600      
000829*=================================================================030700      
000830 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000831     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000832     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000833     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000834     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000835     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000836     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000837     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000838                                                                  031600      
000839*================================================================ 031700      
000840*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000841*                                                               = 031900      
000842*  FUNCION                                                      = 032000      
000843*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000844*   19       ALTAS.                                             = 032200      
000845*   22       BAJAS                                              = 032300      
000846*   37       CAMBIOS.                                           = 032400      
000847*                                                               = 032500      
000848*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000849*                      FECHA DE PROCESO                         = 032700      
000850*                      NUMERO DE PROCESO                        = 032800      
000851*                      FECHA INICIO                             = 032900      
000852*                      REGISTRO INICIAL                         = 033000      
000853*================================================================ 033100      
000854                                                                  033200      
000855 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000856     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000857     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000858     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000859     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000860     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000861     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000862     03 WKS-B05-MIX                PIC 9(08).                     034000      
000863     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000864     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000865     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000866     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000867     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000868     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000869                                                                  034700      
000870                                                                  034800      
000871*================================================================ 034900      
000872*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000873*                                                               = 035100      
000874*  FUNCION                                                      = 035200      
000875*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000876*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000877*                                                               = 035500      
000878*================================================================ 035600      
000879                                                                  035700      
000880 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000881     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000882     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000883     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000884     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000885     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000886     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000887                                                                  036500      
000888*===============================================================  036600      
000889*                                                              =  036700      
000890*         ENTRY-POINT CONSISMEN                                =  036800      
000891*                                                              =  036900      
000892*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000893*                      SISTEMA                                 =  037100      
000894*                                                              =  037200      
000895*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000896*                                                              =  037400      
000897*===============================================================  037500      
000898 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000899     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000900     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000901     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000902     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000903     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000904     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000905     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000906     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000907     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000908     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000909     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000910     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000911     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000912     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000913     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000914        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000915        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000916        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000917        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000918        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000919        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000920        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000921                                                                  039900      
000922*=====================================================            040000      
000923*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000924*=====================================================            040200      
000925 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000926     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000927     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000928     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000929                                                                  040700      
000930*=====================================================            040800      
000931*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000932*=====================================================            041000      
000933 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000934     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000935     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000936     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000937                                                                  041500      
000938*=====================================================            041600      
000939*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000940*=====================================================            041800      
000941 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000942     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000943     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000944     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000945*=====================================================            042300      
000946*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000947*=====================================================            042500      
000948 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000949     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000950     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000951     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000952                                                                  043000      
000953*=====================================================            043100      
000954*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000955*=====================================================            043300      
000956 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000957     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000958     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000959     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000960                                                                  043800      
000961*=====================================================            043900      
000962*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000963*=====================================================            044100      
000964 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000965     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000966     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000967     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000968                                                                  044600      
000969*=====================================================            044700      
000970*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000971*=====================================================            044900      
000972 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000973     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000974     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000975     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000976                                                                  045400      
000977*=====================================================            045500      
000978*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000979*=====================================================            045700      
000980 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000981     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000982     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000983     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000984                                                                  046200      
000985*=====================================================            046300      
000986*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000987*=====================================================            046500      
000988 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000989     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000990     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000991     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000992                                                                  047000      
000993*=====================================================            047100      
000994*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000995*=====================================================            047300      
000996 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000997     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000998     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000999     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001000                                                                  047800      
001001*=====================================================            047900      
001002*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001003*=====================================================            048100      
001004 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001005     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001006     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001007     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001008                                                                  048600      
001009*=====================================================            048700      
001010*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001011*=====================================================            048900      
001012 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001013     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001014     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001015     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001016                                                                  049400      
001017*=====================================================            049500      
001018*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001019*=====================================================            049700      
001020 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001021     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001022     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001023     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001024     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001025     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001026     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001027     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001028     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001029     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001030     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001031                                                                  050900      
001032*=====================================================            051000      
001033*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001034*=====================================================            051200      
001035 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001036     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001037     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001038     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001039     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001040                                                                  051800      
001041*=====================================================            051900      
001042*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001043*=====================================================            052100      
001044 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001045     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001046     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001047     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001048     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001049                                                                  052700      
001050*=====================================================            052800      
001051*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001052*=====================================================            053000      
001053 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001054     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001055     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001056     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001057     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001058                                                                  053600      
001059*=====================================================            053700      
001060*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001061*=====================================================            053900      
001062 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001063     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001064     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001065     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001066     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001067                                                                  054500      
001068*=====================================================            054600      
001069*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001070*=====================================================            054800      
001071 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001072     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001073     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001074     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001075     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001076                                                                  055400      
001077*=====================================================            055500      
001078*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001079*=====================================================            055700      
001080 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001081     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001082     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001083     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001084     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001085                                                                  056300      
001086*=====================================================            056400      
001087*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001088*=====================================================            056600      
001089 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001090     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001091     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001092     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001093     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001094                                                                  057200      
001095 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001096*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001097****************************************************************  047800      
001098*       DESCRIPCION DE FORMATO PARA LLAMADO A L002 6 DIG       *  047900      
001099****************************************************************  048000      
001100*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001101* COPY "(S151)S151/FORMATO/LLAMADO/MOVTOS/6DIG.".                 048100      
001102                                                                  001000      
001103                                                                  002000      
001104                                                                  003000      
001105                                                                  004000      
001106******************************************************************005000      
001107*                                                                *006000      
001108*   FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS         *007000      
001109*   LOS SISTEMAS:                                                *008000      
001110*   - LONGITUD DEL REGISTRO 540 CARACTERES                       *009000      
001111*     - LONGITUD DE DATOS GENERALES   180 CARACTERES             *010000      
001112*     - LONGITUD DE DATOS ADICIONALES 360 CARACTERES             *011000      
001113*                                                                *012000      
001114******************************************************************013000      
001115                                                                  014000      
001116 01 WKS-MOV-DATOS WITH LOWER-BOUNDS.                              015000      
001117*01 WKS-MOV-DATOS.                                                015010      
001118    03 WKS-MOV-FUNCION                 PIC  9(02)      COMP.      016000      
001119    03 WKS-MOV-SISTEMA                 PIC  9(04)      COMP.      017000      
001120    03 WKS-MOV-PRODUCTO                PIC  9(04)      COMP.      018000      
001121    03 WKS-MOV-INSTRUMENTO             PIC  9(02)      COMP.      019000      
001122    03 WKS-MOV-SUCPROM                 PIC  9(04)      COMP.      020000      
001123    03 WKS-MOV-CONTRATO                PIC  9(16)      COMP.      021000      
001124                                                                  022000      
001125    03 WKS-TAB-CVEIMP                  OCCURS 5 TIMES.            023000      
001126       04 WKS-MOV-CVETRAN              PIC  9(04)      COMP.      024000      
001127       04 WKS-MOV-INDLEY               PIC  9(02)      COMP.      025000      
001128       04 WKS-MOV-ESQCON               PIC  9(04)      COMP.      026000      
001129       04 WKS-MOV-IMPORTE              PIC  9(14)V99   COMP.      027000      
001130                                                                  028000      
001131    03 WKS-MOV-FECMOV                  PIC  9(06)      COMP.      029000      
001132    03 WKS-MOV-HORMOV                  PIC  9(06)      COMP.      030000      
001133    03 WKS-MOV-FECCONT                 PIC  9(06)      COMP.      031000      
001134    03 WKS-MOV-FECCONT-R               REDEFINES WKS-MOV-FECCONT. 032000      
001135       04 WKS-MOV-FECCONT-AAMM         PIC  9(04)      COMP.      033000      
001136       04 WKS-MOV-FECCONT-DD           PIC  9(02)      COMP.      034000      
001137    03 WKS-MOV-FECVAL                  PIC  9(06)      COMP.      035000      
001138    03 WKS-MOV-AUTORIZA                PIC  9(08)      COMP.      036000      
001139    03 WKS-MOV-AUT3ER                  PIC  9(08)      COMP.      037000      
001140    03 WKS-MOV-REFNUM                  PIC  9(20)      COMP.      038000      
001141    03 WKS-MOV-REFNUM-S087             REDEFINES WKS-MOV-REFNUM.  038552      
001142       04 WKS-MOV-IND-EFEC             PIC  9(02)      COMP.      038554      
001143       04 FILLER                       PIC  X(01).                038555      
001144       04 WKS-MOV-PM                   PIC  9(02)      COMP.      038556      
001145       04 WKS-MOV-REF                  PIC  9(14)      COMP.      038558      
001146    03 WKS-MOV-REFNUM-S500             REDEFINES WKS-MOV-REFNUM.  038600      
001147       04 WKS-MOV-CHVV                 PIC  9(04)      COMP.      038610      
001148       04 WKS-MOV-REFERENCIA           PIC  9(16)      COMP.      038620      
001149    03 WKS-MOV-REFNUM-S404             REDEFINES WKS-MOV-REFNUM.  038670      
001150       04 WKS-MOV-IND-EFECTIVO         PIC  9(02)      COMP.      038720      
001151       04 WKS-MOV-ZEROS                PIC  9(12)      COMP.      038770      
001152       04 WKS-MOV-REF-S404             PIC  9(06)      COMP.      038820      
001153    03 WKS-MOV-REFNUM-S701             REDEFINES WKS-MOV-REFNUM.  038840      
001154       04 FILLER                       PIC  X(03).                038860      
001155       04 WKS-MOV-IND-EFE701           PIC  9(02)      COMP.      038880      
001156       04 WKS-MOV-REF-S701             PIC  9(12)      COMP.      038900      
001157    03 WKS-MOV-CVEMDA                  PIC  9(02)      COMP.      039000      
001158    03 WKS-MOV-NUMMDA                  PIC  9(20)      COMP.      040000      
001159    03 WKS-MOV-NUMMDA-R                REDEFINES WKS-MOV-NUMMDA.  041000      
001160       05 WKS-MOV-MDA-SUC              PIC  9(04)      COMP.      042000      
001161       05 WKS-MOV-MDA-CTA              PIC  9(16)      COMP.      043000      
001162    03 WKS-MOV-CVEMDE                  PIC  9(02)      COMP.      044000      
001163    03 WKS-MOV-SUC-INIC                PIC  9(04)      COMP.      045000      
001164    03 WKS-MOV-CAJA-INIC               PIC  9(02)      COMP.      046000      
001165    03 WKS-MOV-SUCOPER                 PIC  9(04)      COMP.      047000      
001166    03 WKS-MOV-CAJAOPER                PIC  9(02)      COMP.      048000      
001167    03 WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.      049000      
001168    03 WKS-MOV-CAJATRAN                PIC  9(02)      COMP.      050000      
001169    03 WKS-MOV-NOMINA-OPE              PIC  9(08)      COMP.      051000      
001170    03 WKS-MOV-ORIGEN                  PIC  9(02)      COMP.      052000      
001171    03 WKS-MOV-MONEDA                  PIC  9(04)      COMP.      053000      
001172    03 WKS-MOV-AUT-S151                PIC  9(08)      COMP.      054000      
001173    03 WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.      055000      
001174    03 WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.      056000      
001175    03 WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.      057000      
001176    03 WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.      058000      
001177    03 WKS-MOV-CVEAVISO                PIC  9(04)      COMP.      059000      
001178    03 WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.      060000      
001179    03 WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.      061000      
001180    03 WKS-MOV-IND-CONTA               PIC  9(02)      COMP.      062000      
001181    03 WKS-MOV-FEC-ULTMOV              PIC  9(08)      COMP.      062100      
001182    03 WKS-MOV-FEC-ULTMOV-R REDEFINES WKS-MOV-FEC-ULTMOV.         062200      
001183       05 WKS-MOV-IND-NUMREN           PIC  9(02)      COMP.      063000      
001184       05 WKS-MOV-ACTIVIDAD            PIC  9(06)      COMP.      064000      
001185    03 WKS-MOV-SECTOR                  PIC  9(02)      COMP.      065000      
001186    03 WKS-MOV-BANCA                   PIC  9(02)      COMP.      066000      
001187    03 WKS-MOV-FIL-FUTURO              PIC  X(10).                067000      
001188    03 WKS-MOV-REDEF-S264 REDEFINES WKS-MOV-FIL-FUTURO.           067010      
001189       05 FILLER                       PIC  X(03).                067030      
001190       05 WKS-BCO-S264                 PIC  9(06) COMP.           067050      
001191       05 FILLER                       PIC  X(01).                067060      
001192       05 WKS-MOV-BORI-S264            PIC  9(03) COMP.           067070      
001193       05 WKS-MOV-BDES-S264            PIC  9(03) COMP.           067090      
001194    03 WKS-MOV-REDEF-S087 REDEFINES WKS-MOV-FIL-FUTURO.           067100      
001195       05 FILLER                       PIC  X(03).                067150      
001196       05 WKS-MOV-CLIENTE              PIC  9(14)      COMP.      067200      
001197       05 WKS-MOV-REDEF-S701 REDEFINES WKS-MOV-CLIENTE.           067400      
001198          07 FILLER                    PIC  X(03).                067450      
001199          07 WKS-MOV-CTE-701           PIC  9(08)      COMP.      067500      
001200       05 WKS-MOV-REDEF-087 REDEFINES WKS-MOV-CLIENTE.            067512      
001201          07 WKS-MOV-FEC-VEN           PIC  9(06)      COMP.      067514      
001202          07 WKS-MOV-SUFIJO            PIC  9(04)      COMP.      067516      
001203          07 FILLER                    PIC  X(02).                067518      
001204    03 WKS-MOV-REDEF-S500 REDEFINES WKS-MOV-FIL-FUTURO.           067520      
001205       05 FILLER                       PIC  X(03).                067540      
001206       05 WKS-MOV-S015                 PIC  9(06) COMP.           067560      
001207       05 FILLER                       PIC  X(01).                067570      
001208       05 WKS-MOV-BCO-ORI              PIC  9(03) COMP.           067580      
001209       05 WKS-MOV-BCO-DES              PIC  9(03) COMP.           067600      
001210    03 WKS-MOV-REDEF-S501 REDEFINES WKS-MOV-FIL-FUTURO.           067620      
001211       05 FILLER                       PIC  X(03).                067640      
001212       05 WKS-MOV-CAJA-S501            PIC  9(04)      COMP.      067660      
001213       05 FILLER                       PIC  X(05).                067680      
001214    03 WKS-MOV-REDEF-S403 REDEFINES WKS-MOV-FIL-FUTURO.           067700      
001215       05 FILLER                       PIC  X(03).                067720      
001216       05 WKS-MOV-FOLIO-S403           PIC  9(04)       COMP.     067740      
001217       05 WKS-MOV-RENGLON-S403         PIC  9(02)       COMP.     067760      
001218       05 WKS-MOV-SCVECON-S403         PIC  9(04)       COMP.     067780      
001219       05 FILLER                       PIC  X(02).                067800      
001220    03 WKS-MOV-REDEF-S711 REDEFINES WKS-MOV-FIL-FUTURO.           067820      
001221       05 WKS-MOV-CTABEN-S711          PIC  9(20)      COMP.      067840      
001222    03 WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.      068000      
001223    03 WKS-MOV-APU-DESC                PIC  9(08)      COMP.      069000      
001224    03 WKS-MOV-STATUS                  PIC  9(02)      COMP.      070000      
001225                                                                  071000      
001226    03 WKS-MOV-DATOS-ADIC              PIC  X(354).               072000      
001227    03 WKS-MOV-MOV-DATOS-ADIC-R   REDEFINES WKS-MOV-DATOS-ADIC.   073000      
001228       05 WKS-MOV-NOMINA-FUN1          PIC  9(08)      COMP.      074000      
001229       05 WKS-MOV-NOMINA-FUN2          PIC  9(08)      COMP.      075000      
001230       05 WKS-MOV-SIST-ORIG            PIC  9(04)      COMP.      076000      
001231       05 WKS-MOV-PROD-ORIG            PIC  9(04)      COMP.      077000      
001232       05 WKS-MOV-INST-ORIG            PIC  9(02)      COMP.      078000      
001233       05 WKS-MOV-CVECON-YREFLOC       PIC  X(26).                078100      
001234       05 WKS-MOV-CVECON-Y-REF   REDEFINES WKS-MOV-CVECON-YREFLOC.078200      
001235          06 WKS-MOV-CVETR-ORIG        PIC  9(04)      COMP.      079000      
001236          06 WKS-MOV-CONT-ORIG         PIC  9(20)      COMP.      080000      
001237          06 WKS-MOV-REFLOC-BNM        PIC  X(14).                081000      
001238          06 WKS-MOV-REFLOC-OC         REDEFINES                  081100      
001239             WKS-MOV-REFLOC-BNM.                                  081200      
001240             07 WKS-MOV-REFLOC-PZA     PIC  9(03)      COMP.      081300      
001241             07 WKS-MOV-REFLOC-SUC     PIC  9(03)      COMP.      081400      
001242             07 WKS-MOV-REFLOC-TERM    PIC  X(04).                081500      
001243             07 WKS-MOV-REFLOC-AUT     PIC  9(06)      COMP.      081600      
001244             07 WKS-MOV-REFLOC-VF      PIC  9(01)      COMP.      081700      
001245             07 WKS-MOV-REFLOC-TCHQ    PIC  9(01)      COMP.      081800      
001246             07 FILLER                 PIC  X(03).                081900      
001247       05 WKS-MOV-CONTYREFLOC    REDEFINES WKS-MOV-CVECON-YREFLOC.081910      
001248          06 WKS-MOV-PRODGEN           PIC  9(03)      COMP.      081920      
001249          06 WKS-MOV-SUBPRODGEN        PIC  9(03)      COMP.      081930      
001250          06 WKS-MOV-CRE-FOLIO         PIC  9(04)      COMP.      081940      
001251          06 WKS-MOV-CONSECUTIVO       OCCURS 5 TIMES.            081950      
001252             07 WKS-MOV-CONSEC         PIC  9(08)      COMP.      081960      
001253          06 WKS-MOV-MON-CONSTRUC      PIC  9(02)      COMP.      081970      
001254       05 WKS-MOV-FILLERXAPLI          PIC  X(96).                082000      
001255                                                                  083000      
001256       05 WKS-MOV-REDS084          REDEFINES WKS-MOV-FILLERXAPLI. 083100      
001257          06 WKS-MOV-SUCEJE            PIC 9(04)       COMP.      083200      
001258          06 WKS-MOV-CTAEJE            PIC 9(12)       COMP.      083300      
001259          06 WKS-MOV-MENSUALIDAD       PIC 9(04)       COMP.      083350      
001260          06 WKS-MOV-ASESOR            PIC 9(02)       COMP.      083370      
001261          06 WKS-MOV-FILS084           PIC X(85).                 083400      
001262                                                                  083500      
001263       05 WKS-MOV-REDS087          REDEFINES WKS-MOV-FILLERXAPLI. 084000      
001264          06 WKS-MOV-PZO               PIC 9(04)       COMP.      085000      
001265          06 WKS-MOV-EMISION           PIC 9(08)       COMP.      086000      
001266          06 WKS-MOV-CLIENTE-S087      PIC 9(12)       COMP.      086100      
001267          06 WKS-MOV-FILS087           PIC X(84).                 087000      
001268                                                                  088000      
001269       05 WKS-MOV-REDS408          REDEFINES WKS-MOV-FILLERXAPLI. 089000      
001270          06 WKS-MOV-FOLIO             PIC  9(04)      COMP.      090000      
001271          06 WKS-MOV-NUMLIN            PIC  9(04)      COMP.      091000      
001272          06 WKS-MOV-TASA-S408         PIC  9(4)V9(4)  COMP.      091200      
001273          06 WKS-MOV-FINI-S408         PIC  9(08)      COMP.      091300      
001274          06 WKS-MOV-FFIN-S408         PIC  9(08)      COMP.      091400      
001275          06 WKS-MOV-IMPORTE-S408      PIC  9(12)V99   COMP.      091500      
001276          06 WKS-MOV-FILS408           PIC  X(73).                092000      
001277                                                                  093000      
001278       05 WKS-MOV-REDS500          REDEFINES WKS-MOV-FILLERXAPLI. 094000      
001279          06 WKS-MOV-CVECAUSA          PIC  9(04)      COMP.      095000      
001280          06 WKS-MOV-FECDEV            PIC  9(06)      COMP.      096000      
001281          06 WKS-MOV-BCO               PIC  9(04)      COMP.      097000      
001282          06 WKS-MOV-NOMORD            PIC  X(30).                098000      
001283          06 WKS-MOV-CAUSAORD          PIC  X(50).                099000      
001284          06 WKS-MOV-SUCORD            PIC  9(04)      COMP.      100000      
001285          06 WKS-MOV-FILS500           PIC  X(07).                101000      
001286                                                                  101020      
001287*      05 WKS-MOV-REDS711          REDEFINES WKS-MOV-FILLERXAPLI. 101040      
001288*         06 WKS-MOV-TRUI-S711.                                   101060      
001289*         06 WKS-MOV-TRUI-S711-RED  REDEFINES WKS-MOV-TRUI-S711.  101080      
001290*            07 WKS-MOV-CSIREC-S711    PIC  9(08)      COMP.      101100      
001291*            07 WKS-MOV-CSIOR-S711     PIC  9(08)      COMP.      101120      
001292*            07 WKS-MOV-NUMOP-S711     PIC  9(08)      COMP.      101140      
001293*            07 WKS-MOV-NUMTR-S711     PIC  9(08)      COMP.      101160      
001294*            07 WKS-MOV-INSMN-S711     PIC  9(02)      COMP.      101180      
001295*         06 WKS-MOV-MICR-S711.                                   101200      
001296*         06 WKS-MOV-MICR-S711-RED  REDEFINES WKS-MOV-MICR-S711.  101220      
001297*            07 WKS-MOV-CODSEG-S711    PIC  9(04)      COMP.      101240      
001298*            07 WKS-MOV-VERPRE-S711    PIC  9(02)      COMP.      101260      
001299*            07 WKS-MOV-CTRMON-S711    PIC  9(02)      COMP.      101280      
001300*            07 WKS-MOV-PLCEC-S711     PIC  9(04)      COMP.      101300      
001301*            07 WKS-MOV-BNCEM-S711     PIC  9(04)      COMP.      101320      
001302*            07 WKS-MOV-DVEIN-S711     PIC  9(02)      COMP.      101340      
001303*            07 WKS-MOV-CTACH-S711     PIC  9(12)      COMP.      101360      
001304*            07 WKS-MOV-REFCH-S711     PIC  9(08)      COMP.      101380      
001305*         06 WKS-MOV-BCREC-S711        PIC  9(04)      COMP.      101420      
001306*         06 WKS-MOV-NOMBEN-S711       PIC  X(40).                101440      
001307*         06 WKS-MOV-RFCBCO-S711       PIC  X(13).                101460      
001308*         06 WKS-MOV-FILS711           PIC  X(05).                101480      
001309                                                                  102000      
001310       05 WKS-MOV-REDS403           REDEFINES WKS-MOV-FILLERXAPLI.102050      
001311          06 WKS-MOV-OPCION         PIC  9(02)    COMP.           102100      
001312          06 WKS-MOV-FECCOTI        PIC  9(06)    COMP.           102150      
001313          06 WKS-MOV-FIDEICO        PIC  9(06)    COMP.           102200      
001314          06 WKS-MOV-IMPVAL         PIC  9(14)V99 COMP.           102250      
001315          06 WKS-MOV-SUCADIC        PIC  9(04)    COMP.           102300      
001316          06 WKS-MOV-CAJAADIC       PIC  9(02)    COMP.           102350      
001317          06 WKS-MOV-PROGRAMA       PIC  9(04)    COMP.           102400      
001318          06 WKS-MOV-PLAZO          PIC  9(04)    COMP.           102450      
001319          06 WKS-MOV-TIPOPLAZO      PIC  9(02)    COMP.           102500      
001320          06 WKS-MOV-TASAREF        PIC  9(04)V99 COMP.           102550      
001321          06 WKS-MOV-TASAREAL       PIC  9(04)V99 COMP.           102600      
001322          06 WKS-MOV-CTE            PIC  9(12)    COMP.           102650      
001323          06 WKS-VALUDI-PRODNAT     REDEFINES WKS-MOV-CTE.        102660      
001324             07 WKS-MOV-VAL-UDI     PIC  9(02)V9(06) COMP.        102670      
001325             07 WKS-MOV-PRODUCTONAT PIC  9(04)    COMP.           102680      
001326          06 WKS-MOV-CRE-CAUSACV    PIC  9(02)    COMP.           102700      
001327          06 WKS-PAG-NUMPAGOS       OCCURS 5 TIMES.               102702      
001328             07 WKS-PAG-PAGNUM      PIC 9(04)     COMP.           102704      
001329          06 WKS-CRE-STA            OCCURS 5 TIMES.               102708      
001330             07 WKS-CRE-STATUS      PIC 9(02)     COMP.           102710      
001331          06 WKS-CRE-FAS            OCCURS 5 TIMES.               102712      
001332             07 WKS-CRE-FASE        PIC 9(02)     COMP.           102714      
001333          06 WKS-PAG-ESTATUS        OCCURS 5 TIMES.               102716      
001334             07 WKS-PAG-STATUS      PIC 9(02)     COMP.           102718      
001335          06 WKS-PAG-ESTATUS-MEN    OCCURS 5 TIMES.               102720      
001336             07 WKS-PAG-STAVEN      PIC 9(02)     COMP.           102722      
001337          06 WKS-MOV-ESTATUS-CARVEN OCCURS 5 TIMES.               102724      
001338             07 WKS-PAG-STACARVEN   PIC 9(02)     COMP.           102726      
001339          06 WKS-MOV-CONCEPTOS      OCCURS 5 TIMES.               102728      
001340             07 WKS-MOV-CONCEPTO    PIC 9(04)     COMP.           102730      
001341          06 WKS-MOV-TIPMOV         OCCURS 5 TIMES.               102732      
001342             07 WKS-MOV-TM          PIC 9(02)     COMP.           102734      
001343          06 WKS-MOV-MOVIMIENTOS    OCCURS 5 TIMES.               102736      
001344             07 WKS-MOV-MOVIMIENTO  PIC 9(04)     COMP.           102738      
001345                                                                  102750      
001346       05 WKS-MOV-REDS701          REDEFINES WKS-MOV-FILLERXAPLI. 103000      
001347          06 WKS-MOV-DATOS-S701        PIC  X(95).                104000      
001348          06 MOV-MOV-PAG-SERV      REDEFINES WKS-MOV-DATOS-S701.  105000      
001349             07 WKS-MOV-S701-ID        PIC  X(30).                106000      
001350             07 WKS-MOV-S701-FCHREC    PIC  9(06).                107000      
001351             07 WKS-MOV-S701-REF1      PIC  X(20).                108000      
001352             07 WKS-MOV-S701-REF2      PIC  X(20).                109000      
001353             07 WKS-MOV-S701-TIPPAG    PIC  9(06).                110000      
001354             07 WKS-MOV-S701-TIPPAG-R  REDEFINES                  111000      
001355                WKS-MOV-S701-TIPPAG.                              112000      
001356                08 WKS-MOV-S701-ESTAB  PIC  9(04).                113000      
001357                08 WKS-MOV-S701-SEQ    PIC  9(02).                114000      
001358             07 WKS-MOV-S701-AUT       PIC  9(08) COMP.           114050      
001359             07 WKS-MOV-S701-FPAGO     PIC  9(02) COMP.           114100      
001360             07 WKS-MOV-S701-EBPP      PIC  9(03).                114200      
001361             07 WKS-MOV-PLAZA          PIC  9(04) COMP.           114300      
001362             07 WKS-MOV-EDO            PIC  9(02) COMP.           114400      
001363             07 FILLER                 PIC  X(02).                114500      
001364          06 WKS-MOV-PAG-IMPT       REDEFINES WKS-MOV-DATOS-S701. 115000      
001365             07 WKS-MOV-S701-RFC       PIC  X(13).                116000      
001366             07 WKS-MOV-S701-FORMULARI PIC  X(10).                117000      
001367*= FTF definicion de campos para pagos de impuesto                117100      
001368*= se define medio de pago, tipo de impuesto y forma de pago      117200      
001369             07 WKS-MOV-MEDIO-PAGO     PIC  9(04).                117300      
001370             07 WKS-MOV-TIPO-IMP       PIC  9(02).                117400      
001371             07 WKS-MOV-FMA-PAGO       PIC  9(02).                117500      
001372             07 FILLER                 PIC  X(64).                118000      
001373          06 WKS-MOV-FILS701           PIC  X(01).                119000      
001374       05 WKS-MOV-LEYENDAS             PIC  X(200).               119100      
001375       05 WKS-MOV-LEYENDAS-R           REDEFINES WKS-MOV-LEYENDAS.119200      
001376          06 WKS-MOV-LEY1              PIC  X(40).                120000      
001377          06 WKS-MOV-LEY2              PIC  X(40).                121000      
001378          06 WKS-MOV-LEY3              PIC  X(40).                122000      
001379          06 WKS-MOV-LEY4              PIC  X(40).                123000      
001380          06 WKS-MOV-LEY5              PIC  X(40).                124000      
001381       05 WKS-MOV-LEYENDAS-R1          REDEFINES WKS-MOV-LEYENDAS.124100      
001382          06 WKS-MOV-ELEM-LEY          OCCURS 5 TIMES.            124200      
001383             07 WKS-MOV-LEY            PIC  X(40).                124300      
001384             07 WKS-MOV-LEY-R          REDEFINES WKS-MOV-LEY.     124400      
001385                08 WKS-MOV-CHQEXE      PIC  9(10).                124500      
001386                08 WKS-MOV-CHQGIR      PIC  9(10).                124600      
001387                08 WKS-MOV-FILL        PIC  X(20).                124700      
001388       05 WKS-MOV-PRODUCTO-S016        PIC  9(04) COMP.           124800      
001389       05 WKS-MOV-INSTRUMENTO-S016     PIC  9(04) COMP.           124900      
001390       05 FILLER                       PIC  X(15).                125000      
001391    03 WKS-MOV-NUM-CTE                 PIC  9(12) COMP.           125500      
001392                                                                  126000      
001393******************************************************************127000      
001394* DATOS REQUERIDOS PARA:                                          128000      
001395*                                                                 129000      
001396* INICIO, FIN Y ELIMINACION DE PROCESO:                           130000      
001397*    WKS-MOV-FUNCION                                              131000      
001398*    WKS-MOV-SISTEMA                                              132000      
001399*    WKS-MOV-TIPO-PROC                                            133000      
001400*    WKS-MOV-FECCONT                                              134000      
001401*                                                                 135000      
001402*                                                                 136000      
001403* ELIMINACION A PARTIR DE UNA AUTORIZACION DEL S151               137000      
001404*    WKS-MOV-FUNCION                                              138000      
001405*    WKS-MOV-SISTEMA                                              139000      
001406*    WKS-MOV-FECCONT                                              140000      
001407*    WKS-MOV-AUT-AELIM-S151                                       141000      
001408*    NUMERO DE AUTORIZACION INICIAL A ELIMINAR                    142000      
001409*    WKS-MOV-AUT-ANT-S151                                         143000      
001410*    NUMERO DE AUTORIZACION FINAL   A ELIMINAR                    144000      
001411*    (SI ESTE CAMPO ES IGUAL A CEROS LA ELIMINACION ES DESDE EL   145000      
001412*     AUTORIZACION INICIAL A ELIMINAR HASTA EL FIN DE ARCHIVO)    146000      
001413*                                                                 147000      
001414******************************************************************148000      
001415*    MOVE "S151L002R" TO WKS-LIBID-NOMB.                          148050      
001416*    ACCEPT LOG-SISTEMA                                           148100      
001417*    MOVE LOG-SISTEMA TO WKS-LIBID-SIST.                          148150      
001418*    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           148200      
001419*                                     WKS-CTLVER-NOMLIB           148250      
001420*                              GIVING W77-CTLVER-RSLT.            148300      
001421*    IF W77-CTLVER-RSLT = 0                                       148350      
001422*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148400      
001423*                                 WKS-CTLVER-NOMLIB               148450      
001424*    ELSE                                                         148500      
001425*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148550      
001426*       "(S151)S151/OBJECT/L002/REGISTRASNNN/01MTP00  ON CMEMP.". 148600      
001427*                                                                 148650      
001428*                                                                 148700      
001429*    CALL "CARGAMOV1 IN LIB-REGISTRA"  USING LOG-DATOS            149000      
001430*                               GIVING WS-151-RESULT              150000      
001431*                                                                 151000      
001432                                                                  152000      
001433                                                                  153000      
001434                                                                  154000      
001435                                                                  155000      
001436                                                                  156000      
001437*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001438****************************************************************  048200      
001439 LINKAGE SECTION.                                                 048300      
001440    01 WKS-COMS-MY-PROGRAM-NAME     PIC X(0018).                  048400      
001441    77 W77-COMS-MY-PROGRAM-DESG     REAL.                         048500      
001442                                                                  048600      
001443 01 WKS-COMS-EX-AGENDA-NAME.                                      048700      
001444    03 FILLER                    PIC X(01) VALUE   "S".           048800      
001445    03 WKS-COMS-EX-AGENDA-SIS    PIC 9(03) VALUE   151.           048900      
001446    03 WKS-COMS-EX-AGENDA-MOD    PIC 9(02) VALUE    20.           049000      
001447                                                                  049100      
001448    77 W77-COMS-AG-SALIDA-DESG      REAL.                         049200      
001449                                                                  049300      
001450    77 W77-COMS-DEFSTATION-DESG     REAL.                         049400      
001451                                                                  049500      
001452    01 WKS-COMS-DEFSTATION-NAME     PIC X(18).                    049600      
001453                                                                  049700      
001454    01 WKS-COMS-AG-SALIDA-NAME      PIC X(50).                    049800      
001455                                                                  049900      
001456    77 W77-COMS-RESULT              PIC S9(011) BINARY.           050000      
001457       88 W88-COMS-OK               VALUE 0.                      050100      
001458                                                                  050200      
001459    01 WKS-SMCOMS-COMANDO.                                        050300      
001460       03 WKS-SMCOMS-STRING1        PIC X(20).                    050400      
001461       03 WKS-SMCOMS-STRING2        PIC X(20).                    050500      
001462                                                                  050600      
001463    77 W77-SMCOMS-RESULT            PIC S9(11) BINARY.            050700      
001464       88 W88-SMCOMS-OK             VALUE 0.                      050800      
001465                                                                  050900      
001466    77 W77-ACEPTA-MSG               PIC S9(11) BINARY.            051000      
001467        88 W88-ACEPTA-MSG            VALUE 1.                     051100      
001468                                                                  051200      
001469    77 W77-ESPERACOMS-TIPO-EVENTO   PIC S9(11) BINARY.            051300      
001470       88 W88-POR-MSG               VALUE  1.                     051400      
001471       88 W88-POR-ACCEPT            VALUE  2.                     051500      
001472       88 W88-POR-HI                VALUE  3.                     051600      
001473       88 W88-POR-TIMEOUT           VALUE  4.                     051700      
001474       88 W88-POR-EVENTO            VALUE  5.                     051800      
001475                                                                  051900      
001476    77 W77-ESPERACOMS-TIEMPO        PIC S9(11) BINARY VALUE 20.   052000      
001477                                                                  052100      
001478***************************************************************** 052200      
001479*         SECCION DE COMUNICACION                              ** 052300      
001480***************************************************************** 052400      
001481                                                                  052500      
001482 COMMUNICATION SECTION.                                           052600      
001483 INPUT  HEADER COMS-IN;                                           052700      
001484        PROGRAMDESG              IS CS-COMS-IN-PROGRAM;           052800      
001485        FUNCTIONSTATUS           IS CS-COMS-IN-FUNCTION-STATUS;   052900      
001486        FUNCTIONINDEX            IS CS-COMS-IN-FUNCTION-INDEX;    053000      
001487        USERCODE                 IS CS-COMS-IN-USERCODE;          053100      
001488        SECURITYDESG             IS CS-COMS-IN-SECURITY-DESG;     053200      
001489        TRANSPARENT              IS CS-COMS-IN-TRANSPARENT;       053300      
001490        VTFLAG                   IS CS-COMS-IN-VT-FLAG;           053400      
001491        TIMESTAMP                IS CS-COMS-IN-TIMESTAMP;         053500      
001492        STATION                  IS CS-COMS-IN-STATION;           053600      
001493        TEXTLENGTH               IS CS-COMS-IN-TEXT-LENGTH;       053700      
001494        STATUSVALUE              IS CS-COMS-IN-STATUS-KEY;        053800      
001495        MESSAGECOUNT             IS CS-COMS-IN-MSG-COUNT;         053900      
001496        RESTART                  IS CS-COMS-IN-RST-LOC;           054000      
001497        AGENDA                   IS CS-COMS-IN-AGENDA.            054100      
001498 OUTPUT HEADER COMS-OUT;                                          054200      
001499        DESTCOUNT              IS CS-COMS-OUT-COUNT;              054300      
001500        TEXTLENGTH             IS CS-COMS-OUT-TEXT-LENGTH;        054400      
001501        STATUSVALUE            IS CS-COMS-OUT-STATUS-KEY;         054500      
001502        TRANSPARENT            IS CS-COMS-OUT-TRANSPARENT;        054600      
001503        VTFLAG                 IS CS-COMS-OUT-VT-FLAG;            054700      
001504        CONFIRMFLAG            IS CS-COMS-OUT-CONFIRM-FLAG;       054800      
001505        CONFIRMKEY             IS CS-COMS-OUT-CONFIRM-KEY;        054900      
001506        DESTINATIONDESG        IS CS-COMS-OUT-DESTINATION;        055000      
001507        NEXTINPUTAGENDA        IS CS-COMS-OUT-NEXT-INPUT-AGENDA;  055100      
001508        SETNEXTINPUTAGENDA     IS CS-COMS-OUT-SNEXT-INPUT-AGENDA; 055200      
001509        RETAINTRANSACTIONMODE  IS CS-COMS-OUT-SAVE-TRANS-MODE;    055300      
001510        AGENDA                 IS CS-COMS-OUT-AGENDA.             055400      
001511 PROCEDURE DIVISION.                                              055500      
001512 DECLARATIVES.                                                    055600      
001513 INTERRUPT-BY-HI2 SECTION.                                        055700      
001514          USE AS INTERRUPT PROCEDURE.                             055800      
001515 000A-BEGIN-INTERRUPT.                                            055900      
001516*===========                                                      056000      
001517     DISALLOW INTERRUPT.                                          056100      
001518     MOVE "I"                           TO TIPO-LJ.               056200      
001519     MOVE 050104                        TO CODIGO-LJ.             056300      
001520     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-HI.                056400      
001521     MOVE SPACES                        TO WKS-DIS-TEXTO.         056500      
001522     IF W88-HI-4                                                  056600      
001523        MOVE SPACES                     TO TEXTO-LJ               056700      
001524        PERFORM 800100-HI-SALIDA                                  056800      
001525     ELSE                                                         056900      
001526     IF W88-HI-3                                                  057000      
001527          MOVE "  SE APAGA MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO    057100      
001528          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     057200      
001529          PERFORM 060700-DISPLAY                                  057300      
001530          PERFORM 060900-APAGA-MONITOR                            057400      
001531     ELSE                                                         057500      
001532     IF W88-HI-2                                                  057600      
001533          MOVE "  SE ENCIENDE MONITOR " TO TEXTO-LJ WKS-DIS-TEXTO 057700      
001534          CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ     057800      
001535          PERFORM 060700-DISPLAY                                  057900      
001536          PERFORM 060800-ENCIENDE-MONITOR.                        058000      
001537                                                                  058100      
001538     ALLOW INTERRUPT.                                             058200      
001539 0000A-END.                                                       058300      
001540 END DECLARATIVES.                                                058400      
001541                                                                  058500      
001542***************************************************************   058600      
001543**                INICIA RUTINA PRINCIPAL                    **   058700      
001544***************************************************************   058800      
001545                                                                  058900      
001546 000000-PRINCIPAL SECTION.                                        059000      
001547*==========================                                       059100      
001548 000000-PROCESO-GLOBAL.                                           059200      
001549     PERFORM 100000-INICIO.                                       059300      
001550     PERFORM 200000-PROCESO UNTIL W77-FIN = 1.                    059400      
001551     PERFORM 300000-FIN.                                          059500      
001552                                                                  059600      
001553 100000-INICIO.                                                   059700      
001554                                                                  059800      
001555     PERFORM 101000-TASKFILE.                                     059900      
001556     PERFORM 102000-COMS.                                         060000      
001557     PERFORM 103000-VALIDA-CSI.                                   060100      
001558     PERFORM 104000-LIBRERIAS.                                    060200      
001559     PERFORM 105000-OPN-TSKFILE.                                  060300      
001560     PERFORM 106000-DISPLAY.                                      060400      
001561     PERFORM 107000-CHECA-VERS.                                   060500      
001562                                                                  060600      
001563     ALLOW INTERRUPT                                              060700      
001564 ATTACH INTERRUPT-BY-HI2 TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF.   060800      
001565                                                                  060900      
001566                                                                  061000      
001567 101000-TASKFILE.                                                 061100      
001568*================                                                 061200      
001569     MOVE ZERO                          TO W77-FIN                061300      
001570     MOVE "/"                           TO WKS-DIAGONAL1          061400      
001571                                           WKS-DIAGONAL2          061500      
001572     ACCEPT WKS-FECHA-MAQUINA           FROM TODAYS-DATE          061600      
001573     MOVE WKS-FECMAQ-CC                 TO WKS-CC-MAQ             061700      
001574     MOVE WKS-FECMAQ-AA                 TO WKS-AA-MAQ             061800      
001575     MOVE WKS-FECMAQ-MM                 TO WKS-MM-MAQ             061900      
001576     MOVE WKS-FECMAQ-DD                 TO WKS-DD-MAQ             062000      
001577     MOVE WKS-FECHA-MAQ-8D         TO WKS-FECHA-MAQ-ANT-8D.       062100      
001578                                                                  062200      
001579 102000-COMS.                                                     062300      
001580*============                                                     062400      
001581    CHANGE ATTRIBUTE LIBACCESS         OF "SOPORTECOMS"           062500      
001582                                       TO BYFUNCTION.             062600      
001583    CHANGE ATTRIBUTE FUNCTIONNAME      OF "SOPORTECOMS"           062700      
001584                                       TO "SOPORTECOMS".          062800      
001585                                                                  062900      
001586    CHANGE ATTRIBUTE LIBACCESS         OF "DCILIBRARY"            063000      
001587                                       TO  BYFUNCTION.            063100      
001588    CHANGE ATTRIBUTE FUNCTIONNAME      OF "DCILIBRARY"            063200      
001589                                       TO "COMSSUPPORT".          063300      
001590     ENABLE INPUT COMS-IN    KEY "ONLINE".                        063400      
001591                                                                  063500      
001592*=============== VALIDACION DE AGENDA DE SALIDA ================= 063600      
001593     MOVE "OUTPUT OF LINEA"           TO WKS-COMS-AG-SALIDA-NAME. 063700      
001594     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               063800      
001595           USING  WKS-COMS-AG-SALIDA-NAME                         063900      
001596                  VALUE AGENDA                                    064000      
001597                  W77-COMS-AG-SALIDA-DESG                         064100      
001598           GIVING W77-COMS-RESULT.                                064200      
001599     IF W88-COMS-OK                                               064300      
001600        NEXT SENTENCE                                             064400      
001601     ELSE                                                         064500      
001602        PERFORM 900000-FIN-MAL.                                   064600      
001603                                                                  064700      
001604     MOVE CS-COMS-IN-PROGRAM          TO W77-COMS-MY-PROGRAM-DESG.064800      
001605     CALL "GET-NAME-USING-DESIGNATOR OF DCILIBRARY"               064900      
001606           USING  W77-COMS-MY-PROGRAM-DESG                        065000      
001607                  WKS-COMS-MY-PROGRAM-NAME                        065100      
001608           GIVING W77-COMS-RESULT.                                065200      
001609     IF W88-COMS-OK                                               065300      
001610        NEXT SENTENCE                                             065400      
001611     ELSE                                                         065500      
001612        PERFORM 900000-FIN-MAL.                                   065600      
001613*=============== DESIGNACION DE ESTACION DEFAULT  =============   065700      
001614     MOVE "DEFAULTSTATION"            TO WKS-COMS-DEFSTATION-NAME 065800      
001615     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               065900      
001616           USING  WKS-COMS-DEFSTATION-NAME                        066000      
001617           VALUE  STATION                                         066100      
001618                  W77-COMS-DEFSTATION-DESG                        066200      
001619           GIVING W77-COMS-RESULT.                                066300      
001620     IF W88-COMS-OK                                               066400      
001621        NEXT SENTENCE                                             066500      
001622     ELSE                                                         066600      
001623        PERFORM 900000-FIN-MAL.                                   066700      
001624                                                                  066800      
001625                                                                  066900      
001626     CALL "CSIID OF SOPORTECOMS"       USING WKS-DATOS-HOST.      067000      
001627                                                                  067100      
001628 104000-LIBRERIAS.                                                067200      
001629*=================                                                067300      
001630    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              067400      
001631                                       TO BYFUNCTION.             067500      
001632    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              067600      
001633                                       TO "CTLVERS".              067700      
001634    CHANGE ATTRIBUTE TITLE             OF "LIB-DISP"              067800      
001635       TO "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".        067900      
001636                                                                  068000      
001637*OBTENEMOS FECHA PARA INCIAR PROCESO DE LA L001                   068100      
001638    MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.   068200      
001639                                                                  068300      
001640    CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID    068400      
001641                                              WKS-CTLVER-NOMLIB   068500      
001642                                       GIVING W77-CTLVER-RESULT.  068600      
001643     IF W77-CTLVER-RESULT = 0                                     068700      
001644        CHANGE ATTRIBUTE TITLE         OF "S151-L001"             068800      
001645                                       TO WKS-CTLVER-NOMLIB       068900      
001646     ELSE                                                         069000      
001647        CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO          069100      
001648               "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".        069200      
001649                                                                  069300      
001650     MOVE 500                          TO WKS-B01-SISTEMA         069400      
001651     MOVE 01                           TO WKS-B01-FUNCION.        069500      
001652     CALL "CONSISDIA IN S151-L001"     USING  WKS-S151B01SISDIA   069600      
001653                                       GIVING W77-RESULT-B01.     069700      
001654                                                                  069800      
001655     IF W77-RESULT-B01 > 0                                        069900      
001656        MOVE W77-RESULT-B01            TO W77-ERROR               070000      
001657        STRING "NO PUEDO OBTENER FECHA DE PROCESO "               070100      
001658               " ERROR EN S151-L001 S500, ERR #" W77-ERROR        070200      
001659        DELIMITED BY SIZE INTO TEXTO-LJ                           070300      
001660        MOVE "O"                       TO TIPO-LJ                 070400      
001661        MOVE 020901                    TO CODIGO-LJ               070500      
001662        CALL "LJ IN LIB-DISP"          USING CONTADOR-LJ,         070600      
001663                                             MENSAJE-LJ           070700      
001664        SET MYSELF(STATUS) TO -1                                  070800      
001665     ELSE                                                         070900      
001666        MOVE WKS-B01-FECCON            TO WKS-FECHA-PROCESO.      071000      
001667                                                                  071100      
001668 105000-OPN-TSKFILE.                                              071200      
001669*===================                                              071300      
001670     ACCEPT  WKS-FEC-MAQ-DG              FROM DATE                071400      
001671     MOVE WKS-FEC-MAQ-DG                 TO WKS-TSK-FECHA         071500      
001672     MOVE WKS-NUMCSI-HOST                TO WKS-TSK-NODO          071600      
001673     MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WKS-TSK-MXNB          071700      
001674     SET MYSELF (OPTION)                 TO 1926                  071800      
001675     SET MYSELF (FILECARDS)              TO WKS-TIT-TASKFILE.     071900      
001676                                                                  072000      
001677 106000-DISPLAY.                                                  072100      
001678*===========================================================      072200      
001679   ACCEPT  WKS-FEC-NAT              FROM DATE                     072300      
001680   MOVE WKS-FEC-NAT                TO WKS-RUT-L01-FCH             072400      
001681   ACCEPT WKS-HRS-ACT FROM TIME                                   072500      
001682   MOVE WKS-HRS-ACT TO WKS-RUT-L01-HORA                           072600      
001683                       WKS-RUT-L02-HORA.                          072700      
001684   MOVE 0           TO WKS-HRS-ACT.                               072800      
001685                                                                  072900      
001686    CHANGE ATTRIBUTE TITLE             OF L01-DISPLAY             073000      
001687                                       TO WKS-RUT-L01.            073100      
001688                                                                  073200      
001689    IF  ATTRIBUTE RESIDENT  OF L01-DISPLAY  = VALUE TRUE          073300      
001690          OPEN EXTEND L01-DISPLAY                                 073400      
001691    ELSE                                                          073500      
001692          OPEN OUTPUT L01-DISPLAY                                 073600      
001693          ADD   1  TO  CONT-REG-DISPLAY                           073700      
001694          WRITE REG-DISPLAY       FROM REGISTRO-DIS-HEADER.       073800      
001695                                                                  073900      
001696 107000-CHECA-VERS.                                               074000      
001697*==================                                               074100      
001698                                                                  074200      
001699      CHANGE ATTRIBUTE LIBACCESS              OF "VERLIB"         074300      
001700                                              TO BYFUNCTION.      074400      
001701      CHANGE ATTRIBUTE FUNCTIONNAME           OF "VERLIB"         074500      
001702                                              TO "CTLVERS".       074600      
001703      CALL   "CHECAME IN VERLIB"     USING  WKS-CTRV-LIBRERIA,    074700      
001704                                            WKS-CTRV-TITULO       074800      
001705                                     GIVING WKS-CTRV-STATUS.      074900      
001706      IF  WKS-CTRV-STATUS             <      0                    075000      
001707          MOVE 1                           TO W77-FIN             075100      
001708          MOVE "ERROR AL LLAMAR VERSIONES" TO TEXTO-LJ            075200      
001709          PERFORM 060700-DISPLAY                                  075300      
001710          CHANGE ATTRIBUTE STATUS OF MYSELF   TO -1.              075400      
001711                                                                  075500      
001712 800100-HI-SALIDA.                                                075600      
001713*=================                                                075700      
001714      MOVE  020201                      TO CODIGO-LJ.             075800      
001715      MOVE  "I"                         TO TIPO-LJ.               075900      
001716                                                                  076000      
001717      IF W88-HI-4                                                 076100      
001718         MOVE "TERMINACION NORMAL"      TO TEXTO-LJ               076200      
001719      ELSE                                                        076300      
001720      IF W88-HI-6                                                 076400      
001721         MOVE "TERMINACION DE EMERGENCIA" TO TEXTO-LJ.            076500      
001722         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                 076600      
001723                                         MENSAJE-LJ.              076700      
001724                                                                  076800      
001725 060700-DISPLAY.                                                  076900      
001726*==========================================                       077000      
001727      IF CONT-REG-DISPLAY = 6500                                  077100      
001728          CLOSE  L01-DISPLAY       WITH SAVE                      077200      
001729          ACCEPT WKS-HORMAQ-HMSD   FROM  TIME                     077300      
001730          MOVE   WKS-HORMAQ-HMSD   TO WKS-RUT-L01-HORA            077400      
001731          CHANGE ATTRIBUTE TITLE   OF L01-DISPLAY                 077500      
001732                                   TO WKS-RUT-L01                 077600      
001733          OPEN  OUTPUT  L01-DISPLAY                               077700      
001734          MOVE    1                TO  CONT-REG-DISPLAY           077800      
001735          WRITE REG-DISPLAY        FROM REGISTRO-DIS-HEADER.      077900      
001736                                                                  078000      
001737       ADD    1                    TO  CONT-REG-DISPLAY           078100      
001738       ACCEPT WKS-HORMAQ-HMSD      FROM  TIME                     078200      
001739       ACCEPT WKS-DATO             FROM DATE                      078300      
001740       MOVE   20                   TO WKS-DIS-FECHA-S             078400      
001741       MOVE   WKS-DATO-AMO         TO WKS-DIS-FECHA-A             078500      
001742       MOVE   WKS-DATO-MES         TO WKS-DIS-FECHA-M             078600      
001743       MOVE   WKS-DATO-DIA         TO WKS-DIS-FECHA-D             078700      
001744       MOVE   WKS-HORA-H           TO WKS-DIS-HORA                078800      
001745       MOVE   WKS-HORA-M           TO WKS-DIS-MINUTO              078900      
001746       MOVE   WKS-DIS-TEXTO        TO WKS-DIS-MENSAJE             079000      
001747       WRITE  REG-DISPLAY          FROM  REGISTRO-DIS-DETALLE.    079100      
001748                                                                  079200      
001749 060900-APAGA-MONITOR.                                            079300      
001750*=======================                                          079400      
001751    IF  WKS-STATUS-MONITOR = 1                                    079500      
001752        CLOSE L02-MONITOR WITH SAVE.                              079600      
001753    MOVE 0                        TO WKS-STATUS-MONITOR.          079700      
001754                                                                  079800      
001755 060800-ENCIENDE-MONITOR.                                         079900      
001756*========================                                         080000      
001757     ACCEPT  WKS-FEC-NAT              FROM DATE                   080100      
001758     MOVE WKS-FEC-NAT                TO WKS-RUT-L02-FCH           080200      
001759     ACCEPT WKS-HORMAQ-HMSD          FROM  TIME                   080300      
001760     MOVE   WKS-HORMAQ-HMSD          TO WKS-RUT-L02-HORA          080400      
001761     IF WKS-STATUS-MONITOR = 1                                    080500      
001762        CLOSE  L02-MONITOR           WITH SAVE.                   080600      
001763     CHANGE ATTRIBUTE TITLE          OF L02-MONITOR               080700      
001764                                     TO WKS-RUT-L02.              080800      
001765     OPEN OUTPUT L02-MONITOR.                                     080900      
001766     MOVE  1                         TO  WKS-STATUS-MONITOR.      081000      
001767                                                                  081100      
001768  200000-PROCESO.                                                 081200      
001769*================                                                 081300      
001770      MOVE ZERO TO WKS-RECIBI-MSG.                                081350      
001771      PERFORM 200600-COMS-RECEIVE.                                081400      
001772      IF W88-POR-MSG AND W88-SA0-TRN-DSIS-S151                    081500      
001773                     AND WKS-RECIBI-MSG = 1                       081550      
001774         PERFORM 201000-PROCESA-MSG.                              081600      
001775                                                                  081700      
001776 200600-COMS-RECEIVE.                                             081800      
001777*======================                                           081900      
001778    MOVE LOW-VALUES TO WKS-REG-MSG.                               082000      
001779    MOVE ZERO                TO W77-ACEPTA-MSG                    082100      
001780                                WKS-HDR-RSLTDO                    082200      
001781                                W77-ESPERACOMS-TIPO-EVENTO        082300      
001782                                W77-CONTROL.                      082400      
001783    CALL "ESPERACOMS OF SOPORTECOMS"                              082500      
001784         USING  W77-ESPERACOMS-TIEMPO                             082600      
001785         GIVING W77-ESPERACOMS-TIPO-EVENTO.                       082700      
001786    IF W88-POR-MSG  OR W88-POR-EVENTO                             082800      
001787       NEXT SENTENCE                                              082900      
001788    ELSE                                                          083000      
001789    IF W88-POR-TIMEOUT                                            083100      
001790          PERFORM 202000-VALIDA-FEC-ACTUAL                        083200      
001791          MOVE 1     TO W77-CONTROL                               083300      
001792    ELSE                                                          083400      
001793    IF W88-POR-ACCEPT                                             083500      
001794       MOVE 1     TO W77-CONTROL                                  083600      
001795       ACCEPT WKS-BASURA                                          083700      
001796    ELSE                                                          083800      
001797    IF W88-POR-HI                                                 083900      
001798       IF W88-HI-4 OR W88-HI-6                                    084000      
001799          STRING "TERMINA POR HI" W77-HI                          084100      
001800          DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                   084200      
001801          PERFORM 060700-DISPLAY                                  084300      
001802          MOVE    1        TO W77-CONTROL                         084400      
001803          PERFORM 999999-FIN                                      084500      
001804        ELSE                                                      084600      
001805                MOVE ZERO  TO W77-HI                              084700      
001806                MOVE 1     TO W77-CONTROL                         084800      
001807                                                                  084900      
001808    ELSE                                                          085000      
001809       MOVE W77-ESPERACOMS-TIPO-EVENTO TO                         085100      
001810            WKS-ESPERACOMS-TIPO-EVENTO                            085200      
001811       STRING "EVENTO DESCONOCIDO " WKS-ESPERACOMS-TIPO-EVENTO    085300      
001812       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                      085400      
001813       PERFORM 060700-DISPLAY                                     085500      
001814       MOVE 1        TO W77-CONTROL.                              085600      
001815                                                                  085700      
001816                                                                  085800      
001817     IF  W77-CONTROL = ZEROS                                      085900      
001818         MOVE  SPACES                 TO  WKS-DATOS-S151          086000      
001819         RECEIVE  COMS-IN  MESSAGE  INTO  WKS-REG-MSG             086100      
001820               NO DATA NEXT SENTENCE.                             086200      
001821     IF  W77-CONTROL = ZEROS                                      086300      
001822         MOVE "RECEPCION MENSAJE"  TO WKS-SENTIDO-MSG             086400      
001823         MOVE WKS-AREA-USUARIO     TO WKS-DATOS-S151              086500      
001824         MOVE 1                    TO WKS-RECIBI-MSG              086520      
001825         IF WKS-HDR-RSLTDO = 31 OR 32 OR 33                       086540      
001826            MOVE "MENSAJE DE ECO"     TO WKS-SENTIDO-MSG          086560      
001827            MOVE 0                    TO WKS-RECIBI-MSG.          086580      
001828                                                                  086590      
001829     IF W88-POR-MSG                                               086600      
001830        PERFORM 060950-ESCRIBE-MONITOR.                           086700      
001831                                                                  086800      
001832     MOVE CS-COMS-IN-STATUS-KEY TO WKS-COMS-IN-STATUS-KEY         086900      
001833     IF W77-CONTROL = ZERO                                        087000      
001834        IF  CS-COMS-IN-STATUS-KEY  =  99                          087100      
001835            MOVE ZERO            TO CS-COMS-IN-STATUS-KEY         087200      
001836            STRING "FIN DE PROGRAMA X ESTATUS  "                  087300      
001837                    WKS-COMS-IN-STATUS-KEY                        087400      
001838            DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                 087500      
001839            PERFORM 060700-DISPLAY                                087600      
001840            MOVE  1              TO W77-FIN                       087700      
001841        ELSE                                                      087800      
001842        IF  CS-COMS-IN-STATUS-KEY  =  0 OR 89 OR 91 OR 92 OR 93   087900      
001843            NEXT SENTENCE                                         088000      
001844        ELSE                                                      088100      
001845           MOVE " >> ERROR RECEIVE MSG >>> " TO WKS-DIS-TEXTO     088200      
001846           PERFORM 060700-DISPLAY                                 088300      
001847           STRING "CS-COMS-IN-STATUS-KEY = "                      088400      
001848                  WKS-COMS-IN-STATUS-KEY                          088500      
001849           DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                  088600      
001850           PERFORM 060700-DISPLAY                                 088700      
001851           STRING "HEADER " WKS-HDR-MSG " ACA " WKS-ACA           088800      
001852                  " SA0 " WKS-SA0 " SA2 " WKS-SA2                 088900      
001853           DELIMITED BY SIZE INTO WKS-DIS-TEXTO                   089000      
001854           PERFORM 060700-DISPLAY.                                089100      
001855                                                                  089200      
001856 999999-FIN.                                                      089300      
001857*===========                                                      089400      
001858     IF W88-HI-6                                                  089500      
001859        MOVE "DISABLE NOW PROGRAM "   TO WKS-SMCOMS-STRING1       089600      
001860     ELSE                                                         089700      
001861        MOVE "DISABLE PROGRAM "       TO WKS-SMCOMS-STRING1.      089800      
001862     MOVE WKS-COMS-MY-PROGRAM-NAME    TO WKS-SMCOMS-STRING2       089900      
001863     CALL "SMCOMS OF SOPORTECOMS"                                 090000      
001864           USING  WKS-SMCOMS-COMANDO                              090100      
001865                  WKS-SMCOMS-TRABAJO                              090200      
001866           GIVING W77-SMCOMS-RESULT.                              090300      
001867     IF W88-SMCOMS-OK                                             090400      
001868        NEXT SENTENCE                                             090500      
001869     ELSE                                                         090600      
001870        MOVE SPACES                   TO TEXTO-LJ                 090700      
001871        MOVE W77-SMCOMS-RESULT        TO W77-RESULT-COMS          090800      
001872        STRING                                                    090900      
001873             " ERROR DISABLE RESULTS "                            091000      
001874             W77-RESULT-COMS                                      091100      
001875        DELIMITED BY SIZE                                         091200      
001876        INTO TEXTO-LJ                                             091300      
001877        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      091400      
001878                                                                  091500      
001879 060950-ESCRIBE-MONITOR.                                          091600      
001880*=======================                                          091700      
001881 IF WKS-STATUS-MONITOR = 1                                        091800      
001882    MOVE WKS-FEC-NAT   TO WKS-FEC-MON                             091900      
001883    ACCEPT WKS-HRS-MON FROM TIME                                  092000      
001884    MOVE SPACES        TO WKS-ESPACIO1 WKS-ESPACIO2               092100      
001885    STRING WKS-REG-MSG DELIMITED BY SIZE INTO WKS-DATOS-MSJ       092200      
001886    STRING  A01-MOV-FUNCION DELIMITED BY SIZE,                    092300      
001887            A01-MOV-SISTEMA DELIMITED BY SIZE,                    092400      
001888            A01-MOV-HORAMOV DELIMITED BY SIZE,                    092500      
001889    INTO    WKS-LLAVE-MSG                                         092600      
001890    WRITE REG-MONITOR.                                            092700      
001891                                                                  092800      
001892 202000-VALIDA-FEC-ACTUAL.                                        092900      
001893*=========================                                        093000      
001894      IF WKS-PRIMER-VEZ NOT = 0                                   093100      
001895            MOVE WKS-HRS-ACT TO WKS-HRS-ANT                       093200      
001896            ACCEPT WKS-HRS-ACT FROM TIME                          093300      
001897      ELSE                                                        093400      
001898            MOVE 1 TO WKS-PRIMER-VEZ                              093500      
001899            ACCEPT WKS-HRS-ACT FROM TIME                          093600      
001900            MOVE WKS-HRS-ACT TO WKS-HRS-ANT.                      093700      
001901                                                                  093800      
001902     IF WKS-HRS-ACT   <   WKS-HRS-ANT                             093900      
001903        ACCEPT  WKS-FEC-NAT FROM DATE                             094000      
001904                                                                  094100      
001905        STRING "FECHA CONTABLE: "                                 094200      
001906        WKS-FEC-NAT       DELIMITED BY SIZE                       094300      
001907        INTO WKS-DIS-TEXTO                                        094400      
001908                                                                  094500      
001909        PERFORM 060700-DISPLAY                                    094600      
001910        PERFORM 020700-CLOSE-DISPLAY                              094700      
001911        PERFORM 060900-APAGA-MONITOR.                             094800      
001912                                                                  094900      
001913 201000-PROCESA-MSG.                                              095000      
001914*===================                                              095100      
001915    MOVE LOW-VALUES TO MSG-SAL.                                   095200      
001916*    PERFORM 201010-EXTRAE-L002.                                  095300      
001917*    IF W77-ERROR = 1                                             095400      
001918*       STRING " >> ERROR NO SE ENCUENTA LIBRERIA: "              095500      
001919*       A01-MOV-FUNCION " >>>"                                    095600      
001920*       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                     095700      
001921*       PERFORM 060700-DISPLAY                                    095800      
001922*       EXIT PERFORM.                                             095900      
001923                                                                  096000      
001924    IF WKS-SA0-TRN-DSCOD = 264                                    096100      
001925       PERFORM 201010-EXTRAE-L002                                 096115      
001926       IF W77-ERROR = 1                                           096130      
001927          STRING " >> ERROR NO SE ENCUENTA LIBRERIA: "            096145      
001928          A01-MOV-FUNCION " >>>"                                  096160      
001929          DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                   096175      
001930          PERFORM 060700-DISPLAY                                  096190      
001931       ELSE                                                       096195      
001932          PERFORM 700000-S264-A-6DIG-COMP                         096200      
001933          CALL "CARGAMOV1 IN LIB-REGISTRA" USING WKS-MOV-DATOS    096300      
001934                                           GIVING W77-151-RESULT  096400      
001935         CANCEL "LIB-REGISTRA"                                    096450      
001936    ELSE                                                          096500      
001937       STRING " >>NO SE PUEDE PROCESAR MENSAJE, SIST. INVALIDO: " 096600      
001938       WKS-SA0-TRN-DSCOD " >>>"                                   096700      
001939       DELIMITED BY SIZE INTO  WKS-DIS-TEXTO                      096800      
001940       PERFORM 060700-DISPLAY                                     096900      
001941       MOVE 99                       TO W77-151-RESULT.           097000      
001942                                                                  097100      
001943    IF W77-151-RESULT = 0                                         097200      
001944       MOVE WKS-MOV-AUT-S151         TO A01-MOV-AUT-S151.         097300      
001945                                                                  097400      
001946    MOVE W77-151-RESULT              TO MSG-SAL-RESULT-L002.      097500      
001947    MOVE WKS-DATOS-S151              TO MSG-SAL-MENSAJE.          097600      
001948    PERFORM 201040-ARMA-MSG-SAL.                                  097700      
001949*    CANCEL "LIB-REGISTRA".                                       097800      
001950                                                                  097900      
001951 300000-FIN.                                                      098000      
001952     STOP RUN.                                                    098100      
001953                                                                  098200      
001954 900000-FIN-MAL.                                                  098300      
001955*===============                                                  098400      
001956    MOVE SPACES                       TO TEXTO-LJ.                098500      
001957    STRING " ERROR EN COMS, FIN ERRONEO DE PROGRAMA "             098600      
001958           " AVISAR AL RESPONSABLE DEL SISTEMA "                  098700      
001959    DELIMITED BY SIZE                                             098800      
001960    INTO TEXTO-LJ.                                                098900      
001961    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.          099000      
001962    PERFORM 999999-FIN.                                           099100      
001963                                                                  099200      
001964 020700-CLOSE-DISPLAY.                                            099300      
001965*=====================                                            099400      
001966     CLOSE  L01-DISPLAY       WITH SAVE.                          099500      
001967     MOVE WKS-FEC-NAT       TO WKS-RUT-L01-FCH                    099600      
001968     ACCEPT WKS-HRS-ACT       FROM TIME                           099700      
001969     MOVE WKS-HRS-ACT         TO WKS-RUT-L01-HORA                 099800      
001970                                                                  099900      
001971                                                                  100000      
001972                                                                  100100      
001973     OPEN OUTPUT L01-DISPLAY                                      100200      
001974     ADD   1  TO  CONT-REG-DISPLAY                                100300      
001975     WRITE REG-DISPLAY        FROM REGISTRO-DIS-HEADER.           100400      
001976                                                                  100500      
001977 201010-EXTRAE-L002.                                              100600      
001978*==================                                               100700      
001979    MOVE 0                         TO W77-ERROR.                  100800      
001980    MOVE ZEROS                     TO W77-151-RESULT.             100900      
001981    MOVE WKS-SA0-TRN-DSCOD         TO WKS-ID-SISTEMA.             101000      
001982    MOVE WKS-ID-CTLVER             TO WKS-CTLVER-LIBID.           101100      
001983    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID            101200      
001984                                     WKS-CTLVER-NOMLIB            101300      
001985                              GIVING WKS-CTRV-STATUS.             101400      
001986    IF WKS-CTRV-STATUS = 0                                        101500      
001987       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO                101600      
001988                                 WKS-CTLVER-NOMLIB                101700      
001989    ELSE                                                          101800      
001990       MOVE 1 TO W77-ERROR.                                       101900      
001991                                                                  102000      
001992 201040-ARMA-MSG-SAL.                                             102100      
001993*====================                                             102200      
001994    MOVE 737                      TO WKS-SA0-LONG.                102250      
001995    MOVE WKS-ACA-DESTINO          TO WKS-ACA-DESTINO-ANT.         102300      
001996    MOVE WKS-ACA-ORIGEN           TO WKS-ACA-ORIGEN-ANT.          102400      
001997    MOVE WKS-ACA-DESTINO-ANT      TO WKS-ACA-ORIGEN.              102500      
001998    MOVE WKS-ACA-ORIGEN-ANT       TO WKS-ACA-DESTINO.             102600      
001999    MOVE WKS-HDR-CCRDEST          TO WKS-HDR-CCRDEST-ANT.         102620      
002000    MOVE WKS-HDR-COPORGN          TO WKS-HDR-COPORGN-ANT.         102640      
002001    MOVE WKS-HDR-CCRDEST-ANT      TO WKS-HDR-COPORGN.             102660      
002002    MOVE WKS-HDR-COPORGN-ANT      TO WKS-HDR-CCRDEST.             102680      
002003    MOVE 2                        TO WKS-SA0-DIRECCION.           102700      
002004    MOVE MSG-SAL TO WKS-AREA-USUARIO.                             102800      
002005    PERFORM 201050-ENVIA-COMS.                                    102900      
002006                                                                  103000      
002007 201050-ENVIA-COMS.                                               103100      
002008*==================                                               103200      
002009    MOVE 1                            TO CS-COMS-OUT-COUNT        103300      
002010    MOVE 737                          TO CS-COMS-OUT-TEXT-LENGTH  103400      
002011    MOVE 0                            TO CS-COMS-OUT-STATUS-KEY   103500      
002012    MOVE W77-COMS-AG-SALIDA-DESG      TO CS-COMS-OUT-AGENDA       103600      
002013    MOVE W77-COMS-DEFSTATION-DESG     TO CS-COMS-OUT-DESTINATION  103700      
002014                                                                  103800      
002015   SEND COMS-OUT FROM WKS-REG-MSG.                                103900      
002016   IF CS-COMS-OUT-STATUS-KEY = 0 OR 96                            104000      
002017      NEXT SENTENCE                                               104100      
002018   ELSE                                                           104200      
002019      MOVE CS-COMS-OUT-STATUS-KEY    TO W77-STATUS-KEY            104300      
002020      STRING MY-ID " ERROR EN SEND MSG ST-KEY "                   104400      
002021             W77-STATUS-KEY                                       104500      
002022      DELIMITED BY SIZE INTO MENSAJE-LJ                           104600      
002023      CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ         104700      
002024      STRING MY-ID " ERROR EN SEND MSG ST-KEY "                   104800      
002025             W77-STATUS-KEY            DELIMITED BY SIZE ,        104900      
002026             A01-MOV-SISTEMA           DELIMITED BY SIZE ,        105000      
002027             A01-MOV-HORAMOV           DELIMITED BY SIZE ,        105100      
002028             WKS-SA0-DIRECCION         DELIMITED BY SIZE ,        105200      
002029                                       INTO WKS-DIS-TEXTO         105300      
002030      PERFORM 060700-DISPLAY.                                     105400      
002031    MOVE "ENVIO MENSAJE"  TO WKS-SENTIDO-MSG                      105500      
002032    PERFORM 060950-ESCRIBE-MONITOR.                               105600      
002033    MOVE SPACES TO WKS-AREA-USUARIO.                              105700      
002034    MOVE SPACES TO WKS-DATOS-S151.                                105800      
002035                                                                  105900      
002036 103000-VALIDA-CSI.                                               106000      
002037*=========================                                        106100      
002038    IF WKS-NOMEQUIPO = "VDMBETA."                                 106200      
002039       MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST                     106300      
002040    ELSE                                                          106400      
002041    IF WKS-NOMEQUIPO = "ACYPGAMA."  OR WKS-NOMEQUIPO = "MONALFA." 106500      
002042    OR WKS-NOMEQUIPO = "ACYPOMEGA." OR WKS-NOMEQUIPO = "VDMKAPPA."106600      
002043       MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST                     106700      
002044    ELSE                                                          106800      
002045       IF WKS-NUMCSI-HOST = 10                                    106900      
002046                MOVE 24 TO WKS-HDR-CCRDEST WKS-CSIDEST            107000      
002047       ELSE                                                       107100      
002048          IF WKS-NUMCSI-HOST = 4                                  107200      
002049                MOVE 23 TO WKS-HDR-CCRDEST WKS-CSIDEST.           107300      
002050                                                                  107400      
002051    IF WKS-NUMCSI-HOST = 10                                       107500      
002052       MOVE "VDM"                     TO WKS-RUT-L01-CSI          107600      
002053                                         WKS-RUT-L02-CSI          107700      
002054    ELSE                                                          107800      
002055       MOVE "MTY"                     TO WKS-RUT-L01-CSI          107900      
002056                                         WKS-RUT-L02-CSI.         108000      
002057                                                                  108100      
002058 700000-S264-A-6DIG-COMP.                                         108200      
002059*========================                                         108300      
002060    MOVE A01-MOV-FUNCION         TO WKS-MOV-FUNCION.              108400      
002061    MOVE A01-MOV-SISTEMA         TO WKS-MOV-SISTEMA.              108500      
002062    MOVE A01-MOV-PRODUCTO        TO WKS-MOV-PRODUCTO.             108600      
002063    MOVE A01-MOV-INSTRUMENTO     TO WKS-MOV-INSTRUMENTO.          108700      
002064    MOVE A01-MOV-SUCPROM         TO WKS-MOV-SUCPROM.              108800      
002065    MOVE A01-MOV-CONTRATO        TO WKS-MOV-CONTRATO.             108900      
002066    MOVE A01-MOV-CVETRAN1        TO WKS-MOV-CVETRAN(1).           109000      
002067    MOVE A01-MOV-IND-LEYE1       TO WKS-MOV-INDLEY (1).           109100      
002068    MOVE A01-MOV-ESQ-CONT1       TO WKS-MOV-ESQCON (1).           109200      
002069    MOVE A01-MOV-IMPORTE1        TO WKS-MOV-IMPORTE(1).           109300      
002070    MOVE A01-MOV-CVETRAN2        TO WKS-MOV-CVETRAN(2).           109400      
002071    MOVE A01-MOV-IND-LEYE2       TO WKS-MOV-INDLEY (2).           109500      
002072    MOVE A01-MOV-ESQ-CONT2       TO WKS-MOV-ESQCON (2).           109600      
002073    MOVE A01-MOV-IMPORTE2        TO WKS-MOV-IMPORTE(2).           109700      
002074    MOVE A01-MOV-CVETRAN3        TO WKS-MOV-CVETRAN(3).           109800      
002075    MOVE A01-MOV-IND-LEYE3       TO WKS-MOV-INDLEY (3).           109900      
002076    MOVE A01-MOV-ESQ-CONT3       TO WKS-MOV-ESQCON (3).           110000      
002077    MOVE A01-MOV-IMPORTE3        TO WKS-MOV-IMPORTE(3).           110100      
002078    MOVE A01-MOV-CVETRAN4        TO WKS-MOV-CVETRAN(4).           110200      
002079    MOVE A01-MOV-IND-LEYE4       TO WKS-MOV-INDLEY (4).           110300      
002080    MOVE A01-MOV-ESQ-CONT4       TO WKS-MOV-ESQCON (4).           110400      
002081    MOVE A01-MOV-IMPORTE4        TO WKS-MOV-IMPORTE(4).           110500      
002082    MOVE A01-MOV-CVETRAN5        TO WKS-MOV-CVETRAN(5).           110600      
002083    MOVE A01-MOV-IND-LEYE5       TO WKS-MOV-INDLEY (5).           110700      
002084    MOVE A01-MOV-ESQ-CONT5       TO WKS-MOV-ESQCON (5).           110800      
002085    MOVE A01-MOV-IMPORTE5        TO WKS-MOV-IMPORTE(5).           110900      
002086    MOVE A01-MOV-FECMOV          TO WKS-MOV-FECMOV.               111000      
002087    MOVE A01-MOV-HORAMOV         TO WKS-MOV-HORMOV.               111100      
002088    MOVE A01-MOV-FECCONT         TO WKS-MOV-FECCONT.              111200      
002089    MOVE A01-MOV-FECVAL          TO WKS-MOV-FECVAL.               111300      
002090    MOVE A01-MOV-NUM-AUTORIZA    TO WKS-MOV-AUTORIZA.             111400      
002091    MOVE A01-MOV-AUTORI-3ERNIV   TO WKS-MOV-AUT3ER.               111500      
002092    MOVE A01-MOV-REFEREN         TO WKS-MOV-REFNUM.               111600      
002093    MOVE A01-MOV-CVEMDA          TO WKS-MOV-CVEMDA.               111700      
002094    MOVE A01-MOV-MDA-SUC         TO WKS-MOV-MDA-SUC.              111800      
002095    MOVE A01-MOV-MDA-CTA         TO WKS-MOV-MDA-CTA.              111900      
002096    MOVE A01-MOV-CVEMDE          TO WKS-MOV-CVEMDE.               112000      
002097    MOVE A01-MOV-SUC-INIC        TO WKS-MOV-SUC-INIC.             112100      
002098    MOVE A01-MOV-CAJA-INIC       TO WKS-MOV-CAJA-INIC.            112200      
002099    MOVE A01-MOV-SUCOPER         TO WKS-MOV-SUCOPER.              112300      
002100    MOVE A01-MOV-CAJA-OPER       TO WKS-MOV-CAJAOPER.             112400      
002101    MOVE A01-MOV-SUCTRAN         TO WKS-MOV-SUCTRAN.              112500      
002102    MOVE A01-MOV-CAJA-TRAN       TO WKS-MOV-CAJATRAN.             112600      
002103    MOVE A01-MOV-NOMINA-OPE      TO WKS-MOV-NOMINA-OPE.           112700      
002104    MOVE A01-MOV-ORIGEN          TO WKS-MOV-ORIGEN.               112800      
002105    MOVE A01-MOV-MONEDA          TO WKS-MOV-MONEDA.               112900      
002106    MOVE A01-MOV-AUT-S151        TO WKS-MOV-AUT-S151.             113000      
002107    MOVE A01-MOV-AUT-ELIM-S151   TO WKS-MOV-AUT-AELIM-S151.       113100      
002108    MOVE A01-MOV-AUT-ANT-S151    TO WKS-MOV-AUT-ANT-S151.         113200      
002109    MOVE A01-MOV-TIPO-PROC       TO WKS-MOV-TIPO-PROC.            113300      
002110    MOVE A01-MOV-IND-SOBREGIRO   TO WKS-MOV-SOBREGIRO.            113400      
002111    MOVE A01-MOV-CVE-AVISO       TO WKS-MOV-CVEAVISO.             113500      
002112    MOVE A01-MOV-IND-EDOCTA      TO WKS-MOV-IND-EDOCTA.           113600      
002113    MOVE A01-MOV-IND-DATOS-ADIC  TO WKS-MOV-IND-DATOS-ADIC.       113700      
002114    MOVE A01-MOV-IND-CONTABILIZA TO WKS-MOV-IND-CONTA.            113800      
002115    MOVE A01-MOV-NUM-RENGLON     TO WKS-MOV-IND-NUMREN.           113900      
002116    MOVE A01-MOV-ACTIVIDAD       TO WKS-MOV-ACTIVIDAD.            114000      
002117    MOVE A01-MOV-SECTOR          TO WKS-MOV-SECTOR.               114100      
002118    MOVE A01-MOV-BANCA           TO WKS-MOV-BANCA.                114200      
002119    MOVE A01-MOV-BCO-S264        TO WKS-BCO-S264.                 114300      
002120    MOVE A01-MOV-BORI-S264       TO WKS-MOV-BORI-S264.            114400      
002121    MOVE A01-MOV-BDES-S264       TO WKS-MOV-BDES-S264.            114500      
002122    MOVE A01-MOV-NODO-ORIG       TO WKS-MOV-NODO-ORIG.            114600      
002123    MOVE A01-MOV-APU-DESC        TO WKS-MOV-APU-DESC.             114700      
002124    MOVE A01-MOV-STATUS          TO WKS-MOV-STATUS.               114800      
002125    MOVE A01-MOV-NOMINA-FUN1     TO WKS-MOV-NOMINA-FUN1.          114900      
002126    MOVE A01-MOV-NOMINA-FUN2     TO WKS-MOV-NOMINA-FUN2.          115000      
002127    MOVE A01-MOV-SIST-ORIG       TO WKS-MOV-SIST-ORIG.            115100      
002128    MOVE A01-MOV-PROD-ORIG       TO WKS-MOV-PROD-ORIG.            115200      
002129    MOVE A01-MOV-INST-ORIG       TO WKS-MOV-INST-ORIG.            115300      
002130    MOVE A01-MOV-CVETR-ORIG      TO WKS-MOV-CVETR-ORIG.           115400      
002131    MOVE A01-MOV-CONTRATO-TRAS   TO WKS-MOV-CONT-ORIG.            115500      
002132    MOVE A01-MOV-REFLOC-BNM      TO WKS-MOV-REFLOC-BNM.           115600      
002133    MOVE A01-USO-APLICACION      TO WKS-MOV-FILLERXAPLI.          115700      
002134    MOVE A01-MOV-LEYENDA1        TO WKS-MOV-LEY1.                 115800      
002135    MOVE A01-MOV-LEYENDA2        TO WKS-MOV-LEY2.                 115900      
002136    MOVE A01-MOV-LEYENDA3        TO WKS-MOV-LEY3.                 116000      
002137    MOVE A01-MOV-LEYENDA4        TO WKS-MOV-LEY4.                 116100      
002138    MOVE A01-MOV-LEYENDA5        TO WKS-MOV-LEY5.                 116200      
002139                                                                  116300      
