000001                                                                  000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000200      
000003$SET LIST                                                         000300      
000004$SET OLDCODE                                                      000400      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000500      
000006$SET LIST MAPINFO XREF LINEINFO ERRORLIMIT =100                   000600      
000007*$SET TADS                                                        000700      
000008*********************************************************         000720      
000009* RECOMPILACION POR EL UPGRADE DEL MCP A 55             *         000722      
000010* 20141205 15MTP001 MJGRG                               *         000724      
000011*********************************************************         000726      
000012 IDENTIFICATION   DIVISION.                                       000800      
000013 PROGRAM-ID.              PFORANEOS.                              000900      
000014 AUTHOR.                  ANSELMO SANCHEZ MARTINEZ.               001000      
000015 INSTALLATION.            BANAMEX                                 001100      
000016                          INGENIERIA DE SISTEMAS.                 001200      
000017*                                                                 001300      
000018 DATE-WRITTEN.            OCTUBRE DE 1998.                        001400      
000019 DATE-COMPILED.                                                   001500      
000020                                                                  001600      
000021*SECURITY.                COPYRIGHT BY SANCHEZ  CO.               001700      
000022*                                                                 001800      
000023 ENVIRONMENT      DIVISION.                                       001900      
000024                                                                  002000      
000025 CONFIGURATION    SECTION.                                        002100      
000026                                                                  002200      
000027                                                                  002300      
000028 INPUT-OUTPUT     SECTION.                                        002400      
000029 FILE-CONTROL.                                                    002500      
000030                                                                  002600      
000031     SELECT            A01-MOVTRA     ASSIGN TO DISK.             002700      
000032     SELECT            A01-SMOVTRA    ASSIGN TO SORT DISK.        002800      
000033     SELECT            A01-MOVREC     ASSIGN TO DISK.             002900      
000034     SELECT            A01-SMOVREC    ASSIGN TO SORT DISK.        003000      
000035     SELECT            A01-CONTROL    ASSIGN TO DISK              003100      
000036                                      ORGANIZATION IS SEQUENTIAL. 003200      
000037*ASM SELECT            A01-TOTBCO     ASSIGN TO DISK              003300      
000038*ASM                                  ORGANIZATION IS INDEXED     003400      
000039*ASM                                  ACCESS MODE IS DYNAMIC      003500      
000040*ASM                                  RECORD KEY IS KEY-BCO.      003600      
000041     SELECT            V01-REPORTE    ASSIGN TO PRINTER.          003700      
000042     SELECT            V00-REPORTE2   ASSIGN TO PRINTER.          003800      
000043                                                                  003900      
000044 DATA             DIVISION.                                       004000      
000045 FILE             SECTION.                                        004100      
000046                                                                  004200      
000047 FD  V00-REPORTE2                                                 004300      
000048     VALUE OF TITLE WKS-TIT-REPORTE2.                             004400      
000049                                                                  004500      
000050 01  V00-R00-REPORTE2             PIC X(132).                     004600      
000051                                                                  004700      
000052 FD  A01-MOVTRA                                                   004800      
000053     VALUE OF TITLE WKS-NOM-MOVTRA                                004900      
000054     VALUE OF DEPENDENTSPECS IS TRUE.                             005000      
000055                                                                  005100      
000056*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000057*     COPY "S151/FORMATO/ARCHIVO/PFORANEOS".                      005200      
000058                                                                  000100      
000059******************************************************************000200      
000060*                                                                *000300      
000061*   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS FORANEOS (PUNTEO)     *000400      
000062*   LONGITUD DEL REGISTRO 45 CARACTERES                          *000500      
000063*                                                                *000600      
000064******************************************************************000700      
000065                                                                  000800      
000066 01 A00-F00-HDR-FOR.                                              000900      
000067    02 A00-F00-HDR-TIPO                PIC  9(02) COMP.           001000      
000068    02 A00-F00-HDR-FCH                 PIC  9(08) COMP.           001100      
000069    02 FILLER                          PIC  X(40).                001200      
000070                                                                  001300      
000071 01 A00-F01-REG-FOR.                                              001400      
000072    03 A00-F01-KEY                     PIC  X(29).                001500      
000073    03 A00-F01-KEY-R                   REDEFINES A00-F01-KEY.     001600      
000074       05 A00-F01-TIPO                 PIC  9(02)      COMP.      001700      
000075       05 A00-F01-MONEDA               PIC  9(04)      COMP.      001800      
000076       05 A00-F01-AUTORIZA             PIC  9(08)      COMP.      001900      
000077       05 A00-F01-SUC-INIC             PIC  9(04)      COMP.      002000      
000078       05 A00-F01-CAJA-INIC            PIC  9(04)      COMP.      002100      
000079       05 A00-F01-CONTRATO             PIC  9(16)      COMP.      002200      
000080       05 A00-F01-CVETRAN1             PIC  9(04)      COMP.      002300      
000081       05 A00-F01-IMPORTE1             PIC  9(14)V99   COMP.      002400      
000082    03 A00-F01-PRODUCTO                PIC  9(04)      COMP.      002500      
000083    03 A00-F01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000084    03 A00-F01-SUCPROM                 PIC  9(04)      COMP.      002700      
000085    03 A00-F01-AUT-S151                PIC  9(08)      COMP.      002800      
000086    03 A00-F01-SUC-ADI                 PIC  9(04)      COMP.      002900      
000087    03 A00-F01-CAJA-ADI                PIC  9(04)      COMP.      003000      
000088    03 A00-F01-BCO-ORI                 PIC  9(03)      COMP.      003200      
000089    03 A00-F01-BCO-DES                 PIC  9(03)      COMP.      003300      
000090    03 A00-F01-INDSUBCTA               PIC  9(02)      COMP.      003400      
000091*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000092                                                                  005300      
000093 SD  A01-SMOVTRA.                                                 005400      
000094*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000095*     COPY "S151/FORMATO/ARCHIVO/PFORANEOS".                      005500      
000096                                                                  000100      
000097******************************************************************000200      
000098*                                                                *000300      
000099*   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS FORANEOS (PUNTEO)     *000400      
000100*   LONGITUD DEL REGISTRO 45 CARACTERES                          *000500      
000101*                                                                *000600      
000102******************************************************************000700      
000103                                                                  000800      
000104 01 A00-F00-HDR-FOR.                                              000900      
000105    02 A00-F00-HDR-TIPO                PIC  9(02) COMP.           001000      
000106    02 A00-F00-HDR-FCH                 PIC  9(08) COMP.           001100      
000107    02 FILLER                          PIC  X(40).                001200      
000108                                                                  001300      
000109 01 A00-F01-REG-FOR.                                              001400      
000110    03 A00-F01-KEY                     PIC  X(29).                001500      
000111    03 A00-F01-KEY-R                   REDEFINES A00-F01-KEY.     001600      
000112       05 A00-F01-TIPO                 PIC  9(02)      COMP.      001700      
000113       05 A00-F01-MONEDA               PIC  9(04)      COMP.      001800      
000114       05 A00-F01-AUTORIZA             PIC  9(08)      COMP.      001900      
000115       05 A00-F01-SUC-INIC             PIC  9(04)      COMP.      002000      
000116       05 A00-F01-CAJA-INIC            PIC  9(04)      COMP.      002100      
000117       05 A00-F01-CONTRATO             PIC  9(16)      COMP.      002200      
000118       05 A00-F01-CVETRAN1             PIC  9(04)      COMP.      002300      
000119       05 A00-F01-IMPORTE1             PIC  9(14)V99   COMP.      002400      
000120    03 A00-F01-PRODUCTO                PIC  9(04)      COMP.      002500      
000121    03 A00-F01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000122    03 A00-F01-SUCPROM                 PIC  9(04)      COMP.      002700      
000123    03 A00-F01-AUT-S151                PIC  9(08)      COMP.      002800      
000124    03 A00-F01-SUC-ADI                 PIC  9(04)      COMP.      002900      
000125    03 A00-F01-CAJA-ADI                PIC  9(04)      COMP.      003000      
000126    03 A00-F01-BCO-ORI                 PIC  9(03)      COMP.      003200      
000127    03 A00-F01-BCO-DES                 PIC  9(03)      COMP.      003300      
000128    03 A00-F01-INDSUBCTA               PIC  9(02)      COMP.      003400      
000129*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000130                                                                  005600      
000131 FD  A01-MOVREC                                                   005700      
000132     VALUE OF TITLE WKS-NOM-MOVREC                                005800      
000133     VALUE OF DEPENDENTSPECS IS TRUE.                             005900      
000134                                                                  006000      
000135*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000136*     COPY "S151/FORMATO/ARCHIVO/PFORANEOS".                      006100      
000137                                                                  000100      
000138******************************************************************000200      
000139*                                                                *000300      
000140*   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS FORANEOS (PUNTEO)     *000400      
000141*   LONGITUD DEL REGISTRO 45 CARACTERES                          *000500      
000142*                                                                *000600      
000143******************************************************************000700      
000144                                                                  000800      
000145 01 A00-F00-HDR-FOR.                                              000900      
000146    02 A00-F00-HDR-TIPO                PIC  9(02) COMP.           001000      
000147    02 A00-F00-HDR-FCH                 PIC  9(08) COMP.           001100      
000148    02 FILLER                          PIC  X(40).                001200      
000149                                                                  001300      
000150 01 A00-F01-REG-FOR.                                              001400      
000151    03 A00-F01-KEY                     PIC  X(29).                001500      
000152    03 A00-F01-KEY-R                   REDEFINES A00-F01-KEY.     001600      
000153       05 A00-F01-TIPO                 PIC  9(02)      COMP.      001700      
000154       05 A00-F01-MONEDA               PIC  9(04)      COMP.      001800      
000155       05 A00-F01-AUTORIZA             PIC  9(08)      COMP.      001900      
000156       05 A00-F01-SUC-INIC             PIC  9(04)      COMP.      002000      
000157       05 A00-F01-CAJA-INIC            PIC  9(04)      COMP.      002100      
000158       05 A00-F01-CONTRATO             PIC  9(16)      COMP.      002200      
000159       05 A00-F01-CVETRAN1             PIC  9(04)      COMP.      002300      
000160       05 A00-F01-IMPORTE1             PIC  9(14)V99   COMP.      002400      
000161    03 A00-F01-PRODUCTO                PIC  9(04)      COMP.      002500      
000162    03 A00-F01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000163    03 A00-F01-SUCPROM                 PIC  9(04)      COMP.      002700      
000164    03 A00-F01-AUT-S151                PIC  9(08)      COMP.      002800      
000165    03 A00-F01-SUC-ADI                 PIC  9(04)      COMP.      002900      
000166    03 A00-F01-CAJA-ADI                PIC  9(04)      COMP.      003000      
000167    03 A00-F01-BCO-ORI                 PIC  9(03)      COMP.      003200      
000168    03 A00-F01-BCO-DES                 PIC  9(03)      COMP.      003300      
000169    03 A00-F01-INDSUBCTA               PIC  9(02)      COMP.      003400      
000170*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000171                                                                  006200      
000172 SD  A01-SMOVREC.                                                 006300      
000173*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000174*     COPY "S151/FORMATO/ARCHIVO/PFORANEOS".                      006400      
000175                                                                  000100      
000176******************************************************************000200      
000177*                                                                *000300      
000178*   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS FORANEOS (PUNTEO)     *000400      
000179*   LONGITUD DEL REGISTRO 45 CARACTERES                          *000500      
000180*                                                                *000600      
000181******************************************************************000700      
000182                                                                  000800      
000183 01 A00-F00-HDR-FOR.                                              000900      
000184    02 A00-F00-HDR-TIPO                PIC  9(02) COMP.           001000      
000185    02 A00-F00-HDR-FCH                 PIC  9(08) COMP.           001100      
000186    02 FILLER                          PIC  X(40).                001200      
000187                                                                  001300      
000188 01 A00-F01-REG-FOR.                                              001400      
000189    03 A00-F01-KEY                     PIC  X(29).                001500      
000190    03 A00-F01-KEY-R                   REDEFINES A00-F01-KEY.     001600      
000191       05 A00-F01-TIPO                 PIC  9(02)      COMP.      001700      
000192       05 A00-F01-MONEDA               PIC  9(04)      COMP.      001800      
000193       05 A00-F01-AUTORIZA             PIC  9(08)      COMP.      001900      
000194       05 A00-F01-SUC-INIC             PIC  9(04)      COMP.      002000      
000195       05 A00-F01-CAJA-INIC            PIC  9(04)      COMP.      002100      
000196       05 A00-F01-CONTRATO             PIC  9(16)      COMP.      002200      
000197       05 A00-F01-CVETRAN1             PIC  9(04)      COMP.      002300      
000198       05 A00-F01-IMPORTE1             PIC  9(14)V99   COMP.      002400      
000199    03 A00-F01-PRODUCTO                PIC  9(04)      COMP.      002500      
000200    03 A00-F01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000201    03 A00-F01-SUCPROM                 PIC  9(04)      COMP.      002700      
000202    03 A00-F01-AUT-S151                PIC  9(08)      COMP.      002800      
000203    03 A00-F01-SUC-ADI                 PIC  9(04)      COMP.      002900      
000204    03 A00-F01-CAJA-ADI                PIC  9(04)      COMP.      003000      
000205    03 A00-F01-BCO-ORI                 PIC  9(03)      COMP.      003200      
000206    03 A00-F01-BCO-DES                 PIC  9(03)      COMP.      003300      
000207    03 A00-F01-INDSUBCTA               PIC  9(02)      COMP.      003400      
000208*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000209                                                                  006500      
000210 FD  A01-CONTROL                                                  006600      
000211     VALUE OF TITLE IS "(S151)S151/FILE/CONTROL/CORP."            006700      
000212     VALUE OF DEPENDENTSPECS IS TRUE.                             006800      
000213                                                                  006900      
000214 01  A01-REG-CONTROL                      PIC X(90).              007000      
000215                                                                  007100      
000216*ASM FD A01-TOTBCO                                                007200      
000217*ASM    VALUE OF BUFFERS IS 40                                    007300      
000218*ASM    VALUE OF SECURITYTYPE IS PUBLIC                           007400      
000219*ASM    VALUE OF DEPENDENTSPECS IS TRUE                           007500      
000220*ASM    VALUE OF TITLE IS WKS-TIT-TB.                             007600      
000221*ASM 01 REG-TB.                                                   007700      
000222*ASM03 KEY-BCO.                                                   007800      
000223*ASM   05 KEY-SIST                           PIC 9(04) COMP.      007900      
000224*ASM   05 KEY-CSI-ORI                        PIC 9(02) COMP.      008000      
000225*ASM   05 KEY-CSI-DES                        PIC 9(02) COMP.      008100      
000226*ASM   05 KEY-MON                            PIC 9(04) COMP.      008200      
000227*ASM   05 KEY-BCO-ORI                        PIC 9(03) COMP.      008300      
000228*ASM   05 KEY-BCO-DES                        PIC 9(03) COMP.      008400      
000229*ASM03 BCO-TOT.                                                   008500      
000230*ASM   05 TOT-CGO-OK                         PIC 9(14)V99 COMP.   008600      
000231*ASM   05 TOT-ABO-OK                         PIC 9(14)V99 COMP.   008700      
000232*ASM   05 TOT-CGO-TRA                        PIC 9(14)V99 COMP.   008800      
000233*ASM   05 TOT-ABO-TRA                        PIC 9(14)V99 COMP.   008900      
000234*ASM   05 TOT-CGO-REC                        PIC 9(14)V99 COMP.   009000      
000235*ASM   05 TOT-ABO-REC                        PIC 9(14)V99 COMP.   009100      
000236*ASM03 FILLER                                PIC X(03).           009200      
000237                                                                  009300      
000238 FD  V01-REPORTE                                                  009400      
000239     VALUE OF TITLE IS WKS-TIT-REPORTE.                           009500      
000240                                                                  009600      
000241 01  REG-REP                      PIC X(132).                     009700      
000242                                                                  009800      
000243 WORKING-STORAGE  SECTION.                                        009900      
000244*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000245*  COPY "S151/CRONOS2K/CPY/WS".                                   010000      
000246******************************************************************000100      
000247** This copyBook defines all the additional variables that      **000200      
000248** Unisys has defined for the CRONOS2K project                  **000300      
000249** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000250******************************************************************000500      
000251                                                                  000600      
000252******************************************************************000700      
000253** These Variables are used to Accept the system date in long   **000800      
000254** format and get the century information                       **000900      
000255** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000256 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000257 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000258    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000259    05 FILLER      PIC X(1).                                      001400      
000260    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000261    05 FILLER      PIC X(1).                                      001600      
000262    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000263    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000264      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000265      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000266******************************************************************002100      
000267                                                                  002200      
000268******************************************************************002300      
000269** This variable defines a date in the format MMDDCCAA          **002400      
000270**                                                              **002500      
000271 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000272 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000273    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000274    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000275    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000276    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000277      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000278      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000279******************************************************************003400      
000280                                                                  003500      
000281******************************************************************003600      
000282** This variable defines a date in the format CCAAMMDD          **003700      
000283**                                                              **003800      
000284 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000285 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000286    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000287    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000288      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000289      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000290    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000291    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000292******************************************************************004700      
000293                                                                  004800      
000294******************************************************************004900      
000295** This variable defines a date in the format DDMMCCAA          **005000      
000296**                                                              **005100      
000297 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000298 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000299    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000300    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000301    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000302    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000303      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000304      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000305******************************************************************006000      
000306                                                                  006100      
000307******************************************************************006200      
000308** This variable defines a date in the Julian Format CCAADDD    **006300      
000309**                                                              **006400      
000310 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000311 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000312    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000313    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000314                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000315      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000316      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000317    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000318******************************************************************007300      
000319                                                                  007400      
000320******************************************************************007500      
000321** This variable defines a date in the format AAMMDD            **007600      
000322**                                                              **007700      
000323 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000324 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000325    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000326    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000327    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000328******************************************************************008300      
000329                                                                  008400      
000330******************************************************************008500      
000331** This variable defines a date in the format MMDDAA            **008600      
000332**                                                              **008700      
000333 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000334 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000335    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000336    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000337    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000338******************************************************************009300      
000339                                                                  009400      
000340******************************************************************009500      
000341** This variable defines a date in the format DDMMAA            **009600      
000342**                                                              **009700      
000343 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000344 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000345    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000346    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000347    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000348******************************************************************010300      
000349                                                                  010400      
000350******************************************************************010500      
000351** These variables are defined to be used for CALL bridge logic **010600      
000352**                                                              **010700      
000353 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000354 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000355 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000356 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000357 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000358 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000359******************************************************************011400      
000360                                                                  011500      
000361******************************************************************011600      
000362** This variable is used for converting only a year field AA to **011700      
000363** CCAA and a CCAA to AA                                        **011800      
000364 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000365 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000366    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000367    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000368 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000369 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000370******************************************************************012300      
000371                                                                  012400      
000372******************************************************************012500      
000373** These variables are Bridge Variables for Intercambio files   **012600      
000374** para EDOCTA                                                  **012700      
000375 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000376 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000377 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000378 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000379 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000380 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000381 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000382******************************************************************013500      
000383* Para MODULO                                                     013600      
000384 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000385******************************************************************013800      
000386******************************************************************013900      
000387** Para FMOVSCHABO                                                014000      
000388 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000389******************************************************************014200      
000390                                                                  014300      
000391******************************************************************014400      
000392***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000393******************************************************************014600      
000394                                                                  014700      
000395 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000396 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000397     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000398     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000399     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000400******************************************************************015300      
000401                                                                  015400      
000402******************************************************************015500      
000403***  These Variables Are Defined For Date In AAMM Format       ***015600      
000404******************************************************************015700      
000405                                                                  015800      
000406 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000407 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000408     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000409     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000410******************************************************************016300      
000411                                                                  016400      
000412                                                                  016500      
000413*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000414  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       010100      
000415                                                                  010200      
000416*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000417* COPY "(S151)S151/FORMATO/DISPLAY.".                             010300      
000418                                                                  000100      
000419*===============================================================* 000200      
000420*         FORMATO PARA DISPLAYS                                 * 000300      
000421*===============================================================* 000400      
000422                                                                  000500      
000423 01 WKS-TIT-REPORTE2.                                             000600      
000424    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000425    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000426    02 FILLER                       PIC X(06) VALUE               000900      
000427                                              "/LIST/".           001000      
000428    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000429    02 FILLER                       PIC X(01) VALUE "/".          001071      
000430    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000431    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000432    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000433    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000434    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000435    02 FILLER                       PIC X(11) VALUE               001600      
000436                                              "/001MSGIMP.".      001700      
000437                                                                  002100      
000438 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000439                                                                  002300      
000440***********************************************************       002400      
000441*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000442***********************************************************       002600      
000443 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000444*8D                                                               002800      
000445 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000446 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000447    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000448    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000449    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000450*8D                                                               003400      
000451 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000452 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000453    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000454    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000455    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000456                                                                  004100      
000457 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000458                                                                  004300      
000459 01 WKS-FECHA-HORA2.                                              004400      
000460    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000461    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000462       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000463       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000464    02 WKS-TIME-MAQ2.                                             004600      
000465       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000466       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000467          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000468          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000469          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000470       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000471    02 FILLER                             PIC X(01).              004900      
000472    02 WKS-RESTO2                         PIC X(04).              005000      
000473                                                                  005100      
000474*8D                                                               005200      
000475****************** REPORTE DE MENSAJES *********************      005300      
000476 01 WLI-ENCAB-12.                                                 005400      
000477    03 FILLER                             PIC X(05) VALUE         005500      
000478       "S151-".                                                   005600      
000479    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000480    03 FILLER                             PIC X(15) VALUE         005671      
000481       "-001IMPMENSAJES".                                         005691      
000482    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000483    03 FILLER                             PIC X(34) VALUE         005800      
000484       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000485    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000486    03 FILLER                             PIC X(26) VALUE         006100      
000487       "FECHA DE LA INFORMACION : ".                              006200      
000488    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000489    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000490       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000491       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000492       05  WKS-SLASH1                         PIC X(01).          006356      
000493       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000494       05  WKS-SLASH2                         PIC X(01).          006358      
000495       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000496 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000497 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000498    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000499    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000500    03 FILLER                          PIC X(01).                 006371      
000501    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000502    03 FILLER                          PIC X(01).                 006381      
000503    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000504*8D                                                               006400      
000505 01 WLI-ENCAB-22.                                                 006500      
000506     03 FILLER                          PIC X(11) VALUE           006600      
000507        "F.PROCESO: ".                                            006700      
000508     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000509     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000510     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000511     03 FILLER                          PIC X(01) VALUE ":".      007020      
000512     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000513     03 FILLER                          PIC X(01) VALUE ":".      007060      
000514     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000515     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000516     03 FILLER                          PIC X(24) VALUE           007200      
000517              "IMPRESION MENSAJES DEL S".                         007300      
000518     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000519     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000520     03 FILLER                          PIC X(14) VALUE           007600      
000521        "TIPO PROCESO: ".                                         007700      
000522     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000523*8D                                                               007900      
000524 01 WLI-ENCAB-32.                                                 008000      
000525     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000526*       "VERSION  : ".                                            008200      
000527*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000528     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000529     03 FILLER                     PIC X(07) VALUE                008500      
000530        "HOJA : ".                                                008600      
000531     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000532                                                                  008800      
000533 01 WLI-ENCAB-42.                                                 008900      
000534     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000535     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000536     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000537                                                                  009300      
000538 01 WLI-ENCAB-52.                                                 009400      
000539    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000540    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000541    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000542    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000543                                                                  009900      
000544*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000545 01 WLI-ENCAB-62.                                                 009910      
000546    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000547    03 WLI-RESULT                 PIC X(04).                      009920      
000548    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000549    03 WLI-TEXTO                  PIC X(110).                     009930      
000550                                                                  009935      
000551 01 WLI-TOT-ENVIO.                                                009940      
000552    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000553    03 FILLER                     PIC X(37) VALUE                 009950      
000554       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000555    03 WLI-ENV-CTD                PIC X(04).                      009960      
000556*FIN - INFOWARE                                                   009970      
000557****************************************************************  010000      
000558*                 CONTADORES DE HOJAS                          *  010100      
000559****************************************************************  010200      
000560                                                                  010300      
000561  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000562*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000563                                                                  010400      
000564 77  W77-CSI              PIC  9(02) COMP   VALUE ZEROES.         010500      
000565 77  W77-EOF              PIC  9(02) COMP   VALUE ZEROES.         010600      
000566 77  W77-FUNCION          PIC S9(11) BINARY VALUE ZEROES.         010700      
000567 77  W77-FORMATO          PIC S9(11) BINARY VALUE ZEROES.         010800      
000568 77  W77-CSI-TRA          PIC 9(02).                              010900      
000569 77  W77-CSI-REC          PIC 9(02).                              011000      
000570 77  W77-MOVS-OK          PIC 9(08) VALUE ZEROS.                  011100      
000571                                                                  011200      
000572 01  WKS-TABLA-SISTEMA.                                           011300      
000573     02  WKS-TABLA-SIST OCCURS 10 TIMES.                          011400      
000574         03  WKS-TAB-SIST     PIC 9(03).                          011500      
000575         03  WKS-TAB-FECPRO   PIC 9(08).                          011600      
000576                                                                  011700      
000577 01  WKS-REG-HD-CONTROL.                                          011800      
000578     03  WKS-HD-CSI       PIC 9(02).                              011900      
000579     03  WKS-HD-FECPRO    PIC 9(08).                              012000      
000580     03  FILLER           PIC X(80).                              012100      
000581                                                                  012200      
000582 01  WKS-REG-DET-CONTROL.                                         012300      
000583     03  WKS-DET-SIST     PIC 9(03).                              012400      
000584     03  WKS-DET-FECPRO   PIC 9(08).                              012500      
000585     03  WKS-DET-INDPF    PIC 9(01).                              012600      
000586                                                                  012700      
000587 01  WKS-DATOS-HOST.                                              012800      
000588     03 WKS-NUMCSI                           PIC 9(02).           012900      
000589     03 WKS-NOMEQUIPO                        PIC X(10).           013000      
000590     03 WKS-NOMCSI                           PIC X(26).           013100      
000591     03 WKS-LINEABATCH                       PIC X(05).           013200      
000592                                                                  013300      
000593 01 KEY-BCO-ANT.                                                  013310      
000594     03 KEY-SIST-ANT                       PIC 9(04) COMP.        013320      
000595     03 KEY-CSI-ORI-ANT                    PIC 9(02) COMP.        013330      
000596     03 KEY-CSI-DES-ANT                    PIC 9(02) COMP.        013340      
000597     03 KEY-MON-ANT                        PIC 9(04) COMP.        013350      
000598     03 KEY-BCO-ORI-ANT                    PIC 9(03) COMP.        013360      
000599     03 KEY-BCO-DES-ANT                    PIC 9(03) COMP.        013370      
000600                                                                  013380      
000601******************************************************************013400      
000602*                 ETIQUETA DEL ARCHIVO                           *013500      
000603******************************************************************013600      
000604*                                                                 013700      
000605 01  WKS-TIT-REPORTE.                                             013800      
000606     02  FILLER                     PIC X(01)   VALUE "S".        013900      
000607     02  WKS-SISTEMA-BACKUP         PIC 9(03)   VALUE 151.        014000      
000608     02  FILLER                     PIC X(11)   VALUE             014100      
000609                                    "/LIST/P113/".                014200      
000610     02  WKS-CSI-IMP                PIC 9(02).                    014300      
000611     02  FILLER                     PIC X(08)   VALUE "00/R000/". 014400      
000612     02  WKS-FECHA-BACKUP           PIC 9(06).                    014500      
000613     02  FILLER                     PIC X(1)    VALUE "/".        014600      
000614     02  WKS-MIX-BACKUP             PIC 9(07).                    014700      
000615     02  FILLER                     PIC X(1)    VALUE "/".        014800      
000616     02  WS-NOMB-REPORTE.                                         014900      
000617         04 FILLER                  PIC X(03)   VALUE "002".      015000      
000618         04 WS-NOMBRE-BACKUP        PIC X(09)   VALUE "PFORANEOS".015100      
000619         04 FILLER                  PIC X(1)    VALUE ".".        015200      
000620                                                                  015300      
000621 01 WKS-NOM-MOVTRA.                                               015400      
000622    02 FILLER                             PIC X(11) VALUE         015500      
000623    "S151/FILE/S".                                                015600      
000624    02 WKS-SIS-TRA                        PIC 9(03).              015700      
000625    02 FILLER                             PIC X(01) VALUE         015800      
000626    "/".                                                          015900      
000627    02 WKS-TRCSI-TRA                      PIC 9(02).              016000      
000628    02 FILLER                             PIC X(01) VALUE         016100      
000629    "/".                                                          016200      
000630    02 WKS-TRCSI-REC                      PIC 9(02).              016300      
000631    02 FILLER                             PIC X(07) VALUE         016400      
000632    "/PFOTR/".                                                    016500      
000633    02 WKS-FECHA-TRA                      PIC 9(06).              016600      
000634    02 FILLER                             PIC X(01) VALUE ".".    016700      
000635                                                                  016800      
000636 01 WKS-NOM-MOVREC.                                               016900      
000637    02 FILLER                             PIC X(11) VALUE         017000      
000638    "S151/FILE/S".                                                017100      
000639    02 WKS-SIS-REC                        PIC 9(03).              017200      
000640    02 FILLER                             PIC X(01) VALUE         017300      
000641    "/".                                                          017400      
000642    02 WKS-RCCSI-TRA                      PIC 9(02).              017500      
000643    02 FILLER                             PIC X(01) VALUE         017600      
000644    "/".                                                          017700      
000645    02 WKS-RCCSI-REC                      PIC 9(02).              017800      
000646    02 FILLER                             PIC X(07) VALUE         017900      
000647    "/PFORE/".                                                    018000      
000648    02 WKS-FECHA-REC                      PIC 9(06).              018100      
000649    02 FILLER                             PIC X(01) VALUE ".".    018200      
000650                                                                  018300      
000651*ASM  01 WKS-TIT-TB.                                              018400      
000652*ASM 02 FILLER                            PIC X(24) VALUE         018500      
000653*ASM "(S151)S151/FILE/TOTBCOS.".                                  018600      
000654                                                                  018700      
000655***********************************************************       018800      
000656*      VARIABLES PARA OBTENER FECHA DE COMPILACION        *       018900      
000657***********************************************************       019000      
000658 01  COMPILA                         PIC 9(11)    BINARY.         019100      
000659                                                                  019200      
000660 01  WS-VERSION                      PIC 9(08)    COMP.           019300      
000661 01  WS-VERSION-R         REDEFINES       WS-VERSION.             019400      
000662     03 WS-MES-VERSION               PIC 9(02)    COMP.           019500      
000663     03 WS-DIA-VERSION               PIC 9(02)    COMP.           019600      
000664     03 WS-AAA-VERSION               PIC 9(04)    COMP.           019700      
000665*                                                                 019800      
000666******************************************************************019900      
000667*                 DESCRIPCION DE REPORTE                         *020000      
000668******************************************************************020100      
000669*                                                                 020200      
000670 01  COMUN-TITULO-1.                                              020300      
000671     02 FILLER       PIC X(5)  VALUE SPACES.                      020400      
000672     02 TIRE-COM1    PIC X.                                       020500      
000673     02 FILLER       PIC X(6)  VALUE "/S151-".                    020600      
000674     02 SUBS-COM1    PIC 9(3).                                    020700      
000675     02 FILLER       PIC X     VALUE "/".                         020800      
000676     02 PASO-COM1    PIC 9(3).                                    020900      
000677     02 FILLER       PIC X     VALUE "-".                         021000      
000678     02 NURE-COM1    PIC 9(3).                                    021100      
000679     02 FILLER       PIC X(23) VALUE SPACES.                      021200      
000680     02 BNCO-COM1    PIC X(40) VALUE                              021300      
000681                     "               B A N A M E X".              021400      
000682     02 FILLER       PIC X(23) VALUE SPACES.                      021500      
000683     02 FILLER       PIC X(10) VALUE "FECHA   : ".                021600      
000684     02 FECH-COM1    PIC 9999/99/99.                              021700      
000685     02 FILLER       PIC X(3) VALUE SPACES.                       021800      
000686 01  COMUN-TITULO-2.                                              021900      
000687     02 FILLER       PIC X(5)  VALUE SPACES.                      022000      
000688     02 FILLER       PIC X(7)  VALUE "PASO : ".                   022100      
000689     02 PASO-COM2    PIC X(15).                                   022200      
000690     02 FILLER       PIC X(17) VALUE SPACES.                      022300      
000691     02 FILLER       PIC X(42) VALUE                              022400      
000692        "     ADMINISTRADOR DE SALDOS Y MOVIMIENTOS".             022500      
000693     02 FILLER       PIC X(23) VALUE SPACES.                      022600      
000694     02 FILLER       PIC X(10) VALUE "PROCESO : ".                022700      
000695     02 TIPO-COM2    PIC X(8).                                    022800      
000696     02 FILLER       PIC X(5)  VALUE SPACES.                      022900      
000697 01  COMUN-TITULO-3.                                              023000      
000698     02 FILLER       PIC X(33)  VALUE SPACES.                     023100      
000699*mgv 02 FILLER       PIC X(10) VALUE "VERSION : ".                023200      
000700*mgv 02 VERS-AA      PIC 9(04).                                   023300      
000701*mgv 02 FILLER       PIC X VALUE "/".                             023400      
000702*mgv 02 VERS-MM      PIC 99.                                      023500      
000703*mgv 02 FILLER       PIC X VALUE "/".                             023600      
000704*mgv 02 VERS-DD      PIC 99.                                      023700      
000705*mgv 02 FILLER       PIC X(08) VALUE SPACES.                      023800      
000706     02 TITU-COM3    PIC X(70).                                   023900      
000707     02 FILLER       PIC X(06) VALUE SPACES.                      024000      
000708     02 FILLER       PIC X(10) VALUE "HOJA    : ".                024100      
000709     02 HOJA-COM3    PIC Z,ZZ9.                                   024200      
000710     02 FILLER       PIC X(5)  VALUE SPACES.                      024300      
000711 01  COMUN-TITULO-4.                                              024400      
000712     02 FILLER       PIC X(50) VALUE                              024500      
000713          "==================================================".   024600      
000714     02 FILLER       PIC X(50) VALUE                              024700      
000715          "==================================================".   024800      
000716     02 FILLER       PIC X(32) VALUE                              024900      
000717          "================================".                     025000      
000718 01  NOMBRE-RPTE1.                                                025100      
000719     02 FILLER       PIC X(17) VALUE "PUNTEO FORANEOS S".         025200      
000720     02 NOM-REP-SIST PIC 9(03).                                   025300      
000721     02 FILLER       PIC X(22) VALUE " DEL CSI TRANSMISOR : ".    025400      
000722     02 NOM-REP-CSITRA    PIC 9(02).                              025500      
000723     02 FILLER       PIC X(21) VALUE " Y EL CSI RECEPTOR : ".     025600      
000724     02 NOM-REP-CSIREC    PIC 9(02).                              025700      
000725 01  CONT-ARCH-TITULO-0.                                          025705      
000726     02 FILLER       PIC X(05) VALUE "  SUC".                     025710      
000727     02 FILLER       PIC X(32) VALUE SPACES.                      025715      
000728     02 FILLER       PIC X(03) VALUE "CVE".                       025720      
000729     02 FILLER       PIC X(22) VALUE SPACES.                      025725      
000730     02 FILLER       PIC X(08) VALUE "AUTORIZA".                  025730      
000731     02 FILLER       PIC X(01) VALUE SPACES.                      025735      
000732     02 FILLER       PIC X(08) VALUE "AUTORIZA".                  025740      
000733     02 FILLER       PIC X(01) VALUE SPACES.                      025745      
000734     02 FILLER       PIC X(03) VALUE "BCO".                       025750      
000735     02 FILLER       PIC X(01) VALUE SPACES.                      025755      
000736     02 FILLER       PIC X(03) VALUE "BCO".                       025760      
000737     02 FILLER       PIC X(01) VALUE SPACES.                      025765      
000738     02 FILLER       PIC X(03) VALUE "SUC".                       025770      
000739     02 FILLER       PIC X(02) VALUE SPACES.                      025775      
000740     02 FILLER       PIC X(04) VALUE "CAJA".                      025780      
000741 01  CONT-ARCH-TITULO-1.                                          025800      
000742     02 FILLER       PIC X(06) VALUE "  PROM".                    025900      
000743     02 FILLER       PIC X(08) VALUE SPACES.                      026000      
000744     02 FILLER       PIC X(08) VALUE "CONTRATO".                  026100      
000745     02 FILLER       PIC X(04) VALUE SPACES.                      026200      
000746     02 FILLER       PIC X(03) VALUE "PRD".                       026300      
000747     02 FILLER       PIC X(03) VALUE SPACES.                      026400      
000748     02 FILLER       PIC X(04) VALUE "INST".                      026500      
000749     02 FILLER       PIC X(01) VALUE SPACES.                      026600      
000750     02 FILLER       PIC X(03) VALUE "TRA".                       026700      
000751     02 FILLER       PIC X(10) VALUE SPACES.                      026800      
000752     02 FILLER       PIC X(07) VALUE "IMPORTE".                   026900      
000753     02 FILLER       PIC X(06) VALUE SPACES.                      027000      
000754     02 FILLER       PIC X(06) VALUE "ORIGEN".                    027100      
000755     02 FILLER       PIC X(04) VALUE SPACES.                      027200      
000756     02 FILLER       PIC X(04) VALUE "S151".                      027300      
000757     02 FILLER       PIC X(03) VALUE SPACES.                      027400      
000758     02 FILLER       PIC X(03) VALUE "ORI".                       027420      
000759     02 FILLER       PIC X(01) VALUE SPACES.                      027440      
000760     02 FILLER       PIC X(03) VALUE "DES".                       027460      
000761     02 FILLER       PIC X(01) VALUE SPACES.                      027480      
000762     02 FILLER       PIC X(03) VALUE "OPE".                       027500      
000763     02 FILLER       PIC X(02) VALUE SPACES.                      027600      
000764     02 FILLER       PIC X(03) VALUE "OPE".                       027700      
000765     02 FILLER       PIC X(15) VALUE SPACES.                      027800      
000766     02 FILLER       PIC X(07) VALUE "LEYENDA".                   027900      
000767 01  CONT-ARCH-TITULO-2.                                          028000      
000768     02 FILLER       PIC X(01) VALUE SPACES.                      028100      
000769     02 FILLER       PIC X(06) VALUE "MONEDA".                    028200      
000770     02 FILLER       PIC X(06) VALUE SPACES.                      028300      
000771     02 FILLER       PIC X(09) VALUE "CARGOS OK".                 028400      
000772     02 FILLER       PIC X(11) VALUE SPACES.                      028500      
000773     02 FILLER       PIC X(09) VALUE "ABONOS OK".                 028600      
000774     02 FILLER       PIC X(06) VALUE SPACES.                      028700      
000775     02 FILLER       PIC X(14) VALUE "CARGOS ERR/TRA".            028800      
000776     02 FILLER       PIC X(06) VALUE SPACES.                      028900      
000777     02 FILLER       PIC X(14) VALUE "ABONOS ERR/TRA".            029000      
000778     02 FILLER       PIC X(06) VALUE SPACES.                      029100      
000779     02 FILLER       PIC X(14) VALUE "CARGOS ERR/REC".            029200      
000780     02 FILLER       PIC X(06) VALUE SPACES.                      029300      
000781     02 FILLER       PIC X(14) VALUE "ABONOS ERR/REC".            029400      
000782                                                                  029500      
000783 01 WRS-D1.                                                       029600      
000784    02 FILLER                      PIC X(01) VALUE SPACES.        029700      
000785    02 WRS-D1-SUCPROM              PIC Z(04)B(02).                029800      
000786    02 WRS-D1-CONTRATO             PIC Z(16)B(02).                029900      
000787    02 WRS-D1-PRODUCTO             PIC Z(04)B(02).                030000      
000788    02 WRS-D1-INSTRUMENTO          PIC Z(04)B(02).                030100      
000789    02 WRS-D1-CVETRAN1             PIC Z(04)B(01).                030200      
000790    02 WRS-D1-IMPORTE1             PIC $$$$,$$$,$$$,$$9.99B(01).  030300      
000791    02 WRS-D1-AUTORIZA             PIC 9(08)B(01).                030400      
000792    02 WRS-D1-AUTS151              PIC 9(08)B(01).                030500      
000793    02 WSR-D1-BCO-ORI              PIC 9(03)B(01).                030600      
000794    02 WSR-D1-BCO-DES              PIC 9(03)B(01).                030700      
000795    02 WRS-D1-SUCINI               PIC 9(04)B(01).                030800      
000796    02 WRS-D1-CAJA-INIC            PIC 9(04)B(01).                030900      
000797    02 WRS-D1-LEY                  PIC X(34).                     031000      
000798                                                                  031100      
000799 01 WRS-D2.                                                       031200      
000800    02 FILLER                      PIC X(02) VALUE SPACES.        031300      
000801    02 WRS-D2-MON                  PIC 9(04).                     031400      
000802    02 FILLER                      PIC X(01) VALUE SPACES.        031500      
000803    02 WRS-D2-CAROK                PIC $$$$,$$$,$$$,$$9.99B(01).  031600      
000804    02 WRS-D2-ABOOK                PIC $$$$,$$$,$$$,$$9.99B(01).  031700      
000805    02 WRS-D2-CARERRTRA            PIC $$$$,$$$,$$$,$$9.99B(01).  031800      
000806    02 WRS-D2-ABOERRTRA            PIC $$$$,$$$,$$$,$$9.99B(01).  031900      
000807    02 WRS-D2-CARERRREC            PIC $$$$,$$$,$$$,$$9.99B(01).  032000      
000808    02 WRS-D2-ABOERRREC            PIC $$$$,$$$,$$$,$$9.99B(02).  032100      
000809                                                                  032200      
000810 01 WRS-D3.                                                       032300      
000811    02 FILLER                      PIC X(40) VALUE                032400      
000812                 "                                        ".      032500      
000813    02 FILLER                      PIC X(52) VALUE                032600      
000814       "N O   E X I S T E N   D I F E R E N C I A S   E N   ".    032700      
000815    02 FILLER                      PIC X(21) VALUE                032800      
000816       "E S T A   M O N E D A".                                   032900      
000817                                                                  033000      
000818 01 WKS-TAB-LEYENDAS.                                             033100      
000819    03 WKS-LEYENDA-TRA.                                           033200      
000820       05 WKS-FILLER1              PIC X(13) VALUE                033300      
000821                                            "TRANSMIT. EN ".      033400      
000822       05 WKS-LEY-CSIT1            PIC 9(02).                     033500      
000823       05 WKS-FILLER2              PIC X(17) VALUE                033600      
000824                                            " NO RECIBIDO  EN ".  033700      
000825       05 WKS-LEY-CSIT2            PIC 9(02).                     033800      
000826*INICIA MODIFICACION SUBCUENTAS AHM**                             033802      
000827    03 WKS-LEYENDA-TRA-SC.                                        033804      
000828       05 WKS-FILLER1-SC           PIC X(09) VALUE                033806      
000829                                            "TRANS EN ".          033808      
000830       05 WKS-LEY-CSIT1-SC         PIC 9(02).                     033810      
000831       05 WKS-FILLER2-SC           PIC X(17) VALUE                033812      
000832                                            " NO RECIBIDO  EN ".  033814      
000833       05 WKS-LEY-CSIT2-SC         PIC 9(02).                     033816      
000834       05 WKS-FILLER5-SC           PIC X(04) VALUE                033818      
000835                                            ". SC".               033820      
000836*TERMINA MODIFICACION SUBCUENTAS**                                033822      
000837    03 WKS-LEYENDA-REC.                                           033900      
000838       05 WKS-FILLER3              PIC X(13) VALUE                034000      
000839                                            "RECIBIDO  EN ".      034100      
000840       05 WKS-LEY-CSIR1            PIC 9(02).                     034200      
000841       05 WKS-FILLER4              PIC X(17) VALUE                034300      
000842                                            " NO TRANSMIT. EN ".  034400      
000843       05 WKS-LEY-CSIR2            PIC 9(02).                     034500      
000844*INICIA MODIFICACION SUBCUENTAS**                                 034502      
000845    03 WKS-LEYENDA-REC-SC.                                        034504      
000846       05 WKS-FILLER3-SC           PIC X(13) VALUE                034506      
000847                                            "RECIBIDO  EN ".      034508      
000848       05 WKS-LEY-CSIR1-SC         PIC 9(02).                     034510      
000849       05 WKS-FILLER4-SC           PIC X(13) VALUE                034512      
000850                                            " NO TRANS EN ".      034514      
000851       05 WKS-LEY-CSIR2-SC         PIC 9(02).                     034516      
000852       05 WKS-FILLER6-SC           PIC X(04) VALUE                034518      
000853                                            ". SC".               034520      
000854*FIN SCTA AHM**                                                   034522      
000855                                                                  034600      
000856 77 WKS-IMP-CARTRA                PIC 9(14)V99.                   034700      
000857 77 WKS-IMP-ABOTRA                PIC 9(14)V99.                   034800      
000858 77 WKS-IMP-CARREC                PIC 9(14)V99.                   034900      
000859 77 WKS-IMP-ABOREC                PIC 9(14)V99.                   035000      
000860 77 WKS-IMP-CAROK                 PIC 9(14)V99.                   035100      
000861 77 WKS-IMP-ABOOK                 PIC 9(14)V99.                   035200      
000862                                                                  035300      
000863 77 WKS-TOT-CARTRA                PIC 9(14)V99.                   035400      
000864 77 WKS-TOT-ABOTRA                PIC 9(14)V99.                   035500      
000865 77 WKS-TOT-CARREC                PIC 9(14)V99.                   035600      
000866 77 WKS-TOT-ABOREC                PIC 9(14)V99.                   035700      
000867 77 WKS-TOT-CAROK                 PIC 9(14)V99.                   035800      
000868 77 WKS-TOT-ABOOK                 PIC 9(14)V99.                   035900      
000869                                                                  036000      
000870 77 W77-MON-ANT                    PIC 9(04) COMP VALUE ZEROS.    036100      
000871*ASM 77 KEY-BCO-ANT                    PIC 9(18) COMP VALUE ZEROS.036200      
000872 77 W77-IND3                       PIC 9(06) VALUE 0.             036300      
000873 77 W77-AFC                        PIC 9(04) VALUE 0.             036400      
000874 77 W77-SISTEMA                    PIC 9(03).                     036500      
000875 77 W77-FECHA-PROCESO              PIC 9(08).                     036600      
000876 77 W77-ERROR-CAT                  PIC 9(01) VALUE 0.             036700      
000877 77 W77-IND                        PIC 9(04) VALUE 0.             036800      
000878 77 W77-I                          PIC 9(06) COMP VALUE ZEROS.    036900      
000879 77 W77-J                          PIC 9(06) COMP VALUE ZEROS.    037000      
000880 77 W77-K                          PIC 9(06) COMP VALUE ZEROS.    037100      
000881 77 W77-CON-SUC                    PIC 9(04) COMP VALUE ZEROS.    037200      
000882 77 W77-CONT-LIN                   PIC 9(04) COMP VALUE ZEROS.    037300      
000883 77 W77-CONT-HOJ                   PIC 9(04) COMP VALUE ZEROS.    037400      
000884 77 W77-FIN                        PIC 9(02) COMP VALUE ZEROS.    037500      
000885 77 W77-FINPRO                     PIC 9(02) COMP VALUE ZEROS.    037600      
000886 77 W77-FINTRA                     PIC 9(02) COMP VALUE ZEROS.    037700      
000887 77 W77-FINREC                     PIC 9(02) COMP VALUE ZEROS.    037800      
000888 77 W77-LEITRA                     PIC 9(08) COMP VALUE ZEROS.    037900      
000889 77 W77-LEIREC                     PIC 9(08) COMP VALUE ZEROS.    038000      
000890 77 W77-MOVSERR                    PIC 9(08) COMP VALUE ZEROS.    038100      
000891*===============================================*                 038200      
000892*  ARREGLO DE CLAVES DEL SISTEMA                *                 038300      
000893*===============================================*                 038400      
000894 01 WKS-CVE-SIS.                                                  038500      
000895    03 WKS-CVE-DATOS OCCURS 10000 TIMES.                          038600      
000896       05 WKS-CVE-CVE              PIC 9(04) COMP.                038700      
000897       05 WKS-CVE-AFC              PIC 9(02) COMP.                038800      
000898                                                                  038900      
000899 77  W77-L710-SISTEMA              PIC S9(11) BINARY.             039000      
000900 77  W77-L710-PROGRAMA             PIC S9(11) BINARY.             039100      
000901 01  WKS-L710-ENT.                                                039200      
000902     03 WKS-EL710-CAT              PIC 9(06) COMP.                039300      
000903     03 WKS-EL710-CLAVE            PIC 9(02) COMP.                039400      
000904     03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                039500      
000905     03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                039600      
000906     03 WKS-EL710-LLAVE1           PIC 9(12).                     039700      
000907     03 WKS-EL710-LLAVE2           PIC 9(12).                     039800      
000908     03 WKS-EL710-LLAVE3           PIC 9(12).                     039900      
000909     03 WKS-EL710-LLAVE4           PIC 9(12).                     040000      
000910     03 WKS-EL710-LLAVE5           PIC 9(12).                     040100      
000911     03 WKS-EL710-LLAVE6           PIC 9(12).                     040200      
000912     03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                040300      
000913     03 WKS-EL710-FECINI           PIC 9(06) COMP.                040400      
000914     03 WKS-EL710-NIVINI           PIC 9(02) COMP.                040500      
000915     03 FILLER                     PIC X(11).                     040600      
000916 01  WKS-L710-SAL.                                                040700      
000917     03 WKS-SL710-NUMREG           PIC 9(02) COMP.                040800      
000918     03 WKS-SL710-CAT              PIC 9(06) COMP.                040900      
000919     03 WKS-SL710-FECINI           PIC 9(06) COMP.                041000      
000920     03 WKS-SL710-NIVINI           PIC 9(02) COMP.                041100      
000921     03 FILLER                     PIC X(22).                     041200      
000922     03 WKS-SL710-REG.                                            041300      
000923        05 WKS-SL710-DAT           PIC 9(12) OCCURS 28 TIMES.     041400      
000924        05 WKS-SL710-FECALTA       PIC 9(06) COMP.                041500      
000925        05 WKS-SL710-FECBAJA       PIC 9(06) COMP.                041600      
000926        05 WKS-SL710-FECMOD        PIC 9(06) COMP.                041700      
000927        05 WKS-SL710-FECVIG        PIC 9(06) COMP.                041800      
000928        05 FILLER                  PIC X(500).                    041900      
000929 77  W77-L710-RESULT               PIC S9(11) BINARY.             042000      
000930 77  W77-CAT-NUMCAT                PIC 9(06).                     042100      
000931 77  W77-CAT-FORMATO               PIC 9(04).                     042200      
000932*===============================================                  042300      
000933*       PARAMETROS LIBRERIA CTLVERS            =                  042400      
000934*===============================================                  042500      
000935 01  WKS-LIBID                     PIC X(12).                     042600      
000936 01  WKS-NOMBLIB                   PIC X(72).                     042700      
000937 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             042800      
000938******************************************************************042900      
000939*    FECHA Y HORA DE PROCESO                                     *043000      
000940******************************************************************043100      
000941 01 WKS-FECH-MAQ.                                                 043200      
000942    03 WKS-FM-MM                           PIC 9(02).             043300      
000943    03 WKS-FM-DD                           PIC 9(02).             043400      
000944    03 WKS-FM-AA                           PIC 9(04).             043500      
000945                                                                  043600      
000946 01 WKS-FEC-AMD.                                                  043700      
000947    03 WKS-AMD-AA                          PIC 9(04).             043800      
000948    03 WKS-AMD-MM                          PIC 9(02).             043900      
000949    03 WKS-AMD-DD                          PIC 9(02).             044000      
000950                                                                  044100      
000951**** Inicia cambio Fabrica de software **** Abarbosa       P05-355044101      
000952*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000953* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         044110      
000954*                                      FROM 000100 TO 099999      044120      
000955                                                                  000100      
000956*----------------------------------------------------------------*000200      
000957*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
000958*----------------------------------------------------------------*000400      
000959 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
000960 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
000961 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
000962 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
000963 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
000964                                                                  001000      
000965 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
000966 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
000967     02 WS-WORD-ENT               PIC  9(012).                    001300      
000968     02 WS-WORD-RES               PIC  9(002).                    001400      
000969                                                                  001500      
000970*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000971**** Fin    cambio Fabrica de software **** Abarbosa       P05-355044121      
000972*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000973*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          044200      
000974**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000975  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000976  01 MENSAJE-LJ.                                                  100300      
000977     02 SISTEMA-LJ     PIC X(04).                                 100400      
000978     02 FILLER         PIC X VALUE "/".                           100500      
000979     02 PASO-LJ        PIC X(04).                                 100600      
000980     02 FILLER         PIC X VALUE "/".                           100700      
000981     02 MTP-LJ         PIC 9(03).                                 100800      
000982     02 FILLER         PIC X VALUE ":".                           100900      
000983     02 TIPO-LJ        PIC X.                                     101000      
000984     02 FILLER         PIC X VALUE ">".                           101100      
000985     02 CODIGO-LJ      PIC 9(06).                                 101200      
000986     02 FILLER         PIC X VALUE "<".                           101300      
000987     02 TEXTO-LJ       PIC X(250).                                101400      
000988*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000989/                                                                 044300      
000990 PROCEDURE        DIVISION.                                       044400      
000991 000-RAIZ.                                                        044500      
000992*---------                                                        044600      
000993     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   044700      
000994      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".            044800      
000995     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     044900      
000996     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      045000      
000997     MOVE "S080BD01CON"            TO WKS-LIBID.                  045100      
000998     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      045200      
000999                               GIVING W77-ERR-CTLVER.             045300      
001000     IF W77-ERR-CTLVER = 0                                        045400      
001001        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA"   TO WKS-NOMBLIB.  045500      
001002     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          045600      
001003             A2K-ACCEPT-TODAYS-DATE-EXIT.                         045700      
001004     MOVE A2K-FEC-MDCA-001 TO WKS-FECH-MAQ.                       045800      
001005                                                                  045900      
001006     MOVE "S151"  TO      SISTEMA-LJ                              046000      
001007     MOVE 151     TO      WKS-SIS-BACK2                           046100      
001008     MOVE "P113"  TO      PASO-LJ                                 046200      
001009                          WKS-PASO-BACK2                          046300      
001010                          WLI-RB-E1-PASO                          046400      
001011     MOVE "001"   TO      MTP-LJ                                  046500      
001012     PERFORM 1000-INICIO.                                         046600      
001013     PERFORM 2000-PROCESO UNTIL W77-FINPRO = 1.                   046700      
001014     PERFORM 9000-TERMINA.                                        046800      
001015     STOP RUN.                                                    046900      
001016*                                                                 047000      
001017 0100-FORMATO-DISPLAY.                                            047100      
001018*---------------------                                            047200      
001019*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001020* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".                   047300      
001021                                                                  000100      
001022*===============================================================* 000200      
001023*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
001024*         PARA LLAMADO DE DISPLAY                               * 000400      
001025*===============================================================* 000500      
001026                                                                  000600      
001027     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
001028            TO BYFUNCTION.                                        000671      
001029                                                                  000691      
001030     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
001031          USING WKS-DATE-ARRAY2.                                  000800      
001032     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
001033     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
001034     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
001035     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
001036     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
001037     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
001038                                                                  001300      
001039     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
001040     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
001041     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
001042                               WKS-TIT-REPORTE2.                  001700      
001043*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
001044*                                  GIVING WKS-COMPILA2.           001900      
001045*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
001046*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
001047*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
001048*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
001049                                                                  002066      
001050*    IF WKS-AAA-VERSION2  < 50                                    002071      
001051*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
001052*    ELSE                                                         002081      
001053*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
001054                                                                  002091      
001055                                                                  002500      
001056*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
001057     OPEN OUTPUT V00-REPORTE2.                                    002700      
001058     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
001059     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
001060                                                                  003000      
001061 000-050-CHECA-SALTO-HOJA2.                                       003051      
001062*==========================                                       003071      
001063    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
001064     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
001065        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
001066     ELSE                                                         003079      
001067        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
001068     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
001069     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
001070     MOVE "/"                     TO WKS-SLASH1.                  003086      
001071     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
001072     MOVE "/"                     TO WKS-SLASH2.                  003088      
001073     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
001074     IF  WKS-NUM-LINEAS2 > 56                                     003091      
001075         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
001076         ADD 1                   TO    W77-CONT-HOJA2             003200      
001077         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
001078         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
001079         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
001080         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
001081         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
001082         MOVE SPACES             TO V00-R00-REPORTE2              003800      
001083         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
001084         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
001085                                                                  004100      
001086 000-030-IMPRIME-MENSAJE.                                         004200      
001087*========================                                         004300      
001088*LP                                                               004400      
001089     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
001090     ADD             2       TO WKS-NUM-LINEAS2                   004600      
001091     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
001092                                                                  004800      
001093*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001094*                                                                 047400      
001095 0500-CARGA-CATALOGOS.                                            047500      
001096*---------------------                                            047600      
001097     MOVE ZEROS                            TO W77-ERROR-CAT.      047700      
001098     MOVE WKS-FM-MM                        TO WKS-AMD-MM          047800      
001099     MOVE WKS-FM-AA                        TO WKS-AMD-AA          047900      
001100     MOVE WKS-FM-DD                        TO WKS-AMD-DD          048000      
001101     MOVE ZERO                             TO W77-EOF             048100      
001102                                              W77-IND.            048200      
001103     MOVE 151                              TO W77-L710-SISTEMA.   048300      
001104     MOVE 30                               TO W77-L710-PROGRAMA.  048400      
001105     MOVE 523                              TO WKS-EL710-CAT.      048500      
001106     MOVE 20                               TO WKS-EL710-CLAVE.    048600      
001107     MOVE 2                                TO WKS-EL710-BUSQUEDA. 048700      
001108     MOVE 1                                TO WKS-EL710-REGISTROS 048800      
001109     MOVE W77-SISTEMA            TO WKS-EL710-LLAVE1.             048900      
001110     MOVE 1                                TO WKS-EL710-LLAVE2.   049000      
001111     MOVE ZERO                             TO WKS-EL710-LLAVE3    049100      
001112                                              WKS-EL710-LLAVE4    049200      
001113                                              WKS-EL710-LLAVE5    049300      
001114                                              WKS-EL710-LLAVE6    049400      
001115                                              WKS-EL710-FECINI    049500      
001116                                              WKS-EL710-NIVINI    049600      
001117                                              WKS-EL710-FEC-VIG.  049700      
001118     PERFORM 0510-CARGA-CATDECAT.                                 049800      
001119     MOVE W77-CAT-NUMCAT           TO WKS-EL710-CAT.              049900      
001120     IF W77-CAT-FORMATO = 2                                       050000      
001121        MOVE 1                     TO WKS-EL710-BUSQUEDA          050100      
001122        MOVE W77-SISTEMA TO WKS-EL710-LLAVE1                      050200      
001123        MOVE 0                     TO WKS-EL710-LLAVE2            050300      
001124     ELSE                                                         050400      
001125     IF W77-CAT-FORMATO = 1                                       050500      
001126        MOVE 2                     TO WKS-EL710-BUSQUEDA          050600      
001127        MOVE W77-SISTEMA TO WKS-EL710-LLAVE2                      050700      
001128        MOVE 0                     TO WKS-EL710-LLAVE1            050800      
001129     ELSE                                                         050900      
001130        MOVE SPACES                TO WLI-ENCAB-52, TEXTO-LJ      051000      
001131        MOVE W77-L710-RESULT       TO W77-CAT-FORMATO             051100      
001132        MOVE "O"                   TO TIPO-LJ                     051200      
001133        MOVE 020201                TO CODIGO-LJ                   051300      
001134        STRING "NUMERO DE FORMATO NO VALIDO EN CAT. 523 SISTEMA S"051400      
001135           W77-SISTEMA " FORMATO " W77-CAT-FORMATO                051500      
001136        DELIMITED BY SIZE                                         051600      
001137        INTO TEXTO-LJ                                             051700      
001138        MOVE TIPO-LJ               TO WLI-TIPO-LJ                 051800      
001139        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                051900      
001140        PERFORM  000-030-IMPRIME-MENSAJE                          052000      
001141        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       052100      
001142        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  052200      
001143                                                                  052300      
001144     MOVE 151                             TO W77-L710-SISTEMA     052400      
001145     MOVE 30                              TO W77-L710-PROGRAMA    052500      
001146     MOVE 20                              TO WKS-EL710-CLAVE      052600      
001147     MOVE 1                               TO WKS-EL710-REGISTROS  052700      
001148     MOVE 0                               TO WKS-EL710-LLAVE3     052800      
001149                                             WKS-EL710-LLAVE4     052900      
001150                                             WKS-EL710-LLAVE5     053000      
001151                                             WKS-EL710-LLAVE6     053100      
001152     MOVE 0                               TO WKS-EL710-FEC-VIG    053200      
001153     MOVE 0                               TO WKS-EL710-FECINI     053300      
001154     MOVE 0                               TO WKS-EL710-NIVINI     053400      
001155     MOVE 0                               TO W77-EOF.             053500      
001156                                                                  053600      
001157     PERFORM 0520-CARGA-PARAMETROS UNTIL W77-EOF > 0.             053700      
001158*                                                                 053800      
001159 0510-CARGA-CATDECAT.                                             053900      
001160*====================                                             054000      
001161     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     054100      
001162          USING  W77-L710-SISTEMA                                 054200      
001163                 W77-L710-PROGRAMA                                054300      
001164                 WKS-L710-ENT                                     054400      
001165                 WKS-L710-SAL                                     054500      
001166          GIVING W77-L710-RESULT.                                 054600      
001167     IF W77-L710-RESULT < 2                                       054700      
001168        MOVE WKS-SL710-DAT(4)      TO W77-CAT-NUMCAT              054800      
001169        MOVE WKS-SL710-DAT(5)      TO W77-CAT-FORMATO             054900      
001170     ELSE                                                         055000      
001171        MOVE SPACES                TO WLI-ENCAB-52, TEXTO-LJ      055100      
001172        MOVE W77-L710-RESULT       TO W77-CAT-NUMCAT              055200      
001173        MOVE "O"                   TO TIPO-LJ                     055300      
001174        MOVE 020201                TO CODIGO-LJ                   055400      
001175        STRING "ERROR EN CATALOGO DE CATALOGOS SISTEMA S"         055500      
001176           W77-SISTEMA " ERROR " W77-CAT-NUMCAT                   055600      
001177        DELIMITED BY SIZE                                         055700      
001178        INTO TEXTO-LJ                                             055800      
001179        MOVE TIPO-LJ               TO WLI-TIPO-LJ                 055900      
001180        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                056000      
001181        PERFORM  000-030-IMPRIME-MENSAJE                          056100      
001182        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       056200      
001183        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  056300      
001184*                                                                 056400      
001185 0520-CARGA-PARAMETROS.                                           056500      
001186*------------------------                                         056600      
001187     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     056700      
001188           USING  W77-L710-SISTEMA                                056800      
001189                  W77-L710-PROGRAMA                               056900      
001190                  WKS-L710-ENT                                    057000      
001191                  WKS-L710-SAL                                    057100      
001192           GIVING W77-L710-RESULT                                 057200      
001193                                                                  057300      
001194     IF W77-L710-RESULT = 0 OR = 1                                057400      
001195        MOVE WKS-SL710-DAT(1)      TO WKS-EL710-LLAVE1            057500      
001196        MOVE WKS-SL710-DAT(2)      TO WKS-EL710-LLAVE2            057600      
001197        MOVE WKS-SL710-DAT(3)      TO WKS-EL710-LLAVE3            057700      
001198        MOVE WKS-SL710-DAT(4)      TO WKS-EL710-LLAVE4            057800      
001199        MOVE WKS-SL710-DAT(5)      TO WKS-EL710-LLAVE5            057900      
001200        MOVE WKS-SL710-DAT(6)      TO WKS-EL710-LLAVE6            058000      
001201        PERFORM 0530-MUEVE-CLAVE                                  058100      
001202        MOVE WKS-SL710-NIVINI      TO WKS-EL710-NIVINI            058200      
001203        MOVE WKS-SL710-FECINI      TO WKS-EL710-FECINI            058300      
001204        IF W77-IND < 9999                                         058400      
001205           MOVE WKS-SL710-DAT(1)          TO                      058500      
001206                                      WKS-CVE-CVE(W77-IND)        058600      
001207           MOVE WKS-SL710-DAT(15)         TO                      058700      
001208                                      WKS-CVE-AFC(W77-IND)        058800      
001209        ELSE                                                      058900      
001210           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       059000      
001211           MOVE "I"                       TO TIPO-LJ              059100      
001212           MOVE 020601                    TO CODIGO-LJ            059200      
001213           MOVE "CVE.TRANSACCION > 9999 " TO TEXTO-LJ             059300      
001214           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                059400      
001215           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               059500      
001216           PERFORM  000-030-IMPRIME-MENSAJE                       059600      
001217     ELSE                                                         059700      
001218        MOVE 1                            TO W77-EOF              059800      
001219        MOVE W77-L710-RESULT              TO W77-IND3             059900      
001220        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          060000      
001221        MOVE "O"                          TO TIPO-LJ              060100      
001222        MOVE 020901                       TO CODIGO-LJ            060200      
001223        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  060300      
001224                W77-IND3                                          060400      
001225                DELIMITED BY SIZE                                 060500      
001226                INTO TEXTO-LJ                                     060600      
001227        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   060700      
001228        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  060800      
001229        PERFORM  000-030-IMPRIME-MENSAJE                          060900      
001230        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      061000      
001231                                                                  061100      
001232     IF W77-L710-RESULT = 0                                       061200      
001233        MOVE 1                            TO W77-EOF.             061300      
001234*                                                                 061400      
001235 0530-MUEVE-CLAVE.                                                061500      
001236*====================                                             061600      
001237     IF W77-CAT-FORMATO = 2                                       061700      
001238        MOVE WKS-SL710-DAT(2)      TO W77-IND                     061800      
001239     ELSE                                                         061900      
001240        MOVE WKS-SL710-DAT(1)      TO W77-IND.                    062000      
001241*                                                                 062100      
001242 1000-INICIO.                                                     062200      
001243*------------                                                     062300      
001244*mgv CALL "COMPILETIME-15         IN      COBOL74"                062400      
001245*mgv                              GIVING  COMPILA                 062500      
001246*mgv MOVE ZEROS TO A2K-FEC-MDA-001                                062600      
001247*mgv MOVE COMPILA TO A2K-FEC-MDA-001                              062700      
001248*mgv PERFORM A2K-CONV-MDA-TO-MDCA THRU                            062800      
001249*mgv         A2K-CONV-MDA-TO-MDCA-EXIT                            062900      
001250*mgv MOVE A2K-FEC-MDCA-001 TO WS-VERSION                          063000      
001251*mgv MOVE WS-DIA-VERSION          TO      VERS-DD                 063100      
001252*mgv MOVE WS-MES-VERSION          TO      VERS-MM                 063200      
001253*mgv MOVE WS-AAA-VERSION          TO      VERS-AA.                063300      
001254                                                                  063400      
001255     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   063500      
001256     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            063600      
001257                                      "SOPORTECOMS".              063700      
001258     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            063800      
001259     MOVE WKS-NUMCSI      TO      WKS-CSI-IMP                     063900      
001260                                  WKS-TR-CSI2.                    064000      
001261                                                                  064100      
001262     PERFORM 0100-FORMATO-DISPLAY.                                064200      
001263     MOVE SPACES                    TO WLI-ENCAB-52, WLI-TEXTO-LJ 064300      
001264     MOVE "I"                       TO WLI-TIPO-LJ                064400      
001265                                       TIPO-LJ                    064500      
001266     MOVE 020101                    TO CODIGO-LJ                  064600      
001267     MOVE "INICIO DE PROCESO "      TO WLI-TEXTO-LJ               064700      
001268                                       TEXTO-LJ                   064800      
001269     PERFORM      000-030-IMPRIME-MENSAJE.                        064900      
001270     OPEN INPUT A01-CONTROL.                                      065000      
001271     READ A01-CONTROL INTO WKS-REG-HD-CONTROL.                    065100      
001272     MOVE WKS-HD-CSI              TO W77-CSI.                     065200      
001273     MOVE WKS-HD-FECPRO           TO W77-FECHA-PROCESO            065300      
001274                                     WKS-FECHA-BACKUP             065400      
001275                                     FECH-COM1                    065500      
001276                                     WKS-FECHA-TRA                065600      
001277                                     WKS-FECHA-REC                065700      
001278                                     WKS-FEC-AMD.                 065800      
001279     PERFORM 1010-LEE-CONTROL VARYING W77-I                       065900      
001280                          FROM 1 BY 1 UNTIL W77-FIN = 1.          066000      
001281*ASM PERFORM 1020-INICIALIZA-TOT-BCO.                             066050      
001282     MOVE 0                               TO W77-I.               066100      
001283                                                                  066200      
001284     SET V01-REPORTE(USERBACKUPNAME)      TO VALUE TRUE           066300      
001285     MOVE ATTRIBUTE STACKNO OF MYSELF     TO WKS-MIX-BACKUP       066400      
001286     CHANGE ATTRIBUTE TITLE OF V01-REPORTE                        066500      
001287                                          TO WKS-TIT-REPORTE      066600      
001288     OPEN OUTPUT V01-REPORTE.                                     066700      
001289                                                                  066800      
001290*                                                                 066900      
001291 1010-LEE-CONTROL.                                                067000      
001292*-----------------                                                067100      
001293                                                                  067200      
001294     READ A01-CONTROL INTO WKS-REG-DET-CONTROL                    067300      
001295                          AT END MOVE 1 TO W77-FIN.               067400      
001296     IF W77-FIN NOT = 1                                           067500      
001297          IF WKS-DET-INDPF = 1                                    067600      
001298             MOVE WKS-DET-SIST    TO WKS-TAB-SIST(W77-I)          067700      
001299             MOVE WKS-DET-FECPRO  TO WKS-TAB-FECPRO(W77-I).       067800      
001300          IF WKS-DET-SIST = 999                                   067900      
001301             MOVE 1               TO W77-FIN.                     068000      
001302*                                                                 068100      
001303*1020-INICIALIZA-TOT-BCO.                                         068104      
001304*------------------------                                         068106      
001305*ASM CHANGE ATTRIBUTE NORECOVERY OF A01-TOTBCO TO  1.             068110      
001306*ASM CHANGE ATTRIBUTE FILEORGANIZATION OF A01-TOTBCO TO           068112      
001307*ASM        VALUE(KEYEDIOII).                                     068114      
001308*ASM MOVE 0       TO      W77-EOF.                                068116      
001309*ASM                                                              068118      
001310*ASM IF ATTRIBUTE RESIDENT OF A01-TOTBCO = VALUE TRUE             068120      
001311*ASM    OPEN I-O A01-TOTBCO                                       068122      
001312*ASM    CLOSE A01-TOTBCO WITH SAVE                                068126      
001313*ASM    OPEN I-O A01-TOTBCO                                       068128      
001314*ASM ELSE                                                         068130      
001315*ASM    OPEN OUTPUT A01-TOTBCO                                    068132      
001316*ASM    CLOSE A01-TOTBCO WITH SAVE                                068134      
001317*ASM    OPEN I-O A01-TOTBCO.                                      068136      
001318                                                                  068138      
001319*1030-LIMPIA-IMPORTES.                                            068140      
001320*---------------------                                            068142      
001321*ASM READ A01-TOTBCO NEXT RECORD AT END MOVE 1 TO W77-EOF.        068144      
001322*ASM PERFORM 1040-LIMPIA-TOTALES UNTIL W77-EOF = 1.               068148      
001323                                                                  068150      
001324*1040-LIMPIA-TOTALES.                                             068152      
001325*--------------------                                             068154      
001326*ASM MOVE ZEROS   TO             TOT-CGO-OK,  TOT-ABO-OK,         068156      
001327*ASM                             TOT-CGO-TRA, TOT-ABO-TRA,        068158      
001328*ASM                             TOT-CGO-REC, TOT-ABO-REC.        068160      
001329*ASM                                                              068162      
001330*ASM REWRITE REG-TB INVALID KEY                                   068164      
001331*ASM         MOVE "E"     TO      TIPO-LJ                         068166      
001332*ASM         MOVE 020202  TO      CODIGO-LJ                       068168      
001333*ASM         MOVE "ERROR EN WRITE TOTBCO  AL LIMPIAR TOTALES"     068170      
001334*ASM                      TO      TEXTO-LJ                        068172      
001335*ASM         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  068174      
001336*ASM         SET MYSELF(STATUS) TO -1.                            068176      
001337*ASM                                                              068178      
001338*ASM READ A01-TOTBCO NEXT RECORD AT END MOVE 1 TO W77-EOF.        068180      
001339                                                                  068182      
001340 2000-PROCESO.                                                    068200      
001341*-------------                                                    068300      
001342     PERFORM 2100-RECORRE-SISTEMAS                                068400      
001343             VARYING W77-J FROM 1 BY 1 UNTIL W77-J > 10.          068500      
001344                                                                  068600      
001345     MOVE 1                       TO W77-FINPRO.                  068700      
001346*                                                                 068800      
001347 2100-RECORRE-SISTEMAS.                                           068900      
001348*----------------------                                           069000      
001349     IF  WKS-TAB-SIST(W77-J) > 0                                  069100      
001350         MOVE WKS-TAB-SIST(W77-J) TO W77-SISTEMA                  069200      
001351                                     WKS-SIS-TRA                  069300      
001352                                     WKS-SIS-REC                  069400      
001353*ASM                                 KEY-SIST                     069500      
001354                                     NOM-REP-SIST                 069600      
001355         PERFORM 0500-CARGA-CATALOGOS                             069700      
001356         MOVE 04                  TO W77-CSI-TRA                  069800      
001357         MOVE 10                  TO W77-CSI-REC                  069900      
001358         PERFORM 2105-INICIALIZA-VARIABLES                        070000      
001359*ASM     PERFORM 1020-INICIALIZA-TOT-BCO                          070050      
001360         PERFORM 2200-SORTEA-ABRE-ARCHIVOS                        070100      
001361         PERFORM 4000-GENERA-REPORTE UNTIL W77-FIN = 1            070200      
001362         MOVE 10                  TO W77-CSI-TRA                  070300      
001363         MOVE 04                  TO W77-CSI-REC                  070400      
001364         PERFORM 2105-INICIALIZA-VARIABLES                        070500      
001365*ASM     PERFORM 1020-INICIALIZA-TOT-BCO                          070550      
001366         PERFORM 2200-SORTEA-ABRE-ARCHIVOS                        070600      
001367         PERFORM 4000-GENERA-REPORTE UNTIL W77-FIN = 1.           070700      
001368*                                                                 070800      
001369 2105-INICIALIZA-VARIABLES.                                       070900      
001370*--------------------------                                       071000      
001371     MOVE 0                       TO W77-FIN                      071100      
001372                                     W77-FINTRA                   071200      
001373                                     W77-FINREC                   071300      
001374                                     W77-LEITRA                   071400      
001375                                     W77-LEIREC.                  071500      
001376     MOVE W77-CSI-TRA             TO WKS-TRCSI-TRA                071600      
001377                                     WKS-RCCSI-TRA                071700      
001378*ASM                                 KEY-CSI-ORI                  071800      
001379                                     NOM-REP-CSITRA.              071900      
001380     MOVE W77-CSI-REC             TO WKS-TRCSI-REC                072000      
001381                                     WKS-RCCSI-REC                072100      
001382*ASM                                 KEY-CSI-DES                  072200      
001383                                     NOM-REP-CSIREC.              072300      
001384*                                                                 072400      
001385 2200-SORTEA-ABRE-ARCHIVOS.                                       072500      
001386*--------------------------                                       072600      
001387     PERFORM 2300-ORDENA-ARCHIVOS.                                072700      
001388     OPEN INPUT A01-MOVTRA A01-MOVREC.                            072800      
001389     PERFORM 2400-VALIDA-HEADERS.                                 072900      
001390     PERFORM 5000-LEE-MOVTRA.                                     073000      
001391     PERFORM 6000-LEE-MOVREC.                                     073100      
001392     PERFORM 7000-IMPRIME-TITULOS.                                073150      
001393     IF W77-FINTRA NOT = 1                                        073200      
001394        MOVE A00-F01-MONEDA OF A01-MOVTRA  TO W77-MON-ANT         073300      
001395*ASM    MOVE W77-SISTEMA                   TO KEY-SIST            073400      
001396*ASM    MOVE W77-CSI-TRA                   TO KEY-CSI-ORI         073500      
001397*ASM    MOVE W77-CSI-REC                   TO KEY-CSI-DES         073600      
001398*ASM    PERFORM 2210-MUEVE-KEY-TRA                                073700      
001399*ASM    MOVE KEY-BCO                       TO KEY-BCO-ANT         073800      
001400     ELSE                                                         073900      
001401     IF W77-FINREC NOT = 1                                        074000      
001402        MOVE A00-F01-MONEDA OF A01-MOVREC  TO W77-MON-ANT         074100      
001403*ASM    MOVE W77-SISTEMA                   TO KEY-SIST            074200      
001404*ASM    MOVE W77-CSI-TRA                   TO KEY-CSI-ORI         074300      
001405*ASM    MOVE W77-CSI-REC                   TO KEY-CSI-DES         074400      
001406*ASM    PERFORM 2220-MUEVE-KEY-REC                                074500      
001407*ASM    MOVE KEY-BCO                       TO KEY-BCO-ANT         074600      
001408     ELSE                                                         074700      
001409        MOVE ZEROS                         TO W77-MON-ANT         074800      
001410                                              KEY-BCO-ANT.        074900      
001411     IF W77-FINTRA = 1 AND W77-FINREC = 1                         075000      
001412        MOVE SPACES                 TO WLI-ENCAB-52, WLI-TEXTO-LJ 075100      
001413        MOVE "I"                    TO WLI-TIPO-LJ                075200      
001414                                       TIPO-LJ                    075300      
001415        MOVE 020101                 TO CODIGO-LJ                  075400      
001416        MOVE "NO EXISTEN MOVIMIENTOS A PROCESAR"                  075500      
001417                                    TO WLI-TEXTO-LJ               075600      
001418                                       TEXTO-LJ                   075700      
001419        PERFORM      000-030-IMPRIME-MENSAJE                      075800      
001420        MOVE 1                     TO W77-FIN                     075900      
001421        PERFORM 9020-CORTE-MONEDA                                 075910      
001422        CLOSE A01-MOVTRA WITH RELEASE                             075920      
001423        CLOSE A01-MOVREC WITH RELEASE                             075940      
001424     ELSE                                                         076000      
001425     IF W77-FINTRA = 1                                            076100      
001426        MOVE SPACES                 TO WLI-ENCAB-52, WLI-TEXTO-LJ 076200      
001427        MOVE "I"                    TO WLI-TIPO-LJ                076300      
001428                                       TIPO-LJ                    076400      
001429        MOVE 020101                 TO CODIGO-LJ                  076500      
001430        MOVE "NO EXISTEN MOVTOS FORANEOS TRANSMITIDOS"            076600      
001431                                    TO WLI-TEXTO-LJ               076700      
001432                                       TEXTO-LJ                   076800      
001433        PERFORM      000-030-IMPRIME-MENSAJE                      076900      
001434        MOVE ZEROS        TO A00-F01-KEY  OF A01-MOVTRA           077000      
001435        MOVE 99           TO A00-F01-TIPO OF A01-MOVTRA           077100      
001436     ELSE                                                         077200      
001437     IF W77-FINREC = 1                                            077300      
001438        MOVE SPACES                 TO WLI-ENCAB-52, WLI-TEXTO-LJ 077400      
001439        MOVE "I"                    TO WLI-TIPO-LJ                077500      
001440                                       TIPO-LJ                    077600      
001441        MOVE 020101                 TO CODIGO-LJ                  077700      
001442        MOVE "NO EXISTEN MOVTOS FORANEOS RECIBIDOS"               077800      
001443                                    TO WLI-TEXTO-LJ               077900      
001444                                       TEXTO-LJ                   078000      
001445        PERFORM      000-030-IMPRIME-MENSAJE                      078100      
001446        MOVE ZEROS        TO A00-F01-KEY  OF A01-MOVREC           078200      
001447        MOVE 99           TO A00-F01-TIPO OF A01-MOVREC.          078300      
001448*ASM PERFORM 7000-IMPRIME-TITULOS.                                078400      
001449*                                                                 078500      
001450 2210-MUEVE-KEY-TRA.                                              078600      
001451*-------------------                                              078700      
001452*ASM    MOVE A00-F01-MONEDA  OF A01-MOVTRA TO KEY-MON.            078800      
001453*ASM    MOVE A00-F01-BCO-ORI OF A01-MOVTRA TO KEY-BCO-ORI.        078900      
001454*ASM    MOVE A00-F01-BCO-DES OF A01-MOVTRA TO KEY-BCO-DES.        079000      
001455*                                                                 079100      
001456 2220-MUEVE-KEY-REC.                                              079200      
001457*-------------------                                              079300      
001458*ASM    MOVE A00-F01-MONEDA  OF A01-MOVREC TO KEY-MON.            079400      
001459*ASM    MOVE A00-F01-BCO-ORI OF A01-MOVREC TO KEY-BCO-ORI.        079500      
001460*ASM    MOVE A00-F01-BCO-DES OF A01-MOVREC TO KEY-BCO-DES.        079600      
001461*                                                                 079700      
001462 2300-ORDENA-ARCHIVOS.                                            079800      
001463*---------------------                                            079900      
001464**** Inicia cambio Fabrica de software **** Abarbosa       P05-355079901      
001465     OPEN    INPUT                A01-MOVTRA                      079905      
001466     COMPUTE W77-FRAMESIZE        =                               079910      
001467            (ATTRIBUTE FRAMESIZE  OF A01-MOVTRA)                  079915      
001468     COMPUTE W77-MAXRECSIZE       =                               079920      
001469            (ATTRIBUTE MAXRECSIZE OF A01-MOVTRA)                  079925      
001470     COMPUTE W77-LASTRECORD       =                               079930      
001471            (ATTRIBUTE LASTRECORD OF A01-MOVTRA                   079935      
001472                                  +   1)                          079940      
001473     CLOSE   A01-MOVTRA           WITH RELEASE                    079945      
001474     PERFORM                      70000-CALCULA-ESPACIO           079950      
001475**** Fin    cambio Fabrica de software **** Abarbosa       P05-355079955      
001476     SORT A01-SMOVTRA ON ASCENDING KEY                            080000      
001477            A00-F01-KEY           OF A01-SMOVTRA                  080100      
001478**** Inicia cambio Fabrica de software **** Abarbosa       P05-355080101      
001479          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    080200      
001480          DISK   SIZE IS W77-DISK-SIZE   WORDS                    080300      
001481**** Fin    cambio Fabrica de software **** Abarbosa       P05-355080301      
001482          USING  A01-MOVTRA                                       080400      
001483          GIVING A01-MOVTRA.                                      080500      
001484                                                                  080600      
001485**** Inicia cambio Fabrica de software **** Abarbosa       P05-355080601      
001486     OPEN    INPUT                A01-MOVREC                      080605      
001487     COMPUTE W77-FRAMESIZE        =                               080610      
001488            (ATTRIBUTE FRAMESIZE  OF A01-MOVREC)                  080615      
001489     COMPUTE W77-MAXRECSIZE       =                               080620      
001490            (ATTRIBUTE MAXRECSIZE OF A01-MOVREC)                  080625      
001491     COMPUTE W77-LASTRECORD       =                               080630      
001492            (ATTRIBUTE LASTRECORD OF A01-MOVREC                   080635      
001493                                  +   1)                          080640      
001494     CLOSE   A01-MOVREC           WITH RELEASE                    080645      
001495     PERFORM                      70000-CALCULA-ESPACIO           080650      
001496**** Fin    cambio Fabrica de software **** Abarbosa       P05-355080655      
001497     SORT A01-SMOVREC ON ASCENDING KEY                            080700      
001498            A00-F01-KEY           OF A01-SMOVREC                  080800      
001499**** Inicia cambio Fabrica de software **** Abarbosa       P05-355080801      
001500          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    080900      
001501          DISK   SIZE IS W77-DISK-SIZE   WORDS                    081000      
001502**** Fin    cambio Fabrica de software **** Abarbosa       P05-355081001      
001503          USING  A01-MOVREC                                       081100      
001504          GIVING A01-MOVREC.                                      081200      
001505*                                                                 081300      
001506 2400-VALIDA-HEADERS.                                             081400      
001507*--------------------                                             081500      
001508     READ A01-MOVTRA INTO A00-F00-HDR-FOR OF A01-MOVTRA           081600      
001509                  AT END MOVE 1 TO W77-FINTRA.                    081700      
001510     IF W77-FINTRA NOT = 1                                        081800      
001511        IF A00-F00-HDR-FCH OF A01-MOVTRA = W77-FECHA-PROCESO      081900      
001512           NEXT SENTENCE                                          082000      
001513        ELSE                                                      082100      
001514           MOVE SPACES            TO WLI-ENCAB-52, TEXTO-LJ       082200      
001515           MOVE "E"               TO TIPO-LJ                      082300      
001516           MOVE 010105            TO CODIGO-LJ                    082400      
001517           STRING "FECHA DE PROCESO DIF. A FECHA HEADER ",        082500      
001518                  "ARCHIVO : ", WKS-NOM-MOVTRA                    082600      
001519           DELIMITED BY SIZE INTO TEXTO-LJ                        082700      
001520           MOVE TIPO-LJ           TO WLI-TIPO-LJ                  082800      
001521           MOVE TEXTO-LJ          TO WLI-TEXTO-LJ                 082900      
001522           PERFORM 000-030-IMPRIME-MENSAJE                        083000      
001523           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    083100      
001524           SET MYSELF(STATUS)     TO -1.                          083200      
001525     READ A01-MOVREC INTO A00-F00-HDR-FOR OF A01-MOVREC           083300      
001526                  AT END MOVE 1 TO W77-FINREC.                    083400      
001527     IF W77-FINREC NOT = 1                                        083500      
001528        IF A00-F00-HDR-FCH OF A01-MOVREC = W77-FECHA-PROCESO      083600      
001529           NEXT SENTENCE                                          083700      
001530        ELSE                                                      083800      
001531           MOVE SPACES            TO WLI-ENCAB-52, TEXTO-LJ       083900      
001532           MOVE "E"               TO TIPO-LJ                      084000      
001533           MOVE 010105            TO CODIGO-LJ                    084100      
001534           STRING "FECHA DE PROCESO DIF. A FECHA HEADER ",        084200      
001535                  "ARCHIVO : ", WKS-NOM-MOVREC                    084300      
001536           DELIMITED BY SIZE INTO TEXTO-LJ                        084400      
001537           MOVE TIPO-LJ           TO WLI-TIPO-LJ                  084500      
001538           MOVE TEXTO-LJ          TO WLI-TEXTO-LJ                 084600      
001539           PERFORM 000-030-IMPRIME-MENSAJE                        084700      
001540           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    084800      
001541           SET MYSELF(STATUS)     TO -1.                          084900      
001542*                                                                 085000      
001543 4000-GENERA-REPORTE.                                             085100      
001544*--------------------                                             085200      
001545     IF A00-F01-KEY       OF A01-MOVTRA =                         085500      
001546        A00-F01-KEY       OF A01-MOVREC                           085600      
001547        ADD 1                      TO W77-MOVS-OK                 085700      
001548        PERFORM 4030-ADD-OK                                       085800      
001549        PERFORM 5000-LEE-MOVTRA                                   085900      
001550        PERFORM 6000-LEE-MOVREC                                   086000      
001551     ELSE                                                         086200      
001552        IF A00-F01-KEY       OF A01-MOVTRA >                      086300      
001553           A00-F01-KEY       OF A01-MOVREC                        086400      
001554           PERFORM 4010-SUCREC-ERROR                              086500      
001555           PERFORM 6000-LEE-MOVREC                                086600      
001556        ELSE                                                      086800      
001557           PERFORM 4020-SUCTRA-ERROR                              086900      
001558           PERFORM 5000-LEE-MOVTRA.                               087000      
001559     IF W77-FINTRA = 1 AND W77-FINREC = 1                         087200      
001560        PERFORM 9020-CORTE-MONEDA                                 087300      
001561        MOVE 1                    TO W77-FIN                      087400      
001562        CLOSE A01-MOVTRA WITH RELEASE                             087500      
001563        CLOSE A01-MOVREC WITH RELEASE.                            087600      
001564*                                                                 087700      
001565 4010-SUCREC-ERROR.                                               087800      
001566*------------------                                               087900      
001567     IF W77-MON-ANT NOT = A00-F01-MONEDA OF A01-MOVREC            088000      
001568        ADD 1                      TO W77-CON-SUC                 088100      
001569        PERFORM 9020-CORTE-MONEDA.                                088200      
001570     MOVE WKS-CVE-AFC(A00-F01-CVETRAN1 OF A01-MOVREC) TO W77-AFC. 088300      
001571     IF A00-F01-IMPORTE1 OF A01-MOVREC > ZEROS                    088400      
001572        IF W77-AFC = 1                                            088500      
001573           ADD A00-F01-IMPORTE1 OF A01-MOVREC TO                  088600      
001574                                              WKS-IMP-ABOREC      088700      
001575                                              WKS-TOT-ABOREC      088800      
001576        ELSE                                                      088900      
001577        IF W77-AFC = 2                                            089000      
001578           ADD A00-F01-IMPORTE1 OF A01-MOVREC TO                  089100      
001579                                              WKS-IMP-CARREC      089200      
001580                                              WKS-TOT-CARREC.     089300      
001581                                                                  089400      
001582     MOVE A00-F01-SUCPROM     OF A01-MOVREC TO WRS-D1-SUCPROM     089500      
001583     MOVE A00-F01-CONTRATO    OF A01-MOVREC TO WRS-D1-CONTRATO    089600      
001584     MOVE A00-F01-PRODUCTO    OF A01-MOVREC TO WRS-D1-PRODUCTO    089700      
001585     MOVE A00-F01-INSTRUMENTO OF A01-MOVREC TO WRS-D1-INSTRUMENTO 089800      
001586     MOVE A00-F01-CVETRAN1    OF A01-MOVREC TO WRS-D1-CVETRAN1    089900      
001587     MOVE A00-F01-IMPORTE1    OF A01-MOVREC TO WRS-D1-IMPORTE1    090000      
001588     MOVE A00-F01-AUTORIZA    OF A01-MOVREC TO WRS-D1-AUTORIZA    090100      
001589     MOVE A00-F01-AUT-S151    OF A01-MOVREC TO WRS-D1-AUTS151     090200      
001590     MOVE A00-F01-BCO-ORI     OF A01-MOVREC TO WSR-D1-BCO-ORI     090300      
001591     MOVE A00-F01-BCO-DES     OF A01-MOVREC TO WSR-D1-BCO-DES     090400      
001592     MOVE A00-F01-SUC-ADI     OF A01-MOVREC TO WRS-D1-SUCINI      090500      
001593     MOVE A00-F01-CAJA-ADI    OF A01-MOVREC TO WRS-D1-CAJA-INIC   090600      
001594     MOVE W77-CSI-REC                     TO WKS-LEY-CSIR1        090700      
001595                                             WKS-LEY-CSIR1-SC     090750      
001596     MOVE W77-CSI-TRA                     TO WKS-LEY-CSIR2        090800      
001597                                             WKS-LEY-CSIR2-SC     090805      
001598     IF W77-SISTEMA = 500 AND                                     090810      
001599             (A00-F01-INDSUBCTA OF A01-MOVREC = 1)                090812      
001600        MOVE WKS-LEYENDA-REC-SC             TO WRS-D1-LEY         090815      
001601     ELSE                                                         090820      
001602        MOVE WKS-LEYENDA-REC                TO WRS-D1-LEY.        090900      
001603     ADD 1                                 TO W77-CONT-LIN        091000      
001604     IF W77-CONT-LIN > 55                                         091100      
001605         PERFORM 7000-IMPRIME-TITULOS.                            091200      
001606     WRITE REG-REP FROM WRS-D1.                                   091300      
001607     ADD 1                                 TO W77-MOVSERR.        091400      
001608     MOVE A00-F01-MONEDA OF A01-MOVREC     TO W77-MON-ANT.        091500      
001609*ASM MOVE KEY-BCO                          TO KEY-BCO-ANT.        091600      
001610*                                                                 091700      
001611 4020-SUCTRA-ERROR.                                               091800      
001612*------------------                                               091900      
001613     IF W77-MON-ANT NOT = A00-F01-MONEDA OF A01-MOVTRA            092000      
001614        ADD 1                      TO W77-CON-SUC                 092100      
001615        PERFORM 9020-CORTE-MONEDA.                                092200      
001616     MOVE WKS-CVE-AFC(A00-F01-CVETRAN1 OF A01-MOVTRA) TO W77-AFC. 092300      
001617     IF A00-F01-IMPORTE1 OF A01-MOVTRA > ZEROS                    092400      
001618        IF W77-AFC = 1                                            092500      
001619           ADD A00-F01-IMPORTE1 OF A01-MOVTRA TO                  092600      
001620                                              WKS-IMP-ABOTRA      092700      
001621                                              WKS-TOT-ABOTRA      092800      
001622        ELSE                                                      092900      
001623        IF W77-AFC = 2                                            093000      
001624           ADD A00-F01-IMPORTE1 OF A01-MOVTRA TO                  093100      
001625                                              WKS-IMP-CARTRA      093200      
001626                                              WKS-TOT-CARTRA.     093300      
001627                                                                  093400      
001628     MOVE A00-F01-SUCPROM     OF A01-MOVTRA TO WRS-D1-SUCPROM     093500      
001629     MOVE A00-F01-CONTRATO    OF A01-MOVTRA TO WRS-D1-CONTRATO    093600      
001630     MOVE A00-F01-PRODUCTO    OF A01-MOVTRA TO WRS-D1-PRODUCTO    093700      
001631     MOVE A00-F01-INSTRUMENTO OF A01-MOVTRA TO WRS-D1-INSTRUMENTO 093800      
001632     MOVE A00-F01-CVETRAN1    OF A01-MOVTRA TO WRS-D1-CVETRAN1    093900      
001633     MOVE A00-F01-IMPORTE1    OF A01-MOVTRA TO WRS-D1-IMPORTE1    094000      
001634     MOVE A00-F01-AUTORIZA    OF A01-MOVTRA TO WRS-D1-AUTORIZA    094100      
001635     MOVE A00-F01-AUT-S151    OF A01-MOVTRA TO WRS-D1-AUTS151     094200      
001636     MOVE A00-F01-BCO-ORI     OF A01-MOVTRA TO WSR-D1-BCO-ORI     094300      
001637     MOVE A00-F01-BCO-DES     OF A01-MOVTRA TO WSR-D1-BCO-DES     094400      
001638     MOVE A00-F01-SUC-ADI     OF A01-MOVTRA TO WRS-D1-SUCINI      094500      
001639     MOVE A00-F01-CAJA-ADI    OF A01-MOVTRA TO WRS-D1-CAJA-INIC   094600      
001640     MOVE W77-CSI-TRA                     TO WKS-LEY-CSIT1        094700      
001641                                             WKS-LEY-CSIT1-SC     094710      
001642     MOVE W77-CSI-REC                     TO WKS-LEY-CSIT2        094800      
001643                                             WKS-LEY-CSIT2-SC     094805      
001644     IF W77-SISTEMA = 500 AND                                     094810      
001645            (A00-F01-INDSUBCTA OF A01-MOVTRA = 1)                 094812      
001646        MOVE WKS-LEYENDA-TRA-SC              TO WRS-D1-LEY        094815      
001647     ELSE                                                         094820      
001648        MOVE WKS-LEYENDA-TRA                 TO WRS-D1-LEY.       094900      
001649     ADD 1                                 TO W77-CONT-LIN        095000      
001650     IF W77-CONT-LIN > 55                                         095100      
001651         PERFORM 7000-IMPRIME-TITULOS.                            095200      
001652     WRITE REG-REP FROM WRS-D1.                                   095300      
001653     ADD 1                                 TO W77-MOVSERR.        095400      
001654     MOVE A00-F01-MONEDA OF A01-MOVTRA     TO W77-MON-ANT.        095500      
001655*ASM MOVE KEY-BCO                          TO KEY-BCO-ANT.        095600      
001656*                                                                 095700      
001657 4030-ADD-OK.                                                     095800      
001658*------------                                                     095900      
001659     IF W77-MON-ANT NOT = A00-F01-MONEDA OF A01-MOVREC            096000      
001660        ADD 1                      TO W77-CON-SUC                 096100      
001661        PERFORM 9020-CORTE-MONEDA.                                096200      
001662     MOVE WKS-CVE-AFC(A00-F01-CVETRAN1 OF A01-MOVREC) TO W77-AFC  096300      
001663     IF A00-F01-IMPORTE1 OF A01-MOVREC > ZEROS                    096400      
001664        IF W77-AFC = 1                                            096500      
001665           ADD A00-F01-IMPORTE1 OF A01-MOVREC TO                  096600      
001666                                              WKS-IMP-ABOOK       096700      
001667                                              WKS-TOT-ABOOK       096800      
001668        ELSE                                                      096900      
001669        IF W77-AFC = 2                                            097000      
001670           ADD A00-F01-IMPORTE1 OF A01-MOVREC TO                  097100      
001671                                              WKS-IMP-CAROK       097200      
001672                                              WKS-TOT-CAROK.      097300      
001673     MOVE A00-F01-MONEDA OF A01-MOVREC     TO W77-MON-ANT.        097400      
001674*ASM MOVE KEY-BCO                          TO KEY-BCO-ANT.        097500      
001675*                                                                 097550      
001676 4500-GRABA-TOTALES-BCO.                                          097600      
001677*-----------------------                                          097601      
001678*ASM READ A01-TOTBCO KEY IS KEY-BCO                               097602      
001679*ASM    INVALID KEY                                               097604      
001680*ASM         MOVE ZEROS   TO TOT-CGO-OK,  TOT-ABO-OK,             097606      
001681*ASM                         TOT-CGO-TRA, TOT-ABO-TRA,            097608      
001682*ASM                         TOT-CGO-REC, TOT-ABO-REC             097610      
001683*ASM         WRITE REG-TB                                         097612      
001684*ASM           INVALID KEY                                        097614      
001685*ASM             MOVE "E"     TO      TIPO-LJ                     097616      
001686*ASM             MOVE 020202  TO      CODIGO-LJ                   097618      
001687*ASM             MOVE "ERROR EN WRITE TOTBCO AL GRABAR NUEVO REG" 097620      
001688*ASM                          TO      TEXTO-LJ                    097622      
001689*ASM             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,         097624      
001690*ASM                                         MENSAJE-LJ           097626      
001691*ASM             SET MYSELF(STATUS) TO -1.                        097628      
001692*ASM                                                              097630      
001693*ASM    ADD  WKS-TOT-CAROK        TO      TOT-CGO-OK              097634      
001694*ASM    ADD  WKS-TOT-ABOOK        TO      TOT-ABO-OK              097636      
001695*ASM    ADD  WKS-TOT-CARTRA       TO      TOT-CGO-TRA             097638      
001696*ASM    ADD  WKS-TOT-ABOTRA       TO      TOT-ABO-TRA             097640      
001697*ASM    ADD  WKS-TOT-CARREC       TO      TOT-CGO-REC             097642      
001698*ASM    ADD  WKS-TOT-ABOREC       TO      TOT-ABO-REC             097644      
001699*ASM                                                              097646      
001700*ASM REWRITE REG-TB INVALID KEY                                   097648      
001701*ASM         MOVE "E"     TO      TIPO-LJ                         097650      
001702*ASM         MOVE 020202  TO      CODIGO-LJ                       097652      
001703*ASM         MOVE "ERROR EN REWRITE TOTBCO  AL ACTUALIZARLO"      097654      
001704*ASM                      TO      TEXTO-LJ                        097656      
001705*ASM         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ  097658      
001706*ASM         SET MYSELF(STATUS) TO -1.                            097660      
001707*ASM                                                              097662      
001708*ASM MOVE ZEROS                   TO WKS-TOT-CAROK                097667      
001709*ASM                                 WKS-TOT-ABOOK                097672      
001710*ASM                                 WKS-TOT-CARTRA               097677      
001711*ASM                                 WKS-TOT-ABOTRA               097682      
001712*ASM                                 WKS-TOT-CARREC               097687      
001713*ASM                                 WKS-TOT-ABOREC.              097692      
001714*                                                                 097697      
001715 5000-LEE-MOVTRA.                                                 097700      
001716*----------------                                                 097800      
001717     READ A01-MOVTRA AT END                                       097900      
001718                  MOVE 1           TO W77-FINTRA                  098000      
001719                  MOVE ZEROS       TO A00-F01-KEY  OF A01-MOVTRA  098100      
001720                  MOVE 99          TO A00-F01-TIPO OF A01-MOVTRA. 098200      
001721     ADD 1                         TO W77-LEITRA.                 098300      
001722*                                                                 098400      
001723 6000-LEE-MOVREC.                                                 098500      
001724*----------------                                                 098600      
001725     READ A01-MOVREC AT END                                       098700      
001726                  MOVE 1           TO W77-FINREC                  098800      
001727                  MOVE ZEROS       TO A00-F01-KEY  OF A01-MOVREC  098900      
001728                  MOVE 99          TO A00-F01-TIPO OF A01-MOVREC. 099000      
001729     ADD 1                         TO W77-LEIREC.                 099100      
001730*                                                                 099200      
001731 7000-IMPRIME-TITULOS.                                            099300      
001732*---------------------                                            099400      
001733     ADD 1                        TO W77-CONT-HOJ.                099500      
001734     MOVE ZEROS                   TO W77-CONT-LIN.                099600      
001735     MOVE "R"                     TO TIRE-COM1.                   099700      
001736     MOVE  0                      TO SUBS-COM1.                   099800      
001737     MOVE 113                     TO PASO-COM1.                   099900      
001738     MOVE 1                       TO NURE-COM1.                   100000      
001739     WRITE REG-REP FROM COMUN-TITULO-1 AFTER PAGE                 100100      
001740     MOVE "PFORANEOS      "       TO PASO-COM2.                   100200      
001741     MOVE "DIARIO "               TO TIPO-COM2.                   100300      
001742     WRITE REG-REP FROM COMUN-TITULO-2.                           100400      
001743     MOVE NOMBRE-RPTE1            TO TITU-COM3.                   100500      
001744     MOVE W77-CONT-HOJ            TO HOJA-COM3.                   100600      
001745     WRITE REG-REP FROM COMUN-TITULO-3.                           100700      
001746     WRITE REG-REP FROM COMUN-TITULO-4.                           100800      
001747     WRITE REG-REP FROM CONT-ARCH-TITULO-0.                       100850      
001748     WRITE REG-REP FROM CONT-ARCH-TITULO-1.                       100900      
001749     WRITE REG-REP FROM COMUN-TITULO-4.                           101000      
001750*                                                                 101100      
001751**** Inicia cambio Fabrica de software **** Abarbosa       P05-355101101      
001752*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001753* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         101110      
001754*                                      FROM 100000 TO 999999      101120      
001755                                                                  100000      
001756*----------------------------------------------------------------*100100      
001757*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
001758*----------------------------------------------------------------*100300      
001759 70000-CALCULA-ESPACIO.                                           100400      
001760*======================                                           100500      
001761     IF W77-FRAMESIZE             =   8                           100600      
001762        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
001763                                  /   6                           100800      
001764        IF WS-WORD-RES            >   ZEROS                       100900      
001765           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
001766                                  +   1                           101100      
001767        ELSE                                                      101200      
001768           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
001769                                                                  101400      
001770     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
001771                                  =   (W77-MAXRECSIZE + 3)        101600      
001772                                  *   2000                        101700      
001773                                  +   1500                        101800      
001774                                                                  101900      
001775     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
001776                                  =   W77-MAXRECSIZE              102100      
001777                                  *   W77-LASTRECORD              102200      
001778                                  *   3.5                        .102300      
001779                                                                  102400      
001780*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001781**** Fin    cambio Fabrica de software **** Abarbosa       P05-355101121      
001782*                                                                 101130      
001783 9000-TERMINA.                                                    101200      
001784*-------------                                                    101300      
001785     CLOSE V01-REPORTE WITH SAVE.                                 101400      
001786     CLOSE V00-REPORTE2 WITH SAVE.                                101500      
001787*                                                                 101600      
001788 9020-CORTE-MONEDA.                                               101700      
001789*------------------                                               101800      
001790*ASM PERFORM 4500-GRABA-TOTALES-BCO.                              101850      
001791     MOVE SPACES                   TO REG-REP                     101900      
001792     WRITE REG-REP                    AFTER 2.                    102000      
001793     ADD 2                         TO W77-CONT-LIN.               102100      
001794     IF W77-CONT-LIN > 50                                         102200      
001795        PERFORM 7000-IMPRIME-TITULOS                              102300      
001796        PERFORM 9040-VALIDA-IMPORTES                              102400      
001797        WRITE REG-REP FROM CONT-ARCH-TITULO-2                     102500      
001798        WRITE REG-REP FROM COMUN-TITULO-4                         102600      
001799     ELSE                                                         102700      
001800        PERFORM 9040-VALIDA-IMPORTES                              102800      
001801        WRITE REG-REP FROM CONT-ARCH-TITULO-2                     102900      
001802        WRITE REG-REP FROM COMUN-TITULO-4.                        103000      
001803     ADD 2                         TO W77-CONT-LIN.               103100      
001804     MOVE W77-MON-ANT              TO WRS-D2-MON.                 103200      
001805     MOVE WKS-IMP-CAROK            TO WRS-D2-CAROK.               103300      
001806     MOVE WKS-IMP-ABOOK            TO WRS-D2-ABOOK.               103400      
001807     MOVE WKS-IMP-CARTRA           TO WRS-D2-CARERRTRA.           103500      
001808     MOVE WKS-IMP-ABOTRA           TO WRS-D2-ABOERRTRA.           103600      
001809     MOVE WKS-IMP-CARREC           TO WRS-D2-CARERRREC.           103700      
001810     MOVE WKS-IMP-ABOREC           TO WRS-D2-ABOERRREC.           103800      
001811     IF W77-CONT-LIN > 50                                         103900      
001812        PERFORM 7000-IMPRIME-TITULOS                              104000      
001813        WRITE REG-REP FROM WRS-D2                                 104100      
001814*ASM    PERFORM 9050-RECORRE-TOTALES-BCO                          104150      
001815     ELSE                                                         104200      
001816        WRITE REG-REP FROM WRS-D2.                                104300      
001817*ASM    PERFORM 9050-RECORRE-TOTALES-BCO.                         104350      
001818     MOVE 60                       TO W77-CONT-LIN.               104400      
001819     MOVE ZEROS                    TO WKS-IMP-CAROK               104500      
001820                                      WKS-IMP-ABOOK               104600      
001821                                      WKS-IMP-CARTRA              104700      
001822                                      WKS-IMP-ABOTRA              104800      
001823                                      WKS-IMP-CARREC              104900      
001824                                      WKS-IMP-ABOREC.             105000      
001825*                                                                 105100      
001826 9040-VALIDA-IMPORTES.                                            105200      
001827*---------------------                                            105300      
001828   IF WKS-IMP-CARTRA = 0  AND                                     105400      
001829      WKS-IMP-ABOTRA = 0  AND                                     105500      
001830      WKS-IMP-CARREC = 0  AND                                     105600      
001831      WKS-IMP-ABOREC = 0                                          105700      
001832      MOVE SPACES                   TO REG-REP                    105800      
001833      WRITE REG-REP                    AFTER 2                    105900      
001834      ADD 2                         TO W77-CONT-LIN               106000      
001835      WRITE REG-REP FROM WRS-D3                                   106100      
001836      MOVE SPACES                   TO REG-REP                    106200      
001837      WRITE REG-REP                    AFTER 2.                   106300      
001838                                                                  106400      
001839*                                                                 106405      
001840 9050-RECORRE-TOTALES-BCO.                                        106410      
001841*-------------------------                                        106415      
001842*ASM  MOVE SPACES                         TO REG-REP.             106420      
001843*ASM  WRITE REG-REP                       AFTER 2.                106425      
001844*ASM  MOVE 0                              TO W77-EOF.             106430      
001845*ASM  READ A01-TOTBCO NEXT RECORD AT END MOVE 1 TO W77-EOF.       106440      
001846*ASM  PERFORM 9060-IMPRIME-TOTALES-BCO UNTIL W77-EOF = 1.         106445      
001847*ASM  PERFORM 1020-INICIALIZA-TOT-BCO.                            106450      
001848*                                                                 106455      
001849 9060-IMPRIME-TOTALES-BCO.                                        106459      
001850*-------------------------                                        106461      
001851*ASM MOVE KEY-BCO-ORI              TO WRS-D2-MON.                 106463      
001852*ASM MOVE TOT-CGO-OK               TO WRS-D2-CAROK.               106465      
001853*ASM MOVE TOT-ABO-OK               TO WRS-D2-ABOOK.               106467      
001854*ASM MOVE TOT-CGO-TRA              TO WRS-D2-CARERRTRA.           106469      
001855*ASM MOVE TOT-ABO-TRA              TO WRS-D2-ABOERRTRA.           106471      
001856*ASM MOVE TOT-CGO-REC              TO WRS-D2-CARERRREC.           106473      
001857*ASM MOVE TOT-ABO-REC              TO WRS-D2-ABOERRREC.           106475      
001858*ASM WRITE REG-REP                 FROM WRS-D2.                   106477      
001859*ASM READ A01-TOTBCO NEXT RECORD AT END MOVE 1 TO W77-EOF.        106479      
001860                                                                  106499      
001861*INICIA CODIGO DE RENOVACION CRONOS 2000                          106500      
001862*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001863*   COPY "S151/CRONOS2K/CPY/PD".                                  106600      
001864** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
001865** Unisys has defined for CRONOS2K project                     ** 000200      
001866** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
001867***************************************************************** 000400      
001868***************************************************************** 000600      
001869** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
001870** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
001871** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
001872** date MMDDCCAA, which is returned into the variable          ** 001000      
001873** A2K-FEC-MDCA-001.                                           ** 001100      
001874***************************************************************** 001200      
001875                                                                  001300      
001876 A2K-ACCEPT-TODAYS-DATE.                                          001400      
001877        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
001878*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
001879        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
001880        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
001881        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
001882        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
001883        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
001884                                                                  002200      
001885 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
001886        EXIT.                                                     002240      
001887                                                                  002500      
001888****************************************************************  002600      
001889** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
001890**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
001891**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
001892**baseyear to add the century to the year part.               **  003000      
001893**INPUT is A2K-FEC-AMD-001                                    **  003100      
001894**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
001895****************************************************************  003300      
001896                                                                  003400      
001897 A2K-CONV-AMD-TO-CAMD.                                            003500      
001898         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
001899         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
001900         IF A2K-FEC-AMD-001 = 0                                   003720      
001901            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
001902         ELSE                                                     003741      
001903          IF A2K-FEC-AMD-001 = 999999                             003742      
001904             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
001905         ELSE                                                     003760      
001906         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
001907                 A2K-OBTAIN-CENTURY-EXIT                          003900      
001908         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
001909         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
001910         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
001911         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
001912                                                                  004400      
001913 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
001914         EXIT.                                                    004600      
001915                                                                  004700      
001916******************************************************************004800      
001917**A2K-CONV-MDA-TO-MDCA.                                         **004900      
001918**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
001919** an eight digit format as MMDDCCAA. It use a                  **005100      
001920** baseyear to add century to the yaer.                         **005200      
001921** INPUT is A2K-FEC-MDA-001                                     **005300      
001922** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
001923                                                                  005500      
001924 A2K-CONV-MDA-TO-MDCA.                                            005600      
001925     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
001926     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
001927     IF A2K-FEC-MDA-001 = 0                                       005820      
001928        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
001929     ELSE                                                         005845      
001930      IF A2K-FEC-MDA-001 = 999999                                 005850      
001931         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
001932     ELSE                                                         005860      
001933     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
001934             A2K-OBTAIN-CENTURY-EXIT                              006000      
001935     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
001936     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
001937     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
001938     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
001939                                                                  006500      
001940 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
001941     EXIT.                                                        006700      
001942                                                                  006800      
001943***************************************************************** 006900      
001944**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
001945**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
001946**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
001947**baseyear to add century to the year.                         ** 007300      
001948**INPUT is A2K-FEC-DMA-001                                     ** 007400      
001949**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
001950                                                                  007600      
001951 A2K-CONV-DMA-TO-DMCA.                                            007700      
001952       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
001953       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
001954       IF  A2K-FEC-DMA-001   = 0                                  007920      
001955          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
001956       ELSE                                                       007945      
001957        IF A2K-FEC-DMA-001 = 999999                               007950      
001958          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
001959       ELSE                                                       007960      
001960       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
001961               A2K-OBTAIN-CENTURY-EXIT                            008100      
001962       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
001963       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
001964       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
001965       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
001966                                                                  008600      
001967 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
001968       EXIT.                                                      008800      
001969                                                                  008900      
001970***************************************************************** 009000      
001971** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
001972** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
001973** a 6 digit format as AAMMDD.                                 ** 009300      
001974** It simply removes the century information in the output     ** 009400      
001975** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
001976** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
001977                                                                  009700      
001978 A2K-CONV-CAMD-TO-AMD.                                            009800      
001979     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
001980     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
001981     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
001982     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
001983                                                                  010300      
001984 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
001985      EXIT.                                                       010500      
001986                                                                  010600      
001987******************************************************************010700      
001988******************************************************************010800      
001989** A2K-CONV-MDCA-TO-MDA.                                        **010900      
001990** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
001991** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
001992** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
001993** INPUT is A2K-FEC-MDCA-001                                    **011300      
001994** OUTPUT is A2K-FEC-MDA-001                                    **011400      
001995                                                                  011500      
001996 A2K-CONV-MDCA-TO-MDA.                                            011600      
001997     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
001998     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
001999     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002000     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002001                                                                  012100      
002002 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002003      EXIT.                                                       012300      
002004                                                                  012400      
002005******************************************************************012500      
002006***************************************************************** 012600      
002007** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002008** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002009** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002010** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002011** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002012** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002013                                                                  013300      
002014 A2K-CONV-DMCA-TO-DMA.                                            013400      
002015     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002016     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002017     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002018     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002019                                                                  013900      
002020 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002021      EXIT.                                                       014100      
002022                                                                  014200      
002023***************************************************************** 014300      
002024 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002025      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002026      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002027      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002028      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002029      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002030 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002031      EXIT.                                                       015100      
002032***************************************************************** 015200      
002033** This paragraph adds century to an year field which is 9(02) ** 015300      
002034** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002035** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002036***************************************************************** 015700      
002037 A2K-CONV-AA-TO-CCAA.                                             015800      
002038      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002039      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002040              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002041      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002042 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002043      EXIT.                                                       016400      
002044***************************************************************** 016500      
002045** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002046** format.                                                     ** 016700      
002047** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002048** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002049***************************************************************** 017000      
002050 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002051      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002052      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002053      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002054      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002055      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002056 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002057      EXIT.                                                       017800      
002058***************************************************************** 017900      
002059** This paragraph desides the Century to be added depending    ** 018000      
002060** on the base year.                                           ** 018100      
002061** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002062** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002063***************************************************************** 018400      
002064 A2K-OBTAIN-CENTURY.                                              018500      
002065      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002066          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002067      ELSE                                                        018800      
002068          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002069 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002070      EXIT.                                                       019100      
002071                                                                  019200      
002072***************************************************************** 019300      
002073** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002074**  Format                                                     ** 019500      
002075** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002076** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002077***************************************************************** 019800      
002078 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002079      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002080      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002081      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002082      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002083      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002084                                                                  020500      
002085 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002086      EXIT.                                                       020700      
002087                                                                  020800      
002088******************************************************************020900      
002089******************************************************************021000      
002090 A2K-CONV-AM-TO-CAM.                                              021100      
002091      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002092      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002093      IF A2K-FEC-AM-001 = 0                                       021220      
002094         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002095      ELSE                                                        021245      
002096      IF A2K-FEC-AM-001 = 9999                                    021250      
002097         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002098      ELSE                                                        021260      
002099      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002100      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002101      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002102              A2K-OBTAIN-CENTURY-EXIT                             021600      
002103      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002104                                                                  021800      
002105 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002106      EXIT.                                                       022000      
002107                                                                  022100      
002108******************************************************************022200      
002109******************************************************************022300      
002110 A2K-CONV-CAM-TO-AM.                                              022400      
002111      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002112      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002113      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002114                                                                  022800      
002115 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002116   EXIT.                                                          023000      
002117                                                                  023100      
002118                                                                  023200      
002119                                                                  023500      
002120*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002121 A2K-CPY-EXIT-PARA.                                               106700      
002122     EXIT.                                                        106800      
002123*TERMINA CODIGO DE RENOVACION CRONOS 2000                         106900      
