000001$SET OPTIMIZE                                                     000100      
000002$SET LIST                                                         000150      
000003 IDENTIFICATION DIVISION.                                         000200      
000004******************************************************************000300      
000005*   FUNCION : GENERAR A PARTIR DE LA BASE DE CONTROL ARCHIVOS    *000400      
000006*             QUE CONTENGAN LA INFORMACION DE LOS DATASETS       *000500      
000007*             B01SISDIA, B02ARCINTER, B03SISMEN, B04SISTEM       *000600      
000008*             B05PROCESOS, B09CONXSIS.                           *000700      
000009******************************************************************000800      
000010******************************************************************000805      
000011**JNRB 251112 SE LIBERA NUEVA VERSION POR PROCESO DE             *000810      
000012**RECOMPILACION                                                  *000815      
000013*                                                                *000820      
000014*                                                                *000825      
000015*                                                                *000830      
000016*                                                                *000835      
000017*                                                                *000840      
000018*                                                                *000845      
000019*                                                                *000850      
000020*                                                                *000855      
000021*                                                                *000860      
000022*                                                                *000865      
000023*                                                                *000870      
000024******************************************************************000875      
000025                                                                  000900      
000026 ENVIRONMENT DIVISION.                                            001000      
000027 INPUT-OUTPUT SECTION.                                            001100      
000028 FILE-CONTROL.                                                    001200      
000029     SELECT A01-B01SISDIA          ASSIGN TO DISK.                001300      
000030     SELECT A02-B02ARCINTER        ASSIGN TO DISK.                001400      
000031     SELECT A03-B03SISMEN          ASSIGN TO DISK.                001500      
000032     SELECT A04-B04SISTEM          ASSIGN TO DISK.                001600      
000033     SELECT A06-B05PROCESOS        ASSIGN TO DISK.                001650      
000034     SELECT A05-B09CONXSIS         ASSIGN TO DISK.                001700      
000035 DATA DIVISION.                                                   001800      
000036 FILE SECTION.                                                    001900      
000037 FD  A01-B01SISDIA                                                002000      
000038     RECORD CONTAINS 370 CHARACTERS                               002100      
000039     BLOCK  CONTAINS 5  RECORDS                                   002200      
000040     VALUE  OF TITLE IS WKS-ARCH-B01.                             002300      
000041                                                                  002400      
000042 01  A01-R00-SISDIA.                                              002500      
000043     03 A01-R00-SISTEMA            PIC 9(04) COMP.                002600      
000044     03 A01-R00-CSI                PIC 9(02) COMP.                002700      
000045     03 A01-R00-FECPRO             PIC 9(08) COMP.                002800      
000046     03 A01-R00-FECCON             PIC 9(08) COMP.                002900      
000047     03 A01-R00-FECPROS151         PIC 9(08) COMP.                003000      
000048     03 A01-R00-STAREG             PIC 9(02) COMP.                003100      
000049     03 A01-R00-NOMARCSAL          PIC X(34).                     003200      
000050     03 A01-R00-NOMPACSAL          PIC X(17).                     003300      
000051     03 A01-R00-NOMARCMOV          PIC X(34).                     003400      
000052     03 A01-R00-NOMPACMOV          PIC X(17).                     003500      
000053     03 A01-R00-NOMARCDES          PIC X(34).                     003600      
000054     03 A01-R00-NOMPACDES          PIC X(17).                     003700      
000055     03 A01-R00-NOMARCERR          PIC X(34).                     003800      
000056     03 A01-R00-NOMPACERR          PIC X(17).                     003900      
000057     03 A01-R00-NOMBDSEM           PIC X(17).                     004000      
000058     03 A01-R00-STABDSEM           PIC 9(02) COMP.                004100      
000059     03 A01-R00-NUMARC             PIC 9(02) COMP.                004200      
000060     03 A01-R00-3ERNIV             PIC 9(02) COMP.                004300      
000061     03 A01-R00-CTL-DIA            OCCURS 10 TIMES.               004400      
000062        05 A01-R00-FECARCMOV       PIC 9(08) COMP.                004500      
000063        05 A01-R00-NIVARCMOV       PIC 9(08) COMP.                004600      
000064        05 A01-R00-NIVBDSEM        PIC 9(08) COMP.                004700      
000065        05 A01-R00-STAARCHLOG      PIC 9(02) COMP.                004800      
000066                                                                  004900      
000067 FD  A02-B02ARCINTER                                              005000      
000068     RECORD CONTAINS 612 CHARACTERS                               005100      
000069     BLOCK CONTAINS  7  RECORDS                                   005200      
000070    VALUE OF TITLE IS WKS-ARCH-B02.                               005300      
000071                                                                  005400      
000072 01  A02-R00-ARCINTER.                                            005500      
000073     03 A02-R00-SISTEMA            PIC 9(04) COMP.                005600      
000074     03 A02-R00-NOMARC028          PIC X(34).                     005700      
000075     03 A02-R00-NOMPAC028          PIC X(17).                     005800      
000076     03 A02-R00-NOMARC250          PIC X(34).                     005900      
000077     03 A02-R00-NOMPAC250          PIC X(17).                     006000      
000078     03 A02-R00-NOMARC030          PIC X(34).                     006100      
000079     03 A02-R00-NOMPAC030          PIC X(17).                     006200      
000080     03 A02-R00-NOMARC015          PIC X(34).                     006300      
000081     03 A02-R00-NOMPAC015          PIC X(17).                     006400      
000082     03 A02-R00-NOMARC050S         PIC X(34).                     006500      
000083     03 A02-R00-NOMPAC050S         PIC X(17).                     006600      
000084     03 A02-R00-NOMARC253          PIC X(34).                     006700      
000085     03 A02-R00-NOMPAC253          PIC X(17).                     006800      
000086     03 A02-R00-NOMARC264          PIC X(34).                     006900      
000087     03 A02-R00-NOMPAC264          PIC X(17).                     007000      
000088     03 A02-R00-NOMARC275S         PIC X(34).                     007100      
000089     03 A02-R00-NOMPAC275S         PIC X(17).                     007200      
000090     03 A02-R00-NOMARC275M         PIC X(34).                     007300      
000091     03 A02-R00-NOMPAC275M         PIC X(17).                     007400      
000092     03 A02-R00-NOMARCSIG          PIC X(34).                     007500      
000093     03 A02-R00-NOMPACSIG          PIC X(17).                     007600      
000094     03 A02-R00-NOMARC750          PIC X(34).                     007700      
000095     03 A02-R00-NOMPAC750          PIC X(17).                     007800      
000096     03 A02-R00-NOMARC136          PIC X(34).                     007900      
000097     03 A02-R00-NOMPAC136          PIC X(17).                     008000      
000098                                                                  008100      
000099 FD  A03-B03SISMEN                                                008200      
000100     RECORD CONTAINS 245  CHARACTERS                              008300      
000101     BLOCK  CONTAINS   3  RECORDS                                 008400      
000102     VALUE OF TITLE IS WKS-ARCH-B03.                              008500      
000103                                                                  008600      
000104 01  A03-R00-SISMEN.                                              008700      
000105     03 A03-R00-SISTEMA            PIC 9(04) COMP.                008800      
000106     03 A03-R00-MODSIS             PIC 9(02) COMP.                008900      
000107     03 A03-R00-RESCSI             PIC 9(02) COMP.                009000      
000108     03 A03-R00-TIPBD              PIC 9(02) COMP.                009100      
000109     03 A03-R00-NUMCICDIA          PIC 9(04) COMP.                009200      
000110     03 A03-R00-NUMCICMES          PIC 9(04) COMP.                009300      
000111     03 A03-R00-NOMBDSAL           PIC X(17).                     009400      
000112     03 A03-R00-STABDSAL           PIC 9(02) COMP.                009500      
000113     03 A03-R00-NOMBDMOVHI         PIC X(17).                     009600      
000114     03 A03-R00-SECOKHI            PIC 9(10) COMP.                009700      
000115     03 A03-R00-SECINFHI           PIC 9(10) COMP.                009800      
000116     03 A03-R00-SECERRHI           PIC 9(10) COMP.                009900      
000117     03 A03-R00-STABDMOVHI         PIC 9(02) COMP.                010000      
000118     03 A03-R00-CTL-MEN            OCCURS 5 TIMES.                010100      
000119        05 A03-R00-NOMBDMOV        PIC X(17).                     010200      
000120        05 A03-R00-NUMBDMOV        PIC 9(02) COMP.                010300      
000121        05 A03-R00-AAMM            PIC 9(06) COMP.                010400      
000122        05 A03-R00-SECOK           PIC 9(10) COMP.                010500      
000123        05 A03-R00-SECINF          PIC 9(10) COMP.                010600      
000124        05 A03-R00-SECERR          PIC 9(10) COMP.                010700      
000125        05 A03-R00-STABDMOV        PIC 9(02) COMP.                010800      
000126                                                                  010900      
000127 FD  A04-B04SISTEM                                                011000      
000128     RECORD CONTAINS 67   CHARACTERS                              011100      
000129     BLOCK  CONTAINS 8    RECORDS                                 011200      
000130     VALUE OF TITLE IS WKS-ARCH-B04.                              011300      
000131                                                                  011400      
000132 01  A04-R00-SISTEM.                                              011500      
000133     03 A04-R00-SISTEMA            PIC 9(04) COMP.                011600      
000134     03 A04-R00-PROD               PIC 9(04) COMP.                011700      
000135     03 A04-R00-INST               PIC 9(04) COMP.                011800      
000136     03 A04-R00-NOMCOR             PIC X(20).                     011900      
000137     03 A04-R00-NOMLAR             PIC X(40).                     012000      
000138     03 A04-R00-STATUS             PIC 9(02) COMP.                012100      
000139                                                                  012200      
000140                                                                  012205      
000141 FD  A06-B05PROCESOS                                              012210      
000142     RECORD CONTAINS 75   CHARACTERS                              012215      
000143     BLOCK  CONTAINS 36   RECORDS                                 012220      
000144     VALUE OF TITLE IS WKS-ARCH-B05.                              012225      
000145                                                                  012230      
000146 01  A06-R00-PROCESOS.                                            012235      
000147     03 A06-R00-SISTEMA            PIC 9(04) COMP.                012240      
000148     03 A06-R00-FCHPRO             PIC 9(08) COMP.                012245      
000149     03 A06-R00-NUMPRO             PIC 9(04) COMP.                012250      
000150     03 A06-R00-NOMPGM             PIC X(04).                     012255      
000151     03 A06-R00-STAPGM             PIC 9(02) COMP.                012260      
000152     03 A06-R00-MIX                PIC 9(08) COMP.                012265      
000153     03 A06-R00-FCHINI             PIC 9(08) COMP.                012270      
000154     03 A06-R00-HORAINI            PIC 9(06) COMP.                012275      
000155     03 A06-R00-FCHFIN             PIC 9(08) COMP.                012280      
000156     03 A06-R00-HORAFIN            PIC 9(06) COMP.                012281      
000157     03 A06-R00-NUMREGINI          PIC 9(08) COMP.                012282      
000158     03 A06-R00-NUMREGFIN          PIC 9(08) COMP.                012283      
000159                                                                  012285      
000160 FD  A05-B09CONXSIS                                               012300      
000161     RECORD CONTAINS  22  CHARACTERS                              012400      
000162     BLOCK  CONTAINS  8   RECORDS                                 012500      
000163     VALUE OF TITLE IS WKS-ARCH-B09.                              012600      
000164                                                                  012700      
000165 01  A05-R00-CONXSIS.                                             012800      
000166     03 A05-R00-SISTEMA            PIC 9(04) COMP.                012900      
000167     03 A05-R00-PRO                PIC 9(04) COMP.                013000      
000168     03 A05-R00-INS                PIC 9(04) COMP.                013100      
000169     03 A05-R00-NUM-REN            PIC 9(02) COMP.                013200      
000170     03 A05-R00-NOM-REN            PIC X(15).                     013300      
000171                                                                  013400      
000172                                                                  013500      
000173 DATA-BASE SECTION.                                               013600      
000174 DB  S151BD99CONTROL.                                             013700      
000175 WORKING-STORAGE SECTION.                                         013800      
000176                                                                  013900      
000177 01  WKS-ARCH-B01.                                                013902      
000178     02 FILLER                    PIC X(26)                       013904      
000179        VALUE "(S151)S151/FILE/B01SISDIA/".                       013906      
000180     02 WKS-FEC-B01               PIC 9(06).                      013908      
000181     02 FILLER                    PIC X(10)                       013910      
000182        VALUE " ON CMEMP.".                                       013912      
000183                                                                  013914      
000184 01  WKS-ARCH-B02.                                                013916      
000185     02 FILLER                    PIC X(28)                       013918      
000186        VALUE "(S151)S151/FILE/B02ARCINTER/".                     013920      
000187     02 WKS-FEC-B02               PIC 9(06).                      013922      
000188     02 FILLER                    PIC X(10)                       013924      
000189        VALUE " ON CMEMP.".                                       013926      
000190                                                                  013928      
000191 01  WKS-ARCH-B03.                                                013930      
000192     02 FILLER                    PIC X(26)                       013932      
000193        VALUE "(S151)S151/FILE/B03SISMEN/".                       013934      
000194     02 WKS-FEC-B03               PIC 9(06).                      013936      
000195     02 FILLER                    PIC X(10)                       013938      
000196        VALUE " ON CMEMP.".                                       013940      
000197                                                                  013941      
000198 01  WKS-ARCH-B04.                                                013942      
000199     02 FILLER                    PIC X(26)                       013943      
000200        VALUE "(S151)S151/FILE/B04SISTEM/".                       013945      
000201     02 WKS-FEC-B04               PIC 9(06).                      013946      
000202     02 FILLER                    PIC X(10)                       013947      
000203        VALUE " ON CMEMP.".                                       013948      
000204                                                                  013949      
000205 01  WKS-ARCH-B09.                                                013950      
000206     02 FILLER                    PIC X(27)                       013955      
000207        VALUE "(S151)S151/FILE/B09CONXSIS/".                      013960      
000208     02 WKS-FEC-B09               PIC 9(06).                      013965      
000209     02 FILLER                    PIC X(10)                       013970      
000210        VALUE " ON CMEMP.".                                       013975      
000211                                                                  014000      
000212 01  WKS-ARCH-B05.                                                014010      
000213     02 FILLER                    PIC X(28)                       014020      
000214        VALUE "(S151)S151/FILE/B05PROCESOS/".                     014030      
000215     02 WKS-FEC-B05               PIC 9(06).                      014040      
000216     02 FILLER                    PIC X(10)                       014050      
000217        VALUE " ON CMEMP.".                                       014060      
000218                                                                  014070      
000219*==========================================================       014080      
000220*         VARIABLES PARA LA LIBRERIA DE DESPLIEGE         =       014100      
000221*==========================================================       014200      
000222                                                                  014300      
000223*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000224* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           014400      
000225**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000226  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000227  01 MENSAJE-LJ.                                                  100300      
000228     02 SISTEMA-LJ     PIC X(04).                                 100400      
000229     02 FILLER         PIC X VALUE "/".                           100500      
000230     02 PASO-LJ        PIC X(04).                                 100600      
000231     02 FILLER         PIC X VALUE "/".                           100700      
000232     02 MTP-LJ         PIC 9(03).                                 100800      
000233     02 FILLER         PIC X VALUE ":".                           100900      
000234     02 TIPO-LJ        PIC X.                                     101000      
000235     02 FILLER         PIC X VALUE ">".                           101100      
000236     02 CODIGO-LJ      PIC 9(06).                                 101200      
000237     02 FILLER         PIC X VALUE "<".                           101300      
000238     02 TEXTO-LJ       PIC X(250).                                101400      
000239*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000240                                                                  014500      
000241*==========================================================       014600      
000242*         VARIABLES PARA SOPORTECOMS                      =       014700      
000243*==========================================================       014800      
000244                                                                  014900      
000245 01 WKS-SOPORTECOMS.                                              015000      
000246    03 WKS-SOPCOMS-NUMCSI          PIC 9(02).                     015100      
000247    03 WKS-SOPCOMS-EQUIPO          PIC X(10).                     015200      
000248    03 WKS-SOPCOMS-NOMCSI          PIC X(26).                     015300      
000249    03 WKS-SOPCOMS-LB              PIC X(05).                     015400      
000250                                                                  015500      
000251                                                                  017500      
000252*==========================================================       017600      
000253*         PARAMETROS DE EJECUCION                         =       017700      
000254*==========================================================       017800      
000255                                                                  017900      
000256 01  WKS-PARAM-FECHA               PIC 9(08).                     018000      
000257 01  WKS-FECHA-AMD REDEFINES WKS-PARAM-FECHA.                     018020      
000258     03 WKS-A1-AMD                 PIC 9(02).                     018025      
000259     03 WKS-FEC-AMD.                                              018030      
000260        05 WKS-A2-AMD              PIC 9(02).                     018040      
000261        05 WKS-MM-AMD              PIC 9(02).                     018060      
000262        05 WKS-DD-AMD              PIC 9(02).                     018080      
000263                                                                  018100      
000264 77  W77-DIAS                      PIC 9(02).                     020300      
000265 77  W77-NUMDIA                    PIC 9(02).                     020400      
000266 77  W77-EOF                       PIC 9(01).                     020500      
000267 77  W77-IND                       PIC 9(02).                     020600      
000268 77  W77-ERROR                     PIC 9(02).                     020700      
000269                                                                  020800      
000270*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000271* COPY "S151/FORMATO/ERROR/DMSII" FROM 1000 TO 60000.             020900      
000272                                                                  001000      
000273                                                                  002000      
000274                                                                  003000      
000275*=================================================================004000      
000276*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
000277*=================================================================006000      
000278                                                                  007000      
000279                                                                  008000      
000280                                                                  009000      
000281 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
000282 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
000283 01 WKS-TAB-ERRDMSII.                                             012000      
000284    02 FILLER                      PIC X(20)     VALUE            013000      
000285    "NOTFOUND          01".                                       014000      
000286    02 FILLER                      PIC X(20)     VALUE            015000      
000287    "DUPLICATES        02".                                       016000      
000288    02 FILLER                      PIC X(20)     VALUE            017000      
000289    "DEADLOCK          03".                                       018000      
000290    02 FILLER                      PIC X(20)     VALUE            019000      
000291    "DATAERROR         04".                                       020000      
000292    02 FILLER                      PIC X(20)     VALUE            021000      
000293    "NOTLOCKED         05".                                       022000      
000294    02 FILLER                      PIC X(20)     VALUE            023000      
000295    "KEYCHANGE         06".                                       024000      
000296    02 FILLER                      PIC X(20)     VALUE            025000      
000297    "SYSTEMERROR       07".                                       026000      
000298    02 FILLER                      PIC X(20)     VALUE            027000      
000299    "READONLY          08".                                       028000      
000300    02 FILLER                      PIC X(20)     VALUE            029000      
000301    "IOERROR           09".                                       030000      
000302    02 FILLER                      PIC X(20)     VALUE            031000      
000303    "LIMITERROR        10".                                       032000      
000304    02 FILLER                      PIC X(20)     VALUE            033000      
000305    "OPENERROR         11".                                       034000      
000306    02 FILLER                      PIC X(20)     VALUE            035000      
000307    "CLOSEERROR        12".                                       036000      
000308    02 FILLER                      PIC X(20)     VALUE            037000      
000309    "NORECORD          13".                                       038000      
000310    02 FILLER                      PIC X(20)     VALUE            039000      
000311    "INUSE             14".                                       040000      
000312    02 FILLER                      PIC X(20)     VALUE            041000      
000313    "AUDITERROR        15".                                       042000      
000314    02 FILLER                      PIC X(20)     VALUE            043000      
000315    "ABORT             16".                                       044000      
000316    02 FILLER                      PIC X(20)     VALUE            045000      
000317    "SECURITYERROR     17".                                       046000      
000318    02 FILLER                      PIC X(20)     VALUE            047000      
000319    "VERSIONERROR      18".                                       048000      
000320    02 FILLER                      PIC X(20)     VALUE            049000      
000321    "FATALERROR        19".                                       050000      
000322    02 FILLER                      PIC X(20)     VALUE            051000      
000323    "INTEGRITY ERROR   20".                                       052000      
000324    02 FILLER                      PIC X(20)     VALUE            053000      
000325    "INTLIBERROR       21".                                       054000      
000326 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
000327    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
000328       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
000329       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
000330                                                                  059000      
000331 01 WKS-ERR-BD                     PIC 9(04).                     059100      
000332 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
000333                                                                  060000      
000334*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000335                                                                  021000      
000336  PROCEDURE DIVISION USING WKS-PARAM-FECHA.                       021100      
000337                                                                  021200      
000338                                                                  021300      
000339  00-0000-CONTROL.                                                021400      
000340*=================                                                021500      
000341     MOVE WKS-PARAM-FECHA          TO WKS-FEC-B01                 021600      
000342                                      WKS-FEC-B02                 021700      
000343                                      WKS-FEC-B03                 021800      
000344                                      WKS-FEC-B04                 021900      
000345                                      WKS-FEC-B05                 021950      
000346                                      WKS-FEC-B09.                022000      
000347                                                                  022100      
000348     MOVE 0151                     TO SISTEMA-LJ.                 022200      
000349     MOVE "0680"                   TO PASO-LJ.                    022300      
000350     MOVE "002"                    TO MTP-LJ.                     022400      
000351                                                                  022500      
000352     PERFORM 01-00050-LIBRERIAS.                                  022600      
000353                                                                  022700      
000354     MOVE "I"                      TO TIPO-LJ.                    022800      
000355     MOVE 020101                   TO CODIGO-LJ.                  022900      
000356                                                                  023500      
000357     PERFORM 01-00100-ABRE-ENTRADA.                               023600      
000358     PERFORM 02-00100-GENERA-B01SISDIA.                           023700      
000359     PERFORM 03-00100-GENERA-B02ARCINTER.                         023800      
000360     PERFORM 04-00100-GENERA-B03SISMEN.                           023900      
000361     PERFORM 05-00100-GENERA-B04SISTEM.                           024000      
000362     PERFORM 07-00100-GENERA-B05PROCESOS.                         024050      
000363     PERFORM 06-00100-GENERA-B09CONXSIS.                          024100      
000364     PERFORM 01-00200-CIERRA-CONTROL.                             024200      
000365     MOVE "I"                      TO TIPO-LJ.                    024300      
000366     MOVE 020201                   TO CODIGO-LJ.                  024400      
000367     MOVE "FIN NORMAL DE PROCESO"  TO TEXTO-LJ.                   024500      
000368*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     024600      
000369*                                MENSAJE-LJ.                      024700      
000370     STOP RUN.                                                    024800      
000371                                                                  024900      
000372 01-00050-LIBRERIAS.                                              025000      
000373*===================                                              025100      
000374                                                                  025200      
000375     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.025300      
000376     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            025400      
000377                                      "SOPORTECOMS".              025500      
000378                                                                  025600      
000379     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      025700      
000380            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      025800      
000381                                                                  025900      
000382 01-00100-ABRE-ENTRADA.                                           026000      
000383*======================                                           026100      
000384     CALL "CSIID OF SOPORTECOMS" USING WKS-SOPORTECOMS.           026200      
000385     MOVE ZERO                     TO WKS-SOPCOMS-NUMCSI.         026220      
000386     CANCEL "SOPORTECOMS".                                        026240      
000387     OPEN UPDATE  S151BD99CONTROL                                 026300      
000388          ON EXCEPTION                                            026400      
000389             PERFORM 900000-CHE-STA                               026500      
000390             MOVE "I"              TO TIPO-LJ                     026600      
000391             MOVE 020202           TO CODIGO-LJ                   026700      
000392             MOVE "TERMINACION ANORMAL DEL PROGRAMA"              026800      
000393                                   TO TEXTO-LJ                    026900      
000394             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,             027000      
000395                                         MENSAJE-LJ               027100      
000396             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             027200      
000397     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL.                  027300      
000398                                                                  027400      
000399 01-00200-CIERRA-CONTROL.                                         027500      
000400*========================                                         027600      
000401     END-TRANSACTION AUDIT S151B99REINICTL.                       027700      
000402                                                                  027800      
000403     CLOSE S151BD99CONTROL                                        027900      
000404           ON EXCEPTION                                           028000      
000405              NEXT SENTENCE.                                      028100      
000406                                                                  028200      
000407 02-00100-GENERA-B01SISDIA.                                       028300      
000408*==========================                                       028400      
000409    OPEN INPUT A01-B01SISDIA.                                     028410      
000410    MOVE ZERO                      TO W77-EOF.                    028420      
000411    READ A01-B01SISDIA AT END MOVE 1 TO W77-EOF.                  028430      
000412    PERFORM 02-00104-GRABA-B01SISDIA UNTIL W77-EOF = 1.           028440      
000413    CLOSE A01-B01SISDIA.                                          028450      
000414    MOVE ZERO                      TO W77-EOF.                    028460      
000415                                                                  028470      
000416 02-00104-GRABA-B01SISDIA.                                        028480      
000417*========================                                         028490      
000418     MOVE 2                        TO W77-ERROR.                  028500      
000419     LOCK B01SXSISDIA                                             028600      
000420          AT  B01-SIS-SISTEMA = A01-R00-SISTEMA    AND            028700      
000421              B01-SIS-CSI     = WKS-SOPCOMS-NUMCSI                028800      
000422     ON EXCEPTION                                                 028900      
000423        IF DMSTATUS(NOTFOUND)                                     029000      
000424           MOVE ZERO               TO W77-ERROR                   029050      
000425           CREATE S151B01SISDIA                                   029100      
000426        ELSE                                                      029200      
000427           MOVE 1                  TO W77-ERROR                   029300      
000428           PERFORM 900000-CHE-STA.                                029400      
000429     IF W77-ERROR = 0                                             029500      
000430        MOVE A01-R00-SISTEMA       TO B01-SIS-SISTEMA             029600      
000431        MOVE WKS-SOPCOMS-NUMCSI    TO B01-SIS-CSI                 029700      
000432        MOVE A01-R00-FECPRO        TO B01-SIS-FECPRO              029800      
000433        MOVE A01-R00-FECCON        TO B01-SIS-FECCON              029900      
000434        MOVE A01-R00-FECPROS151    TO B01-SIS-FECPRO151           030000      
000435        MOVE A01-R00-STAREG        TO B01-SIS-STAREG              030050      
000436        MOVE A01-R00-NOMARCSAL     TO B01-SIS-NOMARCSAL           030100      
000437        MOVE A01-R00-NOMARCMOV     TO B01-SIS-NOMARCMOV           030200      
000438        MOVE A01-R00-NOMARCDES     TO B01-SIS-NOMARCDES           030300      
000439        MOVE A01-R00-NOMARCERR     TO B01-SIS-NOMARCERR           030400      
000440        MOVE A01-R00-NOMBDSEM      TO B01-SIS-NOMBDSEM            030500      
000441        MOVE A01-R00-NUMARC        TO B01-SIS-NUMARC              030600      
000442        MOVE A01-R00-3ERNIV        TO B01-SIS-3ERNIV              030610      
000443        PERFORM 02-00130-FECHAS                                   031300      
000444                VARYING W77-IND FROM 1 BY 1                       031400      
000445                UNTIL   W77-IND > 10                              031500      
000446           PERFORM 02-00140-MUEVE-PACK                            031575      
000447           PERFORM 02-00105-GRABA-BASE                            031595      
000448     ELSE                                                         031596      
000449        IF W77-ERROR = 2                                          031597      
000450           FREE S151B01SISDIA ON EXCEPTION NEXT SENTENCE.         031598      
000451                                                                  031599      
000452    READ A01-B01SISDIA   AT END MOVE 1 TO W77-EOF.                031600      
000453                                                                  031650      
000454 02-00105-GRABA-BASE.                                             031700      
000455*====================                                             031750      
000456        STORE S151B01SISDIA                                       031800      
000457              ON EXCEPTION                                        031900      
000458                 PERFORM 900000-CHE-STA.                          032000      
000459                                                                  037810      
000460 02-00130-FECHAS.                                                 037900      
000461*================                                                 038000      
000462  MOVE A01-R00-FECARCMOV(W77-IND) TO B01-SIS-FECARCMOV(W77-IND).  040200      
000463  MOVE A01-R00-NIVARCMOV(W77-IND) TO B01-SIS-NIVARCMOV(W77-IND).  040220      
000464  MOVE A01-R00-NIVBDSEM(W77-IND)  TO B01-SIS-NIVBDSEM(W77-IND).   040240      
000465  MOVE A01-R00-STAARCHLOG(W77-IND) TO B01-SIS-STAARCHLOG(W77-IND).040260      
000466                                                                  040300      
000467 02-00140-MUEVE-PACK.                                             040400      
000468*====================                                             040500      
000469     MOVE A01-R00-NOMPACSAL        TO B01-SIS-NOMPACSAL.          040700      
000470     MOVE A01-R00-NOMPACMOV        TO B01-SIS-NOMPACMOV.          040800      
000471     MOVE A01-R00-NOMPACDES        TO B01-SIS-NOMPACDES.          040900      
000472     MOVE A01-R00-NOMPACERR        TO B01-SIS-NOMPACERR.          041000      
000473 03-00100-GENERA-B02ARCINTER.                                     041700      
000474*============================                                     041800      
000475     MOVE ZERO                     TO W77-EOF.                    041900      
000476     OPEN INPUT  A02-B02ARCINTER.                                 042000      
000477     READ A02-B02ARCINTER AT END MOVE 1 TO W77-EOF.               042100      
000478     PERFORM 03-00110-GRABA-B02ARCINTER UNTIL W77-EOF = 1.        042200      
000479     CLOSE A02-B02ARCINTER WITH SAVE.                             042300      
000480                                                                  042400      
000481 03-00110-GRABA-B02ARCINTER.                                      042500      
000482*===========================                                      042600      
000483     MOVE 2                        TO W77-ERROR.                  042700      
000484     LOCK B02SXARCINTER                                           042800      
000485       AT B02-SIS-SISTEMA = A02-R00-SISTEMA                       042900      
000486       ON EXCEPTION                                               043000      
000487          IF DMSTATUS(NOTFOUND)                                   043100      
000488             MOVE ZERO             TO W77-ERROR                   043150      
000489             CREATE S151B02ARCINTER                               043200      
000490             MOVE A02-R00-SISTEMA TO  B02-SIS-SISTEMA             043250      
000491          ELSE                                                    043300      
000492             MOVE 1                TO W77-ERROR                   043400      
000493             PERFORM 900000-CHE-STA.                              043500      
000494     IF W77-ERROR = 0                                             043600      
000495        MOVE S151B02ARCINTER        TO A02-R00-ARCINTER           043700      
000496        STORE S151B02ARCINTER                                     043800      
000497           ON EXCEPTION                                           043900      
000498              PERFORM 900000-CHE-STA                              044000      
000499     ELSE                                                         044020      
000500        IF W77-ERROR = 2                                          044040      
000501           FREE S151B02ARCINTER ON EXCEPTION NEXT SENTENCE.       044060      
000502     READ A02-B02ARCINTER AT END MOVE 1 TO W77-EOF.               044100      
000503                                                                  044200      
000504 04-00100-GENERA-B03SISMEN.                                       044300      
000505*=========================                                        044400      
000506     MOVE ZERO                     TO W77-EOF.                    044500      
000507     OPEN INPUT  A03-B03SISMEN.                                   044600      
000508     READ A03-B03SISMEN AT END MOVE 1 TO W77-EOF.                 044700      
000509     PERFORM 04-00110-GRABA-B03SISMEN UNTIL W77-EOF = 1.          044800      
000510     CLOSE A03-B03SISMEN WITH SAVE.                               044900      
000511                                                                  045000      
000512 04-00110-GRABA-B03SISMEN.                                        045100      
000513*=========================                                        045200      
000514     MOVE 2                        TO W77-ERROR.                  045300      
000515     LOCK B03SXSISMEN                                             045400      
000516       AT B03-SIS-SISTEMA = A03-R00-SISTEMA                       045500      
000517       ON EXCEPTION                                               045600      
000518          IF DMSTATUS(NOTFOUND)                                   045700      
000519             MOVE ZERO            TO W77-ERROR                    045750      
000520             CREATE S151B03SISMEN                                 045800      
000521             MOVE A03-R00-SISTEMA  TO B03-SIS-SISTEMA             045900      
000522          ELSE                                                    046000      
000523             MOVE 1                TO W77-ERROR                   046100      
000524             PERFORM 900000-CHE-STA.                              046200      
000525     IF W77-ERROR = 0                                             046300      
000526        MOVE A03-R00-SISTEMA       TO B03-SIS-SISTEMA             046400      
000527        MOVE A03-R00-MODSIS        TO B03-SIS-MODSIS              046500      
000528        MOVE A03-R00-RESCSI        TO B03-SIS-RESCSI              046600      
000529        MOVE A03-R00-TIPBD         TO B03-SIS-TIPBD               046700      
000530        MOVE A03-R00-NUMCICDIA     TO B03-SIS-NUMCICDIA           046800      
000531        MOVE A03-R00-NUMCICMES     TO B03-SIS-NUMCICMES           046900      
000532        MOVE A03-R00-NOMBDSAL      TO B03-SIS-NOMBDSAL            047000      
000533        MOVE A03-R00-STABDSAL      TO B03-SIS-STABDSAL            047100      
000534        MOVE A03-R00-NOMBDMOVHI    TO B03-SIS-NOMBDMOVHI          047200      
000535        MOVE A03-R00-SECOKHI       TO B03-SIS-SECOKHI             047300      
000536        MOVE A03-R00-SECINFHI      TO B03-SIS-SECINFHI            047400      
000537        MOVE A03-R00-SECERRHI      TO B03-SIS-SECINFHI            047500      
000538        MOVE A03-R00-STABDMOVHI    TO B03-SIS-STABDMOVHI          047600      
000539        MOVE A03-R00-STABDSAL      TO B03-SIS-STABDSAL            047622      
000540        MOVE A03-R00-NOMBDMOVHI    TO B03-SIS-NOMBDMOVHI          047624      
000541        PERFORM 04-00111-BASES-CICLO                              047700      
000542                VARYING W77-IND FROM 1 BY 1                       047800      
000543                UNTIL   W77-IND > 5    OR                         047900      
000544                        W77-IND > B03-SIS-NUMCICDIA               048000      
000545                                                                  048100      
000546        STORE S151B03SISMEN                                       048200      
000547           ON EXCEPTION                                           048300      
000548              PERFORM 900000-CHE-STA                              048400      
000549     ELSE                                                         048420      
000550        IF W77-ERROR = 2                                          048440      
000551           FREE S151B03SISMEN ON EXCEPTION NEXT SENTENCE.         048460      
000552                                                                  048500      
000553     READ A03-B03SISMEN AT END MOVE 1     TO W77-EOF.             048600      
000554                                                                  048700      
000555 04-00111-BASES-CICLO.                                            048800      
000556*=====================                                            048900      
000557     MOVE A03-R00-NOMBDMOV(W77-IND) TO B03-SIS-NOMBDMOV(W77-IND). 049000      
000558     MOVE A03-R00-NOMBDMOV(W77-IND) TO B03-SIS-NUMBDMOV(W77-IND). 049100      
000559     MOVE A03-R00-AAMM(W77-IND)     TO B03-SIS-AAMM(W77-IND).     049200      
000560     MOVE A03-R00-SECOK(W77-IND)    TO B03-SIS-SECOK(W77-IND).    049300      
000561     MOVE A03-R00-SECINF(W77-IND)   TO B03-SIS-SECINF(W77-IND).   049400      
000562     MOVE A03-R00-SECERR(W77-IND)   TO B03-SIS-SECERR(W77-IND).   049500      
000563     MOVE A03-R00-STABDMOV(W77-IND) TO B03-SIS-STABDMOV(W77-IND). 049600      
000564                                                                  049660      
000565 05-00100-GENERA-B04SISTEM.                                       049700      
000566*===========================                                      049800      
000567     MOVE ZERO                     TO W77-EOF.                    049900      
000568     OPEN INPUT  A04-B04SISTEM.                                   050000      
000569     READ A04-B04SISTEM AT END MOVE 1 TO W77-EOF.                 050100      
000570     PERFORM 05-00110-GRABA-B04SISTEM  UNTIL W77-EOF = 1.         050200      
000571     CLOSE A04-B04SISTEM  WITH SAVE.                              050300      
000572                                                                  050400      
000573 05-00110-GRABA-B04SISTEM.                                        050500      
000574*=========================                                        050600      
000575     MOVE 2                        TO W77-ERROR.                  050700      
000576     LOCK B04SXNOMSIS                                             050800      
000577       AT B04-SIS-SISTEMA = A04-R00-SISTEMA                       050900      
000578       ON EXCEPTION                                               051000      
000579          IF DMSTATUS(NOTFOUND)                                   051100      
000580             MOVE ZERO             TO W77-ERROR                   051150      
000581             CREATE S151B04SISTEM                                 051200      
000582             MOVE A04-R00-SISTEMA  TO B04-SIS-SISTEMA             051250      
000583          ELSE                                                    051300      
000584             MOVE 1                TO W77-ERROR                   051400      
000585             PERFORM 900000-CHE-STA.                              051500      
000586     IF W77-ERROR = 0                                             051600      
000587        MOVE A04-R00-SISTEM        TO S151B04SISTEM               051700      
000588        STORE S151B04SISTEM                                       051800      
000589           ON EXCEPTION                                           051900      
000590              PERFORM 900000-CHE-STA                              052000      
000591     ELSE                                                         052020      
000592        IF W77-ERROR = 2                                          052040      
000593           FREE S151B04SISTEM ON EXCEPTION NEXT SENTENCE.         052060      
000594     READ A04-B04SISTEM AT END MOVE 1 TO W77-EOF.                 052100      
000595                                                                  052200      
000596 07-00100-GENERA-B05PROCESOS.                                     052205      
000597*============================                                     052210      
000598     MOVE ZERO                     TO W77-EOF.                    052215      
000599     OPEN INPUT  A06-B05PROCESOS.                                 052220      
000600     READ A06-B05PROCESOS AT END MOVE 1 TO W77-EOF.               052225      
000601     PERFORM 07-00110-GRABA-B05PROCESOS  UNTIL W77-EOF = 1.       052230      
000602     CLOSE A06-B05PROCESOS  WITH SAVE.                            052235      
000603                                                                  052240      
000604 07-00110-GRABA-B05PROCESOS.                                      052245      
000605*===========================                                      052250      
000606     MOVE 2                        TO W77-ERROR.                  052255      
000607     LOCK B05SXPROCESO                                            052260      
000608       AT B05-SIS-SISTEMA = A06-R00-SISTEMA                       052263      
000609       ON EXCEPTION                                               052266      
000610          IF DMSTATUS(NOTFOUND)                                   052269      
000611             MOVE ZERO             TO W77-ERROR                   052272      
000612             CREATE S151B05PROCESOS                               052275      
000613             MOVE A06-R00-SISTEMA  TO B05-SIS-SISTEMA             052278      
000614          ELSE                                                    052281      
000615             MOVE 1                TO W77-ERROR                   052282      
000616             PERFORM 900000-CHE-STA.                              052283      
000617     IF W77-ERROR = 0                                             052293      
000618***     MOVE A06-R00-SISTEMA       TO S151B05PROCESOS             052303      
000619        MOVE A06-R00-SISTEMA       TO B05-SIS-SISTEMA             052304      
000620        MOVE A06-R00-FCHPRO        TO B05-SIS-FCHPRO              052305      
000621        MOVE A06-R00-NUMPRO        TO B05-SIS-NUMPRO              052306      
000622        MOVE A06-R00-NOMPGM        TO B05-SIS-NOMPGM              052307      
000623        MOVE A06-R00-STAPGM        TO B05-SIS-STAPGM              052308      
000624        MOVE A06-R00-MIX           TO B05-SIS-MIX                 052309      
000625        MOVE A06-R00-FCHINI        TO B05-SIS-FCHINI              052310      
000626        MOVE A06-R00-HORAINI       TO B05-SIS-HORAINI             052311      
000627        MOVE A06-R00-FCHFIN        TO B05-SIS-FCHFIN              052312      
000628        MOVE A06-R00-HORAFIN       TO B05-SIS-HORAFIN             052313      
000629        MOVE A06-R00-NUMREGINI     TO B05-SIS-NUMREGINI           052314      
000630        MOVE A06-R00-NUMREGFIN     TO B05-SIS-NUMREGFIN           052315      
000631                                                                  052316      
000632        STORE S151B05PROCESOS                                     052323      
000633           ON EXCEPTION                                           052343      
000634              PERFORM 900000-CHE-STA                              052363      
000635     ELSE                                                         052383      
000636        IF W77-ERROR = 2                                          052403      
000637           FREE S151B05PROCESOS ON EXCEPTION NEXT SENTENCE.       052423      
000638     READ A06-B05PROCESOS AT END MOVE 1 TO W77-EOF.               052443      
000639                                                                  052463      
000640 06-00100-GENERA-B09CONXSIS.                                      052483      
000641*===========================                                      052503      
000642     MOVE ZERO                     TO W77-EOF.                    052523      
000643     OPEN INPUT A05-B09CONXSIS.                                   052543      
000644     READ A05-B09CONXSIS AT END MOVE 1 TO W77-EOF.                052563      
000645     PERFORM 06-00110-GRABA-B09CONXSIS UNTIL W77-EOF = 1.         052583      
000646     CLOSE A05-B09CONXSIS WITH SAVE.                              052900      
000647                                                                  053000      
000648 06-00110-GRABA-B09CONXSIS.                                       053100      
000649*==========================                                       053200      
000650     MOVE 2                        TO W77-ERROR.                  053300      
000651     LOCK B09SXCONXSIS                                            053400      
000652       AT B09-SIS-SISTEMA = A05-R00-SISTEMA                       053450      
000653       ON EXCEPTION                                               053500      
000654          IF DMSTATUS(NOTFOUND)                                   053600      
000655             CREATE S151B09CONXSIS                                053700      
000656             MOVE 0                TO W77-ERROR                   053750      
000657             MOVE A05-R00-SISTEMA  TO B09-SIS-SISTEMA             053770      
000658          ELSE                                                    053800      
000659             MOVE 1                TO W77-ERROR                   053900      
000660             PERFORM 900000-CHE-STA.                              054000      
000661     IF W77-ERROR = 0                                             054100      
000662        MOVE A05-R00-CONXSIS          TO S151B09CONXSIS           054200      
000663        STORE S151B09CONXSIS                                      054300      
000664           ON EXCEPTION                                           054400      
000665              PERFORM 900000-CHE-STA                              054500      
000666     ELSE                                                         054520      
000667        IF W77-ERROR = 2                                          054540      
000668           FREE S151B09CONXSIS ON EXCEPTION NEXT SENTENCE.        054560      
000669     READ A05-B09CONXSIS AT END MOVE 1 TO W77-EOF.                054600      
000670                                                                  054700      
000671*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000672* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO 78000.           054800      
000673 900000-CHE-STA.                                                  068000      
000674     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
000675     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
000676     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
000677                                                                  069300      
000678     IF WKS-ERR-DMSII > ZEROS                                     070000      
000679        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
000680                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
000681                           " " WKS-ERR-DMSII                      073000      
000682                "TIPO        " WKS-ERR-BD                         074000      
000683                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
000684        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
000685        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
000686                                                                  078000      
000687*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
