000001*$SET TADS                                                        000100      
000002*$SET OPTIMIZE                                                    000200      
000003******************************************************************000300      
000004*  GENERACION DE ARCHIVOS DE INTERFASE PARA PUNTEO CON OTRAS     *000400      
000005*  APLICACIONES.                                                 *000500      
000006*                                                                *000600      
000007*   FUNCIONES:                                                   *000700      
000008*     -RECIBIR POR PARAMETRO AL PROGRAMA EL NUMERO DE SISTEMA    *000800      
000009*      EN 3 POSICIONES NUMERICAS EJEMPLO ("500")                 *000900      
000010*     -ACCESAR LA LIBRERIA DE SOPORTECOMS PARA LA EXTRACCION DEL *001000      
000011*      NUMERO DE CSI                                             *001100      
000012*     -EXTRAER DE LA BASE DE CONTROL LA FECHA DE PROCESO DEL SIST*001200      
000013                                                                  001253      
000014*      ORIGEN DEL BASE B01SXSISDIA                               *001300      
000015                                                                  001353      
000016*     - EXTRAER EL NOMBRE DEL ARCHIVO DE MOVIMIENTOS             *001400      
000017***************************************************************** 001453      
000018*     - EXTRAER EL NOMBRE DEL ARCHIVO DE DESCRIPCIONES           *001500      
000019*  REGISTRO DEL ARCHIVO DE INTERFASE PARA S253 CUENTAS MOVILES  * 001553      
000020*     - ABRIR ARCHIVOS S263 , S264 Y S036                        *001600      
000021***************************************************************** 001653      
000022*     - CERRAR BD DE CONTROL                                     *001700      
000023*     -VERIFICAR LA RESIDENCIA DE LOS ARCHIVOS DE MOVIMIENTOS Y  *001800      
000024*      DATOS ADICIONALES                                         *001900      
000025*     -AL EFECUAR LA PRIMERA LECTURA DEL ARCHIVO DE MOVIMIENTOS  *002000      
000026*      VERIFICAR QUE LA FECHA DE PROCESO CORRESPONDA A LA FECHA  *002100      
000027*      DE ESTE REGISTRO DE HEADER. EN CASO CONTRARIO MANDAR UN   *002200      
000028*      MENSAJE Y DESCONTINUAR EL PROCESO.                        *002300      
000029*     -EFECTUAR LA PRIMERA LECTURA DEL ARCHIVO DE DATOS ADICIONA-*002400      
000030*      LES, VERIFICANDO VERIFICANDO QUE LA FECHA DE PROCESO CO-- *002500      
000031*      RRESPONDA A LA FECHA DEL HEADER EN CASO CONTRARIO MANDAR  *002600      
000032*      UN MENSAJE DE ERROR Y DESCONTINUAR EL PROCESO.            *002700      
000033*                                                                *002710      
000034* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *002712      
000035* 20141208 15MTP001 MJGRG                                        *002714      
000036******************************************************************002800      
000037 IDENTIFICATION DIVISION.                                         002900      
000038 PROGRAM-ID.      P135.                                           003000      
000039 AUTHOR.          ROBERTO HERNANDEZ MORENO.                       003100      
000040 INSTALLATION.    BANAMEX.                                        003200      
000041 DATE-WRITTEN.    FEBRERO 1996.                                   003300      
000042 ENVIRONMENT DIVISION.                                            003400      
000043 INPUT-OUTPUT SECTION.                                            003500      
000044 FILE-CONTROL.                                                    003600      
000045      SELECT L01-DATOS       ASSIGN TO DISK.                      003700      
000046      SELECT L01-DATOS-403   ASSIGN TO DISK.                      003710      
000047      SELECT L02-DATOS       ASSIGN TO DISK                       003800      
000048                             ACCESS MODE  IS RANDOM               003900      
000049                             ACTUAL KEY IS W77-NUM-REG.           004000      
000050      SELECT L03-DATOS       ASSIGN TO DISK.                      004100      
000051      SELECT L04-DATOS       ASSIGN TO DISK.                      004200      
000052      SELECT L05-DATOS       ASSIGN TO DISK.                      004300      
000053      SELECT L05-DATOS-MCH   ASSIGN TO DISK.                      004400      
000054      SELECT L07-DATOS       ASSIGN TO DISK.                      004500      
000055      SELECT L07-DATOS-MCH   ASSIGN TO DISK.                      004550      
000056      SELECT L07-DATOS-PAG   ASSIGN TO DISK.                      004575      
000057      SELECT A01-PBCOS-0410  ASSIGN TO DISK.                      004600      
000058      SELECT L08-DATOS       ASSIGN TO DISK.                      004700      
000059      SELECT L09-DATOS       ASSIGN TO DISK.                      004800      
000060      SELECT L10-DATOS       ASSIGN TO DISK.                      004900      
000061      SELECT L11-DATOS       ASSIGN TO DISK.                      005000      
000062      SELECT L12-DATOS       ASSIGN TO DISK.                      005050      
000063      SELECT ARCH-LISTC      ASSIGN TO DISK.                      005100      
000064      SELECT ARCH-SORTC      ASSIGN TO SORT DISK.                 005200      
000065      SELECT ARCH-CARAT      ASSIGN TO PRINTER.                   005300      
000066      SELECT V00-REPORTE2    ASSIGN TO PRINTER.                   005400      
000067      SELECT CMP-BANAM       ASSIGN TO DISK.                      005500      
000068      SELECT E04-FACTORAJE   ASSIGN TO DISK.                      005640      
000069      SELECT L13-SORIANA     ASSIGN TO DISK.                      005655      
000070      SELECT L14-MPS         ASSIGN TO DISK.                      005659      
000071      SELECT L15-DATOS       ASSIGN TO DISK.                      005661      
000072      SELECT FILTRO          ASSIGN TO DISK                       005675      
000073                             ORGANIZATION IS INDEXED              005680      
000074                             ACCESS MODE  IS RANDOM               005685      
000075                             RECORD KEY   IS LLAVE-CAT.           005690      
000076      SELECT A01-TLM-ARCHIVO ASSIGN TO DISK.                      005692      
000077*      SELECT A02-PG-ARCHIVO  ASSIGN TO DISK.                     005694      
000078      SELECT A03-PORTPG-INT    ASSIGN TO DISK.                    005695      
000079/                                                                 005700      
000080*** INI EAS 2023R03                                               005702      
000081      SELECT L16-DATOS       ASSIGN TO DISK.                      005704      
000082*** FIN EAS 2023R03                                               005706      
000083* INI EXTNET 2023 R11                                             005720      
000084      SELECT L17-EXTNET    ASSIGN TO DISK.                        005740      
000085      SELECT A05-AUTORIZACIONES    ASSIGN   TO DISK               005750      
000086                                   ORGANIZATION IS INDEXED        005752      
000087                                   ACCESS MODE IS DYNAMIC         005754      
000088                                   RECORD KEY  IS KEY-AUTS151.    005756      
000089* FIN EXTNET 2023 R11                                             005760      
000090 DATA DIVISION.                                                   005800      
000091 FILE SECTION.                                                    005900      
000092*                                                                 006000      
000093 FD A03-PORTPG-INT                                                006010      
000094*===============                                                  006020      
000095    VALUE OF TITLE            IS WKS-TITLE-PORTPG-INTELAR         006030      
000096    VALUE OF MAXRECSIZE       IS 52                               006040      
000097    BLOCK CONTAINS           42 RECORDS.                          006050      
000098    01 R06-PORTPG-INTELAR    PIC X(52).                           006060      
000099                                                                  006080      
000100 FD V00-REPORTE2                                                  006100      
000101    VALUE OF TITLE IS WKS-TIT-REPORTE2.                           006200      
000102                                                                  006300      
000103 01  V00-R00-REPORTE2             PIC X(132).                     006400      
000104                                                                  006500      
000105 FD L01-DATOS                                                     006600      
000106    VALUE OF TITLE   IS WKS-TIT-ARMOV                             006700      
000107    VALUE OF BUFFERS IS 1                                         006750      
000108    BLOCK CONTAINS   144 RECORDS.                                 006800      
000109 01  L01-DAT                    PIC X(450).                       006900      
000110*                                                                 007000      
000111 FD L01-DATOS-403                                                 007010      
000112    VALUE OF BUFFERS IS 1                                         007030      
000113    BLOCK CONTAINS   144 RECORDS.                                 007040      
000114 01  L01-DAT-403                PIC X(450).                       007050      
000115                                                                  007056      
000116 FD L02-DATOS                                                     007100      
000117    BLOCK CONTAINS   120 RECORDS                                  007200      
000118    VALUE OF BUFFERS IS 1                                         007250      
000119    VALUE OF TITLE   IS WKS-TIT-ARDES.                            007300      
000120 01  L02-DAT                    PIC X(540).                       007400      
000121*                                                                 007700      
000122 FD L03-DATOS                                                     007800      
000123     BLOCK CONTAINS 50 RECORDS                                    007900      
000124     VALUE OF AREAS 1000                                          008000      
000125     VALUE OF AREASIZE IS 6000                                    008100      
000126     VALUE OF TITLE IS WKS-TIT-SAL253CMAE.                        008200      
000127                                                                  008300      
000128 01  L03-DAT                               PIC X(180).            008400      
000129*                                                                 008500      
000130 FD L04-DATOS                                                     008600      
000131     BLOCK CONTAINS 50 RECORDS                                    008700      
000132     VALUE OF AREAS 1000                                          008800      
000133     VALUE OF AREASIZE IS 6000                                    008900      
000134     VALUE OF TITLE IS WKS-TIT-SAL253CHEQ.                        009000      
000135 01  L04-DAT                               PIC X(180).            009100      
000136*                                                                 009200      
000137 FD L05-DATOS                                                     009300      
000138     BLOCK CONTAINS 50 RECORDS                                    009400      
000139     VALUE OF AREAS 1000                                          009500      
000140     VALUE OF AREASIZE IS 6000                                    009600      
000141     VALUE OF TITLE IS WKS-TIT-SAL264CMAE.                        009700      
000142 01  L05-DAT                               PIC X(180).            009800      
000143                                                                  009900      
000144 FD L05-DATOS-MCH                                                 010000      
000145     BLOCK CONTAINS 50 RECORDS                                    010100      
000146     VALUE OF AREAS 1000                                          010200      
000147     VALUE OF AREASIZE IS 6000                                    010300      
000148     VALUE OF TITLE IS WKS-TIT-SAL264CMAE-MCH.                    010400      
000149 01  L05-DAT-MCH                           PIC X(180).            010500      
000150                                                                  010600      
000151 FD L07-DATOS                                                     010800      
000152    BLOCK CONTAINS 300 RECORDS                                    010900      
000153    RECORD CONTAINS 60 CHARACTERS                                 011000      
000154    VALUE OF AREAS 1000                                           011100      
000155    VALUE OF AREASIZE IS 6000                                     011200      
000156    VALUE OF SECURITYTYPE IS PUBLIC                               011300      
000157    VALUE OF TITLE IS WKS-TIT-SALS500.                            011400      
000158 01 L07-DAT                                PIC X(60).             011500      
000159                                                                  011510      
000160 FD L07-DATOS-MCH                                                 011520      
000161    BLOCK CONTAINS 50 RECORDS                                     011530      
000162    RECORD CONTAINS 180 CHARACTERS                                011540      
000163    VALUE OF AREAS 1000                                           011550      
000164    VALUE OF AREASIZE IS 6000                                     011560      
000165    VALUE OF SECURITYTYPE IS PUBLIC                               011570      
000166    VALUE OF TITLE IS WKS-TIT-SALS500-MCH.                        011580      
000167 01 L07-DAT-MCH                            PIC X(180).            011590      
000168*                                                                 011600      
000169                                                                  011605      
000170 FD L07-DATOS-PAG                                                 011610      
000171    BLOCK CONTAINS 50 RECORDS                                     011615      
000172    RECORD CONTAINS 180 CHARACTERS                                011620      
000173    VALUE OF AREAS 1000                                           011625      
000174    VALUE OF AREASIZE IS 6000                                     011630      
000175    VALUE OF SECURITYTYPE IS PUBLIC                               011635      
000176    VALUE OF TITLE IS WKS-TIT-SALS500-PAG.                        011640      
000177 01 L07-DAT-PAG                            PIC X(180).            011645      
000178                                                                  011650      
000179 FD A01-PBCOS-0410                                                011700      
000180    BLOCK CONTAINS 300 RECORDS                                    011800      
000181    RECORD CONTAINS 60 CHARACTERS                                 011900      
000182    VALUE OF AREAS 1000                                           012000      
000183    VALUE OF AREASIZE IS 6000                                     012100      
000184    VALUE OF SECURITYTYPE IS PUBLIC                               012200      
000185    VALUE OF TITLE IS WKS-TIT-PBCOS-0410.                         012300      
000186 01 A01-R01-PBCOS-0410                     PIC X(108).            012400      
000187                                                                  012500      
000188 FD L08-DATOS                                                     012600      
000189     BLOCK CONTAINS 50 RECORDS                                    012700      
000190     VALUE OF AREAS 1000                                          012800      
000191     VALUE OF AREASIZE IS 6000                                    012900      
000192     VALUE OF TITLE IS WKS-TIT-SAL036CHEQ.                        013000      
000193 01  L08-DAT                               PIC X(180).            013100      
000194*                                                                 013200      
000195 FD L09-DATOS                                                     013300      
000196     BLOCK CONTAINS 50 RECORDS                                    013400      
000197     VALUE OF AREAS 1000                                          013500      
000198     VALUE OF AREASIZE IS 6000                                    013600      
000199     VALUE OF TITLE IS WKS-TIT-SALIDAFOTR.                        013700      
000200 01  L09-DAT                               PIC X(180).            013800      
000201*                                                                 013900      
000202 FD L10-DATOS                                                     014000      
000203     BLOCK CONTAINS 50 RECORDS                                    014100      
000204     VALUE OF AREAS 1000                                          014200      
000205     VALUE OF AREASIZE IS 6000                                    014300      
000206     VALUE OF TITLE IS WKS-TIT-SALIDAFORE.                        014400      
000207 01  L10-DAT                               PIC X(180).            014500      
000208                                                                  014600      
000209 FD L11-DATOS                                                     014700      
000210     BLOCK CONTAINS 50 RECORDS                                    014800      
000211     VALUE OF AREAS 1000                                          014900      
000212     VALUE OF AREASIZE IS 6000                                    015000      
000213     VALUE OF TITLE IS WKS-TIT-SAL054CMAEYMAO.                    015100      
000214 01  L11-DAT                               PIC X(180).            015200      
000215*                                                                 015300      
000216*** INI EAS 2023R03                                               015302      
000217 FD L16-DATOS                                                     015304      
000218     BLOCK CONTAINS 50 RECORDS                                    015306      
000219     VALUE OF AREAS 1000                                          015308      
000220     VALUE OF AREASIZE IS 6000                                    015310      
000221     VALUE OF TITLE IS WKS-TITLE-EAS-ARCHIVO.                     015312      
000222 01  L16-DAT                               PIC X(180).            015314      
000223*** FIN EAS 2023R03                                               015316      
000224* INI EXTNET 2023 R11                                             015320      
000225 FD L17-EXTNET                                                    015330      
000226     BLOCK CONTAINS 210 RECORDS                                   015340      
000227     VALUE OF AREAS 1000                                          015350      
000228     VALUE OF AREASIZE IS 6000                                    015360      
000229     VALUE OF TITLE IS WKS-TITLE-EXTNET-ARCHIVO.                  015370      
000230 01  L17-DAT-EXTNET                        PIC X(300).            015380      
000231                                                                  015382      
000232 FD A05-AUTORIZACIONES                                            015384      
000233    BLOCK CONTAINS   120 RECORDS                                  015390      
000234    RECORD CONTAINS  12 CHARACTERS                                015400      
000235    VALUE OF TITLE       IS WKS-TIT-AUTORIZA.                     015410      
000236                                                                  015420      
000237  01 R01-REG-AUTORIZA.                                            015430      
000238    03 KEY-AUTS151.                                               015435      
000239       05 R01-REG-AUTS500EXT      PIC 9(08).                      015440      
000240    03 FILLER                     PIC 9(04).                      015445      
000241* FIN EXTNET 2023 R11                                             015460      
000242 FD ARCH-LISTC                                                    015470      
000243    BLOCK CONTAINS   30 RECORDS                                   015500      
000244    RECORD CONTAINS  24 CHARACTERS.                               015600      
000245 01 FD-ARCH-LISTC.                                                015700      
000246    03 ARCH-LIS-MON   PIC 9(03).                                  015800      
000247    03 ARCH-LIS-ORI   PIC 9(01).                                  015900      
000248    03 ARCH-LIS-AFC   PIC 9(01).                                  016000      
000249    03 ARCH-LIS-IMP   PIC 9(16)V99.                               016100      
000250    03 FILLER         PIC X(01).                                  016200      
000251*                                                                 016300      
000252 FD CMP-BANAM                                                     016400      
000253     VALUE OF TITLE IS WKS-TIT-BNX.                               016500      
000254 01 REG-BNX                                PIC X(180).            016600      
000255                                                                  016700      
000256 FD L12-DATOS                                                     016705      
000257    BLOCK CONTAINS 300 RECORDS                                    016710      
000258    RECORD CONTAINS 60 CHARACTERS                                 016715      
000259    VALUE OF AREAS 1000                                           016720      
000260    VALUE OF AREASIZE IS 6000                                     016725      
000261    VALUE OF SECURITYTYPE IS PUBLIC                               016730      
000262    VALUE OF TITLE IS WKS-TIT-SALS707.                            016735      
000263 01 L12-DAT                                PIC X(60).             016740      
000264 SD ARCH-SORTC.                                                   017200      
000265 01 REG-SORTC.                                                    017300      
000266    03 ST-MONEDA          PIC 9(03).                              017400      
000267    03 FILLER             PIC X(21).                              017500      
000268*                                                                 017600      
000269 FD ARCH-CARAT                                                    017700      
000270    VALUE OF TITLE IS WS-ARCH-CARAT                               017800      
000271    USERBACKUPNAME IS TRUE                                        017900      
000272    LABEL RECORD IS STANDARD                                      018000      
000273    RECORD CONTAINS 132 CHARACTERS.                               018100      
000274 01 FD-ARCH-CARAT         PIC X(132).                             018200      
000275*                                                                 018300      
000276 FD E04-FACTORAJE                                                 018314      
000277    VALUE OF SECURITYTYPE IS PUBLIC                               018316      
000278    BLOCK CONTAINS           100 RECORDS.                         018318      
000279 01 E04-REG-CONCILIA.                                             018322      
000280    03 A00-440-CONTRATO    PIC 9(12)     .                        018323      
000281    03 A00-440-FOLIO-S403  PIC 9(04)     .                        018324      
000282    03 A00-440-TASAREF     PIC 9(06)V99  .                        018325      
000283    03 A00-440-CSI-ORIGEN  PIC 9(02)     .                        018326      
000284    03 A00-440-SUCOPER     PIC 9(04)     .                        018330      
000285    03 A00-440-CAJAOPER    PIC 9(04)     .                        018334      
000286    03 A00-440-PRODUCTO    PIC 9(04)     .                        018338      
000287    03 A00-440-INSTRUMENTO PIC 9(02)     .                        018342      
000288    03 A00-440-FONDO       PIC 9(02)     .                        018346      
000289    03 A00-440-AUTORIZA    PIC 9(18)     .                        018350      
000290    03 A00-440-CONCEPTO    PIC 9(04)     .                        018354      
000291    03 A00-440-MONEDA      PIC 9(04)     .                        018358      
000292    03 A00-440-REFERENCIA  PIC X(09)     .                        018362      
000293    03 A00-440-IMPORTE     PIC 9(14)V9(02).                       018366      
000294    03 A00-440-TIPO-PROC   PIC 9(02)     .                        018370      
000295    03 A00-440-MDA-SUC     PIC 9(04)     .                        018374      
000296    03 A00-440-MDA-CTA     PIC 9(16)     .                        018378      
000297    03 A00-440-HORMOV      PIC 9(06)     .                        018382      
000298    03 A00-440-FECMOV      PIC 9(08)     .                        018386      
000299    03 A00-440-CVETRAN     PIC 9(08)     .                        018388      
000300    03 A00-440-ORIGEN      PIC 9(02)     .                        018390      
000301    03 A00-440-SISTEMA     PIC 9(04)     .                        018392      
000302    03 A00-440-ESPACIO     PIC X(01)     .                        018393      
000303                                                                  018400      
000304  FD L13-SORIANA                                                  018402      
000305     BLOCK CONTAINS 495 RECORDS                                   018403      
000306     RECORD CONTAINS 132 CHARACTERS                               018404      
000307     VALUE OF TITLE IS WKS-TIT-SALSORIANA.                        018406      
000308  01  L13-DAT                               PIC X(132).           018408      
000309                                                                  018410      
000310 FD L14-MPS                                                       018412      
000311    BLOCK CONTAINS 300 RECORDS                                    018414      
000312    RECORD CONTAINS 180 CHARACTERS                                018416      
000313    VALUE OF TITLE IS WKS-TIT-SALMPS.                             018418      
000314 01 L14-DAT                                PIC X(180).            018420      
000315                                                                  018422      
000316 FD L15-DATOS                                                     018424      
000317    BLOCK CONTAINS 300 RECORDS                                    018426      
000318    RECORD CONTAINS 180 CHARACTERS                                018428      
000319    VALUE OF TITLE IS WKS-TIT-SAL253-CMOV.                        018430      
000320 01 L15-DAT                                PIC X(180).            018432      
000321                                                                  018436      
000322 FD FILTRO                                                        018438      
000323    BLOCK  CONTAINS  45 RECORDS.                                  018440      
000324 01 LLAVE-CAT.                                                    018442      
000325    05 CAT-SUC-INIC    PIC 9(04).                                 018450      
000326    05 CAT-CAJA-INIC   PIC 9(04).                                 018480      
000327                                                                  018482      
000328  FD A01-TLM-ARCHIVO                                              018484      
000329    VALUE OF SECURITYTYPE IS PUBLIC                               018486      
000330    VALUE OF BUFFERS IS 1                                         018488      
000331    BLOCK CONTAINS   144 RECORDS                                  018490      
000332    VALUE OF TITLE IS WKS-TITLE-TLM-ARCHIVO.                      018492      
000333 01 A01-REG-TLM-ARCHIVO.                                          018494      
000334    03 A01-TLM-LEDGER                  PIC X(01).                 018496      
000335    03 A01-TLM-SEPA1                   PIC X(01).                 018498      
000336    03 A01-TLM-FECOPERACION            PIC 9(06).                 018500      
000337    03 A01-TLM-SEPA2                   PIC X(01).                 018502      
000338    03 A01-TLM-SALDOINICIAL            PIC 9(16).99.              018504      
000339    03 A01-TLM-SEPA3                   PIC X(01).                 018506      
000340    03 A01-TLM-FECSALDOINI             PIC 9(06).                 018508      
000341    03 A01-TLM-SEPA4                   PIC X(01).                 018510      
000342    03 A01-TLM-INDSALDOINI             PIC X(01).                 018512      
000343    03 A01-TLM-SEPA5                   PIC X(01).                 018514      
000344    03 A01-TLM-INDTRANS                PIC X(01).                 018516      
000345    03 A01-TLM-SEPA6                   PIC X(01).                 018518      
000346    03 A01-TLM-MONTOTRANS              PIC 9(16).99.              018520      
000347    03 A01-TLM-SEPA7                   PIC X(01).                 018522      
000348    03 A01-TLM-SALDOFINAL              PIC 9(16).99.              018524      
000349    03 A01-TLM-SEPA8                   PIC X(01).                 018526      
000350    03 A01-TLM-FECSALDOFIN             PIC 9(06).                 018528      
000351    03 A01-TLM-SEPA9                   PIC X(01).                 018530      
000352    03 A01-TLM-INDSALDOFIN             PIC X(01).                 018532      
000353    03 A01-TLM-SEPA10                  PIC X(01).                 018534      
000354    03 A01-TLM-FECCREATRANS            PIC 9(06).                 018536      
000355    03 A01-TLM-SEPA11                  PIC X(01).                 018538      
000356    03 A01-TLM-AUTORIZA                PIC 9(18).                 018540      
000357    03 A01-TLM-SEPA12                  PIC X(01).                 018542      
000358    03 A01-TLM-PREFIJOMEDACC           PIC 9(04).                 018544      
000359    03 A01-TLM-SEPA13                  PIC X(01).                 018546      
000360    03 A01-TLM-MEDIOACCESO             PIC 9(16).                 018548      
000361    03 A01-TLM-SEPA14                  PIC X(01).                 018550      
000362    03 A01-TLM-INDMONEDA               PIC X(03).                 018552      
000363    03 A01-TLM-SEPA15                  PIC X(01).                 018554      
000364                                                                  018556      
000365* FD A02-PG-ARCHIVO                                               018558      
000366*    VALUE OF SECURITYTYPE IS PUBLIC                              018560      
000367*    VALUE OF BUFFERS IS 1                                        018562      
000368*    BLOCK CONTAINS   144 RECORDS                                 018564      
000369*    VALUE OF TITLE IS WKS-TITLE-PG-ARCHIVO.                      018566      
000370* 01 A01-REG-PG-ARCHIVO.                                          018568      
000371*     03 A02-PG-FECMOV                  PIC 9(08).                018570      
000372*     03 A02-PG-SEPA1                   PIC X(01).                018572      
000373*     03 A02-PG-HORMOV                  PIC 9(06).                018574      
000374*     03 A02-PG-SEPA2                   PIC X(01).                018576      
000375*     03 A02-PG-CVETRAN                 PIC 9(06).                018578      
000376*     03 A02-PG-SEPA3                   PIC X(01).                018580      
000377*     03 A02-PG-SUC-INIC                PIC 9(04).                018582      
000378*     03 A02-PG-SEPA4                   PIC X(01).                018584      
000379*     03 A02-PG-MONEDA                  PIC 9(04).                018586      
000380*     03 A02-PG-SEPA5                   PIC X(01).                018588      
000381*     03 A02-PG-MDA-SUC                 PIC 9(04).                018590      
000382*     03 A02-PG-SEPA6                   PIC X(01).                018592      
000383*     03 A02-PG-MDA-CTA                 PIC 9(16).                018594      
000384*     03 A02-PG-SEPA7                   PIC X(01).                018596      
000385*     03 A02-PG-STATUS                  PIC 9(02).                018598      
000386*     03 A02-PG-SEPA8                   PIC X(01).                018600      
000387*     03 A02-PG-AUTORIZA                PIC 9(18).                018602      
000388*     03 A02-PG-SEPA9                   PIC X(01).                018604      
000389*     03 A02-PG-IMPORTE                 PIC 9(16).99.             018606      
000390*     03 A02-PG-SEPA10                  PIC X(01).                018608      
000391*     03 A02-PG-BCO-ORI                 PIC 9(05).                018610      
000392*     03 A02-PG-SEPA11                  PIC X(01).                018612      
000393*     03 A02-PG-BCO-DES                 PIC 9(05).                018614      
000394*     03 A02-PG-SEPA12                  PIC X(01).                018616      
000395*     03 A02-PG-CVECAUSA                PIC 9(04).                018618      
000396*     03 A02-PG-SEPA13                  PIC X(01).                018620      
000397*     03 A02-PG-CAJA-INIC               PIC 9(04).                018622      
000398*     03 A02-PG-SEPA14                  PIC X(01).                018624      
000399*     03 A02-PG-CLIENTE                 PIC 9(12).                018626      
000400*     03 A02-PG-SEPA15                  PIC X(01).                018628      
000401*     03 A02-PG-NOM-BENEF-IDEN          PIC X(55).                018630      
000402*     03 A02-PG-SEPA16                  PIC X(01).                018632      
000403*                                                                 018636      
000404 WORKING-STORAGE SECTION.                                         018638      
000405*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000406*   COPY "(S151)S151/CRONOS2K/CPY/WS   ON CMEMP.".                018700      
000407******************************************************************000100      
000408** This copyBook defines all the additional variables that      **000200      
000409** Unisys has defined for the CRONOS2K project                  **000300      
000410** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000411******************************************************************000500      
000412                                                                  000600      
000413******************************************************************000700      
000414** These Variables are used to Accept the system date in long   **000800      
000415** format and get the century information                       **000900      
000416** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000417 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000418 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000419    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000420    05 FILLER      PIC X(1).                                      001400      
000421    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000422    05 FILLER      PIC X(1).                                      001600      
000423    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000424    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000425      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000426      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000427******************************************************************002100      
000428                                                                  002200      
000429******************************************************************002300      
000430** This variable defines a date in the format MMDDCCAA          **002400      
000431**                                                              **002500      
000432 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000433 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000434    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000435    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000436    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000437    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000438      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000439      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000440******************************************************************003400      
000441                                                                  003500      
000442******************************************************************003600      
000443** This variable defines a date in the format CCAAMMDD          **003700      
000444**                                                              **003800      
000445 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000446 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000447    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000448    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000449      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000450      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000451    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000452    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000453******************************************************************004700      
000454                                                                  004800      
000455******************************************************************004900      
000456** This variable defines a date in the format DDMMCCAA          **005000      
000457**                                                              **005100      
000458 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000459 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000460    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000461    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000462    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000463    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000464      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000465      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000466******************************************************************006000      
000467                                                                  006100      
000468******************************************************************006200      
000469** This variable defines a date in the Julian Format CCAADDD    **006300      
000470**                                                              **006400      
000471 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000472 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000473    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000474    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000475                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000476      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000477      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000478    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000479******************************************************************007300      
000480                                                                  007400      
000481******************************************************************007500      
000482** This variable defines a date in the format AAMMDD            **007600      
000483**                                                              **007700      
000484 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000485 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000486    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000487    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000488    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000489******************************************************************008300      
000490                                                                  008400      
000491******************************************************************008500      
000492** This variable defines a date in the format MMDDAA            **008600      
000493**                                                              **008700      
000494 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000495 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000496    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000497    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000498    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000499******************************************************************009300      
000500                                                                  009400      
000501******************************************************************009500      
000502** This variable defines a date in the format DDMMAA            **009600      
000503**                                                              **009700      
000504 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000505 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000506    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000507    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000508    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000509******************************************************************010300      
000510                                                                  010400      
000511******************************************************************010500      
000512** These variables are defined to be used for CALL bridge logic **010600      
000513**                                                              **010700      
000514 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000515 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000516 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000517 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000518 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000519 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000520******************************************************************011400      
000521                                                                  011500      
000522******************************************************************011600      
000523** This variable is used for converting only a year field AA to **011700      
000524** CCAA and a CCAA to AA                                        **011800      
000525 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000526 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000527    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000528    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000529 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000530 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000531******************************************************************012300      
000532                                                                  012400      
000533******************************************************************012500      
000534** These variables are Bridge Variables for Intercambio files   **012600      
000535** para EDOCTA                                                  **012700      
000536 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000537 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000538 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000539 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000540 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000541 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000542 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000543******************************************************************013500      
000544* Para MODULO                                                     013600      
000545 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000546******************************************************************013800      
000547******************************************************************013900      
000548** Para FMOVSCHABO                                                014000      
000549 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000550******************************************************************014200      
000551                                                                  014300      
000552******************************************************************014400      
000553***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000554******************************************************************014600      
000555                                                                  014700      
000556 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000557 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000558     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000559     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000560     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000561******************************************************************015300      
000562                                                                  015400      
000563******************************************************************015500      
000564***  These Variables Are Defined For Date In AAMM Format       ***015600      
000565******************************************************************015700      
000566                                                                  015800      
000567 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000568 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000569     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000570     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000571******************************************************************016300      
000572                                                                  016400      
000573                                                                  016500      
000574*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000575  01  A2K-BASE-YEAR     PIC 9(02) VALUE   50.                     018800      
000576                                                                  019000      
000577*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000578* COPY "(S151)S151/FORMATO/DISPLAY ON CMEMP.".                    019100      
000579                                                                  000100      
000580*===============================================================* 000200      
000581*         FORMATO PARA DISPLAYS                                 * 000300      
000582*===============================================================* 000400      
000583                                                                  000500      
000584 01 WKS-TIT-REPORTE2.                                             000600      
000585    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000586    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000587    02 FILLER                       PIC X(06) VALUE               000900      
000588                                              "/LIST/".           001000      
000589    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000590    02 FILLER                       PIC X(01) VALUE "/".          001071      
000591    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000592    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000593    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000594    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000595    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000596    02 FILLER                       PIC X(11) VALUE               001600      
000597                                              "/001MSGIMP.".      001700      
000598                                                                  002100      
000599 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000600                                                                  002300      
000601***********************************************************       002400      
000602*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000603***********************************************************       002600      
000604 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000605*8D                                                               002800      
000606 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000607 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000608    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000609    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000610    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000611*8D                                                               003400      
000612 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000613 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000614    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000615    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000616    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000617                                                                  004100      
000618 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000619                                                                  004300      
000620 01 WKS-FECHA-HORA2.                                              004400      
000621    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000622    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000623       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000624       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000625    02 WKS-TIME-MAQ2.                                             004600      
000626       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000627       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000628          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000629          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000630          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000631       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000632    02 FILLER                             PIC X(01).              004900      
000633    02 WKS-RESTO2                         PIC X(04).              005000      
000634                                                                  005100      
000635*8D                                                               005200      
000636****************** REPORTE DE MENSAJES *********************      005300      
000637 01 WLI-ENCAB-12.                                                 005400      
000638    03 FILLER                             PIC X(05) VALUE         005500      
000639       "S151-".                                                   005600      
000640    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000641    03 FILLER                             PIC X(15) VALUE         005671      
000642       "-001IMPMENSAJES".                                         005691      
000643    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000644    03 FILLER                             PIC X(34) VALUE         005800      
000645       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000646    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000647    03 FILLER                             PIC X(26) VALUE         006100      
000648       "FECHA DE LA INFORMACION : ".                              006200      
000649    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000650    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000651       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000652       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000653       05  WKS-SLASH1                         PIC X(01).          006356      
000654       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000655       05  WKS-SLASH2                         PIC X(01).          006358      
000656       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000657 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000658 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000659    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000660    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000661    03 FILLER                          PIC X(01).                 006371      
000662    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000663    03 FILLER                          PIC X(01).                 006381      
000664    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000665*8D                                                               006400      
000666 01 WLI-ENCAB-22.                                                 006500      
000667     03 FILLER                          PIC X(11) VALUE           006600      
000668        "F.PROCESO: ".                                            006700      
000669     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000670     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000671     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000672     03 FILLER                          PIC X(01) VALUE ":".      007020      
000673     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000674     03 FILLER                          PIC X(01) VALUE ":".      007060      
000675     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000676     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000677     03 FILLER                          PIC X(24) VALUE           007200      
000678              "IMPRESION MENSAJES DEL S".                         007300      
000679     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000680     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000681     03 FILLER                          PIC X(14) VALUE           007600      
000682        "TIPO PROCESO: ".                                         007700      
000683     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000684*8D                                                               007900      
000685 01 WLI-ENCAB-32.                                                 008000      
000686     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000687*       "VERSION  : ".                                            008200      
000688*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000689     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000690     03 FILLER                     PIC X(07) VALUE                008500      
000691        "HOJA : ".                                                008600      
000692     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000693                                                                  008800      
000694 01 WLI-ENCAB-42.                                                 008900      
000695     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000696     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000697     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000698                                                                  009300      
000699 01 WLI-ENCAB-52.                                                 009400      
000700    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000701    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000702    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000703    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000704                                                                  009900      
000705*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000706 01 WLI-ENCAB-62.                                                 009910      
000707    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000708    03 WLI-RESULT                 PIC X(04).                      009920      
000709    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000710    03 WLI-TEXTO                  PIC X(110).                     009930      
000711                                                                  009935      
000712 01 WLI-TOT-ENVIO.                                                009940      
000713    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000714    03 FILLER                     PIC X(37) VALUE                 009950      
000715       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000716    03 WLI-ENV-CTD                PIC X(04).                      009960      
000717*FIN - INFOWARE                                                   009970      
000718****************************************************************  010000      
000719*                 CONTADORES DE HOJAS                          *  010100      
000720****************************************************************  010200      
000721                                                                  010300      
000722  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000723*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000724*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000725* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS/S500/CLIENTESCITID      019120      
000726*-      " ON CMEMP.".                                             019150      
000727******************************************************************000100      
000728**  FORMATO DE ARCHIVO OVERNIGHT DE EXTENDED NETWORK DAHLIA     **000200      
000729**        S151/FORMATO/ARCHIVO/MOVTOS/S500/CLIENTESCITID        **000300      
000730**  NOMBRE ARCHIVO :                                            **000400      
000731** (S500)S500/FILE/INTS/500xxS01/csi/MOVTOSCTECITID/aammdd      **000500      
000732**                 MOVIMIENTOS DE LO OPERADO POR AMBAS MONEDAS  **000600      
000733**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS DEL S500-S151-DAHLIA **000700      
000734**             LONGITUD DEL REGISTRO 300 CARACTERES             **000800      
000735******************************************************************000900      
000736                                                                  001000      
000737******************************************************************001100      
000738*   REGISTRO DEL ARCHIVO DE INTERFACE PARA S500 CLIENTESCITID    *001200      
000739******************************************************************001300      
000740                                                                  001400      
000741 01 500-R01-HDR-CLIENTESCITID.                                    001500      
000742    03 500-R01-TIPREG           PIC 9(01)  VALUE 1.               001600      
000743    03 500-R01-SISORI           PIC X(04)  VALUE "S151".          001700      
000744    03 500-R01-NODORI           PIC 9(02).                        001800      
000745    03 500-R01-FECPRO           PIC 9(06).                        001900      
000746    03 500-R01-HORARC           PIC 9(06).                        002000      
000747    03 500-R01-DESCARC          PIC X(26).                        002100      
000748    03 500-R01-FILLER           PIC X(255) VALUE SPACES.          002200      
000749                                                                  002300      
000750 01 500-R02-DET-CLIENTESCITID WITH LOWER-BOUNDS.                  002400      
000751    03 500-R02-TIPREG           PIC 9(01)  VALUE 2.               002500      
000752    03 500-R02-SECDET           PIC 9(08).                        002600      
000753    03 500-R02-FUNCION          PIC 9(02).                        002700      
000754    03 500-R02-SUCOPE           PIC 9(04).                        002800      
000755    03 500-R02-CAJOPE           PIC 9(02).                        002900      
000756    03 500-R02-SUCTRA           PIC 9(04).                        003000      
000757    03 500-R02-CAJTRA           PIC 9(02).                        003100      
000758    03 500-R02-NUMAUT           PIC 9(08).                        003200      
000759    03 500-R02-CVETRA           PIC 9(04).                        003300      
000760    03 500-R02-TIPMOV           PIC 9(01).                        003400      
000761    03 500-R02-TIPMDA           PIC 9(02).                        003500      
000762    03 500-R02-MEDACC           PIC 9(16).                        003600      
000763    03 500-R02-MEDACC-RED       REDEFINES 500-R02-MEDACC.         003700      
000764       05 500-R02-PREFSUC       PIC 9(04).                        003800      
000765       05 500-R02-CTOCTA        PIC 9(12).                        003900      
000766    03 500-R02-IMPTRAN          PIC 9(14)V99.                     004000      
000767    03 500-R02-MONEDA           PIC 9(03).                        004100      
000768    03 500-R02-REFNUM           PIC 9(18).                        004200      
000769    03 500-R02-FECMOV           PIC 9(08).                        004300      
000770    03 500-R02-HOVMOV           PIC X(08).                        004400      
000771    03 500-R02-FECCONT          PIC 9(08).                        004500      
000772    03 500-R02-ORIGEN           PIC 9(02).                        004600      
000773    03 500-R02-AUT-S151         PIC 9(08).                        004700      
000774    03 500-R02-AUT-AELIM-S151   PIC 9(08).                        004800      
000775    03 500-R02-TIP-PROC         PIC 9(02).                        004900      
000776    03 500-R02-IND-LEY          PIC 9(02).                        005000      
000777    03 500-R02-LEYENDA          PIC X(40).                        005100      
000778    03 500-R02-REF-ALFANUM      PIC X(35).                        005200      
000779    03 500-R02-SIS-ORIG         PIC 9(04).                        005300      
000780    03 500-R02-STATUS           PIC 9(02).                        005400      
000781    03 500-R02-DESC-STAMOV      PIC X(30).                        005500      
000782    03 500-R02-SISTEMA          PIC 9(04).                        005600      
000783    03 500-R02-PRODUCTO         PIC 9(04).                        005700      
000784    03 500-R02-INSTRUMENTO      PIC 9(02).                        005800      
000785    03 500-R02-FILLER           PIC X(42) VALUE SPACES.           005900      
000786                                                                  006000      
000787 01 500-R03-TRA-CLIENTESCITID.                                    006100      
000788    03 500-R03-TIPREG           PIC 9(01)  VALUE 3.               006200      
000789    03 500-R03-NUMABOMN         PIC 9(08).                        006300      
000790    03 500-R03-TOTABOMN         PIC 9(16)V99.                     006400      
000791    03 500-R03-NUMCARMN         PIC 9(08).                        006500      
000792    03 500-R03-TOTCARMN         PIC 9(16)V99.                     006600      
000793    03 500-R03-NUMNCONTMN       PIC 9(08).                        006700      
000794    03 500-R03-NUMABODLS        PIC 9(08).                        006800      
000795    03 500-R03-TOTABODLS        PIC 9(16)V99.                     006900      
000796    03 500-R03-NUMCARDLS        PIC 9(08).                        007000      
000797    03 500-R03-TOTCARDLS        PIC 9(16)V99.                     007100      
000798    03 500-R03-NUMNCONTDLS      PIC 9(08).                        007200      
000799    03 500-R03-ELIM-NUMABOMN    PIC 9(08).                        007300      
000800    03 500-R03-ELIM-TOTABOMN    PIC 9(16)V99.                     007400      
000801    03 500-R03-ELIM-NUMCARMN    PIC 9(08).                        007500      
000802    03 500-R03-ELIM-TOTCARMN    PIC 9(16)V99.                     007600      
000803    03 500-R03-ELIM-NUMNCONTMN  PIC 9(08).                        007700      
000804    03 500-R03-ELIM-NUMABODLS   PIC 9(08).                        007800      
000805    03 500-R03-ELIM-TOTABODLS   PIC 9(16)V99.                     007900      
000806    03 500-R03-ELIM-NUMCARDLS   PIC 9(08).                        008000      
000807    03 500-R03-ELIM-TOTCARDLS   PIC 9(16)V99.                     008100      
000808    03 500-R03-ELIM-NUMNCONTDLS PIC 9(08).                        008200      
000809    03 500-R03-FILLER           PIC X(59) VALUE SPACES.           008300      
000810*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000811                                                                  019200      
000812******************************************************************019300      
000813*                VARIABLES DE DIVERSO USO                        *019400      
000814******************************************************************019500      
000815 77 W77-ERROR-CAT                          PIC 9     VALUE 0.     019600      
000816 77 W77-FIN                                PIC 9     VALUE 0.     019700      
000817 77 W77-FIN-25                             PIC 9     VALUE 0.     019800      
000818 77 W77-OPER-CMP                           PIC 9(09) VALUE 0.     019900      
000819 77 W77-INST-CMP                           PIC 9(03) VALUE 0.     020000      
000820 77 W77-NREG-BNX                           PIC 9(7)  VALUE 0.     020100      
000821*bmr77 W77-NREG-BMR                        PIC 9(7)  VALUE 0.     020200      
000822 77 W77-IMPT-BNX                           PIC 9(16)V99 VALUE 0.  020300      
000823 77 W77-NTRANS-BNX                         PIC 9(05).             020500      
000824 77 W77-FILETYPE                           PIC 9     VALUE 7.     020700      
000825 77 W77-IND                                PIC 9(04) VALUE 0.     020800      
000826 77 W77-IND2                               PIC 9(02).             020850      
000827 77 W77-EOF                                PIC 9(01) VALUE 0.     020900      
000828 77 W77-FEC-PROCESO                        PIC 9(08).             021200      
000829 77 W77-NUM-DIA                            PIC 9(02) COMP.        021400      
000830 77 W77-NUM-CSI                            PIC 9(02).             021500      
000831 77 W77-STATUS-BASE                        PIC 9(06).             021600      
000832 77 W77-ERROR-BASE                         PIC 9(06).             021700      
000833 77 W77-SIS-FECPRO                         PIC 9(08).             022000      
000834 77 W77-IND3                               PIC 9(06) VALUE 0.     022200      
000835 77 W77-TOT-CVES                           PIC 9(06) VALUE 0.     022300      
000836 77 W77-INDICE                             PIC 9(05) VALUE 0.     022400      
000837 77 W77-LIM-SUP                            PIC 9(05) VALUE 0.     022500      
000838 77 W77-LIM-INF                            PIC 9(05) VALUE 0.     022600      
000839 77 W77-MAX-CVES                           PIC 9(05) VALUE 0.     022700      
000840 77 W77-AFC                                PIC 9(04) VALUE 0.     022800      
000841 77 W77-AFC-PBCOS                          PIC 9(04) VALUE 0.     022900      
000842 77 W77-GENER                              PIC 9(04) VALUE 0.     023000      
000843 77 W77-LLAVE                              PIC 9(04) VALUE 0.     023100      
000844 77 W77-NUM-REG                            PIC 9(08) VALUE 0.     023200      
000845 77 W77-NUM-REGS500                        PIC 9(08).             023300      
000846 77 W77-TOT-REGS500                        PIC 9(16)V99.          023400      
000847 77 W77-NUM-REGS500-MCH                    PIC 9(08).             023405      
000848 77 W77-TOT-REGS500-MCH                    PIC 9(16)V99.          023410      
000849 77 W77-NUM-REGS707                        PIC 9(08).             023420      
000850 77 W77-TOT-REGS707                        PIC 9(16)V99.          023440      
000851 77 W77-NUM-REGSSORIANA                    PIC 9(08).             023442      
000852 77 W77-TOT-REGSSORIANA                    PIC 9(16)V99.          023444      
000853 77 W77-NUM-REG-PBCOS                      PIC 9(08).             023500      
000854 77 W77-C1                                 PIC 9(08) VALUE 0.     023600      
000855 77 W77-ARCH-DATADI                        PIC 9 VALUE 0.         023800      
000856    88 W88-ARCH-DATADI                     VALUE 1.               023900      
000857 77 WKS-VALUE                              PIC 9(08) VALUE 0.     024200      
000858 77 W77-DESC                               PIC 9 VALUE ZEROS.     024400      
000859    88 W88-DESC                            VALUE 1.               024500      
000860 77 W77-SOLO-PUNTEO                        PIC 9(03).             024600      
000861    88 W88-SOLO-PUNTEO                     VALUE 17,18,404.       024700      
000862 01 WS-FEC-SSAAMMDD                        PIC 9(08).             024710      
000863 01 WS-FEC-SSAAMMDD-R REDEFINES WS-FEC-SSAAMMDD.                  024720      
000864    02 WS-FEC-SS                           PIC 9(02).             024730      
000865    02 WS-FEC-AAMMDD                       PIC 9(06).             024740      
000866 01 WKS-NUM-ABON-NAC                       PIC 9(08).             024745      
000867 01 WKS-IMP-ABON-NAC                       PIC 9(16)V99.          024750      
000868 01 WKS-NUM-CARG-NAC                       PIC 9(08).             024755      
000869 01 WKS-IMP-CARG-NAC                       PIC 9(16)V99.          024760      
000870 01 WKS-NUM-NCON-NAC                       PIC 9(08).             024765      
000871 01 WKS-NUM-ABON-DOLL                      PIC 9(08).             024770      
000872 01 WKS-IMP-ABON-DOLL                      PIC 9(16)V99.          024775      
000873 01 WKS-NUM-CARG-DOLL                      PIC 9(08).             024780      
000874 01 WKS-IMP-CARG-DOLL                      PIC 9(16)V99.          024785      
000875 01 WKS-NUM-NCON-DOLL                      PIC 9(08).             024790      
000876 01 WKS-NUM-ELIM-ABON-NAC                  PIC 9(08).             024795      
000877 01 WKS-IMP-ELIM-ABON-NAC                  PIC 9(16)V99.          024800      
000878 01 WKS-NUM-ELIM-CARG-NAC                  PIC 9(08).             024805      
000879 01 WKS-IMP-ELIM-CARG-NAC                  PIC 9(16)V99.          024810      
000880 01 WKS-NUM-ELIM-NCON-NAC                  PIC 9(08).             024815      
000881 01 WKS-NUM-ELIM-ABON-DOLL                 PIC 9(08).             024820      
000882 01 WKS-IMP-ELIM-ABON-DOLL                 PIC 9(16)V99.          024825      
000883 01 WKS-NUM-ELIM-CARG-DOLL                 PIC 9(08).             024830      
000884 01 WKS-IMP-ELIM-CARG-DOLL                 PIC 9(16)V99.          024835      
000885 01 WKS-NUM-ELIM-NCON-DOLL                 PIC 9(08).             024840      
000886* INI EXTNET 2023 R11                                             024841      
000887 77 W77-ELIMINA-EXT                        PIC 9(01).             024842      
000888                                                                  024843      
000889 01 WKS-IND-EXTNET                         PIC 9(01).             024844      
000890 01 WKS-NULO-NUM                        PIC 9(02) COMP VALUE @00@.024845      
000891 01 WKS-NULO                               REDEFINES              024846      
000892    WKS-NULO-NUM                           PIC X(01).             024847      
000893                                                                  024848      
000894 01 WKS-HOSTNAME                           PIC X(10) VALUE SPACES.024849      
000895      88 W88-HOSTNAME                      VALUE "ACYPBETA. ",    024850      
000896                                                 "VDMBETA.  ",    024860      
000897                                                 "ACYPGAMA. ",    024865      
000898                                                 "MONALFA.  ",    024870      
000899                                                 "ACYPOMEGA.",    024875      
000900                                                 "VDMKAPPA. ",    024880      
000901                                                 "VDMALFA.  ",    024885      
000902                                                 "MONBETA.  ".    024890      
000903  01 WKS-HR                  PIC 9(06).                           024895      
000904  01 WKS-HR-R                REDEFINES WKS-HR.                    024900      
000905     03 WKS-HH               PIC 9(02).                           024905      
000906     03 WKS-MM               PIC 9(02).                           024910      
000907     03 WKS-SS               PIC 9(02).                           024915      
000908                                                                  024920      
000909 01 WKS-HR-LOG               PIC 9(08).                           024925      
000910  01 WKS-HR-LOG-R            REDEFINES WKS-HR-LOG.                024930      
000911     03 WKS-HH-LOG           PIC 9(02).                           024935      
000912     03 WKS-PUNTOS           PIC X(01).                           024940      
000913     03 WKS-MM-LOG           PIC 9(02).                           024945      
000914     03 WKS-PUNTOS2          PIC X(01).                           024950      
000915     03 WKS-SS-LOG           PIC 9(02).                           024955      
000916                                                                  024960      
000917* FIN EXTNET 2023 R11                                             024965      
000918*---------------------------------------------------------------- 024970      
000919*----------- VARIABLES PARA CONTROL DE REG DE SALIDA -------------025000      
000920 77 W77-NR-253-C                           PIC 9(06).             025100      
000921 77 W77-NR-253-M                           PIC 9(06).             025200      
000922 77 W77-NR-264-C                           PIC 9(06).             025300      
000923 77 W77-NR-264-M                           PIC 9(06).             025400      
000924 77 W77-NR-264-M-MCH                       PIC 9(06).             025450      
000925 77 W77-NR-BCOS-0410                       PIC 9(06).             025500      
000926 77 W77-NR-BCOS-0410C                      PIC 9(06).             025600      
000927 77 W77-NR-BCOS-0410A                      PIC 9(06).             025700      
000928 77 W77-NR-036-C                           PIC 9(06).             025800      
000929 77 W77-NR-054-M                           PIC 9(06).             025900      
000930 77 W77-NR-253-CMOV                        PIC 9(06).             025950      
000931 77 W77-NR-500-M-T-PAG                     PIC 9(06).             025975      
000932*** INI EAS 2023R03                                               025977      
000933 77 W77-NR-EAS-M                           PIC 9(06).             025979      
000934*** FIN EAS 2023R03                                               025981      
000935 77 W77-IM-253-C-C                         PIC 9(16)V99.          026000      
000936 77 W77-IM-253-C-A                         PIC 9(16)V99.          026100      
000937 77 W77-IM-264-C-C                         PIC 9(16)V99.          026200      
000938 77 W77-IM-264-C-A                         PIC 9(16)V99.          026300      
000939 77 W77-IM-BCOS-0410C                      PIC 9(16)V99.          026400      
000940 77 W77-IM-BCOS-0410A                      PIC 9(16)V99.          026500      
000941 77 W77-IM-253-M-C                         PIC 9(16)V99.          026600      
000942 77 W77-IM-253-M-A                         PIC 9(16)V99.          026700      
000943 77 W77-IM-264-M-C                         PIC 9(16)V99.          026800      
000944 77 W77-IM-264-M-A                         PIC 9(16)V99.          026900      
000945 77 W77-IM-264-M-C-MCH                     PIC 9(16)V99.          026920      
000946 77 W77-IM-264-M-A-MCH                     PIC 9(16)V99.          026940      
000947 77 W77-IM-500-M-C-PAG                     PIC 9(16)V99.          026960      
000948 77 W77-IM-500-M-A-PAG                     PIC 9(16)V99.          026980      
000949 77 W77-IM-036-C-C                         PIC 9(16)V99.          027000      
000950 77 W77-IM-036-C-A                         PIC 9(16)V99.          027100      
000951 77 W77-IM-054-M-C                         PIC 9(16)V99.          027200      
000952 77 W77-IM-054-M-A                         PIC 9(16)V99.          027300      
000953 77 W77-IM-253-CMOV-C                      PIC 9(16)V99.          027320      
000954 77 W77-IM-253-CMOV-A                      PIC 9(16)V99.          027340      
000955*** INI EAS 2023R03                                               027342      
000956 77 W77-IM-EAS-M-C                         PIC 9(16)V99.          027344      
000957 77 W77-IM-EAS-M-A                         PIC 9(16)V99.          027346      
000958*** FIN EAS 2023R03                                               027348      
000959                                                                  027400      
000960 77  WKS-WORDS                           PIC 9(08)  COMP.         027500      
000961 77  WKS-MON-ANT                         PIC 9(03).               027600      
000962 77  WKS-EOF-LISC                        PIC 9(1).                027700      
000963                                                                  027800      
000964 77  WKS-IMP-CAR-OP                      PIC 9(16)V99.            027900      
000965 77  WKS-IMP-ABO-OP                      PIC 9(16)V99.            028000      
000966 77  WKS-IMP-CAR-APL                     PIC 9(16)V99.            028100      
000967 77  WKS-IMP-ABO-APL                     PIC 9(16)V99.            028200      
000968 77  WKS-TOT-CAR-OP                      PIC 9(16)V99.            028300      
000969 77  WKS-TOT-ABO-OP                      PIC 9(16)V99.            028400      
000970 77  WKS-TOT-CAR-APL                     PIC 9(16)V99.            028500      
000971 77  WKS-TOT-ABO-APL                     PIC 9(16)V99.            028600      
000972 77  WKS-NUM-CAR-OP                      PIC 9(05).               028700      
000973 77  WKS-NUM-CAR-APL                     PIC 9(05).               028800      
000974 77  WKS-NUM-ABO-OP                      PIC 9(05).               028900      
000975 77  WKS-NUM-ABO-APL                     PIC 9(05).               029000      
000976*                                                                 029100      
000977******************************************************************029200      
000978*    FECHA Y HORA DE PROCESO                                     *029300      
000979******************************************************************029400      
000980 01 WKS-FECH-MAQ.                                                 029500      
000981    03 WKS-FM-MM                           PIC 9(02).             029600      
000982    03 WKS-FM-DD                           PIC 9(02).             029700      
000983    03 WKS-FM-AA                           PIC 9(04).             030000      
000984                                                                  030200      
000985 01 WKS-FEC-AMD.                                                  030300      
000986    03 WKS-AMD-AA                          PIC 9(04).             030600      
000987    03 WKS-AMD-MM                          PIC 9(02).             030800      
000988    03 WKS-AMD-DD                          PIC 9(02).             030900      
000989                                                                  031000      
000990 01 WKS-FECHA-DMA.                                                031100      
000991    03 WKS-DMA-DD                          PIC 9(02).             031200      
000992    03 WKS-DMA-MM                          PIC 9(02).             031300      
000993    03 WKS-DMA-AA                          PIC 9(04).             031600      
000994                                                                  031800      
000995 01 WKS-HORA-PROCESO                       PIC 9(08).             031900      
000996                                                                  032000      
000997 01 WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                        032100      
000998    03 WKS-HORA-HM                           PIC 9(04).           032200      
000999    03 FILLER                                PIC XXXX.            032300      
001000                                                                  032400      
001001 01 WKS-HORA-R2 REDEFINES WKS-HORA-PROCESO.                       032500      
001002    03 WKS-HORA-HMS                          PIC 9(06).           032600      
001003    03 FILLER                                PIC XX.              032700      
001004                                                                  032800      
001005 01 WKS-HORA-R3 REDEFINES WKS-HORA-PROCESO.                       032810      
001006    03 WKS-HORA-HMSS                         PIC 9(02).           032820      
001007    03 WKS-MINU-HMSS                         PIC 9(02).           032840      
001008    03 WKS-SEGU-HMSS                         PIC 9(02).           032860      
001009    03 FILLER                                PIC X(02).           032870      
001010                                                                  032890      
001011******************************************************************032900      
001012*                   VARIABLES NIVEL 88                           *033000      
001013******************************************************************033100      
001014 77 W77-FIN-PROCESO                        PIC 9(01) VALUE 0.     033200      
001015 88 W88-FIN-PROCESO    VALUE 1.                                   033300      
001016 77 W77-EXISTE-INX                         PIC 9(01) VALUE 0.     033400      
001017 77 W77-EXISTE-ADIC2                       PIC 9(01) VALUE 0.     033450      
001018 88 W88-EXISTE-INX     VALUE 0.                                   033500      
001019******************************************************************033600      
001020*     VARIABLE PARA PASAR FECHA Y ENTRYPOINT COMO PARAMETRO      *033700      
001021******************************************************************033800      
001022 77 W77-SISTEMA-PARAMETRO                   PIC 9(03).            033900      
001023                                                                  034000      
001024*===============================================                  034100      
001025*       PARAMETROS LIBRERIA CTLVERS            =                  034200      
001026*===============================================                  034300      
001027 01  WKS-LIBID                     PIC X(12).                     034400      
001028 01  WKS-NOMBLIB                   PIC X(72).                     034500      
001029 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             034600      
001030                                                                  034700      
001031**************************************************************    034800      
001032*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    034900      
001033**************************************************************    035000      
001034 01  WKS-DATOS-HOST.                                              035100      
001035     03 WKS-NUMCSI                           PIC 9(02).           035200      
001036     03 WKS-NOMEQUIPO                        PIC X(10).           035300      
001037     03 WKS-NOMCSI                           PIC X(26).           035400      
001038     03 WKS-LINEABATCH                       PIC X(05).           035500      
001039                                                                  035600      
001040******************************************************************035700      
001041*              VARIABLES PARA LLAMAR AL CALENDAR                 *035800      
001042******************************************************************035900      
001043 77  WKS-FUNCION                             PIC S9(11) BINARY.   036000      
001044 77  WKS-FORMATO                             PIC S9(11) BINARY.   036100      
001045                                                                  036200      
001046 01 WKS-FECHA1                               PIC X(08).           036500      
001047 01  WKS-FECHA1-R REDEFINES WKS-FECHA1.                           036700      
001048     03  WKS-AMO1-R                          PIC 9(04).           037000      
001049     03  WKS-MES1-R                          PIC 9(02).           037200      
001050     03  WKS-DIA1-R                          PIC 9(02).           037300      
001051                                                                  037400      
001052 01  WKS-FECHA2                              PIC X(08).           037700      
001053 01  WKS-FECHA2-R REDEFINES WKS-FECHA2.                           037900      
001054     03  WKS-AMO2-R                          PIC 9(04).           038200      
001055     03  WKS-MES2-R                          PIC 9(02).           038400      
001056     03  WKS-DIA2-R                          PIC 9(02).           038500      
001057*-----------------------------------------------------------------038600      
001058 01 WKS-AUTORIZA-S030.                                            038700      
001059    02 FILLER                     PIC X(12) VALUE SPACES.         038800      
001060    02 WKS-NUM-AUTORIZA           PIC 9(08).                      038900      
001061*------------------- TITULOS DE ARCHIVOS -------------------------039000      
001062 01 WKS-TIT-LOG151.                                               039100      
001063    02  WKS-NOM-LOG               PIC X(24).                      039200      
001064    02  WKS-FEC-LOG               PIC 9(06) VALUE 0.              039300      
001065    02  FILLER                    PIC X(04) VALUE " ON ".         039400      
001066    02  WKS-PACK-LOG              PIC X(17).                      039500      
001067    02  FILLER                    PIC X(01) VALUE ".".            039600      
001068                                                                  039700      
001069 01 WKS-TIT-DES151.                                               039800      
001070    02  WKS-NOM-DES               PIC X(24).                      039900      
001071    02  WKS-FEC-DES               PIC 9(06) VALUE 0.              040000      
001072    02  FILLER                    PIC X(04) VALUE " ON ".         040100      
001073    02  WKS-PACK-DES              PIC X(17).                      040200      
001074    02  FILLER                    PIC X(01) VALUE ".".            040300      
001075                                                                  040400      
001076 01 WKS-TIT-REGISTRA.                                             040500      
001077    02 FILLER                     PIC X(32) VALUE                 040600      
001078       "(S151)S151/OBJECT/L002/REGISTRAS" .                       040700      
001079    02 WKS-TIT-SISREG             PIC 9(03) VALUE 0.              040800      
001080    02 FILLER                     PIC X(18) VALUE                 040900      
001081       "/02MTP0  ON CMEMP.".                                      041000      
001082                                                                  041100      
001083                                                                  041107      
001084 01 WKS-COPY-L030.                                                041114      
001085    03 FILLER                 PIC X(06) VALUE "START ".           041121      
001086    03 WKS-N-WFL              PIC X(37).                          041128      
001087    03 FILLER                 PIC X(01) VALUE "(".                041135      
001088    03 FILLER                 PIC X(01) VALUE QUOTES.             041142      
001089    03 FILLER                 PIC X(20) VALUE                     041149      
001090                                      "CORRESOLO P102 S264 ".     041156      
001091    03 WKS-ARCHIVO            PIC X(33) VALUE SPACES.             041163      
001092    03 FILLER                 PIC X(12) VALUE " PAGOS PAGOS".     041170      
001093    03 FILLER                 PIC X(01) VALUE QUOTES.             041177      
001094    03 FILLER                 PIC X(01) VALUE ")".                041184      
001095                                                                  041191      
001096 01 WKS-TIT-WFL.                                                  041200      
001097    02 FILLER                   PIC X(15) VALUE "BEGIN JOB; RUN ".041300      
001098    02 WKS-START-PROG             PIC X(47).                      041400      
001099    02 FILLER                     PIC X(02) VALUE " (".           041500      
001100    02 FILLER                     PIC X(01) VALUE QUOTES.         041600      
001101    02 WKS-START-CSI              PIC X(09).                      041700      
001102    02 WKS-START-FEC              PIC X(08).                      041800      
001103    02 FILLER                     PIC X(01) VALUE "/".            041900      
001104    02 WKS-START-ARC              PIC 9(02).                      042000      
001105    02 FILLER                     PIC X(01) VALUE QUOTES.         042100      
001106    02 FILLER                     PIC X(12) VALUE ") ; END JOB.". 042200      
001107                                                                  042300      
001108  01 WKS-TIT-WFL2.                                                042305      
001109     02 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ".042310      
001110     02 WKS-START-PROG2            PIC X(47).                     042315      
001111     02 FILLER                     PIC X(02) VALUE " (".          042320      
001112     02 FILLER                     PIC X(01) VALUE QUOTES.        042325      
001113     02 FILLER                     PIC X(01) VALUE "S".           042330      
001114     02 WKS-START-SIS              PIC 9(03).                     042335      
001115     02 FILLER                     PIC X(04) VALUE "PUNT".        042340      
001116     02 FILLER                     PIC X(01) VALUE "/".           042345      
001117     02 WKS-START-FEC2             PIC X(08).                     042350      
001118     02 FILLER                     PIC X(01) VALUE "/".           042355      
001119     02 WKS-START-CSI2             PIC 9(02).                     042360      
001120     02 FILLER                     PIC X(01) VALUE QUOTES.        042365      
001121     02 FILLER                     PIC X(12) VALUE ") ; END JOB.".042375      
001122                                                                  042376      
001123 01 WKS-EJECUTA-P110.                                             042378      
001124    02 FILLER                   PIC X(10) VALUE "BEGIN JOB;".     042380      
001125    02 FILLER                   PIC X(04) VALUE "RUN ".           042382      
001126    02 WKS-START-P110           PIC X(48).                        042384      
001127    02 FILLER                   PIC X(02) VALUE " (".             042386      
001128    02 FILLER                   PIC X(01) VALUE QUOTES.           042388      
001129    02 WKS-INF-LINEA            PIC 9(02) VALUE 1.                042390      
001130    02 WKS-START-SISTEMA        PIC 9(03).                        042392      
001131    02 FILLER                   PIC X(01) VALUE QUOTES.           042394      
001132    02 FILLER                   PIC X(10) VALUE ");VALUE = ".     042396      
001133    02 WKS-START-FECHA          PIC 9(08).                        042398      
001134    02 FILLER                   PIC X(09) VALUE ";END JOB;".      042400      
001135                                                                  042410      
001136 01 WKS-TIT-BNX.                                                  042450      
001137    02 FILLER                     PIC X(10) VALUE "(S151)S151".   042500      
001138    02 FILLER                     PIC X(20) VALUE                 042600      
001139       "/FILE/INTS/15112S01/" .                                   042700      
001140    02 WKS-TIT-CSIA               PIC 9(02).                      042720      
001141    02 FILLER                     PIC X(01) VALUE "/".            042740      
001142    02 WKS-TIT-FECENV             PIC 9(08).                      042800      
001143    02 FILLER                     PIC X(01) VALUE "/".            042900      
001144    02 WKS-TIT-NUMPROC            PIC 9(09).                      043000      
001145    02 FILLER                     PIC X(01) VALUE "/".            043100      
001146    02 WKS-TIT-NUMARC             PIC 9(02).                      043200      
001147    02 FILLER                     PIC X(10) VALUE " ON CMEMP.".   043300      
001148                                                                  043400      
001149                                                                  044500      
001150 01 WKS-TIT-ARDES       PIC X(52).                                044600      
001151 01 WKS-TIT-ARMOV       PIC X(52).                                044700      
001152 01 WKS-TITULOS-SAL.                                              044800      
001153    02 FILLER           PIC X(01) VALUE "S".                      044900      
001154    02 WKS-SIS-SAL      PIC 9(03).                                045000      
001155    02 FILLER           PIC X(06) VALUE "/FILE/".                 045100      
001156    02 WKS-SISSAL       PIC X(04) VALUE SPACES.                   045200      
001157    02 FILLER           PIC X(01) VALUE "/".                      045300      
001158    02 WKS-CSI-ORI      PIC 9(02) VALUE ZEROS.                    045400      
001159    02 FILLER           PIC X(03) VALUE "/10".                    045500      
001160    02 FILLER           PIC X(07) VALUE "/MOVTOS".                045600      
001161    02 WKS-PRODSAL      PIC 9(03) VALUE ZEROS.                    045700      
001162    02 FILLER           PIC X(01) VALUE "/".                      045800      
001163    02 WKS-FEC-SAL      PIC 9(06) VALUE 0.                        045900      
001164    02 FILLER           PIC X(01) VALUE ".".                      046000      
001165                                                                  046100      
001166 01 WKS-TITULOS-SAL2.                                             046200      
001167    02 FILLER           PIC X(01) VALUE "S".                      046300      
001168    02 WKS-SIS-SAL2     PIC 9(03).                                046400      
001169    02 FILLER           PIC X(06) VALUE "/FILE/".                 046500      
001170    02 WKS-SISSAL2      PIC X(04) VALUE SPACES.                   046600      
001171    02 FILLER           PIC X(07) VALUE "/MOVTOS".                046700      
001172    02 WKS-PRODSAL2     PIC 9(03) VALUE ZEROS.                    046800      
001173    02 FILLER           PIC X(01) VALUE "/".                      046900      
001174    02 WKS-FEC-SAL2     PIC 9(06) VALUE 0.                        047000      
001175    02 FILLER           PIC X(01) VALUE ".".                      047100      
001176                                                                  047200      
001177 01 WKS-TIT-SAL264CMAE-MCH.                                       047210      
001178    02 FILLER           PIC X(15) VALUE "S500/FILE/INTS/".        047220      
001179    02 FILLER           PIC X(09) VALUE "50017S01/".              047230      
001180    02 WKS-NODOSAL2-MCH PIC 9(02) VALUE 0.                        047240      
001181    02 FILLER           PIC X(01) VALUE "/".                      047250      
001182    02 WKS-FEC-SAL2-MCH PIC 9(08) VALUE 0.                        047260      
001183    02 FILLER           PIC X(10) VALUE "/MOVTOS500".             047270      
001184    02 FILLER           PIC X(01) VALUE ".".                      047280      
001185                                                                  047290      
001186 01 WKS-TIT-SALS030.                                              047300      
001187    02 FILLER             PIC X(01) VALUE "S".                    047400      
001188    02 WKS-SIS-SALS030    PIC 9(03).                              047500      
001189    02 FILLER             PIC X(11) VALUE "/FILE/S030/".          047600      
001190    02 WKS-TIT-NORI       PIC 99    VALUE ZEROS.                  047700      
001191    02 FILLER             PIC X     VALUE "/".                    047800      
001192    02 WKS-TIT-NDES       PIC 99    VALUE ZEROS.                  047900      
001193    02 FILLER             PIC X(10) VALUE "/FORANEOS/".           048000      
001194    02 WKS-FECHA-S030     PIC 9(06) VALUE ZEROS.                  048100      
001195    02 FILLER             PIC X     VALUE ".".                    048200      
001196                                                                  048300      
001197 01 WKS-TIT-SALIDAFOTR.                                           048400      
001198    02 FILLER             PIC X(11) VALUE "S151/FILE/S".          048500      
001199    02 WKS-SIS-SALFT      PIC 9(03).                              048600      
001200    02 FILLER             PIC X(01) VALUE "/".                    048700      
001201    02 WKS-TIT-NFTORI     PIC 9(02) VALUE ZEROS.                  048800      
001202    02 FILLER             PIC X(01) VALUE "/".                    048900      
001203    02 WKS-TIT-NFTDES     PIC 9(02) VALUE ZEROS.                  049000      
001204     02 FILLER             PIC X(07) VALUE "/PFOTR/".             049100      
001205    02 WKS-FECHA-FT       PIC 9(06) VALUE ZEROS.                  049200      
001206    02 FILLER             PIC X(01) VALUE ".".                    049300      
001207                                                                  049400      
001208 01 WKS-TIT-SALIDAFORE.                                           049500      
001209    02 FILLER             PIC X(11) VALUE "S151/FILE/S".          049600      
001210    02 WKS-SIS-SALFR      PIC 9(03).                              049700      
001211    02 FILLER             PIC X(01) VALUE "/".                    049800      
001212    02 WKS-TIT-NFRORI     PIC 9(02) VALUE ZEROS.                  049900      
001213    02 FILLER             PIC X(01) VALUE "/".                    050000      
001214    02 WKS-TIT-NFRDES     PIC 9(02) VALUE ZEROS.                  050100      
001215     02 FILLER             PIC X(07) VALUE "/PFORE/".             050200      
001216    02 WKS-FECHA-FR       PIC 9(06) VALUE ZEROS.                  050300      
001217    02 FILLER             PIC X(01) VALUE ".".                    050400      
001218                                                                  050500      
001219 01 WKS-TIT-SALS500.                                              050600      
001220    02 FILLER            PIC X(11) VALUE "S151/FILE/S".           050700      
001221    02 WKS-SIS-SALS500   PIC 9(03).                               050800      
001222    02 FILLER            PIC X(08) VALUE "/PLINEA/".              050900      
001223    02 WKS-TIT-CSI       PIC 99    VALUE ZEROS.                   051000      
001224    02 FILLER            PIC X     VALUE "/".                     051100      
001225    02 WKS-FECHA-S500    PIC 9(06) VALUE ZEROS.                   051200      
001226    02 FILLER            PIC X     VALUE ".".                     051300      
001227                                                                  051310      
001228 01 WKS-TIT-SALS500-MCH.                                          051320      
001229    02 FILLER             PIC X(15) VALUE "S264/FILE/INTS/".      051321      
001230    02 FILLER             PIC X(09) VALUE "26416S01/".            051322      
001231    02 WKS-TIT-CSI-MCH    PIC 9(02) VALUE 0.                      051323      
001232    02 FILLER             PIC X(01) VALUE "/".                    051324      
001233    02 WKS-FECHA-S500-MCH PIC 9(08) VALUE 0.                      051325      
001234    02 FILLER             PIC X(11) VALUE "/PLINEAS999".          051326      
001235    02 FILLER             PIC X(01) VALUE ".".                    051327      
001236                                                                  051330      
001237 01 WKS-TIT-SALS500-PAG.                                          051333      
001238    02 FILLER             PIC X(15) VALUE "S500/FILE/INTS/".      051336      
001239    02 FILLER             PIC X(09) VALUE "50011S03/".            051339      
001240    02 WKS-NODOSAL2-PAG   PIC 9(02) VALUE 0.                      051342      
001241    02 FILLER             PIC X(01) VALUE "/".                    051345      
001242    02 WKS-FEC-SAL2-PAG   PIC 9(08) VALUE 0.                      051348      
001243    02 FILLER             PIC X(11) VALUE "/MOVTOSP500".          051351      
001244    02 FILLER             PIC X(01) VALUE ".".                    051354      
001245                                                                  051357      
001246                                                                  051400      
001247 01 WKS-TIT-SALS707.                                              051410      
001248    02 FILLER            PIC X(11) VALUE "S151/FILE/S".           051420      
001249    02 WKS-SIS-SALS700   PIC 9(03) VALUE 707.                     051430      
001250    02 FILLER            PIC X(08) VALUE "/PLINEA/".              051440      
001251    02 WKS-TIT-CSI707    PIC 99    VALUE ZEROS.                   051450      
001252    02 FILLER            PIC X     VALUE "/".                     051460      
001253    02 WKS-FECHA-S707    PIC 9(06) VALUE ZEROS.                   051470      
001254    02 FILLER            PIC X     VALUE ".".                     051480      
001255                                                                  051490      
001256 01 WKS-TIT-PBCOS-0410.                                           051500      
001257    02 FILLER             PIC X(07) VALUE "(S151)S".              051600      
001258    02 WKS-TIT-SIS-0410   PIC 9(03).                              051700      
001259    02 FILLER             PIC X(11) VALUE "/FILE/S151/".          051800      
001260    02 WKS-TIT-CSI-0410   PIC 99    VALUE ZEROS.                  051900      
001261    02 FILLER             PIC X(04) VALUE "/10/".                 052000      
001262    02 WKS-TIT-MOV-0410   PIC X(11) VALUE "MOVCSIBCOS/".          052100      
001263    02 WKS-FECHA-0410     PIC 9(06) VALUE ZEROS.                  052200      
001264    02 FILLER             PIC X(10) VALUE " ON CMEMP.".           052202      
001265 01 WKS-TIT-SALSORIANA.                                           052204      
001266    03 FILLER                   PIC X(06) VALUE "(S151)".         052206      
001267    03 FILLER                   PIC X(15) VALUE "S500/FILE/S151/".052208      
001268    03 WKS-CSI-ORI-SORIANA      PIC 9(02) VALUE ZEROS.            052210      
001269    03 FILLER                   PIC X(09) VALUE "/SORIBAN/".      052212      
001270    03 WKS-FEC-SAL-SORIANA      PIC 9(06) VALUE 0.                052214      
001271    03 FILLER                   PIC X(09) VALUE " ON CMEMP".      052216      
001272    03 FILLER                   PIC X(01) VALUE ".".              052218      
001273                                                                  052220      
001274 01 SORIANA-NOMINA.                                               052222      
001275    03 SORIANA-NOMINA-OPE              PIC  9(14).                052224      
001276    03 SORIANA-NOMINA-OPE-R REDEFINES SORIANA-NOMINA-OPE.         052226      
001277       05 FILLER                       PIC 9(06).                 052228      
001278       05 SORIANA-TIENDA               PIC 9(04).                 052230      
001279       05 FILLER                       PIC X(04).                 052232      
001280                                                                  052234      
001281  01 WKS-TIT-WFL-SORIANA.                                         052236      
001282     03 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ".052238      
001283     03 WKS-START-PROG2-SOR        PIC X(47).                     052240      
001284     03 FILLER                     PIC X(02) VALUE " (".          052242      
001285     03 FILLER                     PIC X(01) VALUE QUOTES.        052244      
001286     03 WKS-CVE-TRANFER            PIC X(09) VALUE SPACES.        052246      
001287     03 WKS-START-FEC2-SOR         PIC X(08).                     052248      
001288     03 FILLER                     PIC X(01) VALUE QUOTES.        052250      
001289     03 FILLER                     PIC X(12) VALUE ") ; END JOB.".052252      
001290                                                                  052254      
001291  01 WKS-TIT-WFL-MPS.                                             052256      
001292     02 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ".052258      
001293     02 WKS-START-PROG-MPS         PIC X(47).                     052260      
001294     02 FILLER                     PIC X(02) VALUE " (".          052262      
001295     02 FILLER                     PIC X(01) VALUE QUOTES.        052264      
001296     02 FILLER                     PIC X(01) VALUE "S".           052266      
001297     02 FILLER                     PIC 9(03) VALUE 500.           052268      
001298     02 FILLER                     PIC X(04) VALUE "MPSV".        052270      
001299     02 FILLER                     PIC X(01) VALUE "/".           052272      
001300     02 WKS-START-FEC-MPS          PIC 9(08).                     052274      
001301     02 FILLER                     PIC X(01) VALUE QUOTES.        052280      
001302     02 FILLER                     PIC X(12) VALUE ") ; END JOB.".052282      
001303                                                                  052284      
001304  01 WKS-TIT-WFL-CMOV.                                            052286      
001305     02 FILLER                  PIC X(15) VALUE "BEGIN JOB; RUN ".052288      
001306     02 WKS-START-PROG-CMOV        PIC X(47).                     052290      
001307     02 FILLER                     PIC X(02) VALUE " (".          052292      
001308     02 FILLER                     PIC X(01) VALUE QUOTES.        052294      
001309     02 FILLER                     PIC X(01) VALUE "S".           052296      
001310     02 FILLER                     PIC 9(03) VALUE 500.           052298      
001311     02 FILLER                     PIC X(04) VALUE "CMOV".        052300      
001312     02 FILLER                     PIC X(01) VALUE "/".           052302      
001313     02 WKS-START-FEC-CMOV         PIC 9(08).                     052304      
001314     02 FILLER                     PIC X(01) VALUE QUOTES.        052310      
001315     02 FILLER                     PIC X(12) VALUE ") ; END JOB.".052312      
001316                                                                  052314      
001317  01 WKS-TIT-SALMPS.                                              052401      
001318     03 FILLER                 PIC X(01) VALUE "S".               052402      
001319     03 WKS-SIS-SAL-MPS        PIC 9(03).                         052403      
001320     03 FILLER                 PIC X(06) VALUE "/FILE/".          052404      
001321     03 WKS-SISSAL-MPS         PIC X(04) VALUE SPACES.            052405      
001322     03 FILLER                 PIC X(01) VALUE "/".               052406      
001323     03 WKS-CSI-ORI-MPS        PIC 9(02) VALUE ZEROS.             052407      
001324     03 FILLER                 PIC X(03) VALUE "/10".             052408      
001325     03 FILLER                 PIC X(11) VALUE "/MOVTOSMPS/".     052409      
001326     03 WKS-FEC-SAL-MPS        PIC 9(06) VALUE ZEROS.             052410      
001327     03 FILLER                 PIC X(01) VALUE ".".               052411      
001328                                                                  052412      
001329  01 WKS-TITULOS-SALCMOV.                                         052413      
001330     03 FILLER                 PIC X(01) VALUE "S".               052414      
001331     03 WKS-SIS-SAL-CMOV       PIC 9(03).                         052415      
001332     03 FILLER                 PIC X(06) VALUE "/FILE/".          052416      
001333     03 WKS-SISSAL-CMOV        PIC X(04) VALUE SPACES.            052417      
001334     03 FILLER                 PIC X(01) VALUE "/".               052418      
001335     03 WKS-CSI-ORI-CMOV       PIC 9(02) VALUE ZEROS.             052419      
001336     03 FILLER                 PIC X(03) VALUE "/10".             052420      
001337     03 FILLER                 PIC X(12) VALUE "/MCTASMOVIL/".    052421      
001338     03 WKS-FEC-SAL-CMOV       PIC 9(06) VALUE ZEROS.             052422      
001339     03 FILLER                 PIC X(01) VALUE ".".               052423      
001340                                                                  052424      
001341******************************************************************052432      
001342***MPM    NOMBRE DE ARCHIVO S440    ***************               052434      
001343  01 WKS-TITLE-S440.                                              052436      
001344     02 FILLER                 PIC X(21) VALUE                    052440      
001345                               "(S151)S151/FILE/S440/".           052450      
001346                                                                  052455      
001347     02 WKS-440-CSI            PIC 9(02).                         052460      
001348     02 FILLER                 PIC X(10) VALUE "/CONCLOTE/".      052470      
001349     02 WKS-440-FECHA          PIC 9(08).                         052480      
001350     02 FILLER                 PIC X(10) VALUE" ON CMEMP.".       052482      
001351******************************************************************052490      
001352 01 WKS-TIT-SISTEMI.                                              052500      
001353    02 FILLER            PIC X(01) VALUE "S".                     052600      
001354    02 WKS-NUM-SISTEMI   PIC 9(03).                               052700      
001355                                                                  052800      
001356 01 WKS-TITLE-CONLI-INTS440.                                      052807      
001357    03 FILLER                 PIC X(24) VALUE                     052814      
001358                              "(S151)S151/FILE/INTS/151".         052821      
001359    03 WKS-CONLI-INTS440SER   PIC 9(02) VALUE 05.                 052822      
001360    03 FILLER                 PIC X(04) VALUE "S01/".             052824      
001361    03 WKS-CONLI-INTS440CSI   PIC 9(02).                          052828      
001362    03 FILLER                 PIC X(01) VALUE "/".                052830      
001363    03 WKS-CONLI-INTS440FEC   PIC 9(08).                          052842      
001364    03 FILLER                 PIC X(01) VALUE "/".                052849      
001365    03 FILLER                 PIC X(12) VALUE "440CONCLOTE".      052877      
001366    03 FILLER                 PIC X(10) VALUE " ON CMEMP.".       052884      
001367* 01 WKS-TITLE-PG-ARCHIVO.                                        052885      
001368*   03 FILLER                 PIC X(24) VALUE                     052890      
001369*                             "S500/FILE/INTS/50011S01/".         052895      
001370*   03 WKS-PG-NODO            PIC 9(02).                          052905      
001371*   03 FILLER                 PIC X(8) VALUE "/MOVSPG/".          052910      
001372*   03 WKS-PG-FEC             PIC 9(08).                          052915      
001373*   03 FILLER                 PIC X(01) VALUE ".".                052920      
001374                                                                  052921      
001375 01 WKS-TITLE-PORTPG-INTELAR.                                     052922      
001376    03 FILLER                 PIC X(24) VALUE                     052923      
001377                              "S500/FILE/INTS/50012S01/".         052924      
001378    03 WKS-PORTPG-NODO          PIC 9(02).                        052925      
001379    03 FILLER                 PIC X(04) VALUE "/PN/".             052926      
001380    03 WKS-PORTPG-FEC           PIC 9(08).                        052927      
001381    03 FILLER                 PIC X(01) VALUE ".".                052928      
001382                                                                  052929      
001383                                                                  052930      
001384 01 WKS-TITLE-TLM-ARCHIVO.                                        052935      
001385   03 FILLER                 PIC X(24) VALUE                      052940      
001386                             "S500/FILE/INTS/50011S02/".          052945      
001387   03 WKS-TLM-NODO           PIC 9(02).                           052955      
001388   03 FILLER                 PIC X(9) VALUE                       052960      
001389                             "/MOVSTLM/".                         052965      
001390   03 WKS-TLM-FEC            PIC 9(08).                           052970      
001391   03 FILLER                 PIC X(01) VALUE ".".                 052975      
001392                                                                  052980      
001393 01 WKS-TIT-SAL253CMAE                     PIC X(44).             052985      
001394 01 WKS-TIT-SAL253CHEQ                     PIC X(44).             053000      
001395 01 WKS-TIT-SAL264CMAE                     PIC X(40).             053100      
001396 01 WKS-TIT-SAL036CHEQ                     PIC X(40).             053200      
001397 01 WKS-TIT-SAL054CMAEYMAO                 PIC X(40).             053300      
001398 01 WKS-TIT-SAL253-CMOV                    PIC X(44).             053304      
001399*** INI EAS 2023R03                                               053306      
001400 01 WKS-TITLE-EAS-ARCHIVO.                                        053308      
001401   03 FILLER                 PIC X(24) VALUE                      053310      
001402                            "S500/FILE/INTS/50028S01/".           053312      
001403   03 WKS-TT-EAS-NODO        PIC 9(02).                           053314      
001404   03 FILLER                 PIC X(11) VALUE "/MOVTOSEAS/".       053316      
001405   03 WKS-TT-EAS-FEC         PIC 9(06).                           053318      
001406   03 FILLER                 PIC X(01) VALUE ".".                 053320      
001407*** FIN EAS 2023R03                                               053322      
001408* INI EXTNET 2023 R11                                             053327      
001409 01 WKS-TITLE-EXTNET-ARCHIVO.                                     053332      
001410    03 FILLER                 PIC X(24) VALUE                     053337      
001411                             "S500/FILE/INTS/50032S03/".          053342      
001412    03 WKS-TT-EXTNET-NODO     PIC 9(02).                          053347      
001413    03 FILLER                 PIC X(16) VALUE "/MOVTOSCTECITID/". 053352      
001414    03 WKS-TT-EXTNET-FEC         PIC 9(06).                       053357      
001415    03 FILLER                 PIC X(01) VALUE ".".                053362      
001416                                                                  053364      
001417 01 WKS-TIT-AUTORIZA.                                             053366      
001418    03 FILLER                     PIC X(29) VALUE                 053368      
001419                                  "(S151)S151/FILE/AUTORIZAP135/".053370      
001420    03 WKS-FECHA-AUT              PIC 9(06).                      053372      
001421    03 FILLER                     PIC X(10) VALUE                 053374      
001422        " ON CMEMP.".                                             053376      
001423* FIN EXTNET 2023 R11                                             053378      
001424                                                                  053400      
001425 77 WKS-NOMARCMOV                          PIC X(34).             053500      
001426 77 WKS-NOMARCDES                          PIC X(34).             053600      
001427 77  W77-L710-SISTEMA              PIC S9(11) BINARY.             053700      
001428 77  W77-L710-PROGRAMA             PIC S9(11) BINARY.             053800      
001429 01  WKS-L710-ENT.                                                053900      
001430     03 WKS-EL710-CAT              PIC 9(06) COMP.                054000      
001431     03 WKS-EL710-CLAVE            PIC 9(02) COMP.                054100      
001432     03 WKS-EL710-BUSQUEDA         PIC 9(02) COMP.                054200      
001433     03 WKS-EL710-REGISTROS        PIC 9(02) COMP.                054300      
001434     03 WKS-EL710-LLAVE1           PIC 9(12).                     054400      
001435     03 WKS-EL710-LLAVE2           PIC 9(12).                     054500      
001436     03 WKS-EL710-LLAVE3           PIC 9(12).                     054600      
001437     03 WKS-EL710-LLAVE4           PIC 9(12).                     054700      
001438     03 WKS-EL710-LLAVE5           PIC 9(12).                     054800      
001439     03 WKS-EL710-LLAVE6           PIC 9(12).                     054900      
001440     03 WKS-EL710-FEC-VIG          PIC 9(06) COMP.                055000      
001441     03 WKS-EL710-FECINI           PIC 9(06) COMP.                055100      
001442     03 WKS-EL710-NIVINI           PIC 9(02) COMP.                055200      
001443     03 FILLER                     PIC X(11).                     055300      
001444 01  WKS-L710-SAL.                                                055400      
001445     03 WKS-SL710-NUMREG           PIC 9(02) COMP.                055500      
001446     03 WKS-SL710-CAT              PIC 9(06) COMP.                055600      
001447     03 WKS-SL710-FECINI           PIC 9(06) COMP.                055700      
001448     03 WKS-SL710-NIVINI           PIC 9(02) COMP.                055800      
001449     03 FILLER                     PIC X(22).                     055900      
001450     03 WKS-SL710-REG.                                            056000      
001451        05 WKS-SL710-DAT           PIC 9(12) OCCURS 28 TIMES.     056100      
001452        05 WKS-SL710-FECALTA       PIC 9(06) COMP.                056200      
001453        05 WKS-SL710-FECBAJA       PIC 9(06) COMP.                056300      
001454        05 WKS-SL710-FECMOD        PIC 9(06) COMP.                056400      
001455        05 WKS-SL710-FECVIG        PIC 9(06) COMP.                056500      
001456        05 FILLER                  PIC X(500).                    056600      
001457 77  W77-L710-RESULT               PIC S9(11) BINARY.             056700      
001458 77  W77-CAT-NUMCAT                PIC 9(06).                     056800      
001459 77  W77-CAT-FORMATO               PIC 9(04).                     056900      
001460 77  W77-TABLA                     PIC X(12).                     056905      
001461******************************************************************056906      
001462*            PÁRAMETROS ENTRADA LEYENDAS                         *056907      
001463******************************************************************056908      
001464 77  SISTEMA                       PIC S9(11) BINARY.             056909      
001465 77  PROGRAMA                      PIC S9(11) BINARY.             056910      
001466 77  RESULTAD                      PIC S9(11) BINARY.             056911      
001467                                                                  056912      
001468 01  WKS-PARAM-ENT.                                               056913      
001469     02 WKS-PAR-ENT-CATA         PIC 9(06)  COMP.                 056914      
001470     02 WKS-PAR-ENT-CLAVE        PIC 9(02)  COMP.                 056915      
001471     02 WKS-PAR-ENT-ORD-BUS      PIC 9(02)  COMP.                 056916      
001472     02 WKS-PAR-ENT-REGIS        PIC 9(02)  COMP.                 056917      
001473     02 WKS-PAR-ENT-DATOS        PIC X(90).                       056918      
001474     02 WKS-PAR-ENT-RED-LEY08 REDEFINES WKS-PAR-ENT-DATOS.        056919      
001475        04 WKS-PAR-ENT-LLAVE1.                                    056920      
001476           06 WKS-PAR-ENT-LLAVE1-N PIC 9(12).                     056921      
001477        04 WKS-PAR-ENT-LLAVE2.                                    056922      
001478           06 WKS-PAR-ENT-LLAVE2-N PIC 9(12).                     056923      
001479        04 WKS-PAR-ENT-LLAVE2-R REDEFINES WKS-PAR-ENT-LLAVE2.     056924      
001480           06 WKS-PAR-ENT-LLAVE2-8 PIC X(08).                     056925      
001481           06 WKS-PAR-ENT-LLAVE2-4 PIC X(04).                     056926      
001482        04 WKS-PAR-ENT-LLAVE3.                                    056927      
001483           06 WKS-PAR-ENT-LLAVE3-N PIC 9(12).                     056928      
001484        04 WKS-PAR-ENT-LLAVE4.                                    056929      
001485           06 WKS-PAR-ENT-LLAVE4-N PIC 9(12).                     056930      
001486        04 WKS-PAR-ENT-LLAVE5.                                    056931      
001487           06 WKS-PAR-ENT-LLAVE5-N PIC 9(12).                     056932      
001488        04 WKS-PAR-ENT-LLAVE6.                                    056933      
001489           06 WKS-PAR-ENT-LLAVE6-N PIC 9(12).                     056934      
001490        04 WKS-PAR-ENT-FEC-VIG   PIC 9(06)  COMP.                 056935      
001491        04 WKS-PAR-ENT-FEC-INI-CONS PIC 9(06) COMP.               056936      
001492        04 WKS-PAR-ENT-NIVEL-INI PIC 9(02)  COMP.                 056937      
001493        04 FILLER                PIC X(11).                       056938      
001494                                                                  056939      
001495******************************************************************056940      
001496*            PÁRAMETROS SALIDA  LEYENDAS                         *056941      
001497******************************************************************056942      
001498 01  WKS-PARAM-LEY.                                               056943      
001499     02 WKS-PAR-LEY-NUM-REG      PIC 9(02)  COMP.                 056944      
001500     02 WKS-PAR-LEY-CATALOGO     PIC 9(06)  COMP.                 056945      
001501     02 WKS-PAR-LEY-FE-INI-CONS  PIC 9(06)  COMP.                 056946      
001502     02 WKS-PAR-LEY-NIVEL-INI    PIC 9(02)  COMP.                 056947      
001503     02 FILLER                   PIC X(22).                       056948      
001504     02 WKS-PAR-LEY-NUMREG  OCCURS 10 TIMES.                      056949      
001505        04 WKS-PAR-LEY-LLAVE1    PIC X(12).                       056950      
001506        04 WKS-PAR-LEY-LLAVE2    PIC 9(12).                       056951      
001507        04 WKS-PAR-LEY-LLAVE3    PIC 9(12).                       056952      
001508        04 WKS-PAR-LEY-LLAVE4    PIC X(12).                       056953      
001509        04 WKS-PAR-LEY-LLAVE5    PIC X(12).                       056954      
001510        04 WKS-PAR-LEY-LLAVE6    PIC X(12).                       056955      
001511        04 WKS-PAR-LEY-FEC-ALTA  PIC 9(06)  COMP.                 056956      
001512        04 WKS-PAR-LEY-FEC-BAJA  PIC 9(06)  COMP.                 056957      
001513        04 WKS-PAR-LEY-ULT-MOD   PIC 9(06)  COMP.                 056958      
001514        04 WKS-PAR-LEY-FEC-VIG   PIC 9(06)  COMP.                 056959      
001515        04 WKS-PAR-LEY-LEYENDA   PIC X(297).                      056960      
001516        04 FILLER                PIC X(69).                       056967      
001517                                                                  056969      
001518******************************************************************056971      
001519*                         LEYENDA DE BINES                       *056973      
001520******************************************************************056975      
001521 01 WKS-TABLA-LEYENDA-BIN.                                        056977      
001522    02 WKS-T-LEYENDAS-BIN OCCURS 100 TIMES.                       056979      
001523       04 WKS-LEYENDA-BIN.                                        056981      
001524          06 WKS-BIN-FILLER1     PIC 9(03).                       056983      
001525          06 WKS-BIN-VALIDO      PIC 9(06).                       056985      
001526          06 WKS-BIN-FILLER2     PIC 9(03).                       056987      
001527                                                                  056989      
001528 01 WKS-CONT-BIN                 PIC 9(04) VALUE 0.               056991      
001529                                                                  056993      
001530*=================================================================057000      
001531*             VARIABLE DE PASO PARA LOS ARCHIVOS                 *057100      
001532*=================================================================057200      
001533 01 WKS-CAJA-PASO.                                                057300      
001534    03 FILLER                      PIC X     VALUE SPACES.        057400      
001535    03 WKS-NUM-CAJA                PIC 9(02) VALUE ZEROS.         057500      
001536                                                                  057600      
001537 01 WKS-SIST-ORIGEN                PIC X(04).                     057700      
001538 01 WKS-SIST-ORIGEN-R REDEFINES WKS-SIST-ORIGEN.                  057800      
001539    03 WKS-SIST-LETRA              PIC X(01).                     057900      
001540    03 WKS-SIST-NUM                PIC X(03).                     058000      
001541                                                                  058100      
001542 01 WKS-NUM-MDACC-PASO             PIC X(20).                     058200      
001543 01 WKS-NUM-MDACC-R REDEFINES WKS-NUM-MDACC-PASO.                 058300      
001544    03 WKS-NUM-MDACCESO            PIC 9(20).                     058400      
001545                                                                  058500      
001546 01 WKS-NUM-REF-PASO               PIC X(20).                     058600      
001547 01 WKS-NUM-REF-R REDEFINES WKS-NUM-REF-PASO.                     058700      
001548    03 WKS-NUM-REFERENCIA          PIC 9(20).                     058800      
001549                                                                  058900      
001550                                                                  059400      
001551 01 WKS-CUENTA-PASO                PIC X(20).                     059500      
001552 01 WKS-CUENTA-PASO-R REDEFINES WKS-CUENTA-PASO.                  059600      
001553    03 WKS-SUC-P                   PIC X(04).                     059700      
001554    03 FILLER                      PIC X(08).                     059800      
001555    03 WKS-CTO-P                   PIC X(08).                     059900      
001556                                                                  060000      
001557 01 WKS-CUENTA-ALFA.                                              060100      
001558    03 WKS-SUC-A                   PIC X(04).                     060200      
001559    03 WKS-CTO-A                   PIC X(08).                     060300      
001560                                                                  060400      
001561 01 WKS-CUENTA-FIN                 PIC 9(12).                     060500      
001562                                                                  060600      
001563 01 WKS-LEYENDA1                   PIC X(40).                     060610      
001564 01 WKS-LEYENDA1-R REDEFINES WKS-LEYENDA1.                        060620      
001565    03 WKS-LEYENDA                 PIC X(20).                     060630      
001566    03 WKS-NUM-DOCTO               PIC 9(18).                     060640      
001567    03 WKS-FILLER                  PIC X(02).                     060650      
001568*===============================================*                 060700      
001569*  ARREGLO DE CLAVES DEL SISTEMA                *                 060800      
001570*===============================================*                 060900      
001571 01 WKS-CVE-SIS.                                                  061000      
001572    03 WKS-CVE-DATOS OCCURS 10000 TIMES.                          061100      
001573       05 WKS-CVE-MOV              PIC 9(02) COMP.                061300      
001574       05 WKS-CVE-REN              PIC 9(02) COMP.                061350      
001575       05 WKS-CVE-AFC              PIC 9(02) COMP.                061400      
001576       05 WKS-CVE-CMP              PIC 9(02) COMP.                061500      
001577       05 WKS-CVE-PORTA            PIC 9(02) COMP.                061510      
001578                                                                  061600      
001579*===============================================*                 061700      
001580*  ARREGLO DE RELACION SUCURSAL - CMP           *                 061800      
001581*===============================================*                 061900      
001582 01 WKS-REL-SUCMPS.                                               062000      
001583    03 WKS-REL-SUCMP OCCURS 10000 TIMES.                          062100      
001584       05 WKS-REL-CMP              PIC 9(03) COMP.                062200      
001585                                                                  062300      
001586****************************************************************  062400      
001587*             LLAMADO A LA LIBRERIA DE CONTROL                 *  062500      
001588****************************************************************  062600      
001589 01 WS-151-DATOS WITH LOWER-BOUNDS.                               062700      
001590    03 WS-CTL-FUNCION              PIC 9(02).                     062800      
001591    03 WS-CTL-SISTEMA              PIC 9(04).                     062900      
001592    03 WS-CTL-NUMCSI               PIC 9(02).                     063000      
001593    03 WS-CTL-FECPROC              PIC 9(08).                     063300      
001594    03 WS-CTL-FECCONT              PIC 9(08).                     063700      
001595    03 WS-CTL-FECS151              PIC 9(08).                     064100      
001596    03 WS-CTL-STAREG               PIC 9(02).                     064300      
001597    03 WS-CTL-NOMSDO               PIC X(34).                     064400      
001598    03 WS-CTL-PKSDO                PIC X(17).                     064500      
001599    03 WS-CTL-NOMMOV               PIC X(34).                     064600      
001600    03 WS-CTL-PKMOV                PIC X(17).                     064700      
001601    03 WS-CTL-NOMDES               PIC X(34).                     064800      
001602    03 WS-CTL-PKDES                PIC X(17).                     064900      
001603    03 WS-CTL-NOMERR               PIC X(34).                     065000      
001604    03 WS-CTL-PKERR                PIC X(17).                     065100      
001605    03 WS-CTL-NOMBD                PIC X(17).                     065200      
001606    03 WS-CTL-STABD                PIC 9(02).                     065300      
001607    03 WS-CTL-NUMARC               PIC X(02).                     065400      
001608    03 WS-CTL-3ERNIV               PIC X(02).                     065500      
001609    03 WS-CTL-OCC-FECHAS   OCCURS 10 TIMES.                       065600      
001610       05 WS-CTL-FECARCM           PIC 9(08).                     065900      
001611       05 WS-CTL-NIVARCM           PIC 9(08).                     066100      
001612       05 WS-CTL-NIVBDM            PIC 9(08).                     066200      
001613       05 WS-CTL-STAARCM           PIC 9(02).                     066300      
001614                                                                  066400      
001615 01 WS-ERRORES.                                                   066500      
001616    03 WS-ER01 PIC X(31) VALUE "SISTEMA NO HABILITADO EN S151  ". 066600      
001617    03 WS-ER02 PIC X(31) VALUE "FUNCION NO VALIDA              ". 066700      
001618    03 WS-ER03 PIC X(31) VALUE "TRANSACCION NO CATALOGADA      ". 066800      
001619    03 WS-ER04 PIC X(31) VALUE "FECHA CONTABLE NO VALIDA       ". 066900      
001620    03 WS-ER05 PIC X(31) VALUE "FALTA LA SUCURSAL PROMOTORA    ". 067000      
001621    03 WS-ER06 PIC X(31) VALUE "FALTA LA SUCURSAL OPERADORA    ". 067100      
001622    03 WS-ER07 PIC X(31) VALUE "EL IMPORTE ES 0                ". 067200      
001623    03 WS-ER08 PIC X(31) VALUE "FALTA REF S151 PARA ELIMINAR   ". 067300      
001624    03 WS-ER09 PIC X(31) VALUE "MOVIMINETO A ELIMINAR NO EXISTE". 067400      
001625    03 WS-ER10 PIC X(31) VALUE "ORIGEN ERRONEO                 ". 067500      
001626    03 WS-ER11 PIC X(31) VALUE "ELIMINANDO A REG DE ELIMINACION". 067600      
001627 01 WS-ERRORES-R REDEFINES WS-ERRORES.                            067700      
001628    03 WS-ERROR PIC X(31) OCCURS 11 TIMES.                        067800      
001629                                                                  067900      
001630 77 WKS-151-RESULT            PIC S9(11) BINARY.                  068000      
001631                                                                  068100      
001632***************************************************************   068200      
001633*          LIBRERIA CTLVERS       ( S151)                     *   068300      
001634***************************************************************   068400      
001635 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   068500      
001636 01  WKS-CTLVERS-TITULO              PIC X(72).                   068600      
001637 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           068700      
001638 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   068800      
001639 01  WKS-CTLVERS-LIBID               PIC X(12).                   068900      
001640 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             069000      
001641     03 WKS-LIBID-NOMB               PIC X(09).                   069100      
001642     03 WKS-LIBID-SIST               PIC X(03).                   069200      
001643                                                                  069300      
001644 01  WKS-151-DATOS WITH LOWER-BOUNDS.                             069400      
001645     03 WKS-DEL-FUNCION              PIC 9(04).                   069500      
001646     03 WKS-DEL-FECHA                PIC 9(08).                   069800      
001647     03 WKS-DEL-NUMLOG               PIC 9(02).                   070000      
001648     03 WKS-DEL-PRODUCTO             PIC 9(04).                   070100      
001649     03 WKS-DEL-PROCESO              PIC 9(02).                   070200      
001650                                                                  070300      
001651/=================================                                070400      
001652* CARATULA DE CONTROL LISCONFIRMA.                                070500      
001653*=================================                                070600      
001654 01  WS-TIT1.                                                     070700      
001655     03 FILLER            PIC X(02) VALUE "C/".                   070800      
001656     03 FILLER            PIC X(19) VALUE "S151/P135/01FORANE0".  070900      
001657     03 FILLER            PIC X(28) VALUE SPACES.                 071000      
001658     03 FILLER            PIC X(19) VALUE "BANCO  NACIONAL  DE".  071100      
001659     03 FILLER            PIC X(17) VALUE "  MEXICO   S.A.  ".    071200      
001660     03 FILLER            PIC X(36) VALUE SPACES.                 071300      
001661     03 FILLER            PIC X(10) VALUE "HOJA :  1 ".           071400      
001662*                                                                 071500      
001663 01  WS-TIT2.                                                     071600      
001664     03 FILLER            PIC X(16) VALUE "FECHA PROCESO : ".     071700      
001665     03 WS-DIA-ACT        PIC 99.                                 071800      
001666     03 FILLER            PIC X     VALUE "/".                    071900      
001667     03 WS-MES-ACT        PIC 99.                                 072000      
001668     03 FILLER            PIC X     VALUE "/".                    072100      
001669     03 WS-AMO-ACT        PIC 9(04).                              072400      
001670     03 FILLER            PIC XX    VALUE SPACES.                 072600      
001671     03 WS-HORA-PRO       PIC 9(02).                              072700      
001672     03 FILLER            PIC X(01) VALUE ":".                    072720      
001673     03 WS-MINU-PRO       PIC 9(02).                              072740      
001674     03 FILLER            PIC X(01) VALUE ":".                    072760      
001675     03 WS-SEGU-PRO       PIC 9(02).                              072780      
001676     03 FILLER            PIC X(10) VALUE SPACES.                 073000      
001677     03 FILLER            PIC X(20) VALUE "SIST. ADMINISTRADOR ". 073200      
001678     03 FILLER            PIC X(15) VALUE "DE MOVIMIENTOS ".      073300      
001679     03 FILLER            PIC X(25) VALUE SPACES.                 073400      
001680     03 FILLER            PIC X(15) VALUE "INF. DEL DIA : ".      073500      
001681     03 WS-DIA-PRO        PIC 99.                                 073600      
001682     03 FILLER            PIC X     VALUE "/".                    073700      
001683     03 WS-MES-PRO        PIC 99.                                 073800      
001684     03 FILLER            PIC X     VALUE "/".                    073900      
001685     03 WS-AMO-PRO        PIC 9(04).                              074200      
001686                                                                  074400      
001687 01  WS-TIT3.                                                     074500      
001688     03 FILLER           PIC X(06) VALUE "CSI : ".                074600      
001689     03 WS-CSI-ID        PIC X(03) VALUE SPACES.                  074700      
001690     03 FILLER           PIC X(45) VALUE SPACES.                  074800      
001691     03 FILLER           PIC X(22) VALUE "MOVIMIENTOS FORANEOS S".074900      
001692     03 WS-NUM-SIS       PIC 999   VALUE ZEROS.                   075000      
001693     03 FILLER           PIC X(52) VALUE SPACES.                  075100      
001694*                                                                 075200      
001695 01 LISC-SUB1.                                                    075300      
001696    03 FILLER                     PIC X(13) VALUE                 075400      
001697                                  "             ".                075500      
001698    03 FILLER                     PIC X(60) VALUE                 075600      
001699   "             MOVIMIENTOS OPERADOS ( ENVIADOS )              ".075700      
001700    03 FILLER                     PIC X(59) VALUE                 075800      
001701    "           MOVIMIENTOS APLICADOS ( RECIBIDOS )             ".075900      
001702*                                                                 076000      
001703 01 LISC-SUB2.                                                    076100      
001704    03 FILLER                     PIC X(11) VALUE                 076200      
001705                                  "M O N E D A".                  076300      
001706    03 FILLER                     PIC X(29) VALUE                 076400      
001707                            " NUM.    C  A  R  G  O  S    ".      076500      
001708    03 FILLER                     PIC X(31) VALUE                 076600      
001709                            "NUM.    A  B  O  N  O  S      ".     076700      
001710    03 FILLER                     PIC X(30) VALUE                 076800      
001711                            "NUM.     C  A  R  G  O  S     ".     076900      
001712    03 FILLER                     PIC X(29) VALUE                 077000      
001713                            "NUM.     A  B  O  N  O  S    ".      077100      
001714*                                                                 077200      
001715 01 LISC-SUB3.                                                    077300      
001716    03 FILLER                     PIC X(13) VALUE                 077400      
001717                                  " ----------- ".                077500      
001718    03 FILLER                     PIC X(29) VALUE                 077600      
001719                            "----- ---------------------- ".      077700      
001720    03 FILLER                     PIC X(31) VALUE                 077800      
001721                            "----- -----------------------  ".    077900      
001722    03 FILLER                     PIC X(30) VALUE                 078000      
001723                            "----- ----------------------- ".     078100      
001724    03 FILLER                     PIC X(29) VALUE                 078200      
001725                            "----- ---------------------- ".      078300      
001726/                                                                 078400      
001727 01 LISC-DET1.                                                    078500      
001728    03 FILLER                     PIC X(02) VALUE SPACES.         078600      
001729    03 R1D1-MONEDA                PIC 9(03).                      078700      
001730    03 FILLER                     PIC X(08) VALUE SPACES.         078800      
001731    03 R1D1-NUM-CAR-OP            PIC ZZZZ9.                      078900      
001732    03 FILLER                     PIC X(01) VALUE SPACES.         079000      
001733    03 R1D1-IMP-CAR-OP            PIC $$$$$$$$$$,$$$,$$9.99.      079100      
001734    03 FILLER                     PIC X(01) VALUE SPACES.         079200      
001735    03 R1D1-NUM-ABO-OP            PIC ZZZZ9.                      079300      
001736    03 FILLER                     PIC X(01) VALUE SPACES.         079400      
001737    03 R1D1-IMP-ABO-OP            PIC $$$$$$$$$$,$$$,$$9.99.      079500      
001738    03 FILLER                     PIC X(02) VALUE SPACES.         079600      
001739    03 R1D1-NUM-CAR-APL           PIC ZZZZ9.                      079700      
001740    03 FILLER                     PIC X(01) VALUE SPACES.         079800      
001741    03 R1D1-IMP-CAR-APL           PIC $$$$$$$$$$,$$$,$$9.99.      079900      
001742    03 FILLER                     PIC X(01) VALUE SPACES.         080000      
001743    03 R1D1-NUM-ABO-APL           PIC ZZZZ9.                      080100      
001744    03 FILLER                     PIC X(01) VALUE SPACES.         080200      
001745    03 R1D1-IMP-ABO-APL           PIC $$$$$$$$$$,$$$,$$9.99.      080300      
001746*                                                                 080400      
001747 01 LISC-TOT1.                                                    080500      
001748    03 FILLER                     PIC X(19) VALUE "   T O T A L ".080600      
001749    03 R1T1-IMP-CAR-OP            PIC $$$$$$$$$$,$$$,$$9.99.      080700      
001750    03 FILLER                     PIC X(07) VALUE SPACES.         080800      
001751    03 R1T1-IMP-ABO-OP            PIC $$$$$$$$$$,$$$,$$9.99.      080900      
001752    03 FILLER                     PIC X(08) VALUE SPACES.         081000      
001753    03 R1T1-IMP-CAR-APL           PIC $$$$$$$$$$,$$$,$$9.99.      081100      
001754    03 FILLER                     PIC X(07) VALUE SPACES.         081200      
001755    03 R1T1-IMP-ABO-APL           PIC $$$$$$$$$$,$$$,$$9.99.      081300      
001756*                                                                 081400      
001757 01  WS-ARCH-CARAT.                                               081500      
001758     03 FILLER                   PIC X     VALUE "S".             081600      
001759     03 WKS-SIST-CARAT           PIC 999.                         081700      
001760     03 FILLER                   PIC X(06) VALUE "/LIST/".        081800      
001761     03 FILLER                   PIC X(05) VALUE "P135/".         081900      
001762     03 WKS-NODO-CARAT           PIC 9(02).                       082000      
001763     03 FILLER                   PIC X(08) VALUE "00/C000/".      082100      
001764     03 WKS-FECH-CARAT           PIC 9(06).                       082200      
001765     03 FILLER                   PIC X(01) VALUE "/".             082300      
001766     03 WKS-MIX-CARAT            PIC 9(07).                       082400      
001767     03 FILLER                   PIC X(14) VALUE "/001FORANEO151".082500      
001768     03 FILLER                    PIC X(01) VALUE ".".            082600      
001769*                                                                 082700      
001770 01 HDR-CMP.                                                      082800      
001771    03 HDR-TIPREG-CMP             PIC X(02) VALUE "01".           082900      
001772    03 FILLER                     PIC X(07) VALUE "0000001".      083000      
001773    03 FILLER                     PIC X(04) VALUE "002E".         083100      
001774    03 HDR-PLAZA-CMP              PIC 9(02).                      083200      
001775    03 HDR-TEI-CMP                PIC X     VALUE "I".            083300      
001776    03 HDR-DMES-CMP               PIC 9(02).                      083400      
001777    03 HDR-NTRANS-CMP             PIC 9(05).                      083500      
001778    03 HDR-FEC-CMP                PIC 9(08).                      083600      
001779    03 FILLER                     PIC X(12) VALUE "         00 ". 083700      
001780    03 HDR-HRE-CMP                PIC 9(04).                      083800      
001781    03 HDR-LONG-CMP               PIC 9(09) VALUE ZEROS.          083900      
001782    03 HDR-DEST-CMP               PIC 9(09).                      084000      
001783    03 HDR-TIPP-CMP               PIC X.                          084100      
001784    03 FILLER                     PIC X(02) VALUE "0A".           084200      
001785    03 HDR-NTRAN2-CMP             PIC 9(02).                      084300      
001786    03 FILLER                     PIC X(36) VALUE                 084400      
001787                         "                                    ".  084500      
001788    03 FILLER                     PIC X(37) VALUE                 084600      
001789                        "                                     ".  084700      
001790*                                                                 084800      
001791 01 TR-CMP.                                                       084900      
001792    03 FILLER                     PIC X(02) VALUE "09".           085000      
001793    03 TR-NSEC-CMP                PIC 9(07).                      085100      
001794    03 TR-OPER-CMP                PIC 9(02) VALUE 40.             085200      
001795    03 TR-TREG-CMP                PIC 9(07).                      085300      
001796    03 TR-IMPT-CMP                PIC 9(16)V99.                   085400      
001797    03 FILLER                     PIC X(55) VALUE                 085500      
001798        "                                                       ".085600      
001799    03 FILLER                     PIC X(52) VALUE                 085700      
001800           "                                                    ".085800      
001801*                                                                 085900      
001802*********************************************************         085902      
001803****  PARAMETROS     S016_L422_CTAMEDIO  (61)      ******         085904      
001804****  PROCEDIMIENTO DE TIPO ENTERO                  *****         085906      
001805*****    CONSULTA B04CUENTAS, B08MEDIOS CON OPCION  *****         085908      
001806*********************************************************         085910      
001807 01  E422-61-CTR-ENTRADA.                                         085912      
001808     02  E422-61-CTA-NUMPROD          PIC 9(04) COMP.             085914      
001809     02  E422-61-CTA-CVEINST          PIC 9(04) COMP.             085916      
001810     02  E422-61-CTO-NUM.                                         085918      
001811         03  E422-61-CTA-NUMPREF      PIC 9(04) COMP.             085920      
001812         03  E422-61-CTA-NUM          PIC 9(12) COMP.             085922      
001813     02  E422-61-MDA-CVETIPO          PIC 9(02) COMP.             085924      
001814     02  E422-61-OPCION               PIC 9(02) COMP.             085926      
001815     02  E422-61-CTR-NUMCSI           PIC 9(02) COMP.             085928      
001816     02  E422-61-CTE-NUM              PIC 9(12) COMP.             085930      
001817     02  FILLER                       PIC X(39).                  085932      
001818                                                                  085934      
001819* SIZE ENTRADA X(60)                                              085936      
001820 01  S422-61-CTR-SALIDA.                                          085938      
001821     02 S422-61-CTR-REGISTRO.                                     085940      
001822        03 S422-61-CTR-ERR.                                       085942      
001823           04 S422-61-CTR-ERROR       PIC 9(04) COMP.             085944      
001824           04 S422-61-CTR-ERRORTIPO   PIC 9(04) COMP.             085946      
001825           04 S422-61-CTR-ESTRUCTURA  PIC 9(04) COMP.             085948      
001826        03 S422-61-CTR-NUMCSI         PIC 9(02) COMP.             085950      
001827        03 S422-61-CTE-NUM            PIC 9(12) COMP.             085952      
001828        03 S422-61-CTA-NUMPROD        PIC 9(04) COMP.             085954      
001829        03 S422-61-CTA-CVEINST        PIC 9(02) COMP.             085956      
001830        03 S422-61-CTA-NUMCTO.                                    085958      
001831           04 S422-61-CTA-NUMPREF     PIC 9(04) COMP.             085960      
001832           04 S422-61-CTA-NUM         PIC 9(12) COMP.             085962      
001833        03 S422-61-MDA-CVETIPO        PIC 9(02) COMP.             085964      
001834        03 S422-61-MDA-SUBTIPO        PIC 9(02) COMP.             085966      
001835        03 S422-61-MDA-CVETIT         PIC 9(02) COMP.             085968      
001836        03 S422-61-MDA-NUMCTO.                                    085970      
001837           04 S422-61-MDA-NUMPREF     PIC 9(04) COMP.             085972      
001838           04 S422-61-MDA-NUM         PIC 9(12) COMP.             085974      
001839        03 S422-61-MDA-NUMTALON       PIC 9(02) COMP.             085976      
001840        03 S422-61-MDA-CHQXTALON      PIC 9(02) COMP.             085978      
001841        03 S422-61-MDA-CVEPIN         PIC 9(06) COMP.             085980      
001842        03 S422-61-MDA-CVESTATUS      PIC 9(02) COMP.             085982      
001843        03 S422-61-MDA-FECALTA-2K     PIC 9(08) COMP.             085984      
001844        03 S422-61-MDA-FECULTMOD-2K   PIC 9(08) COMP.             085986      
001845        03 S422-61-MDA-FECCANCEL-2K   PIC 9(08) COMP.             085988      
001846        03 S422-61-MDA-FECMODPIN-2K   PIC 9(08) COMP.             085990      
001847        03 FILLER                     PIC X(27).                  085992      
001848* SIZE SALIDA X(84).                                              085994      
001849  77  R422-61-CTR-ERROR               PIC S9(11) BINARY.          085996      
001850*                                                                 085998      
001851 01 DET-CMP.                                                      086000      
001852    03 FILLER                     PIC 9(02) VALUE  02.            086100      
001853    03 DT-NSEC-CMP                PIC 9(07).                      086200      
001854    03 DT-FECA-CMP                PIC 9(08).                      086300      
001855    03 DT-CVET-CMP                PIC 9(04).                      086400      
001856    03 DT-BCOE-CMP                PIC 9(03).                      086500      
001857    03 DT-SUCC-CMP                PIC 9(06).                      086600      
001858    03 DT-SUCR-CMP REDEFINES DT-SUCC-CMP.                         086700      
001859       04 DT-PZA                  PIC 9(03).                      086800      
001860       04 DT-REF-SUC              PIC 9(03).                      086900      
001861    03 DT-CTAC-CMP                PIC 9(18).                      087000      
001862    03 DT-CTAR-CMP REDEFINES DT-CTAC-CMP.                         087100      
001863       04 DT-FILLER               PIC 9(7).                       087200      
001864       04 DT-CTA-SUC              PIC 9(4).                       087300      
001865       04 DT-CTA-CTA              PIC 9(7).                       087400      
001866    03 DT-NDOC-CMP                PIC X(23).                      087500      
001867    03 DT-NDOR-CMP REDEFINES DT-NDOC-CMP.                         087600      
001868       04 DT-NDOCF                PIC X(3).                       087700      
001869       04 DT-NDOC                 PIC 9(20).                      087800      
001870    03 DT-IMPT-CMP                PIC 9(13)V99.                   087900      
001871    03 DT-NCAJ-CMP                PIC 9(05).                      088000      
001872    03 DT-OPER-CMP                PIC 9(09).                      088100      
001873    03 DT-PROD-CMP                PIC 9(03).                      088200      
001874    03 DT-NMON-CMP                PIC 9(03).                      088300      
001875    03 DT-AUTZ-CMP                PIC 9(18).                      088400      
001876    03 DT-NATU-CMP                PIC 9(01).                      088500      
001877    03 DT-INST-CMP                PIC X(03).                      088600      
001878    03 DT-TIPI-CMP                PIC 9(01).                      088700      
001879    03 DT-FECO-CMP                PIC 9(08).                      088800      
001880    03 DT-HRSO-CMP                PIC 9(06).                      088900      
001881    03 DT-NOMINA-CMP              PIC 9(10).                      088910      
001882    03 DT-REFALF-CMP              PIC X(20).                      088920      
001883******************************************************************089000      
001884*        COPY DE LOS FORMATOS DE ARCHIVOS DE INTERFACE           *089100      
001885******************************************************************089200      
001886*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001887*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".            089300      
001888                                                                  000100      
001889******************************************************************000200      
001890**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
001891**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
001892**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
001893******************************************************************000600      
001894                                                                  000700      
001895 01 A00-R00-HDR-MOV .                                             000800      
001896    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
001897    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
001898    02 FILLER                          PIC  X(08).                001100      
001899    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
001900    02 FILLER                          PIC  X(430).               001300      
001901                                                                  001400      
001902 01 A00-R01-REGMOV .                                              001500      
001903    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
001904    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
001905    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
001906                                                                  001900      
001907    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
001908    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
001909                                       PIC  9(04)      COMP.      002200      
001910    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
001911                                       PIC  9(04)      COMP.      002400      
001912                                                                  002500      
001913    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
001914    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
001915                                       PIC  9(02)      COMP.      002800      
001916    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
001917                                       PIC  9(02)      COMP.      003000      
001918    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
001919    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
001920                                       A00-R01-SERVICIO-ALERTA.   003060      
001921       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
001922       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
001923    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
001924    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
001925    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
001926                                       PIC  9(04)      COMP.      003420      
001927    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
001928    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
001929                                       PIC  9(04)      COMP.      003520      
001930    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
001931    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
001932    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
001933                                       PIC  9(02)      COMP.      003900      
001934                                                                  004000      
001935    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
001936    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
001937       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
001938          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
001939          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
001940          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
001941          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
001942          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
001943          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
001944          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
001945                                                                  005100      
001946    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
001947       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
001948       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
001949       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
001950       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
001951       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
001952       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
001953       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
001954                                                                  006000      
001955       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
001956       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
001957       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
001958       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
001959       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
001960       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
001961       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
001962                                                                  006800      
001963       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
001964       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
001965       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
001966       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
001967       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
001968       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
001969       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
001970                                                                  007600      
001971       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
001972       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
001973       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
001974       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
001975       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
001976       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
001977       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
001978                                                                  008400      
001979       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
001980       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
001981       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
001982       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
001983       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
001984       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
001985       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
001986                                                                  009200      
001987    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
001988    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
001989    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
001990    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
001991    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
001992    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
001993       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
001994    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
001995    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
001996    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
001997    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
001998    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
001999    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
002000    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
002001    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
002002       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
002003       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
002004    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
002005    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
002006    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
002007    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
002008    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
002009    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
002010    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
002011    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
002012    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
002013    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
002014    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
002015    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
002016    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
002017    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
002018                                       PIC X(10).                 012600      
002019    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
002020       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
002021       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
002022    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
002023    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
002024    03 A00-R01-FILIAL                  PIC  X(05).                013200      
002025    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
002026       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
002027       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
002028                                                                  013300      
002029    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
002030    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
002031                                       PIC  X(09).                013600      
002032    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
002033                                       PIC  9(18)      COMP.      013800      
002034    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
002035    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
002036                                       PIC  X(9).                 014100      
002037    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
002038    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
002039                                       PIC  X(05).                014400      
002040    03 A00-R01-NIO                     PIC  X(16).                014500      
002041    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
002042    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
002043    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
002044       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
002045    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
002046    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
002047       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
002048    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
002049    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
002050    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
002051    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
002052    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
002053    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
002054                                       PIC  X(04).                015900      
002055    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
002056    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
002057    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
002058                                       PIC  9(04)      COMP.      016300      
002059    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
002060    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
002061    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
002062    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
002063    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
002064                                                                  016900      
002065    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
002066    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
002067       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
002068    03 A00-R01-FILXAPL                 PIC X(165).                017300      
002069                                                                  017400      
002070    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
002071       05 FILLER                       PIC X(96).                 017510      
002072       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
002073       05 FILLER                       PIC X(67).                 017700      
002074                                                                  017702      
002075    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
002076       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
002077       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
002078       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
002079       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
002080       06 WKS-MOV-FILS084              PIC X(154).                017714      
002081                                                                  017800      
002082    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
002083       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
002084       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
002085       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
002086       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
002087       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
002088       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
002089       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
002090       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
002091       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
002092*      CAMPOS NUEVOS                                              018160      
002093       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
002094       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
002095       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
002096       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
002097       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
002098       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
002099       05 FILLER                       PIC X(40).                 018167      
002100*       05 FILLER                       PIC X(62).                018170      
002101       05 A00-R01-CTE-087              PIC X(07).                 018210      
002102       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
002103          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
002104          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
002105          07 FILLER                    PIC X(01).                 018281      
002106       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
002107       05 FILLER                       PIC X(61).                 018400      
002108                                                                  018500      
002109    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
002110       05 FILLER                       PIC  X(96).                018610      
002111       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
002112       05 FILLER                       PIC  X(65).                018630      
002113                                                                  018640      
002114    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
002115       05 A00-R01-FORMATO0             PIC  9(02).                018700      
002116       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
002117       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
002118       05 FILLER                       PIC  X(141).               018910      
002119                                                                  019100      
002120    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
002121       05 A00-R01-FORMATO1             PIC  9(02).                019300      
002122       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
002123       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
002124       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
002125       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
002126       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
002127       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
002128       05 A00-R01-ENTSAL               PIC  X(01).                020000      
002129       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
002130       05 FILLER                       PIC  X(69).                020200      
002131                                                                  020300      
002132    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
002133       05 A00-R01-FORMATO2             PIC  9(02).                020500      
002134       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
002135       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
002136       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
002137       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
002138       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
002139       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
002140       05 FILLER                       PIC  X(77).                021200      
002141                                                                  021300      
002142    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
002143       05 A00-R01-FORMATO3             PIC  9(02).                021500      
002144       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
002145       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
002146       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
002147       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
002148       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
002149       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
002150       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
002151       05 FILLER                       PIC  X(69).                022300      
002152                                                                  022400      
002153    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
002154       05 A00-R01-FORMATO4             PIC  9(02).                022600      
002155       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
002156       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
002157       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
002158       05 A00-R01-RFCFT04              PIC  X(13).                023000      
002159       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
002160       05 A00-R01-DIRECCION            PIC  X(40).                023200      
002161       05 FILLER                       PIC  X(85).                023300      
002162                                                                  023400      
002163    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
002164       05 A00-R01-COBERTURA            PIC  X(01).                023408      
002165       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
002166       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
002167       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
002168       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
002169       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
002170       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
002171       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
002172       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
002173       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
002174       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
002175       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
002176       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
002177       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
002178       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
002179       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
002180       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
002181       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
002182       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
002183       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
002184       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
002185       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
002186       05 FILLER                       PIC  X(05).                023492      
002187                                                                  023497      
002188    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
002189       05 A00-R01-4CEROS               PIC  9(04).                023600      
002190       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
002191       05 FILLER                       PIC  X(157).               023800      
002192                                                                  023900      
002193    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
002194       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
002195        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
002196       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
002197       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
002198       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
002199       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
002200       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
002201       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
002202       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
002203       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
002204       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
002205       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
002206       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
002207       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
002208       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
002209       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
002210       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
002211       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
002212       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
002213       05 A00-R01-FILLER               PIC  X(41).                025850      
002214       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
002215       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
002216       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
002217       05 A00-R01-INDPAGO              PIC  9(01).                026200      
002218       05 FILLER                       PIC  X(01).                026210      
002219       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
002220       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
002221       05 FILLER                       PIC  X(52).                026300      
002222                                                                  026400      
002223    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
002224       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
002225       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
002226       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
002227       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
002228       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
002229       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
002230       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
002231       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
002232       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
002233       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
002234       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
002235       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
002236       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
002237          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
002238          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
002239       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
002240       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
002241          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
002242       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
002243          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
002244       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
002245          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
002246       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
002247          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
002248       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
002249          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
002250       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
002251          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
002252       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
002253          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
002254       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
002255          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
002256       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
002257          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
002258       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
002259          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
002260          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
002261       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
002262       05 FILLER                       PIC X(01).                 030101      
002263       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
002264       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
002265       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
002266       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
002267       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
002268       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
002269       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
002270       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
002271          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
002272       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
002273       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
002274       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
002275       05 FILLER                       PIC X(14).                 030700      
002276                                                                  030800      
002277    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
002278       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
002279       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
002280       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
002281       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
002282       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
002283       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
002284       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
002285       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
002286       05 FILLER                       PIC  X(140).               031600      
002287                                                                  031700      
002288    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
002289       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
002290       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
002291       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
002292       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
002293       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
002294       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
002295       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
002296       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
002297       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
002298       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
002299          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
002300          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
002301          07 FILLER                    PIC  X(08).                032740      
002302       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
002303       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
002304       05 A00-R01-NOMORD               PIC  X(30).                033000      
002305       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
002306       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
002307       05 A00-R01-REF-CECO             PIC  X(07).                033500      
002308       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
002309       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
002310          A00-R01-NUM-ORD-PAGO.                                   033800      
002311          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
002312          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
002313                                                                  034100      
002314    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
002315       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
002316       05 A00-R01-RFC-S501             PIC  X(13).                034160      
002317       05 FILLER                       PIC  X(151).               034180      
002318                                                                  034190      
002319    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
002320       05 A00-R01-DATOS-S701           PIC X(116).                034300      
002321       05 A00-R01-PAG-SERV             REDEFINES                  034400      
002322                                       A00-R01-DATOS-S701.        034500      
002323          07 A00-R01-ID                PIC X(30).                 034600      
002324          07 A00-R01-FECREC            PIC 9(06).                 034700      
002325          07 A00-R01-REF1              PIC X(20).                 034800      
002326          07 A00-R01-REF2              PIC X(20).                 034900      
002327          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
002328          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
002329                                       A00-R01-TIPOPAGO.          035200      
002330             09 A00-R01-ESTAB          PIC 9(04).                 035300      
002331             09 A00-R01-SEQ            PIC 9(02).                 035400      
002332          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
002333          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
002334          07 A00-R01-EBPP              PIC 9(03).                 035700      
002335          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
002336          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
002337          07 FILLER                    PIC X(01).                 035728      
002338          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
002339          07 FILLER                    PIC X(18).                 035760      
002340       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
002341                                       A00-R01-DATOS-S701.        035900      
002342          07 A00-R01-RFC               PIC X(13).                 036000      
002343          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
002344          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
002345          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
002346          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
002347          07 FILLER                    PIC X(85).                 036200      
002348       05 FILLER                       PIC X(49).                 036300      
002349                                                                  036400      
002350    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
002351       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
002352       05 A00-R01-CTA-S702             PIC X(40).                 036700      
002353       05 FILLER                       PIC X(113).                036710      
002354                                                                  036720      
002355    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
002356       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
002357       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
002358       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
002359       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
002360       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
002361       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
002362       05 FILLER                       PIC X(72).                 036800      
002363                                                                  036810      
002364                                                                  036820      
002365    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
002366       05 A00-R01-TRUI-S711.                                      036915      
002367          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
002368          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
002369          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
002370           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
002371          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
002372       05 A00-R01-MICR-S711.                                      036945      
002373          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
002374          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
002375          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
002376          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
002377          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
002378          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
002379          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
002380          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
002381       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
002382       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
002383       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
002384       05 A00-R01-FIL-S711             PIC X(05).                 036965      
002385       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
002386       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
002387       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
002388                                                                  036990      
002389    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
002390       05 A00-R01-RFC-502              PIC  X(13).                037100      
002391       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
002392          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
002393          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
002394          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
002395          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
002396          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
002397          07 FILLER                    PIC  9(01) COMP.           037650      
002398       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
002399       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
002400       05 FILLER                       PIC  X(06).                038680      
002401                                                                  038682      
002402    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
002403       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
002404       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
002405       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
002406       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
002407       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
002408       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
002409       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
002410       05 FILLER                       PIC  X(81).                038750      
002411                                                                  038755      
002412    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
002413       05 A00-R01-COP                  PIC  9(13)        .        038900      
002414       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
002415       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
002416       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
002417       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
002418       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
002419       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
002420       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
002421       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
002422       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
002423       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
002424       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
002425       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
002426       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
002427       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
002428       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
002429       05 FILLER                       PIC  X(81)        .        040800      
002430                                                                  040810      
002431    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
002432       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
002433       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
002434       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
002435       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
002436       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
002437       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
002438       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
002439       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
002440       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
002441       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
002442       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
002443       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
002444       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
002445       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
002446       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
002447       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
002448       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
002449       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
002450       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
002451       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
002452       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
002453       05 FILLER                       PIC  X(18).                041040      
002454                                                                  041400      
002455    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
002456    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
002457*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002458*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002459*  COPY "(S151)S151/FORMATO/ARCHIVO/DATOSADIC ON CMEMP.".         089400      
002460 01 A01-R00-HDR-DES .                                             000100      
002461     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
002462     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
002463     03 FILLER                         PIC X(530).                000400      
002464 01 A01-R01-DATOS.                                                000500      
002465     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
002466     03 A01-R01-DATOS-1.                                          000610      
002467        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
002468        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
002469           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
002470        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
002471           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
002472           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
002473           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
002474              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
002475              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
002476           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
002477                                       PIC X(12).                 001290      
002478           07 FILLER                   PIC X(04).                 001300      
002479        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
002480           07 FILLER                   PIC X(02).                 001500      
002481           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
002482        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
002483        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
002484        05 A01-R01-SDO-FIN.                                       003720      
002485           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
002486           07 FILLER                   PIC X(05).                 003760      
002487        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
002488           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
002489           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
002490        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
002491        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
002492        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
002493           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
002494           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
002495           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
002496           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
002497           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
002498        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
002499        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
002500        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
002501        05 A01-R01-DATOS-2.                                       004450      
002502           07 A01-R01-LEY1             PIC X(40).                 004500      
002503           07 A01-R02-LEY2             PIC X(40).                 004600      
002504           07 A01-R02-LEY3             PIC X(40).                 004700      
002505           07 A01-R02-LEY4             PIC X(40).                 004800      
002506           07 A01-R02-LEY5             PIC X(40).                 004900      
002507           07 A01-R01-FILXAPL          PIC X(120).                004910      
002508           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
002509              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
002510              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
002511              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
002512              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
002513              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
002514              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
002515              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
002516              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
002517              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
002518              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
002519              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
002520              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
002521              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
002522              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
002523              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
002524              09 FILLER                PIC X(15).                 004944      
002525                                                                  004946      
002526*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
002527*             09 A01-R01-TRUI-S711.                               004949      
002528*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
002529*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
002530*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
002531*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
002532*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
002533*             09 A01-R01-MICR-S711.                               004955      
002534*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
002535*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
002536*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
002537*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
002538*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
002539*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
002540*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
002541*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
002542*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
002543*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
002544*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
002545*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
002546*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
002547                                                                  004969      
002548           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
002549              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
002550              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
002551              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
002552              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
002553              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
002554              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
002555              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
002556                                                                  004978      
002557           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
002558              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
002559              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
002560              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
002561              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
002562              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
002563              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
002564              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
002565              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
002566              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
002567              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
002568              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
002569              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
002570              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
002571              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
002572              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
002573                                                                  004995      
002574           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
002575              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
002576              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
002577              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
002578* INI VML                                                         005000      
002579              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
002580                              A01-R01-CVE-RASTREO-S500.           005002      
002581                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
002582                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
002583                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
002584                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
002585* FIN VML                                                         005009      
002586              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
002587        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
002588           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
002589           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
002590           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
002591           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
002592           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
002593           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
002594           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
002595           07 A01-R01-OCUPACION        PIC X(40).                 005028      
002596           07 A01-R01-POBLACION        PIC X(40).                 005030      
002597           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
002598           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
002599           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
002600           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
002601           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
002602           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
002603           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
002604           07 A01-R01-COLONIA          PIC X(30).                 005046      
002605           07 A01-R01-TELEFONO         PIC X(10).                 005048      
002606           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
002607           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
002608           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
002609           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
002610           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
002611           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
002612     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
002613        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
002614        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
002615        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
002616        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
002617        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
002618        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
002619        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
002620        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
002621        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
002622        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
002623        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
002624        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
002625        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
002626        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
002627        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
002628        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
002629        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
002630        05 FILLER                      PIC X(358).                005098      
002631                                                                  005100      
002632     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
002633        05 A01-R01-TRUI.                                          005104      
002634           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
002635           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
002636           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
002637           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
002638           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
002639        05 A01-R01-MICR.                                          005116      
002640           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
002641           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
002642           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
002643           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
002644           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
002645           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
002646           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
002647           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
002648        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
002649        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
002650        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
002651        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
002652        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
002653        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
002654        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
002655        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
002656        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
002657        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
002658        05 A01-R01-IND-SUBC            PIC 9(01) COMP.            005154      
002659        05 A01-R01-PRO-SUBC            PIC 9(04) COMP.            005156      
002660        05 A01-R01-INST-SUBC           PIC 9(04) COMP.            005158      
002661        05 A01-R01-MON-SUBC            PIC 9(03) COMP.            005160      
002662        05 A01-R01-CONT-SUBC           PIC 9(16) COMP.            005162      
002663        05 A01-R01-CTAMDA-SUBC         PIC 9(16) COMP.            005164      
002664        05 A01-R01-STA-SUBC            PIC 9(04) COMP.            005166      
002665        05 A01-R01-INDALER-SUBC        PIC 9(04) COMP.            005168      
002666        05 A01-R01-INDCTACON-SUBC      PIC 9(02) COMP.            005170      
002667        05 A01-R01-LEYENDA-SUBC        PIC X(40).                 005171      
002668        05 A01-R01-VALOR-IND           PIC X(02).                 005172      
002669        05 A01-R01-NOMB-BENEF-AMPLI    PIC X(120).                005173      
002670        05 A01-R01-IND-EXTNET          PIC 9(01) COMP.            005174      
002671        05 A01-R01-FILLER              PIC 9(01) COMP.            005176      
002672        05 A01-R01-FILLER-DATOS2-S500  PIC X(205).                005178      
002673*        05 A01-R01-FILLER-DATOS2-S500  PIC X(328).               005180      
002674*        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).               005182      
002675                                                                  005184      
002676     03 FILLER                         PIC X(01).                 005198      
002677     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
002678     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
002679                                                                  005400      
002680******************************************************************005500      
002681*          VARIABLES DE LECTURA DATOS ADICIONALES "2"            *005600      
002682******************************************************************005700      
00268301 A01-R02-TESOFE.                                                005800      
002684    03 A01-R02-AUTS151ORI             PIC 9(08) COMP.             005900      
002685    03 A01-R02-DATOS-2-S500.                                      006000      
002686       05 A01-R02-TRUI.                                           006100      
002687          07 A01-R02-CSIID-RECEPTOR   PIC 9(08) COMP.             006200      
002688          07 A01-R02-CSIID-ORIGEN     PIC 9(08) COMP.             006300      
002689          07 A01-R02-NUM-OPERACION    PIC 9(08) COMP.             006400      
002690          07 A01-R02-NUM-TRANSACCI    PIC 9(08) COMP.             006500      
002691          07 A01-R02-INST-MONETARIO   PIC 9(02) COMP.             006600      
002692       05 A01-R02-MICR.                                           006700      
002693          07 A01-R02-COD-SEGURIDAD    PIC 9(04) COMP.             006800      
002694          07 A01-R02-VER-PREMARCADO   PIC 9(02) COMP.             006900      
002695          07 A01-R02-COD-TRANSMONE    PIC 9(02) COMP.             007000      
002696          07 A01-R02-PLAZA-CECOBAN    PIC 9(04) COMP.             007100      
002697          07 A01-R02-COD-BCOEMISOR    PIC 9(04) COMP.             007200      
002698          07 A01-R02-DIG-VINTERCAM    PIC 9(02) COMP.             007300      
002699          07 A01-R02-NUM-CTACHEQUE    PIC 9(12) COMP.             007400      
002700          07 A01-R02-NUM-REFCHEQUE    PIC 9(08) COMP.             007500      
002701       05 A01-R02-CTA-BENEFOTROBCO    PIC 9(20) COMP.             007600      
002702       05 A01-R02-BCO-RECEPOTROBCO    PIC 9(04) COMP.             007700      
002703       05 A01-R02-NOM-BENEFOTROBCO    PIC X(40).                  007800      
002704       05 A01-R02-RFC-OTROBCO         PIC X(13).                  007900      
002705       05 A01-R02-NOMPAN-S500         PIC X(05).                  008000      
002706       05 A01-R02-OPCPAN-S500         PIC X(01).                  008100      
002707       05 A01-R02-NUMCTO1-S500        PIC 9(16) COMP.             008200      
002708       05 A01-R02-NUMCTO2-S500        PIC 9(16) COMP.             008300      
002709       05 A01-R02-NUMCTO3-S500        PIC 9(16) COMP.             008400      
002710       05 A01-R02-INDIC-EST           PIC 9(08) COMP.             008500      
002711       05 A01-R02-IND-SUBC            PIC 9(01) COMP.             008600      
002712       05 A01-R02-PRO-SUBC            PIC 9(04) COMP.             008700      
002713       05 A01-R02-INST-SUBC           PIC 9(04) COMP.             008800      
002714       05 A01-R02-MON-SUBC            PIC 9(03) COMP.             008900      
002715       05 A01-R02-CONT-SUBC           PIC 9(16) COMP.             009000      
002716       05 A01-R02-CTAMDA-SUBC         PIC 9(16) COMP.             009100      
002717       05 A01-R02-STA-SUBC            PIC 9(04) COMP.             009200      
002718       05 A01-R02-INDALER-SUBC        PIC 9(04) COMP.             009300      
002719       05 A01-R02-INDCTACON-SUBC      PIC 9(02) COMP.             009400      
002720       05 A01-R02-LEYENDA-SUBC        PIC X(40).                  009500      
002721       05 A01-R02-VALOR-IND           PIC X(02).                  009520      
002722       05 A01-R02-NOMB-BENEF-AMPLI    PIC X(120).                 009540      
002723       05 A01-R02-IND-EXTNET          PIC 9(01) COMP.             009545      
002724       05 A01-R02-FILLER              PIC 9(01) COMP.             009550      
002725       05 A01-R02-FILLER-DATOS2-S500  PIC X(205).                 009560      
002726*       05 A01-R02-FILLER-DATOS2-S500  PIC X(327).                009600      
002727                                                                  009700      
002728    03 FILLER                         PIC X(01).                  009800      
002729    03 A01-R02-APUDES                 PIC 9(08) COMP.             009900      
002730    03 A01-R02-TIPREG                 PIC 9(02) COMP.             010000      
002731                                                                  010100      
002732*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002733*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002734*  COPY "(S151)S151/FORMATO/ARCHIVO/S264 ON CMEMP.".              089500      
002735                                                                  001253      
002736                                                                  002253      
002737****************************************************************  003253      
002738*        REGISTRO DEL ARCHIVO DE INTERFASE PARA S264           *  004253      
002739****************************************************************  005253      
002740 01 E00-R00-S264-HDR.                                             006253      
002741    02 E00-R00-TIPREG              PIC X(02) VALUE "00".          007253      
002742    02 E00-R00-SISORI              PIC 9(04) VALUE 151.           008253      
002743    02 E00-R00-SISDES              PIC 9(04) VALUE 264.           009253      
002744    02 E00-R00-FECPRO              PIC 9(06).                     010253      
002745    02 E00-R00-FECPRO-R            REDEFINES E00-R00-FECPRO.      011253      
002746       03 E00-R00-S264-FECPRO-AA   PIC 9(02).                     012253      
002747       03 E00-R00-S264-FECPRO-MM   PIC 9(02).                     013253      
002748       03 E00-R00-S264-FECPRO-DD   PIC 9(02).                     014253      
002749    02 E00-R00-NUMCSI              PIC 9(02).                     015253      
002750    02 E00-R00-CVEPRD              PIC 9(04).                     016253      
002751    02 FILLER                      PIC X(158).                    017253      
002752                                                                  018253      
002753 01 E00-R01-S264-REGMOV.                                          019253      
002754    02 E00-R01-S264-TIPREG         PIC X(02)  VALUE "01".         020253      
002755    02 E00-R01-S264-SUCPRO         PIC 9(04).                     021253      
002756    02 E00-R01-S264-CNT            PIC 9(16).                     022253      
002757    02 E00-R01-S264-CVEMOV         PIC 9(04).                     023253      
002758    02 E00-R01-S264-IMPORTE        PIC 9(12)V99.                  024253      
002759    02 E00-R01-S264-SUCTRA         PIC 9(04).                     025253      
002760    02 E00-R01-S264-CAJTRA         PIC 9(02).                     026253      
002761    02 E00-R01-S264-AUT            PIC 9(06).                     027253      
002762    02 E00-R01-S264-REF            PIC 9(23).                     028253      
002763*   02 E00-R01-S264-REF-R REDEFINES E00-R01-S264-REF.             028273      
002764*      05 E00-R01-S264-REF01POS    PIC X(01).                     028293      
002765*      05 E00-R01-S264-REF14POS    PIC X(14).                     028313      
002766*      05 E00-R01-S264-REF08POS    PIC X(08).                     028333      
002767    02 E00-R01-S264-FECVAL         PIC 9(06).                     028353      
002768    02 E00-R01-S264-NUMREF         PIC 9(12).                     028453      
002769    02 E00-R01-S264-SUCTAR         PIC 9(04).                     029253      
002770    02 E00-R01-S264-NUMTAR         PIC 9(16).                     030253      
002771    02 E00-R01-S264-PROD           PIC 9(04).                     030353      
002772    02 E00-R01-S264-INST           PIC 9(04).                     030453      
002773    02 E00-R01-S264-MONE           PIC 9(03).                     030553      
002774    02 E00-R01-S264-ORIG           PIC 9(02).                     030653      
002775    02 E00-R01-S264-AUT-8DIG       PIC 9(08).                     030753      
002776    02 E00-R01-S264-NUM-ORD-PAGO   PIC 9(18).                     030853      
002777    02 FILLER                      PIC X(28).                     031253      
002778                                                                  032253      
002779 01 E00-R02-S264-TRAILER.                                         033253      
002780    02 E00-R02-S264-TIPREG         PIC X(02) VALUE "09".          034253      
002781    02 E00-R02-S264-TOTREG         PIC 9(06).                     035253      
002782    02 E00-R02-S264-SIGCAR         PIC X(01).                     036253      
002783    02 E00-R02-S264-TOTCAR         PIC 9(16)V99.                  037253      
002784    02 E00-R02-S264-SIGABO         PIC X(01).                     038253      
002785    02 E00-R02-S264-TOTABO         PIC 9(16)V99.                  039253      
002786    02 FILLER                      PIC X(134).                    040253      
002787                                                                  041253      
002788*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002789*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002790*  COPY "(S151)S151/FORMATO/ARCHIVO/S253 ON CMEMP.".              089600      
002791                                                                  001253      
002792                                                                  002253      
002793****************************************************************  003253      
002794*        REGISTRO DEL ARCHIVO DE INTERFASE PARA S253           *  004253      
002795****************************************************************  005253      
002796 01 E00-R00-S253-HDR.                                             006253      
002797    02 E00-R00-TIPREG              PIC X(02) VALUE "00".          007253      
002798    02 E00-R00-SISORI              PIC 9(04) VALUE 151.           008253      
002799    02 E00-R00-SISDES              PIC 9(04) VALUE 253.           009253      
002800    02 E00-R00-FECPRO              PIC 9(06).                     010253      
002801    02 E00-R00-FECPRO-R            REDEFINES E00-R00-FECPRO.      011253      
002802       03 E00-R00-S253-FECPRO-AA   PIC 9(02).                     012253      
002803       03 E00-R00-S253-FECPRO-MM   PIC 9(02).                     013253      
002804       03 E00-R00-S253-FECPRO-DD   PIC 9(02).                     014253      
002805    02 E00-R00-NUMCSI              PIC 9(02).                     015253      
002806    02 E00-R00-CVEPRD              PIC 9(04).                     016253      
002807    02 FILLER                      PIC X(158).                    017253      
002808                                                                  018253      
002809 01 E00-R01-S253-REGMOV.                                          019253      
002810    02 E00-R01-S253-TIPREG         PIC X(02)  VALUE "01".         020253      
002811    02 E00-R01-S253-SUCPRO         PIC 9(04).                     021253      
002812    02 E00-R01-S253-CNT            PIC 9(16).                     022253      
002813    02 E00-R01-S253-CVEMOV         PIC 9(04).                     023253      
002814    02 E00-R01-S253-IMPORTE        PIC 9(12)V99.                  024253      
002815    02 E00-R01-S253-SUCTRA         PIC 9(04).                     025253      
002816    02 E00-R01-S253-CAJTRA         PIC 9(02).                     026253      
002817    02 E00-R01-S253-AUT            PIC 9(06).                     027253      
002818    02 E00-R01-S253-REF            PIC 9(23).                     028253      
002819*   02 E00-R01-S253-REF-R REDEFINES E00-R01-S253-REF.             028273      
002820*      05 E00-R01-S253-REF01POS    PIC X(01).                     028293      
002821*      05 E00-R01-S253-REF14POS    PIC X(14).                     028313      
002822*      05 E00-R01-S253-REF08POS    PIC X(08).                     028333      
002823    02 E00-R01-S253-FECVAL         PIC 9(06).                     028353      
002824    02 E00-R01-S253-NUMREF         PIC 9(12).                     028453      
002825    02 E00-R01-S253-SUCTAR         PIC 9(04).                     029253      
002826    02 E00-R01-S253-NUMTAR         PIC 9(16).                     030253      
002827    02 E00-R01-S253-PROD           PIC 9(04).                     030353      
002828    02 E00-R01-S253-INST           PIC 9(04).                     030453      
002829    02 E00-R01-S253-MONE           PIC 9(03).                     030553      
002830    02 E00-R01-S253-ORIG           PIC 9(02).                     030653      
002831    02 FILLER                      PIC X(54).                     031253      
002832                                                                  032253      
002833 01 E00-R02-S253-TRAILER.                                         033253      
002834    02 E00-R02-S253-TIPREG         PIC X(02) VALUE "09".          034253      
002835    02 E00-R02-S253-TOTREG         PIC 9(06).                     035253      
002836    02 E00-R02-S253-SIGCAR         PIC X(01).                     036253      
002837    02 E00-R02-S253-TOTCAR         PIC 9(16)V99.                  037253      
002838    02 E00-R02-S253-SIGABO         PIC X(01).                     038253      
002839    02 E00-R02-S253-TOTABO         PIC 9(16)V99.                  039253      
002840    02 FILLER                      PIC X(134).                    040253      
002841                                                                  041253      
002842*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002843*BMS                                                              089602      
002844*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002845*  COPY "(S151)S151/FORMATO/ARCHIVO/S253/MOVILES ON CMEMP.".      089604      
002846                                                                  001253      
002847                                                                  001353      
002848***************************************************************** 001453      
002849*  REGISTRO DEL ARCHIVO DE INTERFASE PARA S253 CUENTAS MOVILES  * 001553      
002850***************************************************************** 001653      
002851 01 E15-R00-253-HDR.                                              001753      
002852    02 E15-R00-TIPREG              PIC X(02) VALUE "00".          001853      
002853    02 E15-R00-SISORI              PIC 9(04) VALUE 151.           001953      
002854    02 E15-R00-SISDES              PIC 9(04) VALUE 253.           002053      
002855    02 E15-R00-FECPRO              PIC 9(06).                     002153      
002856    02 E15-R00-FECPRO-R        REDEFINES E15-R00-FECPRO.          002253      
002857       03 E15-R00-S253-FECPRO-AA   PIC 9(02).                     002353      
002858       03 E15-R00-S253-FECPRO-MM   PIC 9(02).                     002453      
002859       03 E15-R00-S253-FECPRO-DD   PIC 9(02).                     002553      
002860    02 E15-R00-NUMCSI              PIC 9(02).                     002653      
002861    02 E15-R00-CVEPRD              PIC 9(04).                     002753      
002862    02 E15-R00-FILLER              PIC X(158).                    002853      
002863                                                                  002953      
002864 01 E15-R01-S253-REGMOV.                                          003053      
002865    02 E15-R01-S253-TIPREG         PIC X(02)  VALUE "01".         003153      
002866    02 E15-R01-S253-SUCPRO         PIC 9(04).                     003253      
002867    02 E15-R01-S253-CNT            PIC 9(16).                     003353      
002868    02 E15-R01-S253-CVEMOV         PIC 9(04).                     003453      
002869    02 E15-R01-S253-IMPORTE        PIC 9(12)V99.                  003553      
002870    02 E15-R01-S253-SUCTRA         PIC 9(04).                     003653      
002871    02 E15-R01-S253-CAJTRA         PIC 9(02).                     003753      
002872    02 E15-R01-S253-AUT            PIC 9(06).                     003853      
002873    02 E15-R01-S253-REF            PIC 9(23).                     003953      
002874    02 E15-R01-S253-FECVAL         PIC 9(06).                     004053      
002875    02 E15-R01-S253-NUMREF         PIC 9(12).                     004153      
002876    02 E15-R01-S253-SUCTAR         PIC 9(04).                     004253      
002877    02 E15-R01-S253-NUMTAR         PIC 9(16).                     004353      
002878    02 E15-R01-S253-PROD           PIC 9(04).                     004453      
002879    02 E15-R01-S253-INST           PIC 9(04).                     004553      
002880    02 E15-R01-S253-MONE           PIC 9(03).                     004653      
002881    02 E15-R01-S253-ORIG           PIC 9(02).                     004753      
002882    02 E15-R01-S253-FECTRAN        PIC 9(08).                     004763      
002883    02 E15-R01-S253-HRATRAN        PIC 9(08).                     004773      
002884    02 E15-R01-S253-FECCONT        PIC 9(08).                     004783      
002885    02 E15-R01-S253-FILLER         PIC X(30).                     004853      
002886                                                                  004953      
002887 01 E15-R02-S253-TRAILER.                                         005053      
002888    02 E15-R02-S253-TIPREG         PIC X(02) VALUE "09".          005153      
002889    02 E15-R02-S253-TOTREG         PIC 9(06).                     005253      
002890    02 E15-R02-S253-SIGCAR         PIC X(01).                     005353      
002891    02 E15-R02-S253-TOTCAR         PIC 9(16)V99.                  005453      
002892    02 E15-R02-S253-SIGABO         PIC X(01).                     005553      
002893    02 E15-R02-S253-TOTABO         PIC 9(16)V99.                  005653      
002894    02 E15-R02-S253-FILLER         PIC X(134).                    005753      
002895                                                                  005853      
002896*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002897*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002898*  COPY "(S151)S151/FORMATO/ARCHIVO/S013/MOVTOS/MPS ON CMEMP.".   089606      
002899******************************************************************000100      
002900**             S151/FORMATO/ARCHIVO/S013/MOVTOS/MPS             **000200      
002901**          S500/FILE/S013/CSIORI/10/MOVTOSMPS/AAMMDD           **000300      
002902**   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS DEL S151-S013-MPS   **000400      
002903**             LONGITUD DEL REGISTRO 180 CARACTERES             **000500      
002904******************************************************************000600      
002905                                                                  000700      
002906 01 E14-R01-S013-HDR.                                             000800      
002907    03 E14-R01-S013-TIPOREG        PIC 9(01) VALUE 1.             000900      
002908    03 E14-R01-S013-SIS-ORI        PIC 9(03) VALUE 151.           001000      
002909    03 E14-R01-S013-SIS-DES        PIC 9(03) VALUE 013.           001100      
002910    03 E14-R01-S013-CSI-ORI        PIC 9(02).                     001200      
002911    03 E14-R01-S013-FECPROCESO     PIC 9(06).                     001300      
002912    03 E14-R01-S013-FECGENERADO    PIC 9(08).                     001400      
002913    03 E14-R01-S013-HORAGENERADO   PIC 9(08).                     001500      
002914    03 E14-R01-S013-FILLER         PIC X(149).                    001600      
002915                                                                  001700      
002916 01 E14-R02-S013-DET.                                             001800      
002917    03 E14-R02-S013-TIPOREG        PIC 9(01) VALUE 2.             001900      
002918    03 E14-R02-S013-CVEMDA         PIC 9(02).                     002000      
002919    03 E14-R02-S013-VALMDE         PIC 9(20).                     002100      
002920    03 E14-R02-S013-IMPORTE        PIC 9(16)V99.                  002200      
002921    03 E14-R02-S013-FOLORI         PIC X(12).                     002300      
002922    03 E14-R02-S013-SISORI         PIC 9(04).                     002400      
002923    03 E14-R02-S013-NATTRAN        PIC X(11).                     002500      
002924    03 E14-R02-S013-HRAORI         PIC 9(06).                     002600      
002925    03 E14-R02-S013-FECORI         PIC 9(06).                     002700      
002926    03 E14-R02-S013-SIRH           PIC 9(04).                     002800      
002927    03 E14-R02-S013-CAJA           PIC 9(04).                     002900      
002928    03 E14-R02-S013-REFER23        PIC 9(23).                     003000      
002929    03 E14-R02-S013-AUTDES         PIC 9(06).                     003100      
002930    03 E14-R02-S013-CVETRAN        PIC 9(06).                     003200      
002931    03 E14-R02-S013-FECMOV         PIC 9(08).                     003300      
002932    03 E14-R02-S013-HRAMOV         PIC 9(06).                     003400      
002933    03 E14-R02-S013-FECCONT        PIC 9(08).                     003500      
002934    03 E14-R02-S013-REFER12        PIC 9(12).                     003530      
002935    03 E14-R02-S013-FILLER         PIC X(23).                     003550      
002936                                                                  003600      
002937 01 E14-R03-S013-TRA.                                             003700      
002938    03 E14-R03-S013-TIPOREG        PIC 9(01) VALUE 3.             003800      
002939    03 E14-R03-S013-TOTREG         PIC 9(08) VALUE 0.             003900      
002940    03 E14-R03-S013-TOTIMP         PIC 9(16)V99 VALUE 0.          004000      
002941    03 E14-R03-S013-FILLER         PIC X(153).                    004100      
002942                                                                  004200      
002943*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002944*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002945*  COPY "(S151)S151/FORMATO/ARCHIVO/S030 ON CMEMP.".              089700      
002946                                                                  001030      
002947                                                                  002030      
002948*=================================================================003030      
002949*==       REGISTRO DEL ARCHIVO DE INTERFASE PARA S030           ==004030      
002950*=================================================================005030      
002951                                                                  006030      
002952 01 E00-R00-HDR-S030.                                             007030      
002953    02 E00-R00-S030-TIP            PIC X(03).                     008030      
002954    02 E00-R00-S030-FECPRO         PIC 9(06).                     009030      
002955    02 E00-R00-S030-FECPRO-R       REDEFINES E00-R00-S030-FECPRO. 010030      
002956       03 E00-R00-S030-FECPRO-DD   PIC 9(02).                     011030      
002957       03 E00-R00-S030-FECPRO-MM   PIC 9(02).                     012030      
002958       03 E00-R00-S030-FECPRO-AA   PIC 9(02).                     013030      
002959    02 E00-R00-S030-FECGEN         PIC 9(06).                     014030      
002960    02 E00-R00-S030-FECGEN-R       REDEFINES E00-R00-S030-FECGEN. 015030      
002961       03 E00-R00-S030-FECGEN-AA   PIC 9(02).                     016030      
002962       03 E00-R00-S030-FECGEN-MM   PIC 9(02).                     017030      
002963       03 E00-R00-S030-FECGEN-DD   PIC 9(02).                     018030      
002964    02 E00-R00-S030-HORGEN         PIC 9(04).                     019030      
002965    02 E00-R00-S030-SISEMI         PIC X(04).                     020030      
002966    02 E00-R00-S030-SISREC         PIC X(04).                     021030      
002967    02 E00-R00-S030-NOMEXT         PIC X(08).                     022030      
002968    02 E00-R00-S030-NUMREG         PIC 9(07).                     023030      
002969    02 E00-R00-S030-CSIORI         PIC X(03).                     024030      
002970    02 E00-R00-S030-CSIDES         PIC X(03).                     025030      
002971    02 FILLER                      PIC X(108).                    026030      
002972                                                                  027030      
002973 01 E00-R01-REGMOV-S030.                                          028030      
002974    03 E00-R01-S030-CSIORI         PIC 9(02).                     029030      
002975    03 E00-R01-S030-NODORI         PIC 9(02).                     030030      
002976    03 E00-R01-S030-CSIDES         PIC 9(02).                     031030      
002977    03 E00-R01-S030-NOMEST         PIC X(08).                     032030      
002978    03 E00-R01-S030-NOMEST-R       REDEFINES E00-R01-S030-NOMEST. 033030      
002979       05 E00-R01-S030-TIP-DIS     PIC X(01).                     034030      
002980       05 E00-R01-S030-SUCORI      PIC 9(04).                     035030      
002981       05 E00-R01-S030-CAJORI      PIC X(03).                     036030      
002982    03 E00-R01-S030-FECGEN         PIC 9(06).                     037030      
002983    03 E00-R01-S030-HORGEN         PIC 9(06).                     038030      
002984    03 E00-R01-S030-HORGEN-R       REDEFINES E00-R01-S030-HORGEN. 039030      
002985       05 E00-R01-S030-HORGEN-HHMM PIC 9(04).                     040030      
002986       05 FILLER                   PIC 9(02).                     041030      
002987    03 E00-R01-S030-APLORI         PIC 9(04).                     042030      
002988    03 E00-R01-S030-APLDES         PIC 9(04).                     043030      
002989    03 E00-R01-S030-STATRN         PIC 9(02).                     044030      
002990    03 E00-R01-S030-CODSER         PIC 9(02).                     045030      
002991    03 E00-R01-S030-SUBSER         PIC 9(03).                     046030      
002992    03 E00-R01-S030-CTADES         PIC 9(20).                     047030      
002993    03 E00-R01-S030-CTADES-R       REDEFINES E00-R01-S030-CTADES. 048030      
002994       05 FILLER                   PIC X(08).                     049030      
002995       05 E00-R01-S030-CTADES-SUC  PIC 9(04).                     050030      
002996       05 E00-R01-S030-CTADES-NUM  PIC 9(08).                     051030      
002997    03 E00-R01-S030-IMPTRN         PIC 9(16)V99.                  052030      
002998    03 E00-R01-S030-MONTRN         PIC 9(03).                     053030      
002999    03 E00-R01-S030-FECCON         PIC 9(06).                     054030      
003000    03 E00-R01-S030-CVEAUT         PIC X(20).                     055030      
003001    03 E00-R01-S030-NUMTRN         PIC 9(08).                     056030      
003002    03 E00-R01-S030-CTAACC         PIC X(20).                     057030      
003003    03 E00-R01-S030-REFOPE         PIC X(20).                     058030      
003004                                                                  059030      
003005 01 E00-R02-TRAILER-S030.                                         060030      
003006    03 E00-R02-S030-ID             PIC X(003).                    061030      
003007    03 E00-R02-S030-NUMREG         PIC 9(007).                    062030      
003008    03 FILLER                      PIC X(146).                    063030      
003009*                                                                 064030      
003010*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003011*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003012*  COPY "(S151)S151/FORMATO/ARCHIVO/S500/PUNTEO ON CMEMP.".       089800      
003013                                                                  001253      
003014                                                                  002253      
003015****************************************************************  003253      
003016*      REGISTRO DEL ARCHIVO DE PUNTEO DE LINEA CON EL S500     *  004253      
003017****************************************************************  005253      
003018 01 E05-R00-S500-HDR.                                             006253      
003019    02 E05-R00-TIPREG              PIC 9(02) VALUE 00.            007253      
003020    02 E05-R00-SISORI              PIC 9(04) VALUE 0151.          008253      
003021    02 E05-R00-SISDES              PIC 9(04).                     009253      
003022    02 E05-R00-FECPRO              PIC 9(06).                     010253      
003023    02 E05-R00-NUMCSI              PIC 9(02).                     012253      
003024    02 E05-R00-FECCREA                      .                     013253      
003025       05  E05-R00-S500-AA         PIC 9(02).                     013353      
003026       05  E05-R00-S500-MM         PIC 9(02).                     013453      
003027       05  E05-R00-S500-DD         PIC 9(02).                     013553      
003028    02 E05-R00-HORA                PIC 9(06).                     015253      
003029    02 FILLER                      PIC X(30) VALUE SPACES.        017253      
003030                                                                  018253      
003031 01 E05-R01-S500-REGMOV.                                          019253      
003032    02 E05-R01-S500-TIPREG         PIC 9(02)      .               020253      
003033       88 E05-REG-LINEA            VALUE 01 THRU 15.              020353      
003034       88 E05-REG-BATCH            VALUE 16 THRU 96.              020453      
003035    02 E05-R01-S500-SUCTRA         PIC 9(04)  COMP.               021253      
003036    02 E05-R01-S500-CAJAT          PIC 9(02)  COMP.               022253      
003037    02 E05-R01-S500-AUTAPL         PIC 9(06)  COMP.               023253      
003038    02 E05-R01-S500-CTO            PIC 9(12)  COMP.               024253      
003039    02 E05-R01-S500-PROD           PIC 9(04)  COMP.               025253      
003040    02 E05-R01-S500-INST           PIC 9(04)  COMP.               026253      
003041    02 E05-R01-S500-MONE           PIC 9(04)  COMP.               027253      
003042    02 E05-R01-S500-CVE            PIC 9(04)  COMP.               028253      
003043    02 E05-R01-S500-IMP            PIC 9(10)V99 COMP.             028273      
003044    02 E05-R01-S500-REFER          PIC 9(12)  COMP.               028353      
003045    02 E05-R01-S500-AUTS151        PIC 9(08)  COMP.               028453      
003046    02 E05-R01-S500-FECHA          PIC 9(06)  COMP.               029253      
003047    02 E05-R01-S500-HORA           PIC 9(06)  COMP.               030253      
003048    02 E05-R01-S500-ORIGEN         PIC 9(02)  COMP.               030353      
003049    02 E05-R01-S500-SISTORI        PIC 9(04)  COMP.               030453      
003050    02 E05-TIPO-PROCESO            PIC 9(02)  COMP.               030553      
003051       88 E05-PROCESO-LINEA        VALUE 01 THRU 15.              030653      
003052       88 E05-PROCESO-BATCH        VALUE 16 THRU 96.              030753      
003053    02 E05-R01-S500-ESQCONTA       PIC 9(04)  COMP.               030853      
003054    02 E05-R01-S500-BCOORIDES      PIC 9(06)  COMP.               030953      
003055    02 FILLER                      PIC 9(06).                     031053      
003056    02 E05-R01-S500-MEDIOENTRE     PIC 9(02)  COMP.               031153      
003057                                                                  032253      
003058 01 E05-R02-S500-TRAILER.                                         033253      
003059    02 E05-R02-S500-TIPREG         PIC 9(02) VALUE 99.            034253      
003060    02 E05-R02-S500-TOTREG         PIC 9(08)    COMP.             035253      
003061    02 E05-R02-S500-TOTIMP         PIC 9(16)V99 COMP.             035353      
003062    02 FILLER                      PIC X(45).                     040253      
003063                                                                  041253      
003064*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003065*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003066*  COPY "(S151)S151/FORMATO/ARCHIVO/S500/PUNTEO/MCH ON CMEMP.".   089820      
003067                                                                  001253      
003068                                                                  002253      
003069****************************************************************  003253      
003070*      REGISTRO DEL ARCHIVO DE PUNTEO DE LINEA CON EL S500     *  004253      
003071****************************************************************  005253      
003072 01 E05-R00-S500-HDR-MCH.                                         006253      
003073    02 E05-R00-TIPREG-MCH           PIC 9(02) VALUE 00.           007253      
003074    02 E05-R00-SISORI-MCH           PIC 9(04) VALUE 0151.         008253      
003075    02 E05-R00-SISDES-MCH           PIC 9(04).                    009253      
003076    02 E05-R00-FECPRO-MCH           PIC 9(06).                    010253      
003077    02 E05-R00-NUMCSI-MCH           PIC 9(02).                    012253      
003078    02 E05-R00-FECCREA-MCH                   .                    013253      
003079       05  E05-R00-S500-AA-MCH      PIC 9(02).                    013353      
003080       05  E05-R00-S500-MM-MCH      PIC 9(02).                    013453      
003081       05  E05-R00-S500-DD-MCH      PIC 9(02).                    013553      
003082    02 E05-R00-HORA-MCH             PIC 9(06).                    015253      
003083    02 FILLER                       PIC X(150) VALUE SPACES.      017253      
003084                                                                  018253      
003085 01 E05-R01-S500-REGMOV-MCH.                                      019253      
003086    02 E05-R01-S500-TIPREG-MCH      PIC 9(02)      .              020253      
003087       88 E05-REG-LINEA-MCH         VALUE 01 THRU 15.             020353      
003088       88 E05-REG-BATCH-MCH         VALUE 16 THRU 96.             020453      
003089    02 E05-R01-S500-SUCTRA-MCH      PIC 9(04)   .                 021253      
003090    02 E05-R01-S500-CAJAT-MCH       PIC 9(02)   .                 022253      
003091    02 E05-R01-S500-AUTAPL-MCH      PIC 9(06)   .                 023253      
003092    02 E05-R01-S500-CTO-MCH         PIC 9(12)   .                 024253      
003093    02 E05-R01-S500-PROD-MCH        PIC 9(04)   .                 025253      
003094    02 E05-R01-S500-INST-MCH        PIC 9(04)   .                 026253      
003095    02 E05-R01-S500-MONE-MCH        PIC 9(04)   .                 027253      
003096    02 E05-R01-S500-CVE-MCH         PIC 9(04)   .                 028253      
003097    02 E05-R01-S500-IMP-MCH         PIC 9(10)V99.                 028273      
003098    02 E05-R01-S500-REFER-MCH       PIC 9(12)   .                 028353      
003099    02 E05-R01-S500-AUTS151-MCH     PIC 9(08)   .                 028453      
003100    02 E05-R01-S500-FECHA-MCH       PIC 9(06)   .                 029253      
003101    02 E05-R01-S500-HORA-MCH        PIC 9(06)   .                 030253      
003102    02 E05-R01-S500-ORIGEN-MCH      PIC 9(02)   .                 030353      
003103    02 E05-R01-S500-SISTORI-MCH     PIC 9(04)   .                 030453      
003104    02 E05-TIPO-PROCESO-MCH         PIC 9(02)   .                 030553      
003105       88 E05-PROCESO-LINEA-MCH     VALUE 01 THRU 15.             030653      
003106       88 E05-PROCESO-BATCH-MCH     VALUE 16 THRU 96.             030753      
003107    02 E05-R01-S500-ESQCONTA-MCH    PIC 9(04)   .                 030853      
003108    02 E05-R01-S500-BCOORIDES-MCH   PIC 9(06)   .                 030953      
003109    02 E05-R01-S500-AUTAPL-8DIG-MCH PIC 9(08)  .                  031003      
003110    02 E05-R01-S500-REFNUM-MCH      PIC 9(18).                    031023      
003111    02 FILLER                       PIC X(48)   .                 031053      
003112    02 E05-R01-S500-MEDIOENTRE-MCH  PIC 9(02)   .                 031153      
003113                                                                  032253      
003114 01 E05-R02-S500-TRAILER-MCH.                                     033253      
003115    02 E05-R02-S500-TIPREG-MCH      PIC 9(02) VALUE 99.           034253      
003116    02 E05-R02-S500-TOTREG-MCH      PIC 9(08)   .                 035253      
003117    02 E05-R02-S500-TOTIMP-MCH      PIC 9(16)V99.                 035353      
003118    02 FILLER                       PIC X(152).                   040253      
003119                                                                  041253      
003120*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003121*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003122*  COPY "(S151)S151/FORMATO/ARCHIVO/S500/PUNTEO/PAG/19MTP004 ON CM089860      
003123*-      "MP.".                                                    089880      
003124                                                                  001253      
003125                                                                  002253      
003126****************************************************************  003253      
003127*      REGISTRO DEL ARCHIVO DE PUNTEO DE LINEA CON EL S500     *  004253      
003128****************************************************************  005253      
003129 01 E05-R00-S500-HDR-PAG.                                         006253      
003130    02 E05-R00-TIPREG-PAG           PIC 9(02)  VALUE 00.          007253      
003131    02 E05-R00-SISORI-PAG           PIC 9(04)  VALUE 0151.        008253      
003132    02 E05-R00-SISDES-PAG           PIC 9(04)  VALUE 0999.        009253      
003133    02 E05-R00-FECPRO-PAG           PIC 9(06)   .                 010253      
003134    02 E05-R00-NUMCSI-PAG           PIC 9(02)   .                 012253      
003135    02 E05-R00-PROORI-PAG           PIC 9(04)  VALUE 0999.        013253      
003136    02 FILLER                       PIC X(158) VALUE SPACES.      017253      
003137                                                                  018253      
003138 01 E05-R01-S500-REGMOV-PAG.                                      019253      
003139    02 E05-R01-S500-TIPREG-PAG      PIC 9(02)  VALUE 01.          020253      
003140    02 E05-R01-S500-SUCPRO-PAG      PIC 9(04)   .                 021253      
003141    02 E05-R01-S500-CONTRA-PAG      PIC 9(16)   .                 022253      
003142    02 E05-R01-S500-CVETRA-PAG      PIC 9(04)   .                 023253      
003143    02 E05-R01-S500-IMPORT-PAG      PIC 9(12)V99.                 024253      
003144    02 E05-R01-S500-SUCTRA-PAG      PIC 9(04)   .                 025253      
003145    02 E05-R01-S500-CAJTRA-PAG      PIC 9(02)   .                 026253      
003146    02 E05-R01-S500-AUT151-PAG      PIC 9(08)   .                 027253      
003147    02 E05-R01-S500-FECVAL-PAG      PIC 9(06)   .                 028253      
003148    02 E05-R01-S500-REFNUM-PAG      PIC 9(12)   .                 028273      
003149    02 E05-R01-S500-SUCMDA-PAG      PIC 9(04)   .                 028353      
003150    02 E05-R01-S500-CTAMDA-PAG      PIC 9(16)   .                 028453      
003151    02 E05-R01-S500-PRODUC-PAG      PIC 9(04)   .                 029253      
003152    02 E05-R01-S500-INSTRU-PAG      PIC 9(04)   .                 030253      
003153    02 E05-R01-S500-MONEDA-PAG      PIC 9(03)   .                 030353      
003154    02 E05-R01-S500-ORIGEN-PAG      PIC 9(02)   .                 030453      
003155    02 E05-R01-S500-AUTAPL-PAG      PIC 9(08)   .                 031003      
003156    02 FILLER                       PIC X(67)  VALUE SPACES.      031053      
003157                                                                  032253      
003158 01 E05-R02-S500-TRAILER-PAG.                                     033253      
003159    02 E05-R02-S500-TIPREG-PAG      PIC 9(02)  VALUE 09.          034253      
003160    02 E05-R02-S500-TOTREG-PAG      PIC 9(06)   .                 035253      
003161    02 E05-R02-S500-RELLE1-PAG      PIC X      VALUE SPACES.      035353      
003162    02 E05-R02-S500-TOTCAR-PAG      PIC 9(16)V99.                 035453      
003163    02 E05-R02-S500-RELLE2-PAG      PIC X      VALUE SPACES.      040253      
003164    02 E05-R02-S500-TOTABO-PAG      PIC 9(16)V99.                 041253      
003165    02 FILLER                       PIC X(134) VALUE SPACES.      041353      
003166*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003167*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003168*  COPY "(S151)S151/FORMATO/ARCHIVO/PBANCOS ON CMEMP.".           089900      
003169                                                                  000100      
003170                                                                  000200      
003171******************************************************************000300      
003172*         REGISTRO   DEL ARCHIVO DE PUNTEO PARA CSIÀS DE BANCOS   000400      
003173*         BANAMEX BANCOMER  LOS MOVIMIENTOS QUE LE OPERO          000500      
003174******************************************************************000600      
003175                                                                  000700      
003176 01 E00-R00-PBCOS-HDR.                                            000800      
003177    03 E00-R00-PBCOS-TIPREG          PIC 9(02).                   000900      
003178    03 E00-R00-PBCOS-BCOS            PIC 9(06).                   001000      
003179    03 E00-R00-PBCOS-BCOS-R  REDEFINES E00-R00-PBCOS-BCOS.        001100      
003180       05 E00-R00-PBCOS-BCOORI       PIC 9(03).                   001200      
003181       05 E00-R00-PBCOS-BCODES       PIC 9(03).                   001300      
003182    03 E00-R00-PBCOS-FECGENERADO     PIC 9(08).                   001400      
003183    03 E00-R00-PBCOS-HORAGENERADO    PIC 9(08).                   001500      
003184    03 E00-R00-PBCOS-FECPROCESO      PIC 9(08).                   001600      
003185    03 FILLER                       PIC X(78).                    001700      
003186                                                                  001800      
003187 01 E00-R01-PBCOS-REGMOV.                                         001900      
003188    03 E00-R01-PBCOS-TIPREG               PIC 9(02).              002000      
003189    03 E00-R01-PBCOS-BCOS                 PIC 9(06).              002100      
003190    03 E00-R01-PBCOS-BCOS-R REDEFINES  E00-R01-PBCOS-BCOS.        002200      
003191       05 E00-R01-PBCOS-BCOORI            PIC 9(03).              002300      
003192       05 E00-R01-PBCOS-BCODES            PIC 9(03).              002400      
003193    03 E00-R01-PBCOS-SIS-GENERA           PIC X(04).              002500      
003194    03 E00-R01-PBCOS-PLAZA-BMR            PIC 9(03).              002600      
003195    03 E00-R01-PBCOS-SUCURSAL-BMR         PIC 9(04).              002700      
003196    03 E00-R01-PBCOS-MONEDA-BMR           PIC 9(02).              002800      
003197    03 E00-R01-PBCOS-CUENTA-BMR           PIC 9(12).              002900      
003198    03 E00-R01-PBCOS-TIPOCTA-BMR          PIC X(02).              003000      
003199    03 E00-R01-PBCOS-TIPO-CHEQUERA        PIC 9(02).              003100      
003200    03 E00-R01-PBCOS-CVE-TRAN             PIC 9(02).              003200      
003201    03 E00-R01-PBCOS-CVE-CARABO           PIC 9(02).              003300      
003202    03 E00-R01-PBCOS-CVE-AUT              PIC 9(08).              003400      
003203    03 E00-R01-PBCOS-IMPORTE              PIC 9(11)V99.           003500      
003204    03 E00-R01-PBCOS-REF-CHEQUE           PIC 9(12).              003600      
003205    03 E00-R01-PBCOS-VERIF-FIRMA          PIC 9(01).              003700      
003206    03 E00-R01-PBCOS-SUC-OPE              PIC 9(04).              003800      
003207    03 E00-R01-PBCOS-TERM-OPE             PIC 9(03).              003900      
003208    03 E00-R01-PBCOS-TERM-FIL             PIC X(01).              003905      
003209    03 E00-R01-PBCOS-USUA-OPE             PIC X(08).              004000      
003210    03 E00-R01-PBCOS-USUA-OPE-R REDEFINES E00-R01-PBCOS-USUA-OPE  004020      
003211                                          PIC 9(08).              004070      
003212    03 E00-R01-PBCOS-HORA-OPE             PIC 9(06).              004100      
003213    03 E00-R01-PBCOS-FECH-OPE             PIC 9(08).              004150      
003214    03 FILLER                            PIC X(05).               004200      
003215                                                                  004300      
003216 01 E00-R02-PBCOS-TRAILER.                                        004400      
003217    03 E00-R02-PBCOS-TIPREG               PIC 9(02).              004500      
003218    03 E00-R02-PBCOS-TOTREG               PIC 9(08).              004600      
003219    03 E00-R02-PBCOS-NUMCAR               PIC 9(08).              004700      
003220    03 E00-R02-PBCOS-IMPCAR               PIC 9(16)V99.           004800      
003221    03 E00-R02-PBCOS-NUMABO               PIC 9(08).              004900      
003222    03 E00-R02-PBCOS-IMPABO               PIC 9(16)V99.           005000      
003223    03 FILLER                            PIC X(46).               005100      
003224*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003225*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003226*  COPY "(S151)S151/FORMATO/ARCHIVO/S036 ON CMEMP.".              090000      
003227                                                                  001253      
003228                                                                  002253      
003229****************************************************************  003253      
003230*        REGISTRO DEL ARCHIVO DE INTERFASE PARA S036           *  004253      
003231****************************************************************  005253      
003232 01 E00-R00-S036-HDR.                                             006253      
003233    02 E00-R00-S036-TIPREG         PIC X(02) VALUE "00".          007253      
003234    02 E00-R00-S036-SISORI         PIC 9(04) VALUE 151.           008253      
003235    02 E00-R00-S036-SISDES         PIC 9(04) VALUE 036.           009253      
003236    02 E00-R00-S036-FECPRO         PIC 9(06).                     010253      
003237    02 E00-R00-S036-FECPRO-R REDEFINES E00-R00-S036-FECPRO.       011253      
003238       03 E00-R00-S036-FECPRO-AA   PIC 9(02).                     012253      
003239       03 E00-R00-S036-FECPRO-MM   PIC 9(02).                     013253      
003240       03 E00-R00-S036-FECPRO-DD   PIC 9(02).                     014253      
003241    02 E00-R00-S036-NUMCSI         PIC 9(02).                     015253      
003242    02 E00-R00-S036-CVEPRD         PIC 9(04) VALUE 0066.          016253      
003243    02 FILLER                      PIC X(158).                    017253      
003244                                                                  018253      
003245 01 E00-R01-S036-REGMOV.                                          019253      
003246    02 E00-R01-S036-TIPREG         PIC X(02)  VALUE "01".         020253      
003247    02 E00-R01-S036-SUCPRO         PIC 9(04).                     021253      
003248    02 E00-R01-S036-CNT            PIC 9(16).                     022253      
003249    02 E00-R01-S036-CVEMOV         PIC 9(04).                     023253      
003250    02 E00-R01-S036-IMPORTE        PIC 9(12)V99.                  024253      
003251    02 E00-R01-S036-SUCTRA         PIC 9(04).                     025253      
003252    02 E00-R01-S036-CAJTRA         PIC 9(02).                     026253      
003253    02 E00-R01-S036-AUT            PIC 9(06).                     027253      
003254    02 E00-R01-S036-FECVAL         PIC 9(06).                     028253      
003255    02 E00-R01-S036-NUMREF         PIC 9(12).                     028353      
003256    02 E00-R01-S036-REF23DIG       PIC 9(23).                     028453      
003257    02 E00-R01-S036-SUCTAR         PIC 9(04).                     029253      
003258    02 E00-R01-S036-NUMTAR         PIC 9(16).                     030253      
003259    02 E00-R01-S036-PROD           PIC 9(04).                     030353      
003260    02 E00-R01-S036-INST           PIC 9(04).                     030453      
003261    02 E00-R01-S036-MONE           PIC 9(03).                     030553      
003262    02 E00-R01-S036-ORIG           PIC 9(02).                     030653      
003263    02 E00-R01-S036-FECMOV         PIC 9(08).                     030753      
003264    02 E00-R01-S036-HORMOV         PIC 9(06).                     030853      
003265    02 FILLER                      PIC X(40).                     031253      
003266                                                                  032253      
003267 01 E00-R02-S036-TRAILER.                                         033253      
003268    02 E00-R02-S036-TIPREG         PIC X(02) VALUE "09".          034253      
003269    02 E00-R02-S036-TOTREG         PIC 9(06).                     035253      
003270    02 E00-R02-S036-TOTCAR         PIC 9(16)V99.                  037253      
003271    02 E00-R02-S036-TOTABO         PIC 9(16)V99.                  039253      
003272    02 FILLER                      PIC X(136).                    040253      
003273                                                                  041253      
003274*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003275*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003276*  COPY "(S151)S151/FORMATO/ARCHIVO/PFORANEOS ON CMEMP.".         090100      
003277                                                                  000100      
003278******************************************************************000200      
003279*                                                                *000300      
003280*   DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS FORANEOS (PUNTEO)     *000400      
003281*   LONGITUD DEL REGISTRO 45 CARACTERES                          *000500      
003282*                                                                *000600      
003283******************************************************************000700      
003284                                                                  000800      
003285 01 A00-F00-HDR-FOR.                                              000900      
003286    02 A00-F00-HDR-TIPO                PIC  9(02) COMP.           001000      
003287    02 A00-F00-HDR-FCH                 PIC  9(08) COMP.           001100      
003288    02 FILLER                          PIC  X(40).                001200      
003289                                                                  001300      
003290 01 A00-F01-REG-FOR.                                              001400      
003291    03 A00-F01-KEY                     PIC  X(29).                001500      
003292    03 A00-F01-KEY-R                   REDEFINES A00-F01-KEY.     001600      
003293       05 A00-F01-TIPO                 PIC  9(02)      COMP.      001700      
003294       05 A00-F01-MONEDA               PIC  9(04)      COMP.      001800      
003295       05 A00-F01-AUTORIZA             PIC  9(08)      COMP.      001900      
003296       05 A00-F01-SUC-INIC             PIC  9(04)      COMP.      002000      
003297       05 A00-F01-CAJA-INIC            PIC  9(04)      COMP.      002100      
003298       05 A00-F01-CONTRATO             PIC  9(16)      COMP.      002200      
003299       05 A00-F01-CVETRAN1             PIC  9(04)      COMP.      002300      
003300       05 A00-F01-IMPORTE1             PIC  9(14)V99   COMP.      002400      
003301    03 A00-F01-PRODUCTO                PIC  9(04)      COMP.      002500      
003302    03 A00-F01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
003303    03 A00-F01-SUCPROM                 PIC  9(04)      COMP.      002700      
003304    03 A00-F01-AUT-S151                PIC  9(08)      COMP.      002800      
003305    03 A00-F01-SUC-ADI                 PIC  9(04)      COMP.      002900      
003306    03 A00-F01-CAJA-ADI                PIC  9(04)      COMP.      003000      
003307    03 A00-F01-BCO-ORI                 PIC  9(03)      COMP.      003200      
003308    03 A00-F01-BCO-DES                 PIC  9(03)      COMP.      003300      
003309    03 A00-F01-INDSUBCTA               PIC  9(02)      COMP.      003400      
003310*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003311*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003312*  COPY "(S151)S151/FORMATO/ARCHIVO/S054 ON CMEMP.".              090200      
003313                                                                  001253      
003314                                                                  002253      
003315****************************************************************  003253      
003316*        REGISTRO DEL ARCHIVO DE INTERFASE PARA S054           *  004253      
003317****************************************************************  005253      
003318 01 E00-R00-S054-HDR.                                             006253      
003319    02 E00-R00-S054-TIPREG         PIC X(02) VALUE "00".          007253      
003320    02 E00-R00-S054-SISORI         PIC 9(04) VALUE 151.           008253      
003321    02 E00-R00-S054-SISDES         PIC 9(04) VALUE 054.           009253      
003322    02 E00-R00-S054-FECPRO         PIC 9(06).                     010253      
003323    02 E00-R00-S054-FECPRO-R       REDEFINES E00-R00-S054-FECPRO. 011253      
003324       03 E00-R00-S054-FECPRO-AA   PIC 9(02).                     012253      
003325       03 E00-R00-S054-FECPRO-MM   PIC 9(02).                     013253      
003326       03 E00-R00-S054-FECPRO-DD   PIC 9(02).                     014253      
003327    02 E00-R00-S054-NUMCSI         PIC 9(02).                     015253      
003328    02 E00-R00-S054-CVEPRD         PIC 9(04) VALUE 0066.          016253      
003329    02 FILLER                      PIC X(158).                    017253      
003330                                                                  018253      
003331 01 E00-R01-S054-REGMOV.                                          019253      
003332    02 E00-R01-S054-TIPREG         PIC X(02)  VALUE "01".         020253      
003333    02 E00-R01-S054-SUCPRO         PIC 9(04).                     021253      
003334    02 E00-R01-S054-CNT            PIC 9(16).                     022253      
003335    02 E00-R01-S054-CVEMOV         PIC 9(04).                     023253      
003336    02 E00-R01-S054-IMPORTE        PIC 9(12)V99.                  024253      
003337    02 E00-R01-S054-SUCTRA         PIC 9(04).                     025253      
003338    02 E00-R01-S054-CAJTRA         PIC 9(02).                     026253      
003339    02 E00-R01-S054-AUT            PIC 9(06).                     027253      
003340    02 E00-R01-S054-REF            PIC 9(23).                     028253      
003341*   02 E00-R01-S054-REF-R REDEFINES E00-R01-S054-REF.             028273      
003342*      05 E00-R01-S054-REF01POS    PIC X(01).                     028293      
003343*      05 E00-R01-S054-REF14POS    PIC X(14).                     028313      
003344*      05 E00-R01-S054-REF08POS    PIC X(08).                     028333      
003345    02 E00-R01-S054-FECVAL         PIC 9(06).                     028353      
003346    02 E00-R01-S054-NUMREF         PIC 9(12).                     028453      
003347    02 E00-R01-S054-SUCTAR         PIC 9(04).                     029253      
003348    02 E00-R01-S054-NUMTAR         PIC 9(16).                     030253      
003349    02 E00-R01-S054-PROD           PIC 9(04).                     030353      
003350    02 E00-R01-S054-INST           PIC 9(04).                     030453      
003351    02 E00-R01-S054-MONE           PIC 9(03).                     030553      
003352    02 E00-R01-S054-ORIG           PIC 9(02).                     030653      
003353    02 FILLER                      PIC X(54).                     031253      
003354                                                                  032253      
003355 01 E00-R02-S054-TRAILER.                                         033253      
003356    02 E00-R02-S054-TIPREG         PIC X(02) VALUE "09".          034253      
003357    02 E00-R02-S054-TOTREG         PIC 9(06).                     035253      
003358    02 E00-R02-S054-SIGCAR         PIC X(01).                     036253      
003359    02 E00-R02-S054-TOTCAR         PIC 9(16)V99.                  037253      
003360    02 E00-R02-S054-SIGABO         PIC X(01).                     038253      
003361    02 E00-R02-S054-TOTABO         PIC 9(16)V99.                  039253      
003362    02 FILLER                      PIC X(134).                    040253      
003363                                                                  041253      
003364*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003365*** INI EAS 2023R03                                               090202      
003366*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003367*  COPY "(S151)S151/FORMATO/ARCHIVO/SEAS ON CMEMP.".              090204      
003368                                                                  001253      
003369                                                                  002253      
003370****************************************************************  003253      
003371*        REGISTRO DEL ARCHIVO DE INTERFASE PARA EAS            *  004253      
003372****************************************************************  005253      
003373 01 E00-R00-EAS-HDR.                                              006253      
003374    02 E00-R00-EAS-TIPREG         PIC X(02) VALUE "00".           007253      
003375    02 E00-R00-EAS-SISORI         PIC 9(04) VALUE 151.            008253      
003376    02 E00-R00-EAS-SISDES         PIC X(04) VALUE "SEAS".         009253      
003377    02 E00-R00-EAS-FECPRO         PIC 9(06).                      010253      
003378    02 E00-R00-EAS-FECPRO-R       REDEFINES E00-R00-EAS-FECPRO.   011253      
003379       03 E00-R00-EAS-FECPRO-AA   PIC 9(02).                      012253      
003380       03 E00-R00-EAS-FECPRO-MM   PIC 9(02).                      013253      
003381       03 E00-R00-EAS-FECPRO-DD   PIC 9(02).                      014253      
003382    02 E00-R00-EAS-NUMCSI         PIC 9(02).                      015253      
003383    02 E00-R00-EAS-CVEPRD         PIC 9(04) VALUE ZEROS.          016253      
003384    02 FILLER                     PIC X(158).                     017253      
003385                                                                  018253      
003386 01 E00-R01-EAS-REGMOV.                                           019253      
003387    02 E00-R01-EAS-TIPREG         PIC X(02)  VALUE "01".          020253      
003388    02 E00-R01-EAS-SUCPRO         PIC 9(04).                      021253      
003389    02 E00-R01-EAS-CNT            PIC 9(16).                      022253      
003390    02 E00-R01-EAS-CVEMOV         PIC 9(04).                      023253      
003391    02 E00-R01-EAS-IMPORTE        PIC 9(12)V99.                   024253      
003392    02 E00-R01-EAS-SUCTRA         PIC 9(04).                      025253      
003393    02 E00-R01-EAS-CAJTRA         PIC 9(02).                      026253      
003394    02 E00-R01-EAS-AUT            PIC 9(06).                      027253      
003395    02 E00-R01-EAS-REF            PIC 9(23).                      028253      
003396    02 E00-R01-EAS-FECVAL         PIC 9(06).                      028353      
003397    02 E00-R01-EAS-NUMREF         PIC 9(12).                      028453      
003398    02 E00-R01-EAS-SUCTAR         PIC 9(04).                      029253      
003399    02 E00-R01-EAS-NUMTAR         PIC 9(16).                      030253      
003400    02 E00-R01-EAS-PROD           PIC 9(04).                      030353      
003401    02 E00-R01-EAS-INST           PIC 9(04).                      030453      
003402    02 E00-R01-EAS-MONE           PIC 9(03).                      030553      
003403    02 E00-R01-EAS-ORIG           PIC 9(02).                      030653      
003404    02 FILLER                     PIC X(54).                      031253      
003405                                                                  032253      
003406 01 E00-R02-EAS-TRAILER.                                          033253      
003407    02 E00-R02-EAS-TIPREG         PIC X(02) VALUE "09".           034253      
003408    02 E00-R02-EAS-TOTREG         PIC 9(06).                      035253      
003409    02 E00-R02-EAS-SIGCAR         PIC X(01).                      036253      
003410    02 E00-R02-EAS-TOTCAR         PIC 9(16)V99.                   037253      
003411    02 E00-R02-EAS-SIGABO         PIC X(01).                      038253      
003412    02 E00-R02-EAS-TOTABO         PIC 9(16)V99.                   039253      
003413    02 FILLER                     PIC X(134).                     040253      
003414                                                                  041253      
003415*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003416*** FIN EAS 2023R03                                               090206      
003417*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003418*  COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."        090310      
003419*                                      FROM 000100 TO 099999      090320      
003420                                                                  000100      
003421*----------------------------------------------------------------*000200      
003422*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
003423*----------------------------------------------------------------*000400      
003424 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
003425 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
003426 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
003427 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
003428 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
003429 77  W77-MEMORY-65K               PIC  9(018) COMP.               001000      
003430 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
003431 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
003432     02 WS-WORD-ENT               PIC  9(012).                    001300      
003433     02 WS-WORD-RES               PIC  9(002).                    001400      
003434                                                                  001500      
003435*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003436*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003437*  COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".          090400      
003438**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
003439  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
003440  01 MENSAJE-LJ.                                                  100300      
003441     02 SISTEMA-LJ     PIC X(04).                                 100400      
003442     02 FILLER         PIC X VALUE "/".                           100500      
003443     02 PASO-LJ        PIC X(04).                                 100600      
003444     02 FILLER         PIC X VALUE "/".                           100700      
003445     02 MTP-LJ         PIC 9(03).                                 100800      
003446     02 FILLER         PIC X VALUE ":".                           100900      
003447     02 TIPO-LJ        PIC X.                                     101000      
003448     02 FILLER         PIC X VALUE ">".                           101100      
003449     02 CODIGO-LJ      PIC 9(06).                                 101200      
003450     02 FILLER         PIC X VALUE "<".                           101300      
003451     02 TEXTO-LJ       PIC X(250).                                101400      
003452*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003453*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003454*  COPY "(S151)S151/FORMATO/ARCHIVO/SORIBAN ON CMEMP.".           090410      
003455                                                                  000100      
003456******************************************************************000200      
003457**            S151/FORMATO/ARCHIVO/SORIBAN                      **000300      
003458**        S500/FILE/S151/csi/SORIBAN/AAAAMMDD                     000400      
003459**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS DEL S151-SORIANA     **000500      
003460**  LONGITUD DEL REGISTRO 129 CARACTERES                        **000600      
003461******************************************************************000700      
003462                                                                  000800      
003463 01 E13-REG-SORIANA.                                              000900      
003464    03 E13-R00-SORI-TIPO-REG        PIC 9(01).                    001000      
003465    03 E13-R00-SORI-HDR.                                          001100      
003466       05 E13-R01-SORI              PIC X(07).                    001200      
003467       05 E13-R01-SORI-CSI-ORI      PIC 9(02).                    001300      
003468       05 E13-R01-SORI-FECPROCESO   PIC 9(06).                    001400      
003469       05 E13-R01-SORI-FECGENERADO  PIC 9(08).                    001500      
003470       05 E13-R01-SORI-HORAGENERADO PIC 9(08).                    001600      
003471       05 E13-R01-SORI-FILLER       PIC X(100).                   001700      
003472                                                                  001800      
003473    03 E13-R00-SORI-DET REDEFINES E13-R00-SORI-HDR.               001900      
003474       05 E13-R02-FECMOV                  PIC  9(08).             002000      
003475       05 E13-R02-HORMOV                  PIC  9(06).             002100      
003476       05 E13-R02-SISTEMA                 PIC  9(04).             002200      
003477       05 E13-R02-MONEDA                  PIC  9(04).             002300      
003478       05 E13-R02-NOMINA-OPE              PIC  9(14).             002400      
003479       05 E13-R02-TIENDA                  PIC  9(04).             002500      
003480       05 E13-R02-MDA-SUC                 PIC  9(04).             002600      
003481       05 E13-R02-MDA-CTA                 PIC  9(16).             002700      
003482       05 E13-R02-AUTORIZA                PIC  9(18).             002800      
003483       05 E13-R02-REFNUM                  PIC  9(18).             002900      
003484       05 E13-R02-SUC-INIC                PIC  9(04).             003000      
003485       05 E13-R02-CAJA-INIC               PIC  9(04).             003100      
003486       05 E13-R02-SUCPROM                 PIC  9(04).             003200      
003487       05 E13-R02-IMPORTE                 PIC  9(16)V99.          003300      
003488       05 E13-R02-CVE-TIP                 PIC  9(02).             003400      
003489       05 E13-R02-FILLER                  PIC  X(03).             003500      
003490                                                                  003600      
003491    03 E13-R00-SORI-TRL REDEFINES E13-R00-SORI-HDR.               003700      
003492       05 E13-R09-SORI-TOTREG       PIC 9(08).                    003800      
003493       05 E13-R09-SORI-TOTIMP       PIC 9(16)V99.                 003900      
003494       05 E13-R09-SORI-FILLER       PIC X(105).                   004000      
003495                                                                  004100      
003496                                                                  004200      
003497*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003498*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003499*  COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS/S500/PORTABILIDADPG    090420      
003500*-       "/BATCH ON CMEMP.".                                      090430      
003501******************************************************************000100      
003502**        FORMATO DEL ARCHIVO DE PORTABILIDAD EN BATCH :        **000200      
003503**     S151/FORMATO/ARCHIVO/MOVTOS/S500/PORTABILIDAD/BATCH.     **000300      
003504**    NOMBRE ARCHIVO :                                          **000400      
003505**    S500/FILE/INTS/50011S03/NO/MOVSPORTABILIDADPG/AAAAMMDD    **000500      
003506**    DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS DEL S500-S151-PG   **000600      
003507**             LONGITUD DEL REGISTRO 52 CARACTERES.             **000700      
003508******************************************************************000800      
003509                                                                  000900      
003510******************************************************************001000      
003511*     REGISTRO DEL ARCHIVO DE INTERFACE PARA PG PORTABILIDAD     *001100      
003512******************************************************************001200      
003513                                                                  001300      
003514 01 E06-PORTPG-HDR-CRL.                                           001400      
003515    03 E06-PORTPG-HDR-TIPO        PIC 9(01) VALUE 1.              001500      
003516    03 E06-PORTPG-HDR-FECH        PIC 9(06).                      001600      
003517    03 FILLER                     PIC X(45) VALUE SPACES.         001700      
003518                                                                  001800      
003519 01 E06-PORTPG-DET-IND WITH LOWER-BOUNDS.                         001900      
003520    03 E06-PORTPG-DET-TIPO        PIC 9(01) VALUE 3.              002000      
003521    03 E06-PORTPG-DET-CVET        PIC 9(04).                      002100      
003522    03 E06-PORTPG-DET-NUM-CLABE   PIC 9(20).                      002200      
003523    03 E06-PORT-DET-CLABE-RED REDEFINES E06-PORTPG-DET-NUM-CLABE. 002300      
003524       05 E06-PORTPG-DET-CLABE-CER PIC 9(02).                     002400      
003525       05 E06-PORTPG-DET-CLABE     PIC 9(18).                     002500      
003526    03 E06-PORTPG-DET-BANCO-DEST  PIC 9(05).                      002600      
003527    03 E06-PORTPG-DET-TIP-CTA-BEN PIC 9(02).                      002700      
003528    03 E06-PORTPG-DET-NUMS        PIC 9(04).                      002800      
003529    03 E06-PORTPG-DET-NUMC        PIC 9(16).                      002900      
003530                                                                  003000      
003531 01 E06-PORTPG-TRA-TOT.                                           003100      
003532    03 E06-PORTPG-TRA-TIPO        PIC 9(01) VALUE 4.              003200      
003533    03 E06-PORTPG-TRA-NUMA        PIC 9(08).                      003300      
003534    03 FILLER                     PIC X(43) VALUE SPACES.         003400      
003535*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003536*                                                                 090489      
003537 01 WKS-BIN-MOVIL                   PIC 9(01).                    090490      
003538    88 BIN-MOVIL                    VALUE 1.                      090491      
003539                                                                  090492      
003540 01 WKS-CTA-MOVIL                  PIC 9(04).                     090493      
003541    88 CTA-MOVIL                   VALUE 5600 THRU 5720.          090494      
003542 01 WKS-VAL-MDA                    PIC 9(16).                     090495      
003543 01 WKS-VALMDA-R REDEFINES WKS-VAL-MDA.                           090496      
003544    03 WKS-MDA-BIN                 PIC 9(06).                     090497      
003545    03 WKS-MDA-RESTO               PIC 9(10).                     090498      
003546 01 WKS-MDA-1                      PIC 9(10).                     090500      
003547 01 WKS-MDA-2                      PIC 9(10).                     090502      
003548 01 WKS-MDA-4                      PIC 9(10).                     090504      
003549                                                                  090506      
003550*DECLARACIÓN DE VARIABLES PARA ENVÍO POR INTELAR                  090508      
003551 77 W77-INTE-SNT                   PIC S9(11) BINARY.             090510      
003552 01 WKS-INTE-ARCHIVO               PIC X(120).                    090512      
003553*                                                                 090516      
003554 77 WKS-EXISTE                     PIC 9(01) VA ZERO.             090550      
003555                                                                  090552      
003556 01 WKS-DAT-ORIGEN-REF1            PIC X(35).                     090554      
003557 01 WKS-ORIGEN-DAT-REF1 REDEFINES WKS-DAT-ORIGEN-REF1.            090556      
003558    03 WKS-ORIGEN-HRAMOV           PIC 9(06).                     090558      
003559    03 WKS-ORIGEN-FECMOV           PIC 9(06).                     090560      
003560    03 WKS-ORIGEN-FOLIO            PIC X(12).                     090562      
003561    03 WKS-ORIGEN-MDE              PIC 9(02).                     090564      
003562    03 WKS-ORIGEN-FILREF1          PIC X(09).                     090566      
003563                                                                  090570      
003564 01 WKS-DAT-ORIGEN-REF2            PIC X(35).                     090572      
003565 01 WKS-ORIGEN-DAT-REF2 REDEFINES WKS-DAT-ORIGEN-REF2.            090574      
003566    03 WKS-ORIGEN-AUTDES           PIC 9(06).                     090576      
003567    03 WKS-ORIGEN-REFATM           PIC 9(12).                     090578      
003568    03 WKS-ORIGEN-FILREF2          PIC X(17).                     090580      
003569* <IBM>-INICIO -ESS- VARIABLE PARA MOVIMIENTOS TELETON            090590      
003570 77 WKS-MOV-TELETON                PIC 9(02).                     090600      
003571    88 MOV-TELETON                 VALUE 40 THRU 43.              090610      
003572 77 W77-SIGUE                      PIC 9(02).                     090620      
003573* <IBM>-FIN -ESS- VARIABLE PARA MOVIMIENTOS TELETON               090630      
003574/**************************************************************** 090640      
003575*             P R O C E D U R E     D I V I S I O N             * 090700      
003576***************************************************************** 090800      
003577 PROCEDURE DIVISION USING W77-SISTEMA-PARAMETRO.                  090900      
003578*-----------------------------------------------------------------091000      
003579 INICIO-PROGRAMA SECTION.                                         091100      
003580 000000-INICIO-PROCESO.                                           091200      
003581*----------------------                                           091300      
003582     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   091400      
003583     "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".             091500      
003584     CHANGE ATTRIBUTE LIBACCESS         OF "ADMONXFERS"           091520      
003585                                        TO BYFUNCTION.            091540      
003586     CHANGE ATTRIBUTE FUNCTIONNAME      OF "ADMONXFERS"           091560      
003587                                        TO "ADMONXFERS".          091580      
003588     CHANGE ATTRIBUTE LIBACCESS OF "CTRLVERS" TO BYFUNCTION.      091600      
003589     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    091700      
003590     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   091800      
003591     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            091900      
003592                                      "SOPORTECOMS".              092000      
003593     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           092100      
003594     CALL "DAME_TIT IN CTRLVERS"                                  092200      
003595           USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO         092300      
003596           GIVING WKS-CTLVERS-STATUS.                             092400      
003597                                                                  092500      
003598     IF WKS-CTLVERS-STATUS < 0                                    092600      
003599        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           093300      
003600             "(S151)S151/OBJECT/L001/CONTROL  ON CMEMP."          093400      
003601     ELSE                                                         093500      
003602        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             093600      
003603        WKS-CTLVERS-TITULO.                                       093700      
003604                                                                  093710      
003605     MOVE "S151P110"               TO WKS-CTLVERS-LIBRERIA.       093712      
003606     CALL "DAME_TIT IN CTRLVERS"                                  093714      
003607           USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO         093716      
003608           GIVING WKS-CTLVERS-STATUS.                             093718      
003609                                                                  093720      
003610     IF WKS-CTLVERS-STATUS = 0                                    093722      
003611        MOVE WKS-CTLVERS-TITULO    TO WKS-START-P110              093724      
003612     ELSE                                                         093726      
003613        MOVE "(S151)S151/OBJECT/P110/MOVSBIT/09MTP001 ON CMEMP"   093728      
003614                                   TO WKS-START-P110.             093730      
003615                                                                  093732      
003616**********************                                            093734      
003617*VERSION DEL WFL/LOTE*                                            093736      
003618**********************                                            093738      
003619     MOVE "S151LOTE"               TO WKS-CTLVERS-LIBRERIA        093740      
003620     CALL "DAME_TIT IN CTRLVERS"                                  093742      
003621          USING  WKS-CTLVERS-LIBRERIA                             093744      
003622                 WKS-CTLVERS-TITULO                               093746      
003623          GIVING WKS-CTLVERS-STATUS.                              093748      
003624                                                                  093750      
003625     IF WKS-CTLVERS-STATUS < 0                                    093752      
003626        MOVE "ERROR AL OBTENER NOMBRE S151LOTE"                   093754      
003627                                           TO TEXTO-LJ            093756      
003628        MOVE "O"                           TO TIPO-LJ             093758      
003629        MOVE 020901                        TO CODIGO-LJ           093760      
003630        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       093762      
003631*       CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                   093764      
003632     ELSE                                                         093766      
003633        MOVE WKS-CTLVERS-TITULO TO WKS-N-WFL.                     093768      
003634                                                                  093770      
003635     MOVE "S016L422"                 TO      WKS-LIBID.           093772      
003636     CALL "DAME_TIT IN CTRLVERS"     USING   WKS-LIBID            093774      
003637                                             WKS-NOMBLIB          093776      
003638                                     GIVING  W77-ERR-CTLVER.      093778      
003639     CHANGE ATTRIBUTE TITLE OF "S016L422" TO WKS-NOMBLIB.         093780      
003640                                                                  093782      
003641                                                                  093800      
003642     MOVE ZEROS   TO      HDR-NTRANS-CMP,  W77-NTRANS-BNX,        093900      
003643                          WKS-TIT-NUMARC.                         094100      
003644     MOVE "S151"  TO      SISTEMA-LJ                              094200      
003645     MOVE "P135"  TO      PASO-LJ                                 094300      
003646                          WKS-PASO-BACK2                          094400      
003647                          WLI-RB-E1-PASO                          094500      
003648     MOVE "002"   TO      MTP-LJ                                  094640      
003649     MOVE "I"     TO      WLI-TIPO-LJ                             094700      
003650     MOVE 020101  TO      CODIGO-LJ                               094800      
003651     MOVE "INICIO DE PROCESO . "                                  094900      
003652                  TO      WLI-TEXTO-LJ                            095000      
003653                                                                  095200      
003654     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            095300      
003655* INI EXTNET 2023 R11                                             095400      
003656     MOVE WKS-NOMEQUIPO           TO WKS-HOSTNAME.                095500      
003657* FIN EXTNET 2023 R11                                             095600      
003658     MOVE WKS-NUMCSI      TO      W77-NUM-CSI, WS-CTL-NUMCSI,     095700      
003659                                  WKS-TR-CSI2, WKS-NODO-CARAT,    095800      
003660                                  WKS-START-CSI2.                 095850      
003661     MOVE W77-SISTEMA-PARAMETRO TO      WS-CTL-SISTEMA            095900      
003662                                        WKS-NUM-SISTEMI           096000      
003663                                        WKS-SIS-BACK2             096100      
003664                                        WLI-RB-E3-SISTEMA2        096200      
003665                                        W77-SOLO-PUNTEO .         096300      
003666     MOVE "DIARIO"        TO      WLI-RB-E2-TIPO-PROC2.           096400      
003667     MOVE 01              TO      WS-CTL-FUNCION.                 096500      
003668     CALL "CONSISDIA IN S151LIBCONTROL" USING WS-151-DATOS        096600      
003669                                  GIVING WKS-151-RESULT.          096700      
003670                                                                  096800      
003671     IF WKS-151-RESULT > 0                                        096900      
003672        MOVE SPACES       TO      WLI-ENCAB-52                    097000      
003673        STRING "ERROR AL CONSULTAR S151LIBCONTROL PARA OBTENER",  097100      
003674           "NOMBRE DE LA BASE DIARIA, ERROR  : " ,                097200      
003675           WS-ERROR(WKS-151-RESULT)                               097300      
003676           DELIMITED BY SIZE INTO TEXTO-LJ                        097400      
003677        MOVE "O"          TO      TIPO-LJ                         097500      
003678        MOVE 020901       TO      CODIGO-LJ                       097600      
003679        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       097700      
003680        SET MYSELF(STATUS) TO -1                                  097800      
003681     ELSE                                                         097900      
003682        MOVE W77-SISTEMA-PARAMETRO TO WKS-SIS-SAL                 098000      
003683                                      WKS-SIS-SAL2                098100      
003684                                      WKS-SIS-SALS030             098200      
003685                                      WKS-SIS-SALS500             098300      
003686                                      WKS-SIS-SAL-CMOV            098305      
003687                                      WKS-SIS-SAL-MPS             098310      
003688        MOVE WS-CTL-NOMMOV TO     WKS-NOM-LOG                     098400      
003689        MOVE WS-CTL-PKMOV  TO     WKS-PACK-LOG                    098500      
003690        MOVE WS-CTL-FECPROC TO    W77-SIS-FECPRO                  098600      
003691                                  WLI-RB-E1-FECHA-INF2            098700      
003692        MOVE WS-CTL-NOMDES TO     WKS-NOM-DES                     098800      
003693        MOVE WS-CTL-PKDES  TO     WKS-PACK-DES                    098900      
003694        MOVE ZEROS         TO     WKS-151-RESULT.                 099000      
003695                                                                  099100      
003696     PERFORM      010-FORMATO-DISPLAY.                            099200      
003697                                                                  099300      
003698     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-VALUE.             099400      
003699     IF WKS-VALUE > 0                                             099500      
003700        MOVE WKS-VALUE TO W77-SIS-FECPRO                          099600      
003701     ELSE                                                         099700      
003702        PERFORM 030-CIERRA-DESCRIP.                               099800      
003703                                                                  099900      
003704     MOVE SPACES       TO      WLI-ENCAB-52                       100000      
003705     MOVE "I"     TO      WLI-TIPO-LJ                             100100      
003706     MOVE 020101  TO      CODIGO-LJ                               100200      
003707     STRING "FECHA DE PROCESO : ", W77-SIS-FECPRO                 100300      
003708     DELIMITED BY SIZE INTO WLI-TEXTO-LJ                          100400      
003709     PERFORM  000-030-IMPRIME-MENSAJE                             100500      
003710     IF W77-SISTEMA-PARAMETRO = 500                               100510      
003711        PERFORM 000-025-EJECUTA-P110.                             100600      
003712     PERFORM 020-MUEVE-999 VARYING WKS-151-RESULT FROM 1          100700      
003713                           BY 1 UNTIL WKS-151-RESULT > 10000.     100800      
003714     PERFORM 040-ABRE-LIBRERIA-CVES.                              100900      
003715     PERFORM 050-CARGA-CVES.                                      101000      
003716     IF W77-SISTEMA-PARAMETRO = 500 PERFORM 060-CARGA-CAT293      101100      
003717                                    OPEN OUTPUT FILTRO            101105      
003718                                    PERFORM 065-CARGA-CAT1521     101110      
003719                                    CLOSE    FILTRO SAVE          101130      
003720                                    OPEN     INPUT FILTRO         101150      
003721                                    PERFORM 070-OBTEN-TIT940.     101200      
003722                                                                  101220      
003723     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  101240      
003724        W77-SISTEMA-PARAMETRO = 500                               101260      
003725                                    PERFORM 075-CARGA-CATBIN.     101280      
003726                                                                  101290      
003727     PERFORM 100-ABRE-ARCHENT.                                    101300      
003728     PERFORM 120-CREA-HEADER.                                     101400      
003729* <IBM>-INICIO -ESS- FILTRO PARA MOVIMIENTOS TELETON              101410      
003730     MOVE ZERO             TO W77-SIGUE.                          101420      
003731     PERFORM 190-LECTURA   UNTIL W77-SIGUE = 1 OR W88-FIN-PROCESO.101430      
003732* <IBM>-   FIN -ESS- FILTRO PARA MOVIMIENTOS TELETON              101440      
003733     PERFORM 200-PROCESO    UNTIL W88-FIN-PROCESO.                101500      
003734     IF WKS-NUMCSI = 10 AND W77-SISTEMA-PARAMETRO = 500           101520      
003735        PERFORM 211-FACTORAJE-403                                 101540      
003736        PERFORM 030385-INTE-ARCHS440                              101541      
003737     ELSE                                                         101542      
003738     IF W77-SISTEMA-PARAMETRO = 500                               101544      
003739        CLOSE E04-FACTORAJE WITH SAVE.                            101546      
003740     IF W77-SISTEMA-PARAMETRO = 500                               101548      
003741*        CLOSE A02-PG-ARCHIVO   WITH SAVE                         101550      
003742        CLOSE A01-TLM-ARCHIVO  WITH SAVE                          101555      
003743*        MOVE WKS-TITLE-PG-ARCHIVO TO WKS-INTE-ARCHIVO            101561      
003744*        MOVE ZERO             TO W77-INTE-SNT                    101562      
003745*        PERFORM 030705-ENVIO-POR-INTELAR                         101565      
003746        MOVE ZERO             TO W77-INTE-SNT                     101567      
003747        MOVE WKS-TITLE-TLM-ARCHIVO TO WKS-INTE-ARCHIVO            101570      
003748        PERFORM 030705-ENVIO-POR-INTELAR                          101572      
003749        MOVE 4                      TO   E06-PORTPG-TRA-TIPO      101574      
003750        WRITE R06-PORTPG-INTELAR      FROM E06-PORTPG-TRA-TOT     101576      
003751        CLOSE A03-PORTPG-INT          WITH SAVE                   101578      
003752        MOVE WKS-TITLE-PORTPG-INTELAR TO   WKS-INTE-ARCHIVO       101580      
003753        MOVE ZERO                   TO   W77-INTE-SNT             101582      
003754        PERFORM 030705-ENVIO-POR-INTELAR.                         101584      
003755                                                                  101586      
003756     PERFORM 300-CREA-TRAILER.                                    101600      
003757     PERFORM 900-CIERRA-ARCHIVOS.                                 101700      
003758                                                                  101800      
003759     IF W88-SOLO-PUNTEO                                           101900      
003760        NEXT SENTENCE                                             102000      
003761     ELSE                                                         102100      
003762        PERFORM 1100-SORT-LISTC                                   102200      
003763        PERFORM 1200-IMPRIME-LISTC.                               102300      
003764                                                                  102400      
003765     MOVE SPACES       TO      WLI-ENCAB-52                       102500      
003766     MOVE "I"     TO      WLI-TIPO-LJ                             102600      
003767     MOVE 020101  TO      CODIGO-LJ                               102700      
003768     MOVE  "FIN NORMAL DE PROCESO "                               102800      
003769                  TO      WLI-TEXTO-LJ                            102900      
003770     PERFORM  000-030-IMPRIME-MENSAJE.                            103000      
003771     CLOSE  V00-REPORTE2.                                         103100      
003772     STOP RUN.                                                    103200      
003773                                                                  103300      
003774 010-FORMATO-DISPLAY.                                             103400      
003775*--------------------                                             103500      
003776*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003777* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP.".          103600      
003778                                                                  000100      
003779*===============================================================* 000200      
003780*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
003781*         PARA LLAMADO DE DISPLAY                               * 000400      
003782*===============================================================* 000500      
003783                                                                  000600      
003784     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
003785            TO BYFUNCTION.                                        000671      
003786                                                                  000691      
003787     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
003788          USING WKS-DATE-ARRAY2.                                  000800      
003789     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
003790     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
003791     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
003792     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
003793     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
003794     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
003795                                                                  001300      
003796     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
003797     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
003798     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
003799                               WKS-TIT-REPORTE2.                  001700      
003800*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
003801*                                  GIVING WKS-COMPILA2.           001900      
003802*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
003803*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
003804*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
003805*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
003806                                                                  002066      
003807*    IF WKS-AAA-VERSION2  < 50                                    002071      
003808*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
003809*    ELSE                                                         002081      
003810*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
003811                                                                  002091      
003812                                                                  002500      
003813*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
003814     OPEN OUTPUT V00-REPORTE2.                                    002700      
003815     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
003816     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
003817                                                                  003000      
003818 000-050-CHECA-SALTO-HOJA2.                                       003051      
003819*==========================                                       003071      
003820    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
003821     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
003822        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
003823     ELSE                                                         003079      
003824        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
003825     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
003826     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
003827     MOVE "/"                     TO WKS-SLASH1.                  003086      
003828     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
003829     MOVE "/"                     TO WKS-SLASH2.                  003088      
003830     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
003831     IF  WKS-NUM-LINEAS2 > 56                                     003091      
003832         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
003833         ADD 1                   TO    W77-CONT-HOJA2             003200      
003834         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
003835         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
003836         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
003837         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
003838         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
003839         MOVE SPACES             TO V00-R00-REPORTE2              003800      
003840         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
003841         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
003842                                                                  004100      
003843 000-030-IMPRIME-MENSAJE.                                         004200      
003844*========================                                         004300      
003845*LP                                                               004400      
003846     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
003847     ADD             2       TO WKS-NUM-LINEAS2                   004600      
003848     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
003849                                                                  004800      
003850*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003851                                                                  103700      
003852 020-MUEVE-999.                                                   103800      
003853     COMPUTE WKS-REL-CMP(WKS-151-RESULT) = 999.                   103900      
003854 000-025-EJECUTA-P110.                                            103910      
003855*=====================                                            103920      
003856    MOVE W77-SISTEMA-PARAMETRO   TO WKS-START-SISTEMA.            103930      
003857    MOVE W77-SIS-FECPRO          TO WKS-START-FECHA  .            103940      
003858    CALL SYSTEM WFL      USING   WKS-EJECUTA-P110    .            103950      
003859                                                                  104000      
003860 030-CIERRA-DESCRIP.                                              104100      
003861*-------------------                                              104200      
003862     MOVE ZEROS   TO      W77-DESC.                               104300      
003863     IF WS-CTL-FECARCM(1)  = W77-SIS-FECPRO                       104400      
003864        MOVE 1    TO      W77-DESC                                104500      
003865        MOVE 10   TO      WKS-DEL-FUNCION                         104600      
003866     ELSE                                                         104700      
003867     IF WS-CTL-FECARCM(2)  = W77-SIS-FECPRO                       104800      
003868        MOVE 1    TO      W77-DESC                                104900      
003869        MOVE 11   TO      WKS-DEL-FUNCION                         105000      
003870     ELSE                                                         105100      
003871     IF WS-CTL-FECARCM(3)  = W77-SIS-FECPRO                       105200      
003872        MOVE 1    TO      W77-DESC                                105300      
003873        MOVE 12   TO      WKS-DEL-FUNCION                         105400      
003874     ELSE                                                         105500      
003875     IF WS-CTL-FECARCM(4)  = W77-SIS-FECPRO                       105600      
003876        MOVE 1    TO      W77-DESC                                105700      
003877        MOVE 13   TO      WKS-DEL-FUNCION                         105800      
003878     ELSE                                                         105900      
003879     IF WS-CTL-FECARCM(5)  = W77-SIS-FECPRO                       106000      
003880        MOVE 1    TO      W77-DESC                                106100      
003881        MOVE 14   TO      WKS-DEL-FUNCION                         106200      
003882     ELSE                                                         106300      
003883     IF WS-CTL-FECARCM(6)  = W77-SIS-FECPRO                       106400      
003884        MOVE 1    TO      W77-DESC                                106500      
003885        MOVE 15   TO      WKS-DEL-FUNCION                         106600      
003886     ELSE                                                         106700      
003887     IF WS-CTL-FECARCM(7)  = W77-SIS-FECPRO                       106800      
003888        MOVE 1    TO      W77-DESC                                106900      
003889        MOVE 16   TO      WKS-DEL-FUNCION                         107000      
003890     ELSE                                                         107100      
003891     IF WS-CTL-FECARCM(8)  = W77-SIS-FECPRO                       107200      
003892        MOVE 1    TO      W77-DESC                                107300      
003893        MOVE 17   TO      WKS-DEL-FUNCION                         107400      
003894     ELSE                                                         107500      
003895     IF WS-CTL-FECARCM(9)  = W77-SIS-FECPRO                       107600      
003896        MOVE 1    TO      W77-DESC                                107700      
003897        MOVE 18   TO      WKS-DEL-FUNCION                         107800      
003898     ELSE                                                         107900      
003899     IF WS-CTL-FECARCM(10) = W77-SIS-FECPRO                       108000      
003900        MOVE 1    TO      W77-DESC                                108100      
003901        MOVE 19   TO      WKS-DEL-FUNCION.                        108200      
003902                                                                  108300      
003903     MOVE ZEROS                 TO        WKS-CTLVERS-STATUS      108400      
003904     MOVE "S151L002R"           TO        WKS-LIBID-NOMB          108500      
003905     MOVE W77-SISTEMA-PARAMETRO TO        WKS-LIBID-SIST          108600      
003906                                                                  108700      
003907     IF W88-DESC                                                  108800      
003908        CALL "DAME_TIT IN CTRLVERS"                               108900      
003909              USING WKS-CTLVERS-LIBID , WKS-CTLVERS-TITULO        109000      
003910              GIVING WKS-CTLVERS-STATUS.                          109100      
003911                                                                  109200      
003912     IF W88-DESC                                                  109300      
003913       IF WKS-CTLVERS-STATUS < 0                                  109400      
003914          MOVE W77-SISTEMA-PARAMETRO TO WKS-TIT-SISREG            109500      
003915          MOVE SPACES       TO      WLI-ENCAB-52                  109600      
003916          MOVE "I"    TO WLI-TIPO-LJ                              109700      
003917          MOVE 020101 TO CODIGO-LJ                                109800      
003918          STRING "ERROR EN CTLVERS, USO LIBRERIA REGISTRA SIN ",  109900      
003919             "RELEASE NI MTP." DELIMITED BY SIZE INTO WLI-TEXTO-LJ110000      
003920          PERFORM  000-030-IMPRIME-MENSAJE                        110100      
003921          CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA"   TO           110300      
003922                 WKS-TIT-REGISTRA                                 110400      
003923       ELSE                                                       110500      
003924          CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO             110600      
003925          WKS-CTLVERS-TITULO.                                     110700      
003926                                                                  110800      
003927     MOVE ZEROS TO        WKS-DEL-FECHA,   WKS-DEL-NUMLOG,        110900      
003928                          WKS-DEL-PRODUCTO,WKS-DEL-PROCESO,       111000      
003929                          WKS-151-RESULT.                         111100      
003930     IF W88-DESC                                                  111200      
003931        CALL "CONTROLES IN LIB-REGISTRA" USING WKS-151-DATOS      111300      
003932                                      GIVING WKS-151-RESULT.      111400      
003933     IF W88-DESC                                                  111500      
003934        IF WKS-151-RESULT = 0                                     111600      
003935           NEXT SENTENCE                                          111700      
003936        ELSE                                                      111800      
003937           MOVE SPACES       TO      WLI-ENCAB-52                 111900      
003938           MOVE "I"    TO WLI-TIPO-LJ                             112000      
003939           MOVE 020101 TO CODIGO-LJ                               112100      
003940           STRING "ERROR AL CERRAR ARCHIVO DE MOVIMIENTOS Y ARCHI"112200      
003941                , "VO DE DESCRIPCIONES PARA EL SIS. ",            112300      
003942        W77-SISTEMA-PARAMETRO DELIMITED BY SIZE INTO WLI-TEXTO-LJ 112400      
003943           PERFORM  000-030-IMPRIME-MENSAJE.                      112500      
003944                                                                  112600      
003945 040-ABRE-LIBRERIA-CVES.                                          112700      
003946*-----------------------                                          112800      
003947     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     112900      
003948     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      113000      
003949     MOVE "S080BD01CON"            TO WKS-LIBID.                  113100      
003950     CALL "DAME_TIT IN CTLVER" USING  WKS-LIBID, WKS-NOMBLIB      113200      
003951                               GIVING W77-ERR-CTLVER.             113300      
003952     IF W77-ERR-CTLVER = 0                                        113400      
003953        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA"   TO WKS-NOMBLIB.  113500      
003954                                                                  113600      
003955 050-CARGA-CVES.                                                  113700      
003956*----------------                                                 113800      
003957     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          113900      
003958             A2K-ACCEPT-TODAYS-DATE-EXIT.                         114000      
003959     MOVE A2K-FEC-MDCA-001 TO WKS-FECH-MAQ.                       114100      
003960     MOVE ZEROS                            TO W77-ERROR-CAT.      114200      
003961     MOVE WKS-FM-MM                        TO WKS-AMD-MM          114300      
003962     MOVE WKS-FM-AA                        TO WKS-AMD-AA          114400      
003963     MOVE WKS-FM-DD                        TO WKS-AMD-DD          114500      
003964     MOVE ZERO                             TO W77-EOF             114700      
003965                                              W77-IND.            114800      
003966     MOVE 151                              TO W77-L710-SISTEMA.   114900      
003967     MOVE 30                               TO W77-L710-PROGRAMA.  115000      
003968     MOVE 523                              TO WKS-EL710-CAT.      115100      
003969     MOVE 20                               TO WKS-EL710-CLAVE.    115200      
003970     MOVE 2                                TO WKS-EL710-BUSQUEDA. 115300      
003971     MOVE 1                                TO WKS-EL710-REGISTROS 115400      
003972     MOVE W77-SISTEMA-PARAMETRO            TO WKS-EL710-LLAVE1.   115500      
003973     MOVE 1                                TO WKS-EL710-LLAVE2.   115600      
003974     MOVE ZERO                             TO WKS-EL710-LLAVE3    115700      
003975                                              WKS-EL710-LLAVE4    115800      
003976                                              WKS-EL710-LLAVE5    115900      
003977                                              WKS-EL710-LLAVE6    116000      
003978                                              WKS-EL710-FECINI    116100      
003979                                              WKS-EL710-NIVINI    116200      
003980                                              WKS-EL710-FEC-VIG.  116300      
003981     PERFORM 000250-CARGA-CATDECAT.                               116400      
003982     MOVE W77-CAT-NUMCAT           TO WKS-EL710-CAT.              116500      
003983     IF W77-CAT-FORMATO = 2                                       116600      
003984        MOVE 1                     TO WKS-EL710-BUSQUEDA          116700      
003985        MOVE W77-SISTEMA-PARAMETRO TO WKS-EL710-LLAVE1            116800      
003986        MOVE 0                     TO WKS-EL710-LLAVE2            116900      
003987     ELSE                                                         117000      
003988     IF W77-CAT-FORMATO = 1                                       117100      
003989        MOVE 2                     TO WKS-EL710-BUSQUEDA          117200      
003990        MOVE W77-SISTEMA-PARAMETRO TO WKS-EL710-LLAVE2            117300      
003991        MOVE 0                     TO WKS-EL710-LLAVE1            117400      
003992     ELSE                                                         117500      
003993        MOVE SPACES                TO WLI-ENCAB-52, TEXTO-LJ      117600      
003994        MOVE W77-L710-RESULT       TO W77-CAT-FORMATO             117700      
003995        MOVE "O"                   TO TIPO-LJ                     117800      
003996        MOVE 020201                TO CODIGO-LJ                   117900      
003997        STRING "NUMERO DE FORMATO NO VALIDO EN CAT. 523 SISTEMA S"118000      
003998           W77-SISTEMA-PARAMETRO " FORMATO " W77-CAT-FORMATO      118100      
003999        DELIMITED BY SIZE                                         118200      
004000        INTO TEXTO-LJ                                             118300      
004001        MOVE TIPO-LJ               TO WLI-TIPO-LJ                 118400      
004002        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                118500      
004003        PERFORM  000-030-IMPRIME-MENSAJE                          118600      
004004        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       118700      
004005        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  118800      
004006                                                                  118900      
004007     MOVE 151                             TO W77-L710-SISTEMA     119000      
004008     MOVE 30                              TO W77-L710-PROGRAMA    119100      
004009     MOVE 20                              TO WKS-EL710-CLAVE      119200      
004010     MOVE 1                               TO WKS-EL710-REGISTROS  119300      
004011     MOVE 0                               TO WKS-EL710-LLAVE3     119400      
004012                                             WKS-EL710-LLAVE4     119500      
004013                                             WKS-EL710-LLAVE5     119600      
004014                                             WKS-EL710-LLAVE6     119700      
004015     MOVE ZEROS  TO  A2K-FEC-CAMD-001                             119800      
004016     MOVE W77-SIS-FECPRO   TO  A2K-FEC-CAMD-001                   119900      
004017     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            120000      
004018             A2K-CONV-CAMD-TO-AMD-EXIT                            120100      
004019     MOVE A2K-FEC-AMD-001                 TO WKS-EL710-FEC-VIG    120200      
004020     MOVE 0                               TO WKS-EL710-FEC-VIG    120300      
004021     MOVE 0                               TO WKS-EL710-FECINI     120400      
004022     MOVE 0                               TO WKS-EL710-NIVINI     120500      
004023     MOVE 0                               TO W77-EOF.             120600      
004024     PERFORM 000300-CARGA-PARAMETROS UNTIL W77-EOF > 0.           120700      
004025                                                                  120980      
004026 000250-CARGA-CATDECAT.                                           120990      
004027*======================                                           121000      
004028     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     121100      
004029          USING  W77-L710-SISTEMA                                 121200      
004030                 W77-L710-PROGRAMA                                121300      
004031                 WKS-L710-ENT                                     121400      
004032                 WKS-L710-SAL                                     121500      
004033          GIVING W77-L710-RESULT.                                 121600      
004034     IF W77-L710-RESULT < 2                                       121700      
004035        MOVE WKS-SL710-DAT(4)      TO W77-CAT-NUMCAT              121800      
004036        MOVE WKS-SL710-DAT(5)      TO W77-CAT-FORMATO             121900      
004037     ELSE                                                         122000      
004038        MOVE SPACES                TO WLI-ENCAB-52, TEXTO-LJ      122100      
004039        MOVE W77-L710-RESULT       TO W77-CAT-NUMCAT              122200      
004040        MOVE "O"                   TO TIPO-LJ                     122300      
004041        MOVE 020201                TO CODIGO-LJ                   122400      
004042        STRING "ERROR EN CATALOGO DE CATALOGOS SISTEMA S"         122500      
004043           W77-SISTEMA-PARAMETRO " ERROR " W77-CAT-NUMCAT         122600      
004044        DELIMITED BY SIZE                                         122700      
004045        INTO TEXTO-LJ                                             122800      
004046        MOVE TIPO-LJ               TO WLI-TIPO-LJ                 122900      
004047        MOVE TEXTO-LJ              TO WLI-TEXTO-LJ                123000      
004048        PERFORM  000-030-IMPRIME-MENSAJE                          123100      
004049        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       123200      
004050        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  123300      
004051                                                                  123400      
004052 000300-CARGA-PARAMETROS.                                         123500      
004053*------------------------                                         123600      
004054     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     123700      
004055           USING  W77-L710-SISTEMA                                123800      
004056                  W77-L710-PROGRAMA                               123900      
004057                  WKS-L710-ENT                                    124000      
004058                  WKS-L710-SAL                                    124100      
004059           GIVING W77-L710-RESULT                                 124200      
004060                                                                  124300      
004061     IF W77-L710-RESULT = 0 OR = 1                                124400      
004062        MOVE WKS-SL710-DAT(1)      TO WKS-EL710-LLAVE1            124500      
004063        MOVE WKS-SL710-DAT(2)      TO WKS-EL710-LLAVE2            124600      
004064        MOVE WKS-SL710-DAT(3)      TO WKS-EL710-LLAVE3            124700      
004065        MOVE WKS-SL710-DAT(4)      TO WKS-EL710-LLAVE4            124800      
004066        MOVE WKS-SL710-DAT(5)      TO WKS-EL710-LLAVE5            124900      
004067        MOVE WKS-SL710-DAT(6)      TO WKS-EL710-LLAVE6            125000      
004068        PERFORM 000300-MUEVE-CLAVE                                125100      
004069        MOVE WKS-SL710-NIVINI      TO WKS-EL710-NIVINI            125200      
004070        MOVE WKS-SL710-FECINI      TO WKS-EL710-FECINI            125300      
004071        IF W77-IND < 9999                                         125400      
004072           MOVE WKS-SL710-DAT(4)   TO WKS-CVE-MOV(W77-IND)        125600      
004073           MOVE WKS-SL710-DAT(8)   TO WKS-CVE-REN(W77-IND)        125650      
004074           MOVE WKS-SL710-DAT(11)  TO WKS-CVE-AFC(W77-IND)        125700      
004075           MOVE WKS-SL710-DAT(16)  TO WKS-CVE-CMP(W77-IND)        125800      
004076           IF W77-SISTEMA-PARAMETRO = 500                         125810      
004077              MOVE WKS-SL710-DAT(14)   TO WKS-CVE-PORTA(W77-IND)  125820      
004078           ELSE                                                   125830      
004079              MOVE 0 TO WKS-CVE-PORTA(W77-IND)                    125840      
004080        ELSE                                                      125900      
004081           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       126000      
004082           MOVE "I"                       TO TIPO-LJ              126100      
004083           MOVE 020601                    TO CODIGO-LJ            126200      
004084           MOVE "CVE.TRANSACCION > 9999 " TO TEXTO-LJ             126300      
004085           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                126400      
004086           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               126500      
004087           PERFORM  000-030-IMPRIME-MENSAJE                       126600      
004088     ELSE                                                         126700      
004089        MOVE 1                            TO W77-EOF              126800      
004090        MOVE W77-L710-RESULT              TO W77-IND3             126900      
004091        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          127000      
004092        MOVE "O"                          TO TIPO-LJ              127100      
004093        MOVE 020901                       TO CODIGO-LJ            127200      
004094        STRING "ERROR EN CALL PARAMETROS S080BD01CON,RESULT = ",  127300      
004095                W77-IND3                                          127400      
004096                DELIMITED BY SIZE                                 127500      
004097                INTO TEXTO-LJ                                     127600      
004098        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   127700      
004099        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  127800      
004100        PERFORM  000-030-IMPRIME-MENSAJE                          127900      
004101        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      128000      
004102                                                                  128100      
004103     IF W77-L710-RESULT = 0                                       128200      
004104        MOVE 1                            TO W77-EOF.             128300      
004105                                                                  128400      
004106 000300-MUEVE-CLAVE.                                              128500      
004107*====================                                             128600      
004108     IF W77-CAT-FORMATO = 2                                       128700      
004109        MOVE WKS-SL710-DAT(2)      TO W77-IND                     128800      
004110     ELSE                                                         128900      
004111        MOVE WKS-SL710-DAT(1)      TO W77-IND.                    129000      
004112                                                                  129100      
004113 060-CARGA-CAT293.                                                129200      
004114*----------------                                                 129300      
004115     MOVE ZEROS                            TO W77-ERROR-CAT       129400      
004116                                              W77-IND             129500      
004117                                              W77-EOF.            129600      
004118     MOVE WKS-FM-MM                        TO WKS-AMD-MM          129700      
004119     MOVE WKS-FM-AA                        TO WKS-AMD-AA          129800      
004120     MOVE WKS-FM-DD                        TO WKS-AMD-DD          129900      
004121     MOVE 151                              TO W77-L710-SISTEMA.   130000      
004122     MOVE 30                               TO W77-L710-PROGRAMA.  130100      
004123     MOVE 293                              TO WKS-EL710-CAT.      130200      
004124     MOVE 20                               TO WKS-EL710-CLAVE.    130300      
004125     MOVE 1                                TO WKS-EL710-BUSQUEDA. 130400      
004126     MOVE 1                                TO WKS-EL710-REGISTROS.130500      
004127     MOVE ZERO                             TO WKS-EL710-LLAVE1    130600      
004128                                              WKS-EL710-LLAVE2    130700      
004129                                              WKS-EL710-LLAVE3    130800      
004130                                              WKS-EL710-LLAVE4    130900      
004131                                              WKS-EL710-LLAVE5    131000      
004132                                              WKS-EL710-LLAVE6    131100      
004133                                              WKS-EL710-FECINI    131200      
004134                                              WKS-EL710-NIVINI    131300      
004135                                              WKS-EL710-FEC-VIG.  131400      
004136     PERFORM 061-CAT293       UNTIL W77-EOF = 1.                  131500      
004137                                                                  131600      
004138 061-CAT293.                                                      131700      
004139*----------                                                       131800      
004140     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     131900      
004141          USING  W77-L710-SISTEMA,    W77-L710-PROGRAMA,          132000      
004142                 WKS-L710-ENT,        WKS-L710-SAL,               132100      
004143          GIVING W77-L710-RESULT.                                 132200      
004144                                                                  132300      
004145     IF W77-L710-RESULT = 0 OR 1                                  132400      
004146        MOVE WKS-SL710-DAT(1)      TO WKS-EL710-LLAVE1            132500      
004147                                      W77-IND                     132600      
004148        MOVE WKS-SL710-DAT(2)      TO WKS-EL710-LLAVE2            132700      
004149        MOVE WKS-SL710-DAT(3)      TO WKS-EL710-LLAVE3            132800      
004150        MOVE WKS-SL710-DAT(4)      TO WKS-EL710-LLAVE4            132900      
004151        MOVE WKS-SL710-DAT(5)      TO WKS-EL710-LLAVE5            133000      
004152        MOVE WKS-SL710-DAT(6)      TO WKS-EL710-LLAVE6            133100      
004153        MOVE WKS-SL710-NIVINI      TO WKS-EL710-NIVINI            133200      
004154        MOVE WKS-SL710-FECINI      TO WKS-EL710-FECINI            133300      
004155        MOVE 1 TO W77-ERROR-CAT                                   133400      
004156        IF W77-IND < 10001                                        133500      
004157           MOVE WKS-SL710-DAT(2)  TO WKS-REL-CMP(W77-IND)         133600      
004158        ELSE                                                      133700      
004159           MOVE SPACES             TO WLI-ENCAB-52                133800      
004160           MOVE "I"                TO WLI-TIPO-LJ                 133900      
004161           MOVE 020601             TO CODIGO-LJ                   134000      
004162           MOVE "CAT 293  SUC > 10000" TO WLI-TEXTO-LJ            134100      
004163           PERFORM  000-030-IMPRIME-MENSAJE                       134200      
004164           MOVE 1                  TO W77-EOF                     134300      
004165     ELSE                                                         134400      
004166        MOVE 1                     TO W77-EOF                     134500      
004167        MOVE W77-L710-RESULT       TO W77-IND3                    134600      
004168        IF W77-ERROR-CAT = 1   NEXT SENTENCE                      134700      
004169        ELSE                                                      134800      
004170          MOVE SPACES       TO      WLI-ENCAB-52                  134900      
004171          MOVE "I"                   TO WLI-TIPO-LJ               135000      
004172          MOVE 020901                TO CODIGO-LJ                 135100      
004173        STRING "ERROR AL LLAMAR PARAMETROS S080BD01CON, RESULT = "135200      
004174               W77-IND3  DELIMITED BY SIZE  INTO WLI-TEXTO-LJ     135300      
004175          MOVE WLI-TIPO-LJ        TO      TIPO-LJ                 135400      
004176          MOVE WLI-TEXTO-LJ       TO      TEXTO-LJ                135500      
004177          PERFORM  000-030-IMPRIME-MENSAJE.                       135600      
004178                                                                  135602      
004179 065-CARGA-CAT1521.                                               135603      
004180*----------------                                                 135604      
004181     MOVE ZEROS                            TO W77-ERROR-CAT       135605      
004182                                              W77-IND             135606      
004183                                              W77-EOF.            135607      
004184     MOVE WKS-FM-MM                        TO WKS-AMD-MM          135608      
004185     MOVE WKS-FM-AA                        TO WKS-AMD-AA          135609      
004186     MOVE WKS-FM-DD                        TO WKS-AMD-DD          135610      
004187     MOVE 151                              TO W77-L710-SISTEMA.   135611      
004188     MOVE 30                               TO W77-L710-PROGRAMA.  135612      
004189     MOVE 1521                             TO WKS-EL710-CAT.      135613      
004190     MOVE 20                               TO WKS-EL710-CLAVE.    135614      
004191     MOVE 1                                TO WKS-EL710-BUSQUEDA. 135615      
004192     MOVE 1                                TO WKS-EL710-REGISTROS.135616      
004193     MOVE ZERO                             TO WKS-EL710-LLAVE1    135617      
004194                                              WKS-EL710-LLAVE2    135618      
004195                                              WKS-EL710-LLAVE3    135619      
004196                                              WKS-EL710-LLAVE4    135620      
004197                                              WKS-EL710-LLAVE5    135621      
004198                                              WKS-EL710-LLAVE6    135622      
004199                                              WKS-EL710-FECINI    135623      
004200                                              WKS-EL710-NIVINI    135624      
004201                                              WKS-EL710-FEC-VIG.  135625      
004202     PERFORM 065-CAT1521       UNTIL W77-EOF = 1.                 135626      
004203                                                                  135627      
004204 065-CAT1521.                                                     135628      
004205*----------                                                       135629      
004206     CALL "L710_CONSUL_DETALLE IN ESTRUCTURA"                     135630      
004207          USING  W77-L710-SISTEMA,    W77-L710-PROGRAMA,          135631      
004208                 WKS-L710-ENT,        WKS-L710-SAL,               135632      
004209          GIVING W77-L710-RESULT.                                 135633      
004210                                                                  135634      
004211     IF W77-L710-RESULT = 0 OR 1                                  135635      
004212        MOVE WKS-SL710-DAT(1)      TO WKS-EL710-LLAVE1            135636      
004213        MOVE WKS-SL710-DAT(2)  TO WKS-EL710-LLAVE2 CAT-SUC-INIC   135638      
004214        MOVE WKS-SL710-DAT(3)  TO WKS-EL710-LLAVE3 CAT-CAJA-INIC  135639      
004215        MOVE WKS-SL710-DAT(4)  TO WKS-EL710-LLAVE4                135640      
004216        MOVE WKS-SL710-DAT(5)  TO WKS-EL710-LLAVE5                135641      
004217        MOVE WKS-SL710-DAT(6)  TO WKS-EL710-LLAVE6 W77-TABLA      135642      
004218        MOVE WKS-SL710-NIVINI  TO WKS-EL710-NIVINI                135643      
004219        MOVE WKS-SL710-FECINI  TO WKS-EL710-FECINI                135644      
004220        MOVE 1 TO W77-ERROR-CAT                                   135645      
004221        IF  W77-TABLA = "S500SORIANA " OR "S500CREDFAM "          135646      
004222            PERFORM  066-ESCRIBE-FILTRO                           135647      
004223        ELSE                                                      135648      
004224            NEXT SENTENCE                                         135649      
004225     ELSE                                                         135658      
004226        MOVE 1                     TO W77-EOF                     135659      
004227        MOVE W77-L710-RESULT       TO W77-IND3                    135660      
004228        IF W77-ERROR-CAT = 1   NEXT SENTENCE                      135661      
004229        ELSE                                                      135662      
004230          MOVE SPACES       TO      WLI-ENCAB-52                  135663      
004231          MOVE "I"                   TO WLI-TIPO-LJ               135664      
004232          MOVE 020901                TO CODIGO-LJ                 135665      
004233        STRING "ERROR AL LLAMAR PARAMETROS S080BD01CON, RESULT = "135666      
004234               W77-IND3  DELIMITED BY SIZE  INTO WLI-TEXTO-LJ     135667      
004235          MOVE WLI-TIPO-LJ        TO      TIPO-LJ                 135668      
004236          MOVE WLI-TEXTO-LJ       TO      TEXTO-LJ                135669      
004237          PERFORM  000-030-IMPRIME-MENSAJE.                       135670      
004238*                                                                 135675      
004239 066-ESCRIBE-FILTRO.                                              135680      
004240*-------------------                                              135682      
004241     WRITE LLAVE-CAT INVALID KEY                                  135685      
004242           NEXT SENTENCE.                                         135690      
004243*                                                                 135700      
004244 070-OBTEN-TIT940.                                                135800      
004245*-----------------                                                135900      
004246     MOVE "S006P940"         TO WKS-CTLVERS-LIBRERIA.             136000      
004247     CALL "DAME_TIT IN CTRLVERS"                                  136100      
004248           USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO         136200      
004249           GIVING WKS-CTLVERS-STATUS.                             136300      
004250                                                                  136400      
004251     IF WKS-CTLVERS-STATUS < 0                                    136500      
004252        MOVE SPACES       TO      WLI-ENCAB-52                    136600      
004253        MOVE "O"    TO WLI-TIPO-LJ                                136700      
004254        MOVE 020901 TO CODIGO-LJ                                  136800      
004255        STRING "ERROR EN CTLVERS, NO ENCUENTRO S006P940 "         136900      
004256                DELIMITED BY SIZE INTO WLI-TEXTO-LJ               137000      
004257        PERFORM  000-030-IMPRIME-MENSAJE                          137100      
004258        MOVE "(S006)S006/OBJECT/P940/CTRLFTP/01MTP001 ON XFER"    137200      
004259             TO WKS-START-PROG                                    137300      
004260     ELSE                                                         137400      
004261        STRING WKS-CTLVERS-TITULO DELIMITED BY SIZE               137500      
004262                INTO WKS-START-PROG.                              137600      
004263                                                                  137620      
004264     MOVE WKS-START-PROG  TO      WKS-START-PROG2                 137640      
004265                                  WKS-START-PROG2-SOR             137642      
004266                                  WKS-START-PROG-MPS              137644      
004267                                  WKS-START-PROG-CMOV.            137646      
004268*                                                                 137652      
004269 075-CARGA-CATBIN.                                                137654      
004270*-----------------                                                137656      
004271     MOVE 198                    TO WKS-PAR-ENT-CATA              137658      
004272     MOVE 20                     TO WKS-PAR-ENT-CLAVE             137660      
004273     MOVE 01                     TO WKS-PAR-ENT-ORD-BUS           137662      
004274     MOVE 10                     TO WKS-PAR-ENT-REGIS             137664      
004275     MOVE SPACES                 TO WKS-PAR-ENT-DATOS             137666      
004276     MOVE SPACES                 TO WKS-PAR-ENT-LLAVE1            137668      
004277                                    WKS-PAR-ENT-LLAVE2            137670      
004278                                    WKS-PAR-ENT-LLAVE3            137672      
004279                                    WKS-PAR-ENT-LLAVE4            137674      
004280                                    WKS-PAR-ENT-LLAVE5            137676      
004281                                    WKS-PAR-ENT-LLAVE6            137678      
004282     MOVE ZEROES                 TO WKS-PAR-ENT-FEC-VIG           137680      
004283                                    WKS-PAR-ENT-FEC-INI-CONS      137682      
004284                                    WKS-PAR-ENT-NIVEL-INI         137684      
004285     MOVE 151                    TO SISTEMA                       137686      
004286     MOVE 135                    TO PROGRAMA                      137688      
004287     MOVE 0                      TO RESULTAD                      137690      
004288     MOVE 0                      TO W77-EOF                       137692      
004289     MOVE 0                      TO W77-IND2                      137694      
004290     PERFORM 076-CARGA-LEY-BIN UNTIL W77-EOF > 0.                 137696      
004291                                                                  137698      
004292*                                                                 137700      
004293 076-CARGA-LEY-BIN.                                               137702      
004294*------------------                                               137704      
004295     CALL "L710_CONSUL_LEYENDA IN ESTRUCTURA"                     137706      
004296           USING  SISTEMA                                         137708      
004297                  PROGRAMA                                        137710      
004298                  WKS-PARAM-ENT                                   137712      
004299                  WKS-PARAM-LEY                                   137714      
004300           GIVING RESULTAD.                                       137716      
004301                                                                  137718      
004302     IF RESULTAD  = 0 OR 1                                        137720      
004303         PERFORM 078-CARGA-BIN  VARYING W77-IND2                  137722      
004304                 FROM 1 BY 1 UNTIL W77-IND2 > 10                  137724      
004305         MOVE WKS-PAR-LEY-LLAVE1(10)  TO WKS-PAR-ENT-LLAVE1       137726      
004306         MOVE WKS-PAR-LEY-LLAVE2(10)  TO WKS-PAR-ENT-LLAVE2       137728      
004307         MOVE WKS-PAR-LEY-LLAVE3(10)  TO WKS-PAR-ENT-LLAVE3       137730      
004308         MOVE WKS-PAR-LEY-LLAVE4(10)  TO WKS-PAR-ENT-LLAVE4       137732      
004309         MOVE WKS-PAR-LEY-LLAVE5(10)  TO WKS-PAR-ENT-LLAVE5       137734      
004310         MOVE WKS-PAR-LEY-LLAVE6(10)  TO WKS-PAR-ENT-LLAVE6       137736      
004311         MOVE WKS-PAR-LEY-FE-INI-CONS TO WKS-PAR-ENT-FEC-INI-CONS 137738      
004312         MOVE WKS-PAR-LEY-NIVEL-INI   TO WKS-PAR-ENT-NIVEL-INI    137740      
004313     ELSE                                                         137742      
004314         MOVE 1                            TO W77-EOF             137744      
004315         MOVE RESULTAD                     TO W77-IND3            137746      
004316         MOVE SPACES                       TO WLI-ENCAB-52        137748      
004317                                              TEXTO-LJ            137750      
004318         MOVE "O"                          TO TIPO-LJ             137752      
004319         MOVE 020901                       TO CODIGO-LJ           137754      
004320         STRING "ERROR EN CALL LEYENDA BINES MUNDIAL,RESULT = ",  137756      
004321                 W77-IND3                                         137758      
004322                 DELIMITED BY SIZE                                137760      
004323                 INTO TEXTO-LJ                                    137762      
004324         MOVE TIPO-LJ        TO      WLI-TIPO-LJ                  137764      
004325         MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                 137766      
004326         PERFORM  000-030-IMPRIME-MENSAJE                         137768      
004327         CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.     137770      
004328                                                                  137772      
004329     IF RESULTAD = 0                                              137774      
004330        MOVE 1                            TO W77-EOF.             137776      
004331                                                                  137778      
004332*                                                                 137780      
004333 078-CARGA-BIN.                                                   137782      
004334*--------------                                                   137784      
004335     ADD 1 TO WKS-CONT-BIN.                                       137786      
004336     IF WKS-CONT-BIN < 101                                        137787      
004337        MOVE WKS-PAR-LEY-LLAVE1(W77-IND2)  TO                     137788      
004338                                    WKS-LEYENDA-BIN(WKS-CONT-BIN) 137790      
004339     ELSE                                                         137791      
004340        MOVE SPACES               TO WLI-ENCAB-52                 137792      
004341        MOVE "I"                  TO WLI-TIPO-LJ                  137793      
004342        MOVE 020601               TO CODIGO-LJ                    137794      
004343        MOVE "CAT L198 BIN > 100" TO WLI-TEXTO-LJ                 137795      
004344        PERFORM  000-030-IMPRIME-MENSAJE.                         137796      
004345                                                                  137798      
004346 100-ABRE-ARCHENT.                                                137800      
004347*-----------------                                                137900      
004348     MOVE W77-SISTEMA-PARAMETRO            TO WKS-SISSAL          138000      
004349     MOVE W77-SIS-FECPRO                   TO WKS-FEC-LOG         138600      
004350                                              WKS-FEC-DES         138700      
004351                                              WKS-FEC-SAL         138800      
004352                                              WKS-FEC-SAL2        138900      
004353                                              WKS-FEC-SAL2-MCH    138902      
004354                                              WKS-FEC-SAL-MPS     138905      
004355                                              WKS-FEC-SAL-CMOV    138910      
004356     MOVE ZEROS TO A2K-FEC-CAMD-001                               139000      
004357     MOVE W77-SIS-FECPRO  TO  A2K-FEC-CAMD-001                    139100      
004358     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            139200      
004359             A2K-CONV-CAMD-TO-AMD-EXIT                            139300      
004360     MOVE A2K-FEC-AMD-001 TO WKS-FEC-SAL WKS-FEC-SAL2             139400      
004361                             WKS-FEC-LOG WKS-FEC-DES              139500      
004362     MOVE WKS-TIT-LOG151                   TO WKS-TIT-ARMOV       139700      
004363     CHANGE ATTRIBUTE TITLE OF L01-DATOS   TO WKS-TIT-ARMOV       139800      
004364     OPEN INPUT L01-DATOS                                         139900      
004365     READ L01-DATOS INTO A00-R00-HDR-MOV.                         140000      
004366     IF A00-R00-HDR-FCH OF A00-R00-HDR-MOV NOT = W77-SIS-FECPRO   140100      
004367        MOVE SPACES      TO      WLI-ENCAB-52                     140200      
004368        MOVE "I"         TO      WLI-TIPO-LJ                      140300      
004369        MOVE 020101      TO      CODIGO-LJ                        140400      
004370        STRING " FECHA ERRONEA EN ARCH. MOVTOS. : " ,             140500      
004371               A00-R00-HDR-FCH OF A00-R00-HDR-MOV                 140600      
004372               DELIMITED BY SIZE INTO WLI-TEXTO-LJ                140700      
004373        MOVE WLI-TIPO-LJ        TO      TIPO-LJ                   140800      
004374        MOVE WLI-TEXTO-LJ       TO      TEXTO-LJ                  140900      
004375        PERFORM  000-030-IMPRIME-MENSAJE                          141000      
004376        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ       141100      
004377        SET MYSELF(STATUS) TO -1.                                 141200      
004378                                                                  141300      
004379*    IF A00-R00-HDR-BANDES = 1                                    141400      
004380     MOVE WKS-TIT-DES151                TO WKS-TIT-ARDES          141500      
004381     CHANGE ATTRIBUTE TITLE OF L02-DATOS TO WKS-TIT-ARDES         141600      
004382*       MOVE 1 TO W77-ARCH-DATADI                                 141700      
004383     OPEN INPUT L02-DATOS.                                        141800      
004384     MOVE "S253"                           TO WKS-SISSAL          141900      
004385     MOVE 001                              TO WKS-PRODSAL         142000      
004386     MOVE W77-NUM-CSI                      TO WKS-CSI-ORI         142100      
004387     MOVE WKS-TITULOS-SAL                  TO WKS-TIT-SAL253CMAE  142200      
004388     CHANGE ATTRIBUTE TITLE OF L03-DATOS   TO WKS-TIT-SAL253CMAE  142300      
004389     OPEN OUTPUT L03-DATOS                                        142400      
004390     MOVE "S253"                           TO WKS-SISSAL          142500      
004391     MOVE 066                              TO WKS-PRODSAL         142600      
004392     MOVE WKS-TITULOS-SAL                  TO WKS-TIT-SAL253CHEQ  142700      
004393     CHANGE ATTRIBUTE TITLE OF L04-DATOS   TO WKS-TIT-SAL253CHEQ  142800      
004394     OPEN OUTPUT L04-DATOS.                                       142900      
004395     MOVE "S264"                           TO WKS-SISSAL2         143000      
004396     MOVE W77-SISTEMA-PARAMETRO            TO WKS-PRODSAL2        143100      
004397     MOVE WKS-TITULOS-SAL2                 TO WKS-TIT-SAL264CMAE  143200      
004398     CHANGE ATTRIBUTE TITLE OF L05-DATOS   TO WKS-TIT-SAL264CMAE  143300      
004399     OPEN OUTPUT L05-DATOS.                                       143400      
004400     OPEN OUTPUT ARCH-LISTC.                                      145500      
004401     MOVE W77-NUM-CSI                      TO WKS-TIT-CSI,        145600      
004402                                              WKS-NODOSAL2-MCH    145610      
004403                                              WKS-NODOSAL2-PAG    145612      
004404                                              WKS-TIT-CSI-MCH     145620      
004405                                              WKS-TIT-CSIA        145640      
004406                                              WKS-TIT-CSI707.     145650      
004407     MOVE W77-SIS-FECPRO                   TO WKS-FECHA-S500,     145900      
004408                                              WKS-FECHA-S500-MCH  145920      
004409                                              WKS-FEC-SAL2-PAG    145925      
004410                                              WKS-FECHA-S707.     145950      
004411     MOVE ZEROS TO  A2K-FEC-CAMD-001.                             146000      
004412     MOVE W77-SIS-FECPRO TO  A2K-FEC-CAMD-001.                    146100      
004413     PERFORM A2K-CONV-CAMD-TO-AMD  THRU                           146200      
004414             A2K-CONV-CAMD-TO-AMD-EXIT.                           146300      
004415     MOVE A2K-FEC-AMD-001 TO  WKS-FECHA-S500,WKS-FECHA-S707.      146400      
004416     IF W77-SISTEMA-PARAMETRO = 500                               146450      
004417        OPEN OUTPUT L05-DATOS-MCH.                                146500      
004418     OPEN OUTPUT L07-DATOS.                                       146600      
004419     IF W77-SISTEMA-PARAMETRO = 264                               146605      
004420        OPEN OUTPUT L07-DATOS-MCH.                                146610      
004421     IF W77-SISTEMA-PARAMETRO = 500                               146620      
004422        OPEN OUTPUT L07-DATOS-PAG                                 146630      
004423        OPEN OUTPUT L12-DATOS.                                    146640      
004424     MOVE "S036"                           TO WKS-SISSAL          146700      
004425     MOVE W77-SISTEMA-PARAMETRO            TO WKS-PRODSAL         146800      
004426     MOVE WKS-TITULOS-SAL                  TO WKS-TIT-SAL036CHEQ  146900      
004427     CHANGE ATTRIBUTE TITLE OF L08-DATOS   TO WKS-TIT-SAL036CHEQ  147000      
004428     OPEN OUTPUT L08-DATOS.                                       147100      
004429     MOVE W77-SISTEMA-PARAMETRO            TO WKS-SIS-SALFT       147200      
004430                                              WKS-SIS-SALFR.      147300      
004431     IF WKS-NUMCSI = 04 OR 35 OR 12                               147400      
004432        MOVE 04                            TO WKS-TIT-NFTORI      147500      
004433                                              WKS-TIT-NFRDES      147600      
004434        MOVE 10                            TO WKS-TIT-NFTDES      147700      
004435                                              WKS-TIT-NFRORI      147800      
004436     ELSE                                                         147900      
004437     IF WKS-NUMCSI = 10 OR 33 OR 32                               148000      
004438        MOVE 10                            TO WKS-TIT-NFTORI      148100      
004439                                              WKS-TIT-NFRDES      148200      
004440        MOVE 04                            TO WKS-TIT-NFTDES      148300      
004441                                              WKS-TIT-NFRORI.     148400      
004442     MOVE WKS-FECHA-S500                   TO WKS-FECHA-FT        148500      
004443                                              WKS-FECHA-FR.       148600      
004444     OPEN OUTPUT L09-DATOS.                                       148700      
004445     OPEN OUTPUT L10-DATOS.                                       148800      
004446                                                                  148900      
004447     IF W77-SISTEMA-PARAMETRO = 500                               149000      
004448        MOVE "S054"                        TO WKS-SISSAL          149100      
004449        MOVE W77-SISTEMA-PARAMETRO         TO WKS-PRODSAL         149200      
004450        MOVE WKS-TITULOS-SAL               TO                     149300      
004451                                           WKS-TIT-SAL054CMAEYMAO 149400      
004452        CHANGE ATTRIBUTE TITLE OF L11-DATOS TO                    149500      
004453                                           WKS-TIT-SAL054CMAEYMAO 149600      
004454        OPEN OUTPUT L11-DATOS                                     149700      
004455        MOVE WKS-NUMCSI                    TO WKS-440-CSI         149710      
004456                                              WKS-CONLI-INTS440CSI149715      
004457        MOVE W77-SIS-FECPRO                TO WKS-440-FECHA       149720      
004458                                              WKS-CONLI-INTS440FEC149725      
004459        CHANGE ATTRIBUTE TITLE OF E04-FACTORAJE                   149730      
004460                                           TO WKS-TITLE-S440      149740      
004461        OPEN OUTPUT E04-FACTORAJE.                                149750      
004462     IF W77-SISTEMA-PARAMETRO = 500                               149752      
004463        MOVE W77-NUM-CSI     TO WKS-CSI-ORI-SORIANA               149754      
004464        MOVE W77-SIS-FECPRO  TO  A2K-FEC-CAMD-001                 149756      
004465        PERFORM A2K-CONV-CAMD-TO-AMD THRU                         149758      
004466                A2K-CONV-CAMD-TO-AMD-EXIT                         149760      
004467        MOVE A2K-FEC-AMD-001 TO WKS-FEC-SAL-SORIANA               149762      
004468       CHANGE ATTRIBUTE TITLE OF L13-SORIANA TO WKS-TIT-SALSORIANA149764      
004469       OPEN OUTPUT L13-SORIANA.                                   149766      
004470*                                                                 149768      
004471     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  149769      
004472        W77-SISTEMA-PARAMETRO = 500                               149770      
004473        MOVE "S013"            TO WKS-SISSAL-MPS                  149771      
004474        MOVE "S253"            TO WKS-SISSAL-CMOV                 149772      
004475        MOVE W77-NUM-CSI       TO WKS-CSI-ORI-MPS                 149773      
004476                                  WKS-CSI-ORI-CMOV                149774      
004477        CHANGE ATTRIBUTE TITLE OF L14-MPS TO WKS-TIT-SALMPS       149775      
004478        OPEN OUTPUT L14-MPS                                       149776      
004479        MOVE WKS-TITULOS-SALCMOV  TO WKS-TIT-SAL253-CMOV          149777      
004480        CHANGE ATTRIBUTE TITLE OF L15-DATOS TO WKS-TIT-SAL253-CMOV149778      
004481        OPEN OUTPUT L15-DATOS.                                    149779      
004482     IF W77-SISTEMA-PARAMETRO = 500                               149780      
004483*        MOVE W77-NUM-CSI     TO WKS-PG-NODO                      149782      
004484        MOVE W77-NUM-CSI     TO WKS-TLM-NODO WKS-PORTPG-NODO      149784      
004485                                WKS-TT-EAS-NODO WKS-TT-EXTNET-NODO149785      
004486*        MOVE W77-SIS-FECPRO  TO WKS-PG-FEC                       149786      
004487        MOVE W77-SIS-FECPRO  TO WKS-TLM-FEC WKS-TT-EXTNET-FEC     149787      
004488                                WKS-FECHA-AUT                     149788      
004489                                WKS-PORTPG-FEC  WKS-TT-EAS-FEC    149789      
004490        CHANGE ATTRIBUTE TITLE OF A03-PORTPG-INT                  149790      
004491        TO WKS-TITLE-PORTPG-INTELAR                               149791      
004492*        CHANGE ATTRIBUTE TITLE OF A02-PG-ARCHIVO                 149792      
004493*        TO WKS-TITLE-PG-ARCHIVO                                  149793      
004494        CHANGE ATTRIBUTE TITLE OF L16-DATOS                       149794      
004495        TO WKS-TITLE-EAS-ARCHIVO                                  149795      
004496        MOVE WKS-TITLE-TLM-ARCHIVO        TO WKS-TITLE-TLM-ARCHIVO149796      
004497        CHANGE ATTRIBUTE TITLE OF A01-TLM-ARCHIVO                 149798      
004498        TO WKS-TITLE-TLM-ARCHIVO                                  149800      
004499        PERFORM 100-ABRE-ARCHEXTNET                               149801      
004500        OPEN OUTPUT L16-DATOS                                     149803      
004501        OPEN OUTPUT A01-TLM-ARCHIVO                               149804      
004502        OPEN OUTPUT A03-PORTPG-INT.                               149805      
004503*                                                                 149810      
004504 120-CREA-HEADER.                                                 149900      
004505*----------------                                                 150000      
004506     MOVE W77-SISTEMA-PARAMETRO TO E05-R00-SISDES                 150100      
004507                                   E05-R00-SISDES-MCH.            150200      
004508     MOVE W77-SIS-FECPRO  TO E00-R00-FECPRO OF E00-R00-S264-HDR,  150700      
004509                             E00-R00-FECPRO OF E00-R00-S253-HDR,  150800      
004510                             WKS-FEC-AMD,      E05-R00-FECPRO,    150900      
004511                                               E05-R00-FECPRO-MCH,150950      
004512                             E00-R00-S036-FECPRO.                 151000      
004513     MOVE W77-SIS-FECPRO  TO  WKS-FEC-AMD.                        151100      
004514     MOVE ZEROS TO A2K-FEC-CAMD-001.                              151200      
004515     MOVE W77-SIS-FECPRO TO A2K-FEC-CAMD-001.                     151300      
004516     PERFORM A2K-CONV-CAMD-TO-AMD  THRU                           151400      
004517             A2K-CONV-CAMD-TO-AMD-EXIT.                           151500      
004518     MOVE A2K-FEC-AMD-001 TO E00-R00-FECPRO OF E00-R00-S264-HDR,  151600      
004519                             E00-R00-FECPRO OF E00-R00-S253-HDR,  151700      
004520                             E05-R00-FECPRO, E00-R00-S054-FECPRO, 151800      
004521*** INI EAS 2023R03                                               151802      
004522                             E00-R00-EAS-FECPRO,                  151804      
004523*** FIN EAS 2023R03                                               151806      
004524*** INI EXTNET 2023 R11                                           151810      
004525                             500-R01-FECPRO,                      151820      
004526*** FIN EXTNET 2023 R11                                           151840      
004527                             E05-R00-FECPRO-MCH,                  151850      
004528                             E05-R00-FECPRO-PAG,                  151860      
004529                             E00-R00-S036-FECPRO.                 151900      
004530     MOVE WKS-AMD-AA      TO E00-R00-S030-FECPRO-AA               152400      
004531                             WS-AMO-PRO                           152500      
004532     MOVE ZEROS TO A2K-FEC-CCAA-001.                              152600      
004533     MOVE WKS-AMD-AA TO  A2K-FEC-CCAA-001.                        152700      
004534     MOVE A2K-FEC-CCAA-AA-001 TO E00-R00-S030-FECPRO-AA           152800      
004535     MOVE WKS-AMD-MM      TO E00-R00-S030-FECPRO-MM               153100      
004536                             WS-MES-PRO                           153200      
004537     MOVE WKS-AMD-DD      TO E00-R00-S030-FECPRO-DD               153300      
004538                             WS-DIA-PRO                           153400      
004539     MOVE W77-NUM-CSI     TO E00-R00-NUMCSI OF E00-R00-S264-HDR,  153500      
004540                             E00-R00-NUMCSI OF E00-R00-S253-HDR,  153600      
004541                             E05-R00-NUMCSI, E00-R00-S036-NUMCSI, 153700      
004542                             E05-R00-NUMCSI-MCH,                  153750      
004543                             E05-R00-NUMCSI-PAG,                  153760      
004544*** INI EAS 2023R03                                               153762      
004545                            E00-R00-EAS-NUMCSI,                   153764      
004546*** FIN EAS 2023R03                                               153766      
004547*** INI EXTNET 2023 R11                                           153770      
004548                             500-R01-NODORI,                      153780      
004549*** FIN EXTNET 2023 R11                                           153790      
004550                             E00-R00-S054-NUMCSI.                 153800      
004551     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          154200      
004552             A2K-ACCEPT-TODAYS-DATE-EXIT.                         154300      
004553     MOVE A2K-FEC-MDCA-001 TO WKS-FECH-MAQ                        154400      
004554     ACCEPT WKS-HORA-PROCESO FROM TIME                            154600      
004555     MOVE WKS-FM-AA       TO WS-AMO-ACT                           154900      
004556     MOVE WKS-FM-AA       TO E05-R00-S500-AA                      155200      
004557                             E05-R00-S500-AA-MCH                  155300      
004558     MOVE ZEROS TO A2K-FEC-CCAA-001.                              155400      
004559     MOVE WKS-FM-AA  TO A2K-FEC-CCAA-001.                         155500      
004560     MOVE A2K-FEC-CCAA-AA-001 TO E05-R00-S500-AA                  155700      
004561                                 E05-R00-S500-AA-MCH              155800      
004562     MOVE WKS-FM-MM       TO E05-R00-S500-MM                      156100      
004563                             E05-R00-S500-MM-MCH                  156150      
004564                             WS-MES-ACT                           156200      
004565     MOVE WKS-FM-DD       TO E05-R00-S500-DD                      156400      
004566                             E05-R00-S500-DD-MCH                  156450      
004567                             WS-DIA-ACT                           156500      
004568     MOVE WKS-HORA-HMS    TO E05-R00-HORA                         156700      
004569*** INI EXTNET 2023 R11                                           156702      
004570                             500-R01-HORARC                       156705      
004571*** FIN EXTNET 2023 R11                                           156706      
004572                             E05-R00-HORA-MCH                     156710      
004573     MOVE WKS-HORA-HMSS   TO WS-HORA-PRO                          156720      
004574     MOVE WKS-MINU-HMSS   TO WS-MINU-PRO                          156740      
004575     MOVE WKS-SEGU-HMSS   TO WS-SEGU-PRO                          156760      
004576     MOVE W77-SISTEMA-PARAMETRO TO WS-NUM-SIS                     157800      
004577     MOVE  0001           TO E00-R00-CVEPRD OF E00-R00-S253-HDR   157900      
004578     WRITE L03-DAT FROM E00-R00-S253-HDR.                         158000      
004579     MOVE  0066           TO E00-R00-CVEPRD OF E00-R00-S253-HDR   158100      
004580     WRITE L04-DAT FROM E00-R00-S253-HDR.                         158200      
004581     MOVE  00264          TO E00-R00-CVEPRD OF E00-R00-S264-HDR   158300      
004582     WRITE L05-DAT FROM E00-R00-S264-HDR.                         158400      
004583     WRITE L07-DAT FROM E05-R00-S500-HDR.                         158600      
004584     MOVE  00999          TO E00-R00-CVEPRD OF E00-R00-S264-HDR   158620      
004585     IF W77-SISTEMA-PARAMETRO = 500                               158640      
004586        WRITE L07-DAT-PAG FROM E05-R00-S500-HDR-PAG               158650      
004587        WRITE L05-DAT-MCH FROM E00-R00-S264-HDR.                  158660      
004588     IF W77-SISTEMA-PARAMETRO = 264                               158670      
004589        WRITE L07-DAT-MCH FROM E05-R00-S500-HDR-MCH.              158680      
004590     WRITE L08-DAT FROM E00-R00-S036-HDR.                         158700      
004591     MOVE 00              TO A00-F00-HDR-TIPO.                    158800      
004592     MOVE W77-SIS-FECPRO  TO A00-F00-HDR-FCH.                     158900      
004593     WRITE L09-DAT FROM A00-F00-HDR-FOR.                          159000      
004594     WRITE L10-DAT FROM A00-F00-HDR-FOR.                          159100      
004595                                                                  159200      
004596     IF W77-SISTEMA-PARAMETRO = 500                               159300      
004597        WRITE L12-DAT FROM E05-R00-S500-HDR                       159350      
004598*** INI EAS 2023R03                                               159352      
004599        WRITE L16-DAT FROM E00-R00-EAS-HDR                        159354      
004600*** FIN EAS 2023R03                                               159356      
004601        PERFORM 1555-CREA-HDR-BNX                                 159400      
004602        WRITE L11-DAT FROM E00-R00-S054-HDR.                      159600      
004603*** INI EXTNET 2023 R11                                           159650      
004604     IF W77-SISTEMA-PARAMETRO = 500 AND W88-HOSTNAME              159700      
004605        MOVE "OVERNIGHT EXTENDED NETWORK" TO 500-R01-DESCARC      159720      
004606        WRITE L17-DAT-EXTNET FROM 500-R01-HDR-CLIENTESCITID.      159740      
004607*** FIN EXTNET 2023 R11                                           159760      
004608   MOVE W77-SISTEMA-PARAMETRO    TO WKS-TIT-SIS-0410              159800      
004609   MOVE WKS-NUMCSI               TO WKS-TIT-CSI-0410              159900      
004610   MOVE W77-SIS-FECPRO           TO WKS-FECHA-0410                160000      
004611                                                                  160100      
004612   IF W77-SISTEMA-PARAMETRO = 500                                 160200      
004613      OPEN OUTPUT A01-PBCOS-0410                                  160300      
004614      MOVE 002012                   TO E00-R00-PBCOS-BCOS         160400      
004615      MOVE W77-SIS-FECPRO           TO E00-R00-PBCOS-FECPROCESO   160500      
004616     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          160800      
004617             A2K-ACCEPT-TODAYS-DATE-EXIT                          160900      
004618     MOVE A2K-FEC-MDCA-001 TO WKS-FECH-MAQ                        161000      
004619                                                                  161200      
004620      MOVE WKS-FEC-AMD              TO E00-R00-PBCOS-FECGENERADO  161300      
004621      MOVE WKS-HORA-PROCESO         TO E00-R00-PBCOS-HORAGENERADO 161400      
004622      WRITE A01-R01-PBCOS-0410  FROM E00-R00-PBCOS-HDR.           161500      
004623     IF W77-SISTEMA-PARAMETRO = 500                               161502      
004624        MOVE 1                TO E13-R00-SORI-TIPO-REG            161504      
004625        MOVE "SORIANA"        TO E13-R01-SORI                     161506      
004626        MOVE W77-NUM-CSI      TO E13-R01-SORI-CSI-ORI             161508      
004627        MOVE W77-SIS-FECPRO   TO  A2K-FEC-CAMD-001                161510      
004628        PERFORM A2K-CONV-CAMD-TO-AMD THRU                         161512      
004629                A2K-CONV-CAMD-TO-AMD-EXIT                         161514      
004630        MOVE A2K-FEC-AMD-001  TO E13-R01-SORI-FECPROCESO          161516      
004631        PERFORM A2K-ACCEPT-TODAYS-DATE THRU                       161518      
004632                A2K-ACCEPT-TODAYS-DATE-EXIT                       161520      
004633        MOVE A2K-FEC-MDCA-001 TO WKS-FECH-MAQ                     161522      
004634        MOVE WKS-FEC-AMD      TO E13-R01-SORI-FECGENERADO         161524      
004635        MOVE WKS-HORA-PROCESO TO E13-R01-SORI-HORAGENERADO        161526      
004636        MOVE SPACES           TO E13-R01-SORI-FILLER              161528      
004637        WRITE L13-DAT FROM E13-REG-SORIANA.                       161530      
004638                                                                  161531      
004639     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  161532      
004640        W77-SISTEMA-PARAMETRO = 500                               161534      
004641        MOVE 10               TO E14-R01-S013-CSI-ORI             161540      
004642        MOVE A2K-FEC-AMD-001  TO E14-R01-S013-FECPROCESO          161542      
004643        MOVE WKS-FEC-AMD      TO E14-R01-S013-FECGENERADO         161544      
004644        MOVE WKS-HORA-PROCESO TO E14-R01-S013-HORAGENERADO        161546      
004645        MOVE SPACES           TO E14-R01-S013-FILLER              161548      
004646        WRITE L14-DAT      FROM  E14-R01-S013-HDR.                161550      
004647                                                                  161551      
004648     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  161552      
004649        W77-SISTEMA-PARAMETRO = 500                               161554      
004650        MOVE A2K-FEC-AMD-001   TO E15-R00-FECPRO                  161556      
004651        MOVE 10                TO E15-R00-NUMCSI                  161558      
004652        MOVE 0500              TO E15-R00-CVEPRD                  161560      
004653        MOVE SPACES            TO E15-R00-FILLER                  161561      
004654        WRITE L15-DAT        FROM E15-R00-253-HDR.                161562      
004655                                                                  161564      
004656    IF W77-SISTEMA-PARAMETRO = 500                                161566      
004657        MOVE ZERO                   TO E06-PORTPG-TRA-NUMA        161568      
004658        MOVE A2K-FEC-AMD-001        TO E06-PORTPG-HDR-FECH        161570      
004659        MOVE 01                     TO E06-PORTPG-HDR-TIPO        161572      
004660        WRITE R06-PORTPG-INTELAR    FROM E06-PORTPG-HDR-CRL.      161574      
004661                                                                  161600      
004662* <IBM>-INICIO -ESS- FILTRO PARA MOVIMIENTOS TELETON              161605      
004663 190-LECTURA.                                                     161610      
004664*------------                                                     161615      
004665     READ L01-DATOS INTO  A00-R01-REGMOV                          161620      
004666          AT END MOVE 1           TO W77-FIN-PROCESO.             161625      
004667                                                                  161630      
004668     IF A00-R01-FUNCION            = 99                           161635      
004669        MOVE 1                    TO W77-FIN-PROCESO              161640      
004670     ELSE                                                         161645      
004671        MOVE A00-R01-TIPO-PROC    TO WKS-MOV-TELETON              161650      
004672        IF W77-SISTEMA-PARAMETRO   = 500 AND MOV-TELETON          161655      
004673           NEXT SENTENCE                                          161660      
004674        ELSE                                                      161665      
004675           MOVE 1                 TO W77-SIGUE.                   161670      
004676* <IBM>-   FIN -ESS- FILTRO PARA MOVIMIENTOS TELETON              161675      
004677                                                                  161680      
004678 200-PROCESO.                                                     161700      
004679*------------                                                     161800      
004680     MOVE ZEROS   TO WKS-MOV-TELETON           .                  161810      
004681                                                                  162220      
004682     MOVE  A00-R01-MDA-CTA        TO WKS-VAL-MDA.                 162230      
004683     MOVE  A00-R01-MDA-SUC        TO WKS-CTA-MOVIL.               162233      
004684     MOVE  0                      TO WKS-BIN-MOVIL.               162236      
004685*                                                                 162240      
004686     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  162250      
004687        W77-SISTEMA-PARAMETRO = 500 AND WKS-MDA-BIN > 0           162253      
004688        PERFORM 201-VALIDA-CAT-BIN VARYING W77-IND FROM 1 BY 1    162255      
004689                UNTIL W77-IND > 100.                              162260      
004690                                                                  162265      
004691     IF W88-SOLO-PUNTEO                                           162300      
004692        NEXT SENTENCE                                             162400      
004693     ELSE                                                         162500      
004694     PERFORM 400-LEE-DATOS-ADIC                                   162550      
004695     IF ((NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1            162600      
004696       AND A00-R01-STATUS = 1 AND (A00-R01-ORIGEN = 1 OR 3))      162700      
004697           IF (A00-R01-SIST-ORIG = 253 OR 264 OR 999 OR 15 OR 54  163200      
004698*** INI EAS 2023R03                                               163201      
004699               OR 36 OR 1004 ) OR                                 163202      
004700*** FIN EAS 2023R03                                               163203      
004701              ((A00-R01-CVEMDA = 2 AND WKS-MDA-BIN = 557874)      163204      
004702                OR BIN-MOVIL) OR (A00-R01-SIST-ORIG = 274 AND     163205      
004703                A00-R01-SUCTRAN = 870 AND A00-R01-CAJATRAN = 76)  163206      
004704            PERFORM 210-MUEVE-DATOS VARYING W77-IND FROM 1        163400      
004705            BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN(W77-IND) = 0 163500      
004706           ELSE                                                   163520      
004707              NEXT SENTENCE                                       163540      
004708     ELSE                                                         163600      
004709     IF ((NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1 AND        163700      
004710           A00-R01-STATUS = 1  AND (A00-R01-ORIGEN = 1 OR 3))     163800      
004711           IF ((A00-R01-CVEMDA = 2 AND WKS-MDA-BIN = 557874)      164000      
004712                OR BIN-MOVIL)                                     164100      
004713            PERFORM 210-MUEVE-DATOS-MUNDIAL VARYING W77-IND FROM 1164200      
004714            BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN(W77-IND) = 0.164300      
004715                                                                  164800      
004716     IF (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1             164900      
004717        AND A00-R01-STATUS = 1 AND                                165100      
004718        ((W77-SISTEMA-PARAMETRO NOT = 264 AND                     165200      
004719        A00-R01-TIPO-PROC < 15) OR (W77-SISTEMA-PARAMETRO = 264)) 165300      
004720        PERFORM 220-DATOS-PUNTEO VARYING W77-IND FROM 1 BY 1      166100      
004721                UNTIL W77-IND > 5 OR A00-R01-CVETRAN(W77-IND) = 0.166200      
004722                                                                  166300      
004723     IF W88-SOLO-PUNTEO                                           166400      
004724        NEXT SENTENCE                                             166500      
004725     ELSE                                                         166600      
004726     IF (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1             166700      
004727        AND A00-R01-STATUS = 1 AND (A00-R01-ORIGEN = 2 OR 3)      166800      
004728          PERFORM 230-DATOS-FORANEOS.                             166900      
004729*** INI EXTNET 2023 R11                                           166920      
004730      IF W88-HOSTNAME AND W77-SISTEMA-PARAMETRO = 500 AND         166930      
004731       (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1              166950      
004732        AND (A00-R01-STATUS = 1 OR 2 OR 3 OR 4)                   166960      
004733        AND (A00-R01-ORIGEN = 1 OR 3)                             166970      
004734          PERFORM 230-DATOS-EXTNET                                166980      
004735      ELSE                                                        166981      
004736      IF W88-HOSTNAME AND W77-SISTEMA-PARAMETRO = 500             166982      
004737         PERFORM 400050-VALIDACION-ELIM-EXTNET                    166983      
004738         IF (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 2         166984      
004739            AND W77-ELIMINA-EXT = 1                               166985      
004740            PERFORM 400-GRABA-DETALLE-EXTNET VARYING W77-IND FROM 166986      
004741            1 BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN (W77-IND)=0166987      
004742         ELSE                                                     166988      
004743            NEXT SENTENCE                                         166989      
004744      ELSE                                                        166990      
004745          NEXT SENTENCE.                                          166991      
004746*** FIN EXTNET 2023 R11                                           167000      
004747     IF W77-SISTEMA-PARAMETRO = 500                               167100      
004748        IF (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1          167200      
004749           AND A00-R01-STATUS  = 1                                167300      
004750           PERFORM 212-VALIDA-DATOS-S440                          167440      
004751           PERFORM 205-ENVIA-CMP VARYING W77-IND FROM             167500      
004752           1 BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN(W77-IND) = 0167600      
004753                                                                  167700      
004754    IF W77-SISTEMA-PARAMETRO = 500                  AND           167800      
004755      (A00-R01-BCOS =  002012     OR   012002)      AND           167900      
004756      (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1 AND           168000      
004757       A00-R01-STATUS = 1                           AND           168200      
004758       A00-R01-TIPO-PROC < 15 AND A00-R01-ORIGEN NOT = 2          168300      
004759       PERFORM 220-DATOS-PBCOS     VARYING W77-IND FROM 1 BY 1    169000      
004760             UNTIL W77-IND > 5 OR A00-R01-CVETRAN(W77-IND) = 0.   169005      
004761                                                                  169006      
004762     IF W77-SISTEMA-PARAMETRO = 500                               169007      
004763        PERFORM 100000-SELECCIONA-PORTA.                          169008      
004764                                                                  169009      
004765     IF W77-SISTEMA-PARAMETRO = 500 AND                           169015      
004766        (A00-R01-ORIGEN = 1 OR 3)                                 169020      
004767        IF (NOT W88-FIN-PROCESO) AND A00-R01-FUNCION = 1          169025      
004768           AND A00-R01-STATUS  = 1                                169030      
004769           PERFORM 240-VALIDA-DATOS-SORIANA.                      169035      
004770     IF W77-SISTEMA-PARAMETRO = 500                               169036      
004771     AND A00-R01-FUNCION = 1 AND A00-R01-STATUS  = 1              169038      
004772     AND A00-R01-ORIGEN NOT= 2                                    169039      
004773        PERFORM 400-LEE-DATOS-ADIC                                169040      
004774        PERFORM 210-MUEVE-DATOS-PG VARYING W77-IND FROM 1         169042      
004775        BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN (W77-IND) = 0.   169044      
004776                                                                  169050      
004777     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  169052      
004778        W77-SISTEMA-PARAMETRO = 500 AND                           169054      
004779        ((A00-R01-CVEMDA = 4) OR                                  169055      
004780         (A00-R01-CVEMDA = 1  AND  CTA-MOVIL) OR                  169060      
004781         (A00-R01-CVEMDA = 2  AND  BIN-MOVIL))                    169065      
004782         IF ((NOT W88-FIN-PROCESO) AND                            169070      
004783             A00-R01-FUNCION = 1 AND                              169075      
004784             A00-R01-STATUS  = 1)                                 169080      
004785             PERFORM 202-MUEVE-MPS.                               169085      
004786     MOVE ZERO           TO W77-SIGUE.                            169090      
004787     PERFORM 190-LECTURA UNTIL W77-SIGUE = 1 OR W88-FIN-PROCESO.  169095      
004788*                                                                 169100      
004789 201-VALIDA-CAT-BIN.                                              169105      
004790*-------------------                                              169110      
004791     IF WKS-BIN-VALIDO(W77-IND) = WKS-MDA-BIN                     169115      
004792        MOVE 1    TO WKS-BIN-MOVIL                                169120      
004793        MOVE 101  TO W77-IND                                      169125      
004794     ELSE                                                         169130      
004795        MOVE 0 TO WKS-BIN-MOVIL.                                  169135      
004796                                                                  169140      
004797 202-MUEVE-MPS.                                                   169145      
004798*--------------                                                   169150      
004799     MOVE A01-R01-REFERENCIA1  TO          WKS-DAT-ORIGEN-REF1 .  169155      
004800     MOVE A00-R01-CVEMDA       TO          E14-R02-S013-CVEMDA .  169232      
004801     MOVE A00-R01-NUMMDA       TO          E14-R02-S013-VALMDE .  169234      
004802     MOVE WKS-ORIGEN-FOLIO     TO          E14-R02-S013-FOLORI .  169236      
004803*    MOVE A00-R01-SIST-ORIG    TO          E14-R02-S013-SISORI .  169238      
004804     MOVE WKS-ORIGEN-MDE       TO          E14-R02-S013-SISORI .  169239      
004805     MOVE WKS-ORIGEN-HRAMOV    TO          E14-R02-S013-HRAORI .  169240      
004806     MOVE WKS-ORIGEN-FECMOV    TO          E14-R02-S013-FECORI .  169242      
004807     MOVE A00-R01-SUCTRAN      TO          E14-R02-S013-SIRH   .  169244      
004808     MOVE A00-R01-CAJATRAN     TO          E14-R02-S013-CAJA   .  169246      
004809     MOVE A01-R01-REF23POS     TO          E14-R02-S013-REFER23.  169248      
004810     MOVE A01-R01-REF2-CTE     TO          WKS-DAT-ORIGEN-REF2 .  169249      
004811     MOVE WKS-ORIGEN-AUTDES    TO          E14-R02-S013-AUTDES .  169250      
004812     MOVE A00-R01-FECMOV       TO          E14-R02-S013-FECMOV .  169252      
004813     MOVE A00-R01-HORMOV       TO          E14-R02-S013-HRAMOV .  169254      
004814     MOVE A00-R01-FECCONT      TO          E14-R02-S013-FECCONT.  169256      
004815     MOVE WKS-ORIGEN-REFATM    TO          E14-R02-S013-REFER12.  169258      
004816     MOVE SPACES               TO          E14-R02-S013-FILLER.   169259      
004817*TOTALIZA Y LLENA TRAILER                                         169260      
004818     PERFORM 203-MUEVE-IMPORTE-MPS                                169261      
004819             VARYING W77-IND FROM 1 BY 1                          169262      
004820             UNTIL   W77-IND > 5    OR                            169264      
004821                     A00-R01-CVETRAN(W77-IND) = 0.                169266      
004822*                                                                 169268      
004823 203-MUEVE-IMPORTE-MPS.                                           169270      
004824*----------------------                                           169272      
004825*  IF A00-R01-CVETRAN(W77-IND)  = 1187 OR 1188 OR 1189 OR 1190    169274      
004826*                              OR 1191 OR 2366 OR 2367 OR 2368    169276      
004827*                              OR 2369                            169278      
004828      IF WKS-CVE-REN(A00-R01-CVETRAN(W77-IND)) = 10               169279      
004829      MOVE A00-R01-IMPORTE(W77-IND)        TO E14-R02-S013-IMPORTE169280      
004830      PERFORM 204-VALIDA-NATTRAN                                  169282      
004831      MOVE A00-R01-CVETRAN(W77-IND)        TO E14-R02-S013-CVETRAN169304      
004832      WRITE L14-DAT FROM  E14-R02-S013-DET                        169306      
004833      ADD  1                               TO E14-R03-S013-TOTREG 169308      
004834      ADD  E14-R02-S013-IMPORTE            TO E14-R03-S013-TOTIMP 169310      
004835      MOVE SPACES                          TO E14-R03-S013-FILLER.169312      
004836                                                                  169314      
004837                                                                  169316      
004838 204-VALIDA-NATTRAN.                                              169318      
004839*-------------------                                              169320      
004840      IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 1                169322      
004841          MOVE "CARGO" TO E14-R02-S013-NATTRAN                    169324      
004842      ELSE                                                        169326      
004843          IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 2            169328      
004844             MOVE "ABONO" TO E14-R02-S013-NATTRAN                 169330      
004845          ELSE                                                    169332      
004846             MOVE "NO CONTABLE" TO E14-R02-S013-NATTRAN.          169336      
004847                                                                  169342      
004848 205-ENVIA-CMP.                                                   169344      
004849*--------------                                                   169400      
004850   IF W77-NREG-BNX = 350001  PERFORM 1955-OTRO-ARCHBNX.           169500      
004851   IF A00-R01-CVETRAN(W77-IND) = 2002      MOVE 1 TO DT-TIPI-CMP  169700      
004852   ELSE                                                           169800      
004853      IF A00-R01-BCO-ORI = A00-R01-BCO-DES MOVE 2 TO DT-TIPI-CMP  169900      
004854      ELSE                                 MOVE 3 TO DT-TIPI-CMP. 170000      
004855                                                                  170100      
004856   IF  A00-R01-SUC-INIC > 0 AND (A00-R01-ORIGEN = 1 OR 2)         172700      
004857      IF WKS-CVE-CMP(A00-R01-CVETRAN(W77-IND)) = 2 AND            172800      
004858         WKS-REL-CMP(A00-R01-SUC-INIC) NOT = 999                  172900      
004859         ADD 1                                TO W77-NREG-BNX     173100      
004860         MOVE A00-R01-CVETRAN(W77-IND)        TO DT-CVET-CMP      173102      
004861         MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) TO DT-NATU-CMP173104      
004862         MOVE A00-R01-FECCONT                 TO DT-FECA-CMP      173106      
004863         MOVE A00-R01-SUC-INIC                TO DT-SUCC-CMP      173108      
004864         MOVE A00-R01-CAJA-INIC               TO DT-NCAJ-CMP      173110      
004865         MOVE A00-R01-REFNUM                  TO DT-NDOC          173112      
004866         MOVE A00-R01-IMPORTE(W77-IND)        TO DT-IMPT-CMP      173114      
004867         MOVE A00-R01-BCO-DES                 TO DT-BCOE-CMP      173116      
004868         MOVE A00-R01-AUT3ER                  TO W77-OPER-CMP     173118      
004869         MOVE W77-OPER-CMP                    TO DT-OPER-CMP      173120      
004870         MOVE ZEROS                           TO DT-FILLER,       173122      
004871                                                 DT-NDOCF         173124      
004872         MOVE A00-R01-MDA-SUC                 TO DT-CTA-SUC       173126      
004873         MOVE A00-R01-MDA-CTA                 TO DT-CTA-CTA       173128      
004874         MOVE A00-R01-MONEDA                  TO DT-NMON-CMP      173130      
004875         MOVE A00-R01-AUTORIZA                TO DT-AUTZ-CMP      173132      
004876         MOVE A00-R01-PRODUCTO                TO DT-PROD-CMP      173134      
004877         MOVE A00-R01-INSTRUMENTO             TO W77-INST-CMP     173136      
004878         MOVE W77-INST-CMP                    TO DT-INST-CMP      173138      
004879         MOVE A00-R01-FECMOV                  TO DT-FECO-CMP      173140      
004880         MOVE A00-R01-HORMOV                  TO DT-HRSO-CMP      173142      
004881         MOVE W77-NREG-BNX                    TO DT-NSEC-CMP      173200      
004882         MOVE A00-R01-SUC-INIC                TO DT-SUCC-CMP      173300      
004883         MOVE A00-R01-CAJA-INIC               TO DT-NCAJ-CMP      173400      
004884         MOVE A00-R01-AUTORIZA                TO DT-AUTZ-CMP      173500      
004885*        MOVE A00-R01-MDA-SUC                 TO DT-SUCMDA-CMP    173510      
004886*        MOVE A00-R01-MDA-CTA                 TO DT-CTAMDA-CMP    173520      
004887*        MOVE A00-R01-REFNUM                  TO DT-REFNUM-CMP    173530      
004888         MOVE A01-R01-REF2-CTE                TO DT-REFALF-CMP    173540      
004889         MOVE A00-R01-NOMINA-OPE              TO DT-NOMINA-CMP    173550      
004890         ADD  A00-R01-IMPORTE(W77-IND)        TO W77-IMPT-BNX     173600      
004891         WRITE REG-BNX FROM DET-CMP.                              173700      
004892                                                                  173800      
004893 210-MUEVE-DATOS.                                                 175200      
004894*-----------------                                                175300      
004895     MOVE ZEROS TO W77-GENER, W77-AFC.                            175400      
004896     IF A00-R01-CVETRAN(W77-IND) > 0 AND A00-R01-CVETRAN(W77-IND) 175500      
004897                                         < 5001                   175600      
004898        MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND))  TO W77-AFC.   175700      
004899                                                                  175800      
004900     IF (A00-R01-SIST-ORIG = 253 OR 54) AND                       175900      
004901        (A00-R01-CVETRAN(W77-IND) = 1021 OR 2020 OR 1001 OR 1004  176000      
004902                         OR 1193 OR 1197 OR 2388 OR 2394          176020      
004903                         OR 2100 OR 2109 OR 2111 OR 1070 OR 2131) 176100      
004904          MOVE A00-R01-SUCPROM           TO E00-R01-S253-SUCPRO   176800      
004905          PERFORM 211-VALIDA-CONTRATO                             176950      
004906          MOVE A00-R01-CVETRAN(W77-IND)  TO E00-R01-S253-CVEMOV   177000      
004907          MOVE A00-R01-IMPORTE(W77-IND)  TO E00-R01-S253-IMPORTE  177100      
004908          MOVE A00-R01-SUC-INIC          TO E00-R01-S253-SUCTRA   177200      
004909          MOVE A00-R01-CAJA-INIC         TO E00-R01-S253-CAJTRA   177300      
004910          MOVE A00-R01-AUTORIZA          TO E00-R01-S253-AUT      177400      
004911          MOVE A01-R01-REF23POS          TO E00-R01-S253-REF      177500      
004912          MOVE A00-R01-FECVAL            TO E00-R01-S253-FECVAL   178100      
004913          MOVE ZEROS TO A2K-FEC-CAMD-001                          178200      
004914          MOVE A00-R01-FECVAL  TO  A2K-FEC-CAMD-001               178300      
004915          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       178400      
004916                  A2K-CONV-CAMD-TO-AMD-EXIT                       178500      
004917          MOVE A2K-FEC-AMD-001  TO  E00-R01-S253-FECVAL           178600      
004918          MOVE A00-R01-REFNUM            TO E00-R01-S253-NUMREF   178800      
004919          MOVE A00-R01-MDA-SUC           TO E00-R01-S253-SUCTAR   178900      
004920          MOVE A00-R01-MDA-CTA           TO E00-R01-S253-NUMTAR   179000      
004921          MOVE A00-R01-PRODUCTO          TO E00-R01-S253-PROD     179100      
004922          MOVE A00-R01-INSTRUMENTO       TO E00-R01-S253-INST     179200      
004923          MOVE A00-R01-MONEDA            TO E00-R01-S253-MONE     179300      
004924          MOVE A00-R01-ORIGEN            TO E00-R01-S253-ORIG     179400      
004925          IF A00-R01-TIPO-PROC < 11                               179500      
004926             PERFORM 215-SUMA-SALDOS-S253                         179700      
004927             PERFORM 500-ESCRIBE-253.                             179800      
004928                                                                  180000      
004929     IF W77-SISTEMA-PARAMETRO = 500  AND                          180010      
004930        (A00-R01-SIST-ORIG = 274 OR 999) AND                      180020      
004931        (A00-R01-CVETRAN(W77-IND)= 2228 OR 1098 OR 1213 OR 1031)  180030      
004932        PERFORM 216-MUEVE-DATOS-PAG                               180040      
004933        PERFORM 217-SUMA-SALDOS-PAG                               180050      
004934        PERFORM 526-ESCRIBE-PAG                                   180060      
004935     ELSE                                                         180070      
004936     IF (A00-R01-SIST-ORIG = 264 OR 999 OR 15) AND                180100      
004937        (W77-AFC = 1 OR 2)               AND                      180150      
004938        A00-R01-CVETRAN(W77-IND) < 3000                           180200      
004939        MOVE A00-R01-SUCPROM              TO E00-R01-S264-SUCPRO  180300      
004940        MOVE A00-R01-CONTRATO             TO E00-R01-S264-CNT     180400      
004941        MOVE A00-R01-CVETRAN(W77-IND)     TO E00-R01-S264-CVEMOV  180500      
004942        MOVE A00-R01-IMPORTE(W77-IND)     TO E00-R01-S264-IMPORTE 180600      
004943        MOVE A00-R01-SUCTRAN              TO E00-R01-S264-SUCTRA  180700      
004944        MOVE A00-R01-CAJATRAN             TO E00-R01-S264-CAJTRA  180800      
004945        MOVE A00-R01-AUTORIZA             TO E00-R01-S264-AUT     180900      
004946        MOVE A01-R01-REF23POS             TO E00-R01-S264-REF     181000      
004947        MOVE A00-R01-FECVAL               TO E00-R01-S264-FECVAL  181600      
004948          MOVE ZEROS TO A2K-FEC-CAMD-001                          181700      
004949          MOVE A00-R01-FECVAL  TO  A2K-FEC-CAMD-001               181800      
004950          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       181900      
004951                  A2K-CONV-CAMD-TO-AMD-EXIT                       182000      
004952          MOVE A2K-FEC-AMD-001  TO  E00-R01-S264-FECVAL           182100      
004953        MOVE A00-R01-REFNUM               TO E00-R01-S264-NUMREF  182300      
004954        MOVE A00-R01-MDA-SUC              TO E00-R01-S264-SUCTAR  182400      
004955        MOVE A00-R01-MDA-CTA              TO E00-R01-S264-NUMTAR  182500      
004956        MOVE A00-R01-PRODUCTO             TO E00-R01-S264-PROD    182600      
004957        MOVE A00-R01-INSTRUMENTO          TO E00-R01-S264-INST    182700      
004958        MOVE A00-R01-MONEDA               TO E00-R01-S264-MONE    182800      
004959        MOVE A00-R01-ORIGEN               TO E00-R01-S264-ORIG    182900      
004960        MOVE A00-R01-AUTORIZA             TO E00-R01-S264-AUT-8DIG182920      
004961        PERFORM 212-VALIDA-DOCUMENTO                              182922      
004962        IF A00-R01-TIPO-PROC < 11                                 183000      
004963           IF (A00-R01-SIST-ORIG = 999                    AND     183020      
004964               A00-R01-CVETRAN (W77-IND) = 1139           AND     183030      
004965               W77-SISTEMA-PARAMETRO = 500)               OR      183040      
004966              (A00-R01-SIST-ORIG = 15                     AND     183041      
004967              (A00-R01-SUCOPER   = 0432 OR 0859 OR 0870 OR        183042      
004968                                   2132 OR 2864 OR 4893)  AND     183043      
004969               A00-R01-CVETRAN (W77-IND) = 2229           AND     183044      
004970              (A00-R01-NUM-ORD-PAGO-1 = 4840 OR 4850)     AND     183045      
004971               W77-SISTEMA-PARAMETRO = 500)               OR      183046      
004972              (A00-R01-SIST-ORIG = 264                    AND     183047      
004973              (A00-R01-SUCOPER   = 0432 OR 0859 OR 0870 OR        183048      
004974                                   2132 OR 2864 OR 4893)  AND     183049      
004975               A00-R01-CVETRAN (W77-IND) = 1139           AND     183050      
004976              (A00-R01-NUM-ORD-PAGO-1 = 4840 OR 4850)     AND     183051      
004977               W77-SISTEMA-PARAMETRO = 500)                       183056      
004978              PERFORM 215-SUMA-SALDOS-S999                        183060      
004979              PERFORM 510-ESCRIBE-999                             183080      
004980           ELSE                                                   183100      
004981              PERFORM 215-SUMA-SALDOS-S264                        183200      
004982              PERFORM 510-ESCRIBE-264.                            183300      
004983                                                                  183400      
004984     IF  (A00-R01-SIST-ORIG = 36 OR 274) AND                      183500      
004985          A00-R01-SUC-INIC = 342                                  183600      
004986          MOVE A00-R01-SUCPROM           TO E00-R01-S036-SUCPRO   184100      
004987          MOVE A00-R01-CONTRATO          TO E00-R01-S036-CNT      184200      
004988          MOVE A00-R01-CVETRAN(W77-IND)  TO E00-R01-S036-CVEMOV   184300      
004989          MOVE A00-R01-IMPORTE(W77-IND)  TO E00-R01-S036-IMPORTE  184400      
004990          MOVE A00-R01-SUC-INIC          TO E00-R01-S036-SUCTRA   184500      
004991          MOVE A00-R01-CAJA-INIC         TO E00-R01-S036-CAJTRA   184600      
004992          MOVE A00-R01-AUTORIZA          TO E00-R01-S036-AUT      184700      
004993          MOVE A01-R01-REF23POS          TO E00-R01-S036-REF23DIG 184800      
004994          MOVE A00-R01-FECVAL            TO E00-R01-S036-FECVAL   185400      
004995          MOVE ZEROS TO A2K-FEC-CAMD-001                          185500      
004996          MOVE A00-R01-FECVAL  TO  A2K-FEC-CAMD-001               185600      
004997          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       185700      
004998                  A2K-CONV-CAMD-TO-AMD-EXIT                       185800      
004999          MOVE A2K-FEC-AMD-001  TO  E00-R01-S036-FECVAL           185900      
005000          MOVE A00-R01-REFNUM            TO E00-R01-S036-NUMREF   186100      
005001          MOVE A00-R01-MDA-SUC           TO E00-R01-S036-SUCTAR   186200      
005002          MOVE A00-R01-MDA-CTA           TO E00-R01-S036-NUMTAR   186300      
005003          MOVE A00-R01-PRODUCTO          TO E00-R01-S036-PROD     186400      
005004          MOVE A00-R01-INSTRUMENTO       TO E00-R01-S036-INST     186500      
005005          MOVE A00-R01-MONEDA            TO E00-R01-S036-MONE     186600      
005006          MOVE A00-R01-ORIGEN            TO E00-R01-S036-ORIG     186700      
005007          MOVE A00-R01-FECMOV            TO E00-R01-S036-FECMOV   186900      
005008          MOVE A00-R01-HORMOV            TO E00-R01-S036-HORMOV   187000      
005009          IF A00-R01-TIPO-PROC < 11                               187100      
005010             PERFORM 215-SUMA-SALDOS-S036                         187300      
005011             PERFORM 515-ESCRIBE-036.                             187400      
005012*** INI EAS 2023R03                                               187402      
005013     IF W77-SISTEMA-PARAMETRO = 500                               187404      
005014        IF A00-R01-SIST-ORIG = 1004   AND                         187406      
005015           ( W77-AFC = 1 OR 2 )                                   187408      
005016          MOVE A00-R01-SUCPROM          TO E00-R01-EAS-SUCPRO     187414      
005017          MOVE A00-R01-CONTRATO         TO E00-R01-EAS-CNT        187416      
005018          MOVE A00-R01-CVETRAN(W77-IND) TO E00-R01-EAS-CVEMOV     187418      
005019          MOVE A00-R01-IMPORTE(W77-IND) TO E00-R01-EAS-IMPORTE    187420      
005020          MOVE A00-R01-SUC-INIC         TO E00-R01-EAS-SUCTRA     187422      
005021          MOVE A00-R01-CAJA-INIC        TO E00-R01-EAS-CAJTRA     187424      
005022          MOVE A00-R01-AUTORIZA         TO E00-R01-EAS-AUT        187426      
005023          MOVE A01-R01-REF23POS         TO E00-R01-EAS-REF        187428      
005024          MOVE ZEROS TO A2K-FEC-CAMD-001                          187430      
005025          MOVE A00-R01-FECVAL  TO  A2K-FEC-CAMD-001               187432      
005026          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       187434      
005027                  A2K-CONV-CAMD-TO-AMD-EXIT                       187436      
005028          MOVE A2K-FEC-AMD-001          TO E00-R01-EAS-FECVAL     187438      
005029          MOVE A00-R01-REFNUM           TO E00-R01-EAS-NUMREF     187440      
005030          MOVE A00-R01-MDA-SUC          TO E00-R01-EAS-SUCTAR     187442      
005031          MOVE A00-R01-MDA-CTA          TO E00-R01-EAS-NUMTAR     187444      
005032          MOVE A00-R01-PRODUCTO         TO E00-R01-EAS-PROD       187446      
005033          MOVE A00-R01-INSTRUMENTO      TO E00-R01-EAS-INST       187448      
005034          MOVE A00-R01-MONEDA           TO E00-R01-EAS-MONE       187450      
005035          MOVE A00-R01-ORIGEN           TO E00-R01-EAS-ORIG       187452      
005036          IF A00-R01-TIPO-PROC < 11                               187454      
005037             PERFORM 215-SUMA-SALDOS-EAS                          187456      
005038             PERFORM 530-ESCRIBE-EAS.                             187458      
005039*** FIN EAS 2023R03                                               187460      
005040                                                                  187500      
005041     IF W77-SISTEMA-PARAMETRO = 500                               187600      
005042        IF ( A00-R01-SIST-ORIG = 54  AND ( W77-AFC = 1 OR 2 ) AND 187700      
005043             A00-R01-SUC-INIC = 342  AND                          187800      
005044           ( A00-R01-CAJA-INIC = 67 OR 68 OR 64 OR 65 ))      OR  187900      
005045*         (A00-R01-CAJA-INIC=67 OR 68 OR 64 OR 65 OR 60 OR 61)) OR187905      
005046           ( A00-R01-SIST-ORIG = 54  AND ( W77-AFC = 1 OR 2 ) AND 187910      
005047             A00-R01-SUC-INIC = 7532 AND                          187920      
005048             A00-R01-CAJA-INIC = 50  AND                          187930      
005049           ( A00-R01-CVETRAN(W77-IND ) = 1151 OR 2268 ))          187940      
005050           MOVE A00-R01-SUCPROM          TO E00-R01-S054-SUCPRO   188000      
005051           MOVE A00-R01-CONTRATO         TO E00-R01-S054-CNT      188100      
005052           MOVE A00-R01-CVETRAN(W77-IND) TO E00-R01-S054-CVEMOV   188200      
005053           MOVE A00-R01-IMPORTE(W77-IND) TO E00-R01-S054-IMPORTE  188300      
005054           MOVE A00-R01-SUC-INIC         TO E00-R01-S054-SUCTRA   188400      
005055           MOVE A00-R01-CAJA-INIC        TO E00-R01-S054-CAJTRA   188500      
005056           MOVE A00-R01-AUTORIZA         TO E00-R01-S054-AUT      188600      
005057           MOVE A01-R01-REF23POS         TO E00-R01-S054-REF      188700      
005058           MOVE ZEROS TO A2K-FEC-CAMD-001                         188800      
005059           MOVE A00-R01-FECVAL  TO  A2K-FEC-CAMD-001              188900      
005060           PERFORM A2K-CONV-CAMD-TO-AMD THRU                      189000      
005061                   A2K-CONV-CAMD-TO-AMD-EXIT                      189100      
005062           MOVE A2K-FEC-AMD-001          TO E00-R01-S054-FECVAL   189200      
005063           MOVE A00-R01-REFNUM           TO E00-R01-S054-NUMREF   189300      
005064           MOVE A00-R01-MDA-SUC          TO E00-R01-S054-SUCTAR   189400      
005065           MOVE A00-R01-MDA-CTA          TO E00-R01-S054-NUMTAR   189500      
005066           MOVE A00-R01-PRODUCTO         TO E00-R01-S054-PROD     189600      
005067           MOVE A00-R01-INSTRUMENTO      TO E00-R01-S054-INST     189700      
005068           MOVE A00-R01-MONEDA           TO E00-R01-S054-MONE     189800      
005069           MOVE A00-R01-ORIGEN           TO E00-R01-S054-ORIG     189900      
005070           IF A00-R01-TIPO-PROC < 11                              190000      
005071              PERFORM 215-SUMA-SALDOS-S054                        190001      
005072              PERFORM 520-ESCRIBE-054.                            190002      
005073                                                                  190003      
005074     IF   A00-R01-ORIGEN  = 1                                AND  190005      
005075        ((A00-R01-CVEMDA  = 2  AND WKS-MDA-BIN     = 557874) OR   190006      
005076          BIN-MOVIL)                                              190007      
005077          PERFORM 210-MUEVE-DATOS-MUNDIAL.                        190008      
005078                                                                  190009      
005079 210-MUEVE-DATOS-MUNDIAL.                                         190012      
005080*========================                                         190013      
005081     MOVE A01-R01-REFERENCIA1            TO WKS-DAT-ORIGEN-REF1.  190014      
005082     IF  W77-SISTEMA-PARAMETRO = 500              AND             190015      
005083        (WKS-NUMCSI      = 10 OR WKS-NUMCSI = 32) AND             190016      
005084         WKS-ORIGEN-MDE  = 6                                      190017      
005085           MOVE A00-R01-SUCPROM          TO E15-R01-S253-SUCPRO   190022      
005086           PERFORM 211-VALIDA-CONTRATO-CTASMOVIL                  190024      
005087           MOVE A00-R01-CVETRAN(W77-IND) TO E15-R01-S253-CVEMOV   190026      
005088           MOVE A00-R01-IMPORTE(W77-IND) TO E15-R01-S253-IMPORTE  190028      
005089           MOVE A00-R01-SUC-INIC         TO E15-R01-S253-SUCTRA   190030      
005090           MOVE A00-R01-CAJA-INIC        TO E15-R01-S253-CAJTRA   190032      
005091           MOVE A00-R01-AUTORIZA         TO E15-R01-S253-AUT      190034      
005092           MOVE A01-R01-REF23POS         TO E15-R01-S253-REF      190036      
005093           MOVE A00-R01-FECVAL           TO E15-R01-S253-FECVAL   190038      
005094           MOVE ZEROS                    TO A2K-FEC-CAMD-001      190040      
005095           MOVE A00-R01-FECVAL           TO A2K-FEC-CAMD-001      190042      
005096           PERFORM A2K-CONV-CAMD-TO-AMD  THRU                     190044      
005097                   A2K-CONV-CAMD-TO-AMD-EXIT                      190046      
005098           MOVE A2K-FEC-AMD-001          TO E15-R01-S253-FECVAL   190048      
005099           MOVE A00-R01-REFNUM           TO E15-R01-S253-NUMREF   190050      
005100           MOVE A00-R01-MDA-SUC          TO E15-R01-S253-SUCTAR   190052      
005101           MOVE A00-R01-MDA-CTA          TO E15-R01-S253-NUMTAR   190054      
005102           MOVE A00-R01-PRODUCTO         TO E15-R01-S253-PROD     190056      
005103           MOVE A00-R01-INSTRUMENTO      TO E15-R01-S253-INST     190058      
005104           MOVE A00-R01-MONEDA           TO E15-R01-S253-MONE     190060      
005105           MOVE A00-R01-ORIGEN           TO E15-R01-S253-ORIG     190062      
005106           MOVE A00-R01-FECMOV           TO E15-R01-S253-FECTRAN  190064      
005107           MOVE A00-R01-HORMOV           TO E15-R01-S253-HRATRAN  190066      
005108           MOVE A00-R01-FECCONT          TO E15-R01-S253-FECCONT  190068      
005109           MOVE SPACES                   TO E15-R01-S253-FILLER   190069      
005110           IF A00-R01-TIPO-PROC < 11                              190070      
005111              PERFORM 215-SUMA-SALDOS-CTASMOVIL                   190100      
005112              PERFORM 500-ESCRIBE-253-CTASMOVIL.                  190200      
005113                                                                  190205      
005114 212-VALIDA-DOCUMENTO.                                            190210      
005115*====================                                             190215      
005116     IF  A00-R01-NUM-ORD-PAGO = 0 AND A00-R01-APUDES > 0 AND      190220      
005117        (A00-R01-CVETRAN (W77-IND) = 1139 OR 2229)                190222      
005118        MOVE A01-R01-LEY1         TO WKS-LEYENDA1                 190225      
005119        MOVE WKS-NUM-DOCTO        TO E00-R01-S264-NUM-ORD-PAGO    190230      
005120     ELSE                                                         190235      
005121        MOVE A00-R01-NUM-ORD-PAGO TO E00-R01-S264-NUM-ORD-PAGO.   190240      
005122                                                                  190245      
005123                                                                  190250      
005124 211-VALIDA-CONTRATO.                                             190254      
005125*====================                                             190256      
005126                                                                  190257      
005127     IF A00-R01-REF-ORIG > 0                                      190259      
005128        MOVE A00-R01-REF-ORIG       TO E00-R01-S253-CNT           190261      
005129     ELSE                                                         190263      
005130        MOVE A00-R01-CONTRATO       TO E00-R01-S253-CNT.          190265      
005131                                                                  190267      
005132 211-VALIDA-CONTRATO-CTASMOVIL.                                   190269      
005133*==============================                                   190270      
005134                                                                  190271      
005135     IF A00-R01-REF-ORIG > 0                                      190272      
005136        MOVE A00-R01-REF-ORIG       TO E15-R01-S253-CNT           190274      
005137     ELSE                                                         190276      
005138        MOVE A00-R01-CONTRATO       TO E15-R01-S253-CNT.          190278      
005139*                                                                 190300      
005140 211-FACTORAJE-403.                                               190302      
005141*==================                                               190304      
005142     MOVE 403                           TO WS-CTL-SISTEMA         190308      
005143     MOVE 01                            TO WS-CTL-FUNCION.        190310      
005144     CALL "CONSISDIA IN S151LIBCONTROL" USING  WS-151-DATOS       190312      
005145                                        GIVING WKS-151-RESULT.    190314      
005146     IF WKS-151-RESULT > 0                                        190316      
005147        MOVE SPACES                     TO WLI-ENCAB-52           190318      
005148        STRING "ERROR AL CONSULTAR S151L001 PARA OBTENER ",       190320      
005149               " NOMBRE DE ARCHIVO S403, ERROR  : " ,             190322      
005150           WS-ERROR(WKS-151-RESULT)                               190324      
005151           DELIMITED BY SIZE INTO TEXTO-LJ                        190326      
005152        MOVE "O"                        TO TIPO-LJ                190328      
005153        MOVE 020901                     TO CODIGO-LJ              190330      
005154        CALL "LJ IN LIB-DISP"           USING CONTADOR-LJ,        190332      
005155                                              MENSAJE-LJ          190334      
005156        SET MYSELF(STATUS)              TO -1                     190336      
005157     ELSE                                                         190338      
005158        MOVE WS-CTL-NOMMOV              TO WKS-NOM-LOG            190340      
005159        MOVE WS-CTL-PKMOV               TO WKS-PACK-LOG           190342      
005160        CHANGE ATTRIBUTE TITLE          OF L01-DATOS-403          190344      
005161                                        TO WKS-TIT-LOG151         190346      
005162        OPEN INPUT L01-DATOS-403.                                 190348      
005163                                                                  190350      
005164     MOVE ZERO                          TO W77-FIN-PROCESO .      190352      
005165     READ L01-DATOS-403                 INTO A00-R00-HDR-MOV.     190354      
005166     PERFORM 211-LEE-ARCHS403                              .      190356      
005167     PERFORM 211-SELECIONA-REG UNTIL W88-FIN-PROCESO       .      190358      
005168     CLOSE  E04-FACTORAJE      WITH SAVE                   .      190360      
005169     CLOSE  L01-DATOS-403      WITH RELEASE                .      190362      
005170 211-SELECIONA-REG.                                               190364      
005171*=====================                                            190366      
005172***MPM  INICIO  MUEVE DATOS S440  ******************************* 190368      
005173     IF  A00-R01-FUNCION   = 1           AND                      190370      
005174        (A00-R01-ORIGEN    = 1 OR 3 )    AND                      190372      
005175         A00-R01-STATUS    = 1           AND                      190374      
005176         W77-SIS-FECPRO    = A00-R01-FECMOV                       190375      
005177         IF (A00-R01-SUC-INIC = 519 AND A00-R01-CAJA-INIC = 62) OR190376      
005178            (A00-R01-SUC-INIC = 870 AND A00-R01-CAJA-INIC = 62) OR190378      
005179            (A00-R01-SUC-INIC = 869 )                             190380      
005180            PERFORM 212-MUEVE-DATOS-440.                          190382      
005181                                                                  190384      
005182    PERFORM 211-LEE-ARCHS403.                                     190386      
005183                                                                  190388      
005184 211-LEE-ARCHS403.                                                190390      
005185*====================                                             190391      
005186    READ L01-DATOS-403     INTO A00-R01-REGMOV                    190392      
005187         AT END MOVE 1     TO   W77-FIN-PROCESO.                  190393      
005188    IF A00-R01-FUNCION = 99                                       190394      
005189       MOVE 1    TO W77-FIN-PROCESO.                              190395      
005190                                                                  190400      
005191 212-VALIDA-DATOS-S440.                                           190404      
005192*===================                                              190406      
005193     IF (A00-R01-SISTEMA  = 403 OR 500) AND                       190408      
005194        (A00-R01-ORIGEN   = 1 OR 3 )                              190409      
005195        IF (A00-R01-SUC-INIC = 519 AND A00-R01-CAJA-INIC = 62) OR 190410      
005196           (A00-R01-SUC-INIC = 870 AND A00-R01-CAJA-INIC = 62) OR 190412      
005197           (A00-R01-SUC-INIC = 869 )                              190414      
005198           PERFORM 212-MUEVE-DATOS-440.                           190416      
005199                                                                  190418      
005200 212-MUEVE-DATOS-440.                                             190422      
005201*======================                                           190424      
005202       MOVE A00-R01-NODO-ORIG          TO A00-440-CSI-ORIGEN .    190426      
005203       MOVE A00-R01-SUC-INIC           TO A00-440-SUCOPER    .    190428      
005204       MOVE A00-R01-CAJA-INIC          TO A00-440-CAJAOPER   .    190430      
005205       MOVE A00-R01-PROD-ORIG          TO A00-440-PRODUCTO   .    190432      
005206       MOVE A00-R01-INSTRUMENTO        TO A00-440-INSTRUMENTO.    190434      
005207       MOVE A00-R01-FONDO              TO A00-440-FONDO      .    190436      
005208       MOVE A00-R01-AUTORIZA           TO A00-440-AUTORIZA   .    190438      
005209       MOVE A00-R01-SCVECON-S403       TO A00-440-CONCEPTO   .    190440      
005210       MOVE A00-R01-MONEDA             TO A00-440-MONEDA     .    190442      
005211       MOVE A00-R01-REF-ORIG           TO A00-440-REFERENCIA .    190444      
005212       MOVE A00-R01-TIPO-PROC          TO A00-440-TIPO-PROC  .    190448      
005213       MOVE A00-R01-MDA-SUC            TO A00-440-MDA-SUC    .    190450      
005214       MOVE A00-R01-MDA-CTA            TO A00-440-MDA-CTA    .    190452      
005215       MOVE A00-R01-HORMOV             TO A00-440-HORMOV     .    190454      
005216       MOVE A00-R01-FECMOV             TO A00-440-FECMOV     .    190456      
005217       MOVE A00-R01-ORIGEN             TO A00-440-ORIGEN     .    190458      
005218       MOVE A00-R01-SISTEMA            TO A00-440-SISTEMA    .    190460      
005219       MOVE A00-R01-CONTRATO           TO A00-440-CONTRATO   .    190466      
005220       IF A00-R01-SISTEMA = 403                                   190468      
005221          MOVE A00-R01-FOLIO-S403      TO A00-440-FOLIO-S403      190470      
005222          MOVE A00-R01-TASAREF         TO A00-440-TASAREF         190472      
005223        ELSE                                                      190474      
005224           MOVE ZERO                   TO A00-440-FOLIO-S403      190476      
005225                                          A00-440-TASAREF    .    190478      
005226       MOVE SPACES                     TO A00-440-ESPACIO    .    190480      
005227       PERFORM 212-MUEVE-IMPORTE-S440                             190482      
005228               VARYING W77-IND FROM 1 BY 1                        190484      
005229               UNTIL   W77-IND > 5    OR                          190486      
005230                       A00-R01-CVETRAN(W77-IND) = 0.              190488      
005231 212-MUEVE-IMPORTE-S440.                                          190495      
005232*=======================                                          190496      
005233       MOVE A00-R01-IMPORTE(W77-IND)   TO A00-440-IMPORTE    .    190497      
005234       MOVE A00-R01-CVETRAN(W77-IND)   TO A00-440-CVETRAN    .    190498      
005235       WRITE E04-REG-CONCILIA.                                    190499      
005236 212-VALIDA-DATOS.                                                190500      
005237*-----------------                                                190600      
005238     MOVE ZEROS TO W77-GENER, W77-AFC.                            190700      
005239     IF A00-R01-CVETRAN(W77-IND) > 0 AND A00-R01-CVETRAN(W77-IND) 190800      
005240                                   < 5001                         190900      
005241        MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND))  TO W77-AFC    191000      
005242        IF (W77-AFC = 1 OR 2) AND (A00-R01-TIPO-PROC < 11)        191100      
005243           PERFORM 213-MUEVE-DATOS-S030                           191200      
005244        ELSE                                                      191300      
005245          IF A00-R01-CVETRAN(W77-IND) = 1009 AND                  191400      
005246                                     (A00-R01-TIPO-PROC < 11)     191500      
005247             MOVE 2     TO      W77-AFC                           191600      
005248             PERFORM 213-MUEVE-DATOS-S030.                        191700      
005249                                                                  191800      
005250 213-MUEVE-DATOS-S030.                                            191900      
005251*---------------------                                            192000      
005252     IF (WKS-NUMCSI = 04 OR 35) AND A00-R01-ORIGEN = 2            192100      
005253        MOVE 04           TO      E00-R01-S030-CSIORI             192200      
005254        MOVE 04           TO      E00-R01-S030-NODORI             192300      
005255        MOVE 10           TO      E00-R01-S030-CSIDES             192400      
005256     ELSE                                                         192500      
005257     IF (WKS-NUMCSI = 04 OR 35) AND A00-R01-ORIGEN = 3            192600      
005258        MOVE 10           TO      E00-R01-S030-CSIORI             192700      
005259        MOVE 10           TO      E00-R01-S030-NODORI             192800      
005260        MOVE 04           TO      E00-R01-S030-CSIDES             192900      
005261     ELSE                                                         193000      
005262     IF (WKS-NUMCSI = 10 OR 33) AND A00-R01-ORIGEN = 2            193100      
005263        MOVE 10           TO      E00-R01-S030-CSIORI             193200      
005264        MOVE 10           TO      E00-R01-S030-NODORI             193300      
005265        MOVE 04           TO      E00-R01-S030-CSIDES             193400      
005266     ELSE                                                         193500      
005267     IF (WKS-NUMCSI = 10 OR 33) AND A00-R01-ORIGEN = 3            193600      
005268        MOVE 04           TO      E00-R01-S030-CSIORI             193700      
005269        MOVE 04           TO      E00-R01-S030-NODORI             193800      
005270        MOVE 10           TO      E00-R01-S030-CSIDES.            193900      
005271     MOVE SPACES          TO      E00-R01-S030-TIP-DIS            194000      
005272     MOVE A00-R01-SUC-INIC  TO    E00-R01-S030-SUCORI             194100      
005273     MOVE A00-R01-CAJA-INIC TO    WKS-NUM-CAJA                    194200      
005274     MOVE WKS-CAJA-PASO   TO      E00-R01-S030-CAJORI             194300      
005275     MOVE A00-R01-FECMOV  TO      E00-R01-S030-FECGEN             194600      
005276     MOVE ZEROS TO A2K-FEC-CAMD-001                               194700      
005277     MOVE A00-R01-FECMOV  TO  A2K-FEC-CAMD-001                    194800      
005278     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            194900      
005279             A2K-CONV-CAMD-TO-AMD-EXIT                            195000      
005280     MOVE A2K-FEC-AMD-001  TO  E00-R01-S030-FECGEN                195100      
005281     MOVE A00-R01-HORMOV  TO      E00-R01-S030-HORGEN             195300      
005282     MOVE W77-SISTEMA-PARAMETRO TO E00-R01-S030-APLDES            195400      
005283     IF A00-R01-ORIGEN = 2                                        195500      
005284        MOVE 3            TO      E00-R01-S030-STATRN             195600      
005285     ELSE                                                         195700      
005286        IF A00-R01-ORIGEN = 3                                     195800      
005287           MOVE 2         TO      E00-R01-S030-STATRN.            195900      
005288     IF W77-AFC = 1                                               196000      
005289        MOVE 10           TO      E00-R01-S030-CODSER             196100      
005290     ELSE                                                         196200      
005291        IF W77-AFC = 2                                            196300      
005292           MOVE 20        TO      E00-R01-S030-CODSER.            196400      
005293     MOVE ZEROS           TO      E00-R01-S030-SUBSER             196500      
005294     MOVE A00-R01-IMPORTE(W77-IND) TO E00-R01-S030-IMPTRN         196700      
005295     MOVE A00-R01-MONEDA  TO      E00-R01-S030-MONTRN             196800      
005296     MOVE A00-R01-FECCONT TO      E00-R01-S030-FECCON             197100      
005297          MOVE ZEROS TO A2K-FEC-CAMD-001                          197200      
005298          MOVE A00-R01-FECCONT TO  A2K-FEC-CAMD-001               197300      
005299          PERFORM A2K-CONV-CAMD-TO-AMD THRU                       197400      
005300                  A2K-CONV-CAMD-TO-AMD-EXIT                       197500      
005301          MOVE A2K-FEC-AMD-001  TO  E00-R01-S030-FECCON           197600      
005302     MOVE A00-R01-AUTORIZA TO     WKS-NUM-AUTORIZA                197800      
005303     MOVE WKS-AUTORIZA-S030 TO    E00-R01-S030-CVEAUT             197900      
005304     ADD  1               TO      W77-C1                          198000      
005305     MOVE W77-C1          TO      E00-R01-S030-NUMTRN             198100      
005306     MOVE A00-R01-NUMMDA  TO      WKS-NUM-MDACCESO                198200      
005307     MOVE WKS-NUM-MDACC-PASO TO   E00-R01-S030-CTAACC             198300      
005308                                  WKS-CUENTA-PASO                 198400      
005309     MOVE WKS-SUC-P       TO      WKS-SUC-A                       198500      
005310     MOVE WKS-CTO-P       TO      WKS-CTO-A                       198600      
005311     MOVE WKS-CUENTA-ALFA TO      WKS-CUENTA-FIN                  198700      
005312     MOVE WKS-CUENTA-FIN  TO      E00-R01-S030-CTADES             198800      
005313     MOVE A00-R01-REFNUM  TO      WKS-NUM-REFERENCIA              198900      
005314     MOVE WKS-NUM-REF-PASO TO     E00-R01-S030-REFOPE             199000      
005315     MOVE W77-SISTEMA-PARAMETRO TO   E00-R01-S030-APLORI.         199400      
005316                                                                  199500      
005317     PERFORM 1000-GRABA-LISTC.                                    199700      
005318                                                                  199800      
005319 215-SUMA-SALDOS-S253.                                            199900      
005320*---------------------                                            200000      
005321     IF A00-R01-CVEMDA = 1                                        200100      
005322           IF A00-R01-CVETRAN(W77-IND) = 2020 OR 2100 OR 2388     200200      
005323              COMPUTE W77-IM-253-C-C = W77-IM-253-C-C +           200300      
005324                                       A00-R01-IMPORTE(W77-IND)   200400      
005325           ELSE                                                   200500      
005326              IF A00-R01-CVETRAN(W77-IND) = 1001 OR 1004 OR 1021  200600      
005327                                         OR 1193 OR 1197          200620      
005328                 COMPUTE W77-IM-253-C-A = W77-IM-253-C-A +        200700      
005329                                       A00-R01-IMPORTE(W77-IND)   200800      
005330              ELSE                                                200900      
005331                 NEXT SENTENCE                                    201000      
005332        ELSE                                                      201100      
005333           IF A00-R01-CVETRAN(W77-IND) = 2020 OR 2100 OR 2109 OR  201200      
005334                                         2111 OR 2388             201300      
005335              COMPUTE W77-IM-253-M-C = W77-IM-253-M-C +           201400      
005336                                       A00-R01-IMPORTE(W77-IND)   201500      
005337           ELSE                                                   201600      
005338              IF A00-R01-CVETRAN(W77-IND) = 1001 OR 1004 OR 1021  201700      
005339                                         OR 1070 OR 1193 OR 1197  201750      
005340                 COMPUTE W77-IM-253-M-A = W77-IM-253-M-A +        201800      
005341                                      A00-R01-IMPORTE(W77-IND) .  201900      
005342                                                                  202000      
005343 215-SUMA-SALDOS-S264.                                            202100      
005344*---------------------                                            202200      
005345     IF A00-R01-SIST-ORIG = 264                                   202300      
005346        IF W77-AFC = 1                                            202400      
005347           COMPUTE W77-IM-264-M-C = W77-IM-264-M-C +              202500      
005348                                    A00-R01-IMPORTE(W77-IND)      202600      
005349        ELSE                                                      202700      
005350           IF W77-AFC = 2                                         202800      
005351              COMPUTE W77-IM-264-M-A = W77-IM-264-M-A +           202900      
005352                                       A00-R01-IMPORTE(W77-IND).  203000      
005353                                                                  203005      
005354 215-SUMA-SALDOS-S999.                                            203010      
005355*---------------------                                            203015      
005356     IF W77-AFC = 1                                               203025      
005357        COMPUTE W77-IM-264-M-C-MCH = W77-IM-264-M-C-MCH +         203030      
005358                                     A00-R01-IMPORTE(W77-IND)     203035      
005359     ELSE                                                         203040      
005360        IF W77-AFC = 2                                            203045      
005361           COMPUTE W77-IM-264-M-A-MCH = W77-IM-264-M-A-MCH +      203050      
005362                                      A00-R01-IMPORTE(W77-IND).   203055      
005363                                                                  203060      
005364 215-SUMA-SALDOS-PBCOS.                                           203100      
005365*---------------------                                            203200      
005366**   IF WKS-NUMCSI   = 04                                         203300      
005367        COMPUTE  W77-NR-BCOS-0410 = W77-NR-BCOS-0410 + 1          203400      
005368        IF W77-AFC-PBCOS = 1                                      203500      
005369           COMPUTE W77-IM-BCOS-0410C = W77-IM-BCOS-0410C +        203600      
005370                                    A00-R01-IMPORTE(W77-IND)      203700      
005371           COMPUTE W77-NR-BCOS-0410C = W77-NR-BCOS-0410C + 1      203800      
005372        ELSE                                                      203900      
005373           IF W77-AFC-PBCOS = 2                                   204000      
005374              COMPUTE W77-IM-BCOS-0410A = W77-IM-BCOS-0410A +     204100      
005375                                    A00-R01-IMPORTE(W77-IND)      204200      
005376              COMPUTE W77-NR-BCOS-0410A = W77-NR-BCOS-0410A + 1.  204300      
005377                                                                  204400      
005378 215-SUMA-SALDOS-S036.                                            204500      
005379*---------------------                                            204600      
005380                                                                  204700      
005381     IF (A00-R01-CVETRAN(W77-IND) > 1999 AND < 3000)              204800      
005382        COMPUTE W77-IM-036-C-C = W77-IM-036-C-C +                 204900      
005383                                 A00-R01-IMPORTE(W77-IND).        205000      
005384     IF (A00-R01-CVETRAN(W77-IND) >  999 AND < 2000)              205100      
005385        COMPUTE W77-IM-036-C-A = W77-IM-036-C-A +                 205200      
005386                                 A00-R01-IMPORTE(W77-IND).        205300      
005387                                                                  205400      
005388                                                                  205500      
005389 215-SUMA-SALDOS-S054.                                            205600      
005390*---------------------                                            205700      
005391                                                                  205800      
005392     IF A00-R01-SIST-ORIG = 54                                    205900      
005393        IF W77-AFC = 1                                            206000      
005394           COMPUTE W77-IM-054-M-C = W77-IM-054-M-C +              206100      
005395                                    A00-R01-IMPORTE(W77-IND)      206200      
005396        ELSE                                                      206300      
005397           IF W77-AFC = 2                                         206400      
005398              COMPUTE W77-IM-054-M-A = W77-IM-054-M-A +           206500      
005399                                    A00-R01-IMPORTE(W77-IND).     206600      
005400*                                                                 206610      
005401*** INI EAS 2023R03                                               206611      
005402 215-SUMA-SALDOS-EAS.                                             206612      
005403*---------------------                                            206613      
005404   IF A00-R01-SIST-ORIG = 1004                                    206614      
005405      IF W77-AFC = 1                                              206615      
005406         COMPUTE W77-IM-EAS-M-C = W77-IM-EAS-M-C +                206616      
005407                                  A00-R01-IMPORTE(W77-IND)        206617      
005408      ELSE                                                        206618      
005409         IF W77-AFC = 2                                           206619      
005410            COMPUTE W77-IM-EAS-M-A = W77-IM-EAS-M-A +             206620      
005411                                     A00-R01-IMPORTE(W77-IND).    206621      
005412*** FIN EAS 2023R03                                               206622      
005413 215-SUMA-SALDOS-CTASMOVIL.                                       206630      
005414*------------------------                                         206640      
005415                                                                  206642      
005416     IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 1                 206644      
005417         COMPUTE W77-IM-253-CMOV-C   = W77-IM-253-CMOV-C +        206650      
005418                                       A00-R01-IMPORTE(W77-IND)   206652      
005419     ELSE                                                         206654      
005420         IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 2             206656      
005421           COMPUTE W77-IM-253-CMOV-A = W77-IM-253-CMOV-A +        206660      
005422                                       A00-R01-IMPORTE(W77-IND).  206662      
005423*                                                                 206700      
005424 216-MUEVE-DATOS-PAG.                                             206705      
005425*-----------------                                                206710      
005426                                                                  206715      
005427  MOVE A00-R01-SUCPROM          TO E05-R01-S500-SUCPRO-PAG.       206720      
005428  MOVE A00-R01-CONTRATO         TO E05-R01-S500-CONTRA-PAG.       206725      
005429  MOVE A00-R01-CVETRAN(W77-IND) TO E05-R01-S500-CVETRA-PAG.       206730      
005430  MOVE A00-R01-IMPORTE(W77-IND) TO E05-R01-S500-IMPORT-PAG.       206735      
005431  MOVE A00-R01-SUCTRAN          TO E05-R01-S500-SUCTRA-PAG.       206740      
005432  MOVE A00-R01-CAJATRAN         TO E05-R01-S500-CAJTRA-PAG.       206745      
005433  MOVE A00-R01-AUT-S151         TO E05-R01-S500-AUT151-PAG.       206750      
005434                                                                  206755      
005435  MOVE ZEROS TO A2K-FEC-CAMD-001                                  206760      
005436  MOVE A00-R01-FECCONT  TO  A2K-FEC-CAMD-001                      206765      
005437  PERFORM A2K-CONV-CAMD-TO-AMD THRU                               206770      
005438          A2K-CONV-CAMD-TO-AMD-EXIT                               206775      
005439                                                                  206780      
005440  MOVE A2K-FEC-AMD-001          TO E05-R01-S500-FECVAL-PAG.       206785      
005441  MOVE A00-R01-REFNUM           TO E05-R01-S500-REFNUM-PAG.       206790      
005442  MOVE A00-R01-MDA-SUC          TO E05-R01-S500-SUCMDA-PAG.       206795      
005443  MOVE A00-R01-MDA-CTA          TO E05-R01-S500-CTAMDA-PAG.       206800      
005444  MOVE A00-R01-PRODUCTO         TO E05-R01-S500-PRODUC-PAG.       206805      
005445  MOVE A00-R01-INSTRUMENTO      TO E05-R01-S500-INSTRU-PAG.       206810      
005446  MOVE A00-R01-MONEDA           TO E05-R01-S500-MONEDA-PAG.       206815      
005447  MOVE A00-R01-ORIGEN           TO E05-R01-S500-ORIGEN-PAG.       206820      
005448  MOVE A00-R01-AUTORIZA         TO E05-R01-S500-AUTAPL-PAG.       206825      
005449                                                                  206830      
005450 217-SUMA-SALDOS-PAG.                                             206835      
005451*-----------------                                                206840      
005452  IF W77-AFC = 1                                                  206845      
005453     COMPUTE W77-IM-500-M-C-PAG = W77-IM-500-M-C-PAG +            206850      
005454                          A00-R01-IMPORTE(W77-IND)                206855      
005455  ELSE                                                            206860      
005456  IF W77-AFC = 2                                                  206865      
005457     COMPUTE W77-IM-500-M-A-PAG = W77-IM-500-M-A-PAG +            206870      
005458                          A00-R01-IMPORTE(W77-IND).               206875      
005459                                                                  206880      
005460 220-DATOS-PUNTEO.                                                206885      
005461*-----------------                                                206900      
005462     MOVE 01                      TO      E05-R01-S500-TIPREG     207000      
005463                                      E05-R01-S500-TIPREG-MCH     207050      
005464     MOVE A00-R01-SUCTRAN         TO      E05-R01-S500-SUCTRA     207100      
005465                                      E05-R01-S500-SUCTRA-MCH     207150      
005466     MOVE A00-R01-CAJATRAN        TO      E05-R01-S500-CAJAT      207200      
005467                                      E05-R01-S500-CAJAT-MCH      207250      
005468     MOVE A00-R01-AUTORIZA        TO      E05-R01-S500-AUTAPL     207300      
005469                                      E05-R01-S500-AUTAPL-MCH     207320      
005470                                      E05-R01-S500-AUTAPL-8DIG-MCH207340      
005471     MOVE A00-R01-CONTRATO        TO      E05-R01-S500-CTO        207400      
005472                                      E05-R01-S500-CTO-MCH        207450      
005473     MOVE A00-R01-PRODUCTO        TO      E05-R01-S500-PROD       207500      
005474                                      E05-R01-S500-PROD-MCH       207550      
005475     MOVE A00-R01-INSTRUMENTO     TO      E05-R01-S500-INST       207600      
005476                                      E05-R01-S500-INST-MCH       207650      
005477     MOVE A00-R01-MONEDA          TO      E05-R01-S500-MONE       207700      
005478                                      E05-R01-S500-MONE-MCH       207750      
005479     MOVE A00-R01-CVETRAN(W77-IND) TO     E05-R01-S500-CVE        207800      
005480                                      E05-R01-S500-CVE-MCH        207850      
005481     MOVE A00-R01-IMPORTE(W77-IND) TO     E05-R01-S500-IMP        207900      
005482                                      E05-R01-S500-IMP-MCH        207950      
005483     MOVE A00-R01-ESQCON(W77-IND)  TO     E05-R01-S500-ESQCONTA   208000      
005484                                      E05-R01-S500-ESQCONTA-MCH   208050      
005485     MOVE A00-R01-REFNUM          TO      E05-R01-S500-REFER      208100      
005486                                      E05-R01-S500-REFER-MCH      208150      
005487                                      E05-R01-S500-REFNUM-MCH     208170      
005488     MOVE A00-R01-AUT-S151        TO      E05-R01-S500-AUTS151    208200      
005489                                      E05-R01-S500-AUTS151-MCH    208250      
005490     MOVE A00-R01-FECMOV          TO      E05-R01-S500-FECHA      208300      
005491                                      E05-R01-S500-FECHA-MCH      208400      
005492     MOVE A00-R01-HORMOV          TO      E05-R01-S500-HORA       209600      
005493                                      E05-R01-S500-HORA-MCH       209650      
005494     MOVE A00-R01-ORIGEN          TO      E05-R01-S500-ORIGEN     209700      
005495                                      E05-R01-S500-ORIGEN-MCH     209750      
005496     MOVE A00-R01-TIPO-PROC       TO      E05-TIPO-PROCESO        209800      
005497                                      E05-TIPO-PROCESO-MCH        209850      
005498     IF A00-R01-SIST-ORIG                         > 0             209900      
005499        MOVE A00-R01-SIST-ORIG    TO      E05-R01-S500-SISTORI    210000      
005500                                      E05-R01-S500-SISTORI-MCH    210050      
005501     ELSE                                                         210100      
005502        MOVE W77-SISTEMA-PARAMETRO TO     E05-R01-S500-SISTORI    210200      
005503                                      E05-R01-S500-SISTORI-MCH.   210250      
005504     MOVE A00-R01-BCOS             TO     E05-R01-S500-BCOORIDES  210300      
005505                                      E05-R01-S500-BCOORIDES-MCH  210350      
005506     MOVE A00-R01-CVEMDE           TO     E05-R01-S500-MEDIOENTRE 210400      
005507                                      E05-R01-S500-MEDIOENTRE-MCH 210410      
005508     IF (A00-R01-SIST-ORIG = 999 AND W77-SISTEMA-PARAMETRO = 264) 210420      
005509        OR (A00-R01-SIS-ORIGINAL = "0999  " AND                   210422      
005510            W77-SISTEMA-PARAMETRO = 264)                          210424      
005511        ADD 1 TO W77-NUM-REGS500-MCH                              210430      
005512        ADD A00-R01-IMPORTE(W77-IND) TO   W77-TOT-REGS500-MCH     210440      
005513        WRITE  L07-DAT-MCH FROM E05-R01-S500-REGMOV-MCH           210450      
005514     ELSE                                                         210460      
005515        ADD 1 TO W77-NUM-REGS500                                  210500      
005516        ADD A00-R01-IMPORTE(W77-IND) TO      W77-TOT-REGS500      210600      
005517        WRITE  L07-DAT     FROM E05-R01-S500-REGMOV.              210700      
005518     IF W77-SISTEMA-PARAMETRO = 500 AND                           210720      
005519                                    A00-R01-SIST-ORIG = 707       210740      
005520        ADD 1 TO W77-NUM-REGS707                                  210750      
005521        ADD A00-R01-IMPORTE(W77-IND) TO    W77-TOT-REGS707        210755      
005522        WRITE  L12-DAT FROM E05-R01-S500-REGMOV.                  210760      
005523                                                                  210800      
005524 220-DATOS-PBCOS.                                                 210900      
005525*-----------------                                                211000      
005526  IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 1 AND                211400      
005527     (A00-R01-CVETRAN(W77-IND) NOT = 2129 AND NOT = 1078)         211500      
005528     MOVE A00-R01-BCOS             TO  E00-R01-PBCOS-BCOS         211600      
005529     MOVE "S"                      TO  WKS-SIST-LETRA             211700      
005530     MOVE W77-SISTEMA-PARAMETRO    TO  WKS-SIST-NUM               211800      
005531     MOVE WKS-SIST-ORIGEN          TO  E00-R01-PBCOS-SIS-GENERA   211900      
005532     MOVE "CH"                     TO  E00-R01-PBCOS-TIPOCTA-BMR  212000      
005533     MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND))                   212100      
005534                                   TO  E00-R01-PBCOS-CVE-TRAN     212200      
005535     MOVE A00-R01-MDA-SUC          TO  E00-R01-PBCOS-SUCURSAL-BMR 212300      
005536     MOVE SPACES                   TO  E00-R01-PBCOS-TERM-FIL     212400      
005537     MOVE A00-R01-MDA-CTA          TO  E00-R01-PBCOS-CUENTA-BMR   212500      
005538     MOVE A00-R01-STATUS           TO  E00-R01-PBCOS-CVE-CARABO   212600      
005539     MOVE A00-R01-IMPORTE(W77-IND) TO  E00-R01-PBCOS-IMPORTE      212700      
005540     MOVE A00-R01-REFNUM           TO  E00-R01-PBCOS-REF-CHEQUE   212800      
005541     MOVE A00-R01-NOMINA-OPE       TO  E00-R01-PBCOS-USUA-OPE     212900      
005542     MOVE A00-R01-HORMOV           TO  E00-R01-PBCOS-HORA-OPE     213000      
005543     MOVE A00-R01-FECMOV           TO  E00-R01-PBCOS-FECH-OPE     213100      
005544     PERFORM 225-INF-ADIC-BCOS                                    213200      
005545     ADD 1 TO W77-NUM-REG-PBCOS                                   213300      
005546     PERFORM 215-SUMA-SALDOS-PBCOS                                213400      
005547     WRITE A01-R01-PBCOS-0410    FROM E00-R01-PBCOS-REGMOV.       213500      
005548                                                                  213600      
005549 225-INF-ADIC-BCOS.                                               213700      
005550*------------------                                               213800      
005551  IF A00-R01-MONEDA = 5    MOVE 02 TO  E00-R01-PBCOS-MONEDA-BMR   213900      
005552  ELSE         MOVE A00-R01-MONEDA TO  E00-R01-PBCOS-MONEDA-BMR.  214000      
005553  IF A00-R01-BCO-ORI NOT = 2                                      214100      
005554     MOVE ZEROS                   TO  E00-R01-PBCOS-PLAZA-BMR     214200      
005555     MOVE ZEROS                    TO  E00-R01-PBCOS-SUC-OPE      214300      
005556     MOVE ZEROS                    TO  E00-R01-PBCOS-TERM-OPE     214400      
005557     MOVE ZEROS                    TO  E00-R01-PBCOS-CVE-AUT      214500      
005558     MOVE A00-R01-VERIF-FIRMA      TO  E00-R01-PBCOS-VERIF-FIRMA  214600      
005559     MOVE "SAFE"                   TO  E00-R01-PBCOS-SIS-GENERA   214700      
005560     MOVE A00-R01-TCHEQ            TO  E00-R01-PBCOS-TIPO-CHEQUERA214800      
005561  ELSE                                                            214900      
005562     MOVE ZEROS                    TO  E00-R01-PBCOS-PLAZA-BMR    215000      
005563     MOVE A00-R01-SUCOPER          TO  E00-R01-PBCOS-SUC-OPE      215100      
005564     MOVE A00-R01-CAJAOPER         TO  E00-R01-PBCOS-TERM-OPE     215200      
005565     MOVE A00-R01-AUTORIZA         TO  E00-R01-PBCOS-CVE-AUT      215300      
005566     MOVE A00-R01-TCHEQ            TO  E00-R01-PBCOS-TIPO-CHEQUERA215400      
005567     MOVE A00-R01-VERIF-FIRMA      TO  E00-R01-PBCOS-VERIF-FIRMA. 215500      
005568                                                                  215600      
005569 230-DATOS-FORANEOS.                                              215700      
005570*-------------------                                              215800      
005571     MOVE WKS-CVE-AFC(A00-R01-CVETRAN1)  TO W77-AFC.              215900      
005572     IF (W77-AFC = 1 OR 2)  AND                                   216000      
005573        ((W77-SISTEMA-PARAMETRO NOT = 264 AND                     216100      
005574        A00-R01-TIPO-PROC < 15) OR (W77-SISTEMA-PARAMETRO = 264)) 216200      
005575        PERFORM 231-MUEVE-INFORMACION                             216300      
005576     ELSE                                                         216400      
005577     IF A00-R01-CVETRAN1 = 1009 AND W77-SISTEMA-PARAMETRO = 500   216500      
005578        PERFORM 231-MUEVE-INFORMACION.                            216600      
005579                                                                  216700      
005580 231-MUEVE-INFORMACION.                                           216800      
005581*----------------------                                           216900      
005582        MOVE 0 TO A00-F01-INDSUBCTA.                              216910      
005583        MOVE 01                           TO A00-F01-TIPO         217000      
005584        MOVE A00-R01-MONEDA               TO A00-F01-MONEDA       217100      
005585        MOVE A00-R01-AUTORIZA             TO A00-F01-AUTORIZA     217200      
005586        PERFORM 232-CONTRATO-REFERENCIA                           217500      
005587        MOVE A00-R01-CVETRAN1             TO A00-F01-CVETRAN1     217600      
005588        MOVE A00-R01-IMPORTE1             TO A00-F01-IMPORTE1     217700      
005589        MOVE A00-R01-PRODUCTO             TO A00-F01-PRODUCTO     217800      
005590        MOVE A00-R01-INSTRUMENTO          TO A00-F01-INSTRUMENTO  217900      
005591        MOVE A00-R01-SUCPROM              TO A00-F01-SUCPROM      218000      
005592        MOVE A00-R01-AUT-S151             TO A00-F01-AUT-S151     218100      
005593        MOVE A00-R01-BCO-ORI              TO A00-F01-BCO-ORI      218200      
005594        MOVE A00-R01-BCO-DES              TO A00-F01-BCO-DES      218300      
005595        IF A00-R01-ORIGEN = 2                                     218400      
005596           WRITE L09-DAT FROM A00-F01-REG-FOR                     218500      
005597        ELSE                                                      218600      
005598           WRITE L10-DAT FROM A00-F01-REG-FOR.                    218700      
005599                                                                  218800      
005600 232-CONTRATO-REFERENCIA.                                         218900      
005601*------------------------                                         219000      
005602     IF W77-SISTEMA-PARAMETRO = 264                               219100      
005603        MOVE ZEROS                        TO A00-F01-SUC-INIC     219200      
005604                                             A00-F01-CAJA-INIC    219300      
005605        MOVE A00-R01-SUC-INIC             TO A00-F01-SUC-ADI      219400      
005606        MOVE A00-R01-CAJA-INIC            TO A00-F01-CAJA-ADI     219500      
005607        MOVE A00-R01-REFNUM               TO A00-F01-CONTRATO     219600      
005608     ELSE                                                         219700      
005609        MOVE A00-R01-SUC-INIC             TO A00-F01-SUC-INIC     219800      
005610                                             A00-F01-SUC-ADI      219900      
005611        MOVE A00-R01-CAJA-INIC            TO A00-F01-CAJA-INIC    220000      
005612                                             A00-F01-CAJA-ADI     220100      
005613        MOVE A00-R01-CONTRATO             TO A00-F01-CONTRATO.    220200      
005614       IF W77-SISTEMA-PARAMETRO = 500                             220205      
005615       IF A00-R01-CTACON = 60 OR 61 OR 62 OR 63                   220215      
005616          MOVE 1                         TO A00-F01-INDSUBCTA     220220      
005617          IF A00-R01-APUDES > 0 AND A01-R01-APUDES > 0            220225      
005618             AND W77-EXISTE-INX = 0                               220230      
005619             PERFORM 400-LEE-DATOS-ADIC2                          220235      
005620             IF W77-EXISTE-ADIC2 = 0                              220240      
005621                IF A01-R02-IND-SUBC = 1                           220245      
005622                   MOVE A01-R02-MON-SUBC  TO A00-F01-MONEDA       220250      
005623                   MOVE A01-R02-CONT-SUBC TO A00-F01-CONTRATO.    220255      
005624                                                                  220300      
005625 240-VALIDA-DATOS-SORIANA.                                        220312      
005626*=========================                                        220314      
005627     MOVE     A00-R01-SUC-INIC    TO     CAT-SUC-INIC             220316      
005628     MOVE     A00-R01-CAJA-INIC   TO     CAT-CAJA-INIC            220318      
005629     MOVE     1                   TO     WKS-EXISTE               220325      
005630     READ     FILTRO  INVALID KEY MOVE 0 TO WKS-EXISTE.           220326      
005631     IF       WKS-EXISTE = 1                                      220328      
005632              PERFORM 245-MUEVE-SORIANA.                          220330      
005633*                                                                 220338      
005634 245-MUEVE-SORIANA.                                               220340      
005635*==================                                               220342      
005636     MOVE 2                       TO E13-R00-SORI-TIPO-REG.       220344      
005637     MOVE A00-R01-FECMOV          TO E13-R02-FECMOV.              220346      
005638     MOVE A00-R01-HORMOV          TO E13-R02-HORMOV.              220348      
005639     MOVE 500                     TO E13-R02-SISTEMA.             220350      
005640     MOVE A00-R01-MONEDA          TO E13-R02-MONEDA.              220352      
005641     MOVE A00-R01-NOMINA-OPE      TO E13-R02-NOMINA-OPE           220354      
005642                                     SORIANA-NOMINA-OPE.          220356      
005643     MOVE SORIANA-TIENDA          TO E13-R02-TIENDA.              220358      
005644     MOVE A00-R01-MDA-SUC         TO E13-R02-MDA-SUC.             220360      
005645     MOVE A00-R01-MDA-CTA         TO E13-R02-MDA-CTA.             220362      
005646     MOVE A00-R01-AUTORIZA        TO E13-R02-AUTORIZA.            220364      
005647     MOVE A00-R01-REFNUM          TO E13-R02-REFNUM.              220366      
005648     MOVE A00-R01-SUC-INIC        TO E13-R02-SUC-INIC.            220368      
005649     MOVE A00-R01-CAJA-INIC       TO E13-R02-CAJA-INIC.           220370      
005650     MOVE A00-R01-SUCPROM         TO E13-R02-SUCPROM.             220372      
005651     PERFORM 246-MUEVE-IMPORTE-SORIANA                            220374      
005652             VARYING W77-IND FROM 1 BY 1                          220376      
005653             UNTIL   W77-IND > 5    OR                            220378      
005654                     A00-R01-CVETRAN(W77-IND) = 0.                220380      
005655 246-MUEVE-IMPORTE-SORIANA.                                       220384      
005656*==========================                                       220386      
005657    MOVE A00-R01-IMPORTE(W77-IND)              TO E13-R02-IMPORTE.220388      
005658    MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) TO E13-R02-CVE-TIP.220390      
005659    WRITE L13-DAT          FROM E13-REG-SORIANA.                  220392      
005660    ADD   1                TO   W77-NUM-REGSSORIANA.              220393      
005661    ADD   E13-R02-IMPORTE  TO   W77-TOT-REGSSORIANA.              220394      
005662                                                                  220398      
005663 300-CREA-TRAILER.                                                220400      
005664*-----------------                                                220500      
005665     ADD 2                                 TO W77-NR-253-C        220600      
005666     ADD 2                                 TO W77-NR-253-M        220700      
005667     ADD 2                                 TO W77-NR-264-M        220800      
005668     ADD 2                                 TO W77-NR-264-M-MCH    220850      
005669     ADD 2                                 TO W77-NR-036-C        220900      
005670     ADD 2                                 TO W77-NR-054-M        221000      
005671*** INI EAS 2023R03                                               221002      
005672     ADD 2                                 TO W77-NR-EAS-M        221004      
005673*** FIN EAS 2023R03                                               221006      
005674     MOVE W77-NR-253-C                     TO E00-R02-S253-TOTREG 221100      
005675     MOVE W77-IM-253-C-C                   TO E00-R02-S253-TOTCAR 221200      
005676     MOVE W77-IM-253-C-A                   TO E00-R02-S253-TOTABO 221300      
005677     WRITE L03-DAT     FROM E00-R02-S253-TRAILER.                 221400      
005678     MOVE W77-NR-253-M                     TO E00-R02-S253-TOTREG 221500      
005679     MOVE W77-IM-253-M-C                   TO E00-R02-S253-TOTCAR 221600      
005680     MOVE W77-IM-253-M-A                   TO E00-R02-S253-TOTABO 221700      
005681     WRITE L04-DAT     FROM E00-R02-S253-TRAILER.                 221800      
005682     MOVE W77-NR-264-M                     TO E00-R02-S264-TOTREG 221900      
005683     MOVE W77-IM-264-M-C                   TO E00-R02-S264-TOTCAR 222000      
005684     MOVE W77-IM-264-M-A                   TO E00-R02-S264-TOTABO 222100      
005685     WRITE L05-DAT     FROM E00-R02-S264-TRAILER.                 222200      
005686     MOVE W77-NR-264-M-MCH                 TO E00-R02-S264-TOTREG 222220      
005687     MOVE W77-IM-264-M-C-MCH               TO E00-R02-S264-TOTCAR 222240      
005688     MOVE W77-IM-264-M-A-MCH               TO E00-R02-S264-TOTABO 222260      
005689     IF W77-SISTEMA-PARAMETRO = 500                               222270      
005690        WRITE L05-DAT-MCH FROM E00-R02-S264-TRAILER.              222280      
005691     MOVE W77-NR-036-C                    TO E00-R02-S036-TOTREG  222300      
005692     MOVE W77-IM-036-C-C                  TO E00-R02-S036-TOTCAR  222400      
005693     MOVE W77-IM-036-C-A                  TO E00-R02-S036-TOTABO  222500      
005694     WRITE L08-DAT     FROM E00-R02-S036-TRAILER.                 222600      
005695                                                                  222700      
005696     IF W77-SISTEMA-PARAMETRO = 500                               222800      
005697        MOVE W77-NR-054-M                 TO E00-R02-S054-TOTREG  222900      
005698        MOVE W77-IM-054-M-C               TO E00-R02-S054-TOTCAR  223000      
005699        MOVE W77-IM-054-M-A               TO E00-R02-S054-TOTABO  223100      
005700        WRITE L11-DAT     FROM E00-R02-S054-TRAILER               223200      
005701        PERFORM 1755-CREA-TR-BNX.                                 223300      
005702*** INI EAS 2023R03                                               223302      
005703     IF W77-SISTEMA-PARAMETRO = 500                               223304      
005704       MOVE W77-NR-EAS-M                 TO E00-R02-EAS-TOTREG    223306      
005705       MOVE W77-IM-EAS-M-C               TO E00-R02-EAS-TOTCAR    223308      
005706       MOVE W77-IM-EAS-M-A               TO E00-R02-EAS-TOTABO    223310      
005707       WRITE L16-DAT     FROM E00-R02-EAS-TRAILER                 223312      
005708       PERFORM 1755-CREA-TR-EAS.                                  223314      
005709*** FIN EAS 2023R03                                               223316      
005710*** INI EXTNET 2023 R11                                           223321      
005711     IF W88-HOSTNAME AND W77-SISTEMA-PARAMETRO = 500              223326      
005712       MOVE WKS-NUM-ABON-NAC           TO 500-R03-NUMABOMN        223331      
005713       MOVE WKS-IMP-ABON-NAC           TO 500-R03-TOTABOMN        223336      
005714       MOVE WKS-NUM-CARG-NAC           TO 500-R03-NUMCARMN        223341      
005715       MOVE WKS-IMP-CARG-NAC           TO 500-R03-TOTCARMN        223346      
005716       MOVE WKS-NUM-NCON-NAC           TO 500-R03-NUMNCONTMN      223351      
005717       MOVE WKS-NUM-ABON-DOLL          TO 500-R03-NUMABODLS       223356      
005718       MOVE WKS-IMP-ABON-DOLL          TO 500-R03-TOTABODLS       223361      
005719       MOVE WKS-NUM-CARG-DOLL          TO 500-R03-NUMCARDLS       223366      
005720       MOVE WKS-IMP-CARG-DOLL          TO 500-R03-TOTCARDLS       223371      
005721       MOVE WKS-NUM-NCON-DOLL          TO 500-R03-NUMNCONTDLS     223376      
005722       MOVE WKS-NUM-ELIM-ABON-NAC      TO 500-R03-ELIM-NUMABOMN   223381      
005723       MOVE WKS-IMP-ELIM-ABON-NAC      TO 500-R03-ELIM-TOTABOMN   223386      
005724       MOVE WKS-NUM-ELIM-CARG-NAC      TO 500-R03-ELIM-NUMCARMN   223391      
005725       MOVE WKS-IMP-ELIM-CARG-NAC      TO 500-R03-ELIM-TOTCARMN   223396      
005726       MOVE WKS-NUM-ELIM-NCON-NAC      TO 500-R03-ELIM-NUMNCONTMN 223401      
005727       MOVE WKS-NUM-ELIM-ABON-DOLL     TO 500-R03-ELIM-NUMABODLS  223406      
005728       MOVE WKS-IMP-ELIM-ABON-DOLL     TO 500-R03-ELIM-TOTABODLS  223411      
005729       MOVE WKS-NUM-ELIM-CARG-DOLL     TO 500-R03-ELIM-NUMCARDLS  223416      
005730       MOVE WKS-IMP-ELIM-CARG-DOLL     TO 500-R03-ELIM-TOTCARDLS  223421      
005731       MOVE WKS-NUM-ELIM-NCON-DOLL     TO 500-R03-ELIM-NUMNCONTDLS223426      
005732       WRITE L17-DAT-EXTNET     FROM 500-R03-TRA-CLIENTESCITID    223431      
005733       PERFORM 1755-CREA-TR-EXTNET.                               223436      
005734*** FIN EXTNET 2023 R11                                           223441      
005735                                                                  223446      
005736                                                                  223500      
005737     MOVE 99                               TO E05-R02-S500-TIPREG 223900      
005738     MOVE W77-NUM-REGS500                  TO E05-R02-S500-TOTREG 224000      
005739     MOVE W77-TOT-REGS500                  TO E05-R02-S500-TOTIMP 224100      
005740     WRITE L07-DAT     FROM E05-R02-S500-TRAILER.                 224200      
005741                                                                  224300      
005742     IF W77-SISTEMA-PARAMETRO = 264                               224310      
005743        MOVE 99                         TO E05-R02-S500-TIPREG-MCH224320      
005744        MOVE W77-NUM-REGS500-MCH        TO E05-R02-S500-TOTREG-MCH224330      
005745        MOVE W77-TOT-REGS500-MCH        TO E05-R02-S500-TOTIMP-MCH224335      
005746        WRITE L07-DAT-MCH FROM E05-R02-S500-TRAILER-MCH.          224340      
005747     IF W77-SISTEMA-PARAMETRO = 500                               224342      
005748        MOVE W77-NR-500-M-T-PAG         TO E05-R02-S500-TOTREG-PAG224344      
005749        MOVE W77-IM-500-M-C-PAG         TO E05-R02-S500-TOTCAR-PAG224346      
005750        MOVE W77-IM-500-M-A-PAG         TO E05-R02-S500-TOTABO-PAG224348      
005751        WRITE L07-DAT-PAG FROM E05-R02-S500-TRAILER-PAG.          224349      
005752                                                                  224350      
005753     IF W77-SISTEMA-PARAMETRO = 500                               224400      
005754        MOVE W77-NUM-REGS707               TO E05-R02-S500-TOTREG 224420      
005755        MOVE W77-TOT-REGS707               TO E05-R02-S500-TOTIMP 224440      
005756        WRITE L12-DAT     FROM E05-R02-S500-TRAILER               224460      
005757        CLOSE L12-DATOS WITH SAVE                                 224470      
005758        MOVE W77-SIS-FECPRO        TO WKS-START-FEC2              224480      
005759        MOVE 707                   TO WKS-START-SIS               224490      
005760        MOVE W77-NR-BCOS-0410      TO E00-R02-PBCOS-TOTREG        224500      
005761        MOVE W77-NR-BCOS-0410C     TO E00-R02-PBCOS-NUMCAR        224600      
005762        MOVE W77-IM-BCOS-0410C     TO E00-R02-PBCOS-IMPCAR        224700      
005763        MOVE W77-NR-BCOS-0410A     TO E00-R02-PBCOS-NUMABO        224800      
005764        MOVE W77-IM-BCOS-0410A     TO E00-R02-PBCOS-IMPABO        224900      
005765        WRITE A01-R01-PBCOS-0410   FROM E00-R02-PBCOS-TRAILER     225000      
005766        CLOSE A01-PBCOS-0410 WITH SAVE                            225010      
005767        PERFORM 399-ENVIA-ARCHIVO-S707.                           225020      
005768     IF W77-SISTEMA-PARAMETRO = 500                               225030      
005769        MOVE 9                   TO E13-R00-SORI-TIPO-REG         225040      
005770        ADD 2                    TO W77-NUM-REGSSORIANA           225050      
005771        MOVE W77-NUM-REGSSORIANA TO E13-R09-SORI-TOTREG           225060      
005772        MOVE W77-TOT-REGSSORIANA TO E13-R09-SORI-TOTIMP           225070      
005773        MOVE SPACES              TO E13-R09-SORI-FILLER           225080      
005774        WRITE L13-DAT FROM E13-REG-SORIANA.                       225090      
005775*                                                                 225100      
005776     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  225110      
005777        W77-SISTEMA-PARAMETRO = 500                               225120      
005778        ADD 2 TO E14-R03-S013-TOTREG                              225130      
005779        WRITE L14-DAT FROM E14-R03-S013-TRA                       225140      
005780        MOVE W77-SIS-FECPRO      TO WKS-START-FEC-MPS.            225160      
005781                                                                  225180      
005782     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  225190      
005783        W77-SISTEMA-PARAMETRO = 500                               225200      
005784        ADD 2                    TO W77-NR-253-CMOV               225210      
005785        MOVE W77-NR-253-CMOV     TO E15-R02-S253-TOTREG           225220      
005786        MOVE SPACE               TO E15-R02-S253-SIGCAR           225225      
005787        MOVE W77-IM-253-CMOV-C   TO E15-R02-S253-TOTCAR           225230      
005788        MOVE SPACE               TO E15-R02-S253-SIGABO           225235      
005789        MOVE W77-IM-253-CMOV-A   TO E15-R02-S253-TOTABO           225240      
005790        MOVE SPACES              TO E15-R02-S253-FILLER           225245      
005791        WRITE L15-DAT FROM E15-R02-S253-TRAILER                   225250      
005792        MOVE W77-SIS-FECPRO      TO WKS-START-FEC-CMOV.           225270      
005793*                                                                 225290      
005794 399-ENVIA-ARCHIVO-S707.                                          225300      
005795*-----------------------                                          225310      
005796     CALL SYSTEM WFL USING WKS-TIT-WFL2.                          225320      
005797                                                                  225330      
005798 400-LEE-DATOS-ADIC.                                              225340      
005799*-------------------                                              225350      
005800    IF A00-R01-APUDES > 0                                         225360      
005801       COMPUTE W77-NUM-REG  = A00-R01-APUDES + 1                  225370      
005802       READ L02-DATOS INTO A01-R01-DATOS                          225600      
005803          INVALID KEY                                             225700      
005804             MOVE 1           TO  W77-EXISTE-INX                  225800      
005805             MOVE SPACES       TO      WLI-ENCAB-52               225900      
005806             MOVE "E"         TO  WLI-TIPO-LJ                     226000      
005807             MOVE 010105      TO  CODIGO-LJ                       226100      
005808             COMPUTE W77-NUM-REG = W77-NUM-REG - 1                226200      
005809             STRING "ERROR AL LEER DATOS ADICIONALES APUNTADOR : "226300      
005810               , W77-NUM-REG DELIMITED BY SIZE INTO WLI-TEXTO-LJ  226400      
005811             MOVE WLI-TIPO-LJ        TO      TIPO-LJ              226500      
005812             MOVE WLI-TEXTO-LJ       TO      TEXTO-LJ             226600      
005813             PERFORM  000-030-IMPRIME-MENSAJE                     226700      
005814             CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ. 226800      
005815                                                                  226900      
005816                                                                  227200      
005817 500-ESCRIBE-253.                                                 227300      
005818*----------------                                                 227400      
005819     IF A00-R01-CVEMDA = 1                                        227500      
005820        ADD 1           TO W77-NR-253-C                           227600      
005821        WRITE L03-DAT   FROM E00-R01-S253-REGMOV                  227700      
005822     ELSE                                                         227800      
005823        ADD 1           TO W77-NR-253-M                           227900      
005824        WRITE L04-DAT   FROM E00-R01-S253-REGMOV.                 228000      
005825                                                                  228010      
005826 500-ESCRIBE-253-CTASMOVIL.                                       228030      
005827*------------------------                                         228040      
005828        ADD 1           TO   W77-NR-253-CMOV                      228050      
005829        WRITE L15-DAT   FROM E15-R01-S253-REGMOV.                 228060      
005830*                                                                 228100      
005831 510-ESCRIBE-264.                                                 228200      
005832*----------------                                                 228300      
005833     ADD 1             TO W77-NR-264-M                            228400      
005834     WRITE L05-DAT   FROM E00-R01-S264-REGMOV.                    228500      
005835                                                                  228510      
005836 510-ESCRIBE-999.                                                 228520      
005837*----------------                                                 228530      
005838     ADD 1             TO W77-NR-264-M-MCH                        228540      
005839     WRITE L05-DAT-MCH FROM E00-R01-S264-REGMOV.                  228550      
005840                                                                  228600      
005841 515-ESCRIBE-036.                                                 228700      
005842*----------------                                                 228800      
005843     ADD 1             TO W77-NR-036-C                            228900      
005844     WRITE L08-DAT   FROM E00-R01-S036-REGMOV.                    229000      
005845                                                                  229100      
005846 520-ESCRIBE-054.                                                 229200      
005847*----------------                                                 229300      
005848     ADD 1             TO W77-NR-054-M                            229400      
005849     WRITE L11-DAT   FROM E00-R01-S054-REGMOV.                    229500      
005850                                                                  229600      
005851 526-ESCRIBE-PAG.                                                 229610      
005852*----------------                                                 229620      
005853     ADD 1               TO W77-NR-500-M-T-PAG.                   229630      
005854     WRITE L07-DAT-PAG FROM E05-R01-S500-REGMOV-PAG.              229640      
005855                                                                  229650      
005856*** INI EAS 2023R03                                               229652      
005857530-ESCRIBE-EAS.                                                  229654      
005858*----------------                                                 229656      
005859    ADD 1             TO W77-NR-EAS-M                             229658      
005860    WRITE L16-DAT   FROM E00-R01-EAS-REGMOV.                      229660      
005861*** FIN EAS 2023R03                                               229662      
005862 900-CIERRA-ARCHIVOS.                                             229700      
005863*--------------------                                             229800      
005864     CLOSE L01-DATOS                                              229900      
005865     IF W88-ARCH-DATADI                                           230000      
005866        CLOSE L02-DATOS.                                          230100      
005867                                                                  230200      
005868     IF W88-SOLO-PUNTEO                                           230300      
005869        CLOSE L03-DATOS WITH PURGE                                230400      
005870        CLOSE L04-DATOS WITH PURGE                                230500      
005871        CLOSE L05-DATOS WITH PURGE                                230600      
005872        CLOSE L08-DATOS WITH PURGE                                230700      
005873        CLOSE L09-DATOS WITH PURGE                                230800      
005874        CLOSE L10-DATOS WITH PURGE                                230900      
005875        CLOSE ARCH-LISTC WITH PURGE                               231000      
005876     ELSE                                                         231100      
005877        CLOSE L03-DATOS WITH SAVE                                 231200      
005878        CLOSE L04-DATOS WITH SAVE                                 231300      
005879        CLOSE L05-DATOS WITH SAVE                                 231400      
005880        CLOSE L08-DATOS WITH SAVE                                 231500      
005881        CLOSE L09-DATOS WITH SAVE                                 231600      
005882        CLOSE L10-DATOS WITH SAVE                                 231700      
005883        CLOSE ARCH-LISTC WITH SAVE.                               231800      
005884*       PERFORM 950-TRANSF-ARCHIVOS.                              231850      
005885                                                                  231900      
005886     IF W88-SOLO-PUNTEO                                           231910      
005887        IF W77-SISTEMA-PARAMETRO = 500                            231920      
005888           CLOSE L05-DATOS-MCH WITH PURGE                         231930      
005889        ELSE                                                      231940      
005890           NEXT SENTENCE                                          231950      
005891     ELSE                                                         231960      
005892        IF W77-SISTEMA-PARAMETRO = 500                            231970      
005893           CLOSE L07-DATOS-PAG WITH SAVE                          231972      
005894           MOVE 0                      TO W77-INTE-SNT            231974      
005895           MOVE WKS-TIT-SALS500-PAG    TO WKS-INTE-ARCHIVO        231976      
005896           PERFORM 030705-ENVIO-POR-INTELAR                       231978      
005897           CLOSE L05-DATOS-MCH WITH SAVE                          231980      
005898           MOVE 0                      TO W77-INTE-SNT            231982      
005899           MOVE WKS-TIT-SAL264CMAE-MCH TO WKS-INTE-ARCHIVO        231985      
005900           PERFORM 030705-ENVIO-POR-INTELAR.                      231990      
005901     CLOSE L07-DATOS WITH SAVE                                    232000      
005902     IF W77-SISTEMA-PARAMETRO = 264                               232020      
005903        CLOSE L07-DATOS-MCH WITH SAVE                             232050      
005904        MOVE 0                   TO W77-INTE-SNT                  232060      
005905        MOVE WKS-TIT-SALS500-MCH TO WKS-INTE-ARCHIVO              232070      
005906        PERFORM 030705-ENVIO-POR-INTELAR.                         232090      
005907                                                                  232100      
005908     IF W77-SISTEMA-PARAMETRO = 500                               232200      
005909        CLOSE L11-DATOS WITH SAVE                                 232220      
005910        CLOSE L13-SORIANA WITH SAVE                               232240      
005911        CLOSE FILTRO           PURGE                              232260      
005912        MOVE W77-SIS-FECPRO        TO WKS-START-FEC2-SOR          232300      
005913        IF  WKS-CSI-ORI-SORIANA    = 10                           232310      
005914            MOVE "S151SORV/"       TO WKS-CVE-TRANFER             232312      
005915            CALL SYSTEM WFL USING WKS-TIT-WFL-SORIANA             232313      
005916        ELSE                                                      232314      
005917            MOVE "S151SORM/"       TO WKS-CVE-TRANFER             232316      
005918            CALL SYSTEM WFL USING WKS-TIT-WFL-SORIANA.            232380      
005919**                                                                232400      
005920     IF (WKS-NUMCSI = 10 OR WKS-NUMCSI = 32) AND                  232402      
005921        W77-SISTEMA-PARAMETRO = 500                               232404      
005922        CLOSE L14-MPS WITH SAVE                                   232406      
005923        CLOSE L15-DATOS WITH SAVE                                 232408      
005924        PERFORM 980-ENVIA-ARCHIVO-MPS-S013                        232410      
005925        PERFORM 990-ENVIA-ARCHIVO-CMOV-S253.                      232412      
005926                                                                  232414      
005927 980-ENVIA-ARCHIVO-MPS-S013.                                      232416      
005928*---------------------------                                      232418      
005929                                                                  232420      
005930     CALL SYSTEM WFL USING WKS-TIT-WFL-MPS.                       232422      
005931                                                                  232424      
005932 990-ENVIA-ARCHIVO-CMOV-S253.                                     232426      
005933*----------------------------                                     232428      
005934                                                                  232430      
005935     CALL SYSTEM WFL USING WKS-TIT-WFL-CMOV.                      232432      
005936                                                                  232434      
005937 1000-GRABA-LISTC.                                                232500      
005938*-----------------                                                232600      
005939     MOVE A00-R01-ORIGEN            TO  ARCH-LIS-ORI              232700      
005940     MOVE W77-AFC                   TO  ARCH-LIS-AFC              232800      
005941     MOVE A00-R01-IMPORTE(W77-IND)  TO  ARCH-LIS-IMP              232900      
005942     MOVE A00-R01-MONEDA            TO  ARCH-LIS-MON              233000      
005943     WRITE FD-ARCH-LISTC.                                         233100      
005944**                                                                233200      
005945 1100-SORT-LISTC.                                                 233300      
005946*----------------                                                 233400      
005947     OPEN INPUT ARCH-LISTC                                        233500      
005948     COMPUTE W77-FRAMESIZE        =                               233510      
005949            (ATTRIBUTE FRAMESIZE  OF ARCH-LISTC)                  233520      
005950     COMPUTE W77-MAXRECSIZE       =                               233530      
005951            (ATTRIBUTE MAXRECSIZE OF ARCH-LISTC)                  233540      
005952     COMPUTE W77-LASTRECORD       =                               233550      
005953            (ATTRIBUTE LASTRECORD OF ARCH-LISTC                   233560      
005954                                  +   1)                          233570      
005955     CLOSE ARCH-LISTC SAVE                                        233800      
005956     PERFORM                      70000-CALCULA-ESPACIO           233810      
005957     SORT ARCH-SORTC ON ASCENDING KEY ST-MONEDA                   233900      
005958          MEMORY SIZE IS W77-MEMORY-SIZE WORDS                    233910      
005959          DISK   SIZE IS W77-DISK-SIZE   WORDS                    233920      
005960          USING  ARCH-LISTC                                       234000      
005961          GIVING ARCH-LISTC                                      .234100      
005962**                                                                234200      
005963 1200-IMPRIME-LISTC.                                              234300      
005964*-------------------                                              234400      
005965      MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WKS-MIX-CARAT.       234500      
005966      MOVE W77-SIS-FECPRO                 TO WKS-FECH-CARAT.      234800      
005967     MOVE ZEROS TO A2K-FEC-CAMD-001                               234900      
005968     MOVE W77-SIS-FECPRO  TO  A2K-FEC-CAMD-001                    235000      
005969     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            235100      
005970             A2K-CONV-CAMD-TO-AMD-EXIT                            235200      
005971     MOVE A2K-FEC-AMD-001  TO  WKS-FECH-CARAT.                    235300      
005972*TERMINA CODIGO DE RENOVACION CRONOS 2000                         235400      
005973*     MOVE W77-NUM-CSI                    TO WKS-NODO-CARAT.      235500      
005974      MOVE W77-SISTEMA-PARAMETRO                TO WKS-SIST-CARAT.235600      
005975      OPEN OUTPUT ARCH-CARAT.                                     235700      
005976      WRITE FD-ARCH-CARAT FROM WS-TIT1 AFTER PAGE.                235800      
005977      WRITE FD-ARCH-CARAT FROM WS-TIT2 AFTER  1 LINES.            235900      
005978      WRITE FD-ARCH-CARAT FROM WS-TIT3 AFTER  1 LINES.            236000      
005979      WRITE FD-ARCH-CARAT FROM LISC-SUB1 AFTER  2 LINES.          236100      
005980      WRITE FD-ARCH-CARAT FROM LISC-SUB2 AFTER  2 LINES.          236200      
005981      WRITE FD-ARCH-CARAT FROM LISC-SUB3 AFTER  2 LINES.          236300      
005982      OPEN INPUT ARCH-LISTC.                                      236400      
005983      MOVE  ARCH-LIS-MON   TO  WKS-MON-ANT.                       236500      
005984      CLOSE ARCH-LISTC.                                           236600      
005985      OPEN INPUT ARCH-LISTC.                                      236700      
005986      PERFORM 1400-LEE-LISTC.                                     236800      
005987      PERFORM 1300-PROCESA-LISTC UNTIL WKS-EOF-LISC  =  1.        236900      
005988      PERFORM 1600-IMPRIME-TOT.                                   237000      
005989                                                                  237100      
005990/-----------------                                                237200      
005991 1300-PROCESA-LISTC.                                              237300      
005992*-----------------                                                237400      
005993    IF ARCH-LIS-MON       =       WKS-MON-ANT                     237500      
005994         PERFORM 1700-ACUMULA                                     237600      
005995    ELSE                                                          237700      
005996       PERFORM 1500-IMPRIME-DET                                   237800      
005997       PERFORM 1700-ACUMULA                                       237900      
005998       MOVE  ARCH-LIS-MON   TO  WKS-MON-ANT.                      238000      
005999    PERFORM 1400-LEE-LISTC.                                       238100      
006000                                                                  238200      
006001/---------------                                                  238300      
006002 1400-LEE-LISTC.                                                  238400      
006003*---------------                                                  238500      
006004      READ ARCH-LISTC   AT END                                    238600      
006005      MOVE       1   TO      WKS-EOF-LISC                         238700      
006006      PERFORM 1500-IMPRIME-DET                                    238800      
006007      CLOSE ARCH-LISTC WITH PURGE.                                238900      
006008                                                                  239000      
006009/------------------                                               239100      
006010 1500-IMPRIME-DET.                                                239200      
006011*------------------                                               239300      
006012                                                                  239400      
006013       MOVE  WKS-IMP-CAR-OP  TO R1D1-IMP-CAR-OP.                  239500      
006014       MOVE  WKS-IMP-ABO-OP  TO R1D1-IMP-ABO-OP.                  239600      
006015       MOVE  WKS-IMP-CAR-APL TO R1D1-IMP-CAR-APL.                 239700      
006016       MOVE  WKS-IMP-ABO-APL TO R1D1-IMP-ABO-APL.                 239800      
006017       MOVE  WKS-NUM-CAR-OP  TO R1D1-NUM-CAR-OP.                  239900      
006018       MOVE  WKS-NUM-ABO-OP  TO R1D1-NUM-ABO-OP.                  240000      
006019       MOVE  WKS-NUM-CAR-APL TO R1D1-NUM-CAR-APL.                 240100      
006020       MOVE  WKS-NUM-ABO-APL TO R1D1-NUM-ABO-APL.                 240200      
006021                                                                  240300      
006022       MOVE  WKS-MON-ANT     TO R1D1-MONEDA.                      240400      
006023       WRITE FD-ARCH-CARAT FROM LISC-DET1 AFTER  2 LINES.         240500      
006024                                                                  240600      
006025       MOVE  ZEROS    TO  WKS-NUM-CAR-OP.                         240700      
006026       MOVE  ZEROS    TO  WKS-NUM-ABO-OP.                         240800      
006027       MOVE  ZEROS    TO  WKS-NUM-CAR-APL.                        240900      
006028       MOVE  ZEROS    TO  WKS-NUM-ABO-APL.                        241000      
006029                                                                  241100      
006030       MOVE  ZEROS    TO  WKS-IMP-CAR-OP.                         241200      
006031       MOVE  ZEROS    TO  WKS-IMP-ABO-OP.                         241300      
006032       MOVE  ZEROS    TO  WKS-IMP-CAR-APL.                        241400      
006033       MOVE  ZEROS    TO  WKS-IMP-ABO-APL.                        241500      
006034                                                                  241600      
006035/------------------                                               241700      
006036 1600-IMPRIME-TOT.                                                241800      
006037*------------------                                               241900      
006038       MOVE  WKS-TOT-CAR-OP  TO R1T1-IMP-CAR-OP.                  242000      
006039       MOVE  WKS-TOT-ABO-OP  TO R1T1-IMP-ABO-OP.                  242100      
006040       MOVE  WKS-TOT-CAR-APL TO R1T1-IMP-CAR-APL.                 242200      
006041       MOVE  WKS-TOT-ABO-APL TO R1T1-IMP-ABO-APL.                 242300      
006042       WRITE FD-ARCH-CARAT FROM LISC-TOT1 AFTER  4 LINES.         242400      
006043/--------------                                                   242500      
006044  1700-ACUMULA.                                                   242600      
006045*--------------                                                   242700      
006046      IF ARCH-LIS-ORI     =       2                               242800      
006047         IF ARCH-LIS-AFC      =       1                           242900      
006048              ADD 1               TO     WKS-NUM-CAR-OP           243000      
006049              ADD ARCH-LIS-IMP    TO     WKS-IMP-CAR-OP           243100      
006050              ADD ARCH-LIS-IMP    TO     WKS-TOT-CAR-OP           243200      
006051         ELSE                                                     243300      
006052              ADD 1               TO     WKS-NUM-ABO-OP           243400      
006053              ADD ARCH-LIS-IMP    TO     WKS-IMP-ABO-OP           243500      
006054              ADD ARCH-LIS-IMP    TO     WKS-TOT-ABO-OP           243600      
006055      ELSE                                                        243700      
006056         IF  ARCH-LIS-AFC   =         1                           243800      
006057              ADD 1               TO     WKS-NUM-CAR-APL          243900      
006058              ADD  ARCH-LIS-IMP   TO     WKS-IMP-CAR-APL          244000      
006059              ADD  ARCH-LIS-IMP   TO     WKS-TOT-CAR-APL          244100      
006060         ELSE                                                     244200      
006061              ADD 1               TO     WKS-NUM-ABO-APL          244300      
006062              ADD  ARCH-LIS-IMP   TO     WKS-IMP-ABO-APL          244400      
006063              ADD  ARCH-LIS-IMP   TO     WKS-TOT-ABO-APL.         244500      
006064*INICIA CODIGO DE RENOVACION CRONOS 2000                          244600      
006065 A2K-CPY-SECTION SECTION.                                         244700      
006066*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006067*    COPY "(S151)S151/CRONOS2K/CPY/PD ON CMEMP".                  244800      
006068** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
006069** Unisys has defined for CRONOS2K project                     ** 000200      
006070** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
006071***************************************************************** 000400      
006072***************************************************************** 000600      
006073** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
006074** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
006075** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
006076** date MMDDCCAA, which is returned into the variable          ** 001000      
006077** A2K-FEC-MDCA-001.                                           ** 001100      
006078***************************************************************** 001200      
006079                                                                  001300      
006080 A2K-ACCEPT-TODAYS-DATE.                                          001400      
006081        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
006082*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
006083        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
006084        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
006085        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
006086        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
006087        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
006088                                                                  002200      
006089 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
006090        EXIT.                                                     002240      
006091                                                                  002500      
006092****************************************************************  002600      
006093** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
006094**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
006095**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
006096**baseyear to add the century to the year part.               **  003000      
006097**INPUT is A2K-FEC-AMD-001                                    **  003100      
006098**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
006099****************************************************************  003300      
006100                                                                  003400      
006101 A2K-CONV-AMD-TO-CAMD.                                            003500      
006102         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
006103         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
006104         IF A2K-FEC-AMD-001 = 0                                   003720      
006105            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
006106         ELSE                                                     003741      
006107          IF A2K-FEC-AMD-001 = 999999                             003742      
006108             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
006109         ELSE                                                     003760      
006110         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
006111                 A2K-OBTAIN-CENTURY-EXIT                          003900      
006112         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
006113         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
006114         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
006115         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
006116                                                                  004400      
006117 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
006118         EXIT.                                                    004600      
006119                                                                  004700      
006120******************************************************************004800      
006121**A2K-CONV-MDA-TO-MDCA.                                         **004900      
006122**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
006123** an eight digit format as MMDDCCAA. It use a                  **005100      
006124** baseyear to add century to the yaer.                         **005200      
006125** INPUT is A2K-FEC-MDA-001                                     **005300      
006126** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
006127                                                                  005500      
006128 A2K-CONV-MDA-TO-MDCA.                                            005600      
006129     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
006130     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
006131     IF A2K-FEC-MDA-001 = 0                                       005820      
006132        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
006133     ELSE                                                         005845      
006134      IF A2K-FEC-MDA-001 = 999999                                 005850      
006135         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
006136     ELSE                                                         005860      
006137     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
006138             A2K-OBTAIN-CENTURY-EXIT                              006000      
006139     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
006140     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
006141     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
006142     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
006143                                                                  006500      
006144 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
006145     EXIT.                                                        006700      
006146                                                                  006800      
006147***************************************************************** 006900      
006148**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
006149**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
006150**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
006151**baseyear to add century to the year.                         ** 007300      
006152**INPUT is A2K-FEC-DMA-001                                     ** 007400      
006153**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
006154                                                                  007600      
006155 A2K-CONV-DMA-TO-DMCA.                                            007700      
006156       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
006157       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
006158       IF  A2K-FEC-DMA-001   = 0                                  007920      
006159          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
006160       ELSE                                                       007945      
006161        IF A2K-FEC-DMA-001 = 999999                               007950      
006162          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
006163       ELSE                                                       007960      
006164       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
006165               A2K-OBTAIN-CENTURY-EXIT                            008100      
006166       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
006167       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
006168       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
006169       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
006170                                                                  008600      
006171 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
006172       EXIT.                                                      008800      
006173                                                                  008900      
006174***************************************************************** 009000      
006175** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
006176** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
006177** a 6 digit format as AAMMDD.                                 ** 009300      
006178** It simply removes the century information in the output     ** 009400      
006179** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
006180** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
006181                                                                  009700      
006182 A2K-CONV-CAMD-TO-AMD.                                            009800      
006183     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
006184     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
006185     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
006186     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
006187                                                                  010300      
006188 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
006189      EXIT.                                                       010500      
006190                                                                  010600      
006191******************************************************************010700      
006192******************************************************************010800      
006193** A2K-CONV-MDCA-TO-MDA.                                        **010900      
006194** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
006195** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
006196** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
006197** INPUT is A2K-FEC-MDCA-001                                    **011300      
006198** OUTPUT is A2K-FEC-MDA-001                                    **011400      
006199                                                                  011500      
006200 A2K-CONV-MDCA-TO-MDA.                                            011600      
006201     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
006202     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
006203     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
006204     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
006205                                                                  012100      
006206 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
006207      EXIT.                                                       012300      
006208                                                                  012400      
006209******************************************************************012500      
006210***************************************************************** 012600      
006211** A2K-CONV-DMCA-TO-DMA.                                        **012700      
006212** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
006213** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
006214** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
006215** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
006216** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
006217                                                                  013300      
006218 A2K-CONV-DMCA-TO-DMA.                                            013400      
006219     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
006220     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
006221     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
006222     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
006223                                                                  013900      
006224 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
006225      EXIT.                                                       014100      
006226                                                                  014200      
006227***************************************************************** 014300      
006228 A2K-CONV-MDCA-TO-CAMD.                                           014400      
006229      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
006230      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
006231      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
006232      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
006233      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
006234 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
006235      EXIT.                                                       015100      
006236***************************************************************** 015200      
006237** This paragraph adds century to an year field which is 9(02) ** 015300      
006238** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
006239** Output is A2K-FEC-CCAA-001.                                 ** 015600      
006240***************************************************************** 015700      
006241 A2K-CONV-AA-TO-CCAA.                                             015800      
006242      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
006243      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
006244              A2K-OBTAIN-CENTURY-EXIT.                            016100      
006245      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
006246 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
006247      EXIT.                                                       016400      
006248***************************************************************** 016500      
006249** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
006250** format.                                                     ** 016700      
006251** Input is A2K-FEC-DMCA-001.                                  ** 016800      
006252** Output is A2K-FEC-CAMD-001.                                 ** 016900      
006253***************************************************************** 017000      
006254 A2K-CONV-DMCA-TO-CAMD.                                           017100      
006255      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
006256      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
006257      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
006258      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
006259      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
006260 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
006261      EXIT.                                                       017800      
006262***************************************************************** 017900      
006263** This paragraph desides the Century to be added depending    ** 018000      
006264** on the base year.                                           ** 018100      
006265** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
006266** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
006267***************************************************************** 018400      
006268 A2K-OBTAIN-CENTURY.                                              018500      
006269      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
006270          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
006271      ELSE                                                        018800      
006272          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
006273 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
006274      EXIT.                                                       019100      
006275                                                                  019200      
006276***************************************************************** 019300      
006277** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
006278**  Format                                                     ** 019500      
006279** Input Is A2K-FEC-CAMD-001                                   ** 019600      
006280** Output Is A2K-FEC-DMCA-001                                  ** 019700      
006281***************************************************************** 019800      
006282 A2K-CONV-CAMD-TO-DMCA.                                           019900      
006283      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
006284      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
006285      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
006286      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
006287      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
006288                                                                  020500      
006289 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
006290      EXIT.                                                       020700      
006291                                                                  020800      
006292******************************************************************020900      
006293******************************************************************021000      
006294 A2K-CONV-AM-TO-CAM.                                              021100      
006295      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
006296      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
006297      IF A2K-FEC-AM-001 = 0                                       021220      
006298         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
006299      ELSE                                                        021245      
006300      IF A2K-FEC-AM-001 = 9999                                    021250      
006301         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
006302      ELSE                                                        021260      
006303      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
006304      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
006305      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
006306              A2K-OBTAIN-CENTURY-EXIT                             021600      
006307      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
006308                                                                  021800      
006309 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
006310      EXIT.                                                       022000      
006311                                                                  022100      
006312******************************************************************022200      
006313******************************************************************022300      
006314 A2K-CONV-CAM-TO-AM.                                              022400      
006315      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
006316      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
006317      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
006318                                                                  022800      
006319 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
006320   EXIT.                                                          023000      
006321                                                                  023100      
006322                                                                  023200      
006323                                                                  023500      
006324*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006325                                                                  244900      
006326 1555-CREA-HDR-BNX.                                               245000      
006327*-----------------                                                245100      
006328    MOVE 1                      TO W77-NREG-BNX.                  245200      
006329    MOVE SPACES                 TO HDR-TIPP-CMP.                  245300      
006330*    MOVE 01                     TO HDR-PLAZA-CMP.                245400      
006331    IF WKS-NUMCSI = 04 OR 35                                      245500      
006332         MOVE 90118904          TO HDR-DEST-CMP,  WKS-TIT-NUMPROC 245600      
006333         MOVE 02                TO HDR-PLAZA-CMP                  245700      
006334    ELSE                                                          245800      
006335         MOVE 901159005         TO HDR-DEST-CMP,  WKS-TIT-NUMPROC 245900      
006336         MOVE 01                TO HDR-PLAZA-CMP.                 246000      
006337    MOVE W77-SIS-FECPRO         TO HDR-FEC-CMP,   WKS-TIT-FECENV. 246100      
006338    ADD  01                     TO W77-NTRANS-BNX.                246200      
006339    MOVE W77-NTRANS-BNX         TO HDR-NTRANS-CMP, HDR-NTRAN2-CMP.246300      
006340    ADD  01                     TO WKS-TIT-NUMARC.                246400      
006341    MOVE WKS-AMD-DD             TO HDR-DMES-CMP.                  246500      
006342    CHANGE ATTRIBUTE TITLE OF CMP-BANAM TO WKS-TIT-BNX.           246600      
006343    OPEN OUTPUT CMP-BANAM.                                        246700      
006344    ACCEPT WKS-HORA-PROCESO FROM TIME.                            246800      
006345    MOVE WKS-HORA-HM            TO HDR-HRE-CMP.                   246900      
006346    WRITE REG-BNX   FROM HDR-CMP.                                 247000      
006347                                                                  247100      
006348 1755-CREA-TR-BNX.                                                249200      
006349*----------------                                                 249300      
006350    ADD  1                      TO W77-NREG-BNX.                  249400      
006351    MOVE W77-NREG-BNX           TO TR-NSEC-CMP.                   249500      
006352    COMPUTE TR-TREG-CMP  = W77-NREG-BNX - 2.                      249600      
006353    MOVE W77-IMPT-BNX           TO TR-IMPT-CMP.                   249700      
006354    WRITE REG-BNX   FROM TR-CMP.                                  249800      
006355    CLOSE CMP-BANAM WITH SAVE.                                    249900      
006356    MOVE ZERO             TO W77-INTE-SNT                         249920      
006357    MOVE WKS-TIT-BNX TO WKS-INTE-ARCHIVO.                         249940      
006358    DISPLAY "ENVIA CMP INTELAR"                                   249950      
006359    PERFORM 030705-ENVIO-POR-INTELAR.                             249960      
006360    DISPLAY W77-INTE-SNT.                                         249980      
006361*   PERFORM 1855-ENVIA-BNX.                                       250000      
006362*** INI EAS 2023R03                                               250002      
0063631755-CREA-TR-EAS.                                                 250004      
006364*----------------                                                 250006      
006365   CLOSE L16-DATOS WITH SAVE.                                     250008      
006366   MOVE SPACES           TO WKS-INTE-ARCHIVO.                     250010      
006367   MOVE ZERO             TO W77-INTE-SNT.                         250012      
006368   MOVE WKS-TITLE-EAS-ARCHIVO TO WKS-INTE-ARCHIVO.                250014      
006369   PERFORM 030705-ENVIO-POR-INTELAR.                              250016      
006370*** FIN EAS 2023R03                                               250018      
006371**                                                                250100      
006372*** INI EXTNET 2023 R11                                           250105      
0063731755-CREA-TR-EXTNET.                                              250110      
006374*----------------                                                 250115      
006375   CLOSE L17-EXTNET WITH SAVE.                                    250120      
006376   MOVE SPACES           TO WKS-INTE-ARCHIVO.                     250125      
006377   MOVE ZERO             TO W77-INTE-SNT.                         250130      
006378   MOVE WKS-TITLE-EXTNET-ARCHIVO TO WKS-INTE-ARCHIVO.             250135      
006379   PERFORM 030705-ENVIO-POR-INTELAR.                              250140      
006380   CLOSE A05-AUTORIZACIONES WITH SAVE.                            250144      
006381*** FIN EXTNET 2023 R11                                           250145      
006382                                                                  250150      
006383 1855-ENVIA-BNX.                                                  250200      
006384*--------------                                                   250300      
006385    OPEN I-O CMP-BANAM.                                           250400      
006386    READ CMP-BANAM INTO HDR-CMP.                                  250500      
006387    COMPUTE HDR-LONG-CMP = 145 * W77-NREG-BNX.                    250600      
006388    WRITE REG-BNX   FROM HDR-CMP.                                 250700      
006389    CLOSE CMP-BANAM WITH SAVE.                                    250800      
006390    MOVE HDR-FEC-CMP            TO WKS-START-FEC.                 250900      
006391    MOVE W77-NTRANS-BNX         TO WKS-START-ARC.                 251000      
006392    IF WKS-NUMCSI = 04  MOVE "S151P102/" TO WKS-START-CSI         251100      
006393    ELSE                MOVE "S151P101/" TO WKS-START-CSI.        251200      
006394    CALL SYSTEM WFL USING WKS-TIT-WFL.                            251300      
006395**                                                                251400      
006396 1955-OTRO-ARCHBNX.                                               251500      
006397*------------------                                               251600      
006398    PERFORM 1755-CREA-TR-BNX.                                     251700      
006399    PERFORM 1555-CREA-HDR-BNX.                                    251800      
006400                                                                  251900      
006401*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
006402* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP002 ON CMEMP."         254700      
006403*                                      FROM 100000 TO 999999      254800      
006404                                                                  100000      
006405*----------------------------------------------------------------*100100      
006406*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
006407*----------------------------------------------------------------*100300      
006408 70000-CALCULA-ESPACIO.                                           100400      
006409*======================                                           100500      
006410     IF W77-FRAMESIZE             =   8                           100600      
006411        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
006412                                  /   6                           100800      
006413        IF WS-WORD-RES            >   ZEROS                       100900      
006414           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
006415                                  +   1                           101100      
006416        ELSE                                                      101200      
006417           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
006418     COMPUTE W77-MEMORY-65K  =   66000 * W77-MAXRECSIZE     .     101400      
006419                                                                  101402      
006420     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
006421                                  =   (W77-MAXRECSIZE + 3)        101600      
006422                                  *   (W77-LASTRECORD / 16)       101700      
006423                                  +   1500                       .101750      
006424                                                                  101770      
006425     IF W77-MEMORY-SIZE > 258435000                               101800      
006426        MOVE 258435000              TO W77-MEMORY-SIZE            101820      
006427     ELSE                                                         101850      
006428     IF W77-MEMORY-SIZE < 400000                                  101870      
006429        MOVE W77-MEMORY-65K         TO W77-MEMORY-SIZE.           101900      
006430                                                                  101990      
006431     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
006432                                  =  (W77-MAXRECSIZE + 3)         102100      
006433                                  *   W77-LASTRECORD              102200      
006434                                  *   3.5                        .102300      
006435                                                                  102400      
006436*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
006437                                                                  254900      
006438 950-TRANSF-ARCHIVOS.                                             255000      
006439*--------------------                                             255100      
006440    IF W77-SISTEMA-PARAMETRO = 264 AND WKS-NUMCSI = 04            255200      
006441       MOVE WKS-TIT-SALIDAFOTR TO WKS-ARCHIVO                     255300      
006442       CALL SYSTEM WFL USING WKS-COPY-L030                        255400      
006443       MOVE WKS-TIT-SALIDAFORE TO WKS-ARCHIVO                     255500      
006444       CALL SYSTEM WFL USING WKS-COPY-L030.                       255600      
006445                                                                  255700      
006446 030705-ENVIO-POR-INTELAR.                                        255800      
006447*======================                                           255900      
006448* PARA ENVIAR EL ARCHIVO POR INTELAR SE REQUIERE QUE LA VARIABLE  256000      
006449* WKS-INTE-ARCHIVO CONTENGA EL NOMBRE DEL ARCHIVO A ENVIAR        256100      
006450*==============================================================   256200      
006451    CALL "INTELARSND IN ADMONXFERS" USING  WKS-INTE-ARCHIVO       256300      
006452                                    GIVING W77-INTE-SNT.          256400      
006453    IF W77-INTE-SNT NOT = 0                                       256500      
006454       MOVE "E"                       TO TIPO-LJ                  256600      
006455       MOVE 020901                    TO CODIGO-LJ                256700      
006456       STRING "ERROR EN EL ENVIO POR INTELAR DEL ARCHIVO "        256800      
006457              WKS-INTE-ARCHIVO                                    256900      
006458       DELIMITED BY SIZE                                          257000      
006459       INTO TEXTO-LJ                                              257100      
006460       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.       257200      
006461                                                                  257300      
006462 030385-INTE-ARCHS440.                                            257400      
006463*=======================                                          257500      
006464     CHANGE ATTRIBUTE TITLE OF E04-FACTORAJE                      257600      
006465                            TO WKS-TITLE-S440.                    257700      
006466     OPEN INPUT E04-FACTORAJE.                                    257800      
006467     CHANGE ATTRIBUTE TITLE OF E04-FACTORAJE                      257900      
006468                            TO WKS-TITLE-CONLI-INTS440.           258000      
006469     CLOSE E04-FACTORAJE.                                         258100      
006470     UNSTRING WKS-TITLE-CONLI-INTS440 DELIMITED BY "."            258200      
006471         INTO WKS-INTE-ARCHIVO.                                   258300      
006472     PERFORM 030705-ENVIO-POR-INTELAR.                            258400      
006473     WAIT(60).                                                    258500      
006474     CHANGE ATTRIBUTE TITLE OF E04-FACTORAJE                      258600      
006475                            TO WKS-TITLE-CONLI-INTS440.           258700      
006476     OPEN INPUT E04-FACTORAJE.                                    258800      
006477     CHANGE ATTRIBUTE TITLE OF E04-FACTORAJE                      258900      
006478                            TO WKS-TITLE-S440.                    259000      
006479     CLOSE E04-FACTORAJE.                                         259100      
006480                                                                  259200      
006481*  240-CARGAR-DATOS-PG.                                           259300      
006482*====================                                             259400      
006483*     MOVE "|"                        TO  A02-PG-SEPA1            259500      
006484*                                         A02-PG-SEPA2            259600      
006485*                                         A02-PG-SEPA3            259700      
006486*                                         A02-PG-SEPA4            259800      
006487*                                         A02-PG-SEPA5            259900      
006488*                                         A02-PG-SEPA6            260000      
006489*                                         A02-PG-SEPA7            260100      
006490*                                         A02-PG-SEPA8            260200      
006491*                                         A02-PG-SEPA9            260300      
006492*                                         A02-PG-SEPA10           260400      
006493*                                         A02-PG-SEPA11           260500      
006494*                                         A02-PG-SEPA12           260600      
006495*                                         A02-PG-SEPA13           260700      
006496*                                         A02-PG-SEPA14           260800      
006497*                                         A02-PG-SEPA15           260900      
006498*                                         A02-PG-SEPA16.          261000      
006499*                                                                 261100      
006500*     MOVE A00-R01-FECMOV              TO A02-PG-FECMOV.          261200      
006501*     MOVE A00-R01-HORMOV              TO A02-PG-HORMOV.          261400      
006502*     MOVE A00-R01-CVETRAN(W77-IND)    TO A02-PG-CVETRAN.         261500      
006503*     MOVE A00-R01-SUC-INIC            TO A02-PG-SUC-INIC.        261600      
006504*     MOVE A00-R01-MONEDA              TO A02-PG-MONEDA.          261700      
006505*     MOVE A00-R01-MDA-SUC             TO A02-PG-MDA-SUC.         261800      
006506*     MOVE A00-R01-MDA-CTA             TO A02-PG-MDA-CTA.         261900      
006507*     MOVE A00-R01-STATUS              TO A02-PG-STATUS.          262000      
006508*     MOVE A00-R01-AUTORIZA            TO A02-PG-AUTORIZA.        262100      
006509*     MOVE A00-R01-IMPORTE(W77-IND)    TO A02-PG-IMPORTE.         262200      
006510*     MOVE A00-R01-BCO-ORI             TO A02-PG-BCO-ORI.         262300      
006511*     MOVE A00-R01-BCO-DES             TO A02-PG-BCO-DES.         262400      
006512*     MOVE A00-R01-CVECAUSA            TO A02-PG-CVECAUSA.        262500      
006513*     MOVE A00-R01-CAJA-INIC           TO A02-PG-CAJA-INIC.       262600      
006514*     MOVE A00-R01-CLIENTE             TO A02-PG-CLIENTE.         262700      
006515*     IF A00-R01-APUDES = 0                                       262800      
006516*        MOVE SPACES                   TO A02-PG-NOM-BENEF-IDEN   262900      
006517*     ELSE                                                        263000      
006518*        MOVE A01-R01-NOMB-BENEF       TO A02-PG-NOM-BENEF-IDEN.  263100      
006519*     WRITE A01-REG-PG-ARCHIVO.                                   263200      
006520*    MOVE  SPACES                     TO A01-REG-PG-ARCHIVO.      263300      
006521                                                                  263400      
006522 240-CARGAR-DATOS-TLM .                                           263500      
006523*======================                                           263600      
006524     MOVE "|"                        TO A01-TLM-SEPA1             263700      
006525                                        A01-TLM-SEPA2             263800      
006526                                        A01-TLM-SEPA3             263900      
006527                                        A01-TLM-SEPA4             264000      
006528                                        A01-TLM-SEPA5             264100      
006529                                        A01-TLM-SEPA6             264200      
006530                                        A01-TLM-SEPA7             264300      
006531                                        A01-TLM-SEPA8             264400      
006532                                        A01-TLM-SEPA9             264500      
006533                                        A01-TLM-SEPA10            264600      
006534                                        A01-TLM-SEPA11            264700      
006535                                        A01-TLM-SEPA12            264800      
006536                                        A01-TLM-SEPA13            264900      
006537                                        A01-TLM-SEPA14            265000      
006538                                        A01-TLM-SEPA15.           265100      
006539                                                                  265200      
006540     MOVE "L"                        TO A01-TLM-LEDGER.           265300      
006541     MOVE A00-R01-FECMOV             TO WS-FEC-SSAAMMDD.          265400      
006542     MOVE WS-FEC-AAMMDD              TO A01-TLM-FECOPERACION.     265500      
006543     MOVE 0                          TO A01-TLM-SALDOINICIAL.     265600      
006544     MOVE A00-R01-FECMOV             TO WS-FEC-SSAAMMDD.          265700      
006545     MOVE WS-FEC-AAMMDD              TO A01-TLM-FECSALDOINI.      265800      
006546     MOVE "C"                        TO A01-TLM-INDSALDOINI.      265900      
006547     MOVE SPACES                     TO A01-TLM-INDTRANS.         266000      
006548     IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 1                 266100      
006549        MOVE "D"                     TO A01-TLM-INDTRANS.         266200      
006550     IF WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND)) = 2                 266300      
006551        MOVE "C"                     TO A01-TLM-INDTRANS.         266400      
006552     MOVE A00-R01-IMPORTE(W77-IND)   TO A01-TLM-MONTOTRANS.       266500      
006553     MOVE 0                          TO A01-TLM-SALDOFINAL        266600      
006554     MOVE A00-R01-FECMOV             TO WS-FEC-SSAAMMDD.          267000      
006555     MOVE WS-FEC-AAMMDD              TO A01-TLM-FECSALDOFIN.      267100      
006556     MOVE "C"                        TO A01-TLM-INDSALDOFIN.      267200      
006557     MOVE A00-R01-FECMOV             TO WS-FEC-SSAAMMDD.          267300      
006558     MOVE WS-FEC-AAMMDD              TO A01-TLM-FECCREATRANS.     267400      
006559     MOVE A00-R01-AUTORIZA           TO A01-TLM-AUTORIZA.         267500      
006560     MOVE A00-R01-MDA-SUC            TO A01-TLM-PREFIJOMEDACC.    267600      
006561     MOVE A00-R01-MDA-CTA            TO A01-TLM-MEDIOACCESO.      267700      
006562     MOVE "USD"                      TO A01-TLM-INDMONEDA         267800      
006563     WRITE A01-REG-TLM-ARCHIVO.                                   267900      
006564     MOVE SPACES                     TO A01-REG-TLM-ARCHIVO.      268000      
006565                                                                  268100      
006566 210-MUEVE-DATOS-PG.                                              268200      
006567    IF (A00-R01-CVETRAN (W77-IND) = 2227 OR 1134 OR 1137)         268300      
006568    AND A00-R01-MONEDA = 5                                        268400      
006569*          PERFORM 240-CARGAR-DATOS-PG                            268500      
006570          PERFORM 240-CARGAR-DATOS-TLM.                           268600      
006571                                                                  268700      
006572 400-LEE-DATOS-ADIC2.                                             268800      
006573   IF A01-R01-APUDES > 0                                          268900      
006574       MOVE 0 TO W77-EXISTE-ADIC2                                 269000      
006575      COMPUTE W77-NUM-REG = A01-R01-APUDES + 1                    269100      
006576      READ L02-DATOS INTO A01-R02-TESOFE                          269200      
006577           INVALID KEY                                            269300      
006578      MOVE 1              TO W77-EXISTE-ADIC2.                    269400      
006579                                                                  269500      
006580 100000-SELECCIONA-PORTA.                                         269600      
006581*========================                                         269700      
006582    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1                 269800      
006583       MOVE LOW-VALUES               TO E06-PORTPG-DET-IND        269900      
006584*       PERFORM 400-LEE-DATOS-ADIC                                270000      
006585       PERFORM 110000-VALIDA-CVE                                  270100      
006586               VARYING W77-IND FROM 1 BY 1                        270200      
006587               UNTIL   W77-IND > 5 OR                             270300      
006588               A00-R01-CVETRAN(W77-IND) = 0.                      270400      
006589                                                                  270500      
006590 110000-VALIDA-CVE.                                               270600      
006591*==================                                               270700      
006592   IF WKS-CVE-PORTA(A00-R01-CVETRAN(W77-IND)) = 9                 270800      
006593      PERFORM 111000-MUEVE-DET-PORTA.                             270900      
006594                                                                  271000      
006595  111000-MUEVE-DET-PORTA.                                         271100      
006596*======================                                           271200      
006597    IF A00-R01-APUDES > 0                                         271300      
006598       MOVE A01-R01-BCO-CTA-TRASP  TO E06-PORTPG-DET-BANCO-DEST   271400      
006599    ELSE                                                          271500      
006600       MOVE 0                      TO E06-PORTPG-DET-BANCO-DEST.  271600      
006601    MOVE 3                         TO E06-PORTPG-DET-TIPO.        271700      
006602    ADD 1                          TO E06-PORTPG-TRA-NUMA.        271800      
006603    MOVE A00-R01-CVETRAN(W77-IND)  TO E06-PORTPG-DET-CVET.        271900      
006604    MOVE A00-R01-MDA-CTA           TO E06-PORTPG-DET-NUMC.        272000      
006605    MOVE A00-R01-MDA-SUC           TO E06-PORTPG-DET-NUMS.        272100      
006606    MOVE 0                         TO E06-PORTPG-DET-CLABE-CER.   272200      
006607    MOVE A01-R01-NUM-CTA-TRASP     TO E06-PORTPG-DET-CLABE.       272300      
006608    PERFORM 112600-VALIDA-CUENTA.                                 272400      
006609    MOVE A00-R01-CVEMDA            TO E06-PORTPG-DET-TIP-CTA-BEN. 272500      
006610    WRITE R06-PORTPG-INTELAR FROM E06-PORTPG-DET-IND.             272600      
006611                                                                  272700      
006612 112600-VALIDA-CUENTA.                                            272800      
006613*=====================                                            272900      
006614      IF A00-R01-MDA-CTA = 0                                      273000      
006615         MOVE 0                      TO R422-61-CTR-ERROR         273100      
006616         MOVE LOW-VALUES             TO S422-61-CTR-SALIDA        273200      
006617                                        E422-61-CTR-ENTRADA       273300      
006618         MOVE 0000                   TO E422-61-CTA-NUMPREF       273400      
006619         MOVE A00-R01-CONTRATO       TO E422-61-CTA-NUM           273500      
006620         MOVE A00-R01-PRODUCTO       TO E422-61-CTA-NUMPROD       273600      
006621         MOVE A00-R01-INSTRUMENTO    TO E422-61-CTA-CVEINST       273700      
006622         MOVE 1                      TO E422-61-MDA-CVETIPO       273800      
006623         MOVE 00                     TO E422-61-OPCION            273900      
006624         MOVE 0                      TO E422-61-CTR-NUMCSI        274000      
006625                                        E422-61-CTE-NUM           274100      
006626         CALL "S016_L422_CTAMEDIO IN S016L422"                    274200      
006627              USING    E422-61-CTR-ENTRADA                        274300      
006628                       S422-61-CTR-SALIDA                         274400      
006629              GIVING   R422-61-CTR-ERROR                          274500      
006630                                                                  274600      
006631         IF R422-61-CTR-ERROR = 0                                 274700      
006632            MOVE S422-61-MDA-NUM      TO      E06-PORTPG-DET-NUMC 274800      
006633            MOVE S422-61-MDA-NUMPREF  TO      E06-PORTPG-DET-NUMS 274900      
006634         ELSE                                                     275000      
006635            MOVE 0                    TO      E06-PORTPG-DET-NUMC 275100      
006636                                              E06-PORTPG-DET-NUMS.275200      
006637*** INI EXTNET 2023 R11                                           275250      
006638 230-DATOS-EXTNET.                                                275300      
006639    IF A00-R01-APUDES > 0 AND A01-R01-APUDES > 0                  276000      
006640       AND W77-EXISTE-INX = 0                                     277000      
006641       PERFORM 400-LEE-DATOS-ADIC2                                278000      
006642       IF W77-EXISTE-ADIC2 = 0                                    279000      
006643          IF A01-R02-IND-EXTNET = 3 AND (A00-R01-MONEDA = 1 OR 5) 280000      
006644          PERFORM 400-GRABA-AUTORIZA                              280500      
006645          PERFORM 400-GRABA-DETALLE-EXTNET  VARYING W77-IND FROM 1281000      
006646            BY 1 UNTIL W77-IND >5 OR A00-R01-CVETRAN (W77-IND) = 0281500      
006647          ELSE                                                    282000      
006648             NEXT SENTENCE                                        283000      
006649       ELSE                                                       284000      
006650          NEXT SENTENCE.                                          285000      
006651 400-GRABA-AUTORIZA.                                              285200      
006652    MOVE A00-R01-AUT-S151         TO R01-REG-AUTS500EXT           285400      
006653    WRITE R01-REG-AUTORIZA.                                       285600      
006654 400-GRABA-DETALLE-EXTNET.                                        286000      
006655    MOVE ZEROS                       TO W77-AFC.                  287000      
006656    IF A00-R01-CVETRAN(W77-IND) > 0 AND A00-R01-CVETRAN(W77-IND)  288000      
006657                                         < 5001                   289000      
006658    MOVE WKS-CVE-AFC(A00-R01-CVETRAN(W77-IND))  TO W77-AFC.       290000      
006659    IF A00-R01-FUNCION = 1                                        290500      
006660       MOVE A00-R01-AUT-S151         TO 500-R02-SECDET            291000      
006661    ELSE                                                          291200      
006662       MOVE A00-R01-AUT-AELIM-S151   TO 500-R02-SECDET.           291400      
006663    MOVE A00-R01-FUNCION             TO 500-R02-FUNCION.          292000      
006664    MOVE A00-R01-SUCOPER             TO 500-R02-SUCOPE.           293000      
006665    MOVE A00-R01-CAJAOPER            TO 500-R02-CAJOPE.           294000      
006666    MOVE A00-R01-SUCTRAN             TO 500-R02-SUCTRA.           295000      
006667    MOVE A00-R01-CAJATRAN            TO 500-R02-CAJTRA.           296000      
006668    MOVE A00-R01-AUTORIZA            TO 500-R02-NUMAUT.           297000      
006669    MOVE A00-R01-CVETRAN(W77-IND)    TO 500-R02-CVETRA.           298000      
006670    MOVE W77-AFC                     TO 500-R02-TIPMOV.           299000      
006671    MOVE A00-R01-CVEMDA              TO 500-R02-TIPMDA.           300000      
006672    IF 500-R02-TIPMDA = 0                                         301000      
006673       MOVE A00-R01-SUCPROM          TO 500-R02-PREFSUC           302000      
006674       MOVE A00-R01-CONTRATO         TO 500-R02-CTOCTA            303000      
006675    ELSE                                                          304000      
006676    IF 500-R02-TIPMDA = 1                                         305000      
006677       MOVE A00-R01-MDA-SUC          TO 500-R02-PREFSUC           306000      
006678       MOVE A00-R01-MDA-CTA          TO 500-R02-CTOCTA            307000      
006679    ELSE                                                          308000      
006680    IF 500-R02-TIPMDA = 2                                         309000      
006681       MOVE A00-R01-MDA-CTA          TO 500-R02-MEDACC.           310000      
006682    MOVE A00-R01-IMPORTE(W77-IND)    TO 500-R02-IMPTRAN.          311000      
006683    MOVE A00-R01-MONEDA              TO 500-R02-MONEDA.           312000      
006684    MOVE A00-R01-REFNUM              TO 500-R02-REFNUM.           313000      
006685    MOVE A00-R01-FECMOV              TO 500-R02-FECMOV.           314000      
006686    MOVE A00-R01-HORMOV              TO WKS-HR.                   315000      
006687    MOVE WKS-HH                      TO WKS-HH-LOG.               315200      
006688    MOVE WKS-MM                      TO WKS-MM-LOG.               315400      
006689    MOVE WKS-SS                      TO WKS-SS-LOG.               315600      
006690    MOVE ":"                         TO WKS-PUNTOS                315650      
006691                                        WKS-PUNTOS2.              315700      
006692    MOVE WKS-HR-LOG                  TO 500-R02-HOVMOV.           315800      
006693    MOVE A00-R01-FECCONT             TO 500-R02-FECCONT.          316000      
006694    MOVE A00-R01-ORIGEN              TO 500-R02-ORIGEN.           317000      
006695    MOVE A00-R01-AUT-S151            TO 500-R02-AUT-S151.         318000      
006696    MOVE A00-R01-AUT-AELIM-S151      TO 500-R02-AUT-AELIM-S151.   319000      
006697    MOVE A00-R01-TIPO-PROC           TO 500-R02-TIP-PROC.         320000      
006698    MOVE A00-R01-INDLEY(W77-IND)     TO 500-R02-IND-LEY.          321000      
006699    IF W77-IND = 1                                                322000      
006700       MOVE A01-R01-LEY1             TO 500-R02-LEYENDA           323000      
006701    ELSE                                                          324000      
006702    IF W77-IND = 2                                                325000      
006703       MOVE A01-R02-LEY2             TO 500-R02-LEYENDA           326000      
006704    ELSE                                                          327000      
006705    IF W77-IND = 3                                                328000      
006706       MOVE A01-R02-LEY3            TO 500-R02-LEYENDA            329000      
006707    ELSE                                                          330000      
006708    IF W77-IND = 4                                                331000      
006709       MOVE A01-R02-LEY4             TO 500-R02-LEYENDA           332000      
006710    ELSE                                                          333000      
006711    IF W77-IND = 5                                                334000      
006712       MOVE A01-R02-LEY5             TO 500-R02-LEYENDA.          335000      
006713    IF 500-R02-LEYENDA NOT = SPACES                               335200      
006714       INSPECT 500-R02-LEYENDA REPLACING ALL WKS-NULO BY " ".     335400      
006715    IF A01-R01-REFERENCIA1 NOT = SPACES                           335600      
006716       MOVE A01-R01-REFERENCIA1         TO 500-R02-REF-ALFANUM    336000      
006717       INSPECT 500-R02-REF-ALFANUM REPLACING ALL WKS-NULO BY " ". 336500      
006718    MOVE A00-R01-SIST-ORIG           TO 500-R02-SIS-ORIG.         337000      
006719    MOVE A00-R01-STATUS              TO 500-R02-STATUS.           338000      
006720    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1 AND W77-AFC = 1 339000      
006721       MOVE "MOVIMIENTO APLICADO DE CARGO" TO 500-R02-DESC-STAMOV 340000      
006722       IF A00-R01-MONEDA = 1                                      341000      
006723          ADD 1 TO WKS-NUM-CARG-NAC                               342000      
006724          COMPUTE WKS-IMP-CARG-NAC =                              343000      
006725                  WKS-IMP-CARG-NAC + 500-R02-IMPTRAN              344000      
006726       ELSE                                                       345000      
006727          ADD 1 TO WKS-NUM-CARG-DOLL                              346000      
006728          COMPUTE WKS-IMP-CARG-DOLL =                             347000      
006729                  WKS-IMP-CARG-DOLL + 500-R02-IMPTRAN             348000      
006730    ELSE                                                          349000      
006731    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS= 1 AND W77-AFC = 2  350000      
006732       MOVE "MOVIMIENTO APLICADO DE ABONO" TO 500-R02-DESC-STAMOV 351000      
006733       IF A00-R01-MONEDA = 1                                      352000      
006734          ADD 1 TO WKS-NUM-ABON-NAC                               353000      
006735          COMPUTE WKS-IMP-ABON-NAC =                              354000      
006736                  WKS-IMP-ABON-NAC + 500-R02-IMPTRAN              355000      
006737       ELSE                                                       356000      
006738          ADD 1 TO WKS-NUM-ABON-DOLL                              357000      
006739          COMPUTE WKS-IMP-ABON-DOLL =                             358000      
006740                  WKS-IMP-ABON-DOLL + 500-R02-IMPTRAN             359000      
006741    ELSE                                                          360000      
006742    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS= 1 AND W77-AFC = 9  361000      
006743       MOVE "MOVIMIENTO APLICADO NO CONTA" TO 500-R02-DESC-STAMOV 362000      
006744       IF A00-R01-MONEDA = 1                                      363000      
006745          ADD 1 TO WKS-NUM-NCON-NAC                               364000      
006746       ELSE                                                       365000      
006747           ADD 1 TO WKS-NUM-NCON-DOLL                             366000      
006748    ELSE                                                          367000      
006749    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 1 368000      
006750       MOVE "MOVIMIENTO ELIMINADO DE CARGO"                       369000      
006751                                           TO 500-R02-DESC-STAMOV 370000      
006752       IF A00-R01-MONEDA = 1                                      371000      
006753          ADD 1 TO WKS-NUM-ELIM-CARG-NAC                          372000      
006754          COMPUTE WKS-IMP-ELIM-CARG-NAC =                         373000      
006755                  WKS-IMP-ELIM-CARG-NAC + 500-R02-IMPTRAN         374000      
006756       ELSE                                                       375000      
006757          ADD 1 TO WKS-NUM-ELIM-CARG-DOLL                         376000      
006758          COMPUTE WKS-IMP-ELIM-CARG-DOLL =                        377000      
006759                  WKS-IMP-ELIM-CARG-DOLL + 500-R02-IMPTRAN        378000      
006760    ELSE                                                          379000      
006761    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS> 1 AND W77-AFC = 2  380000      
006762       MOVE "MOVIMIENTO ELIMINADO DE ABONO"                       381000      
006763                                           TO 500-R02-DESC-STAMOV 382000      
006764       IF A00-R01-MONEDA = 1                                      383000      
006765          ADD 1 TO WKS-NUM-ELIM-ABON-NAC                          384000      
006766          COMPUTE WKS-IMP-ELIM-ABON-NAC =                         385000      
006767                  WKS-IMP-ELIM-ABON-NAC + 500-R02-IMPTRAN         386000      
006768       ELSE                                                       387000      
006769          ADD 1 TO WKS-NUM-ELIM-ABON-DOLL                         388000      
006770          COMPUTE WKS-IMP-ELIM-ABON-DOLL =                        389000      
006771                  WKS-IMP-ELIM-ABON-DOLL + 500-R02-IMPTRAN        390000      
006772    ELSE                                                          391000      
006773    IF A00-R01-FUNCION = 1 AND A00-R01-STATUS > 1 AND W77-AFC = 9 392000      
006774       MOVE "MOVIMIENTO ELIMINADO NO CONTA"                       393000      
006775                                          TO 500-R02-DESC-STAMOV  394000      
006776       IF A00-R01-MONEDA = 1                                      395000      
006777          ADD 1 TO WKS-NUM-ELIM-NCON-NAC                          396000      
006778       ELSE                                                       397000      
006779           ADD 1 TO WKS-NUM-ELIM-NCON-DOLL                        398000      
006780    ELSE                                                          398500      
006781    IF A00-R01-FUNCION = 2 AND W77-AFC = 1                        399000      
006782       MOVE "MOVIMIENTO ELIMINADO DE CARGO"                       400000      
006783                                           TO 500-R02-DESC-STAMOV 401000      
006784    ELSE                                                          402000      
006785    IF A00-R01-FUNCION = 2 AND W77-AFC = 2                        403000      
006786       MOVE "MOVIMIENTO ELIMINADO DE ABONO"                       404000      
006787                                           TO 500-R02-DESC-STAMOV 405000      
006788    ELSE                                                          406000      
006789    IF A00-R01-FUNCION = 2 AND W77-AFC = 9                        407000      
006790       MOVE "MOVIMIENTO ELIMINADO NO CONTA"                       408000      
006791                                          TO 500-R02-DESC-STAMOV. 409000      
006792    MOVE A00-R01-SISTEMA             TO 500-R02-SISTEMA.          410000      
006793    MOVE A00-R01-PRODUCTO            TO 500-R02-PRODUCTO.         411000      
006794    MOVE A00-R01-INSTRUMENTO         TO 500-R02-INSTRUMENTO.      412000      
006795    WRITE L17-DAT-EXTNET FROM 500-R02-DET-CLIENTESCITID.          413000      
006796100-ABRE-ARCHEXTNET.                                              413100      
006797*-----------------                                                413200      
006798    IF W88-HOSTNAME                                               413300      
006799       CHANGE ATTRIBUTE TITLE OF L17-EXTNET                       413400      
006800                              TO WKS-TITLE-EXTNET-ARCHIVO         413500      
006801       OPEN OUTPUT L17-EXTNET                                     413600      
006802       CHANGE ATTRIBUTE TITLE OF A05-AUTORIZACIONES               413650      
006803                              TO WKS-TIT-AUTORIZA                 413700      
006804       OPEN OUTPUT A05-AUTORIZACIONES                             413750      
006805       CLOSE A05-AUTORIZACIONES        WITH SAVE                  413800      
006806       OPEN I-O A05-AUTORIZACIONES.                               413805      
006807                                                                  413810      
006808 400050-VALIDACION-ELIM-EXTNET.                                   413820      
006809*===================================                              413830      
006810    MOVE 1                           TO W77-ELIMINA-EXT.          413840      
006811                                                                  413842      
006812    MOVE A00-R01-AUT-AELIM-S151      TO R01-REG-AUTS500EXT.       413860      
006813    READ A05-AUTORIZACIONES                                       413870      
006814         INVALID KEY                                              413880      
006815            MOVE ZERO                TO W77-ELIMINA-EXT.          413890      
006816*** FIN EXTNET 2023 R11                                           414000      
