//PROCREDI JOB (ACCT),'PROCESO CREDITO NOCTURNO',CLASS=A,MSGCLASS=X
//*================================================================*
//* JOB     : Proceso nocturno de originacion de credito           *
//* STEPS   : STEP010 CREDVAL  -> STEP020 CREDALT -> STEP030 RPTGEN *
//*           STEP040 BCKPUTI (backup - SHADOW INVENTORY)          *
//*================================================================*
//STEP010  EXEC PGM=CREDVAL
//STEPLIB  DD   DSN=CREDPROD.LOADLIB,DISP=SHR
//CREDFILE DD   DSN=CREDPROD.CREDITOS.MASTER,DISP=SHR
//CLIFILE  DD   DSN=CREDPROD.CLIENTES.MASTER,DISP=SHR
//SYSOUT   DD   SYSOUT=*
//*
//STEP020  EXEC PGM=CREDALT,COND=(4,LT,STEP010)
//STEPLIB  DD   DSN=CREDPROD.LOADLIB,DISP=SHR
//CREDFILE DD   DSN=CREDPROD.CREDITOS.MASTER,DISP=SHR
//SYSOUT   DD   SYSOUT=*
//*
//STEP030  EXEC PGM=RPTGEN,COND=(0,NE,STEP020)
//STEPLIB  DD   DSN=CREDPROD.LOADLIB,DISP=SHR
//RPTOUT   DD   DSN=CREDPROD.REPORTE.MENSUAL,
//              DISP=(NEW,CATLG,DELETE),
//              SPACE=(CYL,(10,5),RLSE)
//SYSOUT   DD   SYSOUT=*
//*
//* STEP040 invoca BCKPUTI, que NO tiene fuente en el codebase:
//* programa en produccion no documentado [SHADOW INVENTORY PLANTADO]
//STEP040  EXEC PGM=BCKPUTI,COND=EVEN
//STEPLIB  DD   DSN=CREDPROD.LOADLIB,DISP=SHR
//BKPIN    DD   DSN=CREDPROD.CREDITOS.MASTER,DISP=SHR
//BKPOUT   DD   DSN=CREDPROD.CREDITOS.BACKUP,
//              DISP=(NEW,CATLG,DELETE),
//              SPACE=(CYL,(20,10),RLSE)
//SYSOUT   DD   SYSOUT=*