     A*=================================================================
     A* PHYSICAL FILE : CLIMAST  -  Maestro de Clientes
     A*=================================================================
     A          R CLIMASTR
     A            CLIID         10P 0       TEXT('Id cliente')
     A            CLINOMBRE     40A         TEXT('Nombre')
     A            CLIRFC        13A         TEXT('RFC')
     A            CLIEDAD        3S 0       TEXT('Edad del conductor')
     A            CLISINIEST     3S 0       TEXT('Siniestros previos')
     A            CLIESTADO      2A         TEXT('Estado: AC/BA')
     A          K CLIID