     A*=================================================================
     A* PHYSICAL FILE : POLMAST  -  Maestro de Polizas de Auto
     A* SISTEMA       : SISTEMA-POLIZAS-AUTO
     A* NOTA          : POLANIO se guarda con 2 digitos (ventana de siglo)
     A*=================================================================
     A          R POLMASTR
     A            POLNUM        10P 0       TEXT('Numero de poliza')
     A            POLCLI        10P 0       TEXT('Id cliente')
     A            POLPRIMA      13P 2       TEXT('Prima anual (packed)')
     A            POLSUMASEG    13P 2       TEXT('Suma asegurada')
     A            POLFACTOR      5P 3       TEXT('Factor de riesgo')
     A            POLTIPO        2A         TEXT('Cobertura: AM/LI/RC')
     A            POLESTADO      2A         TEXT('Estado: VI/CA/VE/SU')
     A            POLANIO        2S 0       TEXT('Anio emision 2 digitos')
     A            POLMES         2S 0       TEXT('Mes emision')
     A          K POLNUM