000001$SET LIST LINEINFO                                                000100      
000002$SET LISTOMITTED                                                  000200      
000003$SET OLDCODE                                                      000300      
000004$SET LIST MAPINFO XREF LINEINFO ERRORLIMIT=5                      000400      
000005*$SET TADS                                                        000600      
000006******************************************************************000700      
000007*  PROGRAMA QUE ACTUALIZA LA BASE DE DATOS CREANDO UN REGISTRO   *000800      
000008*  ACUMULADO POR PRODUCTO, INSTRUMENTO, MONEDA DONDE SE ACUMULAN *000900      
000009*  EL IMPORTE DE LOS CARGOS Y EL IMPORTE DE LOS ABONOS, HACIENDO *001000      
000010*  UNA ACTUALIZACION CADA 10 MINUTOS, SE LEVANTARA UNA COPIA POR *001100      
000011*  CADA SISTEMA QUE SE REQUIERA.  *                              *001200      
000012*                                                                *001300      
000013*                                                                *001400      
000014*  RECOMPILACION POR EL UPGRADE DEL MCP A 55                     *001410      
000015*  20141208 15MTP001 MJGRG                                       *001412      
000016*  RECOMPILACION POR EL UPGRADE DEL MCP A 62                     *001500      
000017*  20231130 23MTP003 CLLC                                        *001550      
000018******************************************************************001600      
000019 IDENTIFICATION DIVISION.                                         001700      
000020 PROGRAM-ID.      P016.                                           001800      
000021 AUTHOR.          FSW.                                            001900      
000022 INSTALLATION.    BANAMEX.                                        002000      
000023 ENVIRONMENT DIVISION.                                            002100      
000024 INPUT-OUTPUT SECTION.                                            002200      
000025 FILE-CONTROL.                                                    002300      
000026 SELECT L01-DATOS    ASSIGN TO DISK                               002400      
000027                     ORGANIZATION IS SEQUENTIAL                   002500      
000028                     ACCESS MODE  IS RANDOM                       002510      
000029                     ACTUAL KEY   IS W77-LLAVE.                   002520      
000030                                                                  002600      
000031 SELECT L02-DATOS    ASSIGN TO DISK                               002700      
000032                     ORGANIZATION IS SEQUENTIAL                   002800      
000033                     ACCESS MODE  IS RANDOM                       002900      
000034                     ACTUAL KEY   IS W77-LLAVE.                   003000      
000035                                                                  003100      
000036 DATA DIVISION.                                                   003200      
000037 FILE SECTION.                                                    003300      
000038*                                                                 003400      
000039 FD L01-DATOS                                                     003500      
000040    VALUE OF MAXRECSIZE   IS 75                                   003600      
000041             FRAMESIZE    IS 48                                   003700      
000042    VALUE OF BUFFERS      IS 1                                    003800      
000043    VALUE OF TITLE        IS WKS-TIT-LOG151                       003900      
000044    BLOCK CONTAINS 145 RECORDS.                                   004000      
000045                                                                  004100      
000046 01  L01-DAT                    PIC X(450).                       004200      
000047*                                                                 004300      
000048 FD L02-DATOS                                                     004400      
000049    VALUE OF MAXRECSIZE   IS 75                                   004500      
000050             FRAMESIZE    IS 48                                   004600      
000051    VALUE OF BUFFERS      IS 1                                    004700      
000052    VALUE OF TITLE        IS WKS-TIT-LOG151                       004800      
000053    BLOCK CONTAINS 2 RECORDS.                                     004900      
000054                                                                  005000      
000055 01  L02-DAT-ELIM               PIC X(450).                       005100      
000056*                                                                 005200      
000057 DATA-BASE SECTION.                                               005300      
000058*------------------                                               005400      
000059 DB BIFINDB = S151BD13BIFIN.                                      005500      
000060                                                                  005600      
000061 WORKING-STORAGE SECTION.                                         005700      
000062*------------------------                                         005800      
000063 77 W77-OPEN                           PIC 9(02).                 005810      
000064 88 W88-NO-OPEN                        VALUE 0.                   005820      
000065 88 W88-OPEN                           VALUE 1.                   005830      
000066                                                                  005840      
000067 77 W77-VECES                          PIC 9(02).                 005850      
000068 77 W77-DMS-CAT                        PIC 9(03).                 005860      
000069 77 W77-DMS-ERROR                      PIC 9(04).                 005862      
000070                                                                  005864      
000071 77 W77-TOT-CVES                       PIC 9(06).                 005870      
000072 77 W77-ENCONTRE                       PIC 9.                     005900      
000073    88 W88-ENCONTRE                    VALUE 1.                   006000      
000074 77 W77-FIN                            PIC 9(02).                 006010      
000075 77 W77-ERROR                          PIC 9(02).                 006020      
000076 77 W77-FIN-TABLA                      PIC 9.                     006300      
000077    88 W88-FIN-TAB                     VALUE 1.                   006400      
000078 77 W77-NO-ERROR                       PIC 9.                     006500      
000079    88 W88-NO-ERROR                    VALUE 0.                   006600      
000080 77 W77-NOERROR-LOG                    PIC 9.                     006700      
000081    88 W88-NOERROR-LOG                 VALUE 0.                   006800      
000082 77 W77-PRDYINSTMC                     PIC 9.                     006900      
000083 77 W77-END-LOGS                       PIC 9     VALUE 0.         007300      
000084 77 W77-FIN-CVES                       PIC 9     VALUE 0.         007500      
000085 77 W77-LLAVE                          PIC 9(08) VALUE 0.         007700      
000086 77 W77-LLAVE-AUX                      PIC 9(08) VALUE 0.         007800      
000087 77 W77-IND-SIST                       PIC 9(02).                 007900      
000088 77 W77-TIME                           PIC 9(04) COMP VALUE 5.    008000      
000089 77 W77-TIEMPO-ESPERA                  PIC 9(03) COMP.            008050      
000090 77 W77-INDICE                         PIC 9(06) VALUE 0.         008100      
000091 77 W77-NIV-BASE                       PIC 9(10) VALUE 0.         008200      
000092 77 W77-NUM-CSI                        PIC 9(02).                 008300      
000093 77 W77-NUMERO-MIX                     PIC 9(07).                 008500      
000094 77 W77-CAMPO-DISPLAY                  PIC 9(12).                 008600      
000095 77 WKS-IERR                           PIC 9(01) VALUE 0.         008700      
000096 77 WKS-ULT-SIRH                       PIC 9(04) VALUE 0.         009300      
000097 77 WKS-ULT-CPAE                       PIC 9(04) VALUE 0.         009400      
000098 77 WKS-ULT-TRANS                      PIC 9(04) VALUE 0.         009500      
000099 77 WS-CAT-REG-INI                     PIC 9(06) VALUE 0.         009600      
000100 77 TOT-CAT-REGS                       PIC 9(06) VALUE 0.         009700      
000101 77 WS-CAT-S-IND                       PIC 9(02) VALUE 0.         009800      
000102 77 TAB-IND                            PIC 9(08) VALUE 0.         009900      
000103 77 W77-IND                            PIC 9(04) VALUE ZERO.      009910      
000104 77 WKS-CVE-TRANS                      PIC 9(06) COMP.            010100      
000105 77 WS-PIM                             PIC 9(06).                 010200      
000106 77 WKS-PIM                            PIC 9(06).                 010300      
000107 77 WKS-IMPORTE-ABON                   PIC 9(16)V99.              010400      
000108 77 WKS-IMPORTE-CARG                   PIC 9(16)V99.              010500      
000109 77 W-CAT-ULT-FECINI                   PIC 9(06) COMP VALUE 0.    010600      
000110 77 W-CAT-ULT-NINI                     PIC 9(02) VALUE 0.         010800      
000111 77 WKS-BAND-INCR                      PIC 9(02) VALUE 0.         010900      
000112 77 WKS-IND-TAB                        PIC 9(08) VALUE 0.         011000      
000113 77 W77-OK                             PIC 9     VALUE 0.         011100      
000114 77 W77-TRANSACCIONES                  PIC 9(04) VALUE 0.         011310      
000115 77 WKS-CEPAE                          PIC 9(04).                 011400      
000116 77 WKS-IND-CPAE                       PIC 9(08) VALUE 0.         011600      
000117 01 WKS-HORA-INICIO                    PIC 9(06) VALUE 040000.    011650      
000118 01 WKS-HORA-LIMITE                    PIC 9(06) VALUE 200000.    011700      
000119 01 WKS-HORA-LIMITE-R REDEFINES WKS-HORA-LIMITE.                  011710      
000120    03 WKS-HH-MM                       PIC X(04).                 011720      
000121    03 WKS-SS                          PIC X(02).                 011730      
000122 77 W77-SW-FIN                         PIC 9(01) VALUE 0.         011800      
000123 77 WS-NUMOCURR                        PIC 9(02).                 011900      
000124 77 W77-EXISTE                         PIC 9(01) VALUE 0.         012000      
000125 77 W77-AUT-ANT                        PIC 9(08) VALUE 0.         012100      
000126 01 WKS-ULT-PRODX                      PIC X(12).                 012200      
000127 01 WKS-ULT-PROD REDEFINES WKS-ULT-PRODX.                         012300      
000128    02  WKS-ULT-PRD4C                  PIC X(04).                 012400      
000129    02  FILLER                         PIC X(08).                 012500      
000130 01 WKS-ULT-INSTX                      PIC X(12).                 012600      
000131 01 WKS-ULT-INST REDEFINES WKS-ULT-INSTX.                         012700      
000132    02 WKS-ULT-INST2C                  PIC X(02).                 012800      
000133    02 FILLER                          PIC X(10).                 012900      
000134 77 WKS-ULT-MONEDA                     PIC 9(04).                 013000      
000135 01 WKS-ULT-P                          PIC 9(04).                 013100      
000136 01 WKS-ULT-I                          PIC 9(02).                 013200      
000137 01 WKS-ULT-SIS.                                                  013300      
000138    02 WKS-ULT-SISL                    PIC X(01).                 013400      
000139    02 WKS-ULT-SISN                    PIC 9(03).                 013500      
000140 01 W77-PIMC                           PIC 9(12).                 013600      
000141 01 W77-RPIM  REDEFINES W77-PIMC.                                 013700      
000142    05 W77-PIM                         PIC 9(08).                 013800      
000143    05 FILLER                          PIC 9(04).                 013900      
000144 01 W77-RPIMC REDEFINES W77-PIMC.                                 014000      
000145    05 W77-PRD                         PIC 9(04).                 014100      
000146    05 W77-INST                        PIC 9(02).                 014200      
000147    05 W77-MONEDA                      PIC 9(02).                 014300      
000148    05 W77-CEPAE                       PIC 9(04).                 014400      
000149                                                                  014500      
000150 01 WKS-FECHA-PROC                     PIC X(08).                 014600      
000151 01 WKS-FECHA-PROC-R     REDEFINES WKS-FECHA-PROC.                014700      
000152     02 WKS-FPROC-CC                   PIC 9(02).                 014800      
000153     02 WKS-FPROC-AMD                  PIC 9(06).                 014900      
000154     02 WKS-FPROC-AMD-R  REDEFINES WKS-FPROC-AMD.                 015000      
000155        05 WKS-FPROC-AA                PIC 9(02).                 015100      
000156        05 WKS-FPROC-MM                PIC 9(02).                 015200      
000157        05 WKS-FPROC-DD                PIC 9(02).                 015300      
000158                                                                  015310      
000159 77 W77-SISTEMAS-CFR                   PIC 9(03).                 015320      
000160 88 W88-SISTEMAS-CFR                   VALUE 404, 707, 804, 203,  015330      
000161                                             414.                 015340      
000162                                                                  015400      
000163*--> Hora de Proceso                                              015600      
000164*                                                                 015700      
000165 01 WKS-HORA-PROCESO                   PIC 9(08).                 015800      
000166 01 WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                        015900      
000167    03 WKS-HORA-HMS                    PIC 9(06).                 016000      
000168    03 FILLER                          PIC XX.                    016100      
000169                                                                  016200      
000170 01 W77-NUMMOV                         PIC 9(05) VALUE 0.         016300      
000171                                                                  016400      
000172*---->  NOMBRE DE LA LOG DEL S151                                 016500      
000173 01 WKS-TIT-LOG151.                                               016600      
000174     02  FILLER                    PIC X(20) VALUE                016700      
000175           "(S151)S151/FILE/MOVS".                                016800      
000176     02  WKS-SIS-LOG               PIC 9(03).                     016900      
000177     02  FILLER                    PIC X(01) VALUE "/".           017000      
000178     02  WKS-FEC-LOG               PIC 9(06).                     017100      
000179     02  FILLER                    PIC X(04) VALUE " ON ".        017200      
000180     02  WKS-PACK-LOG              PIC X(17).                     017300      
000181     02  FILLER                    PIC X(01) VALUE ".".           017400      
000182*                                                                 017500      
000183  77 W77-INTERRUP                 PIC 9999 VALUE 0.               017600      
000184     88 W88-HI1                            VALUE 1.               017700      
000185     88 W88-HI2                            VALUE 2.               017800      
000186     88 W88-HI3                            VALUE 3.               017900      
000187     88 W88-HI4                            VALUE 4.               018000      
000188     88 W88-HI5                            VALUE 5.               018100      
000189     88 W88-HI20                           VALUE 20.              018200      
000190                                                                  018300      
000191******************************************************************018400      
000192*     VARIABLE PARA PASAR FECHA Y SISTEMA COMO PARAMETRO         *018500      
000193******************************************************************018600      
000194 01 WKS-PARAMETRO                  PIC 9(12).                     018700      
000195 01 WKS-PARAMETRO-R REDEFINES WKS-PARAMETRO.                      018800      
000196    03  WKS-FECHA-PARAM            PIC 9(08).                     018900      
000197    03  WKS-SISTE-PARAM            PIC 9(04).                     019000      
000198                                                                  019100      
000199 01 WKS-SISTE-PARAM-STR            PIC X(03).                     019110      
000200******************************************************************019200      
000201*         ARREGLOS PARA ACUMULAR TOTALES POR PROD. INST.         *019300      
000202******************************************************************019400      
000203 01 WKS-TABLA-PRDINST.                                            019500      
000204    02 WKS-TOT-PRDINST             OCCURS 3000 TIMES.             019600      
000205       03 WKS-TOT-PIMC             PIC 9(12)    COMP.             019700      
000206       03 WKS-TOT-RPIMC REDEFINES WKS-TOT-PIMC.                   019800      
000207          05 WKS-TOT-PRD           PIC 9(04)    COMP.             019900      
000208          05 WKS-TOT-INST          PIC 9(02)    COMP.             020000      
000209          05 WKS-TOT-MONEDA        PIC 9(02)    COMP.             020100      
000210          05 WKS-TOT-CPAE          PIC 9(04)    COMP.             020200      
000211 01 WKS-TABLA-TOTABO.                                             020210      
000212    02 WKS-TOT-ABO                 OCCURS 3000 TIMES.             020220      
000213       03 WKS-TOT-NUM-ABO          PIC 9(06)    COMP.             020300      
000214       03 WKS-TOT-IMP-ABO          PIC 9(14)V99 COMP.             020400      
000215                                                                  020410      
000216 01 WKS-TABLA-TOTCGO.                                             020420      
000217    02 WKS-TOT-CGO                 OCCURS 3000 TIMES.             020430      
000218       03 WKS-TOT-NUM-CAR          PIC 9(06)    COMP.             020500      
000219       03 WKS-TOT-IMP-CAR          PIC 9(14)V99 COMP.             020600      
000220*                                                                 020700      
000221*********************************************************         020800      
000222* ARREGLO PARA ACUMULAR LIMITES PARA ALERTAS            *         020900      
000223*********************************************************         021000      
000224 01 WKS-TABLA-ALERTAS.                                            021100      
000225    02 WKS-ALE-PRDINST             OCCURS 3000 TIMES.             021200      
000226       03 WKS-ALE-PIM              PIC 9(08)  COMP.               021300      
000227       03 WKS-ALE-RPIM  REDEFINES WKS-ALE-PIM.                    021400      
000228          05 WKS-ALE-PRD           PIC 9(04)  COMP.               021500      
000229          05 WKS-ALE-INST          PIC 9(02)  COMP.               021600      
000230          05 WKS-ALE-MONEDA        PIC 9(02)  COMP.               021700      
000231                                                                  021800      
000232 01 WKS-TABLA-IMP-ALERTA-ABO.                                     021810      
000233    02 WKS-ALE-LIMTRNABO  OCCURS 3000 TIMES PIC 9(12)  COMP.      021820      
000234 01 WKS-TABLA-IMP-ALERTA-CGO.                                     021830      
000235    02 WKS-ALE-LIMTRNCAR  OCCURS 3000 TIMES PIC 9(12)  COMP.      021900      
000236*                                                                 022000      
000237**************************************************************    022100      
000238*    TABLA PARA CARGAR CPAES                                 *    022200      
000239**************************************************************    022300      
000240 01 WKS-TABLA-CPAES.                                              022400      
000241    02 WKS-TAB-CPAE  OCCURS 10000 TIMES INDEXED BY WS-CPAE.       022500      
000242       03 WKS-T-SUCOPER            PIC 9(04) COMP.                022600      
000243       03 WKS-T-CPAE               PIC 9(04) COMP.                022700      
000244*                                                                 022800      
000245**************************************************************    022900      
000246*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    023000      
000247**************************************************************    023100      
000248 01  WKS-DATOS-HOST.                                              023200      
000249     03 WKS-NUMCSI                 PIC 9(02).                     023300      
000250     03 WKS-NOMEQUIPO              PIC X(10).                     023400      
000251     03 WKS-NOMCSI                 PIC X(26).                     023500      
000252     03 WKS-LINEABATCH             PIC X(05).                     023600      
000253                                                                  023700      
000254******************************************************************023800      
000255*      ARREGLO PARA CARGAR CATALOGO DE CLAVES DE LOS SISTEMAS    *023900      
000256******************************************************************024000      
000257 01  WKS-TABLA-CATALOGO.                                          024100      
000258     03  WKS-TAB-CAT  OCCURS 10000 TIMES.                         024200      
000259         05  WKS-CAT-CVE           PIC 9(04) COMP.                024300      
000260         05  WKS-CAT-NATCON        PIC 9(02) COMP.                024500      
000261         05  WKS-CAT-NATCON2       PIC 9(02) COMP.                024600      
000262 01  WKS-TABLA-CATALOGO-2.                                        024610      
000263     03  WKS-TAB-CAT-2 OCCURS 10000 TIMES.                        024620      
000264         05  WKS-TIP-MOV           PIC 9(02) COMP.                024700      
000265         05  WKS-TIP-MOV2          PIC 9(02) COMP.                024800      
000266******************************************************            024810      
000267*   VARIABLES PARA LLAMAR AL FECHAS                  *            024900      
000268******************************************************            025000      
000269 77  WKS-FUNCION                   PIC S9(11) BINARY.             025100      
000270 77  WKS-FORMATO                   PIC S9(11) BINARY.             025200      
000271*                                                                 025300      
000272******************************************************            025400      
000273*           CATALOGOS PARAMETRICOS  S080             *            025500      
000274******************************************************            025600      
000275 77 S080-CP-SISTEMA                PIC S9(11) BINARY.             025700      
000276 77 S080-CP-PROGRAMA               PIC S9(11) BINARY.             025800      
000277 77 S080-CP-RESULT                 PIC S9(11) BINARY.             025900      
000278 01 S080-CP-PARAMETRO-ENT.                                        026000      
000279    03 S080-CPPE-CATALOGO          PIC 9(06) COMP.                026100      
000280    03 S080-CPPE-CLAVE             PIC 9(02) COMP.                026200      
000281    03 S080-CPPE-ORDEN-BUSQ        PIC 9(02) COMP.                026300      
000282    03 S080-CPPE-REGISTROS         PIC 9(02) COMP.                026400      
000283    03 S080-CPPE-LLAVES.                                          026500      
000284       05 S018-CPPE-LLAVE-1-6 OCCURS 6 TIMES PIC X(12).           026600      
000285    03 S080-CPPE-LLAVE-R01 REDEFINES S080-CPPE-LLAVES.            026700      
000286       05 S080-CPPE-LLAVE1         PIC 9(12).                     026800      
000287       05 S080-CPPE-LLAVE2         PIC 9(12).                     026900      
000288       05 S080-CPPE-LLAVE3         PIC 9(12).                     027000      
000289       05 S080-CPPE-LLAVE4         PIC 9(12).                     027100      
000290       05 FILLER                   PIC X(24).                     027200      
000291    03 S080-CPPE-FECHA-VIG         PIC 9(06) COMP.                027300      
000292    03 S080-CPPE-FECHA-CONS        PIC 9(06) COMP.                027400      
000293    03 S080-CPPE-NIVEL-INI         PIC 9(02) COMP.                027500      
000294    03 FILLER                      PIC X(11).                     027600      
000295                                                                  027700      
000296 01 S080-CP-PARAMETRO-SAL.                                        027800      
000297    02 S080-CPPS-NUM-REGISTRO      PIC 9(02) COMP.                027900      
000298    02 S080-CPPS-NUM-CATALOGO      PIC 9(06) COMP.                028000      
000299    02 S080-CPPS-FECHA-CONS        PIC 9(06) COMP.                028100      
000300    02 S080-CPPS-NIVEL-INI         PIC 9(02) COMP.                028200      
000301    02 FILLER                      PIC X(22).                     028300      
000302    02 S080-CPPS-DATOS-R    OCCURS 10 TIMES.                      028400      
000303       03 S080-CPPS-REGISTROS.                                    028500      
000304          05 S080-CPPS-DATOS OCCURS 28 TIMES PIC 9(12).           028600      
000305          05 S080-CPPS-FECHA-ALTA     PIC 9(06) COMP.             028700      
000306          05 S080-CPPS-FECHA-BAJA     PIC 9(06) COMP.             028800      
000307          05 S080-CPPS-FECHA-ULTMOD   PIC 9(06) COMP.             028900      
000308          05 S080-CPPS-FECHA-VIG      PIC 9(06) COMP.             029000      
000309          05 FILLER                   PIC X(42).                  029100      
000310                                                                  029200      
000311************************************************                  029300      
000312*          LIBRERIA CTLVERS       ( S006)      *                  029400      
000313************************************************                  029500      
000314                                                                  029600      
000315 01  WKS-CTLVERS-LIBRERIA          PIC X(12).                     029700      
000316 01  WKS-CTLVERS-TITULO            PIC X(72).                     029800      
000317 01  WKS-CTLVERS-STATUS            PIC S9(11) BINARY.             029900      
000318************************************************                  030000      
000319*    FORMATO DE LLAMADA A LIBRERIA ACTUALIZA   *                  030100      
000320************************************************                  030200      
000321 01 WKS-151-DATOS WITH LOWER-BOUNDS.                              030300      
000322    03 WKS-FUN                     PIC 9(04).                     030400      
000323    03 WKS-NIVBASE                 PIC 9(08).                     030500      
000324    03 WKS-NIVLOG                  PIC 9(08).                     030600      
000325    03 WKS-NUMASIN                 PIC 9(02).                     030700      
000326    03 WKS-PROCESO                 PIC 9(02).                     030800      
000327                                                                  030900      
000328 77 WKS-151-RESULT            PIC S9(11) BINARY.                  031000      
000329                                                                  031100      
000330*---->  COPY DEL FORMATO DE MOVIMIENTOS DEL S151                  031200      
000331*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000332* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".             031300      
000333                                                                  000100      
000334******************************************************************000200      
000335**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000336**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000337**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000338******************************************************************000600      
000339                                                                  000700      
000340 01 A00-R00-HDR-MOV .                                             000800      
000341    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000342    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000343    02 FILLER                          PIC  X(08).                001100      
000344    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000345    02 FILLER                          PIC  X(430).               001300      
000346                                                                  001400      
000347 01 A00-R01-REGMOV .                                              001500      
000348    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000349    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000350    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000351                                                                  001900      
000352    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000353    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000354                                       PIC  9(04)      COMP.      002200      
000355    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000356                                       PIC  9(04)      COMP.      002400      
000357                                                                  002500      
000358    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000359    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000360                                       PIC  9(02)      COMP.      002800      
000361    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000362                                       PIC  9(02)      COMP.      003000      
000363    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000364    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000365                                       A00-R01-SERVICIO-ALERTA.   003060      
000366       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000367       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000368    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000369    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000370    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000371                                       PIC  9(04)      COMP.      003420      
000372    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000373    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000374                                       PIC  9(04)      COMP.      003520      
000375    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000376    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000377    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000378                                       PIC  9(02)      COMP.      003900      
000379                                                                  004000      
000380    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000381    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000382       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000383          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000384          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000385          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000386          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000387          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000388          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000389          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000390                                                                  005100      
000391    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000392       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000393       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000394       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000395       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000396       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000397       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000398       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000399                                                                  006000      
000400       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000401       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000402       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000403       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000404       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000405       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000406       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000407                                                                  006800      
000408       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000409       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000410       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000411       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000412       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000413       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000414       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000415                                                                  007600      
000416       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000417       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000418       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000419       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000420       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000421       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000422       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000423                                                                  008400      
000424       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000425       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000426       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000427       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000428       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000429       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000430       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000431                                                                  009200      
000432    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000433    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000434    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000435    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000436    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000437    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000438       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000439    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000440    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000441    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000442    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000443    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000444    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000445    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000446    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000447       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000448       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000449    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000450    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000451    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000452    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000453    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000454    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000455    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000456    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000457    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000458    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000459    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000460    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000461    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000462    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000463                                       PIC X(10).                 012600      
000464    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000465       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000466       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000467    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000468    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000469    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000470    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000471       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000472       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000473                                                                  013300      
000474    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000475    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000476                                       PIC  X(09).                013600      
000477    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000478                                       PIC  9(18)      COMP.      013800      
000479    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000480    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000481                                       PIC  X(9).                 014100      
000482    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000483    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000484                                       PIC  X(05).                014400      
000485    03 A00-R01-NIO                     PIC  X(16).                014500      
000486    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000487    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000488    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000489       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000490    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000491    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000492       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000493    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000494    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000495    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000496    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000497    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000498    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000499                                       PIC  X(04).                015900      
000500    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000501    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000502    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000503                                       PIC  9(04)      COMP.      016300      
000504    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000505    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000506    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000507    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000508    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000509                                                                  016900      
000510    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000511    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000512       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000513    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000514                                                                  017400      
000515    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000516       05 FILLER                       PIC X(96).                 017510      
000517       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000518       05 FILLER                       PIC X(67).                 017700      
000519                                                                  017702      
000520    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000521       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000522       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000523       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000524       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000525       06 WKS-MOV-FILS084              PIC X(154).                017714      
000526                                                                  017800      
000527    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000528       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000529       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000530       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000531       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000532       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000533       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000534       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000535       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000536       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
000537       05 FILLER                       PIC X(62).                 018170      
000538       05 A00-R01-CTE-087              PIC X(07).                 018210      
000539       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000540          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000541          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000542          07 FILLER                    PIC X(01).                 018281      
000543       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000544       05 FILLER                       PIC X(61).                 018400      
000545                                                                  018500      
000546    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000547       05 FILLER                       PIC  X(96).                018610      
000548       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000549       05 FILLER                       PIC  X(65).                018630      
000550                                                                  018640      
000551    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000552       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000553       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000554       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000555       05 FILLER                       PIC  X(141).               018910      
000556                                                                  019100      
000557    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000558       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000559       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000560       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000561       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000562       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000563       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000564       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000565       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000566       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000567       05 FILLER                       PIC  X(69).                020200      
000568                                                                  020300      
000569    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000570       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000571       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000572       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000573       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000574       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000575       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000576       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000577       05 FILLER                       PIC  X(77).                021200      
000578                                                                  021300      
000579    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000580       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000581       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000582       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000583       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000584       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000585       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000586       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000587       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000588       05 FILLER                       PIC  X(69).                022300      
000589                                                                  022400      
000590    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000591       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000592       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000593       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000594       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000595       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000596       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000597       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000598       05 FILLER                       PIC  X(85).                023300      
000599                                                                  023400      
000600    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000601       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000602       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000603       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000604       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000605       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000606       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000607       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000608       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000609       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000610       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000611       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000612       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000613       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000614       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000615       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000616       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000617       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000618       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000619       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000620       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000621       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000622       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000623       05 FILLER                       PIC  X(05).                023492      
000624                                                                  023497      
000625    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000626       05 A00-R01-4CEROS               PIC  9(04).                023600      
000627       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000628       05 FILLER                       PIC  X(157).               023800      
000629                                                                  023900      
000630    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000631       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000632        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000633       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000634       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000635       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000636       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000637       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000638       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000639       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000640       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000641       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000642       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000643       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000644       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000645       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000646       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000647       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000648       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000649       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000650       05 A00-R01-FILLER               PIC  X(41).                025850      
000651       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000652       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000653       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000654       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000655       05 FILLER                       PIC  X(01).                026210      
000656       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000657       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000658       05 FILLER                       PIC  X(52).                026300      
000659                                                                  026400      
000660    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000661       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000662       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000663       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000664       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000665       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000666       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000667       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000668       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000669       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000670       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000671       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000672       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000673       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000674          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000675          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000676       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000677       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000678          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000679       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000680          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000681       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000682          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000683       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000684          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000685       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000686          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000687       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000688          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000689       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000690          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000691       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000692          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000693       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000694          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000695       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000696          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000697          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000698       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000699       05 FILLER                       PIC X(01).                 030101      
000700       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000701       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000702       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000703       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000704       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000705       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000706       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000707       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000708          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000709       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000710       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000711       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000712       05 FILLER                       PIC X(14).                 030700      
000713                                                                  030800      
000714    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000715       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000716       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000717       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000718       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000719       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000720       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000721       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000722       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000723       05 FILLER                       PIC  X(140).               031600      
000724                                                                  031700      
000725    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000726       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000727       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000728       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000729       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000730       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000731       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000732       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000733       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000734       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000735       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000736          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000737          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000738          07 FILLER                    PIC  X(08).                032740      
000739       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000740       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000741       05 A00-R01-NOMORD               PIC  X(30).                033000      
000742       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000743       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000744       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000745       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000746       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000747          A00-R01-NUM-ORD-PAGO.                                   033800      
000748          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000749          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000750                                                                  034100      
000751    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000752       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000753       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000754       05 FILLER                       PIC  X(151).               034180      
000755                                                                  034190      
000756    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000757       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000758       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000759                                       A00-R01-DATOS-S701.        034500      
000760          07 A00-R01-ID                PIC X(30).                 034600      
000761          07 A00-R01-FECREC            PIC 9(06).                 034700      
000762          07 A00-R01-REF1              PIC X(20).                 034800      
000763          07 A00-R01-REF2              PIC X(20).                 034900      
000764          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000765          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000766                                       A00-R01-TIPOPAGO.          035200      
000767             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000768             09 A00-R01-SEQ            PIC 9(02).                 035400      
000769          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000770          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000771          07 A00-R01-EBPP              PIC 9(03).                 035700      
000772          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000773          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000774          07 FILLER                    PIC X(01).                 035728      
000775          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000776          07 FILLER                    PIC X(18).                 035760      
000777       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000778                                       A00-R01-DATOS-S701.        035900      
000779          07 A00-R01-RFC               PIC X(13).                 036000      
000780          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000781          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000782          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000783          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000784          07 FILLER                    PIC X(85).                 036200      
000785       05 FILLER                       PIC X(49).                 036300      
000786                                                                  036400      
000787    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000788       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000789       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000790       05 FILLER                       PIC X(113).                036710      
000791                                                                  036720      
000792    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000793       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000794       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000795       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000796       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000797       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000798       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000799       05 FILLER                       PIC X(72).                 036800      
000800                                                                  036810      
000801                                                                  036820      
000802    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000803       05 A00-R01-TRUI-S711.                                      036915      
000804          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000805          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000806          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000807           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000808          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000809       05 A00-R01-MICR-S711.                                      036945      
000810          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000811          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000812          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000813          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000814          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000815          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000816          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000817          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000818       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000819       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000820       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000821       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000822       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000823       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000824       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000825                                                                  036990      
000826    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000827       05 A00-R01-RFC-502              PIC  X(13).                037100      
000828       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000829          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000830          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000831          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000832          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000833          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000834          07 FILLER                    PIC  9(01) COMP.           037650      
000835       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000836       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000837       05 FILLER                       PIC  X(06).                038680      
000838                                                                  038682      
000839    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000840       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000841       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000842       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000843       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000844       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000845       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000846       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000847       05 FILLER                       PIC  X(81).                038750      
000848                                                                  038755      
000849    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000850       05 A00-R01-COP                  PIC  9(13)        .        038900      
000851       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000852       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000853       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000854       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000855       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000856       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000857       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000858       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000859       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000860       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000861       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000862       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000863       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000864       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000865       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000866       05 FILLER                       PIC  X(81)        .        040800      
000867                                                                  040810      
000868    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000869       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000870       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000871       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000872       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000873       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000874       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000875       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000876       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000877       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000878       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000879       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000880       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000881       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000882       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000883       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000884       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000885       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000886       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000887       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000888       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000889       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000890       05 FILLER                       PIC  X(18).                041040      
000891                                                                  041400      
000892    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000893    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000894*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000895                                                                  031400      
000896*---->  COPY DEL FORMATO PARA LIBRERIA DE CONTROL                 031500      
000897*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000898* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         031600      
000899*================================================================ 000100      
000900*         ENTRY-POINT CONSISDIA :                               = 000200      
000901*                                                                 000300      
000902* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000903* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000904* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000905* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000906* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000907* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000908* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000909* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000910* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000911* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000912*                                                               = 001400      
000913*================================================================ 001500      
000914                                                                  001600      
000915                                                                  001700      
000916*================================================================ 001800      
000917* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000918*                                                               = 002000      
000919* ENTRADA REQUERIDA :                                           = 002100      
000920*                                                               = 002200      
000921*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000922*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000923*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000924*================================================================ 002600      
000925 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000926    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000927    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000928    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000929    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000930    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000931    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000932    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000933    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000934    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000935    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000936    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000937    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000938    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000939    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000940    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000941    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000942    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000943    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000944    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000945    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000946       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000947       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000948       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000949       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000950*==============================================================   005200      
000951*                                                             =   005300      
000952* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000953*                                                             =   005500      
000954* CAMPOS REQUERIDOS :                                         =   005600      
000955*                                                             =   005700      
000956* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000957* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000958* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000959* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000960*==============================================================   006200      
000961 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000962    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000963    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000964    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000965    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000966                                                                  006800      
000967*==============================================================   006900      
000968*                                                             =   007000      
000969* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000970*                                                             =   007200      
000971* CAMPOS REQUERIDOS :                                         =   007300      
000972*                                                             =   007400      
000973* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000974* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000975* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000976* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000977*==============================================================   007900      
000978 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000979    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000980    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000981    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000982    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000983                                                                  008500      
000984*==============================================================   008600      
000985*                                                             =   008700      
000986* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000987*                                                             =   008900      
000988* CAMPOS REQUERIDOS :                                         =   009000      
000989*                                                             =   009100      
000990* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000991* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000992* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000993* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000994*==============================================================   009600      
000995 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000996    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000997    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000998    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000999    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001000                                                                  010200      
001001*============================================================     010300      
001002* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001003*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001004*                                                           =     010600      
001005*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001006*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001007*                                                           =     010900      
001008*  ENTRADA REQUERIDA.                                       =     011000      
001009*                                                           =     011100      
001010*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001011*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001012*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001013*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001014*============================================================     011600      
001015                                                                  011700      
001016 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001017     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001018     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001019     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001020     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001021                                                                  012300      
001022*=============================================================    012400      
001023*                                                            =    012500      
001024* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001025*             B01-SIS-FECARMOV.                              =    012700      
001026*                                                            =    012800      
001027* ENTRADA REQUERIDAD :                                       =    012900      
001028*                                                            =    013000      
001029*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001030*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001031*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001032*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001033*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001034*=============================================================    013600      
001035                                                                  013700      
001036 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001037     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001038     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001039     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001040     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001041     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001042*================================================================ 014400      
001043*                                                               = 014500      
001044* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001045*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001046*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001047*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001048*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001049*                                                               = 015100      
001050* ENTRADA REQUERIDA :                                           = 015200      
001051*                                                               = 015300      
001052* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001053* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001054* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001055* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001056* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001057*================================================================ 015900      
001058 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001059    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001060    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001061    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001062    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001063    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001064                                                                  016600      
001065*============================================================     016700      
001066*                                                           =     016800      
001067* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001068*                                                           =     017000      
001069* DATOS REQUERIDOS :                                        =     017100      
001070*                                                           =     017200      
001071* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001072* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001073* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001074* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001075* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001076*============================================================     017800      
001077                                                                  017900      
001078 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001079     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001080     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001081     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001082     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001083     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001084                                                                  018600      
001085*============================================================     018700      
001086*                                                           =     018800      
001087* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001088*                                                           =     019000      
001089* DATOS REQUERIDOS :                                        =     019100      
001090*                                                           =     019200      
001091* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001092* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001093* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001094* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001095* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001096*============================================================     019800      
001097                                                                  019900      
001098 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001099     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001100     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001101     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001102     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001103     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001104                                                                  020600      
001105*===============================================================  020700      
001106*                                                              =  020800      
001107* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001108*              MOVIMIENTOS.                                    =  021000      
001109* DATOS REQUERIDOS :                                           =  021100      
001110*                                                              =  021200      
001111* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001112* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001113* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001114* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001115* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001116* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001117*==============================================================   021900      
001118                                                                  022000      
001119 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001120     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001121     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001122     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001123     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001124     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001125     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001126*==============================================================   022800      
001127*                                                             =   022900      
001128* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001129*                                                             =   023100      
001130* CAMPOS REQUERIDOS :                                         =   023200      
001131*                                                             =   023300      
001132* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001133* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001134* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001135* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001136*==============================================================   023800      
001137 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001138    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001139    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001140    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001141    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001142                                                                  024304      
001143*=================================================================024306      
001144*                ENTRY POINT CONSISB01                           =024308      
001145*                                                                =024310      
001146*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001147*                                                                =024314      
001148*  FUNCIONES DISPONIBLES :                                       =024316      
001149*                                                                =024318      
001150*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001151*                                                                =024322      
001152*  PARAMETROS REQUERIDOS                                         =024324      
001153*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001154*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001155*=================================================================024330      
001156                                                                  024332      
001157 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001158     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001159     03 WKS-CON-CSI                PIC 9(02).                     024336      
001160     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001161     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001162        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001163        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001164        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001165        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001166        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001167                                                                  024400      
001168*=================================================================024500      
001169*                ENTRY POINT B02ARCINTER                         =024600      
001170*                                                                =024700      
001171*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001172*                                                                =024900      
001173*  FUNCIONES DISPONIBLES :                                       =025000      
001174*                                                                =025100      
001175*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001176* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001177* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001178* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001179*                                                                =025600      
001180*  PARAMETROS REQUERIDOS                                         =025700      
001181*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001182*                                                                =025900      
001183*=================================================================026000      
001184 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001185     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001186     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001187     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001188     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001189     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001190     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001191     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001192     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001193     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001194     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001195     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001196     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001197     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001198     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001199     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001200     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001201     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001202     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001203     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001204     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001205     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001206     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001207     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001208     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001209     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001210     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001211     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001212     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001213                                                                  029000      
001214*=================================================================029100      
001215*                ENTRY POINT B04SISTEMA                          =029200      
001216*                                                                =029300      
001217*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001218*                                                                =029500      
001219*  FUNCIONES DISPONIBLES :                                       =029600      
001220*                                                                =029700      
001221*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001222*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001223*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001224*                                                                =030100      
001225*  PARAMETROS REQUERIDOS                                         =030200      
001226*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001227*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001228*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001229*                                                                =030600      
001230*=================================================================030700      
001231 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001232     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001233     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001234     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001235     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001236     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001237     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001238     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001239                                                                  031600      
001240*================================================================ 031700      
001241*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001242*                                                               = 031900      
001243*  FUNCION                                                      = 032000      
001244*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001245*   19       ALTAS.                                             = 032200      
001246*   22       BAJAS                                              = 032300      
001247*   37       CAMBIOS.                                           = 032400      
001248*                                                               = 032500      
001249*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001250*                      FECHA DE PROCESO                         = 032700      
001251*                      NUMERO DE PROCESO                        = 032800      
001252*                      FECHA INICIO                             = 032900      
001253*                      REGISTRO INICIAL                         = 033000      
001254*================================================================ 033100      
001255                                                                  033200      
001256 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001257     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001258     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001259     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001260     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001261     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001262     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001263     03 WKS-B05-MIX                PIC 9(08).                     034000      
001264     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001265     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001266     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001267     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001268     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001269     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001270                                                                  034700      
001271                                                                  034800      
001272*================================================================ 034900      
001273*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001274*                                                               = 035100      
001275*  FUNCION                                                      = 035200      
001276*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001277*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001278*                                                               = 035500      
001279*================================================================ 035600      
001280                                                                  035700      
001281 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001282     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001283     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001284     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001285     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001286     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001287     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001288                                                                  036500      
001289*===============================================================  036600      
001290*                                                              =  036700      
001291*         ENTRY-POINT CONSISMEN                                =  036800      
001292*                                                              =  036900      
001293*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001294*                      SISTEMA                                 =  037100      
001295*                                                              =  037200      
001296*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001297*                                                              =  037400      
001298*===============================================================  037500      
001299 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001300     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001301     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001302     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001303     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001304     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001305     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001306     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001307     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001308     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001309     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001310     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001311     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
001312     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
001313     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
001314     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
001315        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
001316        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
001317        05 WKS-B03-AAMM            PIC 9(06).                     039402      
001318        05 WKS-B03-SECOK           PIC 9(10).                     039500      
001319        05 WKS-B03-SECINF          PIC 9(10).                     039600      
001320        05 WKS-B03-SECERR          PIC 9(10).                     039700      
001321        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
001322                                                                  039900      
001323*=====================================================            040000      
001324*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
001325*=====================================================            040200      
001326 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
001327     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
001328     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
001329     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
001330                                                                  040700      
001331*=====================================================            040800      
001332*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
001333*=====================================================            041000      
001334 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
001335     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
001336     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
001337     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
001338                                                                  041500      
001339*=====================================================            041600      
001340*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
001341*=====================================================            041800      
001342 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
001343     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
001344     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
001345     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
001346*=====================================================            042300      
001347*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
001348*=====================================================            042500      
001349 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
001350     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
001351     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
001352     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
001353                                                                  043000      
001354*=====================================================            043100      
001355*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
001356*=====================================================            043300      
001357 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
001358     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
001359     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
001360     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
001361                                                                  043800      
001362*=====================================================            043900      
001363*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
001364*=====================================================            044100      
001365 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
001366     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
001367     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
001368     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
001369                                                                  044600      
001370*=====================================================            044700      
001371*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
001372*=====================================================            044900      
001373 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
001374     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
001375     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
001376     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
001377                                                                  045400      
001378*=====================================================            045500      
001379*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
001380*=====================================================            045700      
001381 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
001382     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
001383     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
001384     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
001385                                                                  046200      
001386*=====================================================            046300      
001387*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
001388*=====================================================            046500      
001389 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
001390     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
001391     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
001392     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
001393                                                                  047000      
001394*=====================================================            047100      
001395*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
001396*=====================================================            047300      
001397 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
001398     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
001399     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
001400     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
001401                                                                  047800      
001402*=====================================================            047900      
001403*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
001404*=====================================================            048100      
001405 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
001406     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
001407     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
001408     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
001409                                                                  048600      
001410*=====================================================            048700      
001411*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
001412*=====================================================            048900      
001413 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
001414     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
001415     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
001416     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
001417                                                                  049400      
001418*=====================================================            049500      
001419*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
001420*=====================================================            049700      
001421 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
001422     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
001423     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
001424     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
001425     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
001426     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
001427     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
001428     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
001429     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
001430     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
001431     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
001432                                                                  050900      
001433*=====================================================            051000      
001434*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
001435*=====================================================            051200      
001436 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
001437     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
001438     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
001439     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
001440     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
001441                                                                  051800      
001442*=====================================================            051900      
001443*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
001444*=====================================================            052100      
001445 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
001446     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
001447     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
001448     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
001449     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
001450                                                                  052700      
001451*=====================================================            052800      
001452*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
001453*=====================================================            053000      
001454 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
001455     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
001456     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
001457     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
001458     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
001459                                                                  053600      
001460*=====================================================            053700      
001461*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
001462*=====================================================            053900      
001463 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
001464     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
001465     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
001466     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
001467     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
001468                                                                  054500      
001469*=====================================================            054600      
001470*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
001471*=====================================================            054800      
001472 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
001473     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
001474     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
001475     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
001476     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
001477                                                                  055400      
001478*=====================================================            055500      
001479*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
001480*=====================================================            055700      
001481 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
001482     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
001483     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
001484     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
001485     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
001486                                                                  056300      
001487*=====================================================            056400      
001488*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
001489*=====================================================            056600      
001490 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
001491     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
001492     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
001493     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
001494     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
001495                                                                  057200      
001496 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
001497*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001498                                                                  031700      
001499*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001500* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           031800      
001501**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001502  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001503  01 MENSAJE-LJ.                                                  100300      
001504     02 SISTEMA-LJ     PIC X(04).                                 100400      
001505     02 FILLER         PIC X VALUE "/".                           100500      
001506     02 PASO-LJ        PIC X(04).                                 100600      
001507     02 FILLER         PIC X VALUE "/".                           100700      
001508     02 MTP-LJ         PIC 9(03).                                 100800      
001509     02 FILLER         PIC X VALUE ":".                           100900      
001510     02 TIPO-LJ        PIC X.                                     101000      
001511     02 FILLER         PIC X VALUE ">".                           101100      
001512     02 CODIGO-LJ      PIC 9(06).                                 101200      
001513     02 FILLER         PIC X VALUE "<".                           101300      
001514     02 TEXTO-LJ       PIC X(250).                                101400      
001515*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001516 77  W77-ERR-CATALOGO              PIC 9(04).                     031900      
001517 77  W77-CAT-NUMCAT                PIC 9(06).                     032000      
001518 77  W77-CAT-FORMATO               PIC 9(04).                     032100      
001519 77  W77-I                         PIC 9(04) COMP.                032200      
001520 77  W77-J                         PIC 9(04) COMP.                032300      
001521 77  W77-DIV                       PIC 9(06) COMP.                032400      
001522 77  W77-REM                       PIC 9(04) COMP.                032500      
001523 77  W77-NUM-CAT                   PIC 9(04).                     032520      
001524 77  W77-NUM-SUBCAT                PIC 9(04).                     032540      
001525/                                                                 032600      
001526 PROCEDURE DIVISION USING WKS-PARAMETRO.                          032800      
001527*---------------------------------------                          032900      
001528 DECLARATIVES.                                                    033000      
001529 HI-INTERRUPT SECTION.                                            033100      
001530      USE AS INTERRUPT PROCEDURE.                                 033200      
001531 INTERRUP-BY-HI.                                                  033300      
001532      DISALLOW INTERRUPT.                                         033400      
001533      MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-INTERRUP.         033500      
001534       IF W88-HI20                                                033600      
001535           PERFORM 070000-DISPLAY-REGLEIDOS                       033700      
001536      ELSE                                                        033800      
001537      IF W88-HI4                                                  033900      
001538         MOVE 1                   TO W77-END-LOGS                 034300      
001539      ELSE                                                        034500      
001540      IF W77-INTERRUP      >       20                             034600      
001541         MOVE W77-INTERRUP TO      W77-TIME.                      034700      
001542     ALLOW INTERRUPT.                                             034800      
001543                                                                  034900      
001544 END DECLARATIVES.                                                035000      
001545/                                                                 035100      
001546*                                                                 035200      
001547 INICIO-PROGRAMA SECTION.                                         035300      
001548 000000-INICIO-PROCESO.                                           035400      
001549*----------------------                                           035500      
001550  CHANGE ATTRIBUTE TITLE        OF "LIB-DISP"    TO               035600      
001551  "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK."                 035700      
001552  CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION    035800      
001553  CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO "SOPORTECOMS" 035900      
001554  CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS"    TO BYFUNCTION    036000      
001555  CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS"    TO "CTLVERS"     036100      
001556*-                                                                036200      
001557  MOVE "S151L001CTL"            TO    WKS-CTLVERS-LIBRERIA        036300      
001558  CALL "DAME_TIT IN CTRLVERS"   USING WKS-CTLVERS-LIBRERIA,       036400      
001559                                      WKS-CTLVERS-TITULO          036500      
001560                               GIVING WKS-CTLVERS-STATUS.         036600      
001561  IF WKS-CTLVERS-STATUS = 0                                       036700      
001562     CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-CTLVERS-TITULO036800      
001563    ELSE                                                          036900      
001564     CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                   037000      
001565      "(S151)S151/OBJECT/L001/CONTROL ON CMEMP".                  037100      
001566*-                                                                037200      
001567  MOVE "S000LIBFEC"                  TO WKS-CTLVERS-LIBRERIA      037300      
001568  PERFORM 000-9999-CTROL-VERSIONES                                037400      
001569  CHANGE ATTRIBUTE TITLE OF "FECHAS" TO WKS-CTLVERS-TITULO        037500      
001570*-                                                                037600      
001571  MOVE "S080BD01CON"                 TO WKS-CTLVERS-LIBRERIA      037700      
001572  PERFORM 000-9999-CTROL-VERSIONES                                037800      
001573  IF WKS-CTLVERS-STATUS < 0                                       037900      
001574     MOVE "NO ESTA EN VERSIONES LA LIB. S080BD01CON"  TO TEXTO-LJ 038000      
001575     MOVE "O"            TO   TIPO-LJ                             038100      
001576     MOVE 020901         TO   CODIGO-LJ                           038200      
001577     PERFORM 000-9999-LIBJ                                        038300      
001578     CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                      038400      
001579   ELSE                                                           038500      
001580    CHANGE ATTRIBUTE TITLE OF "S080BD01CON" TO WKS-CTLVERS-TITULO.038600      
001581                                                                  038700      
001582  MOVE "S151"          TO  SISTEMA-LJ                             038800      
001583  MOVE "P016"          TO  PASO-LJ                                038900      
001584  MOVE "003"           TO  MTP-LJ                                 039000      
001585  MOVE "I"             TO  TIPO-LJ                                039100      
001586  MOVE 020101          TO  CODIGO-LJ                              039200      
001587  ACCEPT WKS-HORA-PROCESO FROM TIME                               039210      
001588  IF WKS-HORA-HMS > WKS-HORA-LIMITE                               039220      
001589     STRING "ESTE PROCESO NO PUEDE CORRER DESPUES DE LAS ",       039300      
001590            WKS-HH-MM,                                            039310      
001591            " HRS. " DELIMITED BY SIZE INTO TEXTO-LJ              039400      
001592     PERFORM  000999-MSG-ERROR                                    039500      
001593     STOP RUN.                                                    039510      
001594  CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.               039600      
001595       MOVE WKS-NUMCSI      TO      W77-NUM-CSI.                  039700      
001596  MOVE WKS-FECHA-PARAM      TO  WKS-FECHA-PROC                    040400      
001597  MOVE ZEROS                TO  WKS-ULT-TRANS                     040500      
001598  MOVE WKS-SISTE-PARAM      TO  WKS-SIS-LOG                       040600      
001599  MOVE WKS-FPROC-AMD        TO  WKS-FEC-LOG                       040700      
001600  MOVE ZEROS                TO  W77-FIN-TABLA                     040800      
001601                                                                  040805      
001602  PERFORM 000180-PROCESA-CATALOGOS                                040810      
001603  MOVE ATTRIBUTE STACKNO OF MYSELF TO W77-NUMERO-MIX              040815      
001604  ATTACH HI-INTERRUPT    TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF    040820      
001605  ALLOW INTERRUPT                                                 040825      
001606  MOVE ZERO                 TO W77-VECES W77-FIN.                 040827      
001607  PERFORM 000040-CONS-PACK-SISTEMA                                040830      
001608          UNTIL W77-FIN = 1 OR W77-VECES > 5.                     040831      
001609  IF W77-VECES > 5 STOP RUN.                                      040832      
001610  MOVE ZERO                 TO W77-VECES W77-FIN.                 040833      
001611  CHANGE ATTRIBUTE TITLE OF L01-DATOS  TO WKS-TIT-LOG151.         040834      
001612  ACCEPT WKS-HORA-PROCESO FROM TIME                               040835      
001613  PERFORM 000020-VALIDA-INICIO                                    040840      
001614    UNTIL WKS-HORA-HMS > WKS-HORA-INICIO OR W88-HI4.              040845      
001615  IF W88-HI4 STOP RUN.                                            040850      
001616  CANCEL "LIB-CONTROL".                                           040870      
001617  OPEN INPUT L01-DATOS                                            041200      
001618                                                                  041800      
001619  CHANGE ATTRIBUTE TITLE OF L02-DATOS  TO WKS-TIT-LOG151          041900      
001620  OPEN INPUT L02-DATOS                                            042100      
001621  MOVE 1                   TO W77-OPEN.                           042110      
001622                                                                  042700      
001623  PERFORM 000030-ABRE-BASE                                        042800      
001624          UNTIL W77-FIN = 1 OR W77-VECES > 5.                     042900      
001625  IF W77-VECES > 5                                                043000      
001626     MOVE SPACES                  TO TEXTO-LJ                     043050      
001627     STRING " ERROR AL ABRIR LA BASE BIFINDB "                    043100      
001628            " CAT "   W77-DMS-CAT    " "                          043110      
001629            " ERROR " W77-DMS-ERROR                               043120      
001630     DELIMITED BY SIZE                                            043130      
001631     INTO TEXTO-LJ                                                043140      
001632     PERFORM 000999-MSG-ERROR                                     043145      
001633     STOP RUN.                                                    043150      
001634                                                                  043160      
001635  MOVE 0             TO      W77-NIV-BASE                         043400      
001636  MOVE 0             TO      W77-EXISTE                           043500      
001637  PERFORM 042030-FIND-BIFIN                                       043600      
001638  PERFORM 000050-BUSCA-SISTEMA VARYING W77-IND-SIST FROM 1 BY 1   043700      
001639                               UNTIL   W77-IND-SIST > 30          043800      
001640                                  OR   W77-EXISTE   = 1.          043810      
001641  IF W77-EXISTE   =  1                                            043900      
001642     MOVE W77-NIV-BASE TO W77-LLAVE                               044200      
001643     MOVE W77-INDICE              TO   W77-IND-SIST               044201      
001644     MOVE ZERO                    TO   W77-FIN                    044202      
001645                                       W77-INDICE                 044204      
001646                                       WKS-IND-TAB                044206      
001647     PERFORM 042070-FF-B01                                        044210      
001648     MOVE ZERO                    TO W77-INDICE                   044212      
001649     PERFORM 042080-FN-B01        UNTIL W77-FIN   = 1             044220      
001650                                     OR W77-ERROR = 1             044230      
001651   ELSE                                                           044232      
001652      MOVE 1                      TO   W77-LLAVE.                 044234      
001653*                                                                 044300      
001654   PERFORM 001300-PROC-LOGS UNTIL W77-END-LOGS = 1  OR            045000      
001655                                  W77-SW-FIN   = 9.               045100      
001656   PERFORM 080200-CIERRA-ARCH-BD                                  045300      
001657   MOVE "I"          TO      TIPO-LJ                              045400      
001658   MOVE 020101       TO      CODIGO-LJ                            045500      
001659   STOP RUN.                                                      046000      
001660*                                                                 046100      
001661 000020-VALIDA-INICIO.                                            046110      
001662*=====================                                            046120      
001663   WAIT(20).                                                      046130      
001664   ACCEPT WKS-HORA-PROCESO FROM TIME.                             046140      
001665                                                                  046150      
001666 000030-ABRE-BASE.                                                046155      
001667*=================                                                046160      
001668   MOVE 1               TO W77-FIN.                               046162      
001669   OPEN UPDATE BIFINDB                                            046165      
001670        ON EXCEPTION                                              046170      
001671           MOVE DMSTATUS(DMCATEGORY)   TO W77-DMS-CAT             046172      
001672           MOVE DMSTATUS(DMERRORTYPE)  TO W77-DMS-ERROR           046174      
001673           ADD 1        TO W77-VECES                              046175      
001674           MOVE ZERO    TO W77-FIN                                046177      
001675           WAIT(3).                                               046180      
001676                                                                  046185      
001677 000040-CONS-PACK-SISTEMA.                                        046200      
001678*------------------------                                         046300      
001679   MOVE ZEROS           TO      WKS-151-RESULT                    046400      
001680   MOVE 01              TO      WKS-B01-FUNCION                   046500      
001681   MOVE WKS-SISTE-PARAM TO      WKS-B01-SISTEMA                   046600      
001682   MOVE W77-NUM-CSI     TO      WKS-B01-CSI                       046700      
001683   CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA       046800      
001684                                   GIVING WKS-151-RESULT.         046900      
001685   IF WKS-151-RESULT > 0                                          047000      
001686      ADD 1                      TO W77-VECES                     047100      
001687      WAIT(3)                                                     047200      
001688   ELSE                                                           047800      
001689      MOVE 1                     TO W77-FIN                       047850      
001690      IF WKS-B01-NOMPACMOV   =   SPACES                           047900      
001691         MOVE "LOGS"             TO WKS-PACK-LOG                  048000      
001692      ELSE                                                        048100      
001693          MOVE WKS-B01-NOMPACMOV TO WKS-PACK-LOG                  048200      
001694          MOVE ZEROS             TO WKS-151-RESULT.               048300      
001695*                                                                 048400      
001696 000050-BUSCA-SISTEMA.                                            048500      
001697*---------------------                                            048600      
001698  IF B00-GLO-SISTBIFIN(W77-IND-SIST) = WKS-SISTE-PARAM            048700      
001699     MOVE 1                               TO W77-EXISTE           048800      
001700     MOVE B00-GLO-NCTLBIFIN(W77-IND-SIST) TO W77-NIV-BASE         048900      
001701     MOVE W77-IND-SIST            TO W77-INDICE                   049000      
001702   ELSE                                                           049100      
001703   IF (B00-GLO-SISTBIFIN(W77-IND-SIST) = ZEROS AND                049200      
001704       B00-GLO-NCTLBIFIN(W77-IND-SIST) = ZEROS)                   049300      
001705       PERFORM 000150-ACT-GLOBALES.                               049400      
001706*                                                                 049500      
001707 000150-ACT-GLOBALES.                                             049600      
001708*--------------------                                             049700      
001709  PERFORM 032000-LOCK-GLOB                                        049800      
001710  IF WKS-IERR NOT = 1                                             049900      
001711      BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB       050000      
001712      MOVE WKS-SISTE-PARAM   TO B00-GLO-SISTBIFIN(W77-IND-SIST)   050100      
001713      MOVE 1                 TO B00-GLO-NCTLBIFIN(W77-IND-SIST)   050200      
001714      MOVE 1                 TO W77-LLAVE                         050300      
001715      MOVE 31                TO W77-IND-SIST                      050400      
001716      PERFORM 033000-STORE-GLOB                                   050500      
001717      END-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB.        050600      
001718*                                                                 050700      
001719 000180-PROCESA-CATALOGOS.                                        050800      
001720*-------------------------                                        050900      
001721  PERFORM 000200-CARGA-CATALOGO                                   051000      
001722  IF S080-CP-RESULT   <  2                                        051100      
001723     PERFORM 000245-INIC-VAR-CAT2                                 051200      
001724     PERFORM 000270-VERIF-CAT UNTIL W77-FIN-CVES = 1.             051300      
001725                                                                  051400      
001726  PERFORM 000500-CARGA-ALERTAS UNTIL W77-FIN-TABLA = 1.           051500      
001727  IF WKS-SISTE-PARAM  = 18                                        051600      
001728     PERFORM 000800-CARGA-CPAE.                                   051700      
001729*                                                                 051800      
001730 000200-CARGA-CATALOGO.                                           051900      
001731*----------------------                                           052000      
001732  PERFORM 000240-INIC-VAR                                         052100      
001733  MOVE 1                TO  S080-CPPE-REGISTROS                   052200      
001734  MOVE WKS-SISTE-PARAM  TO  W77-SISTEMAS-CFR                      052210      
001735  IF W88-SISTEMAS-CFR                                             052220      
001736     MOVE W77-SISTEMAS-CFR TO WKS-SISTE-PARAM-STR                 052230      
001737     STRING "S" WKS-SISTE-PARAM-STR                               052240      
001738       DELIMITED BY SIZE                                          052250      
001739       INTO S018-CPPE-LLAVE-1-6(1)                                052260      
001740     MOVE 1059          TO  S080-CPPE-CATALOGO                    052265      
001741  ELSE                                                            052270      
001742     MOVE 523           TO  S080-CPPE-CATALOGO                    052280      
001743     MOVE WKS-SISTE-PARAM  TO  S080-CPPE-LLAVE1.                  052300      
001744  MOVE 1                TO  S080-CPPE-LLAVE2                      052400      
001745  MOVE 0                TO  S080-CPPE-FECHA-VIG                   052500      
001746  MOVE 0                TO  S080-CPPE-FECHA-CONS                  052600      
001747  MOVE 2                TO  S080-CPPE-ORDEN-BUSQ                  052800      
001748  MOVE 0                TO  TOT-CAT-REGS                          052900      
001749  PERFORM 000280-LLAMA-CALL                                       053000      
001750  IF S080-CP-RESULT < 2                                           053100      
001751     MOVE S080-CPPS-DATOS(1, 4) TO  W77-CAT-NUMCAT                053200      
001752     MOVE S080-CPPS-DATOS(1, 5) TO  W77-CAT-FORMATO               053300      
001753     MOVE 0                     TO  W77-FIN-CVES                  053400      
001754   ELSE                                                           053500      
001755     MOVE S080-CP-RESULT        TO  W77-ERR-CATALOGO              053600      
001756     MOVE "O"                   TO  TIPO-LJ                       053700      
001757     MOVE 020201                TO  CODIGO-LJ                     053800      
001758     STRING "ERROR EN CATALOGO P" W77-ERR-CATALOGO " S"           053900      
001759            WKS-SISTE-PARAM " ERROR " W77-ERR-CATALOGO            054000      
001760            DELIMITED BY SIZE INTO TEXTO-LJ                       054100      
001761            PERFORM 000-9999-LIBJ                                 054200      
001762     CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                     054300      
001763*                                                                 054400      
001764 000240-INIC-VAR.                                                 054500      
001765*----------------                                                 054600      
001766  MOVE LOW-VALUES               TO  S080-CP-PARAMETRO-ENT         054700      
001767  MOVE 151                      TO  S080-CP-SISTEMA               054800      
001768  MOVE 016                      TO  S080-CP-PROGRAMA              054900      
001769  MOVE 20                       TO  S080-CPPE-CLAVE               055000      
001770  MOVE ZEROS                    TO  W-CAT-ULT-NINI                055100      
001771  MOVE ZEROS                    TO  W-CAT-ULT-FECINI.             055200      
001772*                                                                 055300      
001773 000245-INIC-VAR-CAT2.                                            055400      
001774*---------------------                                            055500      
001775  PERFORM 000240-INIC-VAR                                         055600      
001776  MOVE ZEROS                    TO  W-CAT-ULT-NINI                055700      
001777  MOVE ZEROS                    TO  W-CAT-ULT-FECINI.             055800      
001778  MOVE 0                        TO  S080-CP-RESULT                056200      
001779  MOVE 10                       TO  S080-CPPE-REGISTROS           056300      
001780  MOVE W77-CAT-NUMCAT           TO  S080-CPPE-CATALOGO            056400      
001781  MOVE ZERO                     TO  S080-CPPE-FECHA-CONS          056500      
001782  MOVE ZERO                     TO  S080-CPPE-NIVEL-INI           056600      
001783  IF W77-CAT-FORMATO = 2                                          056700      
001784     MOVE 1                     TO  S080-CPPE-ORDEN-BUSQ          056800      
001785     MOVE WKS-SISTE-PARAM       TO  S080-CPPE-LLAVE1              056900      
001786     MOVE ZERO                  TO  S080-CPPE-LLAVE2              057000      
001787   ELSE                                                           057300      
001788    IF W77-CAT-FORMATO = 1                                        057400      
001789       MOVE 2                   TO  S080-CPPE-ORDEN-BUSQ          057500      
001790       MOVE ZERO                TO  S080-CPPE-LLAVE1              057600      
001791       MOVE WKS-SISTE-PARAM     TO  S080-CPPE-LLAVE2              057700      
001792     ELSE                                                         058000      
001793     IF W77-CAT-FORMATO = 3                                       058100      
001794        MOVE ZERO               TO  S080-CPPE-LLAVE1              058110      
001795        MOVE ZERO               TO  S080-CPPE-LLAVE2              058120      
001796        MOVE 1                  TO  S080-CPPE-ORDEN-BUSQ          058200      
001797     ELSE                                                         058300      
001798     IF W77-CAT-FORMATO = 4                                       058310      
001799        MOVE ZERO               TO  S080-CPPE-LLAVE1              058320      
001800        MOVE ZERO               TO  S080-CPPE-LLAVE2              058330      
001801        MOVE 2                  TO  S080-CPPE-ORDEN-BUSQ          058340      
001802     ELSE                                                         058500      
001803       MOVE S080-CP-RESULT      TO  W77-CAT-FORMATO               058600      
001804       MOVE "O"                 TO  TIPO-LJ                       058700      
001805       MOVE 020201              TO  CODIGO-LJ                     058800      
001806       STRING "NUMERO DE FORMATO NO VALIDO EN CAT. 523 SISTEMA S" 058900      
001807              WKS-SISTE-PARAM " FORMATO " W77-CAT-FORMATO         059000      
001808              DELIMITED BY SIZE  INTO TEXTO-LJ                    059100      
001809       PERFORM 000-9999-LIBJ                                      059200      
001810       CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                   059300      
001811*                                                                 059305      
001812 000270-VERIF-CAT.                                                059310      
001813*-----------------                                                059320      
001814       PERFORM 000280-LLAMA-CALL       .                          059330      
001815       PERFORM 000300-CARGA-PARAMETROS .                          059340      
001816*                                                                 059400      
001817 000280-LLAMA-CALL.                                               059500      
001818*------------------                                               059600      
001819  CALL "L710_CONSUL_DETALLE IN S080BD01CON"                       059700      
001820                    USING  S080-CP-SISTEMA                        059800      
001821                           S080-CP-PROGRAMA                       059900      
001822                           S080-CP-PARAMETRO-ENT                  060000      
001823                           S080-CP-PARAMETRO-SAL                  060100      
001824                    GIVING S080-CP-RESULT.                        060200      
001825*                                                                 060300      
001826 000300-CARGA-PARAMETROS.                                         060400      
001827*------------------------                                         060500      
001828  IF S080-CP-RESULT = 0 OR = 1                                    060600      
001829     ADD S080-CPPS-NUM-REGISTRO  TO  TOT-CAT-REGS                 060700      
001830     MOVE ZEROS                  TO  WS-CAT-S-IND                 060800      
001831     COMPUTE WS-CAT-REG-INI   =    TOT-CAT-REGS                   060900      
001832                                 - S080-CPPS-NUM-REGISTRO + 1     061000      
001833     PERFORM 000400-GUARDA-TABLA                                  061100      
001834               VARYING TAB-IND FROM  WS-CAT-REG-INI BY 1          061200      
001835                               UNTIL TAB-IND > TOT-CAT-REGS       061300      
001836     MOVE S080-CPPS-NIVEL-INI     TO  S080-CPPE-NIVEL-INI         061400      
001837     MOVE S080-CPPS-FECHA-CONS    TO  S080-CPPE-FECHA-CONS        061500      
001838     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1)  TO  S080-CPPE-LLAVE1  061510      
001839     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2)  TO  S080-CPPE-LLAVE2  061520      
001840     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 3)  TO  S080-CPPE-LLAVE3  061530      
001841     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 4)  TO  S080-CPPE-LLAVE4  061540      
001842     MOVE 0                       TO  WS-CAT-S-IND                061700      
001843     IF S080-CP-RESULT = 0                                        061800      
001844        MOVE 1                    TO  W77-FIN-CVES                061900      
001845      ELSE                                                        062000      
001846        NEXT SENTENCE                                             062100      
001847   ELSE                                                           062200      
001848     MOVE 1                    TO  W77-FIN-CVES                   062210      
001849     IF S080-CP-RESULT NOT = 20 AND                               062300      
001850        WS-CAT-REG-INI     = 0                                    062310      
001851        MOVE "O"                TO  TIPO-LJ                       062400      
001852        MOVE 020901             TO  CODIGO-LJ                     062500      
001853        MOVE S080-CPPE-CATALOGO TO W77-CAT-NUMCAT                 062505      
001854        MOVE S080-CP-RESULT     TO  W77-ERR-CATALOGO              062510      
001855        STRING "ERROR EN CATALOGO (P" W77-CAT-NUMCAT              062520      
001856               "), RESULT = ",W77-ERR-CATALOGO                    062600      
001857               DELIMITED BY SIZE INTO TEXTO-LJ                    062700      
001858        PERFORM 000-9999-LIBJ.                                    062800      
001859*                                                                 062900      
001860 000400-GUARDA-TABLA.                                             063000      
001861*--------------------                                             063100      
001862   ADD 1                                  TO  WS-CAT-S-IND        063200      
001863   PERFORM 000430-BUSCA-INDICE                                    063300      
001864   PERFORM 000450-PREG-TRANS.                                     063400      
001865*                                                                 063500      
001866 000430-BUSCA-INDICE.                                             063600      
001867*--------------------                                             063700      
001868   IF W77-CAT-FORMATO = 2                                         063800      
001869      MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2)  TO  W77-INDICE       063900      
001870    ELSE                                                          064000      
001871      MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1)  TO  W77-INDICE.      064100      
001872*                                                                 064200      
001873 000450-PREG-TRANS.                                               064300      
001874*------------------                                               064400      
001875  IF W77-CAT-FORMATO = 1                                          064500      
001876     MOVE ZEROES                  TO  WKS-TIP-MOV(W77-INDICE)     064510      
001877     MOVE ZEROES                  TO  WKS-TIP-MOV2(W77-INDICE)    064520      
001878     MOVE ZEROES                  TO  WKS-CAT-NATCON2(W77-INDICE) 064530      
001879     IF S080-CPPS-DATOS(WS-CAT-S-IND, 11) = 01 OR 02              064600      
001880        MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1)  TO                 064700      
001881                                 WKS-CAT-CVE(W77-INDICE)          064800      
001882        MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 11) TO                 065100      
001883                                 WKS-CAT-NATCON(W77-INDICE)       065200      
001884     ELSE                                                         065400      
001885        NEXT SENTENCE                                             065500      
001886  ELSE                                                            065600      
001887  IF W77-CAT-FORMATO = 2                                          065700      
001888     MOVE ZEROES                  TO  WKS-TIP-MOV(W77-INDICE)     065710      
001889     MOVE ZEROES                  TO  WKS-TIP-MOV2(W77-INDICE)    065720      
001890     MOVE ZEROES                  TO  WKS-CAT-NATCON2(W77-INDICE) 065730      
001891     IF S080-CPPS-DATOS(WS-CAT-S-IND, 11) =  01  OR 02            065800      
001892        MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2)    TO               065900      
001893                                      WKS-CAT-CVE(W77-INDICE)     066000      
001894        MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 11)   TO               066300      
001895                                      WKS-CAT-NATCON(W77-INDICE)  066400      
001896      ELSE                                                        066600      
001897        NEXT SENTENCE                                             066700      
001898  ELSE                                                            066800      
001899  IF W77-CAT-FORMATO =  3                                         066900      
001900     IF S080-CPPS-DATOS(WS-CAT-S-IND, 6) = 01 OR 02               067000      
001901            MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1) TO              067100      
001902                                     WKS-CAT-CVE(W77-INDICE)      067200      
001903            IF S080-CPPS-DATOS(WS-CAT-S-IND, 2) = 1               067300      
001904               MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2) TO           067400      
001905                                     WKS-TIP-MOV(W77-INDICE)      067500      
001906               MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 6) TO           067600      
001907                                     WKS-CAT-NATCON(W77-INDICE)   067700      
001908            ELSE                                                  067800      
001909               MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2) TO           067900      
001910                                     WKS-TIP-MOV2(W77-INDICE)     068000      
001911               MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 6) TO           068100      
001912                                     WKS-CAT-NATCON2(W77-INDICE)  068200      
001913     ELSE                                                         068300      
001914        NEXT SENTENCE                                             068400      
001915  ELSE                                                            068500      
001916     MOVE ZEROES                  TO  WKS-TIP-MOV(W77-INDICE)     068510      
001917     MOVE ZEROES                  TO  WKS-TIP-MOV2(W77-INDICE)    068520      
001918     MOVE ZEROES                  TO  WKS-CAT-NATCON2(W77-INDICE) 068530      
001919      IF W77-CAT-FORMATO =  4                                     068600      
001920         IF S080-CPPS-DATOS(WS-CAT-S-IND, 4) = 01 OR 02           068700      
001921            MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1) TO              068800      
001922                                     WKS-CAT-CVE(W77-INDICE)      068900      
001923            MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 4) TO              069200      
001924                                     WKS-CAT-NATCON(W77-INDICE).  069300      
001925*                                                                 071200      
001926 000500-CARGA-ALERTAS.                                            071300      
001927*---------------------                                            071400      
001928   PERFORM 000240-INIC-VAR                                        071500      
001929   MOVE 0                        TO  TOT-CAT-REGS                 071600      
001930   MOVE 0                        TO  WS-CAT-REG-INI               071700      
001931   MOVE 0                        TO  W77-FIN-TABLA                071800      
001932   MOVE 0                        TO  S080-CP-RESULT               071900      
001933   MOVE "S"                      TO  WKS-ULT-SISL                 072000      
001934   MOVE WKS-SISTE-PARAM          TO  WKS-ULT-SISN                 072100      
001935   MOVE 0                        TO  WKS-ULT-PROD                 072200      
001936   MOVE 0                        TO  WKS-ULT-INST                 072300      
001937   MOVE 0                        TO  WKS-ULT-MONEDA               072400      
001938   MOVE 1                        TO  S080-CPPE-ORDEN-BUSQ         072500      
001939   MOVE 10                       TO  S080-CPPE-REGISTROS          072510      
001940   MOVE 1254                     TO  S080-CPPE-CATALOGO           072520      
001941   MOVE ZERO                     TO  S080-CPPE-FECHA-CONS         072530      
001942   MOVE ZERO                     TO  S080-CPPE-NIVEL-INI          072540      
001943   MOVE WKS-ULT-SIS              TO  S018-CPPE-LLAVE-1-6(1)       072550      
001944   PERFORM 000550-CARGA-CAT1254 UNTIL W77-FIN-TABLA = 1.          072600      
001945*                                                                 073800      
001946 000550-CARGA-CAT1254.                                            073900      
001947*---------------------                                            074000      
001948  PERFORM 000280-LLAMA-CALL                                       074200      
001949  IF S080-CP-RESULT = 0 OR = 1                                    074300      
001950     PERFORM 000600-CARGA-TABALE                                  075010      
001951             VARYING TAB-IND FROM 1 BY 1                          075020      
001952             UNTIL   TAB-IND > S080-CPPS-NUM-REGISTRO             075030      
001953     MOVE WS-PIM                   TO  TOT-CAT-REGS               075040      
001954     SUBTRACT 1                    FROM TAB-IND                   075050      
001955     MOVE S080-CPPS-NIVEL-INI      TO  S080-CPPE-NIVEL-INI        075100      
001956     MOVE S080-CPPS-FECHA-CONS     TO  S080-CPPE-FECHA-CONS       075200      
001957     MOVE S080-CPPS-DATOS(TAB-IND, 2) TO S080-CPPE-LLAVE2         075300      
001958     MOVE S080-CPPS-DATOS(TAB-IND, 3) TO S080-CPPE-LLAVE3         075310      
001959     MOVE S080-CPPS-DATOS(TAB-IND, 4) TO S080-CPPE-LLAVE4         075320      
001960     IF S080-CP-RESULT = 0                                        075600      
001961        MOVE 1                     TO  W77-FIN-TABLA              075700      
001962      ELSE                                                        075800      
001963        NEXT SENTENCE                                             075900      
001964  ELSE                                                            076000      
001965     MOVE 1                      TO W77-FIN-TABLA                 076010      
001966     IF S080-CP-RESULT NOT = 20 AND                               076100      
001967        TOT-CAT-REGS       = 0                                    076105      
001968        MOVE 1                   TO  W77-FIN-TABLA                076110      
001969        MOVE "O"                 TO  TIPO-LJ                      076200      
001970        MOVE 020901              TO  CODIGO-LJ                    076300      
001971        MOVE S080-CPPE-CATALOGO  TO  W77-CAT-NUMCAT               076310      
001972        MOVE S080-CP-RESULT      TO  W77-ERR-CATALOGO             076350      
001973        STRING "ERROR EN CATALOGO (P" W77-CAT-NUMCAT              076400      
001974               "), RESULT = ",W77-ERR-CATALOGO                    076500      
001975               DELIMITED BY SIZE INTO TEXTO-LJ                    076510      
001976        PERFORM 000-9999-LIBJ.                                    076600      
001977*                                                                 076700      
001978 000600-CARGA-TABALE.                                             076800      
001979*--------------------                                             076900      
001980  IF S080-CPPS-DATOS(TAB-IND, 5) > 0 AND                          076910      
001981     S080-CPPS-DATOS(TAB-IND, 6) > 0                              076920      
001982     ADD 1                           TO WS-PIM                    077000      
001983     MOVE S080-CPPS-DATOS(TAB-IND,2) TO WKS-ULT-PRODX             077100      
001984     UNSTRING WKS-ULT-PRD4C DELIMITED BY SPACES INTO WKS-ULT-P    077200      
001985     MOVE WKS-ULT-P                 TO WKS-ALE-PRD(WS-PIM)        077300      
001986     MOVE S080-CPPS-DATOS(TAB-IND,3) TO WKS-ULT-INSTX             077400      
001987     UNSTRING WKS-ULT-INSTX DELIMITED BY SPACES INTO WKS-ULT-I    077500      
001988     MOVE WKS-ULT-I                 TO WKS-ALE-INST(WS-PIM)       077600      
001989     MOVE S080-CPPS-DATOS(TAB-IND,4) TO WKS-ALE-MONEDA(WS-PIM)    077700      
001990     MOVE S080-CPPS-DATOS(TAB-IND,6) TO WKS-ALE-LIMTRNABO(WS-PIM) 077800      
001991     MOVE S080-CPPS-DATOS(TAB-IND,5) TO WKS-ALE-LIMTRNCAR(WS-PIM).077900      
001992*                                                                 078000      
001993 000800-CARGA-CPAE.                                               078100      
001994*------------------                                               078200      
001995  PERFORM 000240-INIC-VAR                                         078300      
001996  MOVE 0                 TO  WKS-ULT-SIRH                         078400      
001997  MOVE 0                 TO  WKS-ULT-CPAE                         078500      
001998  MOVE 0                 TO  WS-CAT-S-IND                         078600      
001999  MOVE 0                 TO  W77-FIN-CVES                         078700      
002000  MOVE 0                 TO  TAB-IND                              078800      
002001  MOVE 0                 TO  WS-CAT-REG-INI                       078900      
002002  MOVE 0                 TO  TOT-CAT-REGS                         079000      
002003  MOVE 10                TO  S080-CPPE-REGISTROS                  079010      
002004  MOVE ZERO              TO  S080-CPPE-LLAVE1                     079020      
002005                             S080-CPPE-LLAVE2                     079030      
002006  MOVE 231               TO  S080-CPPE-CATALOGO                   079040      
002007  MOVE 1                 TO  S080-CPPE-ORDEN-BUSQ.                079050      
002008  PERFORM 000820-BUSC-CPAE UNTIL  W77-FIN-CVES = 1.               079100      
002009*                                                                 080000      
002010 000820-BUSC-CPAE.                                                080100      
002011*-----------------                                                080200      
002012  PERFORM 000280-LLAMA-CALL                                       080400      
002013  IF S080-CP-RESULT = 0 OR = 1                                    080500      
002014     ADD S080-CPPS-NUM-REGISTRO  TO  TOT-CAT-REGS                 080600      
002015     MOVE ZEROS                  TO  WS-CAT-S-IND                 080700      
002016     COMPUTE WS-CAT-REG-INI      =   TOT-CAT-REGS                 080800      
002017                                 -   S080-CPPS-NUM-REGISTRO + 1   080900      
002018     PERFORM 000850-GUARDA-CPAE                                   081000      
002019               VARYING TAB-IND FROM  WS-CAT-REG-INI BY 1          081100      
002020                               UNTIL TAB-IND > TOT-CAT-REGS       081200      
002021     MOVE S080-CPPS-NIVEL-INI    TO  S080-CPPE-NIVEL-INI          081300      
002022     MOVE S080-CPPS-FECHA-CONS   TO  S080-CPPE-FECHA-CONS         081400      
002023     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1)  TO  S080-CPPE-LLAVE1  081500      
002024     MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2)  TO  S080-CPPE-LLAVE2  081600      
002025                                                                  081700      
002026     IF S080-CP-RESULT = 0                                        081800      
002027        MOVE 1                   TO  W77-FIN-CVES                 081900      
002028      ELSE                                                        082000      
002029        NEXT SENTENCE                                             082100      
002030   ELSE                                                           082200      
002031    MOVE 1                       TO  W77-FIN-CVES                 082210      
002032    IF S080-CP-RESULT > 1  AND WS-CAT-REG-INI = 0                 082300      
002033       MOVE "O"                  TO  TIPO-LJ                      082400      
002034       MOVE 020901               TO  CODIGO-LJ                    082500      
002035       STRING "ERROR CARGA DE CATALOGO 231 CPAEs",                082600      
002036              DELIMITED BY SIZE INTO TEXTO-LJ                     082700      
002037       PERFORM 000-9999-LIBJ.                                     082800      
002038*                                                                 082900      
002039 000850-GUARDA-CPAE.                                              083000      
002040*-------------------                                              083100      
002041    ADD 1          TO  WS-CAT-S-IND                               083200      
002042    IF (S080-CPPS-DATOS(WS-CAT-S-IND, 2)      >  ZEROS  AND       083300      
002043        S080-CPPS-DATOS(WS-CAT-S-IND, 2)      <  10000)           083400      
002044       ADD 1                                 TO WKS-IND-CPAE      083500      
002045       MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 1) TO                   083600      
002046                                      WKS-T-SUCOPER(WKS-IND-CPAE) 083700      
002047       MOVE S080-CPPS-DATOS(WS-CAT-S-IND, 2) TO                   083800      
002048                                      WKS-T-CPAE(WKS-IND-CPAE).   083900      
002049*                                                                 084000      
002050 001300-PROC-LOGS.                                                084100      
002051*-----------------                                                084200      
002052  ACCEPT WKS-HORA-PROCESO FROM TIME                               084210      
002053  IF WKS-HORA-HMS > WKS-HORA-LIMITE                               084220      
002054     MOVE 9                        TO W77-SW-FIN                  084222      
002055     MOVE 1                        TO W77-LLAVE                   084224      
002056  ELSE                                                            084240      
002057     MOVE ZERO                    TO A00-R01-FUNCION              084290      
002058     PERFORM 001310-LEE-BLOCK1 UNTIL A00-R01-FUNCION = 99         084300      
002059                                  OR W77-END-LOGS = 1             084305      
002060     IF W77-END-LOGS = 0                                          084306      
002061        MOVE ZERO                 TO A00-R01-FUNCION              084308      
002062        PERFORM 001320-LEE-BLOCK2 UNTIL A00-R01-FUNCION = 99      084310      
002063                                  OR W77-END-LOGS = 1             084315      
002064        WAIT UNTIL W77-TIME                                       084320      
002065        ADD 1                     TO W77-VECES                    084322      
002066        IF W77-VECES > 24                                         084324      
002067           MOVE ZERO              TO W77-VECES                    084326      
002068           IF W88-OPEN                                            084328      
002069              CLOSE L01-DATOS                                     084330      
002070                    L02-DATOS                                     084332      
002071              MOVE ZERO           TO W77-OPEN                     084334      
002072              OPEN INPUT L01-DATOS                                084336      
002073                         L02-DATOS                                084338      
002074              MOVE 1              TO W77-OPEN.                    084340      
002075                                                                  084342      
002076 001310-LEE-BLOCK1.                                               084344      
002077*==================                                               084350      
002078  COMPUTE W77-LLAVE = W77-LLAVE + 1                            .  084360      
002079  PERFORM 080100-LEE-LOG                                       .  084400      
002080  PERFORM 001330-REVISA-FUNCION                                .  084410      
002081                                                                  084420      
002082 001320-LEE-BLOCK2.                                               084430      
002083*==================                                               084440      
002084  COMPUTE W77-LLAVE = W77-LLAVE + 1                            .  084445      
002085  PERFORM 080200-LEE-LOG2                                      .  084450      
002086  PERFORM 001330-REVISA-FUNCION                                .  084460      
002087                                                                  084470      
002088 001330-REVISA-FUNCION.                                           084480      
002089*======================                                           084490      
002090  IF W88-NOERROR-LOG                                              084560      
002091* <IBM>-INICIO -ESS- FILTRO PARA MOVIMIENTOS TELETON              084570      
002092    IF A00-R01-SISTEMA = 500 AND                                  084575      
002093      (A00-R01-TIPO-PROC  = 40 OR 41 OR 42 OR 43)                 084580      
002094      NEXT SENTENCE                                               084585      
002095    ELSE                                                          084590      
002096* <IBM>-FIN -ESS- FILTRO PARA MOVIMIENTOS TELETON                 084595      
002097      IF ((A00-R01-FUNCION = 01) AND (A00-R01-ORIGEN = 01 OR 02)) 084600      
002098         PERFORM 001500-GUARDA-TABLA                              084700      
002099         ADD 1                    TO W77-TRANSACCIONES            084800      
002100      ELSE                                                        084900      
002101        IF  (A00-R01-FUNCION = 02)                                085000      
002102          ADD 1                    TO W77-TRANSACCIONES           085080      
002103          MOVE W77-LLAVE           TO W77-NIV-BASE                085090      
002104          MOVE 1                   TO W77-AUT-ANT                 085100      
002105          PERFORM 001880-APLICA-ELIMINACION  UNTIL                085200      
002106                                            W77-AUT-ANT  = 0      085300      
002107          MOVE W77-NIV-BASE        TO W77-LLAVE                   085306      
002108        ELSE                                                      085308      
002109          NEXT SENTENCE                                           085310      
002110  ELSE                                                            085312      
002111     PERFORM 001340-RESTABLECE-SISTEMA.                           085314      
002112                                                                  085320      
002113  IF W77-TRANSACCIONES > 99                                       085400      
002114     MOVE ZERO                    TO W77-TRANSACCIONES            085500      
002115     MOVE W77-LLAVE               TO W77-NIV-BASE                 085600      
002116     PERFORM 031100-ACT-GLOB-C10MIN                               085700      
002117     MOVE ZEROS                   TO W77-FIN-TABLA                085800      
002118     MOVE 1                       TO W77-INDICE                   085900      
002119     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB        086000      
002120     PERFORM 001900-ACT-BASE      UNTIL W88-FIN-TAB               086100      
002121     END-TRANSACTION NO-AUDIT S151B99REINICTL   OF BIFINDB        086200      
002122     MOVE W77-NIV-BASE            TO W77-LLAVE.                   086300      
002123                                                                  086400      
002124   IF A00-R01-FUNCION = 99                                        086700      
002125      COMPUTE W77-LLAVE = W77-LLAVE - 1.                          087000      
002126*                                                                 088100      
002127 001340-RESTABLECE-SISTEMA.                                       088102      
002128*==========================                                       088104      
002129   IF W88-OPEN                                                    088106      
002130      CLOSE L01-DATOS WITH RELEASE                                088108      
002131      CLOSE L02-DATOS WITH RELEASE.                               088110      
002132   MOVE ZERO                       TO W77-LLAVE                   088112      
002133                                      W77-OPEN.                   088113      
002134   OPEN INPUT L01-DATOS L02-DATOS.                                088114      
002135   MOVE 1                          TO W77-OPEN.                   088115      
002136   PERFORM 001350-BUSCA-FN-99 UNTIL A00-R01-FUNCION   = 99.       088116      
002137   MOVE ZERO                       TO W77-TRANSACCIONES.          088118      
002138                                                                  088122      
002139 001350-BUSCA-FN-99.                                              088124      
002140*===================                                              088126      
002141   READ L01-DATOS INTO  A00-R01-REGMOV                            088128      
002142       AT END MOVE 1               TO A00-R01-FUNCION.            088129      
002143   ADD 1                           TO W77-LLAVE.                  088130      
002144                                                                  088132      
002145 001500-GUARDA-TABLA.                                             090200      
002146*--------------------                                             090300      
002147   MOVE ZEROS                      TO  W77-NO-ERROR               090400      
002148   MOVE ZEROS                      TO  W77-PIMC                   090500      
002149   MOVE ZEROS                      TO  W77-OK                     090600      
002150   MOVE A00-R01-PRODUCTO           TO  W77-PRD                    090700      
002151   MOVE A00-R01-INSTRUMENTO        TO  W77-INST                   090800      
002152   MOVE A00-R01-MONEDA             TO  W77-MONEDA                 090900      
002153   MOVE ZEROS                      TO  W77-CEPAE                  091000      
002154   IF WKS-SISTE-PARAM = 18                                        091100      
002155      PERFORM 045500-TRAE-CEPAE.                                  091200      
002156   PERFORM 001600-GDA-TABLA VARYING W77-INDICE FROM 1 BY 1        091300      
002157                             UNTIL  W77-INDICE  >  WKS-IND-TAB OR 091400      
002158                                                   W77-OK  = 1.   091500      
002159   IF (W77-INDICE  >  WKS-IND-TAB AND                             091600      
002160           W77-OK  =  0)                                          091700      
002161      MOVE 0                       TO  WKS-CVE-TRANS              091710      
002162      MOVE 0                       TO  WKS-IMPORTE-CARG           091720      
002163                                       WKS-IMPORTE-ABON           091730      
002164      MOVE 0                       TO  WKS-BAND-INCR              091740      
002165      PERFORM  001800-MVE-TABLA                                   091800      
002166               VARYING W77-IND FROM 1 BY 1                        091810      
002167               UNTIL   W77-IND > 5    OR                          091820      
002168                       A00-R01-CVETRAN(W77-IND) = 0.              091830      
002169*                                                                 091900      
002170 001600-GDA-TABLA.                                                092000      
002171*-----------------                                                092100      
002172  IF WKS-TOT-PIMC(W77-INDICE)  =   W77-PIMC                       092200      
002173     MOVE 1                    TO  W77-OK                         092300      
002174     PERFORM 001710-SUMA-CARGOS-ABONOS.                           092400      
002175 001650-BUSCA-INDICE.                                             092410      
002176*--------------------                                             092420      
002177  IF WKS-TOT-PIMC(W77-INDICE)  =   W77-PIMC                       092430      
002178     MOVE 1                    TO  W77-OK.                        092440      
002179*                                                                 092500      
002180 001710-SUMA-CARGOS-ABONOS.                                       092600      
002181*--------------------------                                       092700      
002182   MOVE 0                       TO  WKS-CVE-TRANS                 092800      
002183   MOVE 0                       TO  WKS-IMPORTE-CARG              092900      
002184                                    WKS-IMPORTE-ABON              093000      
002185       PERFORM 001715-ACUMULA                                     093300      
002186               VARYING W77-IND FROM 1 BY 1                        093400      
002187               UNTIL   W77-IND > 5 OR                             093500      
002188                       A00-R01-CVETRAN(W77-IND) = 0.              093600      
002189*                                                                 094600      
002190 001715-ACUMULA.                                                  094700      
002191*---------------                                                  094800      
002192   ADD  1                        TO  W77-TOT-CVES                 094810      
002193   MOVE W77-IND                  TO  WS-NUMOCURR                  094900      
002194   IF W77-CAT-FORMATO  =    3    AND                              095100      
002195     (A00-R01-ESQCON(W77-IND)  = 1 OR 2)                          095110      
002196      IF WKS-TIP-MOV(A00-R01-CVETRAN(W77-IND)) = 1                095120      
002197         IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 1          095200      
002198            ADD 1                  TO WKS-TOT-NUM-CAR(W77-INDICE) 095300      
002199            ADD  A00-R01-IMPORTE(W77-IND)                         095400      
002200                                   TO WKS-TOT-IMP-CAR(W77-INDICE) 095410      
002201            MOVE A00-R01-CVETRAN(W77-IND) TO  WKS-CVE-TRANS       095500      
002202            MOVE A00-R01-IMPORTE(W77-IND) TO  WKS-IMPORTE-CARG    095600      
002203            PERFORM 050000-BUSCA-PRDINST                          095700      
002204              VARYING WKS-PIM FROM 1 BY 1  UNTIL WKS-PIM  > WS-PIM095800      
002205         ELSE                                                     095900      
002206         IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 2          096000      
002207            ADD 1                  TO  WKS-TOT-NUM-ABO(W77-INDICE)096100      
002208            ADD  A00-R01-IMPORTE(W77-IND)                         096200      
002209                                   TO  WKS-TOT-IMP-ABO(W77-INDICE)096210      
002210            MOVE A00-R01-CVETRAN(W77-IND)  TO  WKS-CVE-TRANS      096300      
002211            MOVE A00-R01-IMPORTE(W77-IND)  TO  WKS-IMPORTE-ABON   096400      
002212            PERFORM 050000-BUSCA-PRDINST                          096500      
002213               VARYING WKS-PIM FROM 1 BY 1 UNTIL WKS-PIM  > WS-PIM096600      
002214         ELSE                                                     096610      
002215            NEXT SENTENCE                                         096620      
002216      ELSE                                                        096700      
002217      IF WKS-CAT-NATCON2(A00-R01-CVETRAN(W77-IND)) = 1            096800      
002218         ADD 1                     TO  WKS-TOT-NUM-CAR(W77-INDICE)096900      
002219         ADD  A00-R01-IMPORTE(W77-IND)                            097000      
002220                                   TO  WKS-TOT-IMP-CAR(W77-INDICE)097010      
002221         MOVE A00-R01-CVETRAN(W77-IND)     TO  WKS-CVE-TRANS      097100      
002222         MOVE A00-R01-IMPORTE(W77-IND)     TO  WKS-IMPORTE-CARG   097200      
002223         PERFORM 050000-BUSCA-PRDINST                             097300      
002224            VARYING WKS-PIM FROM 1 BY 1  UNTIL WKS-PIM  > WS-PIM  097400      
002225       ELSE                                                       097500      
002226       IF WKS-CAT-NATCON2(A00-R01-CVETRAN(W77-IND)) = 2           097600      
002227          ADD 1                    TO  WKS-TOT-NUM-ABO(W77-INDICE)097700      
002228          ADD  A00-R01-IMPORTE(W77-IND)                           097800      
002229                                   TO  WKS-TOT-IMP-ABO(W77-INDICE)097810      
002230          MOVE A00-R01-CVETRAN(W77-IND)   TO  WKS-CVE-TRANS       097900      
002231          MOVE A00-R01-IMPORTE(W77-IND)   TO  WKS-IMPORTE-ABON    098000      
002232          PERFORM 050000-BUSCA-PRDINST                            098100      
002233             VARYING WKS-PIM FROM 1 BY 1  UNTIL WKS-PIM  > WS-PIM 098200      
002234       ELSE                                                       098300      
002235          NEXT SENTENCE                                           098400      
002236   ELSE                                                           098500      
002237   IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 1                098600      
002238      ADD 1                     TO  WKS-TOT-NUM-CAR(W77-INDICE)   098700      
002239      ADD  A00-R01-IMPORTE(W77-IND)                               098800      
002240                                TO  WKS-TOT-IMP-CAR(W77-INDICE)   098810      
002241      MOVE A00-R01-CVETRAN(W77-IND)     TO  WKS-CVE-TRANS         098900      
002242      MOVE A00-R01-IMPORTE(W77-IND)     TO  WKS-IMPORTE-CARG      099000      
002243      PERFORM 050000-BUSCA-PRDINST                                099100      
002244         VARYING WKS-PIM  FROM 1 BY 1  UNTIL WKS-PIM  > WS-PIM    099200      
002245    ELSE                                                          099300      
002246     IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 2              099400      
002247        ADD 1                   TO  WKS-TOT-NUM-ABO(W77-INDICE)   099500      
002248        ADD  A00-R01-IMPORTE(W77-IND)                             099600      
002249                                TO  WKS-TOT-IMP-ABO(W77-INDICE)   099610      
002250        MOVE A00-R01-CVETRAN(W77-IND)   TO  WKS-CVE-TRANS         099700      
002251        MOVE A00-R01-IMPORTE(W77-IND)   TO  WKS-IMPORTE-ABON      099800      
002252        PERFORM 050000-BUSCA-PRDINST                              099900      
002253           VARYING WKS-PIM  FROM 1 BY 1  UNTIL WKS-PIM  > WS-PIM. 100000      
002254                                                                  100100      
002255*                                                                 122200      
002256 001720-SUST-CARGOS-ABONOS.                                       122300      
002257*--------------------------                                       122400      
002258  SUBTRACT  1                    FROM W77-TOT-CVES                122610      
002259  IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 1                 124400      
002260     SUBTRACT 1                  FROM  WKS-TOT-NUM-CAR(W77-INDICE)124500      
002261     SUBTRACT A00-R01-IMPORTE(W77-IND)                            124600      
002262                                 FROM  WKS-TOT-IMP-CAR(W77-INDICE)124610      
002263  ELSE                                                            124700      
002264  IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 2                 124800      
002265     SUBTRACT 1                 FROM  WKS-TOT-NUM-ABO(W77-INDICE) 124900      
002266     SUBTRACT A00-R01-IMPORTE(W77-IND)                            125000      
002267                                FROM  WKS-TOT-IMP-ABO(W77-INDICE).125010      
002268*                                                                 129100      
002269 001800-MVE-TABLA.                                                129200      
002270*-----------------                                                129300      
002271  MOVE W77-IND                    TO  WS-NUMOCURR                 131600      
002272  IF W77-CAT-FORMATO  =    3      AND                             131710      
002273    (A00-R01-ESQCON(W77-IND)  = 1 OR 2)                           131720      
002274     IF WKS-TIP-MOV(A00-R01-CVETRAN(W77-IND)) = 1                 131730      
002275        IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 1           131900      
002276           PERFORM 001860-INCR-INDICE                             132000      
002277           MOVE W77-PIMC         TO  WKS-TOT-PIMC(WKS-IND-TAB)    132100      
002278           ADD 1                 TO  WKS-TOT-NUM-CAR(WKS-IND-TAB) 132200      
002279           ADD A00-R01-IMPORTE(W77-IND)                           132300      
002280                                 TO  WKS-TOT-IMP-CAR(WKS-IND-TAB) 132310      
002281           MOVE 0                TO  WKS-TOT-NUM-ABO(WKS-IND-TAB) 132400      
002282           MOVE 0                TO  WKS-TOT-IMP-ABO(WKS-IND-TAB) 132500      
002283           MOVE A00-R01-CVETRAN(W77-IND)   TO  WKS-CVE-TRANS      132600      
002284           MOVE A00-R01-IMPORTE(W77-IND)   TO  WKS-IMPORTE-CARG   132700      
002285           PERFORM 050000-BUSCA-PRDINST                           132800      
002286              VARYING WKS-PIM  FROM 1 BY 1                        132900      
002287              UNTIL WKS-PIM  > WS-PIM                             132910      
002288        ELSE                                                      133000      
002289        IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 2           133100      
002290           PERFORM 001860-INCR-INDICE                             133200      
002291           MOVE W77-PIMC         TO WKS-TOT-PIMC(WKS-IND-TAB)     133300      
002292           ADD 1                 TO  WKS-TOT-NUM-ABO(WKS-IND-TAB) 133400      
002293           ADD A00-R01-IMPORTE(W77-IND)                           133500      
002294                                 TO  WKS-TOT-IMP-ABO(WKS-IND-TAB) 133510      
002295           MOVE 0                TO  WKS-TOT-NUM-CAR(WKS-IND-TAB) 133600      
002296           MOVE 0                TO  WKS-TOT-IMP-CAR(WKS-IND-TAB) 133700      
002297           MOVE A00-R01-CVETRAN(W77-IND) TO  WKS-CVE-TRANS        133800      
002298           MOVE A00-R01-IMPORTE(W77-IND) TO  WKS-IMPORTE-ABON     133900      
002299           PERFORM 050000-BUSCA-PRDINST                           134000      
002300              VARYING WKS-PIM  FROM 1 BY 1                        134100      
002301              UNTIL WKS-PIM  > WS-PIM                             134110      
002302        ELSE                                                      134120      
002303           NEXT SENTENCE                                          134130      
002304     ELSE                                                         134200      
002305     IF WKS-CAT-NATCON2(A00-R01-CVETRAN(W77-IND)) = 1             134300      
002306        PERFORM 001860-INCR-INDICE                                134400      
002307        MOVE W77-PIMC           TO  WKS-TOT-PIMC(WKS-IND-TAB)     134500      
002308        ADD 1                   TO  WKS-TOT-NUM-CAR(WKS-IND-TAB)  134600      
002309        ADD A00-R01-IMPORTE(W77-IND)                              134700      
002310                                TO  WKS-TOT-IMP-CAR(WKS-IND-TAB)  134710      
002311        MOVE 0                  TO  WKS-TOT-NUM-ABO(WKS-IND-TAB)  134800      
002312        MOVE 0                  TO  WKS-TOT-IMP-ABO(WKS-IND-TAB)  134900      
002313        MOVE A00-R01-CVETRAN(W77-IND)   TO  WKS-CVE-TRANS         135000      
002314        MOVE A00-R01-IMPORTE(W77-IND)   TO  WKS-IMPORTE-CARG      135100      
002315        PERFORM 050000-BUSCA-PRDINST                              135200      
002316           VARYING WKS-PIM  FROM 1 BY 1                           135300      
002317           UNTIL WKS-PIM  > WS-PIM                                135310      
002318     ELSE                                                         135400      
002319     IF WKS-CAT-NATCON2(A00-R01-CVETRAN(W77-IND)) = 2             135500      
002320        PERFORM 001860-INCR-INDICE                                135600      
002321        MOVE W77-PIMC         TO WKS-TOT-PIMC(WKS-IND-TAB)        135700      
002322        ADD 1                 TO  WKS-TOT-NUM-ABO(WKS-IND-TAB)    135800      
002323        ADD A00-R01-IMPORTE(W77-IND)                              135900      
002324                              TO  WKS-TOT-IMP-ABO(WKS-IND-TAB)    135910      
002325        MOVE 0                TO  WKS-TOT-NUM-CAR(WKS-IND-TAB)    136000      
002326        MOVE 0                TO  WKS-TOT-IMP-CAR(WKS-IND-TAB)    136100      
002327        MOVE A00-R01-CVETRAN(W77-IND) TO  WKS-CVE-TRANS           136200      
002328        MOVE A00-R01-IMPORTE(W77-IND) TO  WKS-IMPORTE-ABON        136300      
002329        PERFORM 050000-BUSCA-PRDINST                              136400      
002330           VARYING WKS-PIM  FROM 1 BY 1                           136500      
002331           UNTIL WKS-PIM  > WS-PIM                                136510      
002332     ELSE                                                         136600      
002333        NEXT SENTENCE                                             136700      
002334  ELSE                                                            136800      
002335  IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 1                 136900      
002336     PERFORM 001860-INCR-INDICE                                   137000      
002337     MOVE W77-PIMC           TO  WKS-TOT-PIMC(WKS-IND-TAB)        137100      
002338     ADD 1                   TO  WKS-TOT-NUM-CAR(WKS-IND-TAB)     137200      
002339     ADD A00-R01-IMPORTE(W77-IND)                                 137300      
002340                             TO  WKS-TOT-IMP-CAR(WKS-IND-TAB)     137310      
002341     MOVE 0                  TO  WKS-TOT-NUM-ABO(WKS-IND-TAB)     137400      
002342     MOVE 0                  TO  WKS-TOT-IMP-ABO(WKS-IND-TAB)     137500      
002343     MOVE A00-R01-CVETRAN(W77-IND)   TO  WKS-CVE-TRANS            137600      
002344     MOVE A00-R01-IMPORTE(W77-IND)   TO  WKS-IMPORTE-CARG         137700      
002345     PERFORM 050000-BUSCA-PRDINST                                 137800      
002346        VARYING WKS-PIM  FROM 1 BY 1                              137900      
002347        UNTIL WKS-PIM  > WS-PIM                                   137910      
002348   ELSE                                                           138000      
002349     IF WKS-CAT-NATCON(A00-R01-CVETRAN(W77-IND)) = 2              138100      
002350        PERFORM 001860-INCR-INDICE                                138200      
002351        MOVE W77-PIMC         TO WKS-TOT-PIMC(WKS-IND-TAB)        138300      
002352        ADD 1                 TO  WKS-TOT-NUM-ABO(WKS-IND-TAB)    138400      
002353        ADD A00-R01-IMPORTE(W77-IND)                              138500      
002354                              TO  WKS-TOT-IMP-ABO(WKS-IND-TAB)    138510      
002355        MOVE 0                TO  WKS-TOT-NUM-CAR(WKS-IND-TAB)    138600      
002356        MOVE 0                TO  WKS-TOT-IMP-CAR(WKS-IND-TAB)    138700      
002357        MOVE A00-R01-CVETRAN(W77-IND) TO  WKS-CVE-TRANS           138800      
002358        MOVE A00-R01-IMPORTE(W77-IND) TO  WKS-IMPORTE-ABON        138900      
002359        PERFORM 050000-BUSCA-PRDINST                              139000      
002360           VARYING WKS-PIM  FROM 1 BY 1                           139100      
002361           UNTIL WKS-PIM  > WS-PIM.                               139110      
002362*                                                                 170800      
002363 001860-INCR-INDICE.                                              170900      
002364*-------------------                                              171000      
002365  IF WKS-BAND-INCR   =   0                                        171100      
002366     COMPUTE WKS-IND-TAB  = WKS-IND-TAB + 1                       171200      
002367     MOVE 1          TO  WKS-BAND-INCR.                           171300      
002368*                                                                 171400      
002369 001880-APLICA-ELIMINACION.                                       171500      
002370*--------------------------                                       171600      
002371  MOVE ZERO                          TO  W77-NOERROR-LOG          171700      
002372  COMPUTE W77-LLAVE = A00-R01-AUT-AELIM-S151 + 1.                 171800      
002373  PERFORM  080200-LEE-LOG2.                                       171900      
002374                                                                  172000      
002375  IF W77-NOERROR-LOG    =   0     AND                             172100      
002376     A00-R01-FUNCION    =   1                                     172200      
002377     MOVE A00-R01-PRODUCTO           TO  W77-PRD                  172300      
002378     MOVE A00-R01-INSTRUMENTO        TO  W77-INST                 172400      
002379     MOVE A00-R01-MONEDA             TO  W77-MONEDA               172500      
002380     MOVE ZEROS                      TO  W77-CEPAE                172600      
002381     MOVE A00-R01-AUT-ANT-S151       TO  W77-AUT-ANT              172700      
002382* PARA CEPAE                                                      172800      
002383     MOVE ZEROS                      TO WKS-CEPAE                 172900      
002384     MOVE A00-R01-SUCOPER            TO A00-R01-SUCOPER           173000      
002385     PERFORM 001950-PREG-S018                                     173100      
002386     MOVE ZERO                       TO  W77-OK                   173110      
002387     PERFORM 001650-BUSCA-INDICE VARYING W77-INDICE FROM 1 BY 1   173120      
002388                                 UNTIL   W77-INDICE > WKS-IND-TAB 173130      
002389                                     OR  W77-OK     = 1           173140      
002390     IF W77-OK = 1                                                173150      
002391        COMPUTE W77-INDICE = W77-INDICE - 1                       173160      
002392        PERFORM 001720-SUST-CARGOS-ABONOS                         173200      
002393                VARYING W77-IND FROM 1 BY 1                       173210      
002394                UNTIL   W77-IND > 5 OR                            173220      
002395                        A00-R01-CVETRAN(W77-IND) = 0              173230      
002396     ELSE                                                         173240      
002397        NEXT SENTENCE                                             173250      
002398  ELSE                                                            173260      
002399     MOVE ZERO                       TO W77-AUT-ANT.              173270      
002400                                                                  173280      
002401     IF W77-AUT-ANT NOT = 0                                       173300      
002402        MOVE   W77-AUT-ANT        TO  A00-R01-AUT-AELIM-S151.     173400      
002403*                                                                 174000      
002404 001900-ACT-BASE.                                                 174100      
002405*----------------                                                 174200      
002406  MOVE 0           TO  W77-ENCONTRE.                              174300      
002407  PERFORM 002010-BUSCA-TAB-TOT                                    174400      
002408          VARYING W77-IND FROM W77-INDICE BY 1                    174500      
002409          UNTIL   W88-ENCONTRE OR W88-FIN-TAB OR                  174510      
002410                  W77-IND > 3000.                                 174520      
002411 IF W77-IND > 3000                                                174530      
002412    MOVE 1         TO W77-FIN-TABLA                               174540      
002413 ELSE                                                             174550      
002414    COMPUTE W77-INDICE = W77-IND - 1.                             174560      
002415                                                                  174570      
002416 IF NOT W88-FIN-TAB                                               174600      
002417    PERFORM 001960-LOCK-B01                                       174700      
002418    IF W77-PRDYINSTMC  = 0                                        174800      
002419       PERFORM 030100-MUEVE-B01                                   174900      
002420       PERFORM 031000-STORE-B01                                   175000      
002421    ELSE                                                          175100      
002422       PERFORM 030000-CREA-B01                                    175200      
002423       IF W88-NO-ERROR                                            175300      
002424          PERFORM 030100-MUEVE-B01                                175310      
002425          PERFORM 031000-STORE-B01.                               175400      
002426                                                                  175900      
002427  IF NOT W88-FIN-TAB                                              176000      
002428    ADD  1         TO  W77-INDICE.                                176100      
002429*                                                                 176200      
002430 001950-PREG-S018.                                                176300      
002431*-----------------                                                176400      
002432   MOVE ZEROS        TO WKS-CEPAE                                 176500      
002433   IF WKS-SISTE-PARAM = 18                                        176600      
002434      PERFORM 045500-TRAE-CEPAE                                   176700      
002435      MOVE W77-CEPAE TO WKS-CEPAE.                                176800      
002436*                                                                 176900      
002437 001960-LOCK-B01.                                                 177000      
002438*----------------                                                 177100      
002439  MOVE 0            TO  W77-PRDYINSTMC                            177200      
002440  LOCK B01SXTOTPROD AT                                            177400      
002441  (B01-TOT-SISTEMA  =  WKS-SISTE-PARAM            AND             177500      
002442   B01-TOT-CSI      =  W77-NUM-CSI                AND             177600      
002443   B01-TOT-FECINF   =  WKS-FECHA-PARAM            AND             177700      
002444   B01-TOT-PRODUCTO =  WKS-TOT-PRD(W77-INDICE)    AND             177800      
002445   B01-TOT-INSTSERV =  WKS-TOT-INST(W77-INDICE)   AND             177900      
002446   B01-TOT-MONEDA   =  WKS-TOT-MONEDA(W77-INDICE) AND             178000      
002447   B01-TOT-CPAE     =  WKS-TOT-CPAE(W77-INDICE) )                 178100      
002448   ON EXCEPTION                                                   178200      
002449      IF DMSTATUS(NOTFOUND)                                       178300      
002450         MOVE 1         TO  W77-PRDYINSTMC.                       178400      
002451*                                                                 182500      
002452 002010-BUSCA-TAB-TOT.                                            183700      
002453*---------------------                                            183800      
002454   MOVE 0            TO  W77-ENCONTRE                             183900      
002455   IF WKS-TOT-NUM-ABO(W77-IND) > ZEROS OR                         184000      
002456      WKS-TOT-NUM-CAR(W77-IND) > ZEROS OR                         184100      
002457      WKS-TOT-IMP-ABO(W77-IND) > ZEROS OR                         184200      
002458      WKS-TOT-IMP-CAR(W77-IND) > ZEROS                            184300      
002459      MOVE 1         TO  W77-ENCONTRE                             184400      
002460    ELSE                                                          184500      
002461    IF (WKS-TOT-PRD   (W77-IND) = ZEROS AND                       184600      
002462         WKS-TOT-INST  (W77-IND) = ZEROS AND                      184700      
002463         WKS-TOT-MONEDA(W77-IND) = ZEROS AND                      184800      
002464         WKS-TOT-CPAE  (W77-IND) = ZEROS)                         184900      
002465         MOVE 1      TO W77-FIN-TABLA.                            185000      
002466*                                                                 185100      
002467 030000-CREA-B01.                                                 185200      
002468*----------------                                                 185300      
002469  MOVE 0              TO  W77-NO-ERROR                            185400      
002470  CREATE S151B01TOTPROD                                           185500      
002471    ON EXCEPTION                                                  185600      
002472     MOVE 1           TO  W77-NO-ERROR.                           185700      
002473*                                                                 186000      
002474 030100-MUEVE-B01.                                                186010      
002475*================                                                 186020      
002476     MOVE WKS-SISTE-PARAM             TO  B01-TOT-SISTEMA  .      186200      
002477     MOVE W77-NUM-CSI                 TO  B01-TOT-CSI      .      186300      
002478     MOVE WKS-FECHA-PARAM             TO  B01-TOT-FECINF   .      186400      
002479     MOVE WKS-TOT-PRD    (W77-INDICE) TO  B01-TOT-PRODUCTO .      186500      
002480     MOVE WKS-TOT-INST   (W77-INDICE) TO  B01-TOT-INSTSERV .      186600      
002481     MOVE WKS-TOT-MONEDA (W77-INDICE) TO  B01-TOT-MONEDA   .      186700      
002482     MOVE WKS-TOT-CPAE   (W77-INDICE) TO  B01-TOT-CPAE     .      186800      
002483     MOVE WKS-TOT-NUM-CAR(W77-INDICE) TO  B01-TOT-NUMCARGOS.      186900      
002484     MOVE WKS-TOT-NUM-ABO(W77-INDICE) TO  B01-TOT-NUMABONOS.      187000      
002485     MOVE WKS-TOT-IMP-CAR(W77-INDICE) TO  B01-TOT-IMPCARGOS.      187100      
002486     MOVE WKS-TOT-IMP-ABO(W77-INDICE) TO  B01-TOT-IMPABONOS.      187200      
002487*                                                                 187300      
002488 031000-STORE-B01.                                                187400      
002489*-----------------                                                187500      
002490  MOVE 0                        TO  W77-NO-ERROR                  187600      
002491  STORE S151B01TOTPROD                                            187700      
002492    ON EXCEPTION                                                  187800      
002493       MOVE DMSTATUS(DMCATEGORY)       TO W77-NUM-CAT             187820      
002494       MOVE DMSTATUS(DMERRORTYPE)      TO W77-NUM-SUBCAT          187840      
002495       MOVE 1                          TO W77-NO-ERROR            187900      
002496       STRING "ERROR EN STORE S151B01, CATEGORIA "                188000      
002497              W77-NUM-CAT " SUBCATEGORIA "                        188020      
002498              W77-NUM-SUBCAT                                      188040      
002499       DELIMITED BY SIZE INTO TEXTO-LJ                            188060      
002500       MOVE "E"          TO      TIPO-LJ                          188100      
002501       MOVE 010105       TO      CODIGO-LJ                        188120      
002502       PERFORM 000-9999-LIBJ                                      188140      
002503       IF W77-PRDYINSTMC  = 0                                     188150      
002504          FREE S151B01TOTPROD ON EXCEPTION NEXT SENTENCE.         188160      
002505*                                                                 188200      
002506 031100-ACT-GLOB-C10MIN.                                          188300      
002507*-----------------------                                          188400      
002508   PERFORM 032000-LOCK-GLOB                                       188500      
002509   IF WKS-IERR NOT = 1                                            188600      
002510      PERFORM 031200-BUSCA-SISTEMA VARYING W77-IND-SIST           188700      
002511            FROM 1 BY 1 UNTIL W77-IND-SIST > 30.                  188800      
002512*                                                                 188900      
002513 031200-BUSCA-SISTEMA.                                            189000      
002514*---------------------                                            189100      
002515   IF  WKS-SISTE-PARAM    =   B00-GLO-SISTBIFIN(W77-IND-SIST)     189200      
002516       PERFORM 031210-ACTUALIZA-GLOBAL.                           189210      
002517                                                                  189220      
002518 031210-ACTUALIZA-GLOBAL.                                         189230      
002519*=======================                                          189240      
002520   MOVE ZERO                       TO W77-NO-ERROR.               189250      
002521   BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB          189300      
002522   ON EXCEPTION                                                   189305      
002523      IF DMSTATUS(DMERROR)                                        189310      
002524         IF DMSTATUS(AUDITERROR)                                  189315      
002525            NEXT SENTENCE                                         189320      
002526         ELSE                                                     189325      
002527            MOVE 1                          TO W77-NO-ERROR       189330      
002528            PERFORM  000999-MSG-ERROR-BASE.                       189355      
002529   IF  W88-NO-ERROR                                               189360      
002530       MOVE W77-NIV-BASE  TO  B00-GLO-NCTLBIFIN(W77-IND-SIST)     189400      
002531       PERFORM 033000-STORE-GLOB.                                 189500      
002532   IF  W88-NO-ERROR                                               189550      
002533       END-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB        189600      
002534       MOVE 31            TO  W77-IND-SIST                        189700      
002535   ELSE                                                           189720      
002536      FREE BIFINDB                                                189740      
002537        ON EXCEPTION                                              189760      
002538           NEXT SENTENCE.                                         189780      
002539                                                                  189800      
002540 032000-LOCK-GLOB.                                                189900      
002541*-----------------                                                190000      
002542  MOVE 0                                   TO WKS-IERR            190100      
002543  LOCK  BIFINDB                                                   190200      
002544   ON EXCEPTION                                                   190300      
002545      MOVE 1                               TO WKS-IERR            190400      
002546      MOVE " ERROR AL BLOQUEAR GLOBALES "  TO TEXTO-LJ            190500      
002547      PERFORM 000999-MSG-ERROR-BASE                               190600      
002548      CALL SYSTEM DMTERMINATE.                                    190700      
002549*                                                                 190800      
002550 033000-STORE-GLOB.                                               190900      
002551*------------------                                               191000      
002552  STORE BIFINDB                                                   191100      
002553    ON EXCEPTION                                                  191200      
002554       MOVE 1                          TO W77-NO-ERROR.           191300      
002555*                       1                                         191600      
002556 042000-LIMPIA-TABLA.                                             191700      
002557*--------------------                                             191800      
002558  PERFORM 042010-BORRA-TABTOT                                     191900      
002559         VARYING W77-INDICE FROM 1 BY 1 UNTIL W77-INDICE > 35.    192000      
002560*                                                                 192100      
002561 042010-BORRA-TABTOT.                                             192200      
002562*--------------------                                             192300      
002563   MOVE ZEROS   TO     WKS-TOT-NUM-ABO(W77-INDICE)                192400      
002564                       WKS-TOT-NUM-CAR(W77-INDICE)                192500      
002565                       WKS-TOT-IMP-ABO(W77-INDICE)                192600      
002566                       WKS-TOT-IMP-CAR(W77-INDICE).               192700      
002567*                                                                 192800      
002568 042030-FIND-BIFIN.                                               192900      
002569*------------------                                               193000      
002570  FIND BIFINDB                                                    193100      
002571   ON EXCEPTION                                                   193200      
002572      MOVE " ERROR AL LEER GLOBALES "  TO TEXTO-LJ                193300      
002573      PERFORM 000999-MSG-ERROR                                    193400      
002574      CALL SYSTEM DMTERMINATE.                                    193500      
002575*                                                                 193600      
002576 042050-LEE-BIFINDB.                                              193700      
002577*-------------------                                              193800      
002578  LOCK BIFINDB                                                    193900      
002579    ON EXCEPTION                                                  194000      
002580       MOVE "ERROR AL LEER GLOBALES S151BIFINDB " TO TEXTO-LJ     194100      
002581       PERFORM 000999-MSG-ERROR-BASE.                             194200      
002582       CALL SYSTEM DMTERMINATE.                                   194300      
002583*                                                                 194400      
002584 042060-ACTNIV-BASECONT.                                          194500      
002585*-----------------------                                          194600      
002586  STORE BIFINDB                                                   194700      
002587    ON EXCEPTION                                                  194800      
002588      MOVE "ERROR AL HACER STORE DE GLOBALES BIFIN " TO TEXTO-LJ  194900      
002589       PERFORM 000999-MSG-ERROR-BASE.                             195000      
002590                                                                  195100      
002591*                                                                 195200      
002592  042070-FF-B01.                                                  195202      
002593*================                                                 195204      
002594  FIND FIRST B01SXTOTPROD AT B01-TOT-SISTEMA = WKS-SISTE-PARAM AND195206      
002595                             B01-TOT-CSI     = W77-NUM-CSI     AND195208      
002596                             B01-TOT-FECINF  = WKS-FECHA-PARAM    195212      
002597          ON EXCEPTION                                            195214      
002598          IF DMSTATUS( NOTFOUND )                                 195216      
002599             MOVE 1                        TO W77-FIN             195218      
002600             MOVE ZERO                     TO W77-LLAVE           195219      
002601                                B00-GLO-NCTLBIFIN(W77-IND-SIST)   195220      
002602          ELSE                                                    195221      
002603             MOVE 1                        TO W77-ERROR.          195222      
002604                                                                  195230      
002605 042080-FN-B01.                                                   195232      
002606*==============                                                   195234      
002607  PERFORM 042082-OBTEN-TOTALES.                                   195240      
002608  FIND NEXT  B01SXTOTPROD AT B01-TOT-SISTEMA = WKS-SISTE-PARAM AND195250      
002609                             B01-TOT-CSI     = W77-NUM-CSI     AND195252      
002610                             B01-TOT-FECINF  = WKS-FECHA-PARAM    195254      
002611          ON EXCEPTION                                            195256      
002612          IF DMSTATUS( NOTFOUND )                                 195258      
002613             MOVE 1                        TO W77-FIN             195260      
002614          ELSE                                                    195262      
002615             MOVE 1                        TO W77-ERROR.          195264      
002616                                                                  195266      
002617 042082-OBTEN-TOTALES.                                            195268      
002618*=====================                                            195270      
002619  ADD 1                           TO W77-INDICE                 . 195272      
002620  ADD 1                           TO WKS-IND-TAB                . 195273      
002621  MOVE B01-TOT-PRODUCTO           TO WKS-TOT-PRD    (W77-INDICE). 195274      
002622  MOVE B01-TOT-INSTSERV           TO WKS-TOT-INST   (W77-INDICE). 195280      
002623  MOVE B01-TOT-MONEDA             TO WKS-TOT-MONEDA (W77-INDICE). 195282      
002624  MOVE B01-TOT-CPAE               TO WKS-TOT-CPAE   (W77-INDICE). 195284      
002625  MOVE B01-TOT-NUMCARGOS          TO WKS-TOT-NUM-CAR(W77-INDICE). 195286      
002626  MOVE B01-TOT-NUMABONOS          TO WKS-TOT-NUM-ABO(W77-INDICE). 195288      
002627  MOVE B01-TOT-IMPCARGOS          TO WKS-TOT-IMP-CAR(W77-INDICE). 195290      
002628  MOVE B01-TOT-IMPABONOS          TO WKS-TOT-IMP-ABO(W77-INDICE). 195292      
002629                                                                  195294      
002630 045500-TRAE-CEPAE.                                               195300      
002631*------------------                                               195400      
002632  SET WS-CPAE                   TO  1                             195500      
002633  SEARCH WKS-TAB-CPAE VARYING  WS-CPAE AT END                     195600      
002634       MOVE 0                   TO  W77-CEPAE                     195700      
002635  WHEN WKS-T-SUCOPER(WS-CPAE)   =   A00-R01-SUCOPER               195800      
002636       MOVE WKS-T-CPAE(WS-CPAE) TO  W77-CEPAE.                    195900      
002637*                                                                 196000      
002638 050000-BUSCA-PRDINST.                                            196100      
002639*---------------------                                            196200      
002640  IF WKS-ALE-PIM(WKS-PIM) =  W77-PIM                              196300      
002641     PERFORM 050100-LIMITES                                       196400      
002642     COMPUTE WKS-PIM      =  WS-PIM  +  1.                        196500      
002643*                                                                 196600      
002644 050100-LIMITES.                                                  196700      
002645*---------------                                                  196800      
002646  IF ((WKS-IMPORTE-CARG = 0) AND (WKS-IMPORTE-ABON = 0))          196900      
002647     NEXT SENTENCE                                                197000      
002648  ELSE                                                            197100      
002649  IF WKS-IMPORTE-CARG = 0                                         197110      
002650     IF  WKS-IMPORTE-ABON > WKS-ALE-LIMTRNABO(WKS-PIM)            197120      
002651         PERFORM 055000-GENERA-ALARMA                             197130      
002652     ELSE                                                         197140      
002653        NEXT SENTENCE                                             197150      
002654  ELSE                                                            197160      
002655     IF WKS-IMPORTE-CARG > WKS-ALE-LIMTRNCAR(WKS-PIM)             197200      
002656        PERFORM 055000-GENERA-ALARMA.                             197400      
002657*                                                                 197500      
002658 055000-GENERA-ALARMA.                                            197600      
002659*---------------------                                            197700      
002660  MOVE 0               TO  W77-NO-ERROR                           197900      
002661  CREATE S151B03ALARMAS                                           198000      
002662    ON EXCEPTION                                                  198100      
002663       MOVE 1          TO  W77-NO-ERROR.                          198200      
002664                                                                  198500      
002665  IF W88-NO-ERROR                                                 198600      
002666     MOVE A00-R01-PRODUCTO      TO  B03-ALA-PRODUCTO              198700      
002667     MOVE A00-R01-INSTRUMENTO   TO  B03-ALA-INSTSERV              198800      
002668     MOVE A00-R01-MONEDA        TO  B03-ALA-MONEDA                198900      
002669     MOVE WKS-SISTE-PARAM       TO  B03-ALA-SISTEMA               199000      
002670     MOVE A00-R01-AUTORIZA      TO  B03-ALA-AUT-ORIG              199100      
002671     MOVE W77-LLAVE             TO  B03-ALA-AUT-S151              199200      
002672     MOVE WKS-NUMCSI            TO  B03-ALA-CSI                   199300      
002673     MOVE A00-R01-FECCONT       TO  B03-ALA-FECINF                199400      
002674     MOVE A00-R01-AUT3ER        TO  B03-ALA-AUT-3NIV              199500      
002675     MOVE A00-R01-CONTRATO      TO  B03-ALA-CONTRATO              199600      
002676     MOVE A00-R01-SUCTRAN       TO  B03-ALA-TRANS-SUC             199700      
002677     MOVE A00-R01-CAJATRAN      TO  B03-ALA-TRANS-CJA             199800      
002678     MOVE A00-R01-HORMOV        TO  B03-ALA-TRANS-HOR             199900      
002679     MOVE WKS-CVE-TRANS         TO  B03-ALA-TRANS-CVE             200000      
002680     MOVE A00-R01-IND-CONTA     TO  B03-ALA-IND-CONT              200100      
002681     MOVE WS-NUMOCURR           TO  B03-ALA-NUMOCURR              200200      
002682     IF WKS-IMPORTE-ABON        >   ZEROS                         200300      
002683        MOVE 2                  TO  B03-ALA-CVE-ALARM             200400      
002684        MOVE WKS-IMPORTE-ABON   TO  B03-ALA-IMPORTE               200500      
002685     ELSE                                                         200600      
002686     IF WKS-IMPORTE-CARG     >  ZEROS                             200700      
002687        MOVE 1                  TO  B03-ALA-CVE-ALARM             200800      
002688        MOVE WKS-IMPORTE-CARG   TO  B03-ALA-IMPORTE.              200900      
002689  IF W88-NO-ERROR                                                 201000      
002690     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL  OF BIFINDB       201010      
002691     ON EXCEPTION                                                 201015      
002692        IF DMSTATUS(DMERROR)                                      201020      
002693           IF DMSTATUS(AUDITERROR)                                201030      
002694              NEXT SENTENCE                                       201050      
002695           ELSE                                                   201060      
002696              MOVE 1                          TO W77-NO-ERROR     201061      
002697              STRING "ERROR EN STORE S151B03ALARMAS, CATEGORIA "  201062      
002698                     W77-NUM-CAT " SUBCATEGORIA "                 201063      
002699                     W77-NUM-SUBCAT                               201064      
002700              DELIMITED BY SIZE INTO TEXTO-LJ                     201065      
002701              MOVE "E"                        TO TIPO-LJ          201067      
002702              MOVE 010105                     TO CODIGO-LJ        201069      
002703              PERFORM 000-9999-LIBJ.                              201071      
002704     IF W88-NO-ERROR                                              201075      
002705        PERFORM 055100-GRABA-B03.                                 201080      
002706     IF W88-NO-ERROR                                              201082      
002707        END-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB       201084      
002708     ELSE                                                         201086      
002709        ABORT-TRANSACTION NO-AUDIT S151B99REINICTL  OF BIFINDB.   201089      
002710 055100-GRABA-B03.                                                201090      
002711*=================                                                201095      
002712        STORE S151B03ALARMAS                                      201100      
002713        ON EXCEPTION                                              201200      
002714           MOVE DMSTATUS(DMCATEGORY)       TO W77-NUM-CAT         201300      
002715           MOVE DMSTATUS(DMERRORTYPE)      TO W77-NUM-SUBCAT      201310      
002716           MOVE 1                          TO W77-NO-ERROR        201320      
002717           STRING "ERROR EN STORE S151B03ALARMAS, CATEGORIA "     201330      
002718                  W77-NUM-CAT " SUBCATEGORIA "                    201340      
002719                  W77-NUM-SUBCAT                                  201350      
002720           DELIMITED BY SIZE INTO TEXTO-LJ                        201360      
002721           MOVE "E"                        TO TIPO-LJ             201410      
002722           MOVE 010105                     TO CODIGO-LJ           201460      
002723           PERFORM 000-9999-LIBJ.                                 201510      
002724*                                                                 201600      
002725  070000-DISPLAY-REGLEIDOS.                                       201700      
002726*-----------------------                                          201800      
002727  STRING "REG. LEIDOS: ----> ", W77-LLAVE                         201900      
002728                 DELIMITED BY SIZE INTO   TEXTO-LJ                202000      
002729  PERFORM 085000-MANDA-DISPLAY.                                   202100      
002730*                                                                 202200      
002731 080100-LEE-LOG.                                                  202300      
002732*---------------                                                  202400      
002733   MOVE ZEROS              TO  W77-NOERROR-LOG                    202500      
002734   READ L01-DATOS INTO A00-R01-REGMOV                             202600      
002735        INVALID KEY                                               202605      
002736        MOVE 1    TO    W77-NOERROR-LOG                           202610      
002737        STRING " ERROR AL LEER LOG1 DEL S151 ",                   202620      
002738               " CON LA LLAVE : ", W77-LLAVE                      202630      
002739        DELIMITED BY SIZE INTO     TEXTO-LJ                       202640      
002740        PERFORM 000999-MSG-ERROR.                                 202650      
002741                                                                  202660      
002742  080200-LEE-LOG2.                                                203500      
002743*-----------------                                                203600      
002744  MOVE ZEROS              TO  W77-NOERROR-LOG.                    203610      
002745  READ L02-DATOS INTO  A00-R01-REGMOV                             203700      
002746       INVALID   KEY                                              203800      
002747       MOVE 1    TO    W77-NOERROR-LOG                            203900      
002748       STRING " ERROR AL LEER LOG2 DEL S151 ",                    204100      
002749              " CON LA LLAVE : ", W77-LLAVE                       204200      
002750       DELIMITED BY SIZE INTO     TEXTO-LJ                        204300      
002751       PERFORM 000999-MSG-ERROR.                                  204400      
002752*                                                                 204500      
002753 080200-CIERRA-ARCH-BD.                                           204600      
002754*-----------------------                                          204700      
002755  IF W88-OPEN                                                     204710      
002756     CLOSE L01-DATOS                                              204800      
002757           L02-DATOS  .                                           204900      
002758                                                                  205000      
002759  COMPUTE W77-NIV-BASE = W77-LLAVE - 1.                           205010      
002760  PERFORM 031100-ACT-GLOB-C10MIN                                  205020      
002761  BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB           205030      
002762  MOVE ZEROS                              TO  W77-FIN-TABLA       205040      
002763  MOVE 1                                  TO  W77-INDICE          205050      
002764  PERFORM 001900-ACT-BASE                 UNTIL W88-FIN-TAB       205060      
002765  END-TRANSACTION NO-AUDIT S151B99REINICTL OF BIFINDB.            205070      
002766  CLOSE BIFINDB ON EXCEPTION                                      205100      
002767  IF DMSTATUS (CLOSEERROR)                                        205200      
002768     MOVE "ERROR AL CERRAR BASE BIFINDB"  TO MENSAJE-LJ           205300      
002769     PERFORM 000999-MSG-ERROR.                                    205400      
002770*                                                                 205500      
002771 085000-MANDA-DISPLAY.                                            205600      
002772*---------------------                                            205700      
002773   MOVE "I"          TO      TIPO-LJ                              205800      
002774   MOVE 020201       TO      CODIGO-LJ                            205900      
002775   PERFORM 000-9999-LIBJ.                                         206000      
002776*                                                                 206100      
002777 000999-MSG-ERROR.                                                206200      
002778*-----------------                                                206300      
002779   MOVE "E"          TO      TIPO-LJ                              206400      
002780   MOVE 010105       TO      CODIGO-LJ                            206500      
002781   PERFORM 000-9999-LIBJ.                                         206600      
002782                                                                  206610      
002783 000999-MSG-ERROR-BASE.                                           206620      
002784*======================                                           206630      
002785   MOVE "E"          TO      TIPO-LJ  .                           206640      
002786   MOVE 010105       TO      CODIGO-LJ.                           206650      
002787   PERFORM 000-9999-LIBJ.                                         206660      
002788   FREE BIFINDB ON EXCEPTION NEXT SENTENCE.                       206665      
002789*  STOP RUN.                                                      206670      
002790*                                                                 206700      
002791 000-9999-LIBJ.                                                   206800      
002792*--------------                                                   206900      
002793  CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                         207100      
002794                              MENSAJE-LJ.                         207200      
002795                                                                  207300      
002796 000-9999-CTROL-VERSIONES.                                        207400      
002797*-------------------------                                        207500      
002798  CALL "DAME_TIT IN CTRLVERS"   USING WKS-CTLVERS-LIBRERIA,       207600      
002799                                      WKS-CTLVERS-TITULO          207700      
002800                               GIVING WKS-CTLVERS-STATUS.         207800      
002801                                                                  207900      
