000001$ SET LIST  STAKCK FREE LINEINFO NEWID "TOTXCVETRA"               000100      
000002$ SET LISTOMITTED                                                 000200      
000003$ SET OLDCODE                                                     000300      
000004$$ SET OPTIMIZE FEDLEVEL = 5                                      000400      
000005$$ SHARED BY ALL                                                  000500      
000006*$$ TARGET=LEVEL2                                                 000600      
000007 IDENTIFICATION DIVISION.                                         000700      
000008 PROGRAM-ID. TOTXCVETRA.                                          000800      
000009******************************************************************000900      
000010* OBJETIVO : PROPORCIONAR UN MEDIO DE CONSULTA DE TOTALES POR    *001000      
000011*            CLAVE DE TRANSACCION.                               *001100      
000012*                                                                *001200      
000013*                    P A R A M E T R O S                         *001300      
000014*                                                                *001400      
000015*   ============   TOTALES A NIVEL CLAVE       ===============   *001500      
000016*                                                                *001600      
000017* FUNCION             ACCION A EFECTUAR                          *001700      
000018*   0      ABRIR LA BASE DE DATOS ADECUADA PARA EL SISTEMA DADO  *001800      
000019*   1      CONSULTA POR SIST                                     *001900      
000020*   2      CONSULTA POR SIST-BORI-BDES-PROD                      *002000      
000021*   3      CONSULTA POR SIST-BORI-BDES-PROD-INST                 *002100      
000022*   4      CONSULTA POR SIST-BORI-BDES-MONEDA                    *002200      
000023*   5      CONSULTA POR SIST-BORI-BDES-PRODUCTO-MONEDA           *002300      
000024*   6      CONSULTA POR SIST-BORI-BDES-PROD-INST-MONEDA          *002400      
000025*   7      CONSULTA POR SIST-PROC                                *002500      
000026*   8      CONSULTA POR SIST-PROC-BORI-BDES-PROD                 *002600      
000027*   9      CONSULTA POR SIST-PROC-BORI-BDES-PROD-INST            *002700      
000028*  10      CONSULTA POR SIST-PROC-BORI-BDES-MONEDA               *002800      
000029*  11      CONSULTA POR SIST-PROC-BORI-BDES-PROD-MONEDA          *002900      
000030*  12      CONSULTA POR SIST-PROC-BORI-BDES-PROD-INST-MONEDA     *003000      
000031*  13      CONSULTA POR SIST-PROC-BORI-DES                       *003100      
000032*  14      CONSULTA POR SIST-BORI-BDES                           *003200      
000033*                                                                *003300      
000034*   ==============   TOTALES A NIVEL ESQUEMA ================    *003400      
000035                                                                  003500      
000036*  21      CONSULTA POR SIST                                     *003600      
000037*  22      CONSULTA POR SIST-BORI-BDES-PROD                      *003700      
000038*  23      CONSULTA POR SIST-BORI-BDES-PROD-INST                 *003800      
000039*  24      CONSULTA POR SIST-BORI-BDES-MONEDA                    *003900      
000040*  25      CONSULTA POR SIST-BORI-BDES-PRODUCTO-MONEDA           *004000      
000041*  26      CONSULTA POR SIST-BORI-BDES-PROD-INST-MONEDA          *004100      
000042*  27      CONSULTA POR SIST-PROC                                *004200      
000043*  28      CONSULTA POR SIST-PROC-BORI-BDES-PROD                 *004300      
000044*  29      CONSULTA POR SIST-PROC-BORI-BDES-PROD-INST            *004400      
000045*  30      CONSULTA POR SIST-PROC-BORI-BDES-MONEDA               *004500      
000046*  31      CONSULTA POR SIST-PROC-BORI-BDES-PROD-MONEDA          *004600      
000047*  32      CONSULTA POR SIST-PROC-BORI-BDES-PROD-INST-MONEDA     *004700      
000048*  33      CONSULTA POR SIST-PROC-BORI-DES                       *004800      
000049*  34      CONSULTA POR SIST-BORI-BDES                           *004900      
000050*                     RESULTADOS POSIBLES :                      *005000      
000051* VALOR                                                          *005100      
000052*  0       SIN ERROR                                             *005200      
000053*  1       FUNCION INVALIDA                                      *005300      
000054*  2       FECHA DE SOLICITUD INVALIDA                           *005400      
000055*  3       SISTEMA SIN TOTALES                                   *005500      
000056*  4       PRODUCTO SIN TOTALES                                  *005600      
000057*  5       INSTRUMENTO SIN TOTALES                               *005700      
000058*  6       BASE DE CONTROL NO DISPONIBLE                         *005800      
000059*  7       BASE DE DATOS NO DISPONIBLE                           *005900      
000060*  8       SISTEMA NO DADO DE ALTA                               *006000      
000061* 10                                                             *006100      
000062* 99       FIN DE DATOS                                          *006200      
000063*                                                                *006210      
000064* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *006212      
000065* 20141205 15MTP001 MJGRG                                        *006214      
000066******************************************************************006300      
000067 ENVIRONMENT DIVISION.                                            006400      
000068 INPUT-OUTPUT SECTION.                                            006500      
000069     FILE-CONTROL.                                                006600      
000070 DATA DIVISION.                                                   006700      
000071                                                                  006800      
000072 DATA-BASE SECTION.                                               006900      
000073 DB BASEMOVDIA = S151BD10MOVDIA151.                               007000      
000074                                                                  007100      
000075 WORKING-STORAGE SECTION.                                         007200      
000076*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000077* COPY "S151/CRONOS2K/CPY/WS".                                    007300      
000078******************************************************************000100      
000079** This copyBook defines all the additional variables that      **000200      
000080** Unisys has defined for the CRONOS2K project                  **000300      
000081** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000082******************************************************************000500      
000083                                                                  000600      
000084******************************************************************000700      
000085** These Variables are used to Accept the system date in long   **000800      
000086** format and get the century information                       **000900      
000087** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000088 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000089 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000090    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000091    05 FILLER      PIC X(1).                                      001400      
000092    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000093    05 FILLER      PIC X(1).                                      001600      
000094    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000095    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000096      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000097      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000098******************************************************************002100      
000099                                                                  002200      
000100******************************************************************002300      
000101** This variable defines a date in the format MMDDCCAA          **002400      
000102**                                                              **002500      
000103 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000104 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000105    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000106    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000107    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000108    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000109      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000110      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000111******************************************************************003400      
000112                                                                  003500      
000113******************************************************************003600      
000114** This variable defines a date in the format CCAAMMDD          **003700      
000115**                                                              **003800      
000116 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000117 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000118    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000119    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000120      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000121      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000122    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000123    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000124******************************************************************004700      
000125                                                                  004800      
000126******************************************************************004900      
000127** This variable defines a date in the format DDMMCCAA          **005000      
000128**                                                              **005100      
000129 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000130 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000131    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000132    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000133    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000134    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000135      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000136      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000137******************************************************************006000      
000138                                                                  006100      
000139******************************************************************006200      
000140** This variable defines a date in the Julian Format CCAADDD    **006300      
000141**                                                              **006400      
000142 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000143 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000144    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000145    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000146                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000147      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000148      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000149    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000150******************************************************************007300      
000151                                                                  007400      
000152******************************************************************007500      
000153** This variable defines a date in the format AAMMDD            **007600      
000154**                                                              **007700      
000155 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000156 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000157    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000158    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000159    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000160******************************************************************008300      
000161                                                                  008400      
000162******************************************************************008500      
000163** This variable defines a date in the format MMDDAA            **008600      
000164**                                                              **008700      
000165 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000166 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000167    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000168    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000169    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000170******************************************************************009300      
000171                                                                  009400      
000172******************************************************************009500      
000173** This variable defines a date in the format DDMMAA            **009600      
000174**                                                              **009700      
000175 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000176 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000177    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000178    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000179    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000180******************************************************************010300      
000181                                                                  010400      
000182******************************************************************010500      
000183** These variables are defined to be used for CALL bridge logic **010600      
000184**                                                              **010700      
000185 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000186 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000187 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000188 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000189 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000190 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000191******************************************************************011400      
000192                                                                  011500      
000193******************************************************************011600      
000194** This variable is used for converting only a year field AA to **011700      
000195** CCAA and a CCAA to AA                                        **011800      
000196 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000197 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000198    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000199    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000200 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000201 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000202******************************************************************012300      
000203                                                                  012400      
000204******************************************************************012500      
000205** These variables are Bridge Variables for Intercambio files   **012600      
000206** para EDOCTA                                                  **012700      
000207 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000208 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000209 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000210 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000211 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000212 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000213 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000214******************************************************************013500      
000215* Para MODULO                                                     013600      
000216 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000217******************************************************************013800      
000218******************************************************************013900      
000219** Para FMOVSCHABO                                                014000      
000220 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000221******************************************************************014200      
000222                                                                  014300      
000223******************************************************************014400      
000224***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000225******************************************************************014600      
000226                                                                  014700      
000227 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000228 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000229     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000230     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000231     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000232******************************************************************015300      
000233                                                                  015400      
000234******************************************************************015500      
000235***  These Variables Are Defined For Date In AAMM Format       ***015600      
000236******************************************************************015700      
000237                                                                  015800      
000238 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000239 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000240     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000241     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000242******************************************************************016300      
000243                                                                  016400      
000244                                                                  016500      
000245*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000246*  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                      007400      
000247                                                                  007500      
000248*=========================================================        007600      
000249*         VARIABLES PARA CONTROL DE VERSIONES            =        007700      
000250*=========================================================        007800      
000251 01  WKS-LIBID                     PIC X(12).                     007900      
000252 01  WKS-NOMBLIB                   PIC X(72).                     008000      
000253 01  W77-ERR-CTLVER                PIC S9(11) BINARY.             008100      
000254                                                                  008150      
000255*==========================================================       008152      
000256*         VARIABLES LIBRERIA DE DESPLIEGE                 =       008154      
000257*==========================================================       008156      
000258                                                                  008158      
000259*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000260* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           008160      
000261**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000262  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000263  01 MENSAJE-LJ.                                                  100300      
000264     02 SISTEMA-LJ     PIC X(04).                                 100400      
000265     02 FILLER         PIC X VALUE "/".                           100500      
000266     02 PASO-LJ        PIC X(04).                                 100600      
000267     02 FILLER         PIC X VALUE "/".                           100700      
000268     02 MTP-LJ         PIC 9(03).                                 100800      
000269     02 FILLER         PIC X VALUE ":".                           100900      
000270     02 TIPO-LJ        PIC X.                                     101000      
000271     02 FILLER         PIC X VALUE ">".                           101100      
000272     02 CODIGO-LJ      PIC 9(06).                                 101200      
000273     02 FILLER         PIC X VALUE "<".                           101300      
000274     02 TEXTO-LJ       PIC X(250).                                101400      
000275*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000276                                                                  008200      
000277*=========================================================        008300      
000278*         VARIABLES PARA LIBRERIA DE CONTROL             =        008400      
000279*=========================================================        008500      
000280*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000281* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  008600      
000282*================================================================ 000100      
000283*         ENTRY-POINT CONSISDIA :                               = 000200      
000284*                                                                 000300      
000285* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000286* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000287* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000288* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000289* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000290* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000291* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000292* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000293* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000294* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000295*                                                               = 001400      
000296*================================================================ 001500      
000297                                                                  001600      
000298                                                                  001700      
000299*================================================================ 001800      
000300* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000301*                                                               = 002000      
000302* ENTRADA REQUERIDA :                                           = 002100      
000303*                                                               = 002200      
000304*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000305*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000306*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000307*================================================================ 002600      
000308 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000309    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000310    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000311    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000312    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000313    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000314    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000315    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000316    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000317    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000318    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000319    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000320    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000321    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000322    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000323    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000324    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000325    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000326    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000327    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000328    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000329       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000330       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000331       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000332       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000333*==============================================================   005200      
000334*                                                             =   005300      
000335* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000336*                                                             =   005500      
000337* CAMPOS REQUERIDOS :                                         =   005600      
000338*                                                             =   005700      
000339* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000340* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000341* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000342* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000343*==============================================================   006200      
000344 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000345    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000346    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000347    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000348    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000349                                                                  006800      
000350*==============================================================   006900      
000351*                                                             =   007000      
000352* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000353*                                                             =   007200      
000354* CAMPOS REQUERIDOS :                                         =   007300      
000355*                                                             =   007400      
000356* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000357* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000358* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000359* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000360*==============================================================   007900      
000361 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000362    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000363    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000364    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000365    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000366                                                                  008500      
000367*==============================================================   008600      
000368*                                                             =   008700      
000369* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000370*                                                             =   008900      
000371* CAMPOS REQUERIDOS :                                         =   009000      
000372*                                                             =   009100      
000373* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000374* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000375* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000376* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000377*==============================================================   009600      
000378 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000379    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000380    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000381    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000382    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000383                                                                  010200      
000384*============================================================     010300      
000385* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000386*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000387*                                                           =     010600      
000388*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000389*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000390*                                                           =     010900      
000391*  ENTRADA REQUERIDA.                                       =     011000      
000392*                                                           =     011100      
000393*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000394*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000395*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000396*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000397*============================================================     011600      
000398                                                                  011700      
000399 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000400     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000401     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000402     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000403     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000404                                                                  012300      
000405*=============================================================    012400      
000406*                                                            =    012500      
000407* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000408*             B01-SIS-FECARMOV.                              =    012700      
000409*                                                            =    012800      
000410* ENTRADA REQUERIDAD :                                       =    012900      
000411*                                                            =    013000      
000412*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000413*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000414*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000415*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000416*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000417*=============================================================    013600      
000418                                                                  013700      
000419 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000420     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000421     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000422     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000423     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000424     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000425*================================================================ 014400      
000426*                                                               = 014500      
000427* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000428*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000429*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000430*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000431*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000432*                                                               = 015100      
000433* ENTRADA REQUERIDA :                                           = 015200      
000434*                                                               = 015300      
000435* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000436* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000437* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000438* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000439* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000440*================================================================ 015900      
000441 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000442    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000443    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000444    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000445    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000446    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000447                                                                  016600      
000448*============================================================     016700      
000449*                                                           =     016800      
000450* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000451*                                                           =     017000      
000452* DATOS REQUERIDOS :                                        =     017100      
000453*                                                           =     017200      
000454* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000455* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000456* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000457* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000458* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000459*============================================================     017800      
000460                                                                  017900      
000461 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000462     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000463     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000464     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000465     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000466     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000467                                                                  018600      
000468*============================================================     018700      
000469*                                                           =     018800      
000470* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000471*                                                           =     019000      
000472* DATOS REQUERIDOS :                                        =     019100      
000473*                                                           =     019200      
000474* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000475* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000476* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000477* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000478* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000479*============================================================     019800      
000480                                                                  019900      
000481 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000482     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000483     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000484     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000485     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000486     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000487                                                                  020600      
000488*===============================================================  020700      
000489*                                                              =  020800      
000490* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000491*              MOVIMIENTOS.                                    =  021000      
000492* DATOS REQUERIDOS :                                           =  021100      
000493*                                                              =  021200      
000494* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000495* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000496* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000497* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000498* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000499* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000500*==============================================================   021900      
000501                                                                  022000      
000502 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000503     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000504     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000505     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000506     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000507     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000508     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000509*==============================================================   022800      
000510*                                                             =   022900      
000511* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000512*                                                             =   023100      
000513* CAMPOS REQUERIDOS :                                         =   023200      
000514*                                                             =   023300      
000515* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000516* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000517* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000518* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000519*==============================================================   023800      
000520 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000521    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000522    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000523    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000524    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000525                                                                  024304      
000526*=================================================================024306      
000527*                ENTRY POINT CONSISB01                           =024308      
000528*                                                                =024310      
000529*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000530*                                                                =024314      
000531*  FUNCIONES DISPONIBLES :                                       =024316      
000532*                                                                =024318      
000533*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000534*                                                                =024322      
000535*  PARAMETROS REQUERIDOS                                         =024324      
000536*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000537*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000538*=================================================================024330      
000539                                                                  024332      
000540 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000541     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000542     03 WKS-CON-CSI                PIC 9(02).                     024336      
000543     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000544     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000545        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000546        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000547        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000548        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000549        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000550                                                                  024400      
000551*=================================================================024500      
000552*                ENTRY POINT B02ARCINTER                         =024600      
000553*                                                                =024700      
000554*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000555*                                                                =024900      
000556*  FUNCIONES DISPONIBLES :                                       =025000      
000557*                                                                =025100      
000558*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000559* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000560* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000561* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000562*                                                                =025600      
000563*  PARAMETROS REQUERIDOS                                         =025700      
000564*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000565*                                                                =025900      
000566*=================================================================026000      
000567 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000568     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000569     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000570     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000571     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000572     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000573     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000574     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000575     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000576     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000577     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000578     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000579     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000580     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000581     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000582     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000583     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000584     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000585     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000586     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000587     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000588     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000589     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000590     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000591     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000592     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000593     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000594     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000595     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000596                                                                  029000      
000597*=================================================================029100      
000598*                ENTRY POINT B04SISTEMA                          =029200      
000599*                                                                =029300      
000600*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000601*                                                                =029500      
000602*  FUNCIONES DISPONIBLES :                                       =029600      
000603*                                                                =029700      
000604*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000605*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000606*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000607*                                                                =030100      
000608*  PARAMETROS REQUERIDOS                                         =030200      
000609*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000610*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000611*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000612*                                                                =030600      
000613*=================================================================030700      
000614 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000615     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000616     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000617     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000618     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000619     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000620     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000621     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000622                                                                  031600      
000623*================================================================ 031700      
000624*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000625*                                                               = 031900      
000626*  FUNCION                                                      = 032000      
000627*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000628*   19       ALTAS.                                             = 032200      
000629*   22       BAJAS                                              = 032300      
000630*   37       CAMBIOS.                                           = 032400      
000631*                                                               = 032500      
000632*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000633*                      FECHA DE PROCESO                         = 032700      
000634*                      NUMERO DE PROCESO                        = 032800      
000635*                      FECHA INICIO                             = 032900      
000636*                      REGISTRO INICIAL                         = 033000      
000637*================================================================ 033100      
000638                                                                  033200      
000639 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000640     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000641     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000642     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000643     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000644     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000645     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000646     03 WKS-B05-MIX                PIC 9(08).                     034000      
000647     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000648     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000649     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000650     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000651     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000652     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000653                                                                  034700      
000654                                                                  034800      
000655*================================================================ 034900      
000656*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000657*                                                               = 035100      
000658*  FUNCION                                                      = 035200      
000659*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000660*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000661*                                                               = 035500      
000662*================================================================ 035600      
000663                                                                  035700      
000664 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000665     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000666     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000667     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000668     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000669     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000670     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000671                                                                  036500      
000672*===============================================================  036600      
000673*                                                              =  036700      
000674*         ENTRY-POINT CONSISMEN                                =  036800      
000675*                                                              =  036900      
000676*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000677*                      SISTEMA                                 =  037100      
000678*                                                              =  037200      
000679*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000680*                                                              =  037400      
000681*===============================================================  037500      
000682 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000683     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000684     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000685     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000686     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000687     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000688     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000689     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000690     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000691     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000692     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000693     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000694     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000695     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000696     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000697     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000698        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000699        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000700        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000701        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000702        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000703        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000704        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000705                                                                  039900      
000706*=====================================================            040000      
000707*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000708*=====================================================            040200      
000709 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000710     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000711     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000712     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000713                                                                  040700      
000714*=====================================================            040800      
000715*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000716*=====================================================            041000      
000717 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000718     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000719     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000720     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000721                                                                  041500      
000722*=====================================================            041600      
000723*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000724*=====================================================            041800      
000725 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000726     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000727     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000728     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000729*=====================================================            042300      
000730*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000731*=====================================================            042500      
000732 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000733     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000734     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000735     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000736                                                                  043000      
000737*=====================================================            043100      
000738*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000739*=====================================================            043300      
000740 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000741     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000742     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000743     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000744                                                                  043800      
000745*=====================================================            043900      
000746*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000747*=====================================================            044100      
000748 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000749     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000750     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000751     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000752                                                                  044600      
000753*=====================================================            044700      
000754*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000755*=====================================================            044900      
000756 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000757     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000758     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000759     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000760                                                                  045400      
000761*=====================================================            045500      
000762*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000763*=====================================================            045700      
000764 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000765     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000766     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000767     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000768                                                                  046200      
000769*=====================================================            046300      
000770*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000771*=====================================================            046500      
000772 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000773     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000774     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000775     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000776                                                                  047000      
000777*=====================================================            047100      
000778*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000779*=====================================================            047300      
000780 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000781     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000782     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000783     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000784                                                                  047800      
000785*=====================================================            047900      
000786*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000787*=====================================================            048100      
000788 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000789     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000790     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000791     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000792                                                                  048600      
000793*=====================================================            048700      
000794*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000795*=====================================================            048900      
000796 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000797     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000798     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000799     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000800                                                                  049400      
000801*=====================================================            049500      
000802*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000803*=====================================================            049700      
000804 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000805     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000806     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000807     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000808     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000809     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000810     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000811     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000812     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000813     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000814     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000815                                                                  050900      
000816*=====================================================            051000      
000817*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000818*=====================================================            051200      
000819 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000820     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000821     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000822     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000823     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000824                                                                  051800      
000825*=====================================================            051900      
000826*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000827*=====================================================            052100      
000828 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000829     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000830     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000831     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000832     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000833                                                                  052700      
000834*=====================================================            052800      
000835*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000836*=====================================================            053000      
000837 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000838     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000839     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000840     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000841     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000842                                                                  053600      
000843*=====================================================            053700      
000844*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000845*=====================================================            053900      
000846 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000847     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000848     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000849     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000850     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000851                                                                  054500      
000852*=====================================================            054600      
000853*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000854*=====================================================            054800      
000855 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000856     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000857     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000858     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000859     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000860                                                                  055400      
000861*=====================================================            055500      
000862*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000863*=====================================================            055700      
000864 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000865     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000866     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000867     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000868     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000869                                                                  056300      
000870*=====================================================            056400      
000871*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000872*=====================================================            056600      
000873 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000874     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000875     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000876     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000877     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000878                                                                  057200      
000879 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000880*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000881                                                                  008700      
000882*=========================================================        008800      
000883*         ERRORES Y MENSAJES DE DMSII                    =        008900      
000884*=========================================================        009000      
000885*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000886* COPY "S151/FORMATO/ERROR/DMSII." FROM 1000 TO  60000.           009100      
000887                                                                  001000      
000888                                                                  002000      
000889                                                                  003000      
000890*=================================================================004000      
000891*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
000892*=================================================================006000      
000893                                                                  007000      
000894                                                                  008000      
000895                                                                  009000      
000896 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
000897 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
000898 01 WKS-TAB-ERRDMSII.                                             012000      
000899    02 FILLER                      PIC X(20)     VALUE            013000      
000900    "NOTFOUND          01".                                       014000      
000901    02 FILLER                      PIC X(20)     VALUE            015000      
000902    "DUPLICATES        02".                                       016000      
000903    02 FILLER                      PIC X(20)     VALUE            017000      
000904    "DEADLOCK          03".                                       018000      
000905    02 FILLER                      PIC X(20)     VALUE            019000      
000906    "DATAERROR         04".                                       020000      
000907    02 FILLER                      PIC X(20)     VALUE            021000      
000908    "NOTLOCKED         05".                                       022000      
000909    02 FILLER                      PIC X(20)     VALUE            023000      
000910    "KEYCHANGE         06".                                       024000      
000911    02 FILLER                      PIC X(20)     VALUE            025000      
000912    "SYSTEMERROR       07".                                       026000      
000913    02 FILLER                      PIC X(20)     VALUE            027000      
000914    "READONLY          08".                                       028000      
000915    02 FILLER                      PIC X(20)     VALUE            029000      
000916    "IOERROR           09".                                       030000      
000917    02 FILLER                      PIC X(20)     VALUE            031000      
000918    "LIMITERROR        10".                                       032000      
000919    02 FILLER                      PIC X(20)     VALUE            033000      
000920    "OPENERROR         11".                                       034000      
000921    02 FILLER                      PIC X(20)     VALUE            035000      
000922    "CLOSEERROR        12".                                       036000      
000923    02 FILLER                      PIC X(20)     VALUE            037000      
000924    "NORECORD          13".                                       038000      
000925    02 FILLER                      PIC X(20)     VALUE            039000      
000926    "INUSE             14".                                       040000      
000927    02 FILLER                      PIC X(20)     VALUE            041000      
000928    "AUDITERROR        15".                                       042000      
000929    02 FILLER                      PIC X(20)     VALUE            043000      
000930    "ABORT             16".                                       044000      
000931    02 FILLER                      PIC X(20)     VALUE            045000      
000932    "SECURITYERROR     17".                                       046000      
000933    02 FILLER                      PIC X(20)     VALUE            047000      
000934    "VERSIONERROR      18".                                       048000      
000935    02 FILLER                      PIC X(20)     VALUE            049000      
000936    "FATALERROR        19".                                       050000      
000937    02 FILLER                      PIC X(20)     VALUE            051000      
000938    "INTEGRITY ERROR   20".                                       052000      
000939    02 FILLER                      PIC X(20)     VALUE            053000      
000940    "INTLIBERROR       21".                                       054000      
000941 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
000942    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
000943       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
000944       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
000945                                                                  059000      
000946 01 WKS-ERR-BD                     PIC 9(04).                     059100      
000947 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
000948                                                                  060000      
000949*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000950                                                                  009200      
000951*==========================================================       009300      
000952*         VARIABLE DE RESULTADO DE LA FUNCION             =       009400      
000953*==========================================================       009500      
000954                                                                  009502      
000955 01 WKS-CATEGORIAS.                                               009504      
000956    03 FILLER            PIC X(13) VALUE "NOTFOUND     ".         009506      
000957    03 FILLER            PIC X(13) VALUE "DUPLICATES   ".         009508      
000958    03 FILLER            PIC X(13) VALUE "DEADLOCK     ".         009510      
000959    03 FILLER            PIC X(13) VALUE "DATAERROR    ".         009512      
000960    03 FILLER            PIC X(13) VALUE "NOTLOCKED    ".         009514      
000961    03 FILLER            PIC X(13) VALUE "KEYCHANGE    ".         009516      
000962    03 FILLER            PIC X(13) VALUE "SYSTEM ERROR ".         009518      
000963    03 FILLER            PIC X(13) VALUE "READONLY     ".         009520      
000964    03 FILLER            PIC X(13) VALUE "IOERROR      ".         009522      
000965    03 FILLER            PIC X(13) VALUE "LIMITERROR   ".         009524      
000966    03 FILLER            PIC X(13) VALUE "OPENERROR    ".         009526      
000967    03 FILLER            PIC X(13) VALUE "CLOSEERROR   ".         009528      
000968    03 FILLER            PIC X(13) VALUE "NORECORD     ".         009530      
000969    03 FILLER            PIC X(13) VALUE "INUSE        ".         009532      
000970    03 FILLER            PIC X(13) VALUE "AUDITERROR   ".         009534      
000971    03 FILLER            PIC X(13) VALUE "ABORT        ".         009536      
000972    03 FILLER            PIC X(13) VALUE "SECURITYERROR".         009538      
000973    03 FILLER            PIC X(13) VALUE "VERSIONERROR ".         009540      
000974    03 FILLER            PIC X(13) VALUE "FATALERROR   ".         009542      
000975    03 FILLER            PIC X(13) VALUE "INTEGRITY ERR".         009544      
000976    03 FILLER            PIC X(13) VALUE "INTLIBERROR  ".         009546      
000977                                                                  009548      
000978 01 WKS-DB-CATEGORIAS     REDEFINES WKS-CATEGORIAS.               009550      
000979    03 WKS-DB-CAT         OCCURS 21 TIMES PIC X(13).              009552      
000980                                                                  009554      
000981 77 W77-NUM-CAT                    PIC 9(03).                     009556      
000982 77 W77-NUM-SUBCAT                 PIC 9(06).                     009558      
000983                                                                  009560      
000984 77 W77-BASE                       PIC 9(02).                     009562      
000985 88 W88-BASE-CLOSE                 VALUE ZERO.                    009564      
000986 88 W88-BASE-OPEN                  VALUE 1.                       009566      
000987                                                                  009568      
000988 77 W77-INTENTOS                   PIC 9(02) COMP VALUE ZERO.     009570      
000989                                                                  009580      
000990 77  W77-ERROR-BASE                PIC 9(02).                     009600      
000991 77  W77-IND                       PIC 9(04).                     009700      
000992 77  W77-IND2                      PIC 9(04).                     009800      
000993 77  W77-FECHA-VALIDA              PIC 9(01).                     009900      
000994 88  W88-FECHA-VALIDA              VALUE 1.                       010000      
000995 77  W77-CVETRA-ANT                PIC 9(04).                     010100      
000996 77  W77-RESULT-INICIO             PIC 9(02) VALUE ZERO.          010200      
000997 01 WKS-DATOS-LIB.                                                010300      
000998    03 WKS-FECHA-PROC              PIC 9(08).                     010400      
000999    03 WKS-FECHA-PROCESO REDEFINES WKS-FECHA-PROC.                010500      
001000       05 WKS-AA-PROC              PIC 9(04).                     010600      
001001       05 WKS-MM-PROC              PIC 9(02).                     010700      
001002       05 WKS-DD-PROC              PIC 9(02).                     010800      
001003    03 WKS-SISTEMA                 PIC 9(04).                     010900      
001004*      MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON           011000      
001005                                                                  011010      
001006    03 WKS-BANCOS-6D               PIC 9(06)  COMP.               011020      
001007    03 WKS-BANCOS-6D-R     REDEFINES  WKS-BANCOS-6D.              011030      
001008       05 WKS-BORICON-6D           PIC 9(03)  COMP.               011040      
001009       05 WKS-BDESCON-6D           PIC 9(03)  COMP.               011050      
001010    03 WKS-BANCOS                  PIC 9(10)  COMP.               011100      
001011    03 WKS-BANCOS-R        REDEFINES  WKS-BANCOS.                 011200      
001012       05 WKS-BORICON              PIC 9(05)  COMP.               011300      
001013       05 WKS-BDESCON              PIC 9(05)  COMP.               011400      
001014    03 WKS-ABRE-SEM                PIC 9(02) VALUE ZERO.          011500      
001015    03 WKS-ESPACIOS                PIC X(25) VALUE SPACES.        011600      
001016    03 WKS-NULOS                   PIC X(25).                     011700      
001017    03 WKS-INICIO                  PIC 9(02) VALUE ZERO.          011800      
001018 01 WKS-NOMBASE-SEM.                                              011900      
001019    02 FILLER                      PIC X(06) VALUE "(S151)".      012000      
001020    02 WKS-NOMBD                   PIC X(17).                     012100      
001021    02 FILLER                      PIC X(10) VALUE                012200      
001022       " ON CMEMP.".                                              012300      
001023                                                                  012400      
001024 01 WKS-DATOS-HOST.                                               012500      
001025    03 WKS-NUMCSI                  PIC 9(02).                     012600      
001026    03 WKS-NOMEQUIPO               PIC X(10).                     012700      
001027    03 WKS-NOMCSI                  PIC X(26).                     012800      
001028    03 WKS-LINEA-BATCH             PIC X(05).                     012900      
001029                                                                  012950      
001030*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001031* COPY "(S151)CITIDIRECT/S151/FORMATO/DISPLAY.".                  012960      
001032                                                                  000100      
001033*===============================================================* 000200      
001034*         FORMATO PARA DISPLAYS                                 * 000300      
001035*===============================================================* 000400      
001036                                                                  000500      
001037 01 WKS-TIT-REPORTE2.                                             000600      
001038    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
001039    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
001040    02 FILLER                       PIC X(06) VALUE               000900      
001041                                              "/LIST/".           001000      
001042    02 WKS-PASO-BACK2               PIC X(04).                    001051      
001043    02 FILLER                       PIC X(01) VALUE "/".          001071      
001044    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
001045    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
001046    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
001047    02 FILLER                       PIC X(1)  VALUE "/".          001400      
001048    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
001049    02 FILLER                       PIC X(11) VALUE               001600      
001050                                              "/001MSGIMP.".      001700      
001051                                                                  002100      
001052 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
001053                                                                  002300      
001054***********************************************************       002400      
001055*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
001056***********************************************************       002600      
001057 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
001058*8D                                                               002800      
001059 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
001060 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
001061    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
001062    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
001063    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
001064*8D                                                               003400      
001065 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
001066 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
001067    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
001068    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
001069    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
001070                                                                  004100      
001071 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
001072                                                                  004300      
001073 01 WKS-FECHA-HORA2.                                              004400      
001074    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
001075    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
001076       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
001077       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
001078    02 WKS-TIME-MAQ2.                                             004600      
001079       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
001080       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
001081          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
001082          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
001083          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
001084       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
001085    02 FILLER                             PIC X(01).              004900      
001086    02 WKS-RESTO2                         PIC X(04).              005000      
001087                                                                  005100      
001088*8D                                                               005200      
001089****************** REPORTE DE MENSAJES *********************      005300      
001090 01 WLI-ENCAB-12.                                                 005400      
001091    03 FILLER                             PIC X(05) VALUE         005500      
001092       "S151-".                                                   005600      
001093    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
001094    03 FILLER                             PIC X(15) VALUE         005671      
001095       "-001IMPMENSAJES".                                         005691      
001096    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
001097    03 FILLER                             PIC X(34) VALUE         005800      
001098       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
001099    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
001100    03 FILLER                             PIC X(26) VALUE         006100      
001101       "FECHA DE LA INFORMACION : ".                              006200      
001102    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
001103    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
001104       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
001105       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
001106       05  WKS-SLASH1                         PIC X(01).          006356      
001107       05  WLI-RB-E1-MES                  PIC 99.                 006357      
001108       05  WKS-SLASH2                         PIC X(01).          006358      
001109       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
001110 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
001111 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
001112    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
001113    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
001114    03 FILLER                          PIC X(01).                 006371      
001115    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
001116    03 FILLER                          PIC X(01).                 006381      
001117    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
001118*8D                                                               006400      
001119 01 WLI-ENCAB-22.                                                 006500      
001120     03 FILLER                          PIC X(11) VALUE           006600      
001121        "F.PROCESO: ".                                            006700      
001122     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
001123     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
001124     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
001125     03 FILLER                          PIC X(01) VALUE ":".      007020      
001126     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
001127     03 FILLER                          PIC X(01) VALUE ":".      007060      
001128     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
001129     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
001130     03 FILLER                          PIC X(24) VALUE           007200      
001131              "IMPRESION MENSAJES DEL S".                         007300      
001132     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
001133     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
001134     03 FILLER                          PIC X(14) VALUE           007600      
001135        "TIPO PROCESO: ".                                         007700      
001136     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
001137*8D                                                               007900      
001138 01 WLI-ENCAB-32.                                                 008000      
001139     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
001140*       "VERSION  : ".                                            008200      
001141*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
001142     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
001143     03 FILLER                     PIC X(07) VALUE                008500      
001144        "HOJA : ".                                                008600      
001145     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
001146                                                                  008800      
001147 01 WLI-ENCAB-42.                                                 008900      
001148     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
001149     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
001150     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
001151                                                                  009300      
001152 01 WLI-ENCAB-52.                                                 009400      
001153    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
001154    03 WLI-TIPO-LJ                PIC X(02).                      009600      
001155    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
001156    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
001157                                                                  009900      
001158****************************************************************  010000      
001159*                 CONTADORES DE HOJAS                          *  010100      
001160****************************************************************  010200      
001161                                                                  010300      
001162  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
001163*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001164                                                                  013000      
001165 LINKAGE SECTION.                                                 013100      
001166*==========================================================       013200      
001167*         REGISTRO DE ENTRADA Y SALIDA DE LA LIBRERIA     =       013300      
001168*==========================================================       013400      
001169*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001170* COPY "S151/FORMATO/LLAMADO/CVETRA." FROM 14000 TO 32000.        013500      
001171 01 WKS-L40-CVES.                                                 014000      
001172    03 WKS-L40-FUN-L040            PIC  9(02)       COMP.         015000      
001173    03 WKS-L40-FECHA               PIC  9(08)       COMP.         016000      
001174    03 WKS-L40-SISTEMA             PIC  9(04)       COMP.         017000      
001175    03 WKS-L40-PRODUCTO            PIC  9(04)       COMP.         018000      
001176    03 WKS-L40-INSTRUMENTO         PIC  9(04)       COMP.         019000      
001177    03 WKS-L40-PROCCON             PIC  9(04)       COMP.         020000      
001178    03 WKS-L40-BCOSCON             PIC  9(06)       COMP.         020050      
001179    03 WKS-L40-BCOSCON-R   REDEFINES WKS-L40-BCOSCON.             020070      
001180       05 WKS-L40-BORICON          PIC  9(03)       COMP.         020100      
001181       05 WKS-L40-BDESCON          PIC  9(03)       COMP.         020200      
001182    03 WKS-L40-MONCON              PIC  9(04)       COMP.         021000      
001183    03 WKS-L40-CVETRACON           PIC  9(04)       COMP.         022000      
001184    03 WKS-L40-ESQCONCON           PIC  9(04)       COMP.         023000      
001185    03 WKS-L40-IMPORTES            OCCURS 100 TIMES.              024000      
001186       04 WKS-L40-PROCESO          PIC  9(04)       COMP.         025000      
001187       04 WKS-L40-MONEDA           PIC  9(04)       COMP.         026000      
001188       04 WKS-L40-CVETRA           PIC  9(04)       COMP.         027000      
001189       04 WKS-L40-ESQCON           PIC  9(04)       COMP.         028000      
001190       04 WKS-L40-NUMMOV           PIC  9(08)       COMP.         029000      
001191       04 WKS-L40-IMPMOV           PIC S9(13)V99    COMP.         030000      
001192       04 WKS-L40-BCOSDET          PIC  9(06)       COMP.         030020      
001193       04 WKS-L40-BCOSDET-R   REDEFINES  WKS-L40-BCOSDET.         030040      
001194          05 WKS-L40-BCOORI        PIC  9(03)       COMP.         030100      
001195          05 WKS-L40-BCODES        PIC  9(03)       COMP.         030200      
001196                                                                  031000      
001197 77  W77-RESULT-S151               PIC S9(11) BINARY.             032000      
001198*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001199                                                                  013600      
001200 PROCEDURE DIVISION USING WKS-L40-CVES, W77-RESULT-S151.          013700      
001201                                                                  013800      
001202 00000-CONTROL SECTION.                                           013900      
001203 00000-INICIO.                                                    014000      
001204*================                                                 014100      
001205                                                                  014102      
001206    MOVE "S151"                   TO SISTEMA-LJ.                  014104      
001207    MOVE "L040"                   TO PASO-LJ.                     014106      
001208    MOVE "002"                    TO MTP-LJ.                      014108      
001209                                                                  014110      
001210    PERFORM 00000-LIMPIA-VARIABLES.                               014200      
001211    IF WKS-L40-FUN-L040 = 0 OR 40 OR 41                           014300      
001212       PERFORM 00-0100-LEVANTA                                    014400      
001213    ELSE                                                          014500      
001214       MOVE WKS-L40-BCOSCON TO WKS-BANCOS-6D                      014520      
001215       MOVE WKS-BORICON-6D  TO WKS-BORICON                        014540      
001216       MOVE WKS-BDESCON-6D  TO WKS-BDESCON                        014560      
001217       IF WKS-INICIO = 1                                          014600      
001218          IF WKS-ABRE-SEM = 1                                     014700      
001219             GO TO                                                014800      
001220                01-0100-SIS                                       014900      
001221                02-0100-PRD                                       015000      
001222                03-0100-PRD-INS                                   015100      
001223                04-0100-MON                                       015200      
001224                05-0100-PRD-MON                                   015300      
001225                06-0100-PRD-INS-MON                               015400      
001226                07-0100-PRO                                       015500      
001227                08-0100-PRO-PRD                                   015600      
001228                09-0100-PRO-PRD-INS                               015700      
001229                10-0100-PRO-MON                                   015800      
001230                11-0100-PRO-PRD-MON                               015900      
001231                12-0100-PRO-PRD-INS-MON                           016000      
001232                13-0100-SIS-PRO-BORI-BDES                         016100      
001233                14-0100-SIS-BORI-BDES                             016200      
001234                00005-FUNCION-ERROR                               016300      
001235                00005-FUNCION-ERROR                               016400      
001236                00005-FUNCION-ERROR                               016500      
001237                00005-FUNCION-ERROR                               016600      
001238                00005-FUNCION-ERROR                               016700      
001239                00005-FUNCION-ERROR                               016800      
001240                01-0100-SIS                                       016900      
001241                02-0100-PRD                                       017000      
001242                03-0100-PRD-INS                                   017100      
001243                04-0100-MON                                       017200      
001244                05-0100-PRD-MON                                   017300      
001245                06-0100-PRD-INS-MON                               017400      
001246                07-0100-PRO                                       017500      
001247                08-0100-PRO-PRD                                   017600      
001248                09-0100-PRO-PRD-INS                               017700      
001249                10-0100-PRO-MON                                   017800      
001250                11-0100-PRO-PRD-MON                               017900      
001251                12-0100-PRO-PRD-INS-MON                           018000      
001252                13-0100-SIS-PRO-BORI-BDES                         018100      
001253                14-0100-SIS-BORI-BDES                             018200      
001254             DEPENDING ON WKS-L40-FUN-L040                        018300      
001255             ELSE                                                 018400      
001256                MOVE 7                TO W77-RESULT-S151          018500      
001257           ELSE                                                   018600      
001258              MOVE 1                  TO W77-RESULT-S151.         018700      
001259     EXIT PROGRAM.                                                018800      
001260                                                                  018900      
001261 00000-LIMPIA-VARIABLES.                                          019000      
001262*=======================                                          019100      
001263     PERFORM 00010-LIMPIA-ARREGLO                                 019200      
001264             VARYING W77-IND FROM 1 BY 1                          019300      
001265             UNTIL   W77-IND > 100.                               019400      
001266     MOVE ZERO                     TO W77-IND                     019500      
001267                                      W77-FECHA-VALIDA            019600      
001268                                      W77-RESULT-S151             019700      
001269                                      W77-ERROR-BASE.             019800      
001270 00005-FUNCION-ERROR.                                             019900      
001271*====================                                             020000      
001272    MOVE 2                         TO W77-RESULT-S151.            020100      
001273                                                                  020200      
001274 00010-LIMPIA-ARREGLO.                                            020300      
001275*=====================                                            020400      
001276     MOVE ZERO                     TO WKS-L40-PROCESO(W77-IND)    020500      
001277                                      WKS-L40-BCOSDET(W77-IND)    020600      
001278*                                      WKS-L40-BCODES(W77-IND)    020700      
001279                                      WKS-L40-MONEDA(W77-IND)     020800      
001280                                      WKS-L40-CVETRA(W77-IND)     020900      
001281                                      WKS-L40-ESQCON(W77-IND)     021000      
001282                                      WKS-L40-NUMMOV(W77-IND)     021100      
001283                                      WKS-L40-IMPMOV(W77-IND).    021200      
001284                                                                  021300      
001285 00-0100-LEVANTA.                                                 021400      
001286*================                                                 021500      
001287     IF WKS-L40-FUN-L040 = 0                                      021600      
001288        IF WKS-INICIO = 1                                         021700      
001289           NEXT SENTENCE                                          021800      
001290        ELSE                                                      021900      
001291           PERFORM 00-0110-LIBRERIAS                              022000      
001292           PERFORM 00-0120-CONSISDIA                              022100      
001293           IF W77-RESULT-LIBCON = 0                               022200      
001294              IF WKS-B01-STABDSEM = 0                             022300      
001295                 MOVE WKS-B01-NOMBDSEM   TO WKS-NOMBD             022400      
001296                 PERFORM 00-0130-ABRE-MOVDIA UNTIL W88-BASE-OPEN  022500      
001297                 IF W77-ERROR-BASE = 0                            022600      
001298                    MOVE 1         TO WKS-ABRE-SEM                022700      
001299                                      WKS-INICIO                  022800      
001300                 ELSE                                             022900      
001301                    NEXT SENTENCE                                 023000      
001302              ELSE                                                023100      
001303                 MOVE 7            TO W77-RESULT-S151             023200      
001304           ELSE                                                   023300      
001305              IF W77-RESULT-LIBCON = 1                            023400      
001306                 MOVE 8            TO W77-RESULT-S151             023500      
001307              ELSE                                                023600      
001308                 MOVE 6            TO W77-RESULT-S151             023700      
001309     ELSE                                                         023800      
001310     IF WKS-L40-FUN-L040 = 40                                     023900      
001311        PERFORM 00-0140-CIERRA-MOVDIA                             024000      
001312     ELSE                                                         024100      
001313     IF WKS-L40-FUN-L040 = 41                                     024200      
001314        PERFORM 00-0130-ABRE-MOVDIA UNTIL W88-BASE-OPEN           024300      
001315     ELSE                                                         024400      
001316        MOVE 1                     TO W77-RESULT-S151.            024500      
001317     MOVE W77-RESULT-S151          TO W77-RESULT-INICIO.          024600      
001318     EXIT PROGRAM.                                                024700      
001319                                                                  024800      
001320 00-0110-LIBRERIAS.                                               024900      
001321*==================                                               025000      
001322                                                                  025010      
001323     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   025012      
001324            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".      025014      
001325     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.025100      
001326     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               025200      
001327                                   TO "SOPORTECOMS".              025300      
001328     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     025400      
001329     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      025500      
001330                                                                  025600      
001331     MOVE "S151L001CTL"            TO WKS-LIBID.                  025700      
001332     CALL "DAME_TIT IN CTLVER"     USING WKS-LIBID, WKS-NOMBLIB   025800      
001333                                   GIVING W77-ERR-CTLVER.         025900      
001334                                                                  026000      
001335     IF W77-ERR-CTLVER = 0                                        026100      
001336        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    026200      
001337     ELSE                                                         026300      
001338        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                026400      
001339          "(S151)S151/OBJECT/L001/LIBCONTROL ON CMEMP.".          026500      
001340                                                                  026600      
001341     CALL "CSIID IN SOPORTECOMS" USING WKS-DATOS-HOST.            026700      
001342                                                                  026750      
001343 00-0120-CONSISDIA.                                               026800      
001344*==================                                               026900      
001345     MOVE WKS-L40-SISTEMA          TO WKS-SISTEMA                 027000      
001346                                      WKS-B01-SISTEMA.            027100      
001347     MOVE 1                        TO WKS-B01-FUNCION.            027200      
001348     MOVE WKS-NUMCSI               TO WKS-B01-CSI.                027300      
001349     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     027400      
001350                                     GIVING W77-RESULT-LIBCON.    027500      
001351**   CANCEL "LIB-CONTROL".                                        027600      
001352                                                                  027700      
001353 00-0130-ABRE-MOVDIA.                                             027800      
001354*====================                                             027900      
001355                                                                  027902      
001356     MOVE 1                        TO W77-BASE.                   027904      
001357     ADD  1                        TO W77-INTENTOS.               027906      
001358                                                                  027908      
001359     MOVE ZERO                     TO W77-ERROR-BASE              027950      
001360                                      W77-RESULT-S151.            027958      
001361     MOVE LOW-VALUES               TO WKS-NULOS.                  028000      
001362                                                                  028050      
001363     IF WKS-NOMBASE-SEM = WKS-ESPACIOS OR                         028100      
001364        WKS-NOMBASE-SEM = WKS-NULOS                               028200      
001365        MOVE 1                     TO W77-ERROR-BASE              028300      
001366     ELSE                                                         028500      
001367        IF WKS-ABRE-SEM = 0                                       028600      
001368           CHANGE ATTRIBUTE TITLE OF BASEMOVDIA TO WKS-NOMBASE-SEM028700      
001369           OPEN UPDATE BASEMOVDIA                                 028800      
001370             ON EXCEPTION                                         028900      
001371                MOVE 1               TO W77-ERROR-BASE            028901      
001372                IF DMSTATUS(OPENERROR)     AND                    028902      
001373                   DMSTATUS(DMERRORTYPE) = 39                     028904      
001374                   WAIT(20)                                       028906      
001375                   MOVE ZERO         TO W77-BASE                  028908      
001376                ELSE                                              028912      
001377                   MOVE WKS-NOMBD    TO WKS-NOM-BDERR-DMSII       029000      
001378                   PERFORM 900000-CHE-STA.                        029300      
001379                                                                  029400      
001380     IF W77-INTENTOS > 5                                          029402      
001381        MOVE "O"                TO WLI-TIPO-LJ TIPO-LJ            029404      
001382        MOVE ZERO               TO W77-INTENTOS                   029406      
001383        MOVE 060315             TO CODIGO-LJ                      029408      
001384        MOVE DMSTATUS(DMCATEGORY)    TO W77-NUM-CAT               029410      
001385        MOVE DMSTATUS(DMERRORTYPE)   TO W77-NUM-SUBCAT            029412      
001386        STRING "ERROR EN BASE BD10 : ARCHIVO DE CONTROL EN USO "  029414      
001387               "EN FORMA EXCLUSIVA"                               029416      
001388               " ERROR DMSII CAT. " WKS-DB-CAT(W77-NUM-CAT)       029418      
001389               " SUBCATEGORIA " W77-NUM-SUBCAT                    029420      
001390        DELIMITED BY SIZE                                         029422      
001391        INTO TEXTO-LJ                                             029424      
001392        MOVE TEXTO-LJ           TO WLI-TEXTO-LJ                   029426      
001393        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      029428      
001394                                                                  029430      
001395     IF W77-ERROR-BASE = 0                                        029500      
001396        MOVE 1                     TO WKS-ABRE-SEM                029600      
001397     ELSE                                                         029700      
001398        MOVE 7                     TO W77-RESULT-S151.            029800      
001399                                                                  029900      
001400                                                                  030000      
001401 00-0140-CIERRA-MOVDIA.                                           030100      
001402*======================                                           030200      
001403     MOVE ZERO                     TO W77-ERROR-BASE.             030300      
001404                                                                  030400      
001405     IF WKS-ABRE-SEM = 1                                          030500      
001406        CLOSE BASEMOVDIA ON EXCEPTION                             030600      
001407                            MOVE 1 TO W77-ERROR-BASE              030700      
001408                            MOVE 9 TO W77-RESULT-S151             030800      
001409                            MOVE WKS-NOMBD TO WKS-NOM-BDERR-DMSII 030900      
001410                            PERFORM 900000-CHE-STA.               031000      
001411     IF W77-ERROR-BASE = 0                                        031100      
001412        MOVE ZERO                  TO WKS-ABRE-SEM.               031200      
001413                                                                  031300      
001414 01-SECCION  SECTION.                                             031400      
001415                                                                  031500      
001416*==========================================================       031600      
001417*         CONSULTA DE TOTALES POR SISTEMA                 =       031700      
001418*==========================================================       031800      
001419                                                                  031900      
001420 01-0100-SIS.                                                     032000      
001421*============                                                     032100      
001422     PERFORM 01-0105-FIND-FIRST                                   032200      
001423     IF W77-ERROR-BASE = 0                                        032300      
001424        IF WKS-L40-FUN-L040 = 1                                   032400      
001425           MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT              032500      
001426           MOVE 1                  TO W77-IND                     032600      
001427           PERFORM 01-0115-MUEVE-DATOS                            032700      
001428           MOVE ZERO               TO WKS-L40-NUMMOV(W77-IND)     032800      
001429                                      WKS-L40-IMPMOV(W77-IND)     032900      
001430           PERFORM 01-0110-CONSIS                                 033000      
001431                   UNTIL W77-IND = 100       OR                   033100      
001432                         W77-ERROR-BASE  > 0 OR                   033200      
001433                         W77-RESULT-S151 > 0                      033300      
001434           IF W77-IND = 100                                       033400      
001435              PERFORM 01-0110-CONSIS                              033500      
001436                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          033600      
001437                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          033700      
001438                      W77-ERROR-BASE  > 0             OR          033800      
001439                      W77-RESULT-S151 > 0                         033900      
001440           ELSE                                                   034000      
001441              NEXT SENTENCE                                       034100      
001442        ELSE                                                      034200      
001443           PERFORM 01-0110-CONSIS                                 034300      
001444                   UNTIL W77-IND = 100       OR                   034400      
001445                         W77-ERROR-BASE  > 0 OR                   034500      
001446                         W77-RESULT-S151 > 0                      034600      
001447           IF W77-IND = 100                                       034700      
001448              PERFORM 01-0110-CONSIS                              034800      
001449                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          034900      
001450                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          035000      
001451                      W77-ERROR-BASE  > 0             OR          035100      
001452                      W77-RESULT-S151 > 0.                        035200      
001453                                                                  035300      
001454     EXIT PROGRAM.                                                035400      
001455                                                                  035500      
001456 01-0105-FIND-FIRST.                                              035600      
001457*===================                                              035700      
001458     IF WKS-L40-CVETRACON = 0 AND                                 035800      
001459        WKS-L40-ESQCONCON = 0                                     035900      
001460        PERFORM 01-0150-FF-SIS                                    036000      
001461     ELSE                                                         036100      
001462        PERFORM 01-0155-FF-CONT.                                  036200      
001463                                                                  036300      
001464 01-0110-CONSIS.                                                  036400      
001465*===============                                                  036500      
001466     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON.            036600      
001467     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           036700      
001468     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        036800      
001469     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             036900      
001470     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          037000      
001471     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          037100      
001472     MOVE B50-MOV-BANCOS           TO WKS-BANCOS     .            037200      
001473     MOVE WKS-BORICON              TO WKS-BORICON-6D .            037220      
001474     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            037240      
001475     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            037260      
001476*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON.            037300      
001477     IF WKS-L40-FUN-L040 = 1                                      037400      
001478        IF W77-CVETRA-ANT = B50-MOV-CVETRA                        037500      
001479           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     037600      
001480                                           WKS-L40-NUMMOV(W77-IND)037700      
001481           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV  +    037800      
001482                                           WKS-L40-IMPMOV(W77-IND)037900      
001483        ELSE                                                      038000      
001484           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     038100      
001485           COMPUTE W77-IND = W77-IND + 1                          038200      
001486           IF W77-IND < 101                                       038300      
001487              PERFORM 01-0115-MUEVE-DATOS                         038400      
001488              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           038500      
001489           ELSE                                                   038600      
001490              NEXT SENTENCE                                       038700      
001491     ELSE                                                         038800      
001492        COMPUTE W77-IND = W77-IND + 1                             038900      
001493        PERFORM 01-0115-MUEVE-DATOS.                              039000      
001494     PERFORM 01-0160-FN-CONXSIS.                                  039100      
001495                                                                  039200      
001496 01-0115-MUEVE-DATOS.                                             039300      
001497*====================                                             039400      
001498     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           039500      
001499     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        039600      
001500     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             039700      
001501                                      WKS-L40-PROCESO(W77-IND).   039800      
001502     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              039900      
001503                                      WKS-L40-MONEDA(W77-IND).    040000      
001504     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           040100      
001505                                      WKS-L40-CVETRA(W77-IND).    040200      
001506     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           040300      
001507                                      WKS-L40-ESQCON(W77-IND).    040400      
001508     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    040500      
001509     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    040600      
001510     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  040700      
001511     MOVE WKS-BORICON              TO WKS-BORICON-6D .            040710      
001512     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            040720      
001513     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             040730      
001514                                      WKS-L40-BCOSDET(W77-IND).   040800      
001515*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON             040900      
001516*                                     WKS-L40-BCODES(W77-IND).    041000      
001517                                                                  041100      
001518 01-0150-FF-SIS.                                                  041200      
001519*===============                                                  041300      
001520     FIND FIRST B50SXTOTXCVE AT                                   041400      
001521                B50-MOV-FEC        = WKS-L40-FECHA    AND         041500      
001522                B50-MOV-MONEDA NOT < WKS-L40-MONCON               041600      
001523             ON EXCEPTION                                         041700      
001524                MOVE 1             TO W77-ERROR-BASE              041800      
001525                IF DMSTATUS(NOTFOUND)                             041900      
001526                   MOVE 3          TO W77-RESULT-S151             042000      
001527                ELSE                                              042100      
001528                   MOVE 9          TO W77-RESULT-S151             042200      
001529                   PERFORM 900000-CHE-STA.                        042300      
001530                                                                  042400      
001531 01-0155-FF-CONT.                                                 042500      
001532*================                                                 042600      
001533     FIND FIRST B50SXTOTXCVE AT                                   042700      
001534                B50-MOV-FEC        = WKS-L40-FECHA    AND         042800      
001535        B50-MOV-PROCESO = WKS-L40-PROCCON      AND                042900      
001536        B50-MOV-PRD     = WKS-L40-PRODUCTO     AND                043000      
001537        B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND                043100      
001538        B50-MOV-MONEDA  = WKS-L40-MONCON       AND                043200      
001539        B50-MOV-CVETRA  = WKS-L40-CVETRACON    AND                043300      
001540        B50-MOV-ESQCON  > WKS-L40-ESQCONCON                       043400      
001541     ON EXCEPTION                                                 043500      
001542     MOVE ZERO                     TO W77-CVETRA-ANT              043600      
001543     IF DMSTATUS(NOTFOUND)                                        043700      
001544        FIND FIRST B50SXTOTXCVE AT                                043800      
001545           B50-MOV-FEC     = WKS-L40-FECHA        AND             043900      
001546           B50-MOV-PROCESO = WKS-L40-PROCCON      AND             044000      
001547           B50-MOV-PRD     = WKS-L40-PRODUCTO     AND             044100      
001548           B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND             044200      
001549           B50-MOV-MONEDA  = WKS-L40-MONCON       AND             044300      
001550           B50-MOV-CVETRA  > WKS-L40-CVETRACON                    044400      
001551        ON EXCEPTION                                              044500      
001552        IF DMSTATUS(NOTFOUND)                                     044600      
001553           FIND FIRST B50SXTOTXCVE AT                             044700      
001554              B50-MOV-FEC        = WKS-L40-FECHA    AND           044800      
001555              B50-MOV-PROCESO = WKS-L40-PROCCON      AND          044900      
001556              B50-MOV-PRD     = WKS-L40-PRODUCTO     AND          045000      
001557              B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND          045100      
001558              B50-MOV-MONEDA  > WKS-L40-MONCON                    045200      
001559           ON EXCEPTION                                           045300      
001560           IF DMSTATUS(NOTFOUND)                                  045400      
001561              FIND FIRST B50SXTOTXCVE AT                          045500      
001562                 B50-MOV-FEC        = WKS-L40-FECHA    AND        045600      
001563                 B50-MOV-PROCESO = WKS-L40-PROCCON      AND       045700      
001564                 B50-MOV-PRD     = WKS-L40-PRODUCTO     AND       045800      
001565                 B50-MOV-INS     > WKS-L40-INSTRUMENTO            045900      
001566              ON EXCEPTION                                        046000      
001567              IF DMSTATUS(NOTFOUND)                               046100      
001568                 FIND FIRST B50SXTOTXCVE AT                       046200      
001569                    B50-MOV-FEC     = WKS-L40-FECHA    AND        046300      
001570                    B50-MOV-PROCESO = WKS-L40-PROCCON   AND       046400      
001571                    B50-MOV-PRD     > WKS-L40-PRODUCTO            046500      
001572                 ON EXCEPTION                                     046600      
001573                 IF DMSTATUS(NOTFOUND)                            046700      
001574                    FIND FIRST B50SXTOTXCVE AT                    046800      
001575                       B50-MOV-FEC     = WKS-L40-FECHA    AND     046900      
001576                       B50-MOV-PROCESO > WKS-L40-PROCCON          047000      
001577                    ON EXCEPTION                                  047100      
001578                    IF DMSTATUS(NOTFOUND)                         047200      
001579                       MOVE 1      TO W77-ERROR-BASE              047300      
001580                       IF DMSTATUS(NOTFOUND)                      047400      
001581                          MOVE 3   TO W77-RESULT-S151             047500      
001582                       ELSE                                       047600      
001583                          MOVE 9   TO W77-RESULT-S151             047700      
001584                          PERFORM 900000-CHE-STA                  047800      
001585                    ELSE                                          047900      
001586                       MOVE 9   TO W77-RESULT-S151                048000      
001587                       PERFORM 900000-CHE-STA                     048100      
001588                 ELSE                                             048200      
001589                    MOVE 9   TO W77-RESULT-S151                   048300      
001590                    PERFORM 900000-CHE-STA                        048400      
001591              ELSE                                                048500      
001592                 MOVE 9   TO W77-RESULT-S151                      048600      
001593                 PERFORM 900000-CHE-STA                           048700      
001594           ELSE                                                   048800      
001595              MOVE 9   TO W77-RESULT-S151                         048900      
001596              PERFORM 900000-CHE-STA                              049000      
001597        ELSE                                                      049100      
001598           MOVE 9   TO W77-RESULT-S151                            049200      
001599           PERFORM 900000-CHE-STA                                 049300      
001600     ELSE                                                         049400      
001601        MOVE 9   TO W77-RESULT-S151                               049500      
001602        PERFORM 900000-CHE-STA.                                   049600      
001603                                                                  049700      
001604 01-0160-FN-CONXSIS.                                              049800      
001605*===================                                              049900      
001606     FIND NEXT  B50SXTOTXCVE AT                                   050000      
001607                B50-MOV-FEC        = WKS-L40-FECHA                050100      
001608             ON EXCEPTION                                         050200      
001609                MOVE 1             TO W77-ERROR-BASE              050300      
001610                IF DMSTATUS(NOTFOUND)                             050400      
001611                   MOVE 99         TO W77-RESULT-S151             050500      
001612                ELSE                                              050600      
001613                   MOVE 9          TO W77-RESULT-S151             050700      
001614                   PERFORM 900000-CHE-STA.                        050800      
001615                                                                  050900      
001616*==========================================================       051000      
001617*         CONSULTA DE SISTEMA-PRODUCTO                    =       051100      
001618*==========================================================       051200      
001619                                                                  051300      
001620 02-0100-PRD.                                                     051400      
001621*============                                                     051500      
001622     PERFORM 02-0105-FIND-FIRST                                   051600      
001623     IF W77-ERROR-BASE = 0                                        051700      
001624        IF WKS-L40-FUN-L040 = 2                                   051800      
001625           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 051900      
001626           MOVE 1               TO W77-IND                        052000      
001627           PERFORM 02-0115-MUEVE-DATOS                            052100      
001628           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        052200      
001629                                   WKS-L40-IMPMOV(W77-IND)        052300      
001630           PERFORM 02-0110-CONPRD                                 052400      
001631                   UNTIL W77-IND = 100       OR                   052500      
001632                         W77-ERROR-BASE  > 0 OR                   052600      
001633                         W77-RESULT-S151 > 0                      052700      
001634           IF W77-IND = 100                                       052800      
001635              PERFORM 02-0110-CONPRD                              052900      
001636                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          053000      
001637                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          053100      
001638                      W77-ERROR-BASE  > 0             OR          053200      
001639                      W77-RESULT-S151 > 0                         053300      
001640           ELSE                                                   053400      
001641              NEXT SENTENCE                                       053500      
001642        ELSE                                                      053600      
001643           PERFORM 02-0110-CONPRD                                 053700      
001644                   UNTIL W77-IND = 100       OR                   053800      
001645                         W77-ERROR-BASE  > 0 OR                   053900      
001646                         W77-RESULT-S151 > 0                      054000      
001647           IF W77-IND = 100                                       054100      
001648              PERFORM 02-0110-CONPRD                              054200      
001649                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          054300      
001650                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          054400      
001651                      W77-ERROR-BASE  > 0             OR          054500      
001652                      W77-RESULT-S151 > 0.                        054600      
001653     EXIT PROGRAM.                                                054700      
001654                                                                  054800      
001655 02-0105-FIND-FIRST.                                              054900      
001656*===================                                              055000      
001657     IF WKS-L40-CVETRACON = 0 AND                                 055100      
001658        WKS-L40-ESQCONCON = 0                                     055200      
001659        PERFORM 02-0150-FF-PRD                                    055300      
001660     ELSE                                                         055400      
001661        PERFORM 02-0155-FF-CONT.                                  055500      
001662                                                                  055600      
001663 02-0110-CONPRD.                                                  055700      
001664*===============                                                  055800      
001665     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON.            055900      
001666     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        056000      
001667     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          056100      
001668     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          056200      
001669     MOVE B50-MOV-BANCOS           TO WKS-BANCOS     .            056300      
001670     MOVE WKS-BORICON              TO WKS-BORICON-6D .            056350      
001671     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            056400      
001672     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            056450      
001673     IF WKS-L40-FUN-L040 = 2                                      056500      
001674        IF W77-CVETRA-ANT = B50-MOV-CVETRA AND                    056600      
001675           WKS-L40-MONCON = B50-MOV-MONEDA                        056700      
001676           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     056800      
001677                                           WKS-L40-NUMMOV(W77-IND)056900      
001678           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     057000      
001679                                           WKS-L40-IMPMOV(W77-IND)057100      
001680        ELSE                                                      057200      
001681           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     057300      
001682           MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON           057400      
001683           COMPUTE W77-IND = W77-IND + 1                          057500      
001684           IF W77-IND < 101                                       057600      
001685              PERFORM 02-0115-MUEVE-DATOS                         057700      
001686              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           057800      
001687           ELSE                                                   057900      
001688              NEXT SENTENCE                                       058000      
001689     ELSE                                                         058100      
001690        COMPUTE W77-IND = W77-IND + 1                             058200      
001691        PERFORM 02-0115-MUEVE-DATOS.                              058300      
001692     PERFORM 02-0160-FN-CONXPRD.                                  058400      
001693                                                                  058500      
001694 02-0115-MUEVE-DATOS.                                             058600      
001695*====================                                             058700      
001696     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           058800      
001697     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        058900      
001698     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             059000      
001699                                      WKS-L40-PROCESO(W77-IND).   059100      
001700     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              059200      
001701                                      WKS-L40-MONEDA(W77-IND).    059300      
001702     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           059400      
001703                                      WKS-L40-CVETRA(W77-IND).    059500      
001704     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           059600      
001705                                      WKS-L40-ESQCON(W77-IND).    059700      
001706     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    059800      
001707     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    059900      
001708     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  060000      
001709     MOVE WKS-BORICON              TO WKS-BORICON-6D .            060020      
001710     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            060040      
001711     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             060060      
001712                                      WKS-L40-BCOSDET(W77-IND).   060100      
001713*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON             060200      
001714*                                     WKS-L40-BCODES(W77-IND).    060300      
001715                                                                  060400      
001716 02-0150-FF-PRD.                                                  060500      
001717*===============                                                  060600      
001718     FIND FIRST B50SXTOTXCVE AT                                   060700      
001719                B50-MOV-FEC        = WKS-L40-FECHA    AND         060800      
001720                B50-MOV-BANCOS     = WKS-BANCOS       AND         060900      
001721*               B50-MOV-BCODES     = WKS-L40-BDESCON  AND         061000      
001722                B50-MOV-PRD        = WKS-L40-PRODUCTO             061100      
001723             ON EXCEPTION                                         061200      
001724                MOVE 1             TO W77-ERROR-BASE              061300      
001725                IF DMSTATUS(NOTFOUND)                             061400      
001726                   MOVE 4          TO W77-RESULT-S151             061500      
001727                ELSE                                              061600      
001728                   MOVE 9          TO W77-RESULT-S151             061700      
001729                   PERFORM 900000-CHE-STA.                        061800      
001730 02-0155-FF-CONT.                                                 061900      
001731*===============                                                  062000      
001732     FIND FIRST B50SXTOTXCVE AT                                   062100      
001733          B50-MOV-FEC        = WKS-L40-FECHA    AND               062200      
001734          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               062300      
001735          B50-MOV-BANCOS  = WKS-BANCOS          AND               062400      
001736*         B50-MOV-BCODES  = WKS-L40-BDESCON     AND               062500      
001737          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               062600      
001738          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               062700      
001739          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               062800      
001740          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               062900      
001741          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     063000      
001742       ON EXCEPTION                                               063100      
001743       MOVE ZERO                   TO W77-CVETRA-ANT              063200      
001744       IF DMSTATUS(NOTFOUND)                                      063300      
001745          FIND FIRST B50SXTOTXCVE AT                              063400      
001746               B50-MOV-FEC        = WKS-L40-FECHA    AND          063500      
001747               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          063600      
001748               B50-MOV-BANCOS     = WKS-BANCOS       AND          063700      
001749*              B50-MOV-BCODES     = WKS-L40-BDESCON  AND          063800      
001750               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          063900      
001751               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          064000      
001752               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          064100      
001753               B50-MOV-CVETRA  > WKS-L40-CVETRACON                064200      
001754             ON EXCEPTION                                         064300      
001755             IF DMSTATUS(NOTFOUND)                                064400      
001756                FIND FIRST B50SXTOTXCVE AT                        064500      
001757                   B50-MOV-FEC        = WKS-L40-FECHA    AND      064600      
001758                   B50-MOV-PROCESO = WKS-L40-PROCCON     AND      064700      
001759                   B50-MOV-BANCOS     = WKS-BANCOS       AND      064800      
001760*                  B50-MOV-BCODES     = WKS-L40-BDESCON  AND      064900      
001761                   B50-MOV-PRD     = WKS-L40-PRODUCTO    AND      065000      
001762                   B50-MOV-INS     = WKS-L40-INSTRUMENTO AND      065100      
001763                   B50-MOV-MONEDA  > WKS-L40-MONCON               065200      
001764                ON EXCEPTION                                      065300      
001765                IF DMSTATUS(NOTFOUND)                             065400      
001766                   FIND FIRST B50SXTOTXCVE AT                     065500      
001767                      B50-MOV-FEC        = WKS-L40-FECHA AND      065600      
001768                      B50-MOV-PROCESO = WKS-L40-PROCCON     AND   065700      
001769                      B50-MOV-BANCOS  = WKS-BANCOS          AND   065800      
001770*                     B50-MOV-BCODES  = WKS-L40-BDESCON     AND   065900      
001771                      B50-MOV-PRD     = WKS-L40-PRODUCTO    AND   066000      
001772                      B50-MOV-INS     > WKS-L40-INSTRUMENTO       066100      
001773                   ON EXCEPTION                                   066200      
001774                   IF DMSTATUS(NOTFOUND)                          066300      
001775                      FIND FIRST B50SXTOTXCVE AT                  066400      
001776                        B50-MOV-FEC        = WKS-L40-FECHA    AND 066500      
001777                        B50-MOV-PROCESO    > WKS-L40-PROCCON  AND 066600      
001778                        B50-MOV-BANCOS     = WKS-BANCOS       AND 066700      
001779*                       B50-MOV-BCODES     = WKS-L40-BDESCON  AND 066800      
001780                        B50-MOV-PRD        = WKS-L40-PRODUCTO     066900      
001781                      ON EXCEPTION                                067000      
001782                      MOVE 1    TO W77-ERROR-BASE                 067100      
001783                      IF DMSTATUS(NOTFOUND)                       067200      
001784                         MOVE 99   TO W77-RESULT-S151             067300      
001785                      ELSE                                        067400      
001786                         MOVE 9    TO W77-RESULT-S151             067500      
001787                         PERFORM 900000-CHE-STA                   067600      
001788                   ELSE                                           067700      
001789                      MOVE 9    TO W77-RESULT-S151                067800      
001790                      PERFORM 900000-CHE-STA                      067900      
001791                ELSE                                              068000      
001792                   MOVE 9    TO W77-RESULT-S151                   068100      
001793                   PERFORM 900000-CHE-STA                         068200      
001794             ELSE                                                 068300      
001795                MOVE 9    TO W77-RESULT-S151                      068400      
001796                PERFORM 900000-CHE-STA                            068500      
001797       ELSE                                                       068600      
001798          MOVE 9    TO W77-RESULT-S151                            068700      
001799          PERFORM 900000-CHE-STA.                                 068800      
001800                                                                  068900      
001801 02-0160-FN-CONXPRD.                                              069000      
001802*===================                                              069100      
001803     FIND NEXT  B50SXTOTXCVE AT                                   069200      
001804                B50-MOV-FEC        = WKS-L40-FECHA    AND         069300      
001805                B50-MOV-BANCOS     = WKS-BANCOS       AND         069400      
001806*               B50-MOV-BCODES     = WKS-L40-BDESCON  AND         069500      
001807                B50-MOV-PRD        = WKS-L40-PRODUCTO             069600      
001808             ON EXCEPTION                                         069700      
001809                MOVE 1             TO W77-ERROR-BASE              069800      
001810                IF DMSTATUS(NOTFOUND)                             069900      
001811                   MOVE 99         TO W77-RESULT-S151             070000      
001812                ELSE                                              070100      
001813                   MOVE 9          TO W77-RESULT-S151.            070200      
001814                                                                  070300      
001815*==========================================================       070400      
001816*  CONSULTA DE TOTTALES POR SISTEMA-PRODUCTO-INSTRUMENTO  =       070500      
001817*==========================================================       070600      
001818 03-0100-PRD-INS.                                                 070700      
001819*================                                                 070800      
001820     PERFORM 03-0105-FIND-FIRST                                   070900      
001821     IF W77-ERROR-BASE = 0                                        071000      
001822        IF WKS-L40-FUN-L040 = 3                                   071100      
001823           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 071200      
001824           MOVE 1               TO W77-IND                        071300      
001825           PERFORM 03-0115-MUEVE-DATOS                            071400      
001826           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        071500      
001827                                   WKS-L40-IMPMOV(W77-IND)        071600      
001828           PERFORM 03-0110-PRDINS                                 071700      
001829                   UNTIL W77-IND = 100       OR                   071800      
001830                         W77-ERROR-BASE  > 0 OR                   071900      
001831                         W77-RESULT-S151 > 0                      072000      
001832           IF W77-IND = 100                                       072100      
001833              PERFORM 03-0110-PRDINS                              072200      
001834                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          072300      
001835                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          072400      
001836                      W77-ERROR-BASE  > 0             OR          072500      
001837                      W77-RESULT-S151 > 0                         072600      
001838           ELSE                                                   072700      
001839              NEXT SENTENCE                                       072800      
001840        ELSE                                                      072900      
001841           PERFORM 03-0110-PRDINS                                 073000      
001842                   UNTIL W77-IND = 100       OR                   073100      
001843                         W77-ERROR-BASE  > 0 OR                   073200      
001844                          W77-RESULT-S151 > 0                     073300      
001845           IF W77-IND = 100                                       073400      
001846              PERFORM 03-0110-PRDINS                              073500      
001847                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          073600      
001848                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          073700      
001849                      W77-ERROR-BASE  > 0             OR          073800      
001850                      W77-RESULT-S151 > 0.                        073900      
001851                                                                  074000      
001852     EXIT PROGRAM.                                                074100      
001853                                                                  074200      
001854 03-0105-FIND-FIRST.                                              074300      
001855*===================                                              074400      
001856     IF WKS-L40-CVETRACON = 0 AND                                 074500      
001857        WKS-L40-ESQCONCON = 0                                     074600      
001858        PERFORM 03-0150-FF-PRDINS                                 074700      
001859     ELSE                                                         074800      
001860        PERFORM 03-0155-FF-CONT.                                  074900      
001861                                                                  075000      
001862     IF W77-ERROR-BASE = 0                                        075100      
001863        MOVE B50-MOV-MONEDA        TO WKS-L40-MONCON.             075200      
001864 03-0110-PRDINS.                                                  075300      
001865*===============                                                  075400      
001866     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON.            075500      
001867     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON .            075600      
001868     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          075700      
001869     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          075800      
001870     MOVE B50-MOV-BANCOS           TO WKS-BANCOS     .            075900      
001871     MOVE WKS-BORICON              TO WKS-BORICON-6D .            075920      
001872     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            075940      
001873     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            075960      
001874*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON.            076000      
001875     IF WKS-L40-FUN-L040 = 3                                      076100      
001876        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        076200      
001877           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     076300      
001878                                           WKS-L40-NUMMOV(W77-IND)076400      
001879           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     076500      
001880                                           WKS-L40-IMPMOV(W77-IND)076600      
001881        ELSE                                                      076700      
001882           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     076800      
001883           COMPUTE W77-IND = W77-IND + 1                          076900      
001884           IF W77-IND < 101                                       077000      
001885              PERFORM 03-0115-MUEVE-DATOS                         077100      
001886              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           077200      
001887           ELSE                                                   077300      
001888              NEXT SENTENCE                                       077400      
001889     ELSE                                                         077500      
001890        COMPUTE W77-IND = W77-IND + 1                             077600      
001891        PERFORM 03-0115-MUEVE-DATOS.                              077700      
001892     PERFORM 03-0160-FN-PRDINS.                                   077800      
001893                                                                  077900      
001894 03-0115-MUEVE-DATOS.                                             078000      
001895*====================                                             078100      
001896     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           078200      
001897     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        078300      
001898     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             078400      
001899                                      WKS-L40-PROCESO(W77-IND).   078500      
001900     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              078600      
001901                                      WKS-L40-MONEDA(W77-IND).    078700      
001902     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           078800      
001903                                      WKS-L40-CVETRA(W77-IND).    078900      
001904     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           079000      
001905                                      WKS-L40-ESQCON(W77-IND).    079100      
001906     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    079200      
001907     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    079300      
001908     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  079400      
001909     MOVE WKS-BORICON              TO WKS-BORICON-6D .            079420      
001910     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            079440      
001911     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             079460      
001912                                      WKS-L40-BCOSDET(W77-IND).   079500      
001913*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON             079600      
001914*                                     WKS-L40-BCODES(W77-IND).    079700      
001915                                                                  079800      
001916 03-0150-FF-PRDINS.                                               079900      
001917*==================                                               080000      
001918     FIND FIRST B50SXTOTXCVE AT                                   080100      
001919                B50-MOV-FEC     = WKS-L40-FECHA     AND           080200      
001920                B50-MOV-PRD     = WKS-L40-PRODUCTO  AND           080300      
001921                B50-MOV-BANCOS  = WKS-BANCOS        AND           080400      
001922*               B50-MOV-BCODES  = WKS-L40-BDESCON   AND           080500      
001923                B50-MOV-INS     = WKS-L40-INSTRUMENTO             080600      
001924             ON EXCEPTION                                         080700      
001925                MOVE 1             TO W77-ERROR-BASE              080800      
001926                IF DMSTATUS(NOTFOUND)                             080900      
001927                   MOVE 5          TO W77-RESULT-S151             081000      
001928                ELSE                                              081100      
001929                   MOVE 9          TO W77-RESULT-S151             081200      
001930                   PERFORM 900000-CHE-STA.                        081300      
001931 03-0155-FF-CONT.                                                 081400      
001932*================                                                 081500      
001933     FIND FIRST B50SXTOTXCVE AT                                   081600      
001934          B50-MOV-FEC     = WKS-L40-FECHA       AND               081700      
001935          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               081800      
001936          B50-MOV-BANCOS  = WKS-BANCOS          AND               081900      
001937*         B50-MOV-BCODES  = WKS-L40-BDESCON     AND               082000      
001938          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               082100      
001939          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               082200      
001940          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               082300      
001941          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               082400      
001942          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     082500      
001943       ON EXCEPTION                                               082600      
001944       MOVE ZERO                   TO W77-CVETRA-ANT              082700      
001945       IF DMSTATUS(NOTFOUND)                                      082800      
001946          FIND FIRST B50SXTOTXCVE AT                              082900      
001947               B50-MOV-FEC     = WKS-L40-FECHA       AND          083000      
001948               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          083100      
001949               B50-MOV-BANCOS  = WKS-BANCOS          AND          083200      
001950*              B50-MOV-BCODES  = WKS-L40-BDESCON     AND          083300      
001951               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          083400      
001952               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          083500      
001953               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          083600      
001954               B50-MOV-CVETRA  > WKS-L40-CVETRACON                083700      
001955            ON EXCEPTION                                          083800      
001956            IF DMSTATUS(NOTFOUND)                                 083900      
001957               FIND FIRST B50SXTOTXCVE AT                         084000      
001958                    B50-MOV-FEC     = WKS-L40-FECHA       AND     084100      
001959                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     084200      
001960                    B50-MOV-BANCOS  = WKS-BANCOS          AND     084300      
001961*                   B50-MOV-BCODES  = WKS-L40-BDESCON     AND     084400      
001962                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     084500      
001963                    B50-MOV-INS     = WKS-L40-INSTRUMENTO AND     084600      
001964                    B50-MOV-MONEDA  > WKS-L40-MONCON              084700      
001965                 ON EXCEPTION                                     084800      
001966                 IF DMSTATUS(NOTFOUND)                            084900      
001967                    FIND FIRST B50SXTOTXCVE AT                    085000      
001968                         B50-MOV-FEC     = WKS-L40-FECHA     AND  085100      
001969                         B50-MOV-PROCESO > WKS-L40-PROCCON   AND  085200      
001970                         B50-MOV-BANCOS  = WKS-BANCOS        AND  085300      
001971*                        B50-MOV-BCODES  = WKS-L40-BDESCON   AND  085400      
001972                         B50-MOV-PRD     = WKS-L40-PRODUCTO  AND  085500      
001973                         B50-MOV-INS     = WKS-L40-INSTRUMENTO    085600      
001974                      ON EXCEPTION                                085700      
001975                      MOVE 1            TO W77-ERROR-BASE         085800      
001976                      IF DMSTATUS(NOTFOUND)                       085900      
001977                         MOVE 99        TO W77-RESULT-S151        086000      
001978                      ELSE                                        086100      
001979                         MOVE 9         TO W77-RESULT-S151        086200      
001980                         PERFORM 900000-CHE-STA                   086300      
001981                 ELSE                                             086400      
001982                    MOVE 9         TO W77-RESULT-S151             086500      
001983                    PERFORM 900000-CHE-STA                        086600      
001984            ELSE                                                  086700      
001985               MOVE 9         TO W77-RESULT-S151                  086800      
001986               PERFORM 900000-CHE-STA                             086900      
001987       ELSE                                                       087000      
001988          MOVE 9         TO W77-RESULT-S151                       087100      
001989          PERFORM 900000-CHE-STA.                                 087200      
001990                                                                  087300      
001991 03-0160-FN-PRDINS.                                               087400      
001992*==================                                               087500      
001993     FIND NEXT  B50SXTOTXCVE AT                                   087600      
001994                B50-MOV-FEC      = WKS-L40-FECHA       AND        087700      
001995                B50-MOV-PRD      = WKS-L40-PRODUCTO    AND        087800      
001996                B50-MOV-BANCOS   = WKS-BANCOS          AND        087900      
001997*               B50-MOV-BCODES   = WKS-L40-BDESCON     AND        088000      
001998                B50-MOV-INS      = WKS-L40-INSTRUMENTO            088100      
001999       ON EXCEPTION                                               088200      
002000          MOVE 1             TO W77-ERROR-BASE                    088300      
002001          IF DMSTATUS(NOTFOUND)                                   088400      
002002             MOVE 99         TO W77-RESULT-S151                   088500      
002003          ELSE                                                    088600      
002004             MOVE 9          TO W77-RESULT-S151                   088700      
002005             PERFORM 900000-CHE-STA.                              088800      
002006                                                                  088900      
002007 02-SECCION SECTION.                                              089000      
002008*==========================================================       089100      
002009*  CONSULTA DE TOTALES POR SISTEMA-MONEDA                 =       089200      
002010*==========================================================       089300      
002011                                                                  089400      
002012 04-0100-MON.                                                     089500      
002013*================                                                 089600      
002014     PERFORM 04-0105-FIND-FIRST                                   089700      
002015     IF W77-ERROR-BASE = 0                                        089800      
002016        IF WKS-L40-FUN-L040 = 4                                   089900      
002017           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 090000      
002018           MOVE 1               TO W77-IND                        090100      
002019           PERFORM 04-0115-MUEVE-DATOS                            090200      
002020           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        090300      
002021                                   WKS-L40-IMPMOV(W77-IND)        090400      
002022           PERFORM 04-0110-SISMON                                 090500      
002023                   UNTIL W77-IND = 100       OR                   090600      
002024                         W77-ERROR-BASE  > 0 OR                   090700      
002025                         W77-RESULT-S151 > 0                      090800      
002026           IF W77-IND = 100                                       090900      
002027              PERFORM 04-0110-SISMON                              091000      
002028                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          091100      
002029                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          091200      
002030                      W77-ERROR-BASE  > 0             OR          091300      
002031                      W77-RESULT-S151 > 0                         091400      
002032           ELSE                                                   091500      
002033              NEXT SENTENCE                                       091600      
002034         ELSE                                                     091700      
002035           PERFORM 04-0110-SISMON                                 091800      
002036                   UNTIL W77-IND = 100       OR                   091900      
002037                         W77-ERROR-BASE  > 0 OR                   092000      
002038                         W77-RESULT-S151 > 0                      092100      
002039           IF W77-IND = 100                                       092200      
002040              PERFORM 04-0110-SISMON                              092300      
002041                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          092400      
002042                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          092500      
002043                      W77-ERROR-BASE  > 0             OR          092600      
002044                      W77-RESULT-S151 > 0.                        092700      
002045                                                                  092800      
002046     EXIT PROGRAM.                                                092900      
002047                                                                  093000      
002048 04-0105-FIND-FIRST.                                              093100      
002049*===================                                              093200      
002050     IF WKS-L40-CVETRACON = 0 AND                                 093300      
002051        WKS-L40-ESQCONCON = 0                                     093400      
002052        PERFORM 04-0150-FF-MON                                    093500      
002053     ELSE                                                         093600      
002054        PERFORM 04-0155-FF-CONT.                                  093700      
002055                                                                  093800      
002056 04-0110-SISMON.                                                  093900      
002057*===============                                                  094000      
002058     MOVE B50-MOV-PROCESO         TO WKS-L40-PROCCON.             094100      
002059     MOVE B50-MOV-PRD             TO WKS-L40-PRODUCTO.            094200      
002060     MOVE B50-MOV-INS             TO WKS-L40-INSTRUMENTO.         094300      
002061     MOVE B50-MOV-CVETRA          TO WKS-L40-CVETRACON.           094400      
002062     MOVE B50-MOV-ESQCON          TO WKS-L40-ESQCONCON.           094500      
002063     MOVE B50-MOV-BANCOS          TO WKS-BANCOS     .             094600      
002064     MOVE WKS-BORICON              TO WKS-BORICON-6D .            094620      
002065     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            094640      
002066     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            094660      
002067*    MOVE B50-MOV-BCODES          TO WKS-L40-BDESCON.             094700      
002068     IF WKS-L40-FUN-L040 = 4                                      094800      
002069        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        094900      
002070           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     095000      
002071                                           WKS-L40-NUMMOV(W77-IND)095100      
002072           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     095200      
002073                                           WKS-L40-IMPMOV(W77-IND)095300      
002074        ELSE                                                      095400      
002075           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     095500      
002076           MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON           095600      
002077           COMPUTE W77-IND = W77-IND + 1                          095700      
002078           IF W77-IND < 101                                       095800      
002079              PERFORM 04-0115-MUEVE-DATOS                         095900      
002080              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           096000      
002081           ELSE                                                   096100      
002082              NEXT SENTENCE                                       096200      
002083     ELSE                                                         096300      
002084        COMPUTE W77-IND = W77-IND + 1                             096400      
002085        PERFORM 04-0115-MUEVE-DATOS.                              096500      
002086     PERFORM 04-0160-FN-MON.                                      096600      
002087                                                                  096700      
002088 04-0115-MUEVE-DATOS.                                             096800      
002089*====================                                             096900      
002090     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           097000      
002091     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        097100      
002092     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             097200      
002093                                      WKS-L40-PROCESO(W77-IND).   097300      
002094     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              097400      
002095                                      WKS-L40-MONEDA(W77-IND).    097500      
002096     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           097600      
002097                                      WKS-L40-CVETRA(W77-IND).    097700      
002098     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           097800      
002099                                      WKS-L40-ESQCON(W77-IND).    097900      
002100     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    098000      
002101     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    098100      
002102     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  098200      
002103     MOVE WKS-BORICON              TO WKS-BORICON-6D .            098220      
002104     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            098240      
002105     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             098260      
002106                                      WKS-L40-BCOSDET(W77-IND).   098300      
002107*    MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON             098400      
002108*                                     WKS-L40-BCODES(W77-IND).    098500      
002109                                                                  098600      
002110 04-0150-FF-MON.                                                  098700      
002111*======================                                           098800      
002112     FIND FIRST B50SXTOTXCVE AT                                   098900      
002113                B50-MOV-FEC        = WKS-L40-FECHA    AND         099000      
002114                B50-MOV-BANCOS     = WKS-BANCOS       AND         099100      
002115*               B50-MOV-BCODES     = WKS-L40-BDESCON  AND         099200      
002116                B50-MOV-MONEDA     = WKS-L40-MONCON               099300      
002117             ON EXCEPTION                                         099400      
002118                MOVE 1             TO W77-ERROR-BASE              099500      
002119                IF DMSTATUS(NOTFOUND)                             099600      
002120                   MOVE 3          TO W77-RESULT-S151             099700      
002121                ELSE                                              099800      
002122                   MOVE 9          TO W77-RESULT-S151             099900      
002123                   PERFORM 900000-CHE-STA.                        100000      
002124 04-0155-FF-CONT.                                                 100100      
002125*================                                                 100200      
002126     FIND FIRST B50SXTOTXCVE AT                                   100300      
002127                B50-MOV-FEC        = WKS-L40-FECHA    AND         100400      
002128          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               100500      
002129          B50-MOV-BANCOS  = WKS-BANCOS          AND               100600      
002130*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              100700      
002131          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               100800      
002132          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               100900      
002133          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               101000      
002134          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               101100      
002135          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     101200      
002136       ON EXCEPTION                                               101300      
002137       MOVE ZERO                      TO W77-CVETRA-ANT           101400      
002138       IF DMSTATUS(NOTFOUND)                                      101500      
002139          FIND FIRST B50SXTOTXCVE AT                              101600      
002140               B50-MOV-FEC     = WKS-L40-FECHA       AND          101700      
002141               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          101800      
002142               B50-MOV-BANCOS  = WKS-BANCOS          AND          101900      
002143*               B50-MOV-BCODES  = WKS-L40-BDESCON     AND         102000      
002144               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          102100      
002145               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          102200      
002146               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          102300      
002147               B50-MOV-CVETRA  > WKS-L40-CVETRACON                102400      
002148            ON EXCEPTION                                          102500      
002149            IF DMSTATUS(NOTFOUND)                                 102600      
002150               FIND FIRST B50SXTOTXCVE AT                         102700      
002151                    B50-MOV-FEC     = WKS-L40-FECHA       AND     102800      
002152                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     102900      
002153                    B50-MOV-BANCOS  = WKS-BANCOS          AND     103000      
002154*                    B50-MOV-BCODES  = WKS-L40-BDESCON     AND    103100      
002155                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     103200      
002156                    B50-MOV-INS     > WKS-L40-INSTRUMENTO AND     103300      
002157                    B50-MOV-MONEDA  = WKS-L40-MONCON              103400      
002158                 ON EXCEPTION                                     103500      
002159                IF DMSTATUS(NOTFOUND)                             103600      
002160                   FIND FIRST B50SXTOTXCVE AT                     103700      
002161                        B50-MOV-FEC     = WKS-L40-FECHA    AND    103800      
002162                        B50-MOV-PROCESO = WKS-L40-PROCCON  AND    103900      
002163                        B50-MOV-BANCOS  = WKS-BANCOS       AND    104000      
002164*                        B50-MOV-BCODES  = WKS-L40-BDESCON  AND   104100      
002165                        B50-MOV-PRD     > WKS-L40-PRODUCTO AND    104200      
002166                        B50-MOV-MONEDA  = WKS-L40-MONCON          104300      
002167                     ON EXCEPTION                                 104400      
002168                     IF DMSTATUS(NOTFOUND)                        104500      
002169                        FIND FIRST B50SXTOTXCVE AT                104600      
002170                          B50-MOV-FEC     = WKS-L40-FECHA    AND  104700      
002171                          B50-MOV-PROCESO > WKS-L40-PROCCON  AND  104800      
002172                          B50-MOV-BANCOS  = WKS-BANCOS       AND  104900      
002173*                          B50-MOV-BCODES  = WKS-L40-BDESCON  AND 105000      
002174                          B50-MOV-MONEDA  = WKS-L40-MONCON        105100      
002175                          ON EXCEPTION                            105200      
002176                          MOVE 1   TO W77-ERROR-BASE              105300      
002177                          IF DMSTATUS(NOTFOUND)                   105400      
002178                             MOVE 99 TO W77-RESULT-S151           105500      
002179                          ELSE                                    105600      
002180                             MOVE 9  TO W77-RESULT-S151           105700      
002181                             PERFORM 900000-CHE-STA               105800      
002182                     ELSE                                         105900      
002183                        MOVE 9  TO W77-RESULT-S151                106000      
002184                        PERFORM 900000-CHE-STA                    106100      
002185                ELSE                                              106200      
002186                   MOVE 9  TO W77-RESULT-S151                     106300      
002187                   PERFORM 900000-CHE-STA                         106400      
002188            ELSE                                                  106500      
002189               MOVE 9  TO W77-RESULT-S151                         106600      
002190               PERFORM 900000-CHE-STA                             106700      
002191       ELSE                                                       106800      
002192          MOVE 9  TO W77-RESULT-S151                              106900      
002193          PERFORM 900000-CHE-STA.                                 107000      
002194                                                                  107100      
002195 04-0160-FN-MON.                                                  107200      
002196*======================                                           107300      
002197     FIND NEXT  B50SXTOTXCVE AT                                   107400      
002198                B50-MOV-FEC      = WKS-L40-FECHA    AND           107500      
002199                B50-MOV-BANCOS   = WKS-BANCOS       AND           107600      
002200*                B50-MOV-BCODES   = WKS-L40-BDESCON  AND          107700      
002201                B50-MOV-MONEDA   = WKS-L40-MONCON                 107800      
002202             ON EXCEPTION                                         107900      
002203                MOVE 1             TO W77-ERROR-BASE              108000      
002204                IF DMSTATUS(NOTFOUND)                             108100      
002205                   MOVE 99         TO W77-RESULT-S151             108200      
002206                ELSE                                              108300      
002207                   MOVE 9          TO W77-RESULT-S151             108400      
002208                   PERFORM 900000-CHE-STA.                        108500      
002209                                                                  108600      
002210*==========================================================       108700      
002211*  CONSULTA DE TOTALES POR SISTEMA-PRODUCTO-MONEDA        =       108800      
002212*==========================================================       108900      
002213                                                                  109000      
002214 05-0100-PRD-MON.                                                 109100      
002215*================                                                 109200      
002216     PERFORM 05-0105-FIND-FIRST                                   109300      
002217     IF W77-ERROR-BASE = 0                                        109400      
002218        IF WKS-L40-FUN-L040 = 5                                   109500      
002219           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 109600      
002220           MOVE 1               TO W77-IND                        109700      
002221           PERFORM 05-0115-MUEVE-DATOS                            109800      
002222           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        109900      
002223                                   WKS-L40-IMPMOV(W77-IND)        110000      
002224           PERFORM 05-0110-PRDMON                                 110100      
002225                   UNTIL W77-IND = 100       OR                   110200      
002226                         W77-ERROR-BASE  > 0 OR                   110300      
002227                         W77-RESULT-S151 > 0                      110400      
002228           IF W77-IND = 100                                       110500      
002229              PERFORM 05-0110-PRDMON                              110600      
002230                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          110700      
002231                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          110800      
002232                      W77-ERROR-BASE  > 0             OR          110900      
002233                      W77-RESULT-S151 > 0                         111000      
002234           ELSE                                                   111100      
002235              NEXT SENTENCE                                       111200      
002236        ELSE                                                      111300      
002237           PERFORM 05-0110-PRDMON                                 111400      
002238                   UNTIL W77-IND = 100       OR                   111500      
002239                         W77-ERROR-BASE  > 0 OR                   111600      
002240                         W77-RESULT-S151 > 0                      111700      
002241           IF W77-IND = 100                                       111800      
002242              PERFORM 05-0110-PRDMON                              111900      
002243                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          112000      
002244                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          112100      
002245                      W77-ERROR-BASE  > 0             OR          112200      
002246                      W77-RESULT-S151 > 0.                        112300      
002247                                                                  112400      
002248     EXIT PROGRAM.                                                112500      
002249                                                                  112600      
002250 05-0105-FIND-FIRST.                                              112700      
002251*==================                                               112800      
002252     IF WKS-L40-CVETRACON = 0 AND                                 112900      
002253        WKS-L40-ESQCONCON = 0                                     113000      
002254        PERFORM 05-0150-FF-PRDMON                                 113100      
002255     ELSE                                                         113200      
002256        PERFORM 05-0155-FF-CONT.                                  113300      
002257                                                                  113400      
002258 05-0110-PRDMON.                                                  113500      
002259*===================                                              113600      
002260     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON.            113700      
002261     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        113800      
002262     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          113900      
002263     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          114000      
002264     MOVE B50-MOV-BANCOS           TO WKS-BANCOS     .            114100      
002265     MOVE WKS-BORICON              TO WKS-BORICON-6D .            114120      
002266     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            114140      
002267     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            114160      
002268                                                                  114180      
002269*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON.           114200      
002270     IF WKS-L40-FUN-L040 = 5                                      114300      
002271        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        114400      
002272           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     114500      
002273                                           WKS-L40-NUMMOV(W77-IND)114600      
002274           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     114700      
002275                                           WKS-L40-IMPMOV(W77-IND)114800      
002276        ELSE                                                      114900      
002277           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     115000      
002278           COMPUTE W77-IND = W77-IND + 1                          115100      
002279           IF W77-IND < 101                                       115200      
002280              PERFORM 05-0115-MUEVE-DATOS                         115300      
002281              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           115400      
002282           ELSE                                                   115500      
002283              NEXT SENTENCE                                       115600      
002284     ELSE                                                         115700      
002285        COMPUTE W77-IND = W77-IND + 1                             115800      
002286        PERFORM 05-0115-MUEVE-DATOS.                              115900      
002287                                                                  116000      
002288     PERFORM 05-0160-FN-PRDMON.                                   116100      
002289                                                                  116200      
002290 05-0115-MUEVE-DATOS.                                             116300      
002291*====================                                             116400      
002292     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           116500      
002293     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        116600      
002294     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             116700      
002295                                      WKS-L40-PROCESO(W77-IND).   116800      
002296     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              116900      
002297                                      WKS-L40-MONEDA(W77-IND).    117000      
002298     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           117100      
002299                                      WKS-L40-CVETRA(W77-IND).    117200      
002300     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           117300      
002301                                      WKS-L40-ESQCON(W77-IND).    117400      
002302     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    117500      
002303     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    117600      
002304     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  117700      
002305     MOVE WKS-BORICON              TO WKS-BORICON-6D .            117720      
002306     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            117740      
002307     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             117760      
002308                                      WKS-L40-BCOSDET(W77-IND).   117800      
002309*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            117900      
002310*                                      WKS-L40-BCODES(W77-IND).   118000      
002311                                                                  118100      
002312 05-0150-FF-PRDMON.                                               118200      
002313*===================                                              118300      
002314     FIND FIRST B50SXTOTXCVE AT                                   118400      
002315                B50-MOV-FEC     = WKS-L40-FECHA       AND         118500      
002316                B50-MOV-PROCESO > 0                   AND         118600      
002317                B50-MOV-PRD     = WKS-L40-PRODUCTO    AND         118700      
002318                B50-MOV-INS     > 0                   AND         118800      
002319                B50-MOV-BANCOS  = WKS-BANCOS          AND         118900      
002320*                B50-MOV-BCODES  = WKS-L40-BDESCON     AND        119000      
002321                B50-MOV-MONEDA  = WKS-L40-MONCON                  119100      
002322             ON EXCEPTION                                         119200      
002323                MOVE 1             TO W77-ERROR-BASE              119300      
002324                IF DMSTATUS(NOTFOUND)                             119400      
002325                   MOVE 4          TO W77-RESULT-S151             119500      
002326                ELSE                                              119600      
002327                   MOVE 9          TO W77-RESULT-S151             119700      
002328                   PERFORM 900000-CHE-STA.                        119800      
002329 05-0155-FF-CONT.                                                 119900      
002330*================                                                 120000      
002331     FIND FIRST B50SXTOTXCVE AT                                   120100      
002332          B50-MOV-FEC        = WKS-L40-FECHA    AND               120200      
002333          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               120300      
002334          B50-MOV-BANCOS  = WKS-BANCOS          AND               120400      
002335*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              120500      
002336          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               120600      
002337          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               120700      
002338          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               120800      
002339          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               120900      
002340          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     121000      
002341       ON EXCEPTION                                               121100      
002342       MOVE ZERO                   TO W77-CVETRA-ANT              121200      
002343       IF DMSTATUS(NOTFOUND)                                      121300      
002344          FIND FIRST B50SXTOTXCVE AT                              121400      
002345               B50-MOV-FEC     = WKS-L40-FECHA       AND          121500      
002346               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          121600      
002347               B50-MOV-BANCOS  = WKS-BANCOS          AND          121700      
002348*               B50-MOV-BCODES  = WKS-L40-BDESCON     AND         121800      
002349               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          121900      
002350               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          122000      
002351               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          122100      
002352               B50-MOV-CVETRA  > WKS-L40-CVETRACON                122200      
002353            ON EXCEPTION                                          122300      
002354            IF DMSTATUS(NOTFOUND)                                 122400      
002355               FIND FIRST B50SXTOTXCVE AT                         122500      
002356                    B50-MOV-FEC     = WKS-L40-FECHA       AND     122600      
002357                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     122700      
002358                    B50-MOV-BANCOS  = WKS-BANCOS          AND     122800      
002359*                    B50-MOV-BCODES  = WKS-L40-BDESCON     AND    122900      
002360                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     123000      
002361                    B50-MOV-INS     > WKS-L40-INSTRUMENTO AND     123100      
002362                    B50-MOV-MONEDA  = WKS-L40-MONCON              123200      
002363                 ON EXCEPTION                                     123300      
002364                IF DMSTATUS(NOTFOUND)                             123400      
002365                   FIND FIRST B50SXTOTXCVE AT                     123500      
002366                        B50-MOV-FEC     = WKS-L40-FECHA       AND 123600      
002367                        B50-MOV-BANCOS  = WKS-BANCOS          AND 123700      
002368*                        B50-MOV-BCODES  = WKS-L40-BDESCON     AND123800      
002369                        B50-MOV-PROCESO > WKS-L40-PROCCON         123900      
002370                     ON EXCEPTION                                 124000      
002371                     MOVE 1        TO W77-ERROR-BASE              124100      
002372                     IF DMSTATUS(NOTFOUND)                        124200      
002373                        MOVE 99    TO W77-RESULT-S151             124300      
002374                     ELSE                                         124400      
002375                        MOVE 9     TO W77-RESULT-S151             124500      
002376                        PERFORM 900000-CHE-STA                    124600      
002377                ELSE                                              124700      
002378                   MOVE 9          TO W77-RESULT-S151             124800      
002379                   PERFORM 900000-CHE-STA                         124900      
002380            ELSE                                                  125000      
002381               MOVE 9     TO W77-RESULT-S151                      125100      
002382               PERFORM 900000-CHE-STA                             125200      
002383       ELSE                                                       125300      
002384          MOVE 9     TO W77-RESULT-S151                           125400      
002385          PERFORM 900000-CHE-STA.                                 125500      
002386                                                                  125600      
002387 05-0160-FN-PRDMON.                                               125700      
002388*===================                                              125800      
002389     FIND NEXT B50SXTOTXCVE AT                                    125900      
002390          B50-MOV-FEC        = WKS-L40-FECHA    AND               126000      
002391          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               126100      
002392          B50-MOV-BANCOS  = WKS-BANCOS          AND               126200      
002393*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              126300      
002394          B50-MOV-MONEDA  = WKS-L40-MONCON                        126400      
002395       ON EXCEPTION                                               126500      
002396       IF DMSTATUS(NOTFOUND)                                      126600      
002397          FIND FIRST B50SXTOTXCVE AT                              126700      
002398               B50-MOV-FEC        = WKS-L40-FECHA    AND          126800      
002399               B50-MOV-PROCESO > WKS-L40-PROCCON     AND          126900      
002400               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          127000      
002401               B50-MOV-BANCOS  = WKS-BANCOS          AND          127100      
002402*               B50-MOV-BCODES  = WKS-L40-BDESCON     AND         127200      
002403               B50-MOV-MONEDA  = WKS-L40-MONCON                   127300      
002404            ON EXCEPTION                                          127400      
002405            IF DMSTATUS(NOTFOUND)                                 127500      
002406               MOVE 99             TO W77-RESULT-S151             127600      
002407            ELSE                                                  127700      
002408               MOVE 9              TO W77-RESULT-S151             127800      
002409               PERFORM 900000-CHE-STA                             127900      
002410               MOVE 1              TO W77-ERROR-BASE              128000      
002411       ELSE                                                       128100      
002412          MOVE 1                   TO W77-ERROR-BASE              128200      
002413          MOVE 9                   TO W77-RESULT-S151             128300      
002414          PERFORM 900000-CHE-STA.                                 128400      
002415                                                                  128500      
002416*=================================================================128600      
002417*  CONSULTA DE TOTALES POR SISTEMA-PRODUCTO-INSTRUMENTO-MONEDA   =128700      
002418*=================================================================128800      
002419                                                                  128900      
002420 06-0100-PRD-INS-MON.                                             129000      
002421*================                                                 129100      
002422     PERFORM 06-0105-FIND-FIRST                                   129200      
002423     IF W77-ERROR-BASE = 0                                        129300      
002424        MOVE B50-MOV-PROCESO    TO WKS-L40-PROCCON                129400      
002425        MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON              129500      
002426        MOVE B50-MOV-CVETRA     TO WKS-L40-CVETRACON              129600      
002427        MOVE B50-MOV-BANCOS     TO WKS-BANCOS                     129700      
002428        MOVE WKS-BORICON              TO WKS-BORICON-6D .         129720      
002429        MOVE WKS-BDESCON              TO WKS-BDESCON-6D .         129740      
002430        MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.         129760      
002431*        MOVE B50-MOV-BCODES     TO WKS-L40-BDESCON               129800      
002432        IF WKS-L40-FUN-L040 = 6                                   129900      
002433           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 130000      
002434           MOVE 1               TO W77-IND                        130100      
002435           PERFORM 06-0115-MUEVE-DATOS                            130200      
002436           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        130300      
002437                                   WKS-L40-IMPMOV(W77-IND)        130400      
002438           PERFORM 06-0110-PRDINS-MON                             130500      
002439                   UNTIL W77-IND = 100       OR                   130600      
002440                         W77-ERROR-BASE  > 0 OR                   130700      
002441                          W77-RESULT-S151 > 0                     130800      
002442           IF W77-IND = 100                                       130900      
002443              PERFORM 06-0110-PRDINS-MON                          131000      
002444                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          131100      
002445                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          131200      
002446                      W77-ERROR-BASE  > 0             OR          131300      
002447                      W77-RESULT-S151 > 0                         131400      
002448           ELSE                                                   131500      
002449              NEXT SENTENCE                                       131600      
002450        ELSE                                                      131700      
002451           PERFORM 06-0110-PRDINS-MON                             131800      
002452                   UNTIL W77-IND = 100       OR                   131900      
002453                         W77-ERROR-BASE  > 0 OR                   132000      
002454                         W77-RESULT-S151 > 0                      132100      
002455           IF W77-IND = 100                                       132200      
002456              PERFORM 06-0110-PRDINS-MON                          132300      
002457                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          132400      
002458                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          132500      
002459                      W77-ERROR-BASE  > 0             OR          132600      
002460                      W77-RESULT-S151 > 0.                        132700      
002461                                                                  132800      
002462     EXIT PROGRAM.                                                132900      
002463                                                                  133000      
002464 06-0105-FIND-FIRST.                                              133100      
002465*====================                                             133200      
002466     IF WKS-L40-CVETRACON = 0 AND                                 133300      
002467        WKS-L40-ESQCONCON = 0                                     133400      
002468        PERFORM 06-0150-FF-PRDINS-INI                             133500      
002469     ELSE                                                         133600      
002470        PERFORM 06-0155-FF-PRDINS-CON.                            133700      
002471                                                                  133800      
002472 06-0110-PRDINS-MON.                                              133900      
002473*===================                                              134000      
002474     MOVE B50-MOV-PROCESO    TO WKS-L40-PROCCON.                  134100      
002475     MOVE B50-MOV-CVETRA     TO WKS-L40-CVETRACON.                134200      
002476     MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON.                134300      
002477     MOVE B50-MOV-BANCOS     TO WKS-BANCOS     .                  134400      
002478     MOVE WKS-BORICON              TO WKS-BORICON-6D .            134420      
002479     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            134440      
002480     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            134460      
002481*     MOVE B50-MOV-BCODES     TO WKS-L40-BDESCON.                 134500      
002482     IF WKS-L40-FUN-L040 = 6                                      134600      
002483        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        134700      
002484           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     134800      
002485                                           WKS-L40-NUMMOV(W77-IND)134900      
002486           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     135000      
002487                                           WKS-L40-IMPMOV(W77-IND)135100      
002488        ELSE                                                      135200      
002489           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     135300      
002490           COMPUTE W77-IND = W77-IND + 1                          135400      
002491           IF W77-IND < 101                                       135500      
002492              PERFORM 06-0115-MUEVE-DATOS                         135600      
002493              MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT              135700      
002494           ELSE                                                   135800      
002495              NEXT SENTENCE                                       135900      
002496     ELSE                                                         136000      
002497        COMPUTE W77-IND = W77-IND + 1                             136100      
002498        PERFORM 06-0115-MUEVE-DATOS.                              136200      
002499                                                                  136300      
002500     PERFORM 06-0160-FN-PRDINS-CON.                               136400      
002501                                                                  136500      
002502 06-0115-MUEVE-DATOS.                                             136600      
002503*====================                                             136700      
002504     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           136800      
002505     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        136900      
002506     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             137000      
002507                                      WKS-L40-PROCESO(W77-IND).   137100      
002508     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              137200      
002509                                      WKS-L40-MONEDA(W77-IND).    137300      
002510     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           137400      
002511                                      WKS-L40-CVETRA(W77-IND).    137500      
002512     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           137600      
002513                                      WKS-L40-ESQCON(W77-IND).    137700      
002514     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    137800      
002515     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    137900      
002516     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  138000      
002517     MOVE WKS-BORICON              TO WKS-BORICON-6D .            138020      
002518     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            138040      
002519     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             138060      
002520                                      WKS-L40-BCOSDET(W77-IND).   138100      
002521*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            138200      
002522*                                      WKS-L40-BCODES(W77-IND).   138300      
002523 06-0150-FF-PRDINS-INI.                                           138400      
002524*===================                                              138500      
002525     FIND FIRST B50SXTOTXCVE AT                                   138600      
002526          B50-MOV-FEC       = WKS-L40-FECHA       AND             138700      
002527          B50-MOV-PROCESO   > 0                   AND             138800      
002528          B50-MOV-PRD       = WKS-L40-PRODUCTO    AND             138900      
002529          B50-MOV-INS       = WKS-L40-INSTRUMENTO AND             139000      
002530          B50-MOV-MONEDA    = WKS-L40-MONCON      AND             139100      
002531          B50-MOV-BANCOS    = WKS-BANCOS          AND             139200      
002532*          B50-MOV-BCODES    = WKS-L40-BDESCON     AND            139300      
002533          B50-MOV-CVETRA    > 0                                   139400      
002534       ON EXCEPTION                                               139500      
002535          MOVE 1             TO W77-ERROR-BASE                    139600      
002536          IF DMSTATUS(NOTFOUND)                                   139700      
002537             MOVE 5          TO W77-RESULT-S151                   139800      
002538          ELSE                                                    139900      
002539             MOVE 9          TO W77-RESULT-S151                   140000      
002540             PERFORM 900000-CHE-STA.                              140100      
002541 06-0155-FF-PRDINS-CON.                                           140200      
002542*===================                                              140300      
002543     FIND FIRST B50SXTOTXCVE AT                                   140400      
002544       B50-MOV-FEC        = WKS-L40-FECHA       AND               140500      
002545       B50-MOV-PROCESO    = WKS-L40-PROCCON     AND               140600      
002546       B50-MOV-BANCOS     = WKS-BANCOS          AND               140700      
002547*       B50-MOV-BCODES     = WKS-L40-BDESCON     AND              140800      
002548       B50-MOV-PRD        = WKS-L40-PRODUCTO    AND               140900      
002549       B50-MOV-INS        = WKS-L40-INSTRUMENTO AND               141000      
002550       B50-MOV-MONEDA     = WKS-L40-MONCON      AND               141100      
002551       B50-MOV-CVETRA     > WKS-L40-CVETRACON                     141200      
002552    ON EXCEPTION                                                  141300      
002553      IF DMSTATUS(NOTFOUND)                                       141400      
002554         FIND FIRST B50SXTOTXCVE AT                               141500      
002555          B50-MOV-FEC     = WKS-L40-FECHA       AND               141600      
002556          B50-MOV-PROCESO > WKS-L40-PROCCON     AND               141700      
002557          B50-MOV-BANCOS  = WKS-BANCOS          AND               141800      
002558*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              141900      
002559          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               142000      
002560          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               142100      
002561          B50-MOV-MONEDA  = WKS-L40-MONCON                        142200      
002562       ON EXCEPTION                                               142300      
002563          MOVE 1                  TO W77-ERROR-BASE               142400      
002564          IF DMSTATUS(NOTFOUND)                                   142500      
002565             MOVE 99              TO W77-RESULT-S151              142600      
002566          ELSE                                                    142700      
002567             MOVE 9               TO W77-RESULT-S151              142800      
002568             PERFORM 900000-CHE-STA                               142900      
002569      ELSE                                                        143000      
002570         PERFORM 900000-CHE-STA                                   143100      
002571         MOVE 9                   TO W77-RESULT-S151.             143200      
002572 06-0160-FN-PRDINS-CON.                                           143300      
002573*===================                                              143400      
002574     FIND NEXT  B50SXTOTXCVE AT                                   143500      
002575       B50-MOV-FEC        = WKS-L40-FECHA       AND               143600      
002576       B50-MOV-PROCESO    = WKS-L40-PROCCON     AND               143700      
002577       B50-MOV-PRD        = WKS-L40-PRODUCTO    AND               143800      
002578       B50-MOV-INS        = WKS-L40-INSTRUMENTO AND               143900      
002579       B50-MOV-MONEDA     = WKS-L40-MONCON      AND               144000      
002580       B50-MOV-CVETRA     = WKS-L40-CVETRACON   AND               144100      
002581       B50-MOV-BANCOS     = WKS-BANCOS          AND               144200      
002582*       B50-MOV-BCODES     = WKS-L40-BDESCON     AND              144300      
002583       B50-MOV-ESQCON     > WKS-L40-ESQCONCON                     144400      
002584    ON EXCEPTION                                                  144500      
002585    MOVE ZERO                      TO W77-CVETRA-ANT              144600      
002586    IF DMSTATUS(NOTFOUND)                                         144700      
002587       FIND FIRST B50SXTOTXCVE AT                                 144800      
002588         B50-MOV-FEC        = WKS-L40-FECHA    AND                144900      
002589         B50-MOV-PROCESO = WKS-L40-PROCCON     AND                145000      
002590         B50-MOV-PRD     = WKS-L40-PRODUCTO    AND                145100      
002591         B50-MOV-INS     = WKS-L40-INSTRUMENTO AND                145200      
002592         B50-MOV-MONEDA  = WKS-L40-MONCON      AND                145300      
002593         B50-MOV-BANCOS  = WKS-BANCOS          AND                145400      
002594*         B50-MOV-BCODES  = WKS-L40-BDESCON     AND               145500      
002595         B50-MOV-CVETRA  > WKS-L40-CVETRACON                      145600      
002596      ON EXCEPTION                                                145700      
002597      IF DMSTATUS(NOTFOUND)                                       145800      
002598         FIND FIRST B50SXTOTXCVE AT                               145900      
002599           B50-MOV-FEC        = WKS-L40-FECHA       AND           146000      
002600           B50-MOV-PROCESO    > WKS-L40-PROCCON     AND           146100      
002601           B50-MOV-PRD        = WKS-L40-PRODUCTO    AND           146200      
002602           B50-MOV-INS        = WKS-L40-INSTRUMENTO AND           146300      
002603           B50-MOV-BANCOS     = WKS-BANCOS          AND           146400      
002604*           B50-MOV-BCODES     = WKS-L40-BDESCON     AND          146500      
002605           B50-MOV-MONEDA     = WKS-L40-MONCON                    146600      
002606        ON EXCEPTION                                              146700      
002607           MOVE 1                  TO W77-ERROR-BASE              146800      
002608           IF DMSTATUS(NOTFOUND)                                  146900      
002609              MOVE 99              TO W77-RESULT-S151             147000      
002610           ELSE                                                   147100      
002611              MOVE 9               TO W77-RESULT-S151             147200      
002612              PERFORM 900000-CHE-STA                              147300      
002613      ELSE                                                        147400      
002614         MOVE 9                   TO W77-RESULT-S151              147500      
002615         PERFORM 900000-CHE-STA                                   147600      
002616    ELSE                                                          147700      
002617       PERFORM 900000-CHE-STA                                     147800      
002618       MOVE 9                      TO W77-RESULT-S151.            147900      
002619                                                                  148000      
002620                                                                  148100      
002621 03-SECCION SECTION.                                              148200      
002622*==========================================================       148300      
002623*  CONSULTA DE TOTALES POR SISTEMA-PROCESO                =       148400      
002624*==========================================================       148500      
002625                                                                  148600      
002626 07-0100-PRO.                                                     148700      
002627*============                                                     148800      
002628     PERFORM 07-0105-FIND-FIRST                                   148900      
002629     IF W77-ERROR-BASE = 0                                        149000      
002630        IF WKS-L40-FUN-L040 = 7                                   149100      
002631           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 149200      
002632           MOVE 1               TO W77-IND                        149300      
002633           PERFORM 07-0115-MUEVE-DATOS                            149400      
002634           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        149500      
002635                                   WKS-L40-IMPMOV(W77-IND)        149600      
002636           PERFORM 07-0110-PROCESO                                149700      
002637                   UNTIL W77-IND = 100       OR                   149800      
002638                         W77-ERROR-BASE  > 0 OR                   149900      
002639                         W77-RESULT-S151 > 0                      150000      
002640           IF W77-IND = 100                                       150100      
002641              PERFORM 07-0110-PROCESO                             150200      
002642                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          150300      
002643                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          150400      
002644                      W77-ERROR-BASE  > 0             OR          150500      
002645                      W77-RESULT-S151 > 0                         150600      
002646           ELSE                                                   150700      
002647              NEXT SENTENCE                                       150800      
002648     ELSE                                                         150900      
002649        PERFORM 07-0110-PROCESO                                   151000      
002650                UNTIL W77-IND = 100       OR                      151100      
002651                      W77-ERROR-BASE  > 0 OR                      151200      
002652                      W77-RESULT-S151 > 0                         151300      
002653        IF W77-IND = 100                                          151400      
002654           PERFORM 07-0110-PROCESO                                151500      
002655             UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR             151600      
002656                   B50-MOV-CVETRA < W77-CVETRA-ANT OR             151700      
002657                   W77-ERROR-BASE  > 0             OR             151800      
002658                   W77-RESULT-S151 > 0.                           151900      
002659                                                                  152000      
002660     EXIT PROGRAM.                                                152100      
002661                                                                  152200      
002662 07-0105-FIND-FIRST.                                              152300      
002663*===================                                              152400      
002664     IF WKS-L40-CVETRACON = 0 AND                                 152500      
002665        WKS-L40-ESQCONCON = 0                                     152600      
002666        PERFORM 07-0150-FF-PROCESO                                152700      
002667     ELSE                                                         152800      
002668        PERFORM 07-0155-FF-CONT.                                  152900      
002669                                                                  153000      
002670 07-0110-PROCESO.                                                 153100      
002671*================                                                 153200      
002672     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           153300      
002673     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        153400      
002674     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             153500      
002675     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          153600      
002676     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          153700      
002677     IF WKS-L40-FUN-L040 = 7                                      153800      
002678        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        153900      
002679           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     154000      
002680                                           WKS-L40-NUMMOV(W77-IND)154100      
002681           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     154200      
002682                                           WKS-L40-IMPMOV(W77-IND)154300      
002683        ELSE                                                      154400      
002684           MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON           154500      
002685           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     154600      
002686           COMPUTE W77-IND = W77-IND + 1                          154700      
002687           IF W77-IND < 101                                       154800      
002688              PERFORM 07-0115-MUEVE-DATOS                         154900      
002689              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           155000      
002690           ELSE                                                   155100      
002691              NEXT SENTENCE                                       155200      
002692     ELSE                                                         155300      
002693        COMPUTE W77-IND = W77-IND + 1                             155400      
002694        PERFORM 07-0115-MUEVE-DATOS.                              155500      
002695                                                                  155600      
002696     PERFORM 07-0160-FN-PROCESO.                                  155700      
002697                                                                  155800      
002698 07-0115-MUEVE-DATOS.                                             155900      
002699*====================                                             156000      
002700     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           156100      
002701     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        156200      
002702     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             156300      
002703                                      WKS-L40-PROCESO(W77-IND).   156400      
002704     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              156500      
002705                                      WKS-L40-MONEDA(W77-IND).    156600      
002706     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           156700      
002707                                      WKS-L40-CVETRA(W77-IND).    156800      
002708     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           156900      
002709                                      WKS-L40-ESQCON(W77-IND).    157000      
002710     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    157100      
002711     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    157200      
002712     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  157300      
002713     MOVE WKS-BORICON              TO WKS-BORICON-6D .            157320      
002714     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            157340      
002715     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             157360      
002716                                      WKS-L40-BCOSDET(W77-IND).   157400      
002717*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            157500      
002718*                                      WKS-L40-BCODES(W77-IND).   157600      
002719                                                                  157700      
002720 07-0150-FF-PROCESO.                                              157800      
002721*===================                                              157900      
002722     FIND FIRST B50SXTOTXCVE AT                                   158000      
002723                B50-MOV-FEC        = WKS-L40-FECHA    AND         158100      
002724                B50-MOV-PROCESO    = WKS-L40-PROCCON              158200      
002725             ON EXCEPTION                                         158300      
002726                MOVE 1             TO W77-ERROR-BASE              158400      
002727                IF DMSTATUS(NOTFOUND)                             158500      
002728                   MOVE 3          TO W77-RESULT-S151             158600      
002729                ELSE                                              158700      
002730                   MOVE 9          TO W77-RESULT-S151             158800      
002731                   PERFORM 900000-CHE-STA.                        158900      
002732 07-0155-FF-CONT.                                                 159000      
002733*================                                                 159100      
002734     FIND FIRST B50SXTOTXCVE AT                                   159200      
002735          B50-MOV-FEC     = WKS-L40-FECHA       AND               159300      
002736          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               159400      
002737          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               159500      
002738          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               159600      
002739          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               159700      
002740          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               159800      
002741          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     159900      
002742       ON EXCEPTION                                               160000      
002743       MOVE ZERO                   TO W77-CVETRA-ANT              160100      
002744       IF DMSTATUS(NOTFOUND)                                      160200      
002745          FIND FIRST B50SXTOTXCVE AT                              160300      
002746               B50-MOV-FEC     = WKS-L40-FECHA       AND          160400      
002747               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          160500      
002748               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          160600      
002749               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          160700      
002750               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          160800      
002751               B50-MOV-CVETRA  > WKS-L40-CVETRACON                160900      
002752            ON EXCEPTION                                          161000      
002753            IF DMSTATUS(NOTFOUND)                                 161100      
002754               FIND FIRST B50SXTOTXCVE AT                         161200      
002755                B50-MOV-FEC        = WKS-L40-FECHA    AND         161300      
002756                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     161400      
002757                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     161500      
002758                    B50-MOV-INS     = WKS-L40-INSTRUMENTO AND     161600      
002759                    B50-MOV-MONEDA  > WKS-L40-MONCON              161700      
002760                 ON EXCEPTION                                     161800      
002761                 IF DMSTATUS(NOTFOUND)                            161900      
002762                    FIND FIRST B50SXTOTXCVE AT                    162000      
002763                         B50-MOV-FEC     = WKS-L40-FECHA      AND 162100      
002764                         B50-MOV-PROCESO = WKS-L40-PROCCON     AND162200      
002765                         B50-MOV-PRD     = WKS-L40-PRODUCTO    AND162300      
002766                         B50-MOV-INS     > WKS-L40-INSTRUMENTO    162400      
002767                      ON EXCEPTION                                162500      
002768                      IF DMSTATUS(NOTFOUND)                       162600      
002769                         FIND FIRST B50SXTOTXCVE AT               162700      
002770                            B50-MOV-FEC    = WKS-L40-FECHA    AND 162800      
002771                            B50-MOV-PROCESO = WKS-L40-PROCCON  AND162900      
002772                            B50-MOV-PRD     > WKS-L40-PRODUCTO    163000      
002773                         ON EXCEPTION                             163100      
002774                         MOVE 1     TO W77-ERROR-BASE             163200      
002775                         IF DMSTATUS(NOTFOUND)                    163300      
002776                            MOVE 99 TO W77-RESULT-S151            163400      
002777                         ELSE                                     163500      
002778                            MOVE 9  TO W77-RESULT-S151            163600      
002779                            PERFORM 900000-CHE-STA                163700      
002780                      ELSE                                        163800      
002781                         MOVE 9  TO W77-RESULT-S151               163900      
002782                         PERFORM 900000-CHE-STA                   164000      
002783                 ELSE                                             164100      
002784                    MOVE 9  TO W77-RESULT-S151                    164200      
002785                    PERFORM 900000-CHE-STA                        164300      
002786            ELSE                                                  164400      
002787               MOVE 9  TO W77-RESULT-S151                         164500      
002788               PERFORM 900000-CHE-STA                             164600      
002789       ELSE                                                       164700      
002790          MOVE 9  TO W77-RESULT-S151                              164800      
002791          PERFORM 900000-CHE-STA.                                 164900      
002792                                                                  165000      
002793 07-0160-FN-PROCESO.                                              165100      
002794*===================                                              165200      
002795     FIND NEXT B50SXTOTXCVE AT                                    165300      
002796               B50-MOV-FEC           = WKS-L40-FECHA    AND       165400      
002797               B50-MOV-PROCESO       = WKS-L40-PROCCON            165500      
002798            ON EXCEPTION                                          165600      
002799               MOVE 1             TO W77-ERROR-BASE               165700      
002800                IF DMSTATUS(NOTFOUND)                             165800      
002801                   MOVE 99         TO W77-RESULT-S151             165900      
002802                ELSE                                              166000      
002803                   MOVE 9          TO W77-RESULT-S151             166100      
002804                   PERFORM 900000-CHE-STA.                        166200      
002805                                                                  166300      
002806*==========================================================       166400      
002807*  CONSULTA DE TOTALES POR SISTEMA-PROCESO-PRODUCTO       =       166500      
002808*==========================================================       166600      
002809                                                                  166700      
002810 08-0100-PRO-PRD.                                                 166800      
002811*================                                                 166900      
002812     PERFORM 08-0105-FIND-FIRST                                   167000      
002813     IF W77-ERROR-BASE = 0                                        167100      
002814        IF WKS-L40-FUN-L040 = 8                                   167200      
002815           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 167300      
002816           MOVE 1               TO W77-IND                        167400      
002817           PERFORM 08-0115-MUEVE-DATOS                            167500      
002818           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        167600      
002819                                   WKS-L40-IMPMOV(W77-IND)        167700      
002820           PERFORM 08-0110-PROCESO-PRD                            167800      
002821                   UNTIL W77-IND = 100       OR                   167900      
002822                         W77-ERROR-BASE  > 0 OR                   168000      
002823                         W77-RESULT-S151 > 0                      168100      
002824           IF W77-IND = 100                                       168200      
002825              PERFORM 08-0110-PROCESO-PRD                         168300      
002826                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          168400      
002827                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          168500      
002828                      W77-ERROR-BASE  > 0             OR          168600      
002829                      W77-RESULT-S151 > 0                         168700      
002830           ELSE                                                   168800      
002831              NEXT SENTENCE                                       168900      
002832        ELSE                                                      169000      
002833           PERFORM 08-0110-PROCESO-PRD                            169100      
002834                   UNTIL W77-IND = 100       OR                   169200      
002835                         W77-ERROR-BASE  > 0 OR                   169300      
002836                         W77-RESULT-S151 > 0                      169400      
002837           IF W77-IND = 100                                       169500      
002838              PERFORM 08-0110-PROCESO-PRD                         169600      
002839                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          169700      
002840                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          169800      
002841                      W77-ERROR-BASE  > 0             OR          169900      
002842                      W77-RESULT-S151 > 0.                        170000      
002843     EXIT PROGRAM.                                                170100      
002844                                                                  170200      
002845 08-0105-FIND-FIRST.                                              170300      
002846*===================                                              170400      
002847     IF WKS-L40-CVETRACON = 0 AND                                 170500      
002848        WKS-L40-ESQCONCON = 0                                     170600      
002849        PERFORM 08-0150-FF-PROCESO-PRD                            170700      
002850     ELSE                                                         170800      
002851        PERFORM 08-0155-FF-CONT.                                  170900      
002852                                                                  171000      
002853 08-0110-PROCESO-PRD.                                             171100      
002854*====================                                             171200      
002855     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        171300      
002856     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             171400      
002857     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          171500      
002858     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          171600      
002859     IF WKS-L40-FUN-L040 = 8                                      171700      
002860        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        171800      
002861           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     171900      
002862                                           WKS-L40-NUMMOV(W77-IND)172000      
002863           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     172100      
002864                                           WKS-L40-IMPMOV(W77-IND)172200      
002865        ELSE                                                      172300      
002866           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     172400      
002867           COMPUTE W77-IND = W77-IND + 1                          172500      
002868           IF W77-IND < 101                                       172600      
002869              PERFORM 08-0115-MUEVE-DATOS                         172700      
002870              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           172800      
002871           ELSE                                                   172900      
002872              NEXT SENTENCE                                       173000      
002873     ELSE                                                         173100      
002874        COMPUTE W77-IND = W77-IND + 1                             173200      
002875        PERFORM 08-0115-MUEVE-DATOS.                              173300      
002876                                                                  173400      
002877     PERFORM 08-0160-FN-PROCESO-PRD.                              173500      
002878                                                                  173600      
002879 08-0115-MUEVE-DATOS.                                             173700      
002880*====================                                             173800      
002881     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           173900      
002882     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        174000      
002883     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             174100      
002884                                      WKS-L40-PROCESO(W77-IND).   174200      
002885     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              174300      
002886                                      WKS-L40-MONEDA(W77-IND).    174400      
002887     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           174500      
002888                                      WKS-L40-CVETRA(W77-IND).    174600      
002889     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           174700      
002890                                      WKS-L40-ESQCON(W77-IND).    174800      
002891     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    174900      
002892     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    175000      
002893     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  175100      
002894     MOVE WKS-BORICON              TO WKS-BORICON-6D .            175120      
002895     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            175140      
002896     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             175160      
002897                                      WKS-L40-BCOSDET(W77-IND).   175200      
002898*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            175300      
002899*                                      WKS-L40-BCODES(W77-IND).   175400      
002900                                                                  175500      
002901 08-0150-FF-PROCESO-PRD.                                          175600      
002902*===================                                              175700      
002903     FIND FIRST B50SXTOTXCVE AT                                   175800      
002904                B50-MOV-FEC      = WKS-L40-FECHA    AND           175900      
002905                B50-MOV-PROCESO  = WKS-L40-PROCCON  AND           176000      
002906                B50-MOV-BANCOS   = WKS-BANCOS       AND           176100      
002907*                B50-MOV-BCODES   = WKS-L40-BDESCON  AND          176200      
002908                B50-MOV-PRD      = WKS-L40-PRODUCTO               176300      
002909             ON EXCEPTION                                         176400      
002910                MOVE 1             TO W77-ERROR-BASE              176500      
002911                IF DMSTATUS(NOTFOUND)                             176600      
002912                   MOVE 4          TO W77-RESULT-S151             176700      
002913                ELSE                                              176800      
002914                   MOVE 9          TO W77-RESULT-S151             176900      
002915                   PERFORM 900000-CHE-STA.                        177000      
002916 08-0155-FF-CONT.                                                 177100      
002917*================                                                 177200      
002918     FIND FIRST B50SXTOTXCVE AT                                   177300      
002919          B50-MOV-FEC        = WKS-L40-FECHA    AND               177400      
002920          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               177500      
002921          B50-MOV-BANCOS  = WKS-BANCOS          AND               177600      
002922*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              177700      
002923          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               177800      
002924          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               177900      
002925          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               178000      
002926          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               178100      
002927          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     178200      
002928       ON EXCEPTION                                               178300      
002929       MOVE ZERO                   TO W77-CVETRA-ANT              178400      
002930       IF DMSTATUS(NOTFOUND)                                      178500      
002931          FIND FIRST B50SXTOTXCVE AT                              178600      
002932               B50-MOV-FEC     = WKS-L40-FECHA       AND          178700      
002933               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          178800      
002934               B50-MOV-BANCOS  = WKS-BANCOS          AND          178900      
002935*               B50-MOV-BCODES  = WKS-L40-BDESCON     AND         179000      
002936               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          179100      
002937               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          179200      
002938               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          179300      
002939               B50-MOV-CVETRA  > WKS-L40-CVETRACON                179400      
002940            ON EXCEPTION                                          179500      
002941            IF DMSTATUS(NOTFOUND)                                 179600      
002942               FIND FIRST B50SXTOTXCVE AT                         179700      
002943                    B50-MOV-FEC     = WKS-L40-FECHA       AND     179800      
002944                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     179900      
002945                    B50-MOV-BANCOS  = WKS-BANCOS          AND     180000      
002946*                    B50-MOV-BCODES  = WKS-L40-BDESCON     AND    180100      
002947                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     180200      
002948                    B50-MOV-INS     = WKS-L40-INSTRUMENTO AND     180300      
002949                    B50-MOV-MONEDA  > WKS-L40-MONCON              180400      
002950                 ON EXCEPTION                                     180500      
002951                 IF DMSTATUS(NOTFOUND)                            180600      
002952                    FIND FIRST B50SXTOTXCVE AT                    180700      
002953                        B50-MOV-FEC      = WKS-L40-FECHA      AND 180800      
002954                        B50-MOV-PROCESO = WKS-L40-PROCCON     AND 180900      
002955                        B50-MOV-BANCOS  = WKS-BANCOS          AND 181000      
002956*                        B50-MOV-BCODES  = WKS-L40-BDESCON     AND181100      
002957                        B50-MOV-PRD     = WKS-L40-PRODUCTO    AND 181200      
002958                        B50-MOV-INS     > WKS-L40-INSTRUMENTO     181300      
002959                      ON EXCEPTION                                181400      
002960                      IF DMSTATUS(NOTFOUND)                       181500      
002961                         MOVE 99   TO W77-RESULT-S151             181600      
002962                      ELSE                                        181700      
002963                         MOVE 9    TO W77-RESULT-S151             181800      
002964                         PERFORM 900000-CHE-STA                   181900      
002965                 ELSE                                             182000      
002966                    MOVE 9    TO W77-RESULT-S151                  182100      
002967                    PERFORM 900000-CHE-STA                        182200      
002968            ELSE                                                  182300      
002969               MOVE 9    TO W77-RESULT-S151                       182400      
002970               PERFORM 900000-CHE-STA                             182500      
002971       ELSE                                                       182600      
002972          MOVE 9    TO W77-RESULT-S151                            182700      
002973          PERFORM 900000-CHE-STA.                                 182800      
002974                                                                  182900      
002975 08-0160-FN-PROCESO-PRD.                                          183000      
002976*=======================                                          183100      
002977     FIND NEXT B50SXTOTXCVE AT                                    183200      
002978          B50-MOV-FEC        = WKS-L40-FECHA    AND               183300      
002979          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               183400      
002980          B50-MOV-BANCOS  = WKS-BANCOS          AND               183500      
002981*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              183600      
002982          B50-MOV-PRD     = WKS-L40-PRODUCTO                      183700      
002983       ON EXCEPTION                                               183800      
002984          IF DMSTATUS(NOTFOUND)                                   183900      
002985             MOVE 99   TO W77-RESULT-S151                         184000      
002986          ELSE                                                    184100      
002987             MOVE 9    TO W77-RESULT-S151                         184200      
002988             PERFORM 900000-CHE-STA.                              184300      
002989*==========================================================       184400      
002990*  CONSULTA DE TOTALES POR SISTEMA-PROC-PROD-INS          =       184500      
002991*==========================================================       184600      
002992                                                                  184700      
002993 09-0100-PRO-PRD-INS.                                             184800      
002994*===================                                              184900      
002995     PERFORM 09-0105-FIND-FIRST                                   185000      
002996     IF W77-ERROR-BASE = 0                                        185100      
002997        IF WKS-L40-FUN-L040 = 9                                   185200      
002998           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 185300      
002999           MOVE 1               TO W77-IND                        185400      
003000           PERFORM 09-0115-MUEVE-DATOS                            185500      
003001           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        185600      
003002                                   WKS-L40-IMPMOV(W77-IND)        185700      
003003           PERFORM 09-0110-PROPRD-INS                             185800      
003004                   UNTIL W77-IND = 100       OR                   185900      
003005                         W77-ERROR-BASE  > 0 OR                   186000      
003006                         W77-RESULT-S151 > 0                      186100      
003007           IF W77-IND = 100                                       186200      
003008              PERFORM 09-0110-PROPRD-INS                          186300      
003009                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          186400      
003010                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          186500      
003011                      W77-ERROR-BASE  > 0             OR          186600      
003012                      W77-RESULT-S151 > 0                         186700      
003013           ELSE                                                   186800      
003014              NEXT SENTENCE                                       186900      
003015        ELSE                                                      187000      
003016           PERFORM 09-0110-PROPRD-INS                             187100      
003017                   UNTIL W77-IND = 100       OR                   187200      
003018                         W77-ERROR-BASE  > 0 OR                   187300      
003019                         W77-RESULT-S151 > 0                      187400      
003020           IF W77-IND = 100                                       187500      
003021              PERFORM 09-0110-PROPRD-INS                          187600      
003022                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          187700      
003023                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          187800      
003024                      W77-ERROR-BASE  > 0             OR          187900      
003025                      W77-RESULT-S151 > 0.                        188000      
003026                                                                  188100      
003027     EXIT PROGRAM.                                                188200      
003028 09-0105-FIND-FIRST.                                              188300      
003029*===================                                              188400      
003030     IF WKS-L40-CVETRACON = 0 AND                                 188500      
003031        WKS-L40-ESQCONCON = 0                                     188600      
003032        PERFORM 09-0150-FF-PROPRD-INS                             188700      
003033     ELSE                                                         188800      
003034        PERFORM 09-0155-FF-CONT.                                  188900      
003035                                                                  189000      
003036 09-0110-PROPRD-INS.                                              189100      
003037*===================                                              189200      
003038     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             189300      
003039     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          189400      
003040     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          189500      
003041     IF WKS-L40-FUN-L040 = 9                                      189600      
003042        IF W77-CVETRA-ANT = B50-MOV-CVETRA                        189700      
003043           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     189800      
003044                                           WKS-L40-NUMMOV(W77-IND)189900      
003045           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     190000      
003046                                           WKS-L40-IMPMOV(W77-IND)190100      
003047        ELSE                                                      190200      
003048           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     190300      
003049           COMPUTE W77-IND = W77-IND + 1                          190400      
003050           IF W77-IND < 101                                       190500      
003051              PERFORM 09-0115-MUEVE-DATOS                         190600      
003052              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           190700      
003053           ELSE                                                   190800      
003054              NEXT SENTENCE                                       190900      
003055     ELSE                                                         191000      
003056        COMPUTE W77-IND = W77-IND + 1                             191100      
003057        PERFORM 09-0115-MUEVE-DATOS.                              191200      
003058                                                                  191300      
003059     PERFORM 09-0160-FN-PROPRD-INS.                               191400      
003060                                                                  191500      
003061 09-0115-MUEVE-DATOS.                                             191600      
003062*====================                                             191700      
003063     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           191800      
003064     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        191900      
003065     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             192000      
003066                                      WKS-L40-PROCESO(W77-IND).   192100      
003067     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              192200      
003068                                      WKS-L40-MONEDA(W77-IND).    192300      
003069     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           192400      
003070                                      WKS-L40-CVETRA(W77-IND).    192500      
003071     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           192600      
003072                                      WKS-L40-ESQCON(W77-IND).    192700      
003073     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    192800      
003074     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    192900      
003075     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  193000      
003076     MOVE WKS-BORICON              TO WKS-BORICON-6D .            193020      
003077     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            193040      
003078     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             193060      
003079                                      WKS-L40-BCOSDET(W77-IND).   193100      
003080*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            193200      
003081*                                      WKS-L40-BCODES(W77-IND).   193300      
003082                                                                  193400      
003083 09-0150-FF-PROPRD-INS.                                           193500      
003084*===================                                              193600      
003085     FIND FIRST B50SXTOTXCVE AT                                   193700      
003086                B50-MOV-FEC        = WKS-L40-FECHA       AND      193800      
003087                B50-MOV-PROCESO    = WKS-L40-PROCCON     AND      193900      
003088                B50-MOV-PRD        = WKS-L40-PRODUCTO    AND      194000      
003089                B50-MOV-BANCOS     = WKS-BANCOS          AND      194100      
003090*                B50-MOV-BCODES     = WKS-L40-BDESCON     AND     194200      
003091                B50-MOV-INS        = WKS-L40-INSTRUMENTO          194300      
003092             ON EXCEPTION                                         194400      
003093                MOVE 1             TO W77-ERROR-BASE              194500      
003094                IF DMSTATUS(NOTFOUND)                             194600      
003095                   MOVE 5          TO W77-RESULT-S151             194700      
003096                ELSE                                              194800      
003097                   MOVE 9          TO W77-RESULT-S151             194900      
003098                   PERFORM 900000-CHE-STA.                        195000      
003099 09-0155-FF-CONT.                                                 195100      
003100*================                                                 195200      
003101     FIND FIRST B50SXTOTXCVE AT                                   195300      
003102          B50-MOV-FEC        = WKS-L40-FECHA    AND               195400      
003103          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               195500      
003104          B50-MOV-BANCOS  = WKS-BANCOS          AND               195600      
003105*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              195700      
003106          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               195800      
003107          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               195900      
003108          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               196000      
003109          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               196100      
003110          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     196200      
003111       ON EXCEPTION                                               196300      
003112       MOVE ZERO                   TO W77-CVETRA-ANT              196400      
003113       IF DMSTATUS(NOTFOUND)                                      196500      
003114          FIND FIRST B50SXTOTXCVE AT                              196600      
003115               B50-MOV-FEC     = WKS-L40-FECHA       AND          196700      
003116               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          196800      
003117               B50-MOV-BANCOS  = WKS-BANCOS          AND          196900      
003118*               B50-MOV-BCODES  = WKS-L40-BDESCON     AND         197000      
003119               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          197100      
003120               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          197200      
003121               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          197300      
003122               B50-MOV-CVETRA  > WKS-L40-CVETRACON                197400      
003123             ON EXCEPTION                                         197500      
003124             IF DMSTATUS(NOTFOUND)                                197600      
003125                FIND FIRST B50SXTOTXCVE AT                        197700      
003126                     B50-MOV-FEC     = WKS-L40-FECHA    AND       197800      
003127                     B50-MOV-PROCESO = WKS-L40-PROCCON     AND    197900      
003128                     B50-MOV-BANCOS  = WKS-BANCOS          AND    198000      
003129*                     B50-MOV-BCODES  = WKS-L40-BDESCON     AND   198100      
003130                     B50-MOV-PRD     = WKS-L40-PRODUCTO    AND    198200      
003131                     B50-MOV-INS     = WKS-L40-INSTRUMENTO AND    198300      
003132                     B50-MOV-MONEDA  > WKS-L40-MONCON             198400      
003133                   ON EXCEPTION                                   198500      
003134                   MOVE 1          TO W77-ERROR-BASE              198600      
003135                   IF DMSTATUS(NOTFOUND)                          198700      
003136                      MOVE 99      TO W77-RESULT-S151             198800      
003137                   ELSE                                           198900      
003138                      MOVE 9       TO W77-RESULT-S151             199000      
003139                      PERFORM 900000-CHE-STA                      199100      
003140             ELSE                                                 199200      
003141                MOVE 9       TO W77-RESULT-S151                   199300      
003142                PERFORM 900000-CHE-STA                            199400      
003143       ELSE                                                       199500      
003144          MOVE 9       TO W77-RESULT-S151                         199600      
003145          PERFORM 900000-CHE-STA.                                 199700      
003146                                                                  199800      
003147 09-0160-FN-PROPRD-INS.                                           199900      
003148*======================                                           200000      
003149     FIND NEXT B50SXTOTXCVE AT                                    200100      
003150          B50-MOV-FEC        = WKS-L40-FECHA    AND               200200      
003151          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               200300      
003152          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               200400      
003153          B50-MOV-BANCOS  = WKS-BANCOS          AND               200500      
003154*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              200600      
003155          B50-MOV-INS     = WKS-L40-INSTRUMENTO                   200700      
003156       ON EXCEPTION                                               200800      
003157          FIND FIRST B50SXTOTXCVE AT                              200900      
003158               B50-MOV-FEC        = WKS-L40-FECHA AND             201000      
003159               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          201100      
003160               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          201200      
003161               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          201300      
003162               B50-MOV-MONEDA  > WKS-L40-MONCON                   201400      
003163            ON EXCEPTION                                          201500      
003164               MOVE 1          TO W77-ERROR-BASE                  201600      
003165               IF DMSTATUS(NOTFOUND)                              201700      
003166                  MOVE 99      TO W77-RESULT-S151                 201800      
003167               ELSE                                               201900      
003168                  MOVE 9       TO W77-RESULT-S151                 202000      
003169                  PERFORM 900000-CHE-STA.                         202100      
003170                                                                  202200      
003171 04-SECCION SECTION.                                              202300      
003172                                                                  202400      
003173*==========================================================       202500      
003174*  CONSULTA DE TOTALES POR SISTEMA-PROC-MONEDA            =       202600      
003175*==========================================================       202700      
003176                                                                  202800      
003177 10-0100-PRO-MON.                                                 202900      
003178*===================                                              203000      
003179     PERFORM 10-0105-FIND-FIRST                                   203100      
003180     IF W77-ERROR-BASE = 0                                        203200      
003181        IF WKS-L40-FUN-L040 = 10                                  203300      
003182           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 203400      
003183           MOVE 1               TO W77-IND                        203500      
003184           PERFORM 10-0115-MUEVE-DATOS                            203600      
003185           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        203700      
003186                                   WKS-L40-IMPMOV(W77-IND)        203800      
003187           PERFORM 10-0110-PRO-MON                                203900      
003188                   UNTIL W77-IND = 100       OR                   204000      
003189                         W77-ERROR-BASE  > 0 OR                   204100      
003190                         W77-RESULT-S151 > 0                      204200      
003191           IF W77-IND = 100                                       204300      
003192              PERFORM 10-0110-PRO-MON                             204400      
003193                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          204500      
003194                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          204600      
003195                      W77-ERROR-BASE  > 0             OR          204700      
003196                      W77-RESULT-S151 > 0                         204800      
003197           ELSE                                                   204900      
003198              NEXT SENTENCE                                       205000      
003199        ELSE                                                      205100      
003200           PERFORM 10-0110-PRO-MON                                205200      
003201                   UNTIL W77-IND = 100       OR                   205300      
003202                         W77-ERROR-BASE  > 0 OR                   205400      
003203                         W77-RESULT-S151 > 0                      205500      
003204           IF W77-IND = 100                                       205600      
003205              PERFORM 10-0110-PRO-MON                             205700      
003206                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          205800      
003207                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          205900      
003208                      W77-ERROR-BASE  > 0             OR          206000      
003209                      W77-RESULT-S151 > 0.                        206100      
003210                                                                  206200      
003211     EXIT PROGRAM.                                                206300      
003212                                                                  206400      
003213 10-0105-FIND-FIRST.                                              206500      
003214*===================                                              206600      
003215     IF WKS-L40-CVETRACON = 0 AND                                 206700      
003216        WKS-L40-ESQCONCON = 0                                     206800      
003217        PERFORM 10-0150-FF-PRO-MON                                206900      
003218     ELSE                                                         207000      
003219        PERFORM 10-0155-FF-CONT.                                  207100      
003220                                                                  207200      
003221 10-0110-PRO-MON.                                                 207300      
003222*================                                                 207400      
003223     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           207500      
003224     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        207600      
003225     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          207700      
003226     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          207800      
003227     IF WKS-L40-FUN-L040 = 10                                     207900      
003228        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        208000      
003229           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     208100      
003230                                           WKS-L40-NUMMOV(W77-IND)208200      
003231           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     208300      
003232                                           WKS-L40-IMPMOV(W77-IND)208400      
003233        ELSE                                                      208500      
003234           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     208600      
003235           COMPUTE W77-IND = W77-IND + 1                          208700      
003236           IF W77-IND < 101                                       208800      
003237              PERFORM 10-0115-MUEVE-DATOS                         208900      
003238              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           209000      
003239           ELSE                                                   209100      
003240              NEXT SENTENCE                                       209200      
003241     ELSE                                                         209300      
003242        COMPUTE W77-IND = W77-IND + 1                             209400      
003243        PERFORM 10-0115-MUEVE-DATOS.                              209500      
003244                                                                  209600      
003245     PERFORM 10-0160-FN-PRO-MON.                                  209700      
003246                                                                  209800      
003247 10-0115-MUEVE-DATOS.                                             209900      
003248*====================                                             210000      
003249     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           210100      
003250     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        210200      
003251     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             210300      
003252                                      WKS-L40-PROCESO(W77-IND).   210400      
003253     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              210500      
003254                                      WKS-L40-MONEDA(W77-IND).    210600      
003255     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           210700      
003256                                      WKS-L40-CVETRA(W77-IND).    210800      
003257     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           210900      
003258                                      WKS-L40-ESQCON(W77-IND).    211000      
003259     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    211100      
003260     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    211200      
003261     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  211300      
003262     MOVE WKS-BORICON              TO WKS-BORICON-6D .            211320      
003263     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            211340      
003264     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             211360      
003265                                      WKS-L40-BCOSDET(W77-IND).   211400      
003266*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            211500      
003267*                                      WKS-L40-BCODES(W77-IND).   211600      
003268                                                                  211700      
003269 10-0150-FF-PRO-MON.                                              211800      
003270*===================                                              211900      
003271     FIND FIRST B50SXTOTXCVE AT                                   212000      
003272                B50-MOV-FEC       = WKS-L40-FECHA    AND          212100      
003273                B50-MOV-PROCESO   = WKS-L40-PROCCON  AND          212200      
003274                B50-MOV-BANCOS    = WKS-BANCOS       AND          212300      
003275*                B50-MOV-BCODES    = WKS-L40-BDESCON  AND         212400      
003276                B50-MOV-MONEDA    = WKS-L40-MONCON                212500      
003277             ON EXCEPTION                                         212600      
003278                MOVE 1             TO W77-ERROR-BASE              212700      
003279                IF DMSTATUS(NOTFOUND)                             212800      
003280                   MOVE 3          TO W77-RESULT-S151             212900      
003281                ELSE                                              213000      
003282                   MOVE 9          TO W77-RESULT-S151             213100      
003283                   PERFORM 900000-CHE-STA.                        213200      
003284 10-0155-FF-CONT.                                                 213300      
003285*================                                                 213400      
003286     FIND FIRST B50SXTOTXCVE AT                                   213500      
003287          B50-MOV-FEC        = WKS-L40-FECHA    AND               213600      
003288          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               213700      
003289          B50-MOV-BANCOS  = WKS-BANCOS          AND               213800      
003290*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              213900      
003291          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               214000      
003292          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               214100      
003293          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               214200      
003294          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               214300      
003295          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     214400      
003296       ON EXCEPTION                                               214500      
003297       MOVE ZERO                   TO W77-CVETRA-ANT              214600      
003298       IF DMSTATUS(NOTFOUND)                                      214700      
003299          FIND FIRST B50SXTOTXCVE AT                              214800      
003300              B50-MOV-FEC      = WKS-L40-FECHA    AND             214900      
003301              B50-MOV-PROCESO  = WKS-L40-PROCCON     AND          215000      
003302              B50-MOV-BANCOS   = WKS-BANCOS          AND          215100      
003303*              B50-MOV-BCODES   = WKS-L40-BDESCON     AND         215200      
003304              B50-MOV-PRD      = WKS-L40-PRODUCTO    AND          215300      
003305              B50-MOV-INS      = WKS-L40-INSTRUMENTO AND          215400      
003306              B50-MOV-MONEDA   = WKS-L40-MONCON      AND          215500      
003307              B50-MOV-CVETRA   > WKS-L40-CVETRACON                215600      
003308           ON EXCEPTION                                           215700      
003309           IF DMSTATUS(NOTFOUND)                                  215800      
003310              FIND FIRST B50SXTOTXCVE AT                          215900      
003311                   B50-MOV-FEC     = WKS-L40-FECHA    AND         216000      
003312                   B50-MOV-PROCESO = WKS-L40-PROCCON     AND      216100      
003313                   B50-MOV-BANCOS  = WKS-BANCOS          AND      216200      
003314*                   B50-MOV-BCODES  = WKS-L40-BDESCON     AND     216300      
003315                   B50-MOV-PRD     = WKS-L40-PRODUCTO    AND      216400      
003316                   B50-MOV-INS     > WKS-L40-INSTRUMENTO AND      216500      
003317                   B50-MOV-MONEDA  = WKS-L40-MONCON               216600      
003318                ON EXCEPTION                                      216700      
003319                IF DMSTATUS(NOTFOUND)                             216800      
003320                   FIND FIRST B50SXTOTXCVE AT                     216900      
003321                        B50-MOV-FEC     = WKS-L40-FECHA    AND    217000      
003322                        B50-MOV-PROCESO = WKS-L40-PROCCON     AND 217100      
003323                        B50-MOV-BANCOS  = WKS-BANCOS          AND 217200      
003324*                        B50-MOV-BCODES  = WKS-L40-BDESCON     AND217300      
003325                        B50-MOV-PRD     > WKS-L40-PRODUCTO    AND 217400      
003326                        B50-MOV-MONEDA  = WKS-L40-MONCON          217500      
003327                     ON EXCEPTION                                 217600      
003328                        MOVE 1     TO W77-ERROR-BASE              217700      
003329                     IF DMSTATUS(NOTFOUND)                        217800      
003330                        MOVE 99    TO W77-RESULT-S151             217900      
003331                     ELSE                                         218000      
003332                        MOVE 9     TO W77-RESULT-S151             218100      
003333                        PERFORM 900000-CHE-STA                    218200      
003334                ELSE                                              218300      
003335                   MOVE 9          TO W77-RESULT-S151             218400      
003336                   PERFORM 900000-CHE-STA                         218500      
003337           ELSE                                                   218600      
003338              MOVE 9               TO W77-RESULT-S151             218700      
003339              PERFORM 900000-CHE-STA                              218800      
003340       ELSE                                                       218900      
003341          MOVE 9                   TO W77-RESULT-S151             219000      
003342          PERFORM 900000-CHE-STA.                                 219100      
003343                                                                  219200      
003344 10-0160-FN-PRO-MON.                                              219300      
003345*===================                                              219400      
003346     FIND NEXT B50SXTOTXCVE AT                                    219500      
003347          B50-MOV-FEC        = WKS-L40-FECHA    AND               219600      
003348          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               219700      
003349          B50-MOV-BANCOS   = WKS-BANCOS         AND               219800      
003350*          B50-MOV-BCODES   = WKS-L40-BDESCON    AND              219900      
003351          B50-MOV-MONEDA  = WKS-L40-MONCON                        220000      
003352       ON EXCEPTION                                               220100      
003353          MOVE 1                   TO W77-ERROR-BASE              220200      
003354          IF DMSTATUS(NOTFOUND)                                   220300      
003355             MOVE 99               TO W77-RESULT-S151             220400      
003356          ELSE                                                    220500      
003357             MOVE 9                TO W77-RESULT-S151             220600      
003358             PERFORM 900000-CHE-STA.                              220700      
003359                                                                  220800      
003360*==========================================================       220900      
003361*  CONSULTA DE TOTALES POR SISTEMA-PROC-PRODUCTO-MONEDA   =       221000      
003362*==========================================================       221100      
003363                                                                  221200      
003364 11-0100-PRO-PRD-MON.                                             221300      
003365*====================                                             221400      
003366     PERFORM 11-0105-FIND-FIRST                                   221500      
003367     IF W77-ERROR-BASE = 0                                        221600      
003368        IF WKS-L40-FUN-L040 = 11                                  221700      
003369           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 221800      
003370           MOVE 1               TO W77-IND                        221900      
003371           PERFORM 11-0115-MUEVE-DATOS                            222000      
003372           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        222100      
003373                                   WKS-L40-IMPMOV(W77-IND)        222200      
003374           PERFORM 11-0110-PRO-PRD-MON                            222300      
003375                   UNTIL W77-IND = 100        OR                  222400      
003376                         W77-ERROR-BASE  > 0 OR                   222500      
003377                         W77-RESULT-S151 > 0                      222600      
003378           IF W77-IND = 100                                       222700      
003379              PERFORM 11-0110-PRO-PRD-MON                         222800      
003380                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          222900      
003381                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          223000      
003382                      W77-ERROR-BASE  > 0             OR          223100      
003383                      W77-RESULT-S151 > 0                         223200      
003384           ELSE                                                   223300      
003385              NEXT SENTENCE                                       223400      
003386        ELSE                                                      223500      
003387           PERFORM 11-0110-PRO-PRD-MON                            223600      
003388                   UNTIL W77-IND = 100       OR                   223700      
003389                         W77-ERROR-BASE  > 0 OR                   223800      
003390                         W77-RESULT-S151 > 0                      223900      
003391           IF W77-IND = 100                                       224000      
003392              PERFORM 11-0110-PRO-PRD-MON                         224100      
003393                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          224200      
003394                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          224300      
003395                      W77-ERROR-BASE  > 0             OR          224400      
003396                      W77-RESULT-S151 > 0.                        224500      
003397                                                                  224600      
003398     EXIT PROGRAM.                                                224700      
003399                                                                  224800      
003400 11-0105-FIND-FIRST.                                              224900      
003401*===================                                              225000      
003402     IF WKS-L40-CVETRACON = 0 AND                                 225100      
003403        WKS-L40-ESQCONCON = 0                                     225200      
003404        PERFORM 11-0150-FF-PRO-PRD-MON                            225300      
003405     ELSE                                                         225400      
003406        PERFORM 11-0155-FF-CONT.                                  225500      
003407                                                                  225600      
003408 11-0110-PRO-PRD-MON.                                             225700      
003409*====================                                             225800      
003410     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        225900      
003411     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          226000      
003412     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          226100      
003413     IF WKS-L40-FUN-L040 = 11                                     226200      
003414        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        226300      
003415           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     226400      
003416                                           WKS-L40-NUMMOV(W77-IND)226500      
003417           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     226600      
003418                                           WKS-L40-IMPMOV(W77-IND)226700      
003419        ELSE                                                      226800      
003420           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     226900      
003421           COMPUTE W77-IND = W77-IND + 1                          227000      
003422           IF W77-IND < 101                                       227100      
003423              PERFORM 11-0115-MUEVE-DATOS                         227200      
003424              MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT              227300      
003425           ELSE                                                   227400      
003426              NEXT SENTENCE                                       227500      
003427     ELSE                                                         227600      
003428        COMPUTE W77-IND = W77-IND + 1                             227700      
003429        PERFORM 11-0115-MUEVE-DATOS.                              227800      
003430                                                                  227900      
003431     PERFORM 11-0160-FN-PRO-PRD-MON.                              228000      
003432                                                                  228100      
003433 11-0115-MUEVE-DATOS.                                             228200      
003434*====================                                             228300      
003435     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           228400      
003436     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        228500      
003437     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             228600      
003438                                      WKS-L40-PROCESO(W77-IND).   228700      
003439     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              228800      
003440                                      WKS-L40-MONEDA(W77-IND).    228900      
003441     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           229000      
003442                                      WKS-L40-CVETRA(W77-IND).    229100      
003443     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           229200      
003444                                      WKS-L40-ESQCON(W77-IND).    229300      
003445     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    229400      
003446     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    229500      
003447     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  229600      
003448     MOVE WKS-BORICON              TO WKS-BORICON-6D .            229620      
003449     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            229640      
003450     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             229660      
003451                                      WKS-L40-BCOSDET(W77-IND).   229700      
003452*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            229800      
003453*                                      WKS-L40-BCODES(W77-IND).   229900      
003454                                                                  230000      
003455 11-0150-FF-PRO-PRD-MON.                                          230100      
003456*=======================                                          230200      
003457     FIND FIRST B50SXTOTXCVE AT                                   230300      
003458                B50-MOV-FEC        = WKS-L40-FECHA    AND         230400      
003459                B50-MOV-PROCESO    = WKS-L40-PROCCON  AND         230500      
003460                B50-MOV-PRD        = WKS-L40-PRODUCTO AND         230600      
003461                B50-MOV-BANCOS     = WKS-BANCOS       AND         230700      
003462*                B50-MOV-BCODES     = WKS-L40-BDESCON  AND        230800      
003463                B50-MOV-MONEDA     = WKS-L40-MONCON               230900      
003464             ON EXCEPTION                                         231000      
003465                MOVE 1             TO W77-ERROR-BASE              231100      
003466                IF DMSTATUS(NOTFOUND)                             231200      
003467                   MOVE 4          TO W77-RESULT-S151             231300      
003468                ELSE                                              231400      
003469                   MOVE 9          TO W77-RESULT-S151             231500      
003470                   PERFORM 900000-CHE-STA.                        231600      
003471 11-0155-FF-CONT.                                                 231700      
003472*================                                                 231800      
003473     FIND FIRST B50SXTOTXCVE AT                                   231900      
003474          B50-MOV-FEC      = WKS-L40-FECHA       AND              232000      
003475          B50-MOV-PROCESO  = WKS-L40-PROCCON     AND              232100      
003476          B50-MOV-BANCOS   = WKS-BANCOS          AND              232200      
003477*          B50-MOV-BCODES   = WKS-L40-BDESCON     AND             232300      
003478          B50-MOV-PRD      = WKS-L40-PRODUCTO    AND              232400      
003479          B50-MOV-INS      = WKS-L40-INSTRUMENTO AND              232500      
003480          B50-MOV-MONEDA   = WKS-L40-MONCON      AND              232600      
003481          B50-MOV-CVETRA   = WKS-L40-CVETRACON   AND              232700      
003482          B50-MOV-ESQCON   > WKS-L40-ESQCONCON                    232800      
003483       ON EXCEPTION                                               232900      
003484       MOVE ZERO                   TO W77-CVETRA-ANT              233000      
003485       IF DMSTATUS(NOTFOUND)                                      233100      
003486          FIND FIRST B50SXTOTXCVE AT                              233200      
003487               B50-MOV-FEC      = WKS-L40-FECHA    AND            233300      
003488               B50-MOV-PROCESO  = WKS-L40-PROCCON     AND         233400      
003489               B50-MOV-BANCOS   = WKS-BANCOS          AND         233500      
003490*               B50-MOV-BCODES   = WKS-L40-BDESCON     AND        233600      
003491               B50-MOV-PRD      = WKS-L40-PRODUCTO    AND         233700      
003492               B50-MOV-INS      = WKS-L40-INSTRUMENTO AND         233800      
003493               B50-MOV-MONEDA   = WKS-L40-MONCON      AND         233900      
003494               B50-MOV-CVETRA   > WKS-L40-CVETRACON               234000      
003495             ON EXCEPTION                                         234100      
003496             IF DMSTATUS(NOTFOUND)                                234200      
003497                FIND FIRST B50SXTOTXCVE AT                        234300      
003498                     B50-MOV-FEC      = WKS-L40-FECHA    AND      234400      
003499                     B50-MOV-PROCESO  = WKS-L40-PROCCON     AND   234500      
003500                      B50-MOV-BANCOS   = WKS-BANCOS          AND  234600      
003501*                     B50-MOV-BCODES   = WKS-L40-BDESCON     AND  234700      
003502                     B50-MOV-PRD      = WKS-L40-PRODUCTO    AND   234800      
003503                     B50-MOV-INS      > WKS-L40-INSTRUMENTO AND   234900      
003504                     B50-MOV-MONEDA   = WKS-L40-MONCON            235000      
003505                  ON EXCEPTION                                    235100      
003506                     MOVE 1        TO W77-ERROR-BASE              235200      
003507                     IF DMSTATUS(NOTFOUND)                        235300      
003508                        MOVE 99    TO W77-RESULT-S151             235400      
003509                     ELSE                                         235500      
003510                        MOVE 9     TO W77-RESULT-S151             235600      
003511                        PERFORM 900000-CHE-STA                    235700      
003512             ELSE                                                 235800      
003513                MOVE 9     TO W77-RESULT-S151                     235900      
003514                PERFORM 900000-CHE-STA                            236000      
003515       ELSE                                                       236100      
003516          MOVE 9     TO W77-RESULT-S151                           236200      
003517          PERFORM 900000-CHE-STA.                                 236300      
003518                                                                  236400      
003519 11-0160-FN-PRO-PRD-MON.                                          236500      
003520*=======================                                          236600      
003521     FIND NEXT B50SXTOTXCVE AT                                    236700      
003522          B50-MOV-FEC      = WKS-L40-FECHA       AND              236800      
003523          B50-MOV-PROCESO  = WKS-L40-PROCCON     AND              236900      
003524          B50-MOV-PRD      = WKS-L40-PRODUCTO    AND              237000      
003525          B50-MOV-BANCOS   = WKS-BANCOS          AND              237100      
003526*          B50-MOV-BCODES   = WKS-L40-BDESCON     AND             237200      
003527          B50-MOV-MONEDA   = WKS-L40-MONCON                       237300      
003528       ON EXCEPTION                                               237400      
003529          MOVE 1                   TO W77-ERROR-BASE              237500      
003530          IF DMSTATUS(NOTFOUND)                                   237600      
003531             MOVE 99               TO W77-RESULT-S151             237700      
003532          ELSE                                                    237800      
003533             MOVE 9                TO W77-RESULT-S151             237900      
003534             PERFORM 900000-CHE-STA.                              238000      
003535*==========================================================       238100      
003536*  CONSULTA DE TOTALES POR SISTEMA-PROC-PROD-INS-MONEDA   =       238200      
003537*==========================================================       238300      
003538                                                                  238400      
003539 12-0100-PRO-PRD-INS-MON.                                         238500      
003540*========================                                         238600      
003541     PERFORM 12-0150-FF-PROPRD-INSMON                             238700      
003542     IF W77-ERROR-BASE = 0                                        238800      
003543        IF WKS-L40-FUN-L040 = 12                                  238900      
003544           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 239000      
003545           MOVE 1               TO W77-IND                        239100      
003546           PERFORM 12-0115-MUEVE-DATOS                            239200      
003547           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        239300      
003548                                   WKS-L40-IMPMOV(W77-IND)        239400      
003549           PERFORM 12-0110-PROPRD-INSMON                          239500      
003550                   UNTIL W77-IND = 100       OR                   239600      
003551                         W77-ERROR-BASE  > 0 OR                   239700      
003552                         W77-RESULT-S151 > 0                      239800      
003553           IF W77-IND = 100                                       239900      
003554              PERFORM 12-0110-PROPRD-INSMON                       240000      
003555                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          240100      
003556                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          240200      
003557                      W77-ERROR-BASE  > 0             OR          240300      
003558                      W77-RESULT-S151 > 0                         240400      
003559           ELSE                                                   240500      
003560              NEXT SENTENCE                                       240600      
003561        ELSE                                                      240700      
003562           PERFORM 12-0110-PROPRD-INSMON                          240800      
003563                   UNTIL W77-IND = 100       OR                   240900      
003564                         W77-ERROR-BASE  > 0 OR                   241000      
003565                         W77-RESULT-S151 > 0                      241100      
003566           IF W77-IND = 100                                       241200      
003567              PERFORM 12-0110-PROPRD-INSMON                       241300      
003568                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          241400      
003569                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          241500      
003570                      W77-ERROR-BASE  > 0             OR          241600      
003571                      W77-RESULT-S151 > 0.                        241700      
003572                                                                  241800      
003573     EXIT PROGRAM.                                                241900      
003574                                                                  242000      
003575 12-0105-FIND-FIRST.                                              242100      
003576*===================                                              242200      
003577     IF WKS-L40-CVETRACON = 0 AND                                 242300      
003578        WKS-L40-ESQCONCON = 0                                     242400      
003579        PERFORM 12-0150-FF-PROPRD-INSMON                          242500      
003580     ELSE                                                         242600      
003581        PERFORM 12-0155-FF-CONT.                                  242700      
003582                                                                  242800      
003583 12-0110-PROPRD-INSMON.                                           242900      
003584*======================                                           243000      
003585     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          243100      
003586     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          243200      
003587     IF WKS-L40-FUN-L040 = 12                                     243300      
003588        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        243400      
003589           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     243500      
003590                                           WKS-L40-NUMMOV(W77-IND)243600      
003591           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     243700      
003592                                           WKS-L40-IMPMOV(W77-IND)243800      
003593        ELSE                                                      243900      
003594           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     244000      
003595           COMPUTE W77-IND = W77-IND + 1                          244100      
003596           IF W77-IND < 101                                       244200      
003597              PERFORM 12-0115-MUEVE-DATOS                         244300      
003598              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           244400      
003599           ELSE                                                   244500      
003600              NEXT SENTENCE                                       244600      
003601     ELSE                                                         244700      
003602        COMPUTE W77-IND = W77-IND + 1                             244800      
003603        PERFORM 12-0115-MUEVE-DATOS.                              244900      
003604                                                                  245000      
003605     PERFORM 12-0160-FN-PROPRD-INSMON.                            245100      
003606                                                                  245200      
003607 12-0115-MUEVE-DATOS.                                             245300      
003608*===================                                              245400      
003609     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           245500      
003610     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        245600      
003611     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             245700      
003612                                      WKS-L40-PROCESO(W77-IND).   245800      
003613     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              245900      
003614                                      WKS-L40-MONEDA(W77-IND).    246000      
003615     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           246100      
003616                                      WKS-L40-CVETRA(W77-IND).    246200      
003617     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           246300      
003618                                      WKS-L40-ESQCON(W77-IND).    246400      
003619     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    246500      
003620     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    246600      
003621     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  246700      
003622     MOVE WKS-BORICON              TO WKS-BORICON-6D .            246720      
003623     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            246740      
003624     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             246760      
003625                                      WKS-L40-BCOSDET(W77-IND).   246800      
003626*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            246900      
003627*                                      WKS-L40-BCODES(W77-IND).   247000      
003628                                                                  247100      
003629 12-0150-FF-PROPRD-INSMON.                                        247200      
003630*=========================                                        247300      
003631     FIND FIRST B50SXTOTXCVE AT                                   247400      
003632                B50-MOV-FEC        = WKS-L40-FECHA    AND         247500      
003633                B50-MOV-PROCESO       = WKS-L40-PROCCON     AND   247600      
003634                B50-MOV-PRD           = WKS-L40-PRODUCTO    AND   247700      
003635                B50-MOV-INS           = WKS-L40-INSTRUMENTO AND   247800      
003636                B50-MOV-BANCOS        = WKS-BANCOS          AND   247900      
003637*                B50-MOV-BCODES        = WKS-L40-BDESCON     AND  248000      
003638                B50-MOV-MONEDA        = WKS-L40-MONCON            248100      
003639             ON EXCEPTION                                         248200      
003640                MOVE 1             TO W77-ERROR-BASE              248300      
003641                IF DMSTATUS(NOTFOUND)                             248400      
003642                   MOVE 5          TO W77-RESULT-S151             248500      
003643                ELSE                                              248600      
003644                   MOVE 9          TO W77-RESULT-S151             248700      
003645                   PERFORM 900000-CHE-STA.                        248800      
003646 12-0155-FF-CONT.                                                 248900      
003647*================                                                 249000      
003648     FIND FIRST B50SXTOTXCVE AT                                   249100      
003649          B50-MOV-FEC        = WKS-L40-FECHA    AND               249200      
003650          B50-MOV-PROCESO  = WKS-L40-PROCCON     AND              249300      
003651          B50-MOV-BANCOS   = WKS-BANCOS          AND              249400      
003652*          B50-MOV-BCODES   = WKS-L40-BDESCON     AND             249500      
003653          B50-MOV-PRD      = WKS-L40-PRODUCTO    AND              249600      
003654          B50-MOV-INS      = WKS-L40-INSTRUMENTO AND              249700      
003655          B50-MOV-MONEDA   = WKS-L40-MONCON      AND              249800      
003656          B50-MOV-CVETRA   = WKS-L40-CVETRACON   AND              249900      
003657          B50-MOV-ESQCON   > WKS-L40-ESQCONCON                    250000      
003658       ON EXCEPTION                                               250100      
003659          IF DMSTATUS(NOTFOUND)                                   250200      
003660             FIND FIRST B50SXTOTXCVE AT                           250300      
003661                  B50-MOV-FEC      = WKS-L40-FECHA    AND         250400      
003662                  B50-MOV-PROCESO  = WKS-L40-PROCCON     AND      250500      
003663                  B50-MOV-BANCOS   = WKS-BANCOS          AND      250600      
003664*                  B50-MOV-BCODES   = WKS-L40-BDESCON     AND     250700      
003665                  B50-MOV-PRD      = WKS-L40-PRODUCTO    AND      250800      
003666                  B50-MOV-INS      = WKS-L40-INSTRUMENTO AND      250900      
003667                  B50-MOV-MONEDA   = WKS-L40-MONCON      AND      251000      
003668                  B50-MOV-CVETRA   > WKS-L40-CVETRACON            251100      
003669               ON EXCEPTION                                       251200      
003670                  MOVE 1           TO W77-ERROR-BASE              251300      
003671                  IF DMSTATUS(NOTFOUND)                           251400      
003672                     MOVE 99       TO W77-RESULT-S151             251500      
003673                  ELSE                                            251600      
003674                     MOVE 9        TO W77-RESULT-S151             251700      
003675                     PERFORM 900000-CHE-STA                       251800      
003676          ELSE                                                    251900      
003677             MOVE 9        TO W77-RESULT-S151                     252000      
003678             PERFORM 900000-CHE-STA.                              252100      
003679                                                                  252200      
003680 12-0160-FN-PROPRD-INSMON.                                        252300      
003681*=========================                                        252400      
003682     FIND NEXT B50SXTOTXCVE AT                                    252500      
003683          B50-MOV-FEC        = WKS-L40-FECHA    AND               252600      
003684          B50-MOV-PROCESO  = WKS-L40-PROCCON     AND              252700      
003685          B50-MOV-PRD      = WKS-L40-PRODUCTO    AND              252800      
003686          B50-MOV-INS      = WKS-L40-INSTRUMENTO AND              252900      
003687          B50-MOV-BANCOS   = WKS-BANCOS          AND              253000      
003688*          B50-MOV-BCODES   = WKS-L40-BDESCON     AND             253100      
003689          B50-MOV-MONEDA   = WKS-L40-MONCON                       253200      
003690       ON EXCEPTION                                               253300      
003691       MOVE 1                      TO W77-ERROR-BASE              253400      
003692       IF DMSTATUS(NOTFOUND)                                      253500      
003693          MOVE 99                  TO W77-RESULT-S151             253600      
003694       ELSE                                                       253700      
003695          MOVE 9                   TO W77-RESULT-S151             253800      
003696          PERFORM 900000-CHE-STA.                                 253900      
003697                                                                  254000      
003698*===========================================                      254100      
003699*   PARRAFO DE MUEVE-DATOS GENERICO PARA PROX. FUNCIONES          254200      
003700*===========================================                      254300      
003701 0X-0115-MUEVE-DATOS.                                             254400      
003702*====================                                             254500      
003703     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           254600      
003704     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        254700      
003705     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON             254800      
003706                                      WKS-L40-PROCESO(W77-IND).   254900      
003707     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON              255000      
003708                                      WKS-L40-MONEDA(W77-IND).    255100      
003709     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON           255200      
003710                                      WKS-L40-CVETRA(W77-IND).    255300      
003711     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON           255400      
003712                                      WKS-L40-ESQCON(W77-IND).    255500      
003713     MOVE B50-MOV-NUMMOV           TO WKS-L40-NUMMOV(W77-IND).    255600      
003714     MOVE B50-MOV-IMPMOV           TO WKS-L40-IMPMOV(W77-IND).    255700      
003715     MOVE B50-MOV-BANCOS           TO WKS-BANCOS                  255800      
003716     MOVE WKS-BORICON              TO WKS-BORICON-6D .            255820      
003717     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            255840      
003718     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON             255860      
003719                                      WKS-L40-BCOSDET(W77-IND).   255900      
003720*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON            256000      
003721*                                      WKS-L40-BCODES(W77-IND).   256100      
003722                                                                  256200      
003723*==========================================================       256300      
003724*  CONSULTA DE TOTALES POR SISTEMA-PROCESO-BCO.ORI-BCO.DES=       256400      
003725*==========================================================       256500      
003726 13-0100-SIS-PRO-BORI-BDES.                                       256600      
003727*============                                                     256700      
003728     PERFORM 13-0105-FIND-FIRST                                   256800      
003729     IF W77-ERROR-BASE = 0                                        256900      
003730        IF WKS-L40-FUN-L040 = 13                                  257000      
003731           MOVE B50-MOV-CVETRA  TO W77-CVETRA-ANT                 257100      
003732           MOVE 1               TO W77-IND                        257200      
003733           PERFORM 0X-0115-MUEVE-DATOS                            257300      
003734           MOVE ZERO            TO WKS-L40-NUMMOV(W77-IND)        257400      
003735                                   WKS-L40-IMPMOV(W77-IND)        257500      
003736           PERFORM 13-0110-PROCESO                                257600      
003737                   UNTIL W77-IND = 100       OR                   257700      
003738                         W77-ERROR-BASE  > 0 OR                   257800      
003739                         W77-RESULT-S151 > 0                      257900      
003740           IF W77-IND = 100                                       258000      
003741              PERFORM 13-0110-PROCESO                             258100      
003742                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          258200      
003743                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          258300      
003744                      W77-ERROR-BASE  > 0             OR          258400      
003745                      W77-RESULT-S151 > 0                         258500      
003746           ELSE                                                   258600      
003747              NEXT SENTENCE                                       258700      
003748     ELSE                                                         258800      
003749        PERFORM 13-0110-PROCESO                                   258900      
003750                UNTIL W77-IND = 100       OR                      259000      
003751                      W77-ERROR-BASE  > 0 OR                      259100      
003752                      W77-RESULT-S151 > 0                         259200      
003753        IF W77-IND = 100                                          259300      
003754           PERFORM 13-0110-PROCESO                                259400      
003755             UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR             259500      
003756                   B50-MOV-CVETRA < W77-CVETRA-ANT OR             259600      
003757                   W77-ERROR-BASE  > 0             OR             259700      
003758                   W77-RESULT-S151 > 0.                           259800      
003759     EXIT PROGRAM.                                                259900      
003760                                                                  260000      
003761 13-0105-FIND-FIRST.                                              260100      
003762*===================                                              260200      
003763     IF WKS-L40-CVETRACON = 0 AND                                 260300      
003764        WKS-L40-ESQCONCON = 0                                     260400      
003765        PERFORM 13-0150-FF-PROCESO                                260500      
003766     ELSE                                                         260600      
003767        PERFORM 13-0155-FF-CONT.                                  260700      
003768                                                                  260800      
003769 13-0110-PROCESO.                                                 260900      
003770*================                                                 261000      
003771     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           261100      
003772     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        261200      
003773     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             261300      
003774     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          261400      
003775     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          261500      
003776     IF WKS-L40-FUN-L040 = 13                                     261600      
003777        IF B50-MOV-CVETRA = W77-CVETRA-ANT                        261700      
003778           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     261800      
003779                                           WKS-L40-NUMMOV(W77-IND)261900      
003780           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV +     262000      
003781                                           WKS-L40-IMPMOV(W77-IND)262100      
003782        ELSE                                                      262200      
003783           MOVE B50-MOV-ESQCON     TO WKS-L40-ESQCONCON           262300      
003784           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     262400      
003785           COMPUTE W77-IND = W77-IND + 1                          262500      
003786           IF W77-IND < 101                                       262600      
003787              PERFORM 0X-0115-MUEVE-DATOS                         262700      
003788              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           262800      
003789           ELSE                                                   262900      
003790              NEXT SENTENCE                                       263000      
003791     ELSE                                                         263100      
003792        COMPUTE W77-IND = W77-IND + 1                             263200      
003793        PERFORM 0X-0115-MUEVE-DATOS.                              263300      
003794     PERFORM 13-0160-FN-PROCESO.                                  263400      
003795                                                                  263500      
003796 13-0150-FF-PROCESO.                                              263600      
003797*===================                                              263700      
003798     FIND FIRST B50SXTOTXCVE AT                                   263800      
003799                B50-MOV-FEC     = WKS-L40-FECHA    AND            263900      
003800                B50-MOV-PROCESO = WKS-L40-PROCCON  AND            264000      
003801                B50-MOV-BANCOS  = WKS-BANCOS                      264100      
003802*                B50-MOV-BCODES  = WKS-L40-BDESCON                264200      
003803             ON EXCEPTION                                         264300      
003804                MOVE 1             TO W77-ERROR-BASE              264400      
003805                IF DMSTATUS(NOTFOUND)                             264500      
003806                   MOVE 3          TO W77-RESULT-S151             264600      
003807                ELSE                                              264700      
003808                   MOVE 9          TO W77-RESULT-S151             264800      
003809                   PERFORM 900000-CHE-STA.                        264900      
003810 13-0155-FF-CONT.                                                 265000      
003811*================                                                 265100      
003812     FIND FIRST B50SXTOTXCVE AT                                   265200      
003813          B50-MOV-FEC     = WKS-L40-FECHA       AND               265300      
003814          B50-MOV-PROCESO = WKS-L40-PROCCON     AND               265400      
003815          B50-MOV-BANCOS  = WKS-BANCOS          AND               265500      
003816*          B50-MOV-BCODES  = WKS-L40-BDESCON     AND              265600      
003817          B50-MOV-PRD     = WKS-L40-PRODUCTO    AND               265700      
003818          B50-MOV-INS     = WKS-L40-INSTRUMENTO AND               265800      
003819          B50-MOV-MONEDA  = WKS-L40-MONCON      AND               265900      
003820          B50-MOV-CVETRA  = WKS-L40-CVETRACON   AND               266000      
003821          B50-MOV-ESQCON  > WKS-L40-ESQCONCON                     266100      
003822       ON EXCEPTION                                               266200      
003823       MOVE ZERO                   TO W77-CVETRA-ANT              266300      
003824       IF DMSTATUS(NOTFOUND)                                      266400      
003825          FIND FIRST B50SXTOTXCVE AT                              266500      
003826               B50-MOV-FEC     = WKS-L40-FECHA    AND             266600      
003827               B50-MOV-PROCESO = WKS-L40-PROCCON     AND          266700      
003828               B50-MOV-BANCOS  = WKS-BANCOS         AND           266800      
003829*               B50-MOV-BCODES  = WKS-L40-BDESCON    AND          266900      
003830               B50-MOV-PRD     = WKS-L40-PRODUCTO    AND          267000      
003831               B50-MOV-INS     = WKS-L40-INSTRUMENTO AND          267100      
003832               B50-MOV-MONEDA  = WKS-L40-MONCON      AND          267200      
003833               B50-MOV-CVETRA  > WKS-L40-CVETRACON                267300      
003834            ON EXCEPTION                                          267400      
003835            IF DMSTATUS(NOTFOUND)                                 267500      
003836               FIND FIRST B50SXTOTXCVE AT                         267600      
003837                    B50-MOV-FEC     = WKS-L40-FECHA    AND        267700      
003838                    B50-MOV-PROCESO = WKS-L40-PROCCON     AND     267800      
003839                    B50-MOV-BANCOS  = WKS-BANCOS          AND     267900      
003840*                    B50-MOV-BCODES  = WKS-L40-BDESCON     AND    268000      
003841                    B50-MOV-PRD     = WKS-L40-PRODUCTO    AND     268100      
003842                    B50-MOV-INS     = WKS-L40-INSTRUMENTO AND     268200      
003843                    B50-MOV-MONEDA  > WKS-L40-MONCON              268300      
003844                 ON EXCEPTION                                     268400      
003845                 IF DMSTATUS(NOTFOUND)                            268500      
003846                    FIND FIRST B50SXTOTXCVE AT                    268600      
003847                         B50-MOV-FEC     = WKS-L40-FECHA   AND    268700      
003848                         B50-MOV-PROCESO = WKS-L40-PROCCON    AND 268800      
003849                         B50-MOV-BANCOS  = WKS-BANCOS         AND 268900      
003850*                         B50-MOV-BCODES  = WKS-L40-BDESCON    AND269000      
003851                         B50-MOV-PRD     = WKS-L40-PRODUCTO   AND 269100      
003852                         B50-MOV-INS     > WKS-L40-INSTRUMENTO    269200      
003853                      ON EXCEPTION                                269300      
003854                      IF DMSTATUS(NOTFOUND)                       269400      
003855                         FIND FIRST B50SXTOTXCVE AT               269500      
003856                            B50-MOV-FEC     = WKS-L40-FECHA AND   269600      
003857                            B50-MOV-PROCESO = WKS-L40-PROCCON  AND269700      
003858                            B50-MOV-BANCOS  = WKS-BANCOS       AND269800      
003859*                           B50-MOV-BCODES  = WKS-L40-BDESCON  AND269900      
003860                            B50-MOV-PRD     > WKS-L40-PRODUCTO    270000      
003861                         ON EXCEPTION                             270100      
003862                         MOVE 1     TO W77-ERROR-BASE             270200      
003863                         IF DMSTATUS(NOTFOUND)                    270300      
003864                            MOVE 99 TO W77-RESULT-S151            270400      
003865                         ELSE                                     270500      
003866                            MOVE 9  TO W77-RESULT-S151            270600      
003867                            PERFORM 900000-CHE-STA                270700      
003868                      ELSE                                        270800      
003869                         MOVE 9  TO W77-RESULT-S151               270900      
003870                         PERFORM 900000-CHE-STA                   271000      
003871                 ELSE                                             271100      
003872                    MOVE 9  TO W77-RESULT-S151                    271200      
003873                    PERFORM 900000-CHE-STA                        271300      
003874            ELSE                                                  271400      
003875               MOVE 9  TO W77-RESULT-S151                         271500      
003876               PERFORM 900000-CHE-STA                             271600      
003877       ELSE                                                       271700      
003878          MOVE 9  TO W77-RESULT-S151                              271800      
003879          PERFORM 900000-CHE-STA.                                 271900      
003880                                                                  272000      
003881 13-0160-FN-PROCESO.                                              272100      
003882*===================                                              272200      
003883     FIND NEXT B50SXTOTXCVE AT                                    272300      
003884               B50-MOV-FEC           = WKS-L40-FECHA    AND       272400      
003885               B50-MOV-BANCOS        = WKS-BANCOS       AND       272500      
003886               B50-MOV-PROCESO       = WKS-L40-PROCCON            272600      
003887*               B50-MOV-BCODES        = WKS-L40-BDESCON           272700      
003888            ON EXCEPTION                                          272800      
003889               MOVE 1             TO W77-ERROR-BASE               272900      
003890                IF DMSTATUS(NOTFOUND)                             273000      
003891                   MOVE 99         TO W77-RESULT-S151             273100      
003892                ELSE                                              273200      
003893                   MOVE 9          TO W77-RESULT-S151             273300      
003894                   PERFORM 900000-CHE-STA.                        273400      
003895                                                                  273500      
003896*  CONSULTA DE TOTALES POR SISTEMA-BCO.ORI-BCO.DES        =       273600      
003897*==========================================================       273700      
003898 14-0100-SIS-BORI-BDES.                                           273800      
003899*============                                                     273900      
003900     PERFORM 14-0105-FIND-FIRST                                   274000      
003901     IF W77-ERROR-BASE = 0                                        274100      
003902        IF WKS-L40-FUN-L040 = 14                                  274200      
003903           MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT              274300      
003904           MOVE 1                  TO W77-IND                     274400      
003905           PERFORM 0X-0115-MUEVE-DATOS                            274500      
003906           MOVE ZERO               TO WKS-L40-NUMMOV(W77-IND)     274600      
003907                                      WKS-L40-IMPMOV(W77-IND)     274700      
003908           PERFORM 14-0110-CONSIS                                 274800      
003909                   UNTIL W77-IND = 100       OR                   274900      
003910                         W77-ERROR-BASE  > 0 OR                   275000      
003911                         W77-RESULT-S151 > 0                      275100      
003912           IF W77-IND = 100                                       275200      
003913              PERFORM 14-0110-CONSIS                              275300      
003914                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          275400      
003915                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          275500      
003916                      W77-ERROR-BASE  > 0             OR          275600      
003917                      W77-RESULT-S151 > 0                         275700      
003918           ELSE                                                   275800      
003919              NEXT SENTENCE                                       275900      
003920        ELSE                                                      276000      
003921           PERFORM 14-0110-CONSIS                                 276100      
003922                   UNTIL W77-IND = 100       OR                   276200      
003923                         W77-ERROR-BASE  > 0 OR                   276300      
003924                         W77-RESULT-S151 > 0                      276400      
003925           IF W77-IND = 100                                       276500      
003926              PERFORM 14-0110-CONSIS                              276600      
003927                UNTIL B50-MOV-CVETRA > W77-CVETRA-ANT OR          276700      
003928                      B50-MOV-CVETRA < W77-CVETRA-ANT OR          276800      
003929                      W77-ERROR-BASE  > 0             OR          276900      
003930                      W77-RESULT-S151 > 0.                        277000      
003931                                                                  277100      
003932     EXIT PROGRAM.                                                277200      
003933                                                                  277300      
003934 14-0105-FIND-FIRST.                                              277400      
003935*===================                                              277500      
003936     IF WKS-L40-CVETRACON = 0 AND                                 277600      
003937        WKS-L40-ESQCONCON = 0                                     277700      
003938        PERFORM 14-0150-FF-SIS                                    277800      
003939     ELSE                                                         277900      
003940        PERFORM 14-0155-FF-CONT.                                  278000      
003941                                                                  278100      
003942 14-0110-CONSIS.                                                  278200      
003943*===============                                                  278300      
003944     MOVE B50-MOV-PROCESO          TO WKS-L40-PROCCON.            278400      
003945     MOVE B50-MOV-PRD              TO WKS-L40-PRODUCTO.           278500      
003946     MOVE B50-MOV-INS              TO WKS-L40-INSTRUMENTO.        278600      
003947     MOVE B50-MOV-MONEDA           TO WKS-L40-MONCON.             278700      
003948     MOVE B50-MOV-CVETRA           TO WKS-L40-CVETRACON.          278800      
003949     MOVE B50-MOV-ESQCON           TO WKS-L40-ESQCONCON.          278900      
003950     MOVE B50-MOV-BANCOS           TO WKS-BANCOS     .            279000      
003951     MOVE WKS-BORICON              TO WKS-BORICON-6D .            279020      
003952     MOVE WKS-BDESCON              TO WKS-BDESCON-6D .            279040      
003953     MOVE WKS-BANCOS-6D            TO WKS-L40-BCOSCON.            279060      
003954*     MOVE B50-MOV-BCODES           TO WKS-L40-BDESCON.           279100      
003955     IF WKS-L40-FUN-L040 = 14                                     279200      
003956        IF W77-CVETRA-ANT = B50-MOV-CVETRA                        279300      
003957           COMPUTE WKS-L40-NUMMOV(W77-IND) = B50-MOV-NUMMOV +     279400      
003958                                           WKS-L40-NUMMOV(W77-IND)279500      
003959           COMPUTE WKS-L40-IMPMOV(W77-IND) = B50-MOV-IMPMOV  +    279600      
003960                                           WKS-L40-IMPMOV(W77-IND)279700      
003961        ELSE                                                      279800      
003962           MOVE ZERO               TO WKS-L40-ESQCON(W77-IND)     279900      
003963           COMPUTE W77-IND = W77-IND + 1                          280000      
003964           IF W77-IND < 101                                       280100      
003965              PERFORM 0X-0115-MUEVE-DATOS                         280200      
003966              MOVE B50-MOV-CVETRA     TO W77-CVETRA-ANT           280300      
003967           ELSE                                                   280400      
003968              NEXT SENTENCE                                       280500      
003969     ELSE                                                         280600      
003970        COMPUTE W77-IND = W77-IND + 1                             280700      
003971        PERFORM 0X-0115-MUEVE-DATOS.                              280800      
003972     PERFORM 14-0160-FN-CONXSIS.                                  280900      
003973                                                                  281000      
003974 14-0150-FF-SIS.                                                  281100      
003975*===============                                                  281200      
003976     FIND FIRST B50SXTOTXCVE AT                                   281300      
003977                B50-MOV-FEC        = WKS-L40-FECHA    AND         281400      
003978                B50-MOV-BANCOS     = WKS-BANCOS       AND         281500      
003979*                B50-MOV-BCODES     = WKS-L40-BDESCON  AND        281600      
003980                B50-MOV-MONEDA NOT < WKS-L40-MONCON               281700      
003981             ON EXCEPTION                                         281800      
003982                MOVE 1             TO W77-ERROR-BASE              281900      
003983                IF DMSTATUS(NOTFOUND)                             282000      
003984                   MOVE 3          TO W77-RESULT-S151             282100      
003985                ELSE                                              282200      
003986                   MOVE 9          TO W77-RESULT-S151             282300      
003987                   PERFORM 900000-CHE-STA.                        282400      
003988                                                                  282500      
003989 14-0155-FF-CONT.                                                 282600      
003990*================                                                 282700      
003991     FIND FIRST B50SXTOTXCVE AT                                   282800      
003992                B50-MOV-FEC        = WKS-L40-FECHA    AND         282900      
003993        B50-MOV-PROCESO = WKS-L40-PROCCON      AND                283000      
003994        B50-MOV-BANCOS  = WKS-BANCOS           AND                283100      
003995*        B50-MOV-BCODES  = WKS-L40-BDESCON      AND               283200      
003996        B50-MOV-PRD     = WKS-L40-PRODUCTO     AND                283300      
003997        B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND                283400      
003998        B50-MOV-MONEDA  = WKS-L40-MONCON       AND                283500      
003999        B50-MOV-CVETRA  = WKS-L40-CVETRACON    AND                283600      
004000        B50-MOV-ESQCON  > WKS-L40-ESQCONCON                       283700      
004001     ON EXCEPTION                                                 283800      
004002     MOVE ZERO                     TO W77-CVETRA-ANT              283900      
004003     IF DMSTATUS(NOTFOUND)                                        284000      
004004        FIND FIRST B50SXTOTXCVE AT                                284100      
004005           B50-MOV-FEC        = WKS-L40-FECHA AND                 284200      
004006           B50-MOV-PROCESO = WKS-L40-PROCCON      AND             284300      
004007           B50-MOV-BANCOS  = WKS-BANCOS           AND             284400      
004008*           B50-MOV-BCODES  = WKS-L40-BDESCON      AND            284500      
004009           B50-MOV-PRD     = WKS-L40-PRODUCTO     AND             284600      
004010           B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND             284700      
004011           B50-MOV-MONEDA  = WKS-L40-MONCON       AND             284800      
004012           B50-MOV-CVETRA  > WKS-L40-CVETRACON                    284900      
004013        ON EXCEPTION                                              285000      
004014        IF DMSTATUS(NOTFOUND)                                     285100      
004015           FIND FIRST B50SXTOTXCVE AT                             285200      
004016              B50-MOV-FEC        = WKS-L40-FECHA AND              285300      
004017              B50-MOV-PROCESO = WKS-L40-PROCCON      AND          285400      
004018              B50-MOV-BANCOS  = WKS-BANCOS           AND          285500      
004019*              B50-MOV-BCODES  = WKS-L40-BDESCON      AND         285600      
004020              B50-MOV-PRD     = WKS-L40-PRODUCTO     AND          285700      
004021              B50-MOV-INS     = WKS-L40-INSTRUMENTO  AND          285800      
004022              B50-MOV-MONEDA  > WKS-L40-MONCON                    285900      
004023           ON EXCEPTION                                           286000      
004024           IF DMSTATUS(NOTFOUND)                                  286100      
004025              FIND FIRST B50SXTOTXCVE AT                          286200      
004026                 B50-MOV-FEC        = WKS-L40-FECHA AND           286300      
004027                 B50-MOV-PROCESO = WKS-L40-PROCCON      AND       286400      
004028                 B50-MOV-BANCOS  = WKS-BANCOS           AND       286500      
004029*                 B50-MOV-BCODES  = WKS-L40-BDESCON      AND      286600      
004030                 B50-MOV-PRD     = WKS-L40-PRODUCTO     AND       286700      
004031                 B50-MOV-INS     > WKS-L40-INSTRUMENTO            286800      
004032              ON EXCEPTION                                        286900      
004033              IF DMSTATUS(NOTFOUND)                               287000      
004034                 FIND FIRST B50SXTOTXCVE AT                       287100      
004035                    B50-MOV-FEC     = WKS-L40-FECHA AND           287200      
004036                    B50-MOV-PROCESO = WKS-L40-PROCCON  AND        287300      
004037                    B50-MOV-BANCOS  = WKS-BANCOS       AND        287400      
004038*                    B50-MOV-BCODES  = WKS-L40-BDESCON  AND       287500      
004039                    B50-MOV-PRD     > WKS-L40-PRODUCTO            287600      
004040                 ON EXCEPTION                                     287700      
004041                 IF DMSTATUS(NOTFOUND)                            287800      
004042                    FIND FIRST B50SXTOTXCVE AT                    287900      
004043                       B50-MOV-FEC     = WKS-L40-FECHA AND        288000      
004044                       B50-MOV-BANCOS  = WKS-BANCOS       AND     288100      
004045*                       B50-MOV-BCODES  = WKS-L40-BDESCON  AND    288200      
004046                       B50-MOV-PROCESO > WKS-L40-PROCCON          288300      
004047                    ON EXCEPTION                                  288400      
004048                    IF DMSTATUS(NOTFOUND)                         288500      
004049                       MOVE 1      TO W77-ERROR-BASE              288600      
004050                       IF DMSTATUS(NOTFOUND)                      288700      
004051                          MOVE 3   TO W77-RESULT-S151             288800      
004052                       ELSE                                       288900      
004053                          MOVE 9   TO W77-RESULT-S151             289000      
004054                          PERFORM 900000-CHE-STA                  289100      
004055                    ELSE                                          289200      
004056                       MOVE 9   TO W77-RESULT-S151                289300      
004057                       PERFORM 900000-CHE-STA                     289400      
004058                 ELSE                                             289500      
004059                    MOVE 9   TO W77-RESULT-S151                   289600      
004060                    PERFORM 900000-CHE-STA                        289700      
004061              ELSE                                                289800      
004062                 MOVE 9   TO W77-RESULT-S151                      289900      
004063                 PERFORM 900000-CHE-STA                           290000      
004064           ELSE                                                   290100      
004065              MOVE 9   TO W77-RESULT-S151                         290200      
004066              PERFORM 900000-CHE-STA                              290300      
004067        ELSE                                                      290400      
004068           MOVE 9   TO W77-RESULT-S151                            290500      
004069           PERFORM 900000-CHE-STA                                 290600      
004070     ELSE                                                         290700      
004071        MOVE 9   TO W77-RESULT-S151                               290800      
004072        PERFORM 900000-CHE-STA.                                   290900      
004073                                                                  291000      
004074 14-0160-FN-CONXSIS.                                              291100      
004075*===================                                              291200      
004076     FIND NEXT  B50SXTOTXCVE AT                                   291300      
004077                B50-MOV-FEC     = WKS-L40-FECHA      AND          291400      
004078                B50-MOV-BANCOS  = WKS-BANCOS                      291500      
004079*                B50-MOV-BCODES  = WKS-L40-BDESCON                291600      
004080             ON EXCEPTION                                         291700      
004081                MOVE 1             TO W77-ERROR-BASE              291800      
004082                IF DMSTATUS(NOTFOUND)                             291900      
004083                   MOVE 99         TO W77-RESULT-S151             292000      
004084                ELSE                                              292100      
004085                   MOVE 9          TO W77-RESULT-S151             292200      
004086                   PERFORM 900000-CHE-STA.                        292300      
004087                                                                  292400      
004088                                                                  292500      
004089*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
004090* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO   78000.         292600      
004091 900000-CHE-STA.                                                  068000      
004092     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
004093     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
004094     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
004095                                                                  069300      
004096     IF WKS-ERR-DMSII > ZEROS                                     070000      
004097        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
004098                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
004099                           " " WKS-ERR-DMSII                      073000      
004100                "TIPO        " WKS-ERR-BD                         074000      
004101                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
004102        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
004103        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
004104                                                                  078000      
004105*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
004106                                                                  292700      
004107*A2K-CPY-SECTION SECTION.                                         292800      
004108*COPY "S151/CRONOS2K/CPY/PD".                                     292900      
004109* A2K-CPY-EXIT-PARA.                                              293000      
004110* EXIT.                                                           293100      
