000001*$SET LIST                                                        000100      
000002*$SET TADS                                                        000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004******************************************************************000400      
000005* REPORTE.- DIFERENCIAS DEL S264                                 *000500      
000006* SE EFECTUA UN COMPARATIVO ENTRE LO QUE SE ENVIA AL S028 Y S115 *000600      
000007* SACANDO LAS DIFERENCIAS CONTABLES ENTRE AMBOS ENVIOS           *000700      
000008* PROGRAMA PARA EL S264. ARCH. ENTRADA: S151/FILE/MOVS264/AAMMDD *000800      
000009*                                                                *000810      
000010* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *000812      
000011* 20141208 15MTP001 MJGRG                                        *000814      
000012* RECOMPILACION POR EL UPGRADE DEL MCP A 62                      *000820      
000013* 20230714 23MTP003 CLLC                                         *000840      
000014******************************************************************000900      
000015 ENVIRONMENT DIVISION.                                            001000      
000016 INPUT-OUTPUT SECTION.                                            001100      
000017 FILE-CONTROL.                                                    001200      
000018      SELECT A01-MOVS264        ASSIGN TO DISK.                   001300      
000019      SELECT S01-MOVTOS         ASSIGN TO SORT DISK.              001400      
000020      SELECT V01-BITACORA       ASSIGN TO PRINTER.                001500      
000021                                                                  001600      
000022 DATA DIVISION.                                                   001700      
000023 FILE SECTION.                                                    001800      
000024 FD A01-MOVS264                                                   001900      
000025*==============                                                   002000      
000026    VALUE OF BUFFERS        IS 1                                  002100      
000027    BLOCK CONTAINS             144 RECORDS                        002300      
000028    VALUE OF TITLE          IS WKS-TIT-REP.                       002400      
000029 01 A01-REG-MOVS264                PIC X(450).                    002600      
000030                                                                  002700      
000031 SD S01-MOVTOS.                                                   002800      
000032                                                                  002840      
000033 01 S01-REGMOV .                                                  002900      
000034    03 S01-FUNCION                 PIC  9(02)      COMP.          003000      
000035    03 S01-SISTEMA                 PIC  9(04)      COMP.          003100      
000036    03 S01-PRODUCTO                PIC  9(04)      COMP.          003200      
000037    03 S01-INSTRUMENTO             PIC  9(02)      COMP.          003300      
000038    03 S01-SUCPROM                 PIC  9(04)      COMP.          003400      
000039    03 S01-CONTRATO                PIC  9(16)      COMP.          003500      
000040    03 S01-CVETRAN                 PIC  9(04)      COMP.          003600      
000041    03 S01-IMPORTE                 PIC  9(14)V99   COMP.          003700      
000042    03 S01-FECMOV                  PIC  9(08)      COMP.          003800      
000043    03 S01-HORMOV                  PIC  9(06)      COMP.          003900      
000044    03 S01-HORMOV-R REDEFINES S01-HORMOV.                         004000      
000045       05 S01-HORAMV               PIC  9(02)      COMP.          004100      
000046       05 S01-MINUMV               PIC  9(02)      COMP.          004150      
000047       05 S01-SEGMOV               PIC  9(02)      COMP.          004200      
000048    03 S01-FECCONT                 PIC  9(08)      COMP.          004300      
000049    03 S01-FECVAL                  PIC  9(08)      COMP.          004400      
000050    03 S01-AUTORIZA                PIC  9(08)      COMP.          004500      
000051    03 S01-AUT3ER                  PIC  9(08)      COMP.          004600      
000052    03 S01-REFNUM                  PIC  9(20)      COMP.          004700      
000053    03 S01-CVEMDA                  PIC  9(02)      COMP.          004800      
000054    03 S01-NUMMDA                  PIC  9(20)      COMP.          004900      
000055    03 S01-CVEMDE                  PIC  9(02)      COMP.          005000      
000056    03 S01-SUC-INIC                PIC  9(04)      COMP.          005100      
000057    03 S01-CAJA-INIC               PIC  9(02)      COMP.          005200      
000058    03 S01-SUCOPER                 PIC  9(04)      COMP.          005300      
000059    03 S01-CAJAOPER                PIC  9(02)      COMP.          005400      
000060    03 S01-SUCTRAN                 PIC  9(04)      COMP.          005500      
000061    03 S01-CAJATRAN                PIC  9(02)      COMP.          005600      
000062    03 S01-NOMINA-OPE              PIC  9(08)      COMP.          005700      
000063    03 S01-ORIGEN                  PIC  9(02)      COMP.          005800      
000064    03 S01-MONEDA                  PIC  9(04)      COMP.          005900      
000065    03 S01-AUT-S151                PIC  9(08)      COMP.          006000      
000066    03 S01-AUT-AELIM-S151          PIC  9(08)      COMP.          006100      
000067    03 S01-AUT-ANT-S151            PIC  9(08)      COMP.          006200      
000068    03 S01-TIPO-PROC               PIC  9(02)      COMP.          006300      
000069    03 S01-SOBREGIRO               PIC  9(02)      COMP.          006400      
000070    03 S01-CVEAVISO                PIC  9(04)      COMP.          006500      
000071    03 S01-IND-EDOCTA              PIC  9(02)      COMP.          006600      
000072    03 S01-IND-DATOS-ADIC          PIC  9(02)      COMP.          006700      
000073    03 S01-IND-CONTA               PIC  9(02)      COMP.          006800      
000074    03 S01-IND-NUMREN              PIC  9(02)      COMP.          006900      
000075    03 S01-ACTIVIDAD               PIC  9(06)      COMP.          007000      
000076    03 S01-SECTOR                  PIC  9(02)      COMP.          007100      
000077    03 S01-BANCA                   PIC  9(02)      COMP.          007200      
000078    03 S01-NODO-ORIG               PIC  9(02)      COMP.          007300      
000079    03 S01-APUDES                  PIC  9(08)      COMP.          007400      
000080    03 S01-STATUS                  PIC  9(02)      COMP.          007500      
000081                                                                  007600      
000082 FD V01-BITACORA                                                  007700      
000083    VALUE OF TITLE IS WKS-TIT-BITACORA.                           007800      
000084 01 V01-R01-BITACORA                          PIC X(132).         007900      
000085                                                                  008000      
000086 WORKING-STORAGE SECTION.                                         008100      
000087*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000088* COPY "S151/CRONOS2K/CPY/WS".                                    008200      
000089******************************************************************000100      
000090** This copyBook defines all the additional variables that      **000200      
000091** Unisys has defined for the CRONOS2K project                  **000300      
000092** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000093******************************************************************000500      
000094                                                                  000600      
000095******************************************************************000700      
000096** These Variables are used to Accept the system date in long   **000800      
000097** format and get the century information                       **000900      
000098** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000099 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000100 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000101    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000102    05 FILLER      PIC X(1).                                      001400      
000103    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000104    05 FILLER      PIC X(1).                                      001600      
000105    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000106    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000107      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000108      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000109******************************************************************002100      
000110                                                                  002200      
000111******************************************************************002300      
000112** This variable defines a date in the format MMDDCCAA          **002400      
000113**                                                              **002500      
000114 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000115 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000116    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000117    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000118    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000119    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000120      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000121      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000122******************************************************************003400      
000123                                                                  003500      
000124******************************************************************003600      
000125** This variable defines a date in the format CCAAMMDD          **003700      
000126**                                                              **003800      
000127 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000128 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000129    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000130    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000131      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000132      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000133    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000134    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000135******************************************************************004700      
000136                                                                  004800      
000137******************************************************************004900      
000138** This variable defines a date in the format DDMMCCAA          **005000      
000139**                                                              **005100      
000140 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000141 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000142    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000143    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000144    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000145    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000146      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000147      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000148******************************************************************006000      
000149                                                                  006100      
000150******************************************************************006200      
000151** This variable defines a date in the Julian Format CCAADDD    **006300      
000152**                                                              **006400      
000153 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000154 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000155    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000156    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000157                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000158      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000159      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000160    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000161******************************************************************007300      
000162                                                                  007400      
000163******************************************************************007500      
000164** This variable defines a date in the format AAMMDD            **007600      
000165**                                                              **007700      
000166 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000167 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000168    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000169    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000170    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000171******************************************************************008300      
000172                                                                  008400      
000173******************************************************************008500      
000174** This variable defines a date in the format MMDDAA            **008600      
000175**                                                              **008700      
000176 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000177 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000178    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000179    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000180    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000181******************************************************************009300      
000182                                                                  009400      
000183******************************************************************009500      
000184** This variable defines a date in the format DDMMAA            **009600      
000185**                                                              **009700      
000186 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000187 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000188    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000189    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000190    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000191******************************************************************010300      
000192                                                                  010400      
000193******************************************************************010500      
000194** These variables are defined to be used for CALL bridge logic **010600      
000195**                                                              **010700      
000196 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000197 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000198 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000199 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000200 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000201 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000202******************************************************************011400      
000203                                                                  011500      
000204******************************************************************011600      
000205** This variable is used for converting only a year field AA to **011700      
000206** CCAA and a CCAA to AA                                        **011800      
000207 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000208 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000209    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000210    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000211 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000212 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000213******************************************************************012300      
000214                                                                  012400      
000215******************************************************************012500      
000216** These variables are Bridge Variables for Intercambio files   **012600      
000217** para EDOCTA                                                  **012700      
000218 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000219 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000220 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000221 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000222 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000223 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000224 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000225******************************************************************013500      
000226* Para MODULO                                                     013600      
000227 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000228******************************************************************013800      
000229******************************************************************013900      
000230** Para FMOVSCHABO                                                014000      
000231 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000232******************************************************************014200      
000233                                                                  014300      
000234******************************************************************014400      
000235***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000236******************************************************************014600      
000237                                                                  014700      
000238 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000239 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000240     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000241     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000242     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000243******************************************************************015300      
000244                                                                  015400      
000245******************************************************************015500      
000246***  These Variables Are Defined For Date In AAMM Format       ***015600      
000247******************************************************************015700      
000248                                                                  015800      
000249 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000250 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000251     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000252     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000253******************************************************************016300      
000254                                                                  016400      
000255                                                                  016500      
000256*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000257*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000258* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         008300      
000259*================================================================ 000100      
000260*         ENTRY-POINT CONSISDIA :                               = 000200      
000261*                                                                 000300      
000262* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000263* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000264* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000265* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000266* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000267* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000268* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000269* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000270* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000271* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000272*                                                               = 001400      
000273*================================================================ 001500      
000274                                                                  001600      
000275                                                                  001700      
000276*================================================================ 001800      
000277* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000278*                                                               = 002000      
000279* ENTRADA REQUERIDA :                                           = 002100      
000280*                                                               = 002200      
000281*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000282*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000283*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000284*================================================================ 002600      
000285 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000286    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000287    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000288    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000289    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000290    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000291    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000292    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000293    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000294    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000295    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000296    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000297    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000298    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000299    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000300    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000301    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000302    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000303    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000304    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000305    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000306       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000307       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000308       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000309       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000310*==============================================================   005200      
000311*                                                             =   005300      
000312* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000313*                                                             =   005500      
000314* CAMPOS REQUERIDOS :                                         =   005600      
000315*                                                             =   005700      
000316* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000317* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000318* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000319* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000320*==============================================================   006200      
000321 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000322    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000323    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000324    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000325    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000326                                                                  006800      
000327*==============================================================   006900      
000328*                                                             =   007000      
000329* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000330*                                                             =   007200      
000331* CAMPOS REQUERIDOS :                                         =   007300      
000332*                                                             =   007400      
000333* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000334* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000335* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000336* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000337*==============================================================   007900      
000338 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000339    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000340    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000341    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000342    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000343                                                                  008500      
000344*==============================================================   008600      
000345*                                                             =   008700      
000346* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000347*                                                             =   008900      
000348* CAMPOS REQUERIDOS :                                         =   009000      
000349*                                                             =   009100      
000350* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000351* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000352* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000353* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000354*==============================================================   009600      
000355 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000356    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000357    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000358    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000359    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000360                                                                  010200      
000361*============================================================     010300      
000362* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000363*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000364*                                                           =     010600      
000365*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000366*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000367*                                                           =     010900      
000368*  ENTRADA REQUERIDA.                                       =     011000      
000369*                                                           =     011100      
000370*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000371*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000372*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000373*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000374*============================================================     011600      
000375                                                                  011700      
000376 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000377     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000378     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000379     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000380     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000381                                                                  012300      
000382*=============================================================    012400      
000383*                                                            =    012500      
000384* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000385*             B01-SIS-FECARMOV.                              =    012700      
000386*                                                            =    012800      
000387* ENTRADA REQUERIDAD :                                       =    012900      
000388*                                                            =    013000      
000389*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000390*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000391*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000392*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000393*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000394*=============================================================    013600      
000395                                                                  013700      
000396 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000397     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000398     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000399     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000400     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000401     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000402*================================================================ 014400      
000403*                                                               = 014500      
000404* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000405*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000406*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000407*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000408*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000409*                                                               = 015100      
000410* ENTRADA REQUERIDA :                                           = 015200      
000411*                                                               = 015300      
000412* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000413* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000414* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000415* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000416* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000417*================================================================ 015900      
000418 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000419    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000420    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000421    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000422    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000423    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000424                                                                  016600      
000425*============================================================     016700      
000426*                                                           =     016800      
000427* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000428*                                                           =     017000      
000429* DATOS REQUERIDOS :                                        =     017100      
000430*                                                           =     017200      
000431* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000432* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000433* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000434* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000435* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000436*============================================================     017800      
000437                                                                  017900      
000438 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000439     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000440     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000441     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000442     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000443     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000444                                                                  018600      
000445*============================================================     018700      
000446*                                                           =     018800      
000447* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000448*                                                           =     019000      
000449* DATOS REQUERIDOS :                                        =     019100      
000450*                                                           =     019200      
000451* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000452* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000453* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000454* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000455* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000456*============================================================     019800      
000457                                                                  019900      
000458 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000459     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000460     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000461     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000462     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000463     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000464                                                                  020600      
000465*===============================================================  020700      
000466*                                                              =  020800      
000467* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000468*              MOVIMIENTOS.                                    =  021000      
000469* DATOS REQUERIDOS :                                           =  021100      
000470*                                                              =  021200      
000471* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000472* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000473* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000474* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000475* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000476* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000477*==============================================================   021900      
000478                                                                  022000      
000479 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000480     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000481     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000482     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000483     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000484     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000485     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000486*==============================================================   022800      
000487*                                                             =   022900      
000488* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000489*                                                             =   023100      
000490* CAMPOS REQUERIDOS :                                         =   023200      
000491*                                                             =   023300      
000492* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000493* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000494* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000495* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000496*==============================================================   023800      
000497 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000498    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000499    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000500    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000501    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000502                                                                  024304      
000503*=================================================================024306      
000504*                ENTRY POINT CONSISB01                           =024308      
000505*                                                                =024310      
000506*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000507*                                                                =024314      
000508*  FUNCIONES DISPONIBLES :                                       =024316      
000509*                                                                =024318      
000510*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000511*                                                                =024322      
000512*  PARAMETROS REQUERIDOS                                         =024324      
000513*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000514*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000515*=================================================================024330      
000516                                                                  024332      
000517 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000518     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000519     03 WKS-CON-CSI                PIC 9(02).                     024336      
000520     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000521     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000522        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000523        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000524        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000525        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000526        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000527                                                                  024400      
000528*=================================================================024500      
000529*                ENTRY POINT B02ARCINTER                         =024600      
000530*                                                                =024700      
000531*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000532*                                                                =024900      
000533*  FUNCIONES DISPONIBLES :                                       =025000      
000534*                                                                =025100      
000535*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000536* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000537* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000538* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000539*                                                                =025600      
000540*  PARAMETROS REQUERIDOS                                         =025700      
000541*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000542*                                                                =025900      
000543*=================================================================026000      
000544 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000545     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000546     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000547     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000548     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000549     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000550     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000551     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000552     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000553     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000554     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000555     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000556     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000557     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000558     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000559     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000560     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000561     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000562     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000563     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000564     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000565     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000566     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000567     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000568     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000569     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000570     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000571     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000572     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000573                                                                  029000      
000574*=================================================================029100      
000575*                ENTRY POINT B04SISTEMA                          =029200      
000576*                                                                =029300      
000577*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000578*                                                                =029500      
000579*  FUNCIONES DISPONIBLES :                                       =029600      
000580*                                                                =029700      
000581*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000582*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000583*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000584*                                                                =030100      
000585*  PARAMETROS REQUERIDOS                                         =030200      
000586*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000587*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000588*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000589*                                                                =030600      
000590*=================================================================030700      
000591 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000592     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000593     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000594     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000595     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000596     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000597     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000598     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000599                                                                  031600      
000600*================================================================ 031700      
000601*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000602*                                                               = 031900      
000603*  FUNCION                                                      = 032000      
000604*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000605*   19       ALTAS.                                             = 032200      
000606*   22       BAJAS                                              = 032300      
000607*   37       CAMBIOS.                                           = 032400      
000608*                                                               = 032500      
000609*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000610*                      FECHA DE PROCESO                         = 032700      
000611*                      NUMERO DE PROCESO                        = 032800      
000612*                      FECHA INICIO                             = 032900      
000613*                      REGISTRO INICIAL                         = 033000      
000614*================================================================ 033100      
000615                                                                  033200      
000616 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000617     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000618     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000619     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000620     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000621     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000622     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000623     03 WKS-B05-MIX                PIC 9(08).                     034000      
000624     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000625     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000626     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000627     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000628     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000629     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000630                                                                  034700      
000631                                                                  034800      
000632*================================================================ 034900      
000633*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000634*                                                               = 035100      
000635*  FUNCION                                                      = 035200      
000636*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000637*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000638*                                                               = 035500      
000639*================================================================ 035600      
000640                                                                  035700      
000641 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000642     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000643     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000644     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000645     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000646     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000647     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000648                                                                  036500      
000649*===============================================================  036600      
000650*                                                              =  036700      
000651*         ENTRY-POINT CONSISMEN                                =  036800      
000652*                                                              =  036900      
000653*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000654*                      SISTEMA                                 =  037100      
000655*                                                              =  037200      
000656*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000657*                                                              =  037400      
000658*===============================================================  037500      
000659 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000660     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000661     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000662     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000663     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000664     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000665     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000666     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000667     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000668     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000669     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000670     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000671     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000672     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000673     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000674     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000675        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000676        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000677        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000678        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000679        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000680        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000681        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000682                                                                  039900      
000683*=====================================================            040000      
000684*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000685*=====================================================            040200      
000686 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000687     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000688     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000689     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000690                                                                  040700      
000691*=====================================================            040800      
000692*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000693*=====================================================            041000      
000694 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000695     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000696     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000697     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000698                                                                  041500      
000699*=====================================================            041600      
000700*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000701*=====================================================            041800      
000702 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000703     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000704     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000705     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000706*=====================================================            042300      
000707*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000708*=====================================================            042500      
000709 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000710     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000711     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000712     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000713                                                                  043000      
000714*=====================================================            043100      
000715*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000716*=====================================================            043300      
000717 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000718     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000719     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000720     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000721                                                                  043800      
000722*=====================================================            043900      
000723*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000724*=====================================================            044100      
000725 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000726     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000727     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000728     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000729                                                                  044600      
000730*=====================================================            044700      
000731*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000732*=====================================================            044900      
000733 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000734     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000735     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000736     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000737                                                                  045400      
000738*=====================================================            045500      
000739*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000740*=====================================================            045700      
000741 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000742     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000743     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000744     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000745                                                                  046200      
000746*=====================================================            046300      
000747*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000748*=====================================================            046500      
000749 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000750     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000751     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000752     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000753                                                                  047000      
000754*=====================================================            047100      
000755*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000756*=====================================================            047300      
000757 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000758     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000759     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000760     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000761                                                                  047800      
000762*=====================================================            047900      
000763*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000764*=====================================================            048100      
000765 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000766     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000767     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000768     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000769                                                                  048600      
000770*=====================================================            048700      
000771*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000772*=====================================================            048900      
000773 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000774     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000775     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000776     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000777                                                                  049400      
000778*=====================================================            049500      
000779*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000780*=====================================================            049700      
000781 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000782     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000783     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000784     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000785     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000786     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000787     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000788     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000789     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000790     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000791     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000792                                                                  050900      
000793*=====================================================            051000      
000794*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000795*=====================================================            051200      
000796 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000797     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000798     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000799     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000800     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000801                                                                  051800      
000802*=====================================================            051900      
000803*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000804*=====================================================            052100      
000805 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000806     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000807     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000808     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000809     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000810                                                                  052700      
000811*=====================================================            052800      
000812*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000813*=====================================================            053000      
000814 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000815     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000816     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000817     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000818     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000819                                                                  053600      
000820*=====================================================            053700      
000821*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000822*=====================================================            053900      
000823 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000824     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000825     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000826     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000827     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000828                                                                  054500      
000829*=====================================================            054600      
000830*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000831*=====================================================            054800      
000832 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000833     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000834     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000835     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000836     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000837                                                                  055400      
000838*=====================================================            055500      
000839*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000840*=====================================================            055700      
000841 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000842     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000843     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000844     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000845     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000846                                                                  056300      
000847*=====================================================            056400      
000848*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000849*=====================================================            056600      
000850 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000851     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000852     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000853     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000854     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000855                                                                  057200      
000856 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000857*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000858*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000859* COPY "(S151)S151/FORMATO/ARCHIVO/MOVTOS ON CMEMP.".             008400      
000860                                                                  000100      
000861******************************************************************000200      
000862**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000863**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000864**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000865******************************************************************000600      
000866                                                                  000700      
000867 01 A00-R00-HDR-MOV .                                             000800      
000868    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000869    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000870    02 FILLER                          PIC  X(08).                001100      
000871    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000872    02 FILLER                          PIC  X(430).               001300      
000873                                                                  001400      
000874 01 A00-R01-REGMOV .                                              001500      
000875    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000876    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000877    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000878                                                                  001900      
000879    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000880    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000881                                       PIC  9(04)      COMP.      002200      
000882    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000883                                       PIC  9(04)      COMP.      002400      
000884                                                                  002500      
000885    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000886    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000887                                       PIC  9(02)      COMP.      002800      
000888    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000889                                       PIC  9(02)      COMP.      003000      
000890    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000891    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000892                                       A00-R01-SERVICIO-ALERTA.   003060      
000893       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000894       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000895    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000896    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000897    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000898                                       PIC  9(04)      COMP.      003420      
000899    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000900    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000901                                       PIC  9(04)      COMP.      003520      
000902    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000903    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000904    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000905                                       PIC  9(02)      COMP.      003900      
000906                                                                  004000      
000907    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000908    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000909       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000910          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000911          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000912          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000913          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000914          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000915          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000916          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000917                                                                  005100      
000918    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000919       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000920       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000921       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000922       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000923       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000924       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000925       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000926                                                                  006000      
000927       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000928       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000929       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000930       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000931       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000932       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000933       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000934                                                                  006800      
000935       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000936       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000937       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000938       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000939       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000940       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000941       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000942                                                                  007600      
000943       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000944       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000945       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000946       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000947       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000948       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000949       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000950                                                                  008400      
000951       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000952       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000953       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000954       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000955       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000956       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000957       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000958                                                                  009200      
000959    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000960    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000961    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000962    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000963    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000964    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000965       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000966    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000967    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000968    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000969    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000970    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000971    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000972    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000973    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000974       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000975       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000976    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000977    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000978    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000979    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000980    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000981    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000982    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000983    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000984    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000985    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000986    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000987    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000988    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000989    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000990                                       PIC X(10).                 012600      
000991    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000992       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000993       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000994    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000995    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000996    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000997    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000998       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000999       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
001000                                                                  013300      
001001    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
001002    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
001003                                       PIC  X(09).                013600      
001004    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
001005                                       PIC  9(18)      COMP.      013800      
001006    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
001007    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
001008                                       PIC  X(9).                 014100      
001009    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
001010    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
001011                                       PIC  X(05).                014400      
001012    03 A00-R01-NIO                     PIC  X(16).                014500      
001013    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
001014    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
001015    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
001016       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
001017    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
001018    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
001019       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
001020    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
001021    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
001022    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
001023    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
001024    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
001025    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
001026                                       PIC  X(04).                015900      
001027    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
001028    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
001029    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
001030                                       PIC  9(04)      COMP.      016300      
001031    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
001032    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
001033    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
001034    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
001035    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
001036                                                                  016900      
001037    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
001038    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
001039       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
001040    03 A00-R01-FILXAPL                 PIC X(165).                017300      
001041                                                                  017400      
001042    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
001043       05 FILLER                       PIC X(96).                 017510      
001044       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
001045       05 FILLER                       PIC X(67).                 017700      
001046                                                                  017702      
001047    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
001048       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
001049       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
001050       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
001051       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
001052       06 WKS-MOV-FILS084              PIC X(154).                017714      
001053                                                                  017800      
001054    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
001055       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
001056       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
001057       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
001058       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
001059       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
001060       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
001061       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
001062       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
001063       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018160      
001064       05 FILLER                       PIC X(62).                 018170      
001065       05 A00-R01-CTE-087              PIC X(07).                 018210      
001066       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
001067          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
001068          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
001069          07 FILLER                    PIC X(01).                 018281      
001070       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
001071       05 FILLER                       PIC X(61).                 018400      
001072                                                                  018500      
001073    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
001074       05 FILLER                       PIC  X(96).                018610      
001075       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
001076       05 FILLER                       PIC  X(65).                018630      
001077                                                                  018640      
001078    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
001079       05 A00-R01-FORMATO0             PIC  9(02).                018700      
001080       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
001081       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
001082       05 FILLER                       PIC  X(141).               018910      
001083                                                                  019100      
001084    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
001085       05 A00-R01-FORMATO1             PIC  9(02).                019300      
001086       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
001087       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
001088       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
001089       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
001090       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
001091       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
001092       05 A00-R01-ENTSAL               PIC  X(01).                020000      
001093       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
001094       05 FILLER                       PIC  X(69).                020200      
001095                                                                  020300      
001096    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
001097       05 A00-R01-FORMATO2             PIC  9(02).                020500      
001098       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
001099       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
001100       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
001101       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
001102       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
001103       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
001104       05 FILLER                       PIC  X(77).                021200      
001105                                                                  021300      
001106    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
001107       05 A00-R01-FORMATO3             PIC  9(02).                021500      
001108       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
001109       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
001110       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
001111       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
001112       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
001113       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
001114       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
001115       05 FILLER                       PIC  X(69).                022300      
001116                                                                  022400      
001117    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
001118       05 A00-R01-FORMATO4             PIC  9(02).                022600      
001119       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
001120       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
001121       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
001122       05 A00-R01-RFCFT04              PIC  X(13).                023000      
001123       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
001124       05 A00-R01-DIRECCION            PIC  X(40).                023200      
001125       05 FILLER                       PIC  X(85).                023300      
001126                                                                  023400      
001127    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
001128       05 A00-R01-COBERTURA            PIC  X(01).                023408      
001129       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
001130       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
001131       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
001132       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
001133       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
001134       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
001135       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
001136       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
001137       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
001138       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
001139       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
001140       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
001141       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
001142       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
001143       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
001144       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
001145       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
001146       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
001147       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
001148       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
001149       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
001150       05 FILLER                       PIC  X(05).                023492      
001151                                                                  023497      
001152    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
001153       05 A00-R01-4CEROS               PIC  9(04).                023600      
001154       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
001155       05 FILLER                       PIC  X(157).               023800      
001156                                                                  023900      
001157    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
001158       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
001159        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
001160       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
001161       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
001162       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
001163       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
001164       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
001165       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
001166       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
001167       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
001168       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
001169       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
001170       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
001171       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
001172       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
001173       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
001174       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
001175       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
001176       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
001177       05 A00-R01-FILLER               PIC  X(41).                025850      
001178       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
001179       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
001180       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
001181       05 A00-R01-INDPAGO              PIC  9(01).                026200      
001182       05 FILLER                       PIC  X(01).                026210      
001183       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
001184       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
001185       05 FILLER                       PIC  X(52).                026300      
001186                                                                  026400      
001187    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
001188       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
001189       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
001190       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
001191       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
001192       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
001193       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
001194       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
001195       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
001196       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
001197       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
001198       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
001199       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
001200       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
001201          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
001202          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
001203       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
001204       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
001205          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
001206       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
001207          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
001208       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
001209          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
001210       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
001211          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
001212       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
001213          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
001214       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
001215          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
001216       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
001217          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
001218       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
001219          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
001220       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
001221          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
001222       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
001223          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
001224          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
001225       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
001226       05 FILLER                       PIC X(01).                 030101      
001227       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
001228       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
001229       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
001230       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
001231       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
001232       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
001233       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
001234       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
001235          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
001236       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
001237       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
001238       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
001239       05 FILLER                       PIC X(14).                 030700      
001240                                                                  030800      
001241    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
001242       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
001243       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
001244       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
001245       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
001246       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
001247       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
001248       05 FILLER                       PIC  X(142).               031600      
001249                                                                  031700      
001250    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
001251       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
001252       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
001253       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
001254       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
001255       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
001256       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
001257       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
001258       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
001259       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
001260       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
001261          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
001262          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
001263          07 FILLER                    PIC  X(08).                032740      
001264       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
001265       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
001266       05 A00-R01-NOMORD               PIC  X(30).                033000      
001267       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
001268       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
001269       05 A00-R01-REF-CECO             PIC  X(07).                033500      
001270       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
001271       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
001272          A00-R01-NUM-ORD-PAGO.                                   033800      
001273          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
001274          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
001275                                                                  034100      
001276    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
001277       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
001278       05 A00-R01-RFC-S501             PIC  X(13).                034160      
001279       05 FILLER                       PIC  X(151).               034180      
001280                                                                  034190      
001281    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
001282       05 A00-R01-DATOS-S701           PIC X(116).                034300      
001283       05 A00-R01-PAG-SERV             REDEFINES                  034400      
001284                                       A00-R01-DATOS-S701.        034500      
001285          07 A00-R01-ID                PIC X(30).                 034600      
001286          07 A00-R01-FECREC            PIC 9(06).                 034700      
001287          07 A00-R01-REF1              PIC X(20).                 034800      
001288          07 A00-R01-REF2              PIC X(20).                 034900      
001289          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
001290          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
001291                                       A00-R01-TIPOPAGO.          035200      
001292             09 A00-R01-ESTAB          PIC 9(04).                 035300      
001293             09 A00-R01-SEQ            PIC 9(02).                 035400      
001294          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
001295          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
001296          07 A00-R01-EBPP              PIC 9(03).                 035700      
001297          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
001298          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
001299          07 FILLER                    PIC X(01).                 035728      
001300          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
001301          07 FILLER                    PIC X(18).                 035760      
001302       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
001303                                       A00-R01-DATOS-S701.        035900      
001304          07 A00-R01-RFC               PIC X(13).                 036000      
001305          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
001306          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
001307          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
001308          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
001309          07 FILLER                    PIC X(85).                 036200      
001310       05 FILLER                       PIC X(49).                 036300      
001311                                                                  036400      
001312    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
001313       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
001314       05 A00-R01-CTA-S702             PIC X(40).                 036700      
001315       05 FILLER                       PIC X(113).                036710      
001316                                                                  036720      
001317    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
001318       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
001319       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
001320       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
001321       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
001322       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
001323       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
001324       05 FILLER                       PIC X(72).                 036800      
001325                                                                  036810      
001326                                                                  036820      
001327    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
001328       05 A00-R01-TRUI-S711.                                      036915      
001329          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
001330          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
001331          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
001332           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
001333          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
001334       05 A00-R01-MICR-S711.                                      036945      
001335          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
001336          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
001337          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
001338          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
001339          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
001340          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
001341          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
001342          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
001343       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
001344       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
001345       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
001346       05 A00-R01-FIL-S711             PIC X(05).                 036965      
001347       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
001348       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
001349       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
001350                                                                  036990      
001351    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
001352       05 A00-R01-RFC-502              PIC  X(13).                037100      
001353       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
001354          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
001355          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
001356          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
001357          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
001358          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
001359          07 FILLER                    PIC  9(01) COMP.           037650      
001360       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
001361       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
001362       05 FILLER                       PIC  X(06).                038680      
001363                                                                  038682      
001364    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
001365       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
001366       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
001367       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
001368       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
001369       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
001370       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
001371       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
001372       05 FILLER                       PIC  X(81).                038750      
001373                                                                  038755      
001374    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
001375       05 A00-R01-COP                  PIC  9(13)        .        038900      
001376       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
001377       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
001378       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
001379       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
001380       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
001381       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
001382       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
001383       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
001384       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
001385       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
001386       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
001387       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
001388       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
001389       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
001390       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
001391       05 FILLER                       PIC  X(81)        .        040800      
001392                                                                  040810      
001393    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
001394       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
001395       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
001396       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
001397       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
001398       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
001399       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
001400       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
001401       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
001402       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
001403       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
001404       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
001405       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
001406       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
001407       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
001408       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
001409       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
001410       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
001411       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
001412       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
001413       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
001414       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
001415       05 FILLER                       PIC  X(18).                041040      
001416                                                                  041400      
001417    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
001418    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
001419*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001420*COPY "(S151)S151/FORMATO/DISPLAY ON CMEMP.".                     008500      
001421 01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                        008600      
001422                                                                  008700      
001423***************************************************************   008800      
001424*          LIBRERIA CTLVERS       ( S006)                     *   008900      
001425***************************************************************   009000      
001426 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   009100      
001427 01  WKS-CTLVERS-TITULO              PIC X(72).                   009200      
001428 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           009300      
001429                                                                  009400      
001430 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   009500      
001431 01  WKS-CTLVERS-LIBID               PIC X(12).                   009600      
001432 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             009700      
001433     03 WKS-LIBID-NOMB               PIC X(09).                   009800      
001434     03 WKS-LIBID-SIST               PIC X(03).                   009900      
001435                                                                  010000      
001436***************************************************************   010100      
001437*          LIBRERIA SOPORTECOMS                               *   010200      
001438***************************************************************   010300      
001439 01  WKS-DATOSHOST.                                               010400      
001440     02 WKS-DH-NUMCSI                PIC 9(02).                   010500      
001441     02 WKS-DH-NOMEQUIPO             PIC X(10).                   010600      
001442     02 WKS-DH-NOMCSI                PIC X(26).                   010700      
001443     02 WKS-DH-LINEABATCH            PIC X(05).                   010800      
001444                                                                  010900      
001445******************************************************************011000      
001446*            NOMBRE DE LOS ARCHIVOS                              *011100      
001447******************************************************************011200      
001448 01 WKS-TIT-REP.                                                  011300      
001449     02  FILLER               PIC X(10) VALUE "(S151)S151".       011400      
001450     02  FILLER               PIC X(14) VALUE "/FILE/MOVS264/".   011500      
001451     02  WS-FEC-LOG           PIC 9(06).                          011600      
001452     02  FILLER               PIC X(04) VALUE " ON ".             011700      
001453     02  WS-PACK-LOG          PIC X(17).                          011800      
001454     02  FILLER               PIC X(01) VALUE ".".                011900      
001455                                                                  012000      
001456******************************************************************012100      
001457*                NOMBRES DE BACKUPS                              *012200      
001458******************************************************************012300      
001459 01  WKS-TIT-BITACORA.                                            012400      
001460     02  FILLER                     PIC X(15)   VALUE             012500      
001461                                    "S264/LIST/P128/".            012600      
001462     02  WS-CENTRO-IMPRESION        PIC 9(02).                    012700      
001463     02  FILLER                     PIC X(08)   VALUE "00/R000/". 012800      
001464     02  WKS-TB-FECHA               PIC 9(06).                    012900      
001465     02  FILLER                     PIC X(1)    VALUE "/".        013000      
001466     02  WKS-TB-MIX                 PIC 9(07).                    013100      
001467     02  FILLER                     PIC X(1)    VALUE "/".        013200      
001468     02  WS-TB-NOMBRE.                                            013300      
001469         04 FILLER                  PIC X(07)   VALUE "001S151".  013400      
001470         04 FILLER                  PIC X(07)   VALUE "DIFS264".  013500      
001471         04 FILLER                  PIC X(1)    VALUE ".".        013600      
001472                                                                  013700      
001473******************************************************************013800      
001474*            VARIABLES MISCELANEAS                               *013900      
001475******************************************************************014000      
001476 01 WKS-TABLA-P028.                                               014100      
001477    03 WKS-T-P028-PARE OCCURS 5000 TIMES.                         014200      
001478       04 WKS-CVETRAN-028         PIC 9(04)    COMP.              014300      
001479       04 WKS-IMPORTE-028         PIC 9(16)V99 COMP.              014400      
001480                                                                  014500      
001481 01 WKS-TABLA-P115.                                               014600      
001482    03 WKS-T-P115-PARE OCCURS 5000 TIMES.                         014700      
001483       04 WKS-CVETRAN-115         PIC 9(04)    COMP.              014800      
001484       04 WKS-IMPORTE-115         PIC 9(16)V99 COMP.              014900      
001485                                                                  015000      
001486 77 W77-REFNUM                            PIC 9(20) COMP.         015100      
001487 77 W77-MONEDA                            PIC 9(04) COMP.         015200      
001488 77 W77-SUC-INIC                          PIC 9(04) COMP.         015300      
001489 77 W77-SUC-PROM                          PIC 9(04) COMP.         015400      
001490 77 W77-EOF                               PIC 9.                  015500      
001491 77 W77-CSI-PROCESO                       PIC 9(02).              015600      
001492 77 W77-SIST-PARAM                        PIC 9(03).              015700      
001493 77 W77-RESULT                            PIC S9(11) BINARY.      015800      
001494 77 W77-J                                 PIC 9(06).              015900      
001495 77 W77-028                               PIC 9(04).              016000      
001496 77 W77-115                               PIC 9(04).              016100      
001497 77 W77-TOT-IMP028                        PIC 9(16)V99 COMP.      016200      
001498 77 W77-TOT-IMP115                        PIC 9(16)V99 COMP.      016300      
001499 77 W77-MAL-115                           PIC 9(18)V99 COMP.      016400      
001500 77 W77-MAL-028                           PIC 9(18)V99 COMP.      016500      
001501 77 W77-TOT-BIEN                          PIC 9(18)V99 COMP.      016600      
001502*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001503* COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."         016700      
001504*                                  FROM 000100 TO 099999      .   016750      
001505                                                                  000100      
001506*----------------------------------------------------------------*000200      
001507*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *000300      
001508*----------------------------------------------------------------*000400      
001509 77  W77-FRAMESIZE                PIC  9(002) COMP.               000500      
001510 77  W77-LASTRECORD               PIC  9(012) COMP.               000600      
001511 77  W77-MAXRECSIZE               PIC  9(012) COMP.               000700      
001512 77  W77-DISK-SIZE                PIC  9(018) COMP.               000800      
001513 77  W77-MEMORY-SIZE              PIC  9(018) COMP.               000900      
001514                                                                  001000      
001515 01  WS-CALC-WORD                 PIC  9(012)V99.                 001100      
001516 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                   001200      
001517     02 WS-WORD-ENT               PIC  9(012).                    001300      
001518     02 WS-WORD-RES               PIC  9(002).                    001400      
001519                                                                  001500      
001520*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001521******************************************************************016800      
001522*                CAMPOS DE FECHAS Y HORAS                        *016900      
001523******************************************************************017000      
001524 01  WKS-FECHA-COMP               PIC 9(08).                      017100      
001525 01  WKS-FECHA-COMP-R      REDEFINES WKS-FECHA-COMP.              017200      
001526     02  WKS-FECHA-COMP-AA        PIC 9(04).                      017300      
001527     02  WKS-FECHA-COMP-MM        PIC 9(02).                      017400      
001528     02  WKS-FECHA-COMP-DD        PIC 9(02).                      017500      
001529                                                                  017600      
001530*01  WKS-HORA-COMP-HHMMSS         PIC 9(06).                      017700      
001531*01  WKS-HORA-COMP-HHMMSS-R REDEFINES WKS-HORA-COMP-HHMMSS.       017800      
001532*    02  WKS-HORA-COMP-HH         PIC 9(02).                      017900      
001533*    02  WKS-HORA-COMP-MM         PIC 9(02).                      018000      
001534*    02  WKS-HORA-COMP-SS         PIC 9(02).                      018100      
001535                                                                  018200      
001536 01  WKS-HORA-COMPILACION.                                        018300      
001537     02  WKS-HORA-COMP            PIC 9(13).                      018400      
001538     02  FILLER                   PIC X(187).                     018500      
001539 01  WKS-FECHA-COMPILACION        PIC 9(06).                      018600      
001540 01  WKS-FEC-COMPILACION-R REDEFINES WKS-FECHA-COMPILACION.       018700      
001541     02  WKS-FEC-COMPIL-MM        PIC 9(02).                      018800      
001542     02  WKS-FEC-COMPIL-DD        PIC 9(02).                      018900      
001543     02  WKS-FEC-COMPIL-AA        PIC 9(02).                      019000      
001544                                                                  019100      
001545 01  WKS-COMPIL-AAMMDD.                                           019200      
001546     02  WKS-COMPIL-AA            PIC 9(02).                      019300      
001547     02  WKS-COMPIL-MM            PIC 9(02).                      019400      
001548     02  WKS-COMPIL-DD            PIC 9(02).                      019500      
001549                                                                  019600      
001550 01 WKS-FECHA-MAQ                         PIC 9(08).              019700      
001551 01 WKS-FECHA-MAQ-R REDEFINES WKS-FECHA-MAQ.                      019800      
001552     03 WKS-FM-AMO                        PIC 9(4).               019900      
001553     03 WKS-FM-MES                        PIC 9(2).               020000      
001554     03 WKS-FM-DIA                        PIC 9(2).               020100      
001555                                                                  020200      
001556 01 WKS-FECHA-PROCESO                     PIC 9(08).              020300      
001557 01 WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.              020400      
001558    03 WKS-FP-XXX                         PIC 9(2).               020500      
001559    03 WKS-FECA6                          PIC 9(6).               020600      
001560                                                                  020700      
001561 01 WS-FECHA-TEMP                         PIC 9(08).              020800      
001562 01 WS-FECHA-TEMP-R REDEFINES WS-FECHA-TEMP.                      020900      
001563    03 WS-DIA-TEMP                        PIC 9(2).               021000      
001564    03 WS-MES-TEMP                        PIC 9(2).               021100      
001565    03 WS-AMO-TEMP                        PIC 9(4).               021200      
001566                                                                  021300      
001567 01 WKS-HORA-MAQ                          PIC 9(08).              021400      
001568 01 WKS-HORA-MAQ-R REDEFINES WKS-HORA-MAQ.                        021500      
001569    03 WKS-HORA-HHMMSS                    PIC 9(02).              021600      
001570    03 WKS-MINU-HHMMSS                    PIC 9(02).              021620      
001571    03 WKS-SEGU-HHMMSS                    PIC 9(02).              021640      
001572    03 FILLER                             PIC 9(02).              021700      
001573 01 WKS-HORAM-MAQ-R REDEFINES WKS-HORA-MAQ.                       021800      
001574    03 WKS-HORA-HHMM                      PIC 9(02).              021900      
001575    03 WKS-MINU-HHMM                      PIC 9(02).              022000      
001576    03 FILLER                             PIC 9(04).              022100      
001577                                                                  022200      
001578***************************************************************   022300      
001579*           REPORTE DE BITACORA                               *   022400      
001580***************************************************************   022500      
001581 01 WSR-ENCAB-1.                                                  022600      
001582    03 FILLER                             PIC X(10) VALUE         022700      
001583       "S151-P128-".                                              022800      
001584    03 WSR-RB-E1-NOMB-REPORTE             PIC X(16) VALUE SPACES. 022900      
001585    03 FILLER                             PIC X(14) VALUE SPACES. 023000      
001586    03 FILLER                             PIC X(42) VALUE         023100      
001587       "ADMINISTRACION  DE  SALDOS  Y  MOVIMIENTOS".              023200      
001588    03 FILLER                             PIC X(14) VALUE SPACES. 023300      
001589    03 FILLER                             PIC X(26) VALUE         023400      
001590       "FECHA DE LA INFORMACION : ".                              023500      
001591    03 WSR-RB-E1-FECHA-INF                PIC 9999/99/99.         023600      
001592                                                                  023700      
001593 01 WSR-ENCAB-2.                                                  023800      
001594     03 FILLER                          PIC X(11) VALUE           023900      
001595        "F.PROCESO: ".                                            024000      
001596     03 WSR-RB-E2-FECHA-PROC            PIC 9999/99/99.           024100      
001597     03 FILLER                          PIC X(01) VALUE SPACES.   024200      
001598     03 WSR-RB-E2-HORA-TIT              PIC 9(02).                024300      
001599     03 FILLER                          PIC X(01) VALUE ":".      024320      
001600     03 WSR-RB-E2-MINU-TIT              PIC 9(02).                024340      
001601     03 FILLER                          PIC X(01) VALUE ":".      024360      
001602     03 WSR-RB-E2-SEGU-TIT              PIC 9(02).                024380      
001603     03 FILLER                          PIC X(06) VALUE SPACES.   024400      
001604     03 WSR-RB-E2-TITULO                PIC X(50) VALUE SPACES.   024500      
001605     03 FILLER                          PIC X(10) VALUE SPACES.   024600      
001606     03 FILLER                          PIC X(14) VALUE           024700      
001607        "TIPO PROCESO: ".                                         024800      
001608     03 WSR-RB-E2-TIPO-PROC               PIC X(13) VALUE SPACES. 024900      
001609                                                                  025000      
001610 01 WSR-ENCAB-3.                                                  025100      
001611     03 FILLER                         PIC X(117) VALUE SPACES.   025200      
001612     03 FILLER                         PIC X(07) VALUE "HOJA : ". 025300      
001613     03 WSR-RB-E3-HOJA                 PIC ZZZZZ9.                025400      
001614                                                                  025500      
001615 01 WSR-ENCAB-4.                                                  025600      
001616     03 FILLER                  PIC X(03) VALUE SPACES.           025700      
001617     03 FILLER                  PIC X(8)  VALUE "PRODUCTO".       025800      
001618     03 FILLER                  PIC X(1)  VALUE SPACES.           025900      
001619     03 FILLER                  PIC X(08) VALUE "AUTORIZA".       026000      
001620     03 FILLER                  PIC X(03) VALUE SPACES.           026100      
001621     03 FILLER                  PIC X(10) VALUE "CVE.   MON".     026200      
001622     03 FILLER                  PIC X(02) VALUE SPACES.           026300      
001623     03 FILLER                  PIC X(11) VALUE " REFERENCIA".    026400      
001624     03 FILLER                  PIC X(07) VALUE SPACES.           026500      
001625     03 FILLER                  PIC X(13)                         026600      
001626                                   VALUE "I M P O R T E".         026700      
001627     03 FILLER                  PIC X(02) VALUE SPACES.           026800      
001628     03 FILLER                  PIC X(09) VALUE "SUCURSAL ".      026900      
001629     03 FILLER                  PIC X(4)  VALUE "HORA".           027000      
001630     03 FILLER                  PIC X(2)  VALUE SPACES.           027100      
001631     03 FILLER                  PIC X(8)  VALUE "OPERADOR".       027200      
001632                                                                  027300      
001633 01 WSR-LINEA-DETALLE.                                            027400      
001634     03 WSR-LOCAL-FOR           PIC X(03)  VALUE SPACE.           027500      
001635     03 FILLER                  PIC X    VALUE SPACE.             027600      
001636     03 WSR-PRODUCTO            PIC ZZZZ.                         027700      
001637     03 FILLER                  PIC X    VALUE "-".               027800      
001638     03 WSR-INST                PIC Z9.                           027900      
001639     03 FILLER                  PIC X(1) VALUE SPACES.            028000      
001640     03 WSR-AUTORIZACION        PIC Z(7)9.                        028100      
001641     03 FILLER                  PIC X(3) VALUE SPACES.            028200      
001642     03 WSR-CVETRAN             PIC ZZZZ.                         028300      
001643     03 FILLER                  PIC X(4) VALUE SPACES.            028400      
001644     03 WSR-MONEDA              PIC Z(2).                         028500      
001645     03 FILLER                  PIC X(01) VALUE SPACES.           028600      
001646     03 WSR-REFERENCIA          PIC Z(12).                        028700      
001647     03 FILLER                  PIC X(01) VALUE SPACES.           028800      
001648     03 WSR-IMPORTE             PIC ZZZZZ,ZZZ,ZZZ,ZZ9.99.         028900      
001649     03 FILLER                  PIC X(05) VALUE SPACES.           029000      
001650     03 WSR-SUC-PROM            PIC Z(4).                         029100      
001651     03 FILLER                  PIC X(01) VALUE SPACES.           029200      
001652     03 WSR-HORA                PIC 9(02).                        029300      
001653     03 FILLER                  PIC X(01) VALUE ":".              029320      
001654     03 WSR-MINU                PIC 9(02).                        029340      
001655     03 FILLER                  PIC X(01) VALUE SPACES.           029400      
001656     03 WSR-OPERADOR            PIC Z(8).                         029500      
001657                                                                  029600      
001658 01  WSR-TOTALES.                                                 029700      
001659     03 FILLER                    PIC X(08) VALUE SPACES.         029800      
001660     03 WSR-TOT-MENS              PIC X(18).                      029900      
001661     03 FILLER                    PIC X(07) VALUE SPACES.         030000      
001662     03 WSR-TOT-S028              PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.       030100      
001663     03 FILLER                    PIC X(10) VALUE SPACES.         030200      
001664     03 WSR-TOT-S115              PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.       030300      
001665                                                                  030400      
001666 01 WSR-TOT-BITACORA.                                             030500      
001667    02 FILLER                     PIC X(08) VALUE SPACES.         030600      
001668    02 FILLER       PIC X(18) VALUE "T O T A L E S  :  ".         030700      
001669    02 FILLER                     PIC X(15) VALUE SPACES.         030800      
001670    02 FILLER       PIC X(09) VALUE " S 0 2 8 ".                  030900      
001671    02 FILLER                     PIC X(20) VALUE SPACES.         031000      
001672    02 FILLER       PIC X(09) VALUE " S 1 1 5 ".                  031100      
001673                                                                  031200      
001674****************************************************************  031300      
001675*                 CONTADORES DE HOJAS                          *  031400      
001676****************************************************************  031500      
001677 01 CONTADORES.                                                   031600      
001678    02 WS-NUM-HOJAS                   PIC 9(6) COMP VALUE 0.      031700      
001679    02 WS-NUM-LINEAS                  PIC 9(2) COMP VALUE 0.      031800      
001680                                                                  031900      
001681*COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".            032000      
001682/**************************************************************** 032100      
001683*             P R O C E D U R E     D I V I S I O N             * 032200      
001684***************************************************************** 032300      
001685 PROCEDURE DIVISION USING W77-SIST-PARAM.                         032400      
001686 000000-INICPROG SECTION.                                         032500      
001687 000000-PROGRAMA.                                                 032600      
001688*===============                                                  032700      
001689**   CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   032800      
001690**      "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          032900      
001691**                                                                033000      
001692**   MOVE "S151" TO SISTEMA-LJ.                                   033100      
001693**   MOVE "P128" TO PASO-LJ.                                      033200      
001694     PERFORM 10000-INICIO.                                        033300      
001695     PERFORM 20000-GENERA.                                        033400      
001696     STOP RUN.                                                    033500      
001697                                                                  033600      
001698 10000-INICIO SECTION.                                            033700      
001699 10000-INI.                                                       033800      
001700*======================                                           033900      
001701     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.034000      
001702     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            034100      
001703                                      "SOPORTECOMS".              034200      
001704     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               034300      
001705            TO BYFUNCTION.                                        034400      
001706                                                                  034500      
001707     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOSHOST              034600      
001708     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   034700      
001709     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    034800      
001710                                                                  034900      
001711     MOVE "S151L001CTL"         TO WKS-CTLVERS-LIBRERIA           035000      
001712     CALL "DAME_TIT IN CTRLVERS"                                  035100      
001713          USING WKS-CTLVERS-LIBRERIA, WKS-CTLVERS-TITULO          035200      
001714          GIVING WKS-CTLVERS-STATUS.                              035300      
001715                                                                  035400      
001716     IF WKS-CTLVERS-STATUS < 0                                    035500      
001717        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL"   TO           035600      
001718            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP."   035700      
001719     ELSE                                                         035800      
001720        CHANGE ATTRIBUTE TITLE OF "S151LIBCONTROL" TO             035900      
001721               WKS-CTLVERS-TITULO.                                036000      
001722                                                                  036100      
001723*    MOVE W77-SIST-PARAM                  TO WKS-B01-SISTEMA.     036200      
001724     MOVE 264                             TO WKS-B01-SISTEMA.     036300      
001725     MOVE 1                               TO WKS-B01-FUNCION.     036400      
001726     MOVE WKS-DH-NUMCSI                   TO WKS-B01-CSI.         036500      
001727                                                                  036600      
001728     CALL "CONSISDIA IN S151LIBCONTROL"                           036700      
001729          USING  WKS-S151B01SISDIA                                036800      
001730          GIVING W77-RESULT.                                      036900      
001731                                                                  037000      
001732     IF ATTRIBUTE VALUE OF MYSELF = 0                             037100      
001733        MOVE WKS-B01-FECPRO             TO WKS-FECHA-PROCESO      037200      
001734     ELSE                                                         037300      
001735        MOVE ATTRIBUTE VALUE OF MYSELF  TO WKS-FECHA-PROCESO.     037400      
001736     MOVE ATTRIBUTE STACKNO OF MYSELF   TO WKS-TB-MIX.            037500      
001737     MOVE "001S151DIFS264"              TO WSR-RB-E1-NOMB-REPORTE.037600      
001738     MOVE WKS-B01-NOMPACMOV             TO WS-PACK-LOG.           037700      
001739     MOVE WKS-FECA6                     TO WS-FEC-LOG             037800      
001740                                           WKS-TB-FECHA.          037900      
001741     MOVE WKS-DH-NUMCSI                 TO W77-CSI-PROCESO        038000      
001742                                           WS-CENTRO-IMPRESION.   038100      
001743     IF W77-CSI-PROCESO = 12    MOVE 10 TO W77-CSI-PROCESO        038200      
001744                                           WS-CENTRO-IMPRESION.   038300      
001745     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          038400      
001746             A2K-ACCEPT-TODAYS-DATE-EXIT.                         038500      
001747     PERFORM A2K-CONV-MDCA-TO-CAMD THRU                           038600      
001748             A2K-CONV-MDCA-TO-CAMD-EXIT.                          038700      
001749     PERFORM A2K-CONV-CAMD-TO-DMCA THRU                           038800      
001750             A2K-CONV-CAMD-TO-DMCA-EXIT.                          038900      
001751     MOVE A2K-FEC-DMCA-001 TO WS-FECHA-TEMP.                      039000      
001752     MOVE ZEROS TO A2K-FEC-CCAA-001.                              039100      
001753     MOVE WS-AMO-TEMP                     TO A2K-FEC-CCAA-001     039200      
001754                                             WKS-FM-AMO.          039300      
001755     MOVE WS-MES-TEMP                     TO WKS-FM-MES.          039400      
001756     MOVE WS-DIA-TEMP                     TO WKS-FM-DIA.          039500      
001757     ACCEPT WKS-HORA-MAQ                  FROM TIME.              039600      
001758**********************************                                039700      
001759*  FECHA Y HORA DE COMPILACION                                    039800      
001760**********************************                                039900      
001761     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP"                    040000      
001762                                   TO BYFUNCTION.                 040100      
001763     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP"                    040200      
001764                                   TO "LOCSUP".                   040300      
001765                                                                  040400      
001766     MOVE ATTRIBUTE NAME OF MYSELF TO WKS-HORA-COMPILACION.       040500      
001767                                                                  040600      
001768     CALL "CONVERT-DATE IN LOCSUP"                                040700      
001769          USING WKS-HORA-COMPILACION WKS-FECHA-COMPILACION.       040800      
001770                                                                  040900      
001771     MOVE WKS-FEC-COMPIL-AA               TO WKS-COMPIL-AA.       041000      
001772     MOVE WKS-FEC-COMPIL-MM               TO WKS-COMPIL-MM.       041100      
001773     MOVE WKS-FEC-COMPIL-DD               TO WKS-COMPIL-DD.       041200      
001774     MOVE WKS-COMPIL-AAMMDD               TO A2K-FEC-AMD-001.     041300      
001775     PERFORM A2K-CONV-AMD-TO-CAMD THRU                            041400      
001776             A2K-CONV-AMD-TO-CAMD-EXIT.                           041500      
001777     MOVE A2K-FEC-CAMD-001                TO WKS-FECHA-COMP.      041600      
001778                                                                  041700      
001779*    COMPUTE WKS-HORA-COMP = WKS-HORA-COMP / 60.                  041800      
001780*    COMPUTE WKS-HORA-COMP-HH    =                                041900      
001781*            FUNCTION DIV (WKS-HORA-COMP, 3600 ).                 042000      
001782*    COMPUTE W77-028          =                                   042100      
001783*            FUNCTION DIV (WKS-HORA-COMP, 60 ).                   042200      
001784*    COMPUTE WKS-HORA-COMP-MM    =                                042300      
001785*            FUNCTION MOD (W77-028   , 60 ).                      042400      
001786*    COMPUTE WKS-HORA-COMP-SS    =                                042500      
001787*            FUNCTION MOD (WKS-HORA-COMP, 60 ).                   042600      
001788                                                                  042700      
001789     OPEN INPUT A01-MOVS264.                                      042800      
001790     SET V01-BITACORA(USERBACKUPNAME)     TO VALUE TRUE.          042900      
001791     READ A01-MOVS264 INTO A00-R01-REGMOV AT END                  043000      
001792                           MOVE 1         TO W77-EOF.             043100      
001793******************************************************************043200      
001794*                 GENERACION DEL BITACORA SORTEADA POR REFERNUM  *043300      
001795******************************************************************043400      
001796 20000-GENERA SECTION.                                            043500      
001797 20000-GEN-BITACORA.                                              043600      
001798*======================                                           043700      
001799     MOVE 48                      TO W77-FRAMESIZE                043715      
001800     MOVE 120                     TO W77-MAXRECSIZE               043725      
001801     COMPUTE W77-LASTRECORD       =                               043735      
001802            (ATTRIBUTE LASTRECORD OF A01-MOVS264                  043740      
001803                            +   1)                                043745      
001804                                                                  043750      
001805     PERFORM 70000-CALCULA-ESPACIO.                               043755      
001806     SORT S01-MOVTOS                                              043800      
001807           ON ASCENDING KEY S01-MONEDA                            043900      
001808                            S01-SUC-INIC                          044000      
001809                            S01-REFNUM                            044100      
001810                            S01-CVETRAN                           044200      
001811          MEMORY SIZE  W77-MEMORY-SIZE WORDS                      044300      
001812          DISK   SIZE  W77-DISK-SIZE   WORDS                      044400      
001813          INPUT  PROCEDURE 30000-ESCOGE-MOV                       044500      
001814          OUTPUT PROCEDURE 40000-REPORTA-MOV.                     044600      
001815     GO TO 20001-EXIT.                                            044700      
001816                                                                  044800      
001817*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001818*    COPY "(S151)S151/SOURCE/COPY/TOSORT/01MTP001 ON CMEMP."      044820      
001819*                                     FROM 100000 TO 999999.      044840      
001820                                                                  100000      
001821*----------------------------------------------------------------*100100      
001822*   PROCEDIMIENTO DE CALCULO DINAMICO DE ESPACIO PARA EL SORT    *100200      
001823*----------------------------------------------------------------*100300      
001824 70000-CALCULA-ESPACIO.                                           100400      
001825*======================                                           100500      
001826     IF W77-FRAMESIZE             =   8                           100600      
001827        COMPUTE WS-CALC-WORD      =   W77-MAXRECSIZE              100700      
001828                                  /   6                           100800      
001829        IF WS-WORD-RES            >   ZEROS                       100900      
001830           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                 101000      
001831                                  +   1                           101100      
001832        ELSE                                                      101200      
001833           COMPUTE W77-MAXRECSIZE =   WS-WORD-ENT                .101300      
001834                                                                  101400      
001835     COMPUTE W77-MEMORY-SIZE ROUNDED                              101500      
001836                                  =   (W77-MAXRECSIZE + 3)        101600      
001837                                  *   2000                        101700      
001838                                  +   1500                        101800      
001839                                                                  101900      
001840     COMPUTE W77-DISK-SIZE ROUNDED                                102000      
001841                                  =   W77-MAXRECSIZE              102100      
001842                                  *   W77-LASTRECORD              102200      
001843                                  *   3.5                        .102300      
001844                                                                  102400      
001845*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001846                                                                  044860      
001847 20001-EXIT.                                                      044900      
001848     EXIT.                                                        045000      
001849                                                                  045100      
001850 30000-ESCOGE-MOV SECTION.                                        045200      
001851 30100-ESCOGE.                                                    045300      
001852     MOVE ZEROES                  TO W77-EOF.                     045400      
001853     PERFORM 30200-LEE-MOVS264 UNTIL W77-EOF > 0.                 045500      
001854                                                                  045600      
001855 30200-LEE-MOVS264.                                               045700      
001856     READ A01-MOVS264 INTO  A00-R01-REGMOV  AT END                045800      
001857          MOVE 1                  TO W77-EOF.                     045900      
001858     IF A00-R01-FUNCION = 99                                      046000      
001859          MOVE 1                  TO W77-EOF                      046100      
001860     ELSE                                                         046200      
001861          IF A00-R01-FUNCION = 1 AND A00-R01-STATUS = 1           046300      
001862             IF A00-R01-ORIGEN  = 1 OR 2                          046400      
001863                PERFORM 30300-ALSORT.                             046500      
001864                                                                  046600      
001865 30300-ALSORT.                                                    046700      
001866      MOVE A00-R01-AUT-S151     TO S01-AUT-S151.                  046800      
001867      MOVE A00-R01-FUNCION      TO S01-FUNCION.                   046900      
001868      MOVE A00-R01-SISTEMA      TO S01-SISTEMA.                   047000      
001869      MOVE A00-R01-PRODUCTO     TO S01-PRODUCTO.                  047100      
001870      MOVE A00-R01-INSTRUMENTO  TO S01-INSTRUMENTO.               047200      
001871      MOVE A00-R01-SUCPROM      TO S01-SUCPROM.                   047300      
001872      MOVE A00-R01-CONTRATO     TO S01-CONTRATO.                  047400      
001873      MOVE A00-R01-FECMOV       TO S01-FECMOV.                    047500      
001874      MOVE A00-R01-HORMOV       TO S01-HORMOV.                    047600      
001875      MOVE A00-R01-FECCONT      TO S01-FECCONT.                   047700      
001876      MOVE A00-R01-FECVAL       TO S01-FECVAL.                    047800      
001877      MOVE A00-R01-AUTORIZA     TO S01-AUTORIZA.                  047900      
001878      MOVE A00-R01-AUT3ER       TO S01-AUT3ER.                    048000      
001879      MOVE A00-R01-REFNUM       TO S01-REFNUM.                    048100      
001880      MOVE A00-R01-CVEMDA       TO S01-CVEMDA.                    048200      
001881      MOVE A00-R01-NUMMDA       TO S01-NUMMDA.                    048300      
001882      MOVE A00-R01-CVEMDE       TO S01-CVEMDE.                    048400      
001883      MOVE A00-R01-SUC-INIC     TO S01-SUC-INIC.                  048500      
001884      MOVE A00-R01-CAJA-INIC    TO S01-CAJA-INIC.                 048600      
001885      MOVE A00-R01-SUCOPER      TO S01-SUCOPER.                   048700      
001886      MOVE A00-R01-CAJAOPER     TO S01-CAJAOPER.                  048800      
001887      MOVE A00-R01-SUCTRAN      TO S01-SUCTRAN.                   048900      
001888      MOVE A00-R01-CAJATRAN     TO S01-CAJATRAN.                  049000      
001889      MOVE A00-R01-NOMINA-OPE   TO S01-NOMINA-OPE.                049100      
001890      MOVE A00-R01-ORIGEN       TO S01-ORIGEN.                    049200      
001891      MOVE A00-R01-NODO-ORIG    TO S01-NODO-ORIG.                 049300      
001892      MOVE A00-R01-MONEDA       TO S01-MONEDA.                    049400      
001893      MOVE A00-R01-AUT-S151     TO S01-AUT-S151.                  049500      
001894      MOVE A00-R01-AUT-AELIM-S151  TO S01-AUT-AELIM-S151.         049600      
001895      MOVE A00-R01-AUT-ANT-S151    TO S01-AUT-ANT-S151.           049700      
001896      MOVE A00-R01-TIPO-PROC    TO S01-TIPO-PROC.                 049800      
001897      MOVE A00-R01-SOBREGIRO    TO S01-SOBREGIRO.                 049900      
001898      MOVE A00-R01-CVEAVISO     TO S01-CVEAVISO.                  050000      
001899      MOVE ZERO                 TO S01-ACTIVIDAD.                 050100      
001900      MOVE A00-R01-SECTOR       TO S01-SECTOR.                    050200      
001901      MOVE A00-R01-BANCA        TO S01-BANCA.                     050300      
001902      MOVE A00-R01-IND-EDOCTA   TO S01-IND-EDOCTA.                050400      
001903      MOVE A00-R01-IND-CONTA    TO S01-IND-CONTA.                 050500      
001904      MOVE A00-R01-IND-NUMREN   TO S01-IND-NUMREN.                050600      
001905      MOVE A00-R01-APUDES       TO S01-APUDES.                    050700      
001906      MOVE A00-R01-STATUS       TO S01-STATUS.                    050800      
001907      IF A00-R01-CVETRAN1 < 2000                                  050900      
001908         MOVE A00-R01-CVETRAN1  TO S01-CVETRAN                    051000      
001909         MOVE A00-R01-IMPORTE1  TO S01-IMPORTE                    051100      
001910         RELEASE S01-REGMOV.                                      051200      
001911      IF A00-R01-CVETRAN2 < 2000                                  051300      
001912         MOVE A00-R01-CVETRAN2  TO S01-CVETRAN                    051400      
001913         MOVE A00-R01-IMPORTE2  TO S01-IMPORTE                    051500      
001914         RELEASE S01-REGMOV.                                      051600      
001915      IF A00-R01-CVETRAN3 < 2000                                  051700      
001916         MOVE A00-R01-CVETRAN3  TO S01-CVETRAN                    051800      
001917         MOVE A00-R01-IMPORTE3  TO S01-IMPORTE                    051900      
001918         RELEASE S01-REGMOV.                                      052000      
001919      IF A00-R01-CVETRAN4 < 2000                                  052100      
001920         MOVE A00-R01-CVETRAN4  TO S01-CVETRAN                    052200      
001921         MOVE A00-R01-IMPORTE4  TO S01-IMPORTE                    052300      
001922         RELEASE S01-REGMOV.                                      052400      
001923      IF A00-R01-CVETRAN5 < 2000                                  052500      
001924         MOVE A00-R01-CVETRAN5  TO S01-CVETRAN                    052600      
001925         MOVE A00-R01-IMPORTE5  TO S01-IMPORTE                    052700      
001926         RELEASE S01-REGMOV.                                      052800      
001927                                                                  052900      
001928 40000-REPORTA-MOV SECTION.                                       053000      
001929 40000-REPORTE.                                                   053100      
001930     OPEN OUTPUT V01-BITACORA.                                    053200      
001931     PERFORM 42000-IMPRIMIR.                                      053300      
001932     GO TO 40999-EXIT.                                            053400      
001933                                                                  053500      
001934 42000-IMPRIMIR.                                                  053600      
001935     MOVE 0                     TO W77-EOF.                       053700      
001936     MOVE 0                     TO W77-028, W77-115.              053800      
001937                                                                  053900      
001938     RETURN S01-MOVTOS AT END                                     054000      
001939          MOVE 1                          TO W77-EOF.             054100      
001940     MOVE S01-REFNUM                      TO W77-REFNUM.          054200      
001941     MOVE S01-MONEDA                      TO W77-MONEDA.          054300      
001942     MOVE S01-SUC-INIC                    TO W77-SUC-INIC.        054400      
001943     MOVE S01-SUCPROM                     TO W77-SUC-PROM.        054500      
001944     MOVE "    DIFERENCIAS DEL S264 ENTRE EL S028 Y S115     "    054600      
001945                                          TO WSR-RB-E2-TITULO     054700      
001946     MOVE WKS-FECHA-MAQ                   TO WSR-RB-E2-FECHA-PROC 054800      
001947     MOVE WKS-FECHA-PROCESO               TO WSR-RB-E1-FECHA-INF  054900      
001948     MOVE "DIARIO"                        TO WSR-RB-E2-TIPO-PROC  055000      
001949     MOVE WKS-HORA-HHMMSS                 TO WSR-RB-E2-HORA-TIT   055100      
001950     MOVE WKS-MINU-HHMMSS                 TO WSR-RB-E2-MINU-TIT   055120      
001951     MOVE WKS-SEGU-HHMMSS                 TO WSR-RB-E2-SEGU-TIT   055140      
001952                                                                  055200      
001953     PERFORM 41110-IMP-ENCAB                                      055300      
001954     PERFORM 41500-MUEVE-DATOS.                                   055400      
001955     PERFORM 41000-GEN-BITACORA UNTIL W77-EOF > 0.                055500      
001956     PERFORM 42000-TOTALES.                                       055600      
001957     CLOSE V01-BITACORA.                                          055700      
001958     CLOSE A01-MOVS264.                                           055800      
001959                                                                  055900      
001960 41000-GEN-BITACORA.                                              056000      
001961*=====================                                            056100      
001962     IF S01-REFNUM = W77-REFNUM  AND                              056200      
001963        S01-MONEDA = W77-MONEDA  AND                              056300      
001964        S01-SUC-INIC = W77-SUC-INIC                               056400      
001965       PERFORM 46420-ACUMULA                                      056500      
001966     ELSE                                                         056600      
001967       PERFORM 46430-IMPRIME                                      056700      
001968       PERFORM 46420-ACUMULA.                                     056800      
001969     RETURN S01-MOVTOS   AT END MOVE 1 TO W77-EOF.                056900      
001970                                                                  057000      
001971 46420-ACUMULA.                                                   057100      
001972   IF S01-CVETRAN > 0 AND S01-CVETRAN < 1000                      057200      
001973       ADD  1              TO W77-028                             057300      
001974       ADD  S01-IMPORTE    TO W77-TOT-IMP028                      057400      
001975       MOVE S01-IMPORTE    TO WKS-IMPORTE-028(W77-028)            057500      
001976       MOVE S01-CVETRAN    TO WKS-CVETRAN-028(W77-028)            057600      
001977    ELSE                                                          057700      
001978      IF S01-CVETRAN > 999 AND S01-CVETRAN < 2999                 057800      
001979       ADD  1              TO W77-115                             057900      
001980       ADD  S01-IMPORTE    TO W77-TOT-IMP115                      058000      
001981       MOVE S01-IMPORTE    TO WKS-IMPORTE-115(W77-115)            058100      
001982       MOVE S01-CVETRAN    TO WKS-CVETRAN-115(W77-115).           058200      
001983                                                                  058300      
001984 46430-IMPRIME.                                                   058400      
001985    IF W77-TOT-IMP028 = W77-TOT-IMP115                            058500      
001986       ADD W77-TOT-IMP028   TO W77-TOT-BIEN                       058600      
001987    ELSE                                                          058700      
001988       IF W77-028 > ZEROS                                         058800      
001989          PERFORM 26450-IMP-028 VARYING W77-J FROM 1 BY 1         058900      
001990             UNTIL (W77-J > W77-028)                              059000      
001991          PERFORM 26460-IMP-115 VARYING W77-J FROM 1 BY 1         059100      
001992             UNTIL (W77-J > W77-115)                              059200      
001993          MOVE SPACES TO V01-R01-BITACORA                         059300      
001994          WRITE V01-R01-BITACORA                                  059400      
001995          ADD 1               TO WS-NUM-LINEAS                    059500      
001996          ADD W77-TOT-IMP028  TO W77-MAL-028                      059600      
001997          ADD W77-TOT-IMP115  TO W77-MAL-115.                     059700      
001998    MOVE ZEROES               TO W77-TOT-IMP028, W77-TOT-IMP115.  059800      
001999    MOVE ZEROES               TO W77-115, W77-028.                059900      
002000    MOVE S01-REFNUM           TO W77-REFNUM.                      060000      
002001    MOVE S01-SUCPROM          TO W77-SUC-PROM.                    060100      
002002    MOVE S01-SUC-INIC         TO W77-SUC-INIC.                    060200      
002003    MOVE S01-MONEDA           TO W77-MONEDA.                      060300      
002004    PERFORM 41500-MUEVE-DATOS.                                    060400      
002005                                                                  060500      
002006 41500-MUEVE-DATOS.                                               060600      
002007*==================                                               060700      
002008     MOVE 0                               TO WSR-AUTORIZACION     060800      
002009                                             WSR-PRODUCTO         060900      
002010                                             WSR-INST             061000      
002011                                             WSR-MONEDA           061100      
002012                                             WSR-IMPORTE          061200      
002013                                             WSR-SUC-PROM         061300      
002014                                             WSR-HORA             061400      
002015                                             WSR-MINU             061450      
002016                                             WSR-OPERADOR         061500      
002017                                             WSR-CVETRAN          061600      
002018                                             WSR-REFERENCIA       061700      
002019                                                                  061800      
002020     IF S01-ORIGEN = 1  MOVE SPACES   TO WSR-LOCAL-FOR            061900      
002021     ELSE               MOVE "FOR"    TO WSR-LOCAL-FOR.           062000      
002022     MOVE S01-PRODUCTO                TO WSR-PRODUCTO.            062100      
002023     MOVE S01-MONEDA                  TO WSR-MONEDA.              062200      
002024     MOVE S01-INSTRUMENTO             TO WSR-INST.                062300      
002025     MOVE S01-HORAMV                  TO WSR-HORA.                062400      
002026     MOVE S01-MINUMV                  TO WSR-MINU                 062450      
002027     MOVE S01-NOMINA-OPE              TO WSR-OPERADOR.            062500      
002028     MOVE S01-REFNUM                  TO WSR-REFERENCIA.          062600      
002029                                                                  062700      
002030     IF S01-AUT3ER = 0                                            062800      
002031        MOVE S01-AUTORIZA             TO WSR-AUTORIZACION         062900      
002032     ELSE                                                         063000      
002033        MOVE S01-AUT3ER               TO WSR-AUTORIZACION.        063100      
002034                                                                  063200      
002035 26460-IMP-115.                                                   063300      
002036     MOVE WKS-IMPORTE-115(W77-J)      TO WSR-IMPORTE.             063400      
002037     MOVE WKS-CVETRAN-115(W77-J)      TO WSR-CVETRAN.             063500      
002038     MOVE W77-SUC-PROM                TO WSR-SUC-PROM.            063600      
002039     WRITE V01-R01-BITACORA FROM WSR-LINEA-DETALLE.               063700      
002040     ADD 1                            TO WS-NUM-LINEAS.           063800      
002041     IF WS-NUM-LINEAS > 55                                        063900      
002042        PERFORM 41110-IMP-ENCAB.                                  064000      
002043                                                                  064100      
002044 26450-IMP-028.                                                   064200      
002045     MOVE WKS-IMPORTE-028(W77-J)      TO WSR-IMPORTE.             064300      
002046     MOVE WKS-CVETRAN-028(W77-J)      TO WSR-CVETRAN.             064400      
002047     MOVE W77-SUC-INIC                TO WSR-SUC-PROM.            064500      
002048     WRITE V01-R01-BITACORA FROM WSR-LINEA-DETALLE.               064600      
002049     ADD 1                            TO WS-NUM-LINEAS.           064700      
002050     IF WS-NUM-LINEAS > 55                                        064800      
002051        PERFORM 41110-IMP-ENCAB.                                  064900      
002052***************************************************************   065000      
002053*  IMPRIME ENCABEZADOS Y TOTALES DE BITACORA                  *   065100      
002054***************************************************************   065200      
002055 41110-IMP-ENCAB.                                                 065300      
002056*=========================                                        065400      
002057    ADD 1                         TO WS-NUM-HOJAS.                065500      
002058    MOVE WS-NUM-HOJAS             TO WSR-RB-E3-HOJA.              065600      
002059    WRITE V01-R01-BITACORA   FROM WSR-ENCAB-1 AFTER PAGE.         065700      
002060    WRITE V01-R01-BITACORA   FROM WSR-ENCAB-2.                    065800      
002061    WRITE V01-R01-BITACORA   FROM WSR-ENCAB-3.                    065900      
002062    WRITE V01-R01-BITACORA   FROM WSR-ENCAB-4  AFTER 2.           066000      
002063    MOVE SPACES TO V01-R01-BITACORA.                              066100      
002064    WRITE V01-R01-BITACORA.                                       066200      
002065    MOVE 06                    TO WS-NUM-LINEAS.                  066300      
002066                                                                  066400      
002067 42000-TOTALES.                                                   066500      
002068*==============                                                   066600      
002069    MOVE SPACES TO V01-R01-BITACORA.                              066700      
002070    WRITE V01-R01-BITACORA AFTER 3.                               066800      
002071    WRITE V01-R01-BITACORA FROM WSR-TOT-BITACORA.                 066900      
002072    MOVE W77-MAL-028           TO WSR-TOT-S028.                   067000      
002073    MOVE W77-MAL-115           TO WSR-TOT-S115.                   067100      
002074    MOVE " DIFERENCIAS A :  "  TO WSR-TOT-MENS.                   067200      
002075    WRITE V01-R01-BITACORA FROM WSR-TOTALES AFTER 1.              067300      
002076    MOVE W77-TOT-BIEN          TO WSR-TOT-S028.                   067400      
002077    MOVE W77-TOT-BIEN          TO WSR-TOT-S115.                   067500      
002078    MOVE " CANT. CORRECTAS :"  TO WSR-TOT-MENS.                   067600      
002079    WRITE V01-R01-BITACORA FROM WSR-TOTALES.                      067700      
002080 40999-EXIT.                                                      067800      
002081    EXIT.                                                         067900      
002082                                                                  068000      
002083 A2K-CPY-SECTION SECTION.                                         068100      
002084*INICIA CODIGO DE RENOVACION CRONOS 2000                          068200      
002085*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002086*    COPY "S151/CRONOS2K/CPY/PD".                                 068300      
002087** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
002088** Unisys has defined for CRONOS2K project                     ** 000200      
002089** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
002090***************************************************************** 000400      
002091***************************************************************** 000600      
002092** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
002093** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
002094** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
002095** date MMDDCCAA, which is returned into the variable          ** 001000      
002096** A2K-FEC-MDCA-001.                                           ** 001100      
002097***************************************************************** 001200      
002098                                                                  001300      
002099 A2K-ACCEPT-TODAYS-DATE.                                          001400      
002100        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
002101*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
002102        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
002103        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
002104        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
002105        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
002106        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
002107                                                                  002200      
002108 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
002109        EXIT.                                                     002240      
002110                                                                  002500      
002111****************************************************************  002600      
002112** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
002113**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
002114**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
002115**baseyear to add the century to the year part.               **  003000      
002116**INPUT is A2K-FEC-AMD-001                                    **  003100      
002117**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
002118****************************************************************  003300      
002119                                                                  003400      
002120 A2K-CONV-AMD-TO-CAMD.                                            003500      
002121         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
002122         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
002123         IF A2K-FEC-AMD-001 = 0                                   003720      
002124            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
002125         ELSE                                                     003741      
002126          IF A2K-FEC-AMD-001 = 999999                             003742      
002127             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
002128         ELSE                                                     003760      
002129         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
002130                 A2K-OBTAIN-CENTURY-EXIT                          003900      
002131         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
002132         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
002133         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
002134         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
002135                                                                  004400      
002136 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
002137         EXIT.                                                    004600      
002138                                                                  004700      
002139******************************************************************004800      
002140**A2K-CONV-MDA-TO-MDCA.                                         **004900      
002141**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
002142** an eight digit format as MMDDCCAA. It use a                  **005100      
002143** baseyear to add century to the yaer.                         **005200      
002144** INPUT is A2K-FEC-MDA-001                                     **005300      
002145** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
002146                                                                  005500      
002147 A2K-CONV-MDA-TO-MDCA.                                            005600      
002148     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
002149     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
002150     IF A2K-FEC-MDA-001 = 0                                       005820      
002151        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
002152     ELSE                                                         005845      
002153      IF A2K-FEC-MDA-001 = 999999                                 005850      
002154         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
002155     ELSE                                                         005860      
002156     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
002157             A2K-OBTAIN-CENTURY-EXIT                              006000      
002158     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
002159     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
002160     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
002161     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
002162                                                                  006500      
002163 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
002164     EXIT.                                                        006700      
002165                                                                  006800      
002166***************************************************************** 006900      
002167**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
002168**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
002169**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
002170**baseyear to add century to the year.                         ** 007300      
002171**INPUT is A2K-FEC-DMA-001                                     ** 007400      
002172**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
002173                                                                  007600      
002174 A2K-CONV-DMA-TO-DMCA.                                            007700      
002175       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
002176       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
002177       IF  A2K-FEC-DMA-001   = 0                                  007920      
002178          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
002179       ELSE                                                       007945      
002180        IF A2K-FEC-DMA-001 = 999999                               007950      
002181          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
002182       ELSE                                                       007960      
002183       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
002184               A2K-OBTAIN-CENTURY-EXIT                            008100      
002185       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
002186       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
002187       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
002188       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
002189                                                                  008600      
002190 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
002191       EXIT.                                                      008800      
002192                                                                  008900      
002193***************************************************************** 009000      
002194** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002195** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002196** a 6 digit format as AAMMDD.                                 ** 009300      
002197** It simply removes the century information in the output     ** 009400      
002198** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002199** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002200                                                                  009700      
002201 A2K-CONV-CAMD-TO-AMD.                                            009800      
002202     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002203     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002204     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002205     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002206                                                                  010300      
002207 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002208      EXIT.                                                       010500      
002209                                                                  010600      
002210******************************************************************010700      
002211******************************************************************010800      
002212** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002213** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002214** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002215** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002216** INPUT is A2K-FEC-MDCA-001                                    **011300      
002217** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002218                                                                  011500      
002219 A2K-CONV-MDCA-TO-MDA.                                            011600      
002220     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002221     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002222     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002223     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002224                                                                  012100      
002225 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002226      EXIT.                                                       012300      
002227                                                                  012400      
002228******************************************************************012500      
002229***************************************************************** 012600      
002230** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002231** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002232** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002233** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002234** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002235** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002236                                                                  013300      
002237 A2K-CONV-DMCA-TO-DMA.                                            013400      
002238     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002239     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002240     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002241     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002242                                                                  013900      
002243 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002244      EXIT.                                                       014100      
002245                                                                  014200      
002246***************************************************************** 014300      
002247 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002248      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002249      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002250      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002251      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002252      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002253 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002254      EXIT.                                                       015100      
002255***************************************************************** 015200      
002256** This paragraph adds century to an year field which is 9(02) ** 015300      
002257** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002258** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002259***************************************************************** 015700      
002260 A2K-CONV-AA-TO-CCAA.                                             015800      
002261      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002262      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002263              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002264      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002265 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002266      EXIT.                                                       016400      
002267***************************************************************** 016500      
002268** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002269** format.                                                     ** 016700      
002270** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002271** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002272***************************************************************** 017000      
002273 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002274      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002275      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002276      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002277      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002278      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002279 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002280      EXIT.                                                       017800      
002281***************************************************************** 017900      
002282** This paragraph desides the Century to be added depending    ** 018000      
002283** on the base year.                                           ** 018100      
002284** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002285** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002286***************************************************************** 018400      
002287 A2K-OBTAIN-CENTURY.                                              018500      
002288      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002289          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002290      ELSE                                                        018800      
002291          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002292 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002293      EXIT.                                                       019100      
002294                                                                  019200      
002295***************************************************************** 019300      
002296** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002297**  Format                                                     ** 019500      
002298** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002299** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002300***************************************************************** 019800      
002301 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002302      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002303      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002304      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002305      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002306      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002307                                                                  020500      
002308 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002309      EXIT.                                                       020700      
002310                                                                  020800      
002311******************************************************************020900      
002312******************************************************************021000      
002313 A2K-CONV-AM-TO-CAM.                                              021100      
002314      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002315      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002316      IF A2K-FEC-AM-001 = 0                                       021220      
002317         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002318      ELSE                                                        021245      
002319      IF A2K-FEC-AM-001 = 9999                                    021250      
002320         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002321      ELSE                                                        021260      
002322      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002323      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002324      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002325              A2K-OBTAIN-CENTURY-EXIT                             021600      
002326      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002327                                                                  021800      
002328 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002329      EXIT.                                                       022000      
002330                                                                  022100      
002331******************************************************************022200      
002332******************************************************************022300      
002333 A2K-CONV-CAM-TO-AM.                                              022400      
002334      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002335      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002336      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002337                                                                  022800      
002338 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002339   EXIT.                                                          023000      
002340                                                                  023100      
002341                                                                  023200      
002342                                                                  023500      
002343*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002344 A2K-CPY-EXIT-PARA.                                               068400      
002345    EXIT.                                                         068500      
002346*TERMINA CODIGO DE RENOVACION CRONOS 2000                         068600      
