000001*$SET TADS                                                        000200      
000002***$SET DESARROLLO                                                000300      
000003$SET LIST                                                         000400      
000004$SET ERRORLIMIT = 6                                               000500      
000005******************************************************************000600      
000006*                                                                 000700      
000007 IDENTIFICATION DIVISION.                                         000800      
000008 PROGRAM-ID. P011.                                                000900      
000009*                                                                 001000      
000010 AUTHOR.         FABRICA DE SOFTWARE BANAMEX (ING.SOFT.-JFC).     001100      
000011*                u. m. oct/19/05      Fabrica de Software BNMX.   001108      
000012*                Se integra el numero de ocurrencia en la Tabla   001110      
000013*                B03ALARMAS,B06CTLENVIO, Dialogo SA2, por registro001112      
000014 INSTALLATION.   BANAMEX.                                         001200      
000015*                                                                 001300      
000016* RECOMPILACION POR EL UPGRADE DEL MCP A 55                     * 001320      
000017* 20141205 05MTP001 MJGRG                                       * 001322      
000018***************************************************************** 001400      
000019*                                                                 001500      
000020 ENVIRONMENT DIVISION.                                            001600      
000021 INPUT-OUTPUT SECTION.                                            001700      
000022 FILE-CONTROL.                                                    001800      
000023*                                                                 001900      
000024*---                                           MONITOR OPERACIONES002000      
000025*                                              -------------------002100      
000026     SELECT E00-MTV       ASSIGN  TO DISK.                        002200      
000027*                                                                 002300      
000028******************************************************************002400      
000029*                                                                 002500      
000030 DATA DIVISION.                                                   002600      
000031 FILE SECTION.                                                    002700      
000032*                                                                 002800      
000033*---                                           MONITOR OPERACIONES002900      
000034*                                              -------------------003000      
000035 FD  E00-MTV                                                      003100      
000036     VALUE OF MAXRECSIZE IS 2400                                  003200      
000037     VALUE OF BLOCKSIZE  IS 2400                                  003300      
000038     VALUE OF FRAMESIZE  IS 8                                     003400      
000039     VALUE OF PROTECTION IS PROTECTED                             003500      
000040     VALUE OF TITLE      IS WKS-ETIQ-MONITOR.                     003600      
000041*         "(S151)S151/FILE/P011/MONITOR/AAAAMMDD ON CMEMP."       003700      
000042                                                                  003800      
000043 01  E00-REG-MTV.                                                 003900      
000044     03 E00-MTV-NUM              PIC 9(0012).                     004000      
000045     03 E00-MTV-TXT              PIC X(0020).                     004100      
000046     03 E00-MTV-MSG              PIC X(2350).                     004200      
000047*                                                                 004300      
000048******************************************************************004400      
000049*                                                                 004500      
000050 DATA-BASE SECTION.                                               004600      
000051                                                                  004700      
000052  DB  S151BD13BIFIN.                                              004800      
000053*                                                                 004900      
000054******************************************************************005000      
000055*                                                                 005100      
000056 WORKING-STORAGE SECTION.                                         005200      
000057                                                                  005300      
000058*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000059* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           005400      
000060**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000061  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000062  01 MENSAJE-LJ.                                                  100300      
000063     02 SISTEMA-LJ     PIC X(04).                                 100400      
000064     02 FILLER         PIC X VALUE "/".                           100500      
000065     02 PASO-LJ        PIC X(04).                                 100600      
000066     02 FILLER         PIC X VALUE "/".                           100700      
000067     02 MTP-LJ         PIC 9(03).                                 100800      
000068     02 FILLER         PIC X VALUE ":".                           100900      
000069     02 TIPO-LJ        PIC X.                                     101000      
000070     02 FILLER         PIC X VALUE ">".                           101100      
000071     02 CODIGO-LJ      PIC 9(06).                                 101200      
000072     02 FILLER         PIC X VALUE "<".                           101300      
000073     02 TEXTO-LJ       PIC X(250).                                101400      
000074*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000075*                                                                 005500      
000076*-----                                                            005600      
000077*                                                                 005700      
000078*--------------------------------------------------------- PRUEBAS005800      
000079*77  W77-MI-VERSION              PIC  X(08)  VALUE "15MTP001".    005900      
000080 77  W77-MI-VERSION              PIC  X(08)  VALUE "25MTP002".    005910      
000081*--------------------------------------------------------- PRUEBAS006000      
000082 77  W77-MI-SISTEMA              PIC  X(05)  VALUE "S151 ".       006100      
000083 77  W77-MI-NOMBRE               PIC  X(05)  VALUE "P011 ".       006200      
000084 77  W77-MI-IDENTIFICACION       PIC  X(12)  VALUE "S151P011 ".   006300      
000085 77  W77-MI-TRANCODE             PIC  X(09)  VALUE "015111".      006400      
000086 77  W77-MI-ACA                  PIC  9(06)  VALUE 015111.        006500      
000087 77  W77-MI-HOST                 PIC  X(08).                      006600      
000088 77  W77-MI-CSI                  PIC  9(02).                      006700      
000089*                                                                 006800      
000090*-----                                                            006900      
000091*                                                                 007000      
000092 77  W77-ACTIVO                  PIC  9(01)  VALUE ZEROS.         007100      
000093 77  W77-ACTIVO-MONITOR          PIC  9(01)  VALUE 0.             007200      
000094 77  W77-ACTIVO-REZAGADOS        PIC  9(01)  VALUE ZEROS.         007300      
000095 77  W77-ACTIVO-SEND-DUMMY       PIC  9(01)  VALUE ZEROS.         007400      
000096*                                                                 007500      
000097*-----                                                            007600      
000098*                                                                 007700      
000099 77  W77-SW-ALARMAS              PIC  9(01) VALUE 0.              007800      
000100 77  W77-SW-TOTALES              PIC  9(01) VALUE 0.              007900      
000101 77  W77-SW-BATCH                PIC  9(01) VALUE 0.              008000      
000102 77  W77-SW-LEIBATCH             PIC  9(01) VALUE 0.              008100      
000103 77  W77-SW-RECIBE               PIC  9(01) VALUE 0.              008200      
000104 77  W77-SW-B06                  PIC  9(01) VALUE 0.              008300      
000105 77  W77-NODO-DES                PIC  9(02) VALUE 16.             008400      
000106*77  W77-NODO-DES                PIC  9(02) VALUE 15.             008500      
000107 77  W77-ESTATUS                 PIC  9(11) BINARY VALUE 0.       008600      
000108 77  W77-NTRANSAC                PIC  9(08) VALUE 0.              008800      
000109 77  W77-SW-FIN                  PIC  9(01) VALUE 0.              008900      
000110 77  W77-SW-CREA                 PIC  9(01) VALUE 0.              009000      
000111 77  W77-SW-NOHAY                PIC  9(01) VALUE 0.              009100      
000112 77  W77-SW-ERROR                PIC  9(01) VALUE 0.              009200      
000113 77  W77-RECN                    PIC  9(06) VALUE 0.              009300      
000114 77  W77-LASTR                   PIC  9(06) VALUE 0.              009400      
000115 77  W77-ULT-ENV                 PIC  9(06) VALUE 0.              009500      
000116 77  W77-RECUPERA                PIC  9(01) VALUE 0.              009600      
000117 77  W77-MSG-PEND                PIC  9(06) VALUE 0.              009700      
000118 77  W77-CONTINUA                PIC  9(01) VALUE 0.              009800      
000119 77  W77-RESP-OK                 PIC  9(01) VALUE 0.              009900      
000120 77  W77-VECES                   PIC  9(01) VALUE 0.              010000      
000121 77  W77-TIPO-MSG                PIC  9(03) VALUE 0.              010100      
000122 77  W77-CUANTOS                 PIC  9(02) VALUE 0.              010200      
000123 77  W77-FEC-PBAS                PIC  X(10) VALUE SPACES.         010300      
000124 77  W77-HORA-LIMITE             PIC  9(06) VALUE 200000.         010400      
000125                                                                  010500      
000126 77  W77-DIFERENTE               PIC  9(01) VALUE ZEROS.          010600      
000127 77  W77-NUMCSI                  PIC  9(11) BINARY.               010700      
000128 77  W77-MSG-HDR-APPLORIG        PIC  X(01) VALUE SPACES.         010800      
000129 77  W77-MSG-HDR-CCRORI          PIC  9(02) VALUE ZEROS.          010900      
000130 77  W77-IND                     PIC  9(04) VALUE 0.              011000      
000131 77  W77-COMS-RESULT             PIC  9(11) BINARY VALUE 0.       011100      
000132 77  W77-CTE-NUM                 PIC  9(12) VALUE ZEROS.          011200      
000133 77  W77-OFI-CSI                 PIC  9(02) VALUE ZEROS.          011300      
000134 77  W77-TPO-HI                  PIC  9(02) VALUE ZEROS.          011400      
000135 77  WS-LEIDOS                   PIC  9(7)  VALUE ZEROS.          011500      
000136 77  WS-ENVIADOS                 PIC  9(7)  VALUE ZEROS.          011600      
000137 01  WKS-PUENTE-IMP              PIC  9(16)V99.                   011700      
000138 01  WKS-PUENTE-IMP-R  REDEFINES WKS-PUENTE-IMP.                  011800      
000139     02 WKS-PUENTE-IMP-E         PIC  9(16).                      011900      
000140     02 WKS-PUENTE-IMP-D         PIC  9(02).                      012000      
000141                                                                  012100      
000142 01  W77-NUM-TRAN                PIC 9(08).                       012110      
000143 01  W77-NUM-TRAN-R REDEFINES W77-NUM-TRAN.                       012112      
000144     02 W77-NUM-T                PIC 9(06).                       012120      
000145     02 W77-NUM-T-D              PIC 9(02).                       012130      
000146 01 WKS-ACEPTO                   PIC 9(01) VALUE 0.               012140      
000147 01 WKS-ACEP                     PIC 9(01) VALUE 0.               012150      
000148 01 WKS-EVENTO                   USAGE IS EVENT.                  012160      
000149 01  WKS-VARIOS.                                                  012200      
000150     02  WKS-LLAVE-B03.                                           012300      
000151         03  WKS-B03-SISTEMA     PIC  9(04) COMP.                 012400      
000152         03  WKS-B03-CSI         PIC  9(02) COMP.                 012500      
000153         03  WKS-B03-FECINF      PIC  9(08) COMP.                 012600      
000154         03  WKS-B03-PRODUCTO    PIC  9(04) COMP.                 012700      
000155         03  WKS-B03-INSTSERV    PIC  9(02) COMP.                 012800      
000156         03  WKS-B03-MONEDA      PIC  9(04) COMP.                 012900      
000157         03  WKS-B03-SUC         PIC  9(04) COMP.                 013000      
000158         03  WKS-B03-CTA         PIC  9(12) COMP.                 013100      
000159         03  WKS-B03-AUT-S151    PIC  9(08) COMP.                 013200      
000160     02  WKS-REG-B06.                                             013300      
000161         03  WKS-B06-TPO-MENS    PIC  X(01).                      013400      
000162         03  WKS-B06-FECINF      PIC  9(08) COMP.                 013500      
000163         03  WKS-B06-CSI         PIC  9(02) COMP.                 013600      
000164         03  WKS-B06-INFOR.                                       013700      
000165             04 WKS-B06-INF      OCCURS 17 TIMES.                 013800      
000166                05  WKS-B06-SISTEMA    PIC  9(04) COMP.           013900      
000167                05  WKS-B06-PRODUCTO   PIC  9(04) COMP.           014000      
000168                05  WKS-B06-INSTSERV   PIC  9(02) COMP.           014100      
000169                05  WKS-B06-MONEDA     PIC  9(04) COMP.           014200      
000170                05  WKS-B06-CPAE       PIC  9(04) COMP.           014300      
000171                05  WKS-B06-NUM-T      PIC  9(04) COMP.           014400      
000172                05  WKS-B06-CONTRATO.                             014500      
000173                    06  WKS-B06-SUC    PIC  9(04) COMP.           014600      
000174                    06  WKS-B06-CTA    PIC  9(12) COMP.           014700      
000175                05  WKS-B06-AUT-S151   PIC  9(08) COMP.           014800      
000176                05  WKS-B06-NUMOCURR   PIC  9(02) COMP.           014810      
000177*                                                                 014900      
000178*-----------------------------------------------------------------015000      
000179*                                             NOMBRE PARA TASKFILE015100      
000180*                                             --------------------015200      
000181 01  WKS-TASK-TITLE.                                              015300      
000182                                                                  015400      
000183     02  FILLER                  PIC X(34) VALUE                  015500      
000184                                                                  015600      
000185         "FILE TASKFILE(USERBACKUPNAME=TRUE,".                    015700      
000186     02  FILLER                  PIC X(25) VALUE                  015800      
000187         "TITLE=S151/TASKFILE/P011/".                             015900      
000188     02  WKS-TASK-NODO           PIC 9(02).                       015910      
000189     02  WKS-TASK-SUBNODO        PIC 9(02) VALUE ZERO.            015920      
000190     02  FILLER                  PIC X(06) VALUE "/R000/".        015930      
000191     02  WKS-TASK-FECHA          PIC 9(6).                        016000      
000192                                                                  016100      
000193     02  FILLER                  PIC X VALUE "/".                 016200      
000194     02  WKS-TASK-MIX            PIC 9(7).                        016300      
000195     02  FILLER                  PIC X VALUE "/".                 016400      
000196     02  WKS-TSK-MNEMONICO       PIC X(14) VALUE                  016500      
000197         "001TASKFILE );".                                        016600      
000198                                                                  016700      
000199*                                                                 016800      
000200*-----                                            ETIQUETA MONITOR016900      
000201*                                                 ----------------017000      
000202 01  WKS-ETIQ-MONITOR.                                            017100      
000203     03 FILLER                  PIC X(29) VA                      017200      
000204        "(S151)S151/FILE/P011/MONITOR/".                          017300      
000205     03 NOM-MON-FEC             PIC 9(08).                        017400      
000206     03 FILLER                  PIC X(01) VALUE "/".              017500      
000207     03 NOM-MON-HR              PIC 9(06).                        017510      
000208     03 FILLER                  PIC X(01) VALUE "/".              017520      
000209     03 NOM-MON-MIX             PIC 9(07).                        017600      
000210     03 FILLER                  PIC X(10) VALUE " ON CMEMP.".     017700      
000211*                                                                 017800      
000212*-----                                         ETIQUETA INTERMEDIO017900      
000213*                                              -------------------018000      
000214 01  WKS-ETIQ-CONTROL.                                            018100      
000215     02  FILLER                 PIC X(23) VALUE                   018200      
000216         "S151/FILE/P011/CONTROL/".                               018300      
000217     02  WKS-ETIQ-FECINT        PIC 9(08) VALUE 0.                018400      
000218     02  FILLER                 PIC X(01) VALUE ".".              018500      
000219*                                                                 018600      
000220*-----                                                            018700      
000221*                                                                 018800      
000222 01  WKS-MISDATOS.                                                018900      
000223     05  WKS-MISDATOSCSI        PIC  9(02).                       019000      
000224     05  FILLER                 PIC  X(38).                       019100      
000225                                                                  019200      
000226 01  WS-FECHA                   PIC  9(08).                       019300      
000227*                                                                 019400      
000228 01  WS-HORA                    PIC  9(08).                       019500      
000229 01  WS-HORA-RED      REDEFINES WS-HORA.                          019600      
000230     02 WS-HHMMSS               PIC  9(06).                       019700      
000231     02 WS-HHMMSS-RED REDEFINES WS-HHMMSS.                        019800      
000232        04 WS-HH                PIC  9(02).                       019900      
000233        04 WS-MM                PIC  9(02).                       020000      
000234        04 WS-SS                PIC  9(02).                       020100      
000235     02 WS-CC                   PIC  9(02).                       020200      
000236*                                                                 020300      
000237*-----------------------------------------------------------------020400      
000238*                                   VARIABLES P/OBTENER UNA ACCION020500      
000239*                                   ------------------------------020600      
000240 01 WKS-ACCION.                                                   020700      
000241    02 WKS-TIPO-ACCION           PIC X.                           020800      
000242    02 WKS-NUM-ACCION            PIC 9(02) COMP.                  020900      
000243    02 WKS-FEC-ACCION            PIC 9(8)  COMP.                  021000      
000244 01 WKS-OPF028                   PIC 9(08).                       021100      
000245*                                                                 021200      
000246*-----                                                            021300      
000247*                                                                 021400      
000248 01 WKS-VARIABLES-PROCESO.                                        021500      
000249    02 WKS-NUM-CAJA-CONV         PIC 9(04).                       021600      
000250    02 R1-WKS-NUM-CAJA-CONV      REDEFINES WKS-NUM-CAJA-CONV.     021700      
000251       04 WKS-ALF-CAJA           PIC 9(02).                       021800      
000252       04 WKS-NUM-CAJA           PIC 9(02).                       021900      
000253*                                                                 022000      
000254*-----------------------------------------------------------------022100      
000255*                                                    FECHA MAQUINA022200      
000256*                                                    -------------022300      
000257 01  WKS-FECHA-MAQUINA      PIC X(10) TYPE IS NUMERIC-DATE.       022400      
000258 01  WKS-FECHA-MAQUINAR REDEFINES WKS-FECHA-MAQUINA.              022500      
000259     02 WKS-FECMQ-MES       PIC 9(02).                            022600      
000260     02 FILLER              PIC X.                                022700      
000261     02 WKS-FECMQ-DIA       PIC 9(02).                            022800      
000262     02 FILLER              PIC X.                                022900      
000263     02 WKS-FECMQ-ANIO      PIC 9(04).                            023000      
000264*                                                                 023100      
000265 01  WKS-FECHA-MAQ          PIC 9(08).                            023200      
000266 01  WKS-FECHA-MAQR REDEFINES WKS-FECHA-MAQ.                      023300      
000267     02 WKS-FMAQ-ANIO       PIC 9(04).                            023400      
000268     02 WKS-FMAQ-MES        PIC 9(02).                            023500      
000269     02 WKS-FMAQ-DIA        PIC 9(02).                            023600      
000270 01  WKS-FECHA-MAQR2 REDEFINES WKS-FECHA-MAQ.                     023700      
000271     02 WKS-FMAQ-SSAA       PIC 9(04).                            023800      
000272     02 WKS-FMAQ-MMDD       PIC 9(04).                            023900      
000273 01  WKS-FECHA-MAQR3 REDEFINES WKS-FECHA-MAQ.                     024000      
000274     02 FILLER              PIC 9(02).                            024100      
000275     02 WKS-FEC-MAQ-06      PIC 9(06).                            024200      
000276 01  WKS-FECHA-MAQR4 REDEFINES WKS-FECHA-MAQ.                     024300      
000277     02 FILLER              PIC 9(02).                            024400      
000278     02 WKS-FMAQ-AAMM       PIC 9(04).                            024500      
000279     02 FILLER              PIC 9(02).                            024600      
000280*                                                                 024700      
000281*-----                                           FECHA DE LA LINEA024800      
000282*                                                -----------------024900      
000283 01  WKS-FECHA-LINEA        PIC 9(08).                            025000      
000284 01  R1-WKS-FECHA-LINEA  REDEFINES WKS-FECHA-LINEA.               025100      
000285     02 WKS-SSAA-LINEA      PIC 9(04).                            025200      
000286     02 WKS-MM-LINEA        PIC 9(02).                            025300      
000287     02 WKS-DD-LINEA        PIC 9(02).                            025400      
000288 01  R2-WKS-FECHA-LINEA  REDEFINES WKS-FECHA-LINEA.               025500      
000289     02 WKS-SSAAMM-LINEA    PIC 9(06).                            025600      
000290     02 FILLER              PIC 9(02).                            025700      
000291 01  R3-WKS-FECHA-LINEA  REDEFINES WKS-FECHA-LINEA.               025800      
000292     02 FILLER              PIC 9(02).                            025900      
000293     02 WKS-FEC-LINEA-06    PIC 9(06).                            026000      
000294*                                                                 026010      
000295 01  WKS-B03-ALA-FECINF     PIC 9(08).                            026030      
000296 77  W77-CAMBIA-FECHA       PIC 9(02).                            026040      
000297*                                                                 026100      
000298*-----                                                            026200      
000299*                                                                 026300      
000300 01  WKS-HORA.                                                    026400      
000301     02 WKS-HORA-1          PIC 9(8).                             026500      
000302     02 WKS-HORA-2 REDEFINES WKS-HORA-1.                          026600      
000303        09 WKS-H            PIC 9(2).                             026700      
000304        09 WKS-M            PIC 9(2).                             026800      
000305        09 FILLER           PIC X(4).                             026900      
000306     02 WKS-HORA-3 REDEFINES WKS-HORA-1.                          027000      
000307        09 WKS-HHMMSS       PIC 9(6).                             027100      
000308        09 FILLER           PIC X(2).                             027200      
000309                                                                  027300      
000310 01  WKS-HORA-MONITOR.                                            027400      
000311     02 WKS-MON-HMSD        PIC 9(8).                             027500      
000312     02 RD-WKS-MON-HMSD     REDEFINES WKS-MON-HMSD.               027600      
000313        09 WKS-MON-HH       PIC 9(2).                             027700      
000314        09 WKS-MON-MM       PIC 9(2).                             027800      
000315        09 WKS-MON-SS       PIC 9(2).                             027900      
000316        09 WKS-MON-DD       PIC 9(2).                             028000      
000317*                                                                 028100      
000318*-----------------------------------------------------------------028200      
000319*                                                                 028300      
000320 01  WKS-ACEPTA.                                                  028400      
000321     03 WKS-ACEPTA-TXT      PIC X(4).                             028500      
000322     03 WKS-ACEPTA-FIL      PIC X.                                028600      
000323     03 WKS-ACEPTA-NUM      PIC 9(7).                             028700      
000324                                                                  028800      
000325 77  WKS-ACEPTA-NODO        PIC 9(7) VALUE 13.                    028900      
000326 77  WKS-ACEPTA-TIME        PIC 9(7) VALUE 5.                     029000      
000327 77  WKS-ACEPTA-LEER        PIC 9(7) VALUE 40.                    029100      
000328 77  WKS-ACEPTA-ENVIAR      PIC 9(7) VALUE 14.                    029200      
000329 77  WKS-ACEPTA-TOUT        PIC 9(7) VALUE 2400.                  029300      
000330 77  WKS-ACEPTA-REEN        PIC 9(7) VALUE 0.                     029400      
000331 77  WKS-ACEPTA-NEGA        PIC 9(7).                             029500      
000332 77  WKS-ACEPTA-LENG        PIC 9(7).                             029600      
000333 77  WKS-LENG-DATOS         PIC 9(04).                            029700      
000334 77  WKS-TRANS-ACEPTADA     PIC 9(1) VALUE 0.                     029800      
000335 01  WKS-IMAGEN-AI12        PIC X(500).                           029900      
000336                                                                  030000      
000337 01  WKS-FECHA-BASE         PIC 9(08).                            030100      
000338 01  WKS-FECHA-BASER REDEFINES WKS-FECHA-BASE.                    030110      
000339     02  WKS-FECBD-AA       PIC 9(04).                            030200      
000340     02  WKS-FECBD-MM       PIC 9(02).                            030300      
000341     02  WKS-FECBD-DD       PIC 9(02).                            030400      
000342 01 WKS-FECHA-BASE-R REDEFINES WKS-FECHA-BASE.                    030500      
000343     02  WKS-FECHABD-CC     PIC 9(02).                            030600      
000344     02  WKS-FECHABD-AMD    PIC 9(06).                            030700      
000345     02  WKS-FECHABD-AMD-R REDEFINES WKS-FECHABD-AMD.             030710      
000346         03 WKS-FBD-AA      PIC 9(02).                            030720      
000347         03 WKS-FBD-MD      PIC 9(04).                            030730      
000348*                                                                 030800      
000349******************************************************************030900      
000350*           COPY DEL FORMATO PARA LIBRERIA DE CONTROL            *031000      
000351******************************************************************031100      
000352                                                                  031200      
000353*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000354* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         031300      
000355*================================================================ 000100      
000356*         ENTRY-POINT CONSISDIA :                               = 000200      
000357*                                                                 000300      
000358* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000359* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000360* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000361* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000362* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000363* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000364* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000365* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000366* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000367* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000368*                                                               = 001400      
000369*================================================================ 001500      
000370                                                                  001600      
000371                                                                  001700      
000372*================================================================ 001800      
000373* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000374*                                                               = 002000      
000375* ENTRADA REQUERIDA :                                           = 002100      
000376*                                                               = 002200      
000377*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000378*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000379*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000380*================================================================ 002600      
000381 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000382    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000383    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000384    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000385    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000386    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000387    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000388    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000389    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000390    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000391    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000392    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000393    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000394    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000395    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000396    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000397    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000398    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000399    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000400    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000401    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000402       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000403       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000404       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000405       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000406*==============================================================   005200      
000407*                                                             =   005300      
000408* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000409*                                                             =   005500      
000410* CAMPOS REQUERIDOS :                                         =   005600      
000411*                                                             =   005700      
000412* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000413* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000414* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000415* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000416*==============================================================   006200      
000417 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000418    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000419    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000420    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000421    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000422                                                                  006800      
000423*==============================================================   006900      
000424*                                                             =   007000      
000425* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000426*                                                             =   007200      
000427* CAMPOS REQUERIDOS :                                         =   007300      
000428*                                                             =   007400      
000429* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000430* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000431* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000432* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000433*==============================================================   007900      
000434 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000435    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000436    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000437    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000438    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000439                                                                  008500      
000440*==============================================================   008600      
000441*                                                             =   008700      
000442* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000443*                                                             =   008900      
000444* CAMPOS REQUERIDOS :                                         =   009000      
000445*                                                             =   009100      
000446* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000447* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000448* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000449* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000450*==============================================================   009600      
000451 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000452    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000453    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000454    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000455    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000456                                                                  010200      
000457*============================================================     010300      
000458* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000459*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000460*                                                           =     010600      
000461*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000462*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000463*                                                           =     010900      
000464*  ENTRADA REQUERIDA.                                       =     011000      
000465*                                                           =     011100      
000466*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000467*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000468*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000469*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000470*============================================================     011600      
000471                                                                  011700      
000472 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000473     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000474     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000475     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000476     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000477                                                                  012300      
000478*=============================================================    012400      
000479*                                                            =    012500      
000480* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000481*             B01-SIS-FECARMOV.                              =    012700      
000482*                                                            =    012800      
000483* ENTRADA REQUERIDAD :                                       =    012900      
000484*                                                            =    013000      
000485*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000486*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000487*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000488*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000489*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000490*=============================================================    013600      
000491                                                                  013700      
000492 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000493     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000494     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000495     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000496     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000497     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000498*================================================================ 014400      
000499*                                                               = 014500      
000500* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000501*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000502*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000503*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000504*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000505*                                                               = 015100      
000506* ENTRADA REQUERIDA :                                           = 015200      
000507*                                                               = 015300      
000508* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000509* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000510* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000511* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000512* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000513*================================================================ 015900      
000514 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000515    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000516    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000517    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000518    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000519    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000520                                                                  016600      
000521*============================================================     016700      
000522*                                                           =     016800      
000523* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000524*                                                           =     017000      
000525* DATOS REQUERIDOS :                                        =     017100      
000526*                                                           =     017200      
000527* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000528* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000529* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000530* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000531* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000532*============================================================     017800      
000533                                                                  017900      
000534 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000535     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000536     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000537     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000538     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000539     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000540                                                                  018600      
000541*============================================================     018700      
000542*                                                           =     018800      
000543* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000544*                                                           =     019000      
000545* DATOS REQUERIDOS :                                        =     019100      
000546*                                                           =     019200      
000547* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000548* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000549* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000550* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000551* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000552*============================================================     019800      
000553                                                                  019900      
000554 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000555     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000556     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000557     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000558     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000559     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000560                                                                  020600      
000561*===============================================================  020700      
000562*                                                              =  020800      
000563* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000564*              MOVIMIENTOS.                                    =  021000      
000565* DATOS REQUERIDOS :                                           =  021100      
000566*                                                              =  021200      
000567* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000568* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000569* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000570* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000571* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000572* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000573*==============================================================   021900      
000574                                                                  022000      
000575 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000576     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000577     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000578     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000579     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000580     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000581     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000582*==============================================================   022800      
000583*                                                             =   022900      
000584* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000585*                                                             =   023100      
000586* CAMPOS REQUERIDOS :                                         =   023200      
000587*                                                             =   023300      
000588* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000589* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000590* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000591* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000592*==============================================================   023800      
000593 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000594    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000595    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000596    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000597    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000598                                                                  024304      
000599*=================================================================024306      
000600*                ENTRY POINT CONSISB01                           =024308      
000601*                                                                =024310      
000602*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000603*                                                                =024314      
000604*  FUNCIONES DISPONIBLES :                                       =024316      
000605*                                                                =024318      
000606*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000607*                                                                =024322      
000608*  PARAMETROS REQUERIDOS                                         =024324      
000609*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000610*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000611*=================================================================024330      
000612                                                                  024332      
000613 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000614     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000615     03 WKS-CON-CSI                PIC 9(02).                     024336      
000616     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000617     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000618        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000619        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000620        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000621        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000622        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000623                                                                  024400      
000624*=================================================================024500      
000625*                ENTRY POINT B02ARCINTER                         =024600      
000626*                                                                =024700      
000627*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000628*                                                                =024900      
000629*  FUNCIONES DISPONIBLES :                                       =025000      
000630*                                                                =025100      
000631*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000632* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000633* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000634* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000635*                                                                =025600      
000636*  PARAMETROS REQUERIDOS                                         =025700      
000637*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000638*                                                                =025900      
000639*=================================================================026000      
000640 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000641     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000642     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000643     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000644     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000645     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000646     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000647     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000648     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000649     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000650     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000651     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000652     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000653     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000654     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000655     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000656     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000657     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000658     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000659     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000660     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000661     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000662     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000663     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000664     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000665     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000666     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000667     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000668     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000669                                                                  029000      
000670*=================================================================029100      
000671*                ENTRY POINT B04SISTEMA                          =029200      
000672*                                                                =029300      
000673*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000674*                                                                =029500      
000675*  FUNCIONES DISPONIBLES :                                       =029600      
000676*                                                                =029700      
000677*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000678*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000679*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000680*                                                                =030100      
000681*  PARAMETROS REQUERIDOS                                         =030200      
000682*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000683*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000684*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000685*                                                                =030600      
000686*=================================================================030700      
000687 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000688     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000689     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000690     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000691     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000692     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000693     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000694     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000695                                                                  031600      
000696*================================================================ 031700      
000697*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000698*                                                               = 031900      
000699*  FUNCION                                                      = 032000      
000700*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000701*   19       ALTAS.                                             = 032200      
000702*   22       BAJAS                                              = 032300      
000703*   37       CAMBIOS.                                           = 032400      
000704*                                                               = 032500      
000705*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000706*                      FECHA DE PROCESO                         = 032700      
000707*                      NUMERO DE PROCESO                        = 032800      
000708*                      FECHA INICIO                             = 032900      
000709*                      REGISTRO INICIAL                         = 033000      
000710*================================================================ 033100      
000711                                                                  033200      
000712 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000713     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000714     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000715     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000716     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000717     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000718     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000719     03 WKS-B05-MIX                PIC 9(08).                     034000      
000720     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000721     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000722     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000723     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000724     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000725     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000726                                                                  034700      
000727                                                                  034800      
000728*================================================================ 034900      
000729*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000730*                                                               = 035100      
000731*  FUNCION                                                      = 035200      
000732*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000733*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000734*                                                               = 035500      
000735*================================================================ 035600      
000736                                                                  035700      
000737 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000738     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000739     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000740     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000741     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000742     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000743     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000744                                                                  036500      
000745*===============================================================  036600      
000746*                                                              =  036700      
000747*         ENTRY-POINT CONSISMEN                                =  036800      
000748*                                                              =  036900      
000749*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000750*                      SISTEMA                                 =  037100      
000751*                                                              =  037200      
000752*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000753*                                                              =  037400      
000754*===============================================================  037500      
000755 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000756     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000757     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000758     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000759     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000760     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000761     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000762     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000763     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000764     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000765     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000766     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000767     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000768     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000769     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000770     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000771        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000772        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000773        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000774        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000775        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000776        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000777        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000778                                                                  039900      
000779*=====================================================            040000      
000780*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000781*=====================================================            040200      
000782 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000783     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000784     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000785     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000786                                                                  040700      
000787*=====================================================            040800      
000788*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000789*=====================================================            041000      
000790 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000791     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000792     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000793     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000794                                                                  041500      
000795*=====================================================            041600      
000796*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000797*=====================================================            041800      
000798 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000799     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000800     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000801     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000802*=====================================================            042300      
000803*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000804*=====================================================            042500      
000805 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000806     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000807     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000808     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000809                                                                  043000      
000810*=====================================================            043100      
000811*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000812*=====================================================            043300      
000813 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000814     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000815     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000816     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000817                                                                  043800      
000818*=====================================================            043900      
000819*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000820*=====================================================            044100      
000821 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000822     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000823     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000824     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000825                                                                  044600      
000826*=====================================================            044700      
000827*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000828*=====================================================            044900      
000829 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000830     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000831     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000832     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000833                                                                  045400      
000834*=====================================================            045500      
000835*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000836*=====================================================            045700      
000837 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000838     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000839     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000840     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000841                                                                  046200      
000842*=====================================================            046300      
000843*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000844*=====================================================            046500      
000845 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000846     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000847     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000848     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000849                                                                  047000      
000850*=====================================================            047100      
000851*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000852*=====================================================            047300      
000853 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000854     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000855     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000856     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000857                                                                  047800      
000858*=====================================================            047900      
000859*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000860*=====================================================            048100      
000861 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000862     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000863     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000864     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000865                                                                  048600      
000866*=====================================================            048700      
000867*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000868*=====================================================            048900      
000869 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000870     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000871     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000872     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000873                                                                  049400      
000874*=====================================================            049500      
000875*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000876*=====================================================            049700      
000877 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000878     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000879     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000880     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000881     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000882     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000883     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000884     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000885     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000886     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000887     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000888                                                                  050900      
000889*=====================================================            051000      
000890*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000891*=====================================================            051200      
000892 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000893     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000894     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000895     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000896     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000897                                                                  051800      
000898*=====================================================            051900      
000899*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000900*=====================================================            052100      
000901 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000902     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000903     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000904     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000905     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000906                                                                  052700      
000907*=====================================================            052800      
000908*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000909*=====================================================            053000      
000910 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000911     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000912     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000913     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000914     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000915                                                                  053600      
000916*=====================================================            053700      
000917*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000918*=====================================================            053900      
000919 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000920     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000921     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000922     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000923     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000924                                                                  054500      
000925*=====================================================            054600      
000926*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000927*=====================================================            054800      
000928 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000929     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000930     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000931     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000932     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000933                                                                  055400      
000934*=====================================================            055500      
000935*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000936*=====================================================            055700      
000937 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000938     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000939     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000940     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000941     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000942                                                                  056300      
000943*=====================================================            056400      
000944*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000945*=====================================================            056600      
000946 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000947     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000948     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000949     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000950     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000951                                                                  057200      
000952 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000953*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000954                                                                  031500      
000955******************************************************************031600      
000956*                                             PARAMETROS VERSIONES031700      
000957*                                             --------------------031800      
000958 01  WKS-CTRV-LIBRERIA      PIC X(12).                            031900      
000959 01  WKS-CTRV-TITULO        PIC X(72).                            032000      
000960 01  WKS-CTRV-STATUS        PIC S9(11) BINARY.                    032100      
000961*                                                                 032200      
000962*-----                                          LIBRERIA DE FECHAS032300      
000963*                                               ------------------032400      
000964 01  WKS-FECHAIN                   PIC 9(08).                     032500      
000965 01  WKS-FECHAOUT                  PIC 9(08).                     032600      
000966 01  WKS-FECHAOUT-1                PIC 9(08).                     032700      
000967 77  WKS-DIASEM                    PIC S9(11) BINARY.             032800      
000968 77  WKS-CVESEM                    PIC S9(11) BINARY.             032900      
000969 77  WKS-CVEFEST                   PIC S9(11) BINARY.             033000      
000970*                                                                 033100      
000971*-----                                       VARIABLES FECHA HABIL033200      
000972*                                            ---------------------033300      
000973 01  WKS-FECHA-MAC              PIC 9(08).                        033400      
000974 01  WKS-FECHA-MAC-R            REDEFINES  WKS-FECHA-MAC.         033500      
000975     02  WKS-FECHA-MAC-CC       PIC 9(02).                        033600      
000976     02  WKS-FECHA-MAC-AAMMDD   PIC 9(06).                        033700      
000977     02  WKS-FECHA-MAC-AAMMDD-R REDEFINES  WKS-FECHA-MAC-AAMMDD.  033800      
000978         03 WKS-FECHA-MAC-AA    PIC 9(02).                        033900      
000979         03 WKS-FECHA-MAC-MM    PIC 9(02).                        034000      
000980         03 WKS-FECHA-MAC-DD    PIC 9(02).                        034100      
000981*                                                                 034200      
000982*-----                                        P/CALC HORA + n SEGS034300      
000983*                                             --------------------034400      
000984 77  WKS-RES1                   PIC 9(5).                         034500      
000985 77  WKS-RES2                   PIC 9(5).                         034600      
000986 77  WKS-SEGUNDOS               PIC 9(8).                         034700      
000987 77  WKS-SEGUNDOS1              PIC 9(8).                         034800      
000988 77  WKS-SEGUNDOS2              PIC 9(8).                         034900      
000989 01  WKS-XX-HORAHORA            PIC 9(06).                        035000      
000990 01  WKS-XX-HORAHORA-RED        REDEFINES WKS-XX-HORAHORA.        035100      
000991     02 WKS-XX-HORAHHMMSS       PIC 9(06).                        035200      
000992     02 WKS-XX-HORAHHMMSS-RED   REDEFINES WKS-XX-HORAHHMMSS.      035300      
000993        04 WKS-XX-HORAHH        PIC 9(02).                        035400      
000994        04 WKS-XX-HORAMM        PIC 9(02).                        035500      
000995        04 WKS-XX-HORASS        PIC 9(02).                        035600      
000996*                                                                 035700      
000997*-----------------------------------------------------------------035800      
000998*                                               MENSAJE PARA BIFIN035900      
000999*                                               ------------------036000      
001000*    LONGITUD MAXIMA DEL MENSAJE  DE DATOS 1800                   036100      
001001*                                                                 036200      
001002 01  WKS-DATOS-MSG.                                               036300      
001003* Long del mensaje de datos TOTALES (1712 + 22) = 1734.           036400      
001004* Long del mensaje de datos ALARMAS (1717 + 22) = 1739.           036500      
001005                                                                  036600      
001006     02  WKS-FEC-PROCESO         PIC  9(08).                      036700      
001007     02  WKS-HOR-ENVIO           PIC  9(06).                      036800      
001008     02  WKS-TPO-PROCESO         PIC  X(01).                      036900      
001009     02  WKS-RES-TRANSACC        PIC  9(04).                      037000      
001010     02  WKS-NUM-RENGLONES       PIC  9(02).                      037100      
001011     02  WKS-TPO-INFORMAC        PIC  X(01).                      037200      
001012     02  WKS-RESTO-DATOS         PIC  X(1770).                    037300      
001013                                                                  037400      
001014 01  WKS-POR-PROD-INST.                                           037500      
001015* Long. reg. Totales  107 * 16 = 1712.                            037600      
001016     03  WKS-OCS-PROD-INST    OCCURS  16  TIMES.                  037700      
001017         04  WKS-PCSI-ORIGEN     PIC  9(02).                      037800      
001018         04  WKS-PNUM-SISTEMA    PIC  9(04).                      037900      
001019         04  WKS-PNUM-PRODUCTO   PIC  9(04).                      038000      
001020         04  WKS-PNUM-INSTRUM    PIC  9(02).                      038100      
001021         04  WKS-PNUM-MONEDA     PIC  9(03).                      038200      
001022         04  WKS-PNUM-CPAE       PIC  9(04).                      038300      
001023         04  WKS-PNUM-T          PIC  9(04).                      038400      
001024         04  WKS-PINI-TSDO       PIC  X(01).                      038500      
001025         04  WKS-PINI-NMOVS      PIC  9(08).                      038600      
001026         04  WKS-PINI-IMOVS.                                      038700      
001027             05 WKS-PINI-IMOVS-E PIC  9(16).                      038800      
001028             05 WKS-PINI-IMOVS-P PIC  X(01).                      038900      
001029             05 WKS-PINI-IMOVS-D PIC  9(02).                      039000      
001030         04  WKS-PCGO-OPERS      PIC  9(08).                      039100      
001031         04  WKS-PCGO-IMPOR.                                      039200      
001032             05 WKS-PCGO-IMPOR-E PIC  9(16).                      039300      
001033             05 WKS-PCGO-IMPOR-P PIC  X(01).                      039400      
001034             05 WKS-PCGO-IMPOR-D PIC  9(02).                      039500      
001035         04  WKS-PABO-OPERS      PIC  9(08).                      039600      
001036         04  WKS-PABO-IMPOR.                                      039700      
001037             05 WKS-PABO-IMPOR-E PIC  9(16).                      039800      
001038             05 WKS-PABO-IMPOR-P PIC  X(01).                      039900      
001039             05 WKS-PABO-IMPOR-D PIC  9(02).                      040000      
001040         04  FILLER              PIC  X(02).                      040100      
001041                                                                  040200      
001042 01  WKS-POR-ALARMAS.                                             040300      
001043* Long. reg. Totales  101 * 17 = 1717                             040400      
001044     03  WKS-OCS-ALARMAS      OCCURS  17  TIMES.                  040500      
001045         04  WKS-ACSI-ORIGEN     PIC  9(02).                      040600      
001046         04  WKS-ANUM-SISTEMA    PIC  9(04).                      040700      
001047         04  WKS-ANUM-PRODUCTO   PIC  9(04).                      040800      
001048         04  WKS-ANUM-INSTRUM    PIC  9(02).                      040900      
001049         04  WKS-ANUM-MONEDA     PIC  9(03).                      041000      
001050         04  WKS-ANUM-AUTORIG    PIC  9(08).                      041100      
001051         04  WKS-ANUM-AUTO151    PIC  9(08).                      041200      
001052         04  WKS-ANUM-AUTO3ER    PIC  9(08).                      041300      
001053         04  WKS-ANUM-CUENTA.                                     041400      
001054             05  WKS-ANUM-SUC    PIC  9(04).                      041500      
001055             05  WKS-ANUM-CTA    PIC  9(16).                      041600      
001056         04  WKS-SUC-TRANSM      PIC  9(04).                      041700      
001057         04  WKS-CJA-TRANSM      PIC  9(02).                      041800      
001058         04  WKS-HOR-TRANSAC     PIC  9(06).                      041900      
001059         04  WKS-CVE-TRANSAC     PIC  9(06).                      042000      
001060         04  WKS-IND-CONTABLE    PIC  9(02).                      042100      
001061         04  WKS-IMP-TRANSAC.                                     042200      
001062             05 WKS-IMP-TRANSAC-E PIC 9(16).                      042300      
001063             05 WKS-IMP-TRANSAC-P PIC X(01).                      042400      
001064             05 WKS-IMP-TRANSAC-D PIC 9(02).                      042500      
001065         04  WKS-CVE-ALARMA      PIC  9(01).                      042600      
001066         04  WKS-ANUM-OCCURS     PIC  9(02).                      042700      
001067*                                                                 042800      
001068*-----------------------------------------------------------------042900      
001069*                                               VARIABLES MENSAJES043000      
001070*                                               ------------------043100      
001071 01  WKS-DELAY-LJ.                                                043200      
001072     02  FILLER                 PIC X(47) VALUE                   043300      
001073         "LAPSO P/ENVIAR INFORMACION A BIFIN CAMBIADO A ".        043400      
001074      02  WKS-DELAY             PIC 9(04) VALUE 600.              043500      
001075     02  FILLER                 PIC X(10) VALUE " SEGUNDOS.".     043600      
001076                                                                  043700      
001077 77  WKS-MENSAJES-ENVIADOS      PIC 9(8) VALUE 0.                 043800      
001078 77  WKS-MENSAJES-RECIBIDOS     PIC 9(8) VALUE 0.                 043900      
001079                                                                  044000      
001080 01  WKS-TEXTO-LJ.                                                044100      
001081     03 WKS-TEXTO-LJ-TXTMSGENV   PIC X(20).                       044200      
001082     03 WKS-TEXTO-LJ-NUMMSGENV   PIC 9(08).                       044300      
001083     03 WKS-TEXTO-LJ-TXTMSGRES   PIC X(20).                       044400      
001084     03 WKS-TEXTO-LJ-NUMMSGRES   PIC 9(08).                       044500      
001085     03 WKS-TEXTO-LJ-TXTINTENV   PIC X(20).                       044510      
001086     03 WKS-TEXTO-LJ-NUMINTENV   PIC 9(08).                       044520      
001087     03 WKS-TEXTO-LJ-SEMAFORO    PIC X(14).                       044600      
001088*                                                                 044700      
001089*-----------------------------------------------------------------044800      
001090*                                              FORMATO DE DIALOGOS044900      
001091*                                              -------------------045000      
001092 01  WKS-SOPCOM-COMANDO          PIC X(30).                       045100      
001093 01  WKS-SOPCOM-TRABAJO          PIC X(132).                      045200      
001094*                                                                 045300      
001095 77  WS-COMS-AG-OUTPUT-DESG                 REAL.                 045400      
001096 77  WS-COMS-DEF-STA-DESG                   REAL.                 045500      
001097                                                                  045600      
001098 01  WS-COMS-AG-OUTPUT-NAME      PIC  X(15).                      045700      
001099 01  WS-COMS-DEF-STA-NAME        PIC  X(14).                      045800      
001100                                                                  045900      
001101 77  WS-ESPERACOMS-TIEMPO        PIC S9(11) BINARY VALUE  60.     046000      
001102 77  WS-ESPERACOMS-TIPO-EVENTO   PIC S9(11) BINARY.               046100      
001103                                                                  046200      
001104 01  WKS-MENSAJE-DIALOGO.                                         046300      
001105     02 WKS-HEADER-SECAS.                                         046400      
001106        04 WKS-HDR-PREFIJO           PIC X.                       046500      
001107        04 WKS-HDR-APLIDESTINO       PIC X.                       046600      
001108        04 WKS-HDR-CSIDESTINO        PIC 9(02).                   046700      
001109        04 WKS-HDR-LSN.                                           046800      
001110           06 WKS-HDR-LSNORIGEN      PIC 9(04).                   046900      
001111           06 WKS-HDR-LSNORIGEN-HEX  REDEFINES WKS-HDR-LSNORIGEN  047000      
001112                                     PIC 9(08) COMP.              047100      
001113        04 WKS-HDR-STATION.                                       047200      
001114           06 WKS-HDR-STA-TIPO       PIC X.                       047300      
001115           06 WKS-HDR-STA-SUC        PIC 9(04).                   047400      
001116           88 W88-HDR-SUC-OK                 VALUE 0001 THRU 0999,047500      
001117                                                   4001 THRU 4899.047600      
001118           06 WKS-HDR-STA-PRIV       PIC X.                       047700      
001119           06 WKS-HDR-STA-CAJA       PIC 9(02).                   047800      
001120        04 WKS-HDR-CSIORIGEN         PIC 9(02).                   047900      
001121        04 WKS-HDR-COMPUT-ORIGEN     PIC 9(02).                   048000      
001122        04 WKS-HDR-NIVSEG            PIC X(02).                   048100      
001123        04 WKS-HDR-APLIORIGEN        PIC X.                       048200      
001124        04 WKS-HDR-RESULT            PIC 9(02).                   048300      
001125           88  W88-A-TERMINAL                   VALUE 01.         048400      
001126           88  W88-VINO-DEAPLICACION            VALUE 02,04.      048500      
001127           88  W88-VINO-DE3ERNIVEL              VALUE 04.         048600      
001128           88  W88-A-PANTALLA                   VALUE 03.         048700      
001129           88  W88-A-3ERNIVEL                   VALUE 06.         048800      
001130           88  W88-VINO-DETERMINAL              VALUE 11,12.      048900      
001131           88  W88-VINO-DETERMLOCAL             VALUE 11.         049000      
001132           88  W88-VINO-DETERMREMOTA            VALUE 12.         049100      
001133           88  W88-ERROR-APLICACION             VALUE 31,32,33.   049200      
001134           88  W88-ERROR-ENHEADER               VALUE 21.         049300      
001135        04 WKS-HDR-SCREEN            PIC 9(05).                   049400      
001136        04 WKS-HDR-SEGURIDAD         PIC 9(06).                   049500      
001137*                                                                 049600      
001138*-----                                          MENSAJES A S704   049700      
001139*                                               ---------------   049800      
001140     02 WKS-HDR-TEXTO.                                            049900      
001141        03  WKS-SA2-ACA.                                          050000      
001142            04  WKS-SA2-ACA-DEST     PIC 9(06).                   050100      
001143            04  WKS-SA2-ACA-ORIG     PIC 9(06).                   050200      
001144        03  WKS-SA2-TRANS-DEST.                                   050300      
001145            04  WKS-SA2-TDE-SIST     PIC 9(04).                   050400      
001146            04  WKS-SA2-TDE-CODI     PIC 9(02).                   050500      
001147            04  WKS-SA2-TDE-SCOD     PIC 9(03).                   050600      
001148        03  WKS-SA2-TRANS-ORIG.                                   050700      
001149            04  WKS-SA2-TOR-SIST     PIC 9(04).                   050800      
001150            04  WKS-SA2-TOR-CODI     PIC 9(02).                   050900      
001151            04  WKS-SA2-TOR-SCOD     PIC 9(03).                   051000      
001152        03  WKS-SA2-INTER-COMUN.                                  051100      
001153            04  WKS-SA2-INT-DIRE     PIC 9(01).                   051200      
001154            04  WKS-SA2-INT-LONG     PIC 9(04).                   051300      
001155            04  WKS-SA2-INT-TOUT     PIC 9(05).                   051400      
001156            04  WKS-SA2-INT-RSLT     PIC 9(02).                   051500      
001157        03  WKS-SA2-CTRL-FORMATO.                                 051600      
001158            04  WKS-SA2-FMT-IDEN     PIC 9(02).                   051700      
001159            04  WKS-SA2-FMT-RECO     PIC 9(01).                   051800      
001160            04  WKS-SA2-FMT-VERS     PIC X(01).                   051900      
001161        03  WKS-SA2-TIPO-MENSAJE.                                 052000      
001162            04  WKS-SA2-TPO-CLSE     PIC 9(01).                   052100      
001163            04  WKS-SA2-TPO-RSLT     PIC 9(01).                   052200      
001164            04  WKS-SA2-TPO-MODO     PIC 9(01).                   052300      
001165        03  WKS-SA2-IDEN-TRANSAC.                                 052400      
001166            04  WKS-SA2-IDT-NSUC     PIC 9(04).                   052500      
001167            04  WKS-SA2-IDT-CAJA     PIC 9(03).                   052600      
001168            04  WKS-SA2-IDT-NUMT     PIC 9(08).                   052700      
001169            04  WKS-SA2-IDT-FECH     PIC 9(06).                   052800      
001170            04  WKS-SA2-IDT-HORA     PIC 9(06).                   052900      
001171            04  WKS-SA2-IDT-MODA     PIC 9(02).                   053000      
001172            04  WKS-SA2-IDT-OPER     PIC X(10).                   053100      
001173            04  WKS-SA2-IDT-VERS     PIC X(01).                   053200      
001174        03  WKS-SA2-ENVIO-MENSAJE.                                053300      
001175            04  WKS-SA2-DAT-CNTE     PIC X(1925).                 053400      
001176        03  WKS-SA2-RESP-APLIC REDEFINES WKS-SA2-ENVIO-MENSAJE.   053500      
001177            04  WKS-SA2-RAP-AUTO     PIC 9(04).                   053600      
001178            04  WKS-SA2-RAP-FILL     PIC X(1921).                 053700      
001179        03  WKS-SA2-RESP-RECHA REDEFINES WKS-SA2-ENVIO-MENSAJE.   053800      
001180            04  WKS-SA2-ERR-NUME     PIC 9(04).                   053900      
001181            04  WKS-SA2-ERR-TEXT     PIC X(80).                   054000      
001182            04  WKS-SA2-ERR-FILL     PIC X(1841).                 054100      
001183*                                                                 054200      
001184**************************************************************    054300      
001185*    VARIABLES PARA OBTENER DATOS DEL HOST DONDE SE CORRE    *    054400      
001186**************************************************************    054500      
001187 01  WKS-DATOS-HOST.                                              054600      
001188     03 WKS-NUM-CSI                          PIC 9(02).           054700      
001189     03 WKS-NOMEQUIPO                        PIC X(10).           054800      
001190     03 WKS-NOMCSI                           PIC X(26).           054900      
001191     03 WKS-LINEABATCH                       PIC X(05).           055000      
001192*                                                                 055100      
001193******************************************************************055200      
001194*         AREA  PARA  HEADER  DE  COMUNICACIONES                 *055300      
001195******************************************************************055400      
001196*                                                                 055500      
001197  COMMUNICATION   SECTION.                                        055600      
001198* =============                                                   055700      
001199*                                                                 055800      
001200 INPUT HEADER COMS-IN;                                            055900      
001201*             =======                                             056000      
001202     PROGRAMDESG           IS  COMS-IN-PROGRAM;                   056100      
001203     FUNCTIONSTATUS        IS  COMS-IN-FUNCTION-STATUS;           056200      
001204     FUNCTIONINDEX         IS  COMS-IN-FUNCTION-INDEX;            056300      
001205     USERCODE              IS  COMS-IN-USERCODE;                  056400      
001206     SECURITYDESG          IS  COMS-IN-SECURITY-DESG;             056500      
001207     TRANSPARENT           IS  COMS-IN-TRANSPARENT;               056600      
001208     VTFLAG                IS  COMS-IN-VT-FLAG;                   056700      
001209     TIMESTAMP             IS  COMS-IN-TIMESTAMP;                 056800      
001210     STATION               IS  COMS-IN-STATION;                   056900      
001211     TEXTLENGTH            IS  COMS-IN-TEXT-LENGTH;               057000      
001212     STATUSVALUE           IS  COMS-IN-STATUS-KEY;                057100      
001213     MESSAGECOUNT          IS  COMS-IN-MSG-COUNT;                 057200      
001214     RESTART               IS  COMS-IN-RST-LOC;                   057300      
001215     AGENDA                IS  COMS-IN-AGENDA.                    057400      
001216*                                                                 057500      
001217 OUTPUT  HEADER  COMS-OUT;                                        057600      
001218*                =========                                        057700      
001219     DESTCOUNT             IS  COMS-OUT-COUNT;                    057800      
001220     TEXTLENGTH            IS  COMS-OUT-TEXT-LENGTH;              057900      
001221     STATUSVALUE           IS  COMS-OUT-STATUS-KEY;               058000      
001222     TRANSPARENT           IS  COMS-OUT-TRANSPARENT;              058100      
001223     VTFLAG                IS  COMS-OUT-VT-FLAG;                  058200      
001224     CONFIRMFLAG           IS  COMS-OUT-CONFIRM-FLAG;             058300      
001225     CONFIRMKEY            IS  COMS-OUT-CONFIRM-KEY;              058400      
001226     DESTINATIONDESG       IS  COMS-OUT-DESTINATION;              058500      
001227     NEXTINPUTAGENDA       IS  COMS-OUT-NEXT-INPUT-AGENDA;        058600      
001228     SETNEXTINPUTAGENDA    IS  COMS-OUT-SET-NEXT-INPUT-AGENDA;    058700      
001229     RETAINTRANSACTIONMODE IS  COMS-OUT-SAVE-TRANS-MODE;          058800      
001230     AGENDA                IS  COMS-OUT-AGENDA.                   058900      
001231*                                                                 059000      
001232******************************************************************059100      
001233*                                                                 059200      
001234 PROCEDURE DIVISION.                                              059300      
001235*                                                                 059400      
001236*-----------------------------------------------------------------059500      
001237*                                                                 059600      
001238 DECLARATIVES.                                                    059700      
001239*                                                                 059800      
001240*-----                                                            059900      
001241*                                                                 060000      
001242 000000-HI-OPERADOR SECTION. USE AS INTERRUPT PROCEDURE.          060100      
001243*                                                                 060200      
001244 INTERRUPT-BY-HI.                                                 060300      
001245*-----------------                                                060400      
001246     DISALLOW INTERRUPT.                                          060500      
001247                                                                  060600      
001248     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-TPO-HI.            060700      
001249                                                                  060800      
001250      IF W77-TPO-HI = 01                                          060900      
001251         MOVE 1                       TO CONTADOR-LJ              061500      
001252         MOVE "MSG ENVIADOS      : "  TO WKS-TEXTO-LJ-TXTMSGENV   061600      
001253         MOVE WKS-MENSAJES-ENVIADOS   TO WKS-TEXTO-LJ-NUMMSGENV   061700      
001254         MOVE "  MSG RECIBIDOS   : "  TO WKS-TEXTO-LJ-TXTMSGRES   061800      
001255         MOVE WKS-MENSAJES-RECIBIDOS  TO WKS-TEXTO-LJ-NUMMSGRES   061900      
001256         MOVE " INTERVALO ENVIO  : "  TO WKS-TEXTO-LJ-TXTINTENV   061910      
001257         MOVE WKS-DELAY               TO WKS-TEXTO-LJ-NUMINTENV   061920      
001258         IF W77-ACTIVO = 0                                        061930      
001259            MOVE " ENVIO ACTIVO "     TO WKS-TEXTO-LJ-SEMAFORO    061940      
001260            MOVE WKS-TEXTO-LJ         TO TEXTO-LJ                 061950      
001261            CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,          061960      
001262                                            MENSAJE-LJ            061965      
001263         ELSE                                                     061970      
001264            MOVE " ENVIO APAGADO"     TO WKS-TEXTO-LJ-SEMAFORO    061980      
001265            MOVE WKS-TEXTO-LJ         TO TEXTO-LJ                 062000      
001266            CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,          062100      
001267                                            MENSAJE-LJ.           062110      
001268                                                                  062200      
001269     IF W77-TPO-HI = 02                                           062300      
001270        IF W77-ACTIVO-MONITOR = 0                                 062310      
001271           MOVE     1            TO CONTADOR-LJ                   062900      
001272           MOVE "PRENDO MONITOR" TO TEXTO-LJ                      063000      
001273           ACCEPT WS-HORA        FROM TIME                        063010      
001274           MOVE WS-HHMMSS        TO NOM-MON-HR                    063020      
001275           CHANGE ATTRIBUTE TITLE OF E00-MTV TO WKS-ETIQ-MONITOR  063030      
001276           OPEN OUTPUT E00-MTV                                    063040      
001277           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ063100      
001278           MOVE 1 TO W77-ACTIVO-MONITOR.                          063200      
001279                                                                  063300      
001280     IF W77-TPO-HI = 03                                           063400      
001281        IF W77-ACTIVO-MONITOR = 1                                 063410      
001282           MOVE     1            TO CONTADOR-LJ                   064000      
001283           MOVE "APAGO MONITOR"  TO TEXTO-LJ                      064100      
001284           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ064200      
001285           CLOSE E00-MTV          WITH SAVE                       064210      
001286           MOVE 0 TO W77-ACTIVO-MONITOR.                          064300      
001287                                                                  064400      
001288     IF W77-TPO-HI = 04                                           064500      
001289        MOVE        9                       TO  W77-SW-FIN        064600      
001290        MOVE "DISABLE NOW PROGRAM S151P011" TO  WKS-SOPCOM-COMANDO064700      
001291        CALL "SMCOMS OF SOPORTECOMS" USING  WKS-SOPCOM-COMANDO    064800      
001292                                            WKS-SOPCOM-TRABAJO    064900      
001293                                     GIVING W77-COMS-RESULT       065000      
001294        IF W77-COMS-RESULT = 1                                    065100      
001295           MOVE     1          TO CONTADOR-LJ                     065700      
001296           MOVE "NO ACEPTO DISABLE SOPCOMS"                       065800      
001297                               TO TEXTO-LJ                        065900      
001298           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,           066000      
001299                                           MENSAJE-LJ.            066002      
001300                                                                  066004      
001301     IF W77-TPO-HI = 11                                           066006      
001302        MOVE     1           TO CONTADOR-LJ                       066018      
001303        MOVE "SUSPENDE ENVIO" TO TEXTO-LJ                         066020      
001304        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ   066022      
001305        MOVE ZERO            TO W77-SW-BATCH                      066024      
001306        PERFORM 500100-LOCK-GLOBALES                              066026      
001307        MOVE 1               TO B00-GLO-STAPROC                   066028      
001308                                W77-ACTIVO                        066029      
001309        BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                066030      
001310        PERFORM 500200-UPDATE-GLOBALES                            066032      
001311        END-TRANSACTION   NO-AUDIT S151B99REINICTL.               066040      
001312                                                                  066042      
001313     IF W77-TPO-HI = 12                                           066044      
001314        MOVE     1           TO CONTADOR-LJ                       066056      
001315        MOVE ZERO            TO W77-ACTIVO                        066057      
001316        MOVE "ACTIVA ENVIO"  TO TEXTO-LJ                          066058      
001317        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ   066060      
001318        MOVE ZERO            TO W77-SW-BATCH                      066062      
001319        PERFORM 500100-LOCK-GLOBALES                              066064      
001320        MOVE 0               TO B00-GLO-STAPROC                   066065      
001321        BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                066066      
001322        PERFORM 500200-UPDATE-GLOBALES                            066068      
001323        END-TRANSACTION   NO-AUDIT S151B99REINICTL.               066069      
001324                                                                  066070      
001325     IF W77-TPO-HI = 13                                           066072      
001326        MOVE     1           TO CONTADOR-LJ                       066165      
001327        MOVE "REENVIO BATCH" TO TEXTO-LJ                          066170      
001328        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ   066175      
001329        MOVE ZERO            TO W77-SW-BATCH                      066180      
001330        PERFORM 200100-ENVIA-BATCH.                               066185      
001331*                                                                 066200      
001332*-----                                                            066300      
001333*                                                                 066400      
001334     IF W77-TPO-HI = 14                                           066500      
001335        IF W77-NODO-DES = 15                                      066600      
001336           MOVE      16                       TO W77-NODO-DES     066700      
001337           MOVE     1                         TO CONTADOR-LJ      067300      
001338           MOVE "NODO DESTINO CAMBIADO A 16 " TO TEXTO-LJ         067400      
001339           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ067500      
001340        ELSE                                                      067600      
001341           MOVE      15                       TO W77-NODO-DES     067700      
001342           MOVE     010201                    TO CODIGO-LJ        068200      
001343           MOVE     1                         TO CONTADOR-LJ      068300      
001344           MOVE "NODO DESTINO CAMBIADO A 15 " TO TEXTO-LJ         068400      
001345          CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ.068500      
001346*                                                                 068600      
001347*-----                                     INCREMENTA EL INTERVALO068700      
001348*                                          DE ENVIO EN 5 MINUTOS  068800      
001349     IF W77-TPO-HI = 15                                           068900      
001350        COMPUTE WKS-DELAY = WKS-DELAY + 300                       069000      
001351        MOVE     1          TO CONTADOR-LJ                        069600      
001352        MOVE WKS-DELAY-LJ   TO TEXTO-LJ                           069700      
001353        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ.  069800      
001354*                                                                 069900      
001355*-----                                     DECREMENTA EL INTERVALO070000      
001356*                                          DE ENVIO EN 5 MINUTOS  070100      
001357     IF W77-TPO-HI = 16                                           070200      
001358        MOVE     1          TO CONTADOR-LJ                        070900      
001359        IF WKS-DELAY > 600                                        070950      
001360           COMPUTE WKS-DELAY = WKS-DELAY - 300                    070980      
001361           MOVE WKS-DELAY-LJ   TO TEXTO-LJ                        071000      
001362           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,MENSAJE-LJ 071100      
001363        ELSE                                                      071110      
001364           MOVE WKS-DELAY-LJ   TO TEXTO-LJ                        071115      
001365           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,MENSAJE-LJ.071120      
001366*                                                                 071125      
001367*-----                                     RESET AL INTERVALO DE  071130      
001368*                                          ENVIO EN 10 MINUTOS    071135      
001369     IF W77-TPO-HI = 17                                           071140      
001370        MOVE 600            TO WKS-DELAY                          071145      
001371        MOVE     1          TO CONTADOR-LJ                        071175      
001372        MOVE WKS-DELAY-LJ   TO TEXTO-LJ                           071180      
001373        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ.  071185      
001374*                                                                 071200      
001375*-----                                                            071300      
001376*                                                                 071400      
001377 END-INTERRUPT-BY-HI.                                             071500      
001378     ALLOW INTERRUPT.                                             071600      
001379*                                                                 071700      
001380*-----                                                            071800      
001381*                                                                 071900      
001382 END DECLARATIVES.                                                072000      
001383*                                                                 072100      
001384******************************************************************072200      
001385*                                                                 072300      
001386 000000-PROCESO-GENERAL SECTION.                                  072400      
001387                                                                  072500      
001388 000000-RAIZ.                                                     072600      
001389     DISALLOW INTERRUPT                                           072700      
001390     PERFORM  100000-INICIO                                       072800      
001391     ALLOW    INTERRUPT                                           072900      
001392     WAIT(60)                                                     072910      
001393     PERFORM  200000-PROCESO UNTIL W77-SW-FIN = 9                 073000      
001394     DISALLOW INTERRUPT                                           073100      
001395     PERFORM  300000-FIN                                          073200      
001396     STOP RUN.                                                    073300      
001397*                                                                 073400      
001398******************************************************************073500      
001399*                                                                 073600      
001400 100000-INICIO.                                                   073700      
001401                                                                  073702      
001402     MOVE    "S151"      TO SISTEMA-LJ                            073704      
001403     MOVE    "P011"      TO PASO-LJ                               073706      
001404     MOVE W77-MI-VERSION TO MTP-LJ                                073708      
001405     MOVE    "I"         TO TIPO-LJ                               073710      
001406     MOVE     010201     TO CODIGO-LJ                             073712      
001407      OPEN UPDATE S151BD13BIFIN                                   073714      
001408        ON EXCEPTION                                              073720      
001409           MOVE "E"        TO TIPO-LJ                             073730      
001410           MOVE 010201     TO CODIGO-LJ                           073740      
001411           MOVE "S151/P011:ERROR AL ABRIR LA BD S151DB"           073750      
001412           TO  TEXTO-LJ                                           073760      
001413           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ,           073770      
001414                                           MENSAJE-LJ             073788      
001415           CALL SYSTEM DMTERMINATE.                               073790      
001416     ATTACH 000000-HI-OPERADOR TO ATTRIBUTE EXCEPTIONEVENT        073800      
001417                                               OF MYSELF          073900      
001418                                                                  074000      
001419     MOVE ATTRIBUTE HOSTNAME OF MYSELF TO W77-MI-HOST.            074100      
001420     ACCEPT WKS-FECHA-MAQUINA  FROM DATE.                         075000      
001421                                                                  075100      
001422     MOVE WKS-FECMQ-ANIO       TO  WKS-FMAQ-ANIO                  075200      
001423     MOVE WKS-FECMQ-MES        TO  WKS-FMAQ-MES                   075300      
001424     MOVE WKS-FECMQ-DIA        TO  WKS-FMAQ-DIA                   075400      
001425     MOVE WKS-FECHA-MAQ        TO  WKS-FECHA-MAC-AAMMDD           075500      
001426                                   NOM-MON-FEC                    075600      
001427     MOVE WKS-FEC-MAQ-06       TO  WKS-TASK-FECHA                 075700      
001428                                                                  075800      
001429     MOVE ATTRIBUTE MIXNUMBER  OF  MYSELF TO WKS-TASK-MIX         075900      
001430                                             NOM-MON-MIX          076000      
001431*                                                                 076100      
001432*-----                                               LIBDESPLIEGA 076200      
001433*                                                    ------------ 076300      
001434     CHANGE ATTRIBUTE TITLE OF "LIBDESPLIEGA" TO                  076400      
001435           "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK"         076500      
001436     MOVE  "S151"           TO SISTEMA-LJ                         076600      
001437     MOVE  "P011"           TO PASO-LJ                            076700      
001438                                                                  076800      
001439     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVERS" TO BYFUNCTION.    076900      
001440     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVERS" TO "CTLVERS".     077000      
001441                                                                  077100      
001442     MOVE "S151L001CTL "           TO WKS-CTRV-LIBRERIA.          077200      
001443     CALL "DAME_TIT IN CTLVERS"    USING                          077300      
001444                                   WKS-CTRV-LIBRERIA,             077400      
001445                                   WKS-CTRV-TITULO                077500      
001446                            GIVING WKS-CTRV-STATUS.               077600      
001447     IF W77-ESTATUS < 0                                           077700      
001448        MOVE "E"        TO TIPO-LJ                                077800      
001449        MOVE 010201     TO CODIGO-LJ                              077900      
001450        MOVE "S151/P011:ERROR EN VERSION S151L001 " TO TEXTO-LJ   078000      
001451        CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ, MENSAJE-LJ   078100      
001452     ELSE                                                         078200      
001453        CHANGE ATTRIBUTE TITLE  OF "S151L001" TO WKS-CTRV-TITULO. 078205      
001454                                                                  078210      
001455     MOVE 1                        TO WKS-B01-FUNCION.            078215      
001456     MOVE 500                      TO WKS-B01-SISTEMA.            078225      
001457     CALL "CONSISDIA IN S151L001"  USING  WKS-S151B01SISDIA       078230      
001458                                   GIVING W77-RESULT-LIBCON.      078235      
001459     IF W77-RESULT-LIBCON = 0                                     078240      
001460        MOVE WKS-B01-FECCON        TO WKS-FECHA-MAQ               078245      
001461                                      WKS-FECHA-BASE              078250      
001462                                      WKS-TASK-FECHA.             078260      
001463*                                                                 086000      
001464*-----------------------------------------------------------------086100      
001465*                                                                 086200      
001466     CHANGE ATTRIBUTE LIBACCESS    OF "DCILIBRARY"                086300      
001467                                   TO  BYFUNCTION                 086400      
001468     CHANGE ATTRIBUTE FUNCTIONNAME OF "DCILIBRARY"                086500      
001469                                   TO "COMSSUPPORT."              086600      
001470     ENABLE INPUT COMS-IN KEY "ONLINE".                           086700      
001471     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS"               086800      
001472                                   TO  BYFUNCTION                 086900      
001473     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               087000      
001474                                   TO "SOPORTECOMS."              087100      
001475     CALL "CSIID  OF SOPORTECOMS"                                 087200      
001476          USING   WKS-DATOS-HOST.                                 087300      
001477     MOVE WKS-NUM-CSI              TO W77-NUMCSI                  087400      
001478                                      W77-MI-CSI                  087500      
001479                                      WKS-TASK-NODO.              087600      
001480     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-TASK-MIX.          087610      
001481     SET MYSELF (OPTION)           TO 1926.                       087620      
001482     SET MYSELF (FILECARDS)        TO WKS-TASK-TITLE.             087630      
001483                                                                  087640      
001484     MOVE "OUTPUT OF LINEA"        TO WS-COMS-AG-OUTPUT-NAME      087700      
001485     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               087800      
001486          USING  WS-COMS-AG-OUTPUT-NAME                           087900      
001487                 VALUE AGENDA                                     088000      
001488                 WS-COMS-AG-OUTPUT-DESG                           088100      
001489          GIVING W77-COMS-RESULT                                  088200      
001490     IF W77-COMS-RESULT NOT = 0                                   088300      
001491        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  088400      
001492                                                                  088500      
001493     MOVE "DEFAULTSTATION"         TO WS-COMS-DEF-STA-NAME        088600      
001494     CALL "GET-DESIGNATOR-USING-NAME OF DCILIBRARY"               088700      
001495           USING  WS-COMS-DEF-STA-NAME                            088800      
001496                  VALUE STATION                                   088900      
001497                  WS-COMS-DEF-STA-DESG                            089000      
001498           GIVING W77-COMS-RESULT                                 089100      
001499     IF W77-COMS-RESULT NOT = 0                                   089200      
001500        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  089300      
001501*                                                                 090800      
001502*-----------------------------------------------------------------090900      
001503*                                                                 091000      
001504                                                                  091100      
001505     PERFORM 500100-LOCK-GLOBALES                         .       091200      
001506     MOVE B00-GLO-STAPROC      TO W77-ACTIVO.                     091205      
001507     IF B00-GLO-FECPROC = WKS-FECHA-BASE                          091210      
001508        MOVE B00-GLO-CONS-BIFIN   TO W77-NUM-TRAN                 091220      
001509     ELSE                                                         091230      
001510        MOVE WKS-FECHA-BASE TO B00-GLO-FECPROC                    091300      
001511        IF W77-MI-CSI = 4                                         091400      
001512           MOVE 40000          TO W77-NUM-T                       091500      
001513           MOVE WKS-FECBD-DD   TO W77-NUM-T-D                     091510      
001514           MOVE W77-NUM-TRAN   TO B00-GLO-CONS-BIFIN              091600      
001515        ELSE                                                      091700      
001516           MOVE 0              TO W77-NUM-TRAN                    091800      
001517                                  B00-GLO-CONS-BIFIN.             091900      
001518                                                                  092000      
001519     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                   092100      
001520     PERFORM 500200-UPDATE-GLOBALES                               092200      
001521     END-TRANSACTION   NO-AUDIT S151B99REINICTL                   092300      
001522                                                                  092400      
001523     MOVE   0    TO  W77-RECUPERA                                 092500      
001524                     W77-SW-FIN                                   092600      
001525                     W77-MSG-PEND                                 092700      
001526                     W77-SW-ALARMAS                               092800      
001527                     W77-SW-TOTALES                               092900      
001528                     W77-SW-BATCH.                                093000      
001529                                                                  093100      
001530     MOVE SPACES TO  WKS-POR-PROD-INST                            093200      
001531                     WKS-POR-ALARMAS.                             093300      
001532*                                                                 093400      
001533******************************************************************093500      
001534*                                                                 093600      
001535 200000-PROCESO.                                                  093700      
001536*                                                                 093800      
001537*---                                                 ENVIO ALARMAS093900      
001538*                                                    -------------094000      
001539     IF W77-SW-ALARMAS = 0 AND W77-ACTIVO = 0                     094100      
001540        PERFORM 501000-FIRST-ALARMAS.                             094200      
001541                                                                  094300      
001542     IF W77-SW-ALARMAS < 2 AND  W77-ACTIVO = 0                    094400      
001543        PERFORM 209000-BORRA-B06                                  094500      
001544        MOVE   0    TO W77-SW-ERROR                               094600      
001545                       W77-SW-ALARMAS                             094700      
001546                       W77-IND                                    094800      
001547        PERFORM 209100-BORRA-ALARMAS                              094900      
001548        PERFORM 210000-ENVIA-ALARMAS UNTIL W77-SW-ALARMAS > 0     095000      
001549        IF W77-IND > 0                                            095100      
001550           MOVE WKS-POR-ALARMAS TO  WKS-RESTO-DATOS               095200      
001551*--> Long del Mensaje , head = 36 , SA2 = 89, Datos = 1739        095300      
001552           MOVE 1864   TO WKS-ACEPTA-LENG                         095400      
001553       COMPUTE WKS-LENG-DATOS = (147 + (WKS-NUM-RENGLONES * 101)) 095500      
001554           PERFORM 250000-ENVIA-MENSAJE.                          095600      
001555*                                                                 095700      
001556*---                                                 ENVIO TOTALES095800      
001557*                                                    -------------095900      
001558                                                                  095910      
001559     IF W77-SW-TOTALES = 0 AND  W77-ACTIVO = 0                    096000      
001560        PERFORM 503000-FIRST-TOTPROD.                             096100      
001561                                                                  096200      
001562     IF W77-SW-TOTALES < 2 AND W77-ACTIVO = 0                     096300      
001563        PERFORM 209000-BORRA-B06                                  096400      
001564        MOVE   0    TO W77-SW-ERROR                               096500      
001565                       W77-SW-TOTALES                             096600      
001566                       W77-IND                                    096700      
001567        PERFORM 209200-BORRA-TOTPROD                              096800      
001568        PERFORM 220000-ENVIA-TOTALES UNTIL W77-SW-TOTALES > 0     096900      
001569        IF W77-IND > 0                                            097000      
001570           MOVE WKS-POR-PROD-INST TO WKS-RESTO-DATOS              097100      
001571*--> Long del Mensaje , head = 36 , SA2 = 89, Datos = 1734        097200      
001572           MOVE 1859      TO WKS-ACEPTA-LENG                      097300      
001573       COMPUTE WKS-LENG-DATOS = (147 + (WKS-NUM-RENGLONES * 107)) 097400      
001574           PERFORM 250000-ENVIA-MENSAJE.                          097500      
001575*                                                                 097600      
001576*---                                                   ENVIO BATCH097700      
001577*                                                      -----------097800      
001578     ACCEPT  WS-HORA             FROM TIME.                       097810      
001579     IF WS-HHMMSS > 060000  AND WS-HHMMSS < 070000 AND            097820      
001580        W77-ACTIVO = 0                                            097824      
001581        PERFORM  200100-ENVIA-BATCH                               097830      
001582     ELSE                                                         097840      
001583     IF WS-HHMMSS > 070000                                        097850      
001584         MOVE 2                    TO W77-SW-BATCH.               097860      
001585*                                                                 099700      
001586*---                                         RECIBE MENSAJES TIMEO099800      
001587*                                            ---------------------099900      
001588     MOVE  0 TO W77-SW-ERROR                                      100000      
001589                W77-SW-RECIBE                                     100100      
001590                W77-IND                                           100200      
001591     PERFORM 240000-RECIBE UNTIL W77-SW-RECIBE > 0 OR             100300      
001592                                 W77-SW-FIN    = 9                100400      
001593*                                                                 100410      
001594*---                                         RECIBE MENSAJES TIMEO100500      
001595*                                            ---------------------100600      
001596                                                                  101000      
001597     IF W77-SW-FIN = 9                                            101100      
001598        NEXT SENTENCE                                             101200      
001599     ELSE                                                         101300      
001600        PERFORM 240000-RECIBE                                     101700      
001601        MOVE      0          TO W77-SW-ALARMAS                    101800      
001602                                W77-SW-TOTALES.                   101900      
001603*                                                                 102100      
001604*-----------------------------------------------------------------102200      
001605*                                                                 102300      
001606 200100-ENVIA-BATCH.                                              102305      
001607*===================                                              102310      
001608     IF W77-SW-BATCH = 0                                          102315      
001609        PERFORM 505000-FIRST-TOTBATCH.                            102320      
001610                                                                  102328      
001611     IF W77-SW-BATCH < 2                                          102330      
001612        PERFORM 209000-BORRA-B06                                  102335      
001613        MOVE   0    TO W77-SW-ERROR                               102340      
001614                       W77-SW-BATCH                               102345      
001615                       W77-IND                                    102350      
001616        MOVE   1    TO W77-SW-LEIBATCH                            102355      
001617        PERFORM 209200-BORRA-TOTPROD                              102360      
001618        MOVE B05-TOT-FECINF   TO WKS-B06-FECINF                   102365      
001619        PERFORM 230000-ENVIA-BATCH  UNTIL W77-SW-BATCH > 0.       102370      
001620                                                                  102380      
001621 209000-BORRA-B06.                                                102400      
001622     MOVE     SPACES      TO  WKS-B06-TPO-MENS                    102500      
001623     MOVE       0         TO  WKS-B06-FECINF                      102600      
001624                              WKS-B06-CSI                         102700      
001625                              W77-IND                             102800      
001626     PERFORM 209010-BORRAB06 VARYING W77-IND FROM 1 BY 1          102900      
001627                               UNTIL W77-IND > 17                 103000      
001628     MOVE   0    TO W77-IND.                                      103100      
001629*                                                                 103200      
001630*-----                                                            103300      
001631*                                                                 103400      
001632 209010-BORRAB06.                                                 103500      
001633     MOVE 0  TO  WKS-B06-SISTEMA    (W77-IND)                     103600      
001634                 WKS-B06-PRODUCTO   (W77-IND)                     103700      
001635                 WKS-B06-INSTSERV   (W77-IND)                     103800      
001636                 WKS-B06-MONEDA     (W77-IND)                     103900      
001637                 WKS-B06-CPAE       (W77-IND)                     104000      
001638                 WKS-B06-NUM-T      (W77-IND)                     104100      
001639                 WKS-B06-SUC        (W77-IND)                     104200      
001640                 WKS-B06-CTA        (W77-IND)                     104300      
001641                 WKS-B06-AUT-S151   (W77-IND)                     104400      
001642                 WKS-B06-NUMOCURR   (W77-IND).                    104410      
001643*                                                                 104500      
001644*-----------------------------------------------------------------104600      
001645*                                                                 104700      
001646 209100-BORRA-ALARMAS.                                            104800      
001647     MOVE  0 TO W77-IND                                           104900      
001648     PERFORM 209110-BORRALAR VARYING W77-IND FROM 1 BY 1          105000      
001649                               UNTIL W77-IND > 17                 105100      
001650     MOVE  0    TO W77-IND.                                       105200      
001651*                                                                 105300      
001652*-----                                                            105400      
001653*                                                                 105500      
001654 209110-BORRALAR.                                                 105600      
001655     MOVE 0 TO WKS-ACSI-ORIGEN  (W77-IND)                         105700      
001656               WKS-ANUM-SISTEMA (W77-IND)                         105800      
001657               WKS-ANUM-PRODUCTO(W77-IND)                         105900      
001658               WKS-ANUM-INSTRUM (W77-IND)                         106000      
001659               WKS-ANUM-MONEDA  (W77-IND)                         106100      
001660               WKS-ANUM-AUTORIG (W77-IND)                         106200      
001661               WKS-ANUM-AUTO151 (W77-IND)                         106300      
001662               WKS-ANUM-AUTO3ER (W77-IND)                         106400      
001663               WKS-ANUM-SUC     (W77-IND)                         106500      
001664               WKS-ANUM-CTA     (W77-IND)                         106600      
001665               WKS-SUC-TRANSM   (W77-IND)                         106700      
001666               WKS-CJA-TRANSM   (W77-IND)                         106800      
001667               WKS-HOR-TRANSAC  (W77-IND)                         106900      
001668               WKS-CVE-TRANSAC  (W77-IND)                         107000      
001669               WKS-IND-CONTABLE (W77-IND)                         107100      
001670               WKS-IMP-TRANSAC  (W77-IND)                         107200      
001671               WKS-CVE-ALARMA   (W77-IND)                         107300      
001672               WKS-ANUM-OCCURS  (W77-IND).                        107310      
001673*                                                                 107400      
001674*-----------------------------------------------------------------107500      
001675*                                                                 107600      
001676 209200-BORRA-TOTPROD.                                            107700      
001677     MOVE  0 TO W77-IND                                           107800      
001678     PERFORM 209210-BORRATOT VARYING W77-IND FROM 1 BY 1          107900      
001679                               UNTIL W77-IND > 16                 108000      
001680     MOVE  0    TO W77-IND.                                       108100      
001681*                                                                 108200      
001682*-----                                                            108300      
001683*                                                                 108400      
001684 209210-BORRATOT.                                                 108500      
001685     MOVE 0  TO  WKS-PCSI-ORIGEN   (W77-IND)                      108600      
001686                 WKS-PNUM-SISTEMA  (W77-IND)                      108700      
001687                 WKS-PNUM-PRODUCTO (W77-IND)                      108800      
001688                 WKS-PNUM-INSTRUM  (W77-IND)                      108900      
001689                 WKS-PNUM-MONEDA   (W77-IND)                      109000      
001690                 WKS-PNUM-CPAE     (W77-IND)                      109100      
001691                 WKS-PNUM-T        (W77-IND)                      109200      
001692                 WKS-PINI-NMOVS    (W77-IND)                      109300      
001693                 WKS-PINI-IMOVS    (W77-IND)                      109400      
001694                 WKS-PCGO-OPERS    (W77-IND)                      109500      
001695                 WKS-PCGO-IMPOR    (W77-IND)                      109600      
001696                 WKS-PABO-OPERS    (W77-IND)                      109700      
001697                 WKS-PABO-IMPOR    (W77-IND).                     109800      
001698  MOVE SPACES TO WKS-PINI-TSDO     (W77-IND).                     109900      
001699*                                                                 110000      
001700******************************************************************110100      
001701*                                                                 110200      
001702 210000-ENVIA-ALARMAS.                                            110300      
001703     MOVE B03-ALA-FECINF TO WKS-B03-ALA-FECINF.                   110310      
001704     IF (    B03-ALA-STA-ENVIO = 0                                110400      
001705         AND WKS-B03-ALA-FECINF = WKS-FECHA-MAQ  )                110410      
001706        PERFORM 211000-MUEVE-ALARMAS                              110500      
001707        IF W77-IND > 16                                           110600      
001708           MOVE  1 TO W77-SW-ALARMAS.                             110700      
001709                                                                  110800      
001710     PERFORM 502000-NEXT-ALARMAS.                                 110900      
001711*                                                                 111000      
001712*-----                                                            111100      
001713*                                                                 111200      
001714 211000-MUEVE-ALARMAS.                                            111300      
001715     MOVE ZEROS               TO  WKS-PUENTE-IMP                  111400      
001716     MOVE WKS-FECHA-BASE      TO  WKS-FEC-PROCESO                 111500      
001717     MOVE B03-ALA-FECINF      TO  WKS-B06-FECINF                  111600      
001718     ACCEPT  WS-HORA         FROM TIME.                           111700      
001719     MOVE WS-HHMMSS           TO  WKS-HOR-ENVIO                   111800      
001720     MOVE    "L"              TO  WKS-TPO-PROCESO                 111900      
001721     MOVE     0               TO  WKS-RES-TRANSACC                112000      
001722     MOVE    "A"              TO  WKS-TPO-INFORMAC                112100      
001723                                  WKS-B06-TPO-MENS                112200      
001724                                                                  112300      
001725     ADD        1             TO  W77-IND                         112400      
001726     MOVE W77-IND             TO  WKS-NUM-RENGLONES               112500      
001727     MOVE ZEROS               TO  WKS-B06-CPAE     (W77-IND)      112600      
001728                                  WKS-B06-NUM-T    (W77-IND)      112700      
001729     MOVE  B03-ALA-CSI        TO  WKS-ACSI-ORIGEN  (W77-IND)      112800      
001730                                  WKS-B06-CSI                     112900      
001731     MOVE  B03-ALA-SISTEMA    TO  WKS-ANUM-SISTEMA (W77-IND)      113000      
001732                                  WKS-B06-SISTEMA  (W77-IND)      113100      
001733     MOVE  B03-ALA-PRODUCTO   TO  WKS-ANUM-PRODUCTO(W77-IND)      113200      
001734                                  WKS-B06-PRODUCTO (W77-IND)      113300      
001735     MOVE  B03-ALA-INSTSERV   TO  WKS-ANUM-INSTRUM (W77-IND)      113400      
001736                                  WKS-B06-INSTSERV (W77-IND)      113500      
001737     MOVE  B03-ALA-MONEDA     TO  WKS-ANUM-MONEDA  (W77-IND)      113600      
001738                                  WKS-B06-MONEDA   (W77-IND)      113700      
001739     MOVE  B03-ALA-AUT-ORIG   TO  WKS-ANUM-AUTORIG (W77-IND)      113800      
001740     MOVE  B03-ALA-AUT-S151   TO  WKS-ANUM-AUTO151 (W77-IND)      113900      
001741                                  WKS-B06-AUT-S151 (W77-IND)      114000      
001742     MOVE  B03-ALA-AUT-3NIV   TO  WKS-ANUM-AUTO3ER (W77-IND)      114100      
001743     MOVE  B03-ALA-SUC        TO  WKS-ANUM-SUC     (W77-IND)      114200      
001744                                  WKS-B06-SUC      (W77-IND)      114300      
001745     MOVE  B03-ALA-CTA        TO  WKS-ANUM-CTA     (W77-IND)      114400      
001746                                  WKS-B06-CTA      (W77-IND)      114500      
001747     MOVE  B03-ALA-TRANS-SUC  TO  WKS-SUC-TRANSM   (W77-IND)      114600      
001748     MOVE  B03-ALA-TRANS-CJA  TO  WKS-CJA-TRANSM   (W77-IND)      114700      
001749     MOVE  B03-ALA-TRANS-HOR  TO  WKS-HOR-TRANSAC  (W77-IND)      114800      
001750     MOVE  B03-ALA-TRANS-CVE  TO  WKS-CVE-TRANSAC  (W77-IND)      114900      
001751     MOVE  B03-ALA-IND-CONT   TO  WKS-IND-CONTABLE (W77-IND)      115000      
001752     MOVE  B03-ALA-IMPORTE    TO  WKS-PUENTE-IMP                  115100      
001753     MOVE  WKS-PUENTE-IMP-E   TO  WKS-IMP-TRANSAC-E  (W77-IND)    115200      
001754     MOVE  "."                TO  WKS-IMP-TRANSAC-P  (W77-IND)    115300      
001755     MOVE  WKS-PUENTE-IMP-D   TO  WKS-IMP-TRANSAC-D  (W77-IND)    115400      
001756     MOVE  B03-ALA-CVE-ALARM  TO  WKS-CVE-ALARMA     (W77-IND).   115500      
001757     MOVE  B03-ALA-NUMOCURR   TO  WKS-ANUM-OCCURS    (W77-IND)    115510      
001758                                  WKS-B06-NUMOCURR   (W77-IND).   115520      
001759*                                                                 115600      
001760******************************************************************115700      
001761*                                                                 115800      
001762 220000-ENVIA-TOTALES.                                            115900      
001763     PERFORM 221000-MUEVE-TOTALES                                 116000      
001764     IF W77-IND > 15                                              116100      
001765        MOVE  1 TO W77-SW-TOTALES.                                116200      
001766                                                                  116300      
001767     PERFORM 504000-NEXT-TOTPROD.                                 116400      
001768*                                                                 116500      
001769*-----                                                            116600      
001770*                                                                 116700      
001771 221000-MUEVE-TOTALES.                                            116800      
001772     MOVE ZEROS               TO  WKS-PUENTE-IMP                  116900      
001773     MOVE WKS-FECHA-BASE      TO  WKS-FEC-PROCESO                 117000      
001774     MOVE B01-TOT-FECINF      TO  WKS-B06-FECINF                  117100      
001775     ACCEPT  WS-HORA         FROM TIME.                           117200      
001776     MOVE WS-HHMMSS           TO  WKS-HOR-ENVIO                   117300      
001777     MOVE    "L"              TO  WKS-TPO-PROCESO                 117400      
001778     MOVE     0               TO  WKS-RES-TRANSACC                117500      
001779     MOVE    "T"              TO  WKS-TPO-INFORMAC                117600      
001780                                  WKS-B06-TPO-MENS                117700      
001781                                                                  117800      
001782     ADD        1             TO  W77-IND                         117900      
001783     MOVE W77-IND             TO  WKS-NUM-RENGLONES               118000      
001784     MOVE ZEROS               TO  WKS-B06-SUC      (W77-IND)      118100      
001785                                  WKS-B06-CTA      (W77-IND)      118200      
001786                                  WKS-B06-AUT-S151 (W77-IND)      118300      
001787                                  WKS-B06-NUMOCURR (W77-IND)      118310      
001788     MOVE B01-TOT-CSI         TO  WKS-PCSI-ORIGEN  (W77-IND)      118400      
001789                                  WKS-B06-CSI                     118500      
001790     MOVE B01-TOT-SISTEMA     TO  WKS-PNUM-SISTEMA (W77-IND)      118600      
001791                                  WKS-B06-SISTEMA  (W77-IND)      118700      
001792     MOVE B01-TOT-PRODUCTO    TO  WKS-PNUM-PRODUCTO(W77-IND)      118800      
001793                                  WKS-B06-PRODUCTO (W77-IND)      118900      
001794     MOVE B01-TOT-INSTSERV    TO  WKS-PNUM-INSTRUM (W77-IND)      119000      
001795                                  WKS-B06-INSTSERV (W77-IND)      119100      
001796     MOVE B01-TOT-MONEDA      TO  WKS-PNUM-MONEDA  (W77-IND)      119200      
001797                                  WKS-B06-MONEDA   (W77-IND)      119300      
001798     MOVE B01-TOT-CPAE        TO  WKS-PNUM-CPAE    (W77-IND)      119400      
001799                                  WKS-B06-CPAE     (W77-IND)      119500      
001800     MOVE B01-TOT-NUM-T       TO  WKS-PNUM-T       (W77-IND)      119600      
001801                                  WKS-B06-NUM-T    (W77-IND)      119700      
001802     MOVE "L"                 TO  WKS-PINI-TSDO    (W77-IND)      119800      
001803     MOVE ZEROS               TO  WKS-PINI-IMOVS-E (W77-IND)      119900      
001804     MOVE "."                 TO  WKS-PINI-IMOVS-P (W77-IND)      120000      
001805     MOVE ZEROS               TO  WKS-PINI-IMOVS-D (W77-IND)      120100      
001806     MOVE B01-TOT-NUMCARGOS   TO  WKS-PCGO-OPERS   (W77-IND)      120200      
001807     MOVE B01-TOT-IMPCARGOS   TO  WKS-PUENTE-IMP                  120300      
001808     MOVE WKS-PUENTE-IMP-E    TO  WKS-PCGO-IMPOR-E (W77-IND)      120400      
001809     MOVE "."                 TO  WKS-PCGO-IMPOR-P (W77-IND)      120500      
001810     MOVE WKS-PUENTE-IMP-D    TO  WKS-PCGO-IMPOR-D (W77-IND)      120600      
001811     MOVE B01-TOT-NUMABONOS   TO  WKS-PABO-OPERS   (W77-IND)      120700      
001812     MOVE ZEROS               TO  WKS-PUENTE-IMP                  120800      
001813     MOVE B01-TOT-IMPABONOS   TO  WKS-PUENTE-IMP                  120900      
001814     MOVE WKS-PUENTE-IMP-E    TO  WKS-PABO-IMPOR-E (W77-IND)      121000      
001815     MOVE "."                 TO  WKS-PABO-IMPOR-P (W77-IND)      121100      
001816     MOVE WKS-PUENTE-IMP-D    TO  WKS-PABO-IMPOR-D (W77-IND).     121200      
001817*                                                                 121300      
001818******************************************************************121400      
001819*                                                                 121500      
001820 230000-ENVIA-BATCH.                                              121600      
001821     IF B05-TOT-FECINF  NOT = WKS-B06-FECINF                      121610      
001822        MOVE 1                TO W77-CAMBIA-FECHA                 121620      
001823     ELSE                                                         121640      
001824     IF B05-TOT-STA-ENVIO = 0                                     121700      
001825        PERFORM 231000-MUEVE-BATCH                                121800      
001826        PERFORM 506000-NEXT-TOTBATCH                              121805      
001827     ELSE                                                         121900      
001828        PERFORM 506000-NEXT-TOTBATCH.                             122000      
001829                                                                  122100      
001830     IF (W77-CAMBIA-FECHA = 0   AND W77-IND > 15) OR              122220      
001831        (W77-CAMBIA-FECHA = 1   AND W77-IND > 0 ) OR              122222      
001832        (W77-SW-BATCH     = 1   AND W77-IND > 0 )                 122224      
001833        MOVE WKS-POR-PROD-INST TO WKS-RESTO-DATOS                 122230      
001834*--> Long del Mensaje , head = 36 , SA2 = 89, Datos = 1734        122240      
001835        MOVE 1859              TO WKS-ACEPTA-LENG                 122250      
001836        COMPUTE WKS-LENG-DATOS = 147 + (WKS-NUM-RENGLONES * 107)  122260      
001837        PERFORM 250000-ENVIA-MENSAJE                              122265      
001838        PERFORM 209200-BORRA-TOTPROD.                             122270      
001839     IF W77-CAMBIA-FECHA = 1                                      122280      
001840        MOVE ZERO              TO W77-CAMBIA-FECHA                122285      
001841        MOVE B05-TOT-FECINF    TO WKS-B06-FECINF.                 122290      
001842*                                                                 122300      
001843*-----                                                            122400      
001844*                                                                 122500      
001845 231000-MUEVE-BATCH.                                              122600      
001846     MOVE ZEROS               TO  WKS-PUENTE-IMP                  122700      
001847     MOVE WKS-B06-FECINF      TO  WKS-FEC-PROCESO                 122800      
001848     ACCEPT  WS-HORA         FROM TIME.                           123000      
001849     MOVE WS-HHMMSS           TO  WKS-HOR-ENVIO                   123100      
001850     MOVE    "B"              TO  WKS-TPO-PROCESO                 123200      
001851     MOVE     0               TO  WKS-RES-TRANSACC                123300      
001852     MOVE    "B"              TO  WKS-TPO-INFORMAC                123400      
001853                                  WKS-B06-TPO-MENS                123500      
001854                                                                  123600      
001855     ADD        1             TO  W77-IND                         123700      
001856     MOVE W77-IND             TO  WKS-NUM-RENGLONES               123800      
001857     MOVE ZEROS               TO  WKS-B06-SUC      (W77-IND)      123900      
001858                                  WKS-B06-CTA      (W77-IND)      124000      
001859                                  WKS-B06-AUT-S151 (W77-IND)      124100      
001860                                  WKS-B06-NUMOCURR (W77-IND)      124110      
001861     MOVE B05-TOT-CSI         TO  WKS-PCSI-ORIGEN  (W77-IND)      124200      
001862                                  WKS-B06-CSI                     124300      
001863     MOVE B05-TOT-SISTEMA     TO  WKS-PNUM-SISTEMA (W77-IND)      124400      
001864                                  WKS-B06-SISTEMA  (W77-IND)      124500      
001865     MOVE B05-TOT-PRODUCTO    TO  WKS-PNUM-PRODUCTO(W77-IND)      124600      
001866                                  WKS-B06-PRODUCTO (W77-IND)      124700      
001867     MOVE B05-TOT-INSTSERV    TO  WKS-PNUM-INSTRUM (W77-IND)      124800      
001868                                  WKS-B06-INSTSERV (W77-IND)      124900      
001869     MOVE B05-TOT-MONEDA      TO  WKS-PNUM-MONEDA  (W77-IND)      125000      
001870                                  WKS-B06-MONEDA   (W77-IND)      125100      
001871     MOVE B05-TOT-CPAE        TO  WKS-PNUM-CPAE    (W77-IND)      125200      
001872                                  WKS-B06-CPAE     (W77-IND)      125300      
001873                                                                  125400      
001874     MOVE B05-TOT-NUM-T       TO  WKS-PNUM-T       (W77-IND)      125500      
001875                                  WKS-B06-NUM-T    (W77-IND)      125600      
001876     MOVE "B"                 TO  WKS-PINI-TSDO    (W77-IND)      125700      
001877     MOVE ZEROS               TO  WKS-PINI-IMOVS-E (W77-IND)      125800      
001878     MOVE "."                 TO  WKS-PINI-IMOVS-P (W77-IND)      125900      
001879     MOVE ZEROS               TO  WKS-PINI-IMOVS-D (W77-IND)      126000      
001880     MOVE B05-TOT-NUMCARGOS   TO  WKS-PCGO-OPERS   (W77-IND)      126100      
001881     MOVE B05-TOT-IMPCARGOS   TO  WKS-PUENTE-IMP                  126200      
001882     MOVE WKS-PUENTE-IMP-E    TO  WKS-PCGO-IMPOR-E (W77-IND)      126300      
001883     MOVE "."                 TO  WKS-PCGO-IMPOR-P (W77-IND)      126400      
001884     MOVE WKS-PUENTE-IMP-D    TO  WKS-PCGO-IMPOR-D (W77-IND)      126500      
001885     MOVE B05-TOT-NUMABONOS   TO  WKS-PABO-OPERS   (W77-IND)      126600      
001886     MOVE ZEROS               TO  WKS-PUENTE-IMP                  126700      
001887     MOVE B05-TOT-IMPABONOS   TO  WKS-PUENTE-IMP                  126800      
001888     MOVE WKS-PUENTE-IMP-E    TO  WKS-PABO-IMPOR-E (W77-IND)      126900      
001889     MOVE "."                 TO  WKS-PABO-IMPOR-P (W77-IND)      127000      
001890     MOVE WKS-PUENTE-IMP-D    TO  WKS-PABO-IMPOR-D (W77-IND).     127100      
001891*                                                                 127200      
001892******************************************************************127300      
001893*                                                                 127400      
001894 240000-RECIBE.                                                   127500      
001895     IF W77-SW-RECIBE = 0                                         127600      
001896        MOVE     10    TO WS-ESPERACOMS-TIEMPO                    127700      
001897     ELSE                                                         127800      
001898        MOVE WKS-DELAY TO WS-ESPERACOMS-TIEMPO.                   127900      
001899                                                                  128000      
001900     CALL  "ESPERACOMS OF SOPORTECOMS"                            128100      
001901            USING  WS-ESPERACOMS-TIEMPO                           128200      
001902            GIVING WS-ESPERACOMS-TIPO-EVENTO.                     128300      
001903*                                                    FUE UN ACCEPT128400      
001904*                                                    -------------128500      
001905    IF WS-ESPERACOMS-TIPO-EVENTO = 2                              128600      
001906       PERFORM 999999-ACEPTA-EVENTO                               128700      
001907    ELSE                                                          128800      
001908*                                                        FUE UN HI128900      
001909*                                                        ---------129000      
001910     IF WS-ESPERACOMS-TIPO-EVENTO = 3                             129100      
001911        RESET ATTRIBUTE EXCEPTIONEVENT OF MYSELF                  129200      
001912        MOVE  1  TO  W77-SW-RECIBE                                129300      
001913     ELSE                                                         129400      
001914*                                                         TIME OUT129500      
001915*                                                         --------129600      
001916     IF WS-ESPERACOMS-TIPO-EVENTO = 4                             129700      
001917        MOVE  1  TO  W77-SW-RECIBE                                129800      
001918     ELSE                                                         129900      
001919*                                                  MENSAJE/DISABLE130000      
001920*                                                  ---------------130100      
001921     IF WS-ESPERACOMS-TIPO-EVENTO = 1 OR 5                        130200      
001922        PERFORM 241000-ANALIZA-RESP.                              130300      
001923*                                                                 130400      
001924*-----                                                            130500      
001925*                                                                 130600      
001926 241000-ANALIZA-RESP.                                             130700      
001927     RECEIVE COMS-IN MESSAGE  INTO WKS-MENSAJE-DIALOGO            130800      
001928          NO DATA NEXT SENTENCE.                                  130900      
001929     ADD        1              TO  WKS-MENSAJES-RECIBIDOS         131000      
001930                                                                  131100      
001931     IF W77-ACTIVO-MONITOR = 1                                    131200      
001932        ACCEPT  WS-HORA           FROM TIME                       131300      
001933        MOVE WS-HORA              TO  E00-MTV-NUM                 131400      
001934        MOVE "<- HORA RECEIVE.."  TO  E00-MTV-TXT                 131500      
001935        MOVE WKS-MENSAJE-DIALOGO  TO  E00-MTV-MSG                 131600      
001936        PERFORM 999999-WRITE.                                     131700      
001937                                                                  131800      
001938     IF COMS-IN-STATUS-KEY   =  0 OR 89 OR 92 OR 93               131810      
001939        IF WKS-SA2-TPO-RSLT < 2      AND                          131900      
001940          (WKS-SA2-ACA-ORIG = 013702 OR                           132000      
001941           WKS-SA2-ACA-ORIG = 015111)                             132100      
001942           PERFORM 242000-APLICADA                                132200      
001943        ELSE                                                      132300      
001944           NEXT SENTENCE                                          132400      
001945     ELSE                                                         132500      
001946     IF COMS-IN-STATUS-KEY   =  99                                132600      
001947        MOVE 9               TO W77-SW-FIN                        132700      
001948        MOVE 1               TO W77-SW-RECIBE.                    132800      
001949*                                                                 132900      
001950*-----------------------------------------------------------------133000      
001951*                                                                 133100      
001952 242000-APLICADA.                                                 133200      
001953     MOVE  0 TO W77-SW-B06                                        133300      
001954     MOVE WKS-SA2-IDT-NUMT TO W77-NTRANSAC                        133400      
001955     PERFORM 500300-LOCK-B06                                      133500      
001956                                                                  133600      
001957     IF W77-SW-B06 = 0                                            133700      
001958        MOVE 0 TO W77-IND                                         133800      
001959        IF B06-TPO-MENS = "A"                                     133900      
001960           PERFORM 242100-APLIC-ALA VARYING W77-IND FROM 1 BY 1   134000      
001961                                      UNTIL W77-IND > 17          134100      
001962        ELSE                                                      134200      
001963         IF B06-TPO-MENS = "B"                                    134300      
001964            PERFORM 242100-APLIC-BAT VARYING W77-IND FROM 1 BY 1  134400      
001965                                       UNTIL W77-IND > 16.        134500      
001966                                                                  134600      
001967     MOVE 0 TO W77-IND.                                           134700      
001968*                                                                 134800      
001969*-----                                                            134900      
001970*                                                                 135000      
001971 242100-APLIC-ALA.                                                135100      
001972     MOVE  0 TO W77-SW-ERROR                                      135200      
001973     PERFORM 507000-LOCK-ALARMAS                                  135300      
001974                                                                  135400      
001975     IF W77-SW-ERROR = 0                                          135500      
001976        BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                135600      
001977        PERFORM 511000-UPDATE-ALARMAS                             135700      
001978         END-TRANSACTION   NO-AUDIT S151B99REINICTL               135800      
001979     ELSE                                                         135900      
001980        MOVE 17 TO W77-IND.                                       136000      
001981*                                                                 136100      
001982*-----                                                            136200      
001983*                                                                 136300      
001984 242100-APLIC-BAT.                                                136400      
001985     MOVE  0 TO W77-SW-ERROR                                      136500      
001986     PERFORM 508000-LOCK-TOTBATCH                                 136600      
001987                                                                  136700      
001988     IF W77-SW-ERROR = 0                                          136800      
001989        BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                136900      
001990        PERFORM 514000-UPDATE-BATCH                               137000      
001991        END-TRANSACTION   NO-AUDIT S151B99REINICTL                137100      
001992     ELSE                                                         137200      
001993        MOVE 17 TO W77-IND.                                       137300      
001994*                                                                 137400      
001995*-----------------------------------------------------------------137500      
001996*                                                                 137600      
001997 243000-RECHAZADA.                                                137700      
001998                                                                  137800      
001999*                                                                 137900      
002000******************************************************************138000      
002001*                                                                 138100      
002002 250000-ENVIA-MENSAJE.                                            138200      
002003     PERFORM 250100-ARMA-MSG                                      138300      
002004     PERFORM 500100-LOCK-GLOBALES                                 138400      
002005     MOVE    W77-NUM-TRAN  TO B00-GLO-CONS-BIFIN                  138500      
002006     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                   138600      
002007     PERFORM 500200-UPDATE-GLOBALES                               138700      
002008     END-TRANSACTION   NO-AUDIT S151B99REINICTL                   138800      
002009     PERFORM 250200-MANDA-MSG                                     138900      
002010     PERFORM 250300-GRABA-B06.                                    139000      
002011*                                                                 139100      
002012*-----                                                            139200      
002013*                                                                 139300      
002014 250100-ARMA-MSG.                                                 139400      
002015*                                                   HEADER BANAMEX139500      
002016*                                                   --------------139600      
002017     MOVE    "F"              TO  WKS-HDR-PREFIJO                 139700      
002018     MOVE    "0"              TO  WKS-HDR-APLIDESTINO             139800      
002019     MOVE W77-NODO-DES        TO  WKS-HDR-CSIDESTINO              139900      
002020     MOVE     1141            TO  WKS-HDR-LSNORIGEN               140000      
002021     MOVE    "Y"              TO  WKS-HDR-STA-TIPO                140100      
002022     MOVE     342             TO  WKS-HDR-STA-SUC                 140200      
002023     MOVE    "I"              TO  WKS-HDR-STA-PRIV                140300      
002024     MOVE     42              TO  WKS-HDR-STA-CAJA                140400      
002025     MOVE W77-NUMCSI          TO  WKS-HDR-CSIORIGEN               140500      
002026                                  WKS-HDR-COMPUT-ORIGEN           140600      
002027     MOVE SPACES              TO  WKS-HDR-NIVSEG                  140700      
002028     MOVE     2               TO  WKS-HDR-RESULT                  140800      
002029     MOVE     0               TO  WKS-HDR-APLIORIGEN              140900      
002030     MOVE ZEROS               TO  WKS-HDR-SCREEN                  141000      
002031                                  WKS-HDR-SEGURIDAD               141100      
002032*                                                      MENSAJE SA2141200      
002033*                                                      -----------141300      
002034     MOVE   013702            TO  WKS-SA2-ACA-DEST                141400      
002035     MOVE   015111            TO  WKS-SA2-ACA-ORIG                141500      
002036*                                                                 141600      
002037     MOVE   0137              TO  WKS-SA2-TDE-SIST                141700      
002038     MOVE     02              TO  WKS-SA2-TDE-CODI                141800      
002039     MOVE      0              TO  WKS-SA2-TDE-SCOD                141900      
002040*                                                                 142000      
002041     MOVE   0151              TO  WKS-SA2-TOR-SIST                142100      
002042     MOVE     11              TO  WKS-SA2-TOR-CODI                142200      
002043     MOVE      1              TO  WKS-SA2-TOR-SCOD                142300      
002044*                                                                 142400      
002045     MOVE      1              TO  WKS-SA2-INT-DIRE                142500      
002046     MOVE   WKS-LENG-DATOS    TO  WKS-SA2-INT-LONG                142600      
002047     MOVE     90              TO  WKS-SA2-INT-TOUT                142700      
002048     MOVE      0              TO  WKS-SA2-INT-RSLT                142800      
002049*                                                                 142900      
002050     MOVE      0              TO  WKS-SA2-FMT-IDEN                143000      
002051     MOVE      0              TO  WKS-SA2-FMT-RECO                143100      
002052     MOVE     "B"             TO  WKS-SA2-FMT-VERS                143200      
002053*                                                                 143300      
002054     MOVE      0              TO  WKS-SA2-TPO-CLSE                143400      
002055     MOVE      0              TO  WKS-SA2-TPO-RSLT                143500      
002056     MOVE      1              TO  WKS-SA2-TPO-MODO                143600      
002057*                                                                 143700      
002058     MOVE      0              TO  WKS-SA2-IDT-NSUC                143800      
002059     MOVE      0              TO  WKS-SA2-IDT-CAJA                143900      
002060     ADD       1              TO  W77-NUM-T                       144000      
002061     MOVE   WKS-FECBD-DD      TO  W77-NUM-T-D                     144010      
002062     MOVE   W77-NUM-TRAN      TO  WKS-SA2-IDT-NUMT                144100      
002063     MOVE   WKS-FECHABD-AMD   TO  WKS-SA2-IDT-FECH                144200      
002064     ACCEPT  WS-HORA         FROM TIME                            144300      
002065     MOVE WS-HHMMSS           TO  WKS-SA2-IDT-HORA                144400      
002066     MOVE     01              TO  WKS-SA2-IDT-MODA                144500      
002067     MOVE     SPACES          TO  WKS-SA2-IDT-OPER                144600      
002068     MOVE     "B"             TO  WKS-SA2-IDT-VERS                144700      
002069*                                                                 144800      
002070     MOVE   WKS-DATOS-MSG     TO  WKS-SA2-ENVIO-MENSAJE.          144900      
002071*                                                                 145000      
002072*-----                                                            145100      
002073*                                                                 145200      
002074 250200-MANDA-MSG.                                                145300      
002075     MOVE      1                  TO  COMS-OUT-COUNT              145400      
002076     MOVE      0                  TO  COMS-OUT-STATUS-KEY         145500      
002077     MOVE  WKS-ACEPTA-LENG        TO  COMS-OUT-TEXT-LENGTH        145600      
002078     MOVE  WS-COMS-AG-OUTPUT-DESG TO  COMS-OUT-AGENDA             145700      
002079     MOVE  WS-COMS-DEF-STA-DESG   TO  COMS-OUT-DESTINATION        145800      
002080     SEND  COMS-OUT              FROM WKS-MENSAJE-DIALOGO         145900      
002081     ADD       1                  TO  WKS-MENSAJES-ENVIADOS       146000      
002082                                                                  146100      
002083     IF W77-ACTIVO-MONITOR = 1                                    146200      
002084        ACCEPT  WS-HORA           FROM TIME                       146300      
002085        MOVE WS-HORA              TO  E00-MTV-NUM                 146400      
002086        MOVE "<- HORA ENVIA.."    TO  E00-MTV-TXT                 146500      
002087        MOVE WKS-MENSAJE-DIALOGO  TO  E00-MTV-MSG                 146600      
002088        PERFORM 999999-WRITE.                                     146700      
002089                                                                  146800      
002090      WAIT(2).                                                    146900      
002091*                                                                 147000      
002092*-----                                                            147100      
002093*                                                                 147200      
002094 250300-GRABA-B06.                                                147300      
002095     MOVE  0                TO W77-SW-B06                         147400      
002096     MOVE W77-NUM-TRAN      TO W77-NTRANSAC                       147700      
002097     PERFORM 500300-LOCK-B06                                      147710      
002098     IF W77-SW-B06 = 1                                            147720      
002099        CREATE S151B06CTLENVIO                                    148400      
002100        MOVE W77-NUM-TRAN   TO B06-NUM-MENS.                      148500      
002101     MOVE WKS-B06-TPO-MENS  TO B06-TPO-MENS                       148600      
002102     MOVE WKS-B06-FECINF    TO B06-FECINF                         148700      
002103     MOVE WKS-B06-CSI       TO B06-CSI                            148800      
002104     MOVE      0            TO W77-IND                            148900      
002105     PERFORM 250310-MUEVE-B06 VARYING W77-IND FROM 1 BY 1         149000      
002106                              UNTIL   W77-IND > 17                149100      
002107     MOVE      0            TO W77-IND                            149200      
002108     BEGIN-TRANSACTION NO-AUDIT S151B99REINICTL                   149300      
002109     PERFORM 500400-UPDATE-B06                                    149400      
002110     END-TRANSACTION   NO-AUDIT S151B99REINICTL.                  149500      
002111*                                                                 149600      
002112*-----                                                            149700      
002113*                                                                 149800      
002114 250310-MUEVE-B06.                                                149900      
002115     MOVE WKS-B06-INF(W77-IND) TO B06-INF-MENS(W77-IND).          150000      
002116*                                                                 150100      
002117******************************************************************150200      
002118*                                                                 150300      
002119 300000-FIN.                                                      150400      
002120       CLOSE S151BD13BIFIN                                        150500      
002121         ON EXCEPTION                                             150600      
002122           STRING "S151/P011:ERROR-FALLO AL CERRAR LA B.D."       150700      
002123                   DELIMITED BY SIZE                              150800      
002124                   INTO TEXTO-LJ                                  150900      
002125           CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ            151000      
002126                                           MENSAJE-LJ             151100      
002127           CALL SYSTEM DMTERMINATE.                               151200      
002128                                                                  151300      
002129*                                                                 151500      
002130******************************************************************151600      
002131*                                                                 151700      
002132 500100-LOCK-GLOBALES.                                            151800      
002133     LOCK S151BD13BIFIN                                           151900      
002134          ON EXCEPTION                                            152000      
002135             STRING "S151/P011:ERROR-LOCK GLOBALES "              152100      
002136                    DELIMITED BY SIZE                             152200      
002137                    INTO TEXTO-LJ                                 152300      
002138             CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ          152400      
002139                                             MENSAJE-LJ           152500      
002140             CALL SYSTEM DMTERMINATE.                             152600      
002141*                                                                 152700      
002142*-----                                                            152800      
002143*                                                                 152900      
002144 500200-UPDATE-GLOBALES.                                          153000      
002145     STORE S151BD13BIFIN                                          153100      
002146           ON EXCEPTION                                           153200      
002147              STRING "S151/P011:ERROR-STORE GLOBALES "            153300      
002148                     DELIMITED BY SIZE                            153400      
002149                     INTO TEXTO-LJ                                153500      
002150              CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ         153600      
002151                                              MENSAJE-LJ          153700      
002152              CALL SYSTEM DMTERMINATE.                            153800      
002153*                                                                 153900      
002154*-----                                                            154000      
002155*                                                                 154100      
002156 500300-LOCK-B06.                                                 154200      
002157     MOVE 0 TO W77-SW-B06                                         154300      
002158     LOCK B06SXNUMENS                                             154400      
002159          AT  B06-NUM-MENS = W77-NTRANSAC                         154500      
002160          ON EXCEPTION                                            154600      
002161             IF DMSTATUS(NOTFOUND)                                154700      
002162                MOVE 1 TO W77-SW-B06                              154800      
002163             ELSE                                                 154900      
002164                STRING "S151/P011:ERROR-LOCK B06 "                155000      
002165                       DELIMITED BY SIZE                          155100      
002166                       INTO TEXTO-LJ                              155200      
002167                CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ       155300      
002168                                                MENSAJE-LJ        155400      
002169                CALL SYSTEM DMTERMINATE.                          155500      
002170*                                                                 155600      
002171*-----                                                            155700      
002172*                                                                 155800      
002173 500400-UPDATE-B06.                                               155900      
002174     STORE S151B06CTLENVIO                                        156000      
002175           ON EXCEPTION                                           156100      
002176              STRING "S151/P011:ERROR-STORE B06 "                 156200      
002177                     DELIMITED BY SIZE                            156300      
002178                     INTO TEXTO-LJ                                156400      
002179              CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ         156500      
002180                                              MENSAJE-LJ          156600      
002181              CALL SYSTEM DMTERMINATE.                            156700      
002182*                                                                 156800      
002183******************************************************************156900      
002184*                                                                 157000      
002185 501000-FIRST-ALARMAS.                                            157100      
002186     FIND FIRST S151B03ALARMAS                                    157200      
002187             ON EXCEPTION                                         157300      
002188                IF DMSTATUS(NOTFOUND)                             157400      
002189                   MOVE 2 TO W77-SW-ALARMAS                       157500      
002190                ELSE                                              157600      
002191                   STRING "S151/P011:ERROR-FIND FIRST "           157700      
002192                          "- S151B03ALARMAS"                      157800      
002193                          DELIMITED BY SIZE                       157900      
002194                          INTO TEXTO-LJ                           158000      
002195                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    158100      
002196                                                   MENSAJE-LJ     158200      
002197                   CALL SYSTEM DMTERMINATE.                       158300      
002198*                                                                 158400      
002199*-----                                                            158500      
002200*                                                                 158600      
002201 502000-NEXT-ALARMAS.                                             158700      
002202     FIND NEXT S151B03ALARMAS                                     158800      
002203            ON EXCEPTION                                          158900      
002204                IF DMSTATUS(NOTFOUND)                             159000      
002205                   MOVE 2 TO W77-SW-ALARMAS                       159100      
002206                ELSE                                              159200      
002207                   STRING "S151/P011:ERROR-FIND NEXT "            159300      
002208                          "- S151B03ALARMAS"                      159400      
002209                          DELIMITED BY SIZE                       159500      
002210                          INTO TEXTO-LJ                           159600      
002211                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    159700      
002212                                                   MENSAJE-LJ     159800      
002213                   CALL SYSTEM DMTERMINATE.                       159900      
002214*                                                                 160000      
002215*-----------------------------------------------------------------160100      
002216*                                                                 160200      
002217 503000-FIRST-TOTPROD.                                            160300      
002218     FIND FIRST B01SXTOTPROD                                      160400      
002219             ON EXCEPTION                                         160500      
002220                IF DMSTATUS(NOTFOUND)                             160600      
002221                   MOVE 2 TO W77-SW-TOTALES                       160700      
002222                ELSE                                              160800      
002223                   STRING "S151/P011:ERROR-FIND FIRST "           160900      
002224                          "- B01SXTOTPROD"                        161000      
002225                          DELIMITED BY SIZE                       161100      
002226                          INTO TEXTO-LJ                           161200      
002227                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    161300      
002228                                                   MENSAJE-LJ     161400      
002229                   CALL SYSTEM DMTERMINATE.                       161500      
002230*                                                                 161600      
002231*-----                                                            161700      
002232*                                                                 161800      
002233 504000-NEXT-TOTPROD.                                             161900      
002234     FIND NEXT B01SXTOTPROD                                       162000      
002235             ON EXCEPTION                                         162100      
002236                IF DMSTATUS(NOTFOUND)                             162200      
002237                   MOVE 2 TO W77-SW-TOTALES                       162300      
002238                ELSE                                              162400      
002239                   STRING "S151/P011:ERROR-FIND FIRST "           162500      
002240                          "- B01SXTOTPROD"                        162600      
002241                          DELIMITED BY SIZE                       162700      
002242                          INTO TEXTO-LJ                           162800      
002243                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    162900      
002244                                                   MENSAJE-LJ     163000      
002245                   CALL SYSTEM DMTERMINATE.                       163100      
002246*                                                                 163200      
002247*-----------------------------------------------------------------163300      
002248*                                                                 163400      
002249 505000-FIRST-TOTBATCH.                                           163500      
002250     FIND FIRST S151B05BATCH                                      163600      
002251             ON EXCEPTION                                         163700      
002252                IF DMSTATUS(NOTFOUND)                             163800      
002253                   MOVE 1 TO W77-SW-BATCH                         163900      
002254                ELSE                                              164000      
002255                   STRING "S151/P011:ERROR-FIND FIRST "           164100      
002256                          "- S151B05POSICION"                     164200      
002257                          DELIMITED BY SIZE                       164300      
002258                          INTO TEXTO-LJ                           164400      
002259                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    164500      
002260                                                   MENSAJE-LJ     164600      
002261                   CALL SYSTEM DMTERMINATE.                       164700      
002262*                                                                 164800      
002263*-----                                                            164900      
002264*                                                                 165000      
002265 506000-NEXT-TOTBATCH.                                            165100      
002266     FIND NEXT S151B05BATCH                                       165200      
002267            ON EXCEPTION                                          165300      
002268               IF DMSTATUS(NOTFOUND)                              165400      
002269                  MOVE 1 TO W77-SW-BATCH                          165500      
002270               ELSE                                               165600      
002271                  STRING "S151/P011:ERROR-FIND FIRST "            165700      
002272                         "- S151B05POSICION"                      165800      
002273                         DELIMITED BY SIZE                        165900      
002274                         INTO TEXTO-LJ                            166000      
002275                  CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ     166100      
002276                                                  MENSAJE-LJ      166200      
002277                  CALL SYSTEM DMTERMINATE.                        166300      
002278*                                                                 166400      
002279*-----------------------------------------------------------------166500      
002280*                                                                 166600      
002281 507000-LOCK-ALARMAS.                                             166700      
002282     LOCK B03SXALARMA                                             166800      
002283          AT  B03-ALA-SISTEMA  = B06-SISTEMA    (W77-IND)         166900      
002284          AND B03-ALA-CSI      = B06-CSI                          167000      
002285          AND B03-ALA-FECINF   = B06-FECINF                       167100      
002286          AND B03-ALA-PRODUCTO = B06-PRODUCTO   (W77-IND)         167200      
002287          AND B03-ALA-INSTSERV = B06-INSTSERV   (W77-IND)         167300      
002288          AND B03-ALA-MONEDA   = B06-MONEDA     (W77-IND)         167400      
002289          AND B03-ALA-SUC      = B06-SUC        (W77-IND)         167500      
002290          AND B03-ALA-CTA      = B06-CTA        (W77-IND)         167600      
002291          AND B03-ALA-AUT-S151 = B06-AUT-S151   (W77-IND)         167700      
002292          AND B03-ALA-NUMOCURR = B06-NUMOCURR   (W77-IND)         167710      
002293             ON EXCEPTION                                         167800      
002294                IF DMSTATUS(NOTFOUND)                             167900      
002295                   MOVE 1 TO W77-SW-ERROR                         168000      
002296                ELSE                                              168100      
002297                   STRING "S151/P011:ERROR-LOCK "                 168200      
002298                          "- B03SXALARMA"                         168300      
002299                          DELIMITED BY SIZE                       168400      
002300                          INTO TEXTO-LJ                           168500      
002301                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    168600      
002302                                                   MENSAJE-LJ     168700      
002303                   CALL SYSTEM DMTERMINATE.                       168800      
002304*                                                                 168900      
002305*-----                                                            169000      
002306*                                                                 169100      
002307 508000-LOCK-TOTBATCH.                                            169200      
002308     LOCK B05SXPRODINST                                           169300      
002309          AT  B05-TOT-SISTEMA  = B06-SISTEMA (W77-IND)            169400      
002310          AND B05-TOT-CSI      = B06-CSI                          169500      
002311          AND B05-TOT-FECINF   = B06-FECINF                       169600      
002312          AND B05-TOT-PRODUCTO = B06-PRODUCTO(W77-IND)            169700      
002313          AND B05-TOT-INSTSERV = B06-INSTSERV(W77-IND)            169800      
002314          AND B05-TOT-MONEDA   = B06-MONEDA  (W77-IND)            169900      
002315          AND B05-TOT-CPAE     = B06-CPAE    (W77-IND)            170000      
002316          AND B05-TOT-NUM-T    = B06-NUM-T   (W77-IND)            170100      
002317             ON EXCEPTION                                         170200      
002318                IF DMSTATUS(NOTFOUND)                             170300      
002319                   MOVE 1 TO W77-SW-ERROR                         170400      
002320                ELSE                                              170500      
002321                   STRING "S151/P011:ERROR-LOCK "                 170600      
002322                          "- B05SXPRODINST"                       170700      
002323                          DELIMITED BY SIZE                       170800      
002324                          INTO TEXTO-LJ                           170900      
002325                   CALL "LJ IN LIBDESPLIEGA" USING CONTADOR-LJ    171000      
002326                                                   MENSAJE-LJ     171100      
002327                   CALL SYSTEM DMTERMINATE.                       171200      
002328*                                                                 171300      
002329******************************************************************171400      
002330*                                                                 171500      
002331 511000-UPDATE-ALARMAS.                                           171600      
002332     MOVE 1 TO B03-ALA-STA-ENVIO                                  171700      
002333     STORE S151B03ALARMAS.                                        171800      
002334*                                                                 171900      
002335*-----------------------------------------------------------------172000      
002336*                                                                 172100      
002337 514000-UPDATE-BATCH.                                             172200      
002338     MOVE 1 TO B05-TOT-STA-ENVIO                                  172300      
002339     STORE S151B05BATCH.                                          172400      
002340                                                                  172500      
002341*                                                                 172600      
002342******************************************************************172700      
002343*                                                                 172800      
002344 999999-ACEPTA-EVENTO.                                            172900      
002345     ACCEPT WKS-ACEPTA.                                           173000      
002346*-----                                                            176400      
002347*                                                                 176500      
002348 999999-WRITE.                                                    176600      
002349     IF W77-ACTIVO-MONITOR = 1                                    176700      
002350        WRITE E00-REG-MTV INVALID KEY STOP RUN.                   176800      
002351     IF W77-ACTIVO-MONITOR = 1                                    176850      
002352        MOVE SPACES TO E00-REG-MTV.                               176900      
002353*                                                                 177000      
002354******************************************************************177100      
002355*               T E R M I N A    P R O G R A M A                 *177200      
002356******************************************************************177300      
