000001$SET LIST ERRORLIMIT = 5000 XREF LINEINFO                         000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000101      
000003$SET LISTOMITTED                                                  000102      
000004$SET OLDCODE                                                      000103      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000104      
000006 IDENTIFICATION DIVISION.                                         000200      
000007 AUTHOR. RICARDO MORENO ARZAVE.                                   000300      
000008 ENVIRONMENT DIVISION.                                            000400      
000009 INPUT-OUTPUT SECTION.                                            000500      
000010 FILE-CONTROL.                                                    000600      
000011      SELECT A01-SDOENT     ASSIGN TO DISK.                       000700      
000012      SELECT R01-REPMES     ASSIGN TO PRINTER.                    000800      
000013      SELECT R02-REPPOS     ASSIGN TO PRINTER.                    000900      
000014      SELECT R03-REPTOT     ASSIGN TO PRINTER.                    001000      
000015      SELECT A02-SORT       ASSIGN TO SORT DISK.                  001100      
000016      SELECT A03-SORT       ASSIGN TO SORT DISK.                  001200      
000017      SELECT V00-REPORTE2   ASSIGN TO PRINTER.                    001251      
000018      SELECT E01-SDOS       ASSIGN TO DISK.                       001271      
000019                                                                  001300      
000020/                                                                 001400      
000021 DATA DIVISION.                                                   001500      
000022 FILE SECTION.                                                    001600      
000023 FD  A01-SDOENT                                                   001700      
000024     BLOCK CONTAINS 168 RECORDS                                   001800      
000025     VALUE OF TITLE        IS WKS-TIT-SDOENT.                     001900      
000026                                                                  002000      
000027*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000028* COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS".                       002100      
000029******************************************************************000100      
000030*                                                                *000200      
000031*             FORMATO DEL ARCHIVO DE SALDOS                      *000300      
000032*                                                                *000400      
000033******************************************************************000500      
000034                                                                  000600      
000035                                                                  000700      
000036                                                                  000800      
000037 01 A02-R00-SALDOS.                                               000900      
000038    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000039*   02 A02-R00-FILGRAL             PIC  X(179).                   001100      
000040*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000041    02 A02-R00-FILGRAL             PIC  X(389).                   001102      
000042*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000043                                                                  001200      
000044    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     001300      
000045       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000046       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000047*      03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000048*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000049       03 A02-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000050*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000051*      03 FILLER                   PIC  X(172).                   001700      
000052*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000053       03 FILLER                   PIC  X(381).                   001702      
000054*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000055                                                                  001800      
000056    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     001900      
000057       03 A02-R01-SIS              PIC  9(04)       COMP.         002000      
000058       03 A02-R01-PRD              PIC  9(04)       COMP.         002100      
000059       03 A02-R01-INS              PIC  9(04)       COMP.         002200      
000060       03 A02-R01-CTA              PIC  9(20)       COMP.         002300      
000061       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         002400      
000062          05 A02-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000063          05 A02-R01-CNT           PIC  9(16)       COMP.         002600      
000064       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000065*      03 A02-R01-FECPRO           PIC  9(06)       COMP.         002800      
000066*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000067       03 A02-R01-FECPRO           PIC  9(08)       COMP.         002802      
000068*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000069*      03 A02-R01-FECINI           PIC  9(06)       COMP.         002900      
000070*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000071       03 A02-R01-FECINI           PIC  9(08)       COMP.         002902      
000072*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000073*      03 A02-R01-FECFIN           PIC  9(06)       COMP.         003000      
000074*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000075       03 A02-R01-FECFIN           PIC  9(08)       COMP.         003002      
000076*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000077*      03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000078*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000079       03 A02-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000080*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000081       03 A02-R01-STATUS           PIC  9(02)       COMP.         003200      
000082       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000083          04 A02-R01-CVESDO        PIC  9(04)       COMP.         003400      
000084          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000085*      03 A02-R01-FILXAPL          PIC  X(19).                    003600      
000086*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000087       03 A02-R01-FILXAPL          PIC  X(55).                    003602      
000088*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000089                                                                  003700      
000090       03 A02-R01-S084             REDEFINES A02-R01-FILXAPL.     003800      
000091          04 A02-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000092          04 A02-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000093          04 A02-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000094          04 A02-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000095          04 A02-R01-DIASPER       PIC  9(02)       COMP.         004300      
000096          04 A02-R01-DIASANU       PIC  9(02)       COMP.         004400      
000097          04 A02-R01-MONS084       PIC  9(02)       COMP.         004500      
000098*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000099          04 FILLER                PIC  X(36).                    004540      
000100*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
000101                                                                  004600      
000102       03 A02-R01-S084AVB          REDEFINES A02-R01-FILXAPL.     004700      
000103          04 FILLER                PIC X(03).                     004800      
000104*         04 A02-R01-FECAPE        PIC  9(06)       COMP.         004900      
000105*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
000106          04 A02-R01-FECAPE        PIC  9(08)       COMP.         004902      
000107*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
000108*         04 A02-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
000109*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
000110          04 A02-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
000111*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
000112          04 A02-R01-SORTEO        PIC  9(02)       COMP.         005100      
000113          04 A02-R01-RESTANTES     PIC  9(03)       COMP.         005200      
000114          04 A02-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
000115          04 A02-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
000116          04 A02-R01-TOTALES       PIC  9(02)       COMP.         005500      
000117          04 A02-R01-ATRASOS       PIC  9(02)       COMP.         005600      
000118          04 A02-R01-BONOS         PIC  9(02)       COMP.         005700      
000119          04 A02-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
000120          04 A02-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
000121          04 FILLER                PIC  X(34).                    005950      
000122                                                                  006000      
000123       03 A02-R01-S087                REDEFINES A02-R01-FILXAPL.  006100      
000124          04 A02-R01-PLAZO            PIC  9(04)       COMP.      006200      
000125          04 A02-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
000126          04 A02-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
000127          04 A02-R01-TIPOPER          PIC  9(04)       COMP.      006500      
000128          04 A02-R01-PM               PIC  9(02)       COMP.      006600      
000129          04 A02-R01-FILS087          PIC  X(07).                 006700      
000130          04 A02-R01-MON              PIC  9(04)       COMP.      006701      
000131          04 FILLER                   PIC  X(36).                 006702      
000132                                                                  006800      
000133       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     006900      
000134          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
000135          04 A02-R01-DIASANO       PIC  9(03)       COMP.         007100      
000136          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
000137          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
000138          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
000139          04 A02-R01-STATION       PIC  9(04)       COMP.         007500      
000140          04 A02-R01-CTACON        PIC  9(02)       COMP.         007600      
000141          04 A02-R01-MONEDA        PIC  9(02)       COMP.         007700      
000142          04 A02-R01-GENEDOCTA     PIC  9(01).                    007702      
000143          04 A02-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
000144          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         007708      
000145          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         007710      
000146          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         007712      
000147          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         007714      
000148          04 A02-R01-FILS500       PIC  X(21).                    007716      
000149                                                                  007800      
000150       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     007900      
000151*         04 A02-R01-FECVEN        PIC  9(06)       COMP.         008000      
000152*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
000153          04 A02-R01-FECVEN        PIC  9(08)       COMP.         008002      
000154*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
000155          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
000156          04 A02-R01-DIASBG        PIC  9(04)       COMP.         008200      
000157          04 A02-R01-LINEA         PIC  9(04)       COMP.         008300      
000158          04 A02-R01-FOLIO         PIC  9(04)       COMP.         008400      
000159          04 A02-R01-FILS408       PIC  X(06).                    008500      
000160*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000161          04 FILLER                PIC  X(35).                    008502      
000162*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000163                                                                  008600      
000164    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     008700      
000165       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
000166       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
000167       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
000168*      03 FILLER                   PIC  X(162).                   009100      
000169*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
000170       03 FILLER                   PIC  X(372).                   009102      
000171*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
000172                                                                  009200      
000173                                                                  009300      
000174*=================================================================009400      
000175*====             DESCRIPCION DE CAMPOS                        ===009500      
000176*=================================================================009600      
000177                                                                  009700      
000178*=A02-R00-TIPO-REG     : 00 = HEADER                              009800      
000179*                        80 = INICIO                              009900      
000180*                        81 = REGISTRO DE SALDOS                  010000      
000181*                        82 = FIN                                 010100      
000182*                        99 = TRAILER                             010200      
000183                                                                  010300      
000184*=================================================================010400      
000185*===                REGISTRO HEADER                            ===010500      
000186*=================================================================010600      
000187                                                                  010700      
000188*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
000189*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
000190*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
000191                                                                  011100      
000192*=================================================================011200      
000193*===                   REGISTRO DE SALDOS                      ===011300      
000194*=================================================================011400      
000195                                                                  011500      
000196*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
000197*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
000198*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
000199*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
000200*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
000201*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
000202*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
000203*                             EDO CTA                             012300      
000204*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
000205*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
000206*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
000207*                        FORMATO AAMMDD                           012700      
000208*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
000209*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
000210*                        A02-R01-EDOCTA ES MAYOR A CERO)          013000      
000211*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
000212*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
000213*                        A02-R01-EDOCTA ES MAYOR A CERO)          013300      
000214*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
000215*                             CONTRATO                            013500      
000216*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
000217*                         CONTRATO DE ESTE REGISTRO.              013700      
000218*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
000219*                        EJ. 0002 (SALDO ACTUAL)                  013900      
000220*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
000221                                                                  014100      
000222*=================================================================014200      
000223*==                FILLER POR APLICACION                       ===014300      
000224*=================================================================014400      
000225                                                                  014500      
000226                                                                  014600      
000227                                                                  014700      
000228                                                                  014800      
000229*=================================================================014900      
000230*==                    SISTEMA S500                            ===015000      
000231*=================================================================015100      
000232                                                                  015200      
000233*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
000234*=A02-R01-DIASANO      : DIAS EN EL A\O                           015400      
000235*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
000236*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
000237*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
000238*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
000239*=A02-R01-CTACON       : 00 = SUCURSAL 870                        015900      
000240*                        01 = CUENTA CONCENTRADORA                016000      
000241*=A02-R01-MONEDA       : TIPO DE MONEDA                           016010      
000242*=A02-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
000243*=A02-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
000244*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
000245*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
000246*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
000247*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
000248*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
000249                                                                  016200      
000250*=================================================================016300      
000251*==                    SISTEMA S408                            ===016400      
000252*=================================================================016500      
000253                                                                  016600      
000254*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
000255*=A02-R01-TASINT       : TASA DE INTERES                          016800      
000256*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
000257*=A02-R01-LINEA        : NUMERO DE LINEA                          017000      
000258*=A02-R01-FOLIO        : NUMERO DE FOLIO                          017100      
000259*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
000260                                                                  017300      
000261*=================================================================017400      
000262*==                   REGISTRO TRAILER                         ===017500      
000263*=================================================================017600      
000264                                                                  017700      
000265*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
000266*                      TRAILER.                                   017900      
000267*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
000268*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
000269*                      DE SALDOS.                                 018200      
000270                                                                  018300      
000271*=================================================================018400      
000272*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
000273*=================================================================018600      
000274                                                                  018700      
000275*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
000276                                                                  018900      
000277* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
000278* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
000279* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
000280*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000281                                                                  002200      
000282                                                                  002300      
000283 FD  R01-REPMES.                                                  002400      
000284 01  R01-REG-REPMES            PIC X(132).                        002500      
000285                                                                  002600      
000286 FD  R02-REPPOS.                                                  002700      
000287 01  R02-REG-REPPOS            PIC X(132).                        002800      
000288                                                                  002900      
000289 FD  R03-REPTOT.                                                  003000      
000290 01  R03-REG-REPTOT            PIC X(132).                        003100      
000291                                                                  003151      
000292 FD  V00-REPORTE2                                                 003161      
000293     VALUE OF TITLE IS WKS-TIT-REPORTE2.                          003171      
000294                                                                  003181      
000295 01 V00-R00-REPORTE2              PIC X(132).                     003191      
000296                                                                  003200      
000297 SD  A02-SORT.                                                    003300      
000298                                                                  003400      
000299*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000300*      COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS.".                 003500      
000301******************************************************************000100      
000302*                                                                *000200      
000303*             FORMATO DEL ARCHIVO DE SALDOS                      *000300      
000304*                                                                *000400      
000305******************************************************************000500      
000306                                                                  000600      
000307                                                                  000700      
000308                                                                  000800      
000309 01 A02-R00-SALDOS.                                               000900      
000310    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000311*   02 A02-R00-FILGRAL             PIC  X(179).                   001100      
000312*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000313    02 A02-R00-FILGRAL             PIC  X(389).                   001102      
000314*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000315                                                                  001200      
000316    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     001300      
000317       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000318       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000319*      03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000320*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000321       03 A02-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000322*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000323*      03 FILLER                   PIC  X(172).                   001700      
000324*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000325       03 FILLER                   PIC  X(381).                   001702      
000326*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000327                                                                  001800      
000328    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     001900      
000329       03 A02-R01-SIS              PIC  9(04)       COMP.         002000      
000330       03 A02-R01-PRD              PIC  9(04)       COMP.         002100      
000331       03 A02-R01-INS              PIC  9(04)       COMP.         002200      
000332       03 A02-R01-CTA              PIC  9(20)       COMP.         002300      
000333       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         002400      
000334          05 A02-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000335          05 A02-R01-CNT           PIC  9(16)       COMP.         002600      
000336       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000337*      03 A02-R01-FECPRO           PIC  9(06)       COMP.         002800      
000338*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000339       03 A02-R01-FECPRO           PIC  9(08)       COMP.         002802      
000340*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000341*      03 A02-R01-FECINI           PIC  9(06)       COMP.         002900      
000342*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000343       03 A02-R01-FECINI           PIC  9(08)       COMP.         002902      
000344*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000345*      03 A02-R01-FECFIN           PIC  9(06)       COMP.         003000      
000346*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000347       03 A02-R01-FECFIN           PIC  9(08)       COMP.         003002      
000348*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000349*      03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000350*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000351       03 A02-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000352*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000353       03 A02-R01-STATUS           PIC  9(02)       COMP.         003200      
000354       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000355          04 A02-R01-CVESDO        PIC  9(04)       COMP.         003400      
000356          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000357*      03 A02-R01-FILXAPL          PIC  X(19).                    003600      
000358*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000359       03 A02-R01-FILXAPL          PIC  X(55).                    003602      
000360*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000361                                                                  003700      
000362       03 A02-R01-S084             REDEFINES A02-R01-FILXAPL.     003800      
000363          04 A02-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000364          04 A02-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000365          04 A02-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000366          04 A02-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000367          04 A02-R01-DIASPER       PIC  9(02)       COMP.         004300      
000368          04 A02-R01-DIASANU       PIC  9(02)       COMP.         004400      
000369          04 A02-R01-MONS084       PIC  9(02)       COMP.         004500      
000370*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000371          04 FILLER                PIC  X(36).                    004540      
000372*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
000373                                                                  004600      
000374       03 A02-R01-S084AVB          REDEFINES A02-R01-FILXAPL.     004700      
000375          04 FILLER                PIC X(03).                     004800      
000376*         04 A02-R01-FECAPE        PIC  9(06)       COMP.         004900      
000377*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
000378          04 A02-R01-FECAPE        PIC  9(08)       COMP.         004902      
000379*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
000380*         04 A02-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
000381*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
000382          04 A02-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
000383*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
000384          04 A02-R01-SORTEO        PIC  9(02)       COMP.         005100      
000385          04 A02-R01-RESTANTES     PIC  9(03)       COMP.         005200      
000386          04 A02-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
000387          04 A02-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
000388          04 A02-R01-TOTALES       PIC  9(02)       COMP.         005500      
000389          04 A02-R01-ATRASOS       PIC  9(02)       COMP.         005600      
000390          04 A02-R01-BONOS         PIC  9(02)       COMP.         005700      
000391          04 A02-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
000392          04 A02-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
000393          04 FILLER                PIC  X(34).                    005950      
000394                                                                  006000      
000395       03 A02-R01-S087                REDEFINES A02-R01-FILXAPL.  006100      
000396          04 A02-R01-PLAZO            PIC  9(04)       COMP.      006200      
000397          04 A02-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
000398          04 A02-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
000399          04 A02-R01-TIPOPER          PIC  9(04)       COMP.      006500      
000400          04 A02-R01-PM               PIC  9(02)       COMP.      006600      
000401          04 A02-R01-FILS087          PIC  X(07).                 006700      
000402          04 A02-R01-MON              PIC  9(04)       COMP.      006701      
000403          04 FILLER                   PIC  X(36).                 006702      
000404                                                                  006800      
000405       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     006900      
000406          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
000407          04 A02-R01-DIASANO       PIC  9(03)       COMP.         007100      
000408          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
000409          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
000410          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
000411          04 A02-R01-STATION       PIC  9(04)       COMP.         007500      
000412          04 A02-R01-CTACON        PIC  9(02)       COMP.         007600      
000413          04 A02-R01-MONEDA        PIC  9(02)       COMP.         007700      
000414          04 A02-R01-GENEDOCTA     PIC  9(01).                    007702      
000415          04 A02-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
000416          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         007708      
000417          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         007710      
000418          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         007712      
000419          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         007714      
000420          04 A02-R01-FILS500       PIC  X(21).                    007716      
000421                                                                  007800      
000422       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     007900      
000423*         04 A02-R01-FECVEN        PIC  9(06)       COMP.         008000      
000424*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
000425          04 A02-R01-FECVEN        PIC  9(08)       COMP.         008002      
000426*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
000427          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
000428          04 A02-R01-DIASBG        PIC  9(04)       COMP.         008200      
000429          04 A02-R01-LINEA         PIC  9(04)       COMP.         008300      
000430          04 A02-R01-FOLIO         PIC  9(04)       COMP.         008400      
000431          04 A02-R01-FILS408       PIC  X(06).                    008500      
000432*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000433          04 FILLER                PIC  X(35).                    008502      
000434*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000435                                                                  008600      
000436    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     008700      
000437       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
000438       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
000439       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
000440*      03 FILLER                   PIC  X(162).                   009100      
000441*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
000442       03 FILLER                   PIC  X(372).                   009102      
000443*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
000444                                                                  009200      
000445                                                                  009300      
000446*=================================================================009400      
000447*====             DESCRIPCION DE CAMPOS                        ===009500      
000448*=================================================================009600      
000449                                                                  009700      
000450*=A02-R00-TIPO-REG     : 00 = HEADER                              009800      
000451*                        80 = INICIO                              009900      
000452*                        81 = REGISTRO DE SALDOS                  010000      
000453*                        82 = FIN                                 010100      
000454*                        99 = TRAILER                             010200      
000455                                                                  010300      
000456*=================================================================010400      
000457*===                REGISTRO HEADER                            ===010500      
000458*=================================================================010600      
000459                                                                  010700      
000460*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
000461*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
000462*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
000463                                                                  011100      
000464*=================================================================011200      
000465*===                   REGISTRO DE SALDOS                      ===011300      
000466*=================================================================011400      
000467                                                                  011500      
000468*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
000469*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
000470*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
000471*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
000472*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
000473*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
000474*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
000475*                             EDO CTA                             012300      
000476*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
000477*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
000478*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
000479*                        FORMATO AAMMDD                           012700      
000480*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
000481*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
000482*                        A02-R01-EDOCTA ES MAYOR A CERO)          013000      
000483*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
000484*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
000485*                        A02-R01-EDOCTA ES MAYOR A CERO)          013300      
000486*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
000487*                             CONTRATO                            013500      
000488*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
000489*                         CONTRATO DE ESTE REGISTRO.              013700      
000490*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
000491*                        EJ. 0002 (SALDO ACTUAL)                  013900      
000492*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
000493                                                                  014100      
000494*=================================================================014200      
000495*==                FILLER POR APLICACION                       ===014300      
000496*=================================================================014400      
000497                                                                  014500      
000498                                                                  014600      
000499                                                                  014700      
000500                                                                  014800      
000501*=================================================================014900      
000502*==                    SISTEMA S500                            ===015000      
000503*=================================================================015100      
000504                                                                  015200      
000505*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
000506*=A02-R01-DIASANO      : DIAS EN EL A\O                           015400      
000507*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
000508*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
000509*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
000510*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
000511*=A02-R01-CTACON       : 00 = SUCURSAL 870                        015900      
000512*                        01 = CUENTA CONCENTRADORA                016000      
000513*=A02-R01-MONEDA       : TIPO DE MONEDA                           016010      
000514*=A02-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
000515*=A02-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
000516*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
000517*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
000518*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
000519*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
000520*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
000521                                                                  016200      
000522*=================================================================016300      
000523*==                    SISTEMA S408                            ===016400      
000524*=================================================================016500      
000525                                                                  016600      
000526*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
000527*=A02-R01-TASINT       : TASA DE INTERES                          016800      
000528*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
000529*=A02-R01-LINEA        : NUMERO DE LINEA                          017000      
000530*=A02-R01-FOLIO        : NUMERO DE FOLIO                          017100      
000531*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
000532                                                                  017300      
000533*=================================================================017400      
000534*==                   REGISTRO TRAILER                         ===017500      
000535*=================================================================017600      
000536                                                                  017700      
000537*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
000538*                      TRAILER.                                   017900      
000539*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
000540*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
000541*                      DE SALDOS.                                 018200      
000542                                                                  018300      
000543*=================================================================018400      
000544*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
000545*=================================================================018600      
000546                                                                  018700      
000547*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
000548                                                                  018900      
000549* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
000550* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
000551* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
000552*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000553                                                                  003600      
000554 SD  A03-SORT.                                                    003700      
000555                                                                  003800      
000556*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000557*      COPY "(S151)S151/FORMATO/ARCHIVO/SALDOS.".                 003900      
000558******************************************************************000100      
000559*                                                                *000200      
000560*             FORMATO DEL ARCHIVO DE SALDOS                      *000300      
000561*                                                                *000400      
000562******************************************************************000500      
000563                                                                  000600      
000564                                                                  000700      
000565                                                                  000800      
000566 01 A02-R00-SALDOS.                                               000900      
000567    02 A02-R00-TIPO-REG            PIC  9(02)       COMP.         001000      
000568*   02 A02-R00-FILGRAL             PIC  X(179).                   001100      
000569*INICIA CODIGO DE RENOVACION CRONOS 2000                          001101      
000570    02 A02-R00-FILGRAL             PIC  X(389).                   001102      
000571*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001103      
000572                                                                  001200      
000573    02 A02-R00-HEADER              REDEFINES A02-R00-FILGRAL.     001300      
000574       03 A02-R00-HDR-SISTEMA      PIC  9(04)       COMP.         001400      
000575       03 A02-R00-HDR-PRODUCTO     PIC  9(04)       COMP.         001500      
000576*      03 A02-R00-HDR-FECHA        PIC  9(06)       COMP.         001600      
000577*INICIA CODIGO DE RENOVACION CRONOS 2000                          001601      
000578       03 A02-R00-HDR-FECHA        PIC  9(08)       COMP.         001602      
000579*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001603      
000580*      03 FILLER                   PIC  X(172).                   001700      
000581*INICIA CODIGO DE RENOVACION CRONOS 2000                          001701      
000582       03 FILLER                   PIC  X(381).                   001702      
000583*TERMINA CODIGO DE RENOVACION CRONOS 2000                         001703      
000584                                                                  001800      
000585    02 A02-R01-REG-SAL             REDEFINES A02-R00-FILGRAL.     001900      
000586       03 A02-R01-SIS              PIC  9(04)       COMP.         002000      
000587       03 A02-R01-PRD              PIC  9(04)       COMP.         002100      
000588       03 A02-R01-INS              PIC  9(04)       COMP.         002200      
000589       03 A02-R01-CTA              PIC  9(20)       COMP.         002300      
000590       03 A02-R01-CTA-R            REDEFINES A02-R01-CTA.         002400      
000591          05 A02-R01-SUCPRO        PIC  9(04)       COMP.         002500      
000592          05 A02-R01-CNT           PIC  9(16)       COMP.         002600      
000593       03 A02-R01-EDOCTA           PIC  9(02)       COMP.         002700      
000594*      03 A02-R01-FECPRO           PIC  9(06)       COMP.         002800      
000595*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000596       03 A02-R01-FECPRO           PIC  9(08)       COMP.         002802      
000597*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000598*      03 A02-R01-FECINI           PIC  9(06)       COMP.         002900      
000599*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000600       03 A02-R01-FECINI           PIC  9(08)       COMP.         002902      
000601*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000602*      03 A02-R01-FECFIN           PIC  9(06)       COMP.         003000      
000603*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000604       03 A02-R01-FECFIN           PIC  9(08)       COMP.         003002      
000605*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000606*      03 A02-R01-FECULTMOV        PIC  9(06)       COMP.         003100      
000607*INICIA CODIGO DE RENOVACION CRONOS 2000                          003101      
000608       03 A02-R01-FECULTMOV        PIC  9(08)       COMP.         003102      
000609*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003103      
000610       03 A02-R01-STATUS           PIC  9(02)       COMP.         003200      
000611       03 A02-R01-ELEM-IMP         OCCURS 30 TIMES.               003300      
000612          04 A02-R01-CVESDO        PIC  9(04)       COMP.         003400      
000613          04 A02-R01-IMPT          PIC S9(13)V99    COMP.         003500      
000614*      03 A02-R01-FILXAPL          PIC  X(19).                    003600      
000615*INICIA CODIGO DE RENOVACION CRONOS 2000                          003601      
000616       03 A02-R01-FILXAPL          PIC  X(55).                    003602      
000617*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003603      
000618                                                                  003700      
000619       03 A02-R01-S084             REDEFINES A02-R01-FILXAPL.     003800      
000620          04 A02-R01-TASNET        PIC  9(04)V9(04) COMP.         003900      
000621          04 A02-R01-TASBRU        PIC  9(04)V9(04) COMP.         004000      
000622          04 A02-R01-NETPER        PIC  9(04)V9(04) COMP.         004100      
000623          04 A02-R01-NETANU        PIC  9(04)V9(04) COMP.         004200      
000624          04 A02-R01-DIASPER       PIC  9(02)       COMP.         004300      
000625          04 A02-R01-DIASANU       PIC  9(02)       COMP.         004400      
000626          04 A02-R01-MONS084       PIC  9(02)       COMP.         004500      
000627*INICIA CODIGO DE RENOVACION CRONOS 2000                          004520      
000628          04 FILLER                PIC  X(36).                    004540      
000629*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004560      
000630                                                                  004600      
000631       03 A02-R01-S084AVB          REDEFINES A02-R01-FILXAPL.     004700      
000632          04 FILLER                PIC X(03).                     004800      
000633*         04 A02-R01-FECAPE        PIC  9(06)       COMP.         004900      
000634*INICIA CODIGO DE RENOVACION CRONOS 2000                          004901      
000635          04 A02-R01-FECAPE        PIC  9(08)       COMP.         004902      
000636*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004903      
000637*         04 A02-R01-FECSIGPAGO    PIC  9(06)       COMP.         005000      
000638*INICIA CODIGO DE RENOVACION CRONOS 2000                          005001      
000639          04 A02-R01-FECSIGPAGO    PIC  9(08)       COMP.         005002      
000640*TERMINA CODIGO DE RENOVACION CRONOS 2000                         005003      
000641          04 A02-R01-SORTEO        PIC  9(02)       COMP.         005100      
000642          04 A02-R01-RESTANTES     PIC  9(03)       COMP.         005200      
000643          04 A02-R01-ANTICIPADAS   PIC  9(03)       COMP.         005300      
000644          04 A02-R01-OPORTUNAS     PIC  9(02)       COMP.         005400      
000645          04 A02-R01-TOTALES       PIC  9(02)       COMP.         005500      
000646          04 A02-R01-ATRASOS       PIC  9(02)       COMP.         005600      
000647          04 A02-R01-BONOS         PIC  9(02)       COMP.         005700      
000648          04 A02-R01-ESQUEMA       PIC  9(02)       COMP.         005800      
000649          04 A02-R01-MOVEDAAVB     PIC  9(02)       COMP.         005900      
000650          04 FILLER                PIC  X(34).                    005950      
000651                                                                  006000      
000652       03 A02-R01-S087                REDEFINES A02-R01-FILXAPL.  006100      
000653          04 A02-R01-PLAZO            PIC  9(04)       COMP.      006200      
000654          04 A02-R01-TASS087          PIC  9(04)V9(04) COMP.      006300      
000655          04 A02-R01-INSTRUCCIONES    PIC  9(02)       COMP.      006400      
000656          04 A02-R01-TIPOPER          PIC  9(04)       COMP.      006500      
000657          04 A02-R01-PM               PIC  9(02)       COMP.      006600      
000658          04 A02-R01-FILS087          PIC  X(07).                 006700      
000659          04 A02-R01-MON              PIC  9(04)       COMP.      006701      
000660          04 FILLER                   PIC  X(36).                 006702      
000661                                                                  006800      
000662       03 A02-R01-S500             REDEFINES A02-R01-FILXAPL.     006900      
000663          04 A02-R01-DIASCICLO     PIC  9(03)       COMP.         007000      
000664          04 A02-R01-DIASANO       PIC  9(03)       COMP.         007100      
000665          04 A02-R01-TASRENET      PIC  9(04)V9(04) COMP.         007200      
000666          04 A02-R01-TASREBRU      PIC  9(04)V9(04) COMP.         007300      
000667          04 A02-R01-TASREANO      PIC  9(04)V9(04) COMP.         007400      
000668          04 A02-R01-STATION       PIC  9(04)       COMP.         007500      
000669          04 A02-R01-CTACON        PIC  9(02)       COMP.         007600      
000670          04 A02-R01-MONEDA        PIC  9(02)       COMP.         007700      
000671          04 A02-R01-GENEDOCTA     PIC  9(01).                    007702      
000672          04 A02-R01-INDENVCTD     PIC  9(02)       COMP.         007706      
000673          04 A02-R01-P-CTO-ORI     PIC  9(04)       COMP.         007708      
000674          04 A02-R01-I-CTO-ORI     PIC  9(04)       COMP.         007710      
000675          04 A02-R01-M-CTO-ORI     PIC  9(02)       COMP.         007712      
000676          04 A02-R01-C-TAR-ORI     PIC  9(16)       COMP.         007714      
000677          04 A02-R01-FILS500       PIC  X(21).                    007716      
000678                                                                  007800      
000679       03 A02-R01-S408             REDEFINES A02-R01-FILXAPL.     007900      
000680*         04 A02-R01-FECVEN        PIC  9(06)       COMP.         008000      
000681*INICIA CODIGO DE RENOVACION CRONOS 2000                          008001      
000682          04 A02-R01-FECVEN        PIC  9(08)       COMP.         008002      
000683*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008003      
000684          04 A02-R01-TASINT        PIC  9(04)V9(04) COMP.         008100      
000685          04 A02-R01-DIASBG        PIC  9(04)       COMP.         008200      
000686          04 A02-R01-LINEA         PIC  9(04)       COMP.         008300      
000687          04 A02-R01-FOLIO         PIC  9(04)       COMP.         008400      
000688          04 A02-R01-FILS408       PIC  X(06).                    008500      
000689*INICIA CODIGO DE RENOVACION CRONOS 2000                          008501      
000690          04 FILLER                PIC  X(35).                    008502      
000691*TERMINA CODIGO DE RENOVACION CRONOS 2000                         008503      
000692                                                                  008600      
000693    02 A02-R00-TRA-SAL             REDEFINES A02-R00-FILGRAL.     008700      
000694       03 A02-R02-TRA-TOTREG       PIC  9(08)       COMP.         008800      
000695       03 A02-R02-TRA-TOTCON       PIC  9(08)       COMP.         008900      
000696       03 A02-R02-TRA-IMPT         PIC S9(15)V99    COMP.         009000      
000697*      03 FILLER                   PIC  X(162).                   009100      
000698*INICIA CODIGO DE RENOVACION CRONOS 2000                          009101      
000699       03 FILLER                   PIC  X(372).                   009102      
000700*TERMINA CODIGO DE RENOVACION CRONOS 2000                         009103      
000701                                                                  009200      
000702                                                                  009300      
000703*=================================================================009400      
000704*====             DESCRIPCION DE CAMPOS                        ===009500      
000705*=================================================================009600      
000706                                                                  009700      
000707*=A02-R00-TIPO-REG     : 00 = HEADER                              009800      
000708*                        80 = INICIO                              009900      
000709*                        81 = REGISTRO DE SALDOS                  010000      
000710*                        82 = FIN                                 010100      
000711*                        99 = TRAILER                             010200      
000712                                                                  010300      
000713*=================================================================010400      
000714*===                REGISTRO HEADER                            ===010500      
000715*=================================================================010600      
000716                                                                  010700      
000717*=A02-R00-HDR-SISTEMA  : NUMERO DE SISTEMA EJ. 0500               010800      
000718*=A02-R00-HDR-PRODUCTO : NUMERO DE PRODUCTO EJ. 0066              010900      
000719*=A02-R00-HDR-FECHA    : FECHA CONTABLE DE LA APLICACION ORIGEN   011000      
000720                                                                  011100      
000721*=================================================================011200      
000722*===                   REGISTRO DE SALDOS                      ===011300      
000723*=================================================================011400      
000724                                                                  011500      
000725*=A02-R01-SIS          : NUMERO DE SISTEMA     EJ. 0500           011600      
000726*=A02-R01-PRD          : NUMERO DE PRODUCTO    EJ. 0066           011700      
000727*=A02-R01-INS          : NUMERO DE INSTRUMENTO EJ. 0006.          011800      
000728*=A02-R01-CTA          : NUMERO DE CUENTA/CONTRATO                011900      
000729*=A02-R01-EDOCTA       : 00 = NADA MAS ES REGISTRO DE SALDOS      012000      
000730*                        01 = ACTIVOS Y SE GENERA EDO. CTA.       012100      
000731*                        02 = CANCELADOS EN EL MES Y SE GENERA    012200      
000732*                             EDO CTA                             012300      
000733*                        03 = INACTIVOS Y SE GENERA EDO CTA       012400      
000734*                        04 = INACTIVOS Y NO SE GENERA EDO CTA    012500      
000735*=A02-R01-FECPRO       : FECHA CONTABLE DE LA APLICACION          012600      
000736*                        FORMATO AAMMDD                           012700      
000737*=A02-R01-FECINI       : FECHA INICIO DE CICLO PARA CORTE FORMATO 012800      
000738*                        AAMMDD (CAMPO OBLIGATORIO SI             012900      
000739*                        A02-R01-EDOCTA ES MAYOR A CERO)          013000      
000740*=A02-R01-FECFIN       : FECHA FINAL DE CICLO PARA CORTE FORMATO  013100      
000741*                        AAMMDD (CAMPO OBLIGATORIO SI             013200      
000742*                        A02-R01-EDOCTA ES MAYOR A CERO)          013300      
000743*=A02-R01-STATUS       : 00 = ULTIMO REGISTRO DE SALDOS POR       013400      
000744*                             CONTRATO                            013500      
000745*                        01 = SIGUIENTE REGISTRO PERTENECE AL     013600      
000746*                         CONTRATO DE ESTE REGISTRO.              013700      
000747*=A02-R01-CVESDO       : NUMERO DE CONCEPTO DE SALDOS             013800      
000748*                        EJ. 0002 (SALDO ACTUAL)                  013900      
000749*=A02-R01-IMPT         : IMPORTE DEL CONCEPTO DE SALDO            014000      
000750                                                                  014100      
000751*=================================================================014200      
000752*==                FILLER POR APLICACION                       ===014300      
000753*=================================================================014400      
000754                                                                  014500      
000755                                                                  014600      
000756                                                                  014700      
000757                                                                  014800      
000758*=================================================================014900      
000759*==                    SISTEMA S500                            ===015000      
000760*=================================================================015100      
000761                                                                  015200      
000762*=A02-R01-DIASCICLO    : DIAS EN EL CICLO DE CORTE                015300      
000763*=A02-R01-DIASANO      : DIAS EN EL A\O                           015400      
000764*=A02-R01-TASRENET     : TASA DE RENDIMIENTO NETA                 015500      
000765*=A02-R01-TASREBRU     : TASA DE RENDIMIENTO BRUTA                015600      
000766*=A02-R01-TASREANO     : TASA DE RENDIMIENTO NETA EN EL A\O       015700      
000767*=A02-R01-STATION      : IDENTIFICADOR PARA BANCA ELECTRONICA     015800      
000768*=A02-R01-CTACON       : 00 = SUCURSAL 870                        015900      
000769*                        01 = CUENTA CONCENTRADORA                016000      
000770*=A02-R01-MONEDA       : TIPO DE MONEDA                           016010      
000771*=A02-R01-GENEDOCTA    : VALOR PARA GENERACION ESTADO DE CTA      016020      
000772*=A02-R01-INDENVCTD    : VALOR DE INDICADOR DE ENVIO CITIDIRECT   016030      
000773*=A02-R01-P-CTO-ORI    : PROD DEL CTO ORIGINAL SE TRASP BENEF     016040      
000774*=A02-R01-I-CTO-ORI    : INST DEL CTO ORIGINAL SE TRASP BENEF     016050      
000775*=A02-R01-M-CTO-ORI    : MONE DEL CTO ORIGINAL SE TRASP BENEF     016060      
000776*=A02-R01-C-TAR-ORI    : CTO  TARJETA ORIGINAL SE TRASP BENEF     016070      
000777*=A02-R01-FILS500      : FILLER PARA USO FUTURO                   016100      
000778                                                                  016200      
000779*=================================================================016300      
000780*==                    SISTEMA S408                            ===016400      
000781*=================================================================016500      
000782                                                                  016600      
000783*=A02-R01-FECVEN       : FECHA DE VENCIMIENTO DE LA LINEA         016700      
000784*=A02-R01-TASINT       : TASA DE INTERES                          016800      
000785*=A02-R01-DIASBG       : DIAS DE SOBREGIRO                        016900      
000786*=A02-R01-LINEA        : NUMERO DE LINEA                          017000      
000787*=A02-R01-FOLIO        : NUMERO DE FOLIO                          017100      
000788*=A02-R01-FILS408      : FILLER PARA USO FUTURO                   017200      
000789                                                                  017300      
000790*=================================================================017400      
000791*==                   REGISTRO TRAILER                         ===017500      
000792*=================================================================017600      
000793                                                                  017700      
000794*=A02-R02-TRA-TOTREG : TOTAL DE REGISTROS SIN INCLUIR HEADER Y    017800      
000795*                      TRAILER.                                   017900      
000796*=A02-R02-TRA-TOTCON : TOTAL DE CONTRATOS                         018000      
000797*=A02-R02-TRA-IMPT   : SUMA DE TODOS LOS IMPORTES DE LOS CONCEPTOS018100      
000798*                      DE SALDOS.                                 018200      
000799                                                                  018300      
000800*=================================================================018400      
000801*==             NOMBRE EXTERNO DE ARCHIVO                      ===018500      
000802*=================================================================018600      
000803                                                                  018700      
000804*=  (SXXX)S151/FILE/S050/SALDOSYYY/AAMMDD                         018800      
000805                                                                  018900      
000806* XXX   = NUMERO DEL USERCODE EJ. S500                            019000      
000807* YYY   = NUMERO DEL PRODUCTO EJ. S066                            019100      
000808* AAMMDD = FECHA CONTABLE DEL SISTEMA ORIGEN                      019200      
000809*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000810                                                                  004000      
000811 FD E01-SDOS                                                      004020      
000812    BLOCK CONTAINS        60 RECORDS                              004040      
000813    VALUE OF TITLE        IS WKS-SDOS-INTELAR.                    004060      
000814 01 REG-SDOS                      PIC X(53).                      004080      
000815                                                                  004100      
000816 DATA-BASE SECTION.                                               004200      
000817 DB SDODB = S151BD11SDOS151.                                      004300      
000818 DB MOVDB = S151BD12MC001S151.                                    004400      
000819/                                                                 004500      
000820 WORKING-STORAGE SECTION.                                         004600      
000821*INICIA CODIGO DE RENOVACION CRONOS 2000                          004601      
000822*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000823* COPY "S151/CRONOS2K/CPY/WS".                                    004602      
000824******************************************************************000100      
000825** This copyBook defines all the additional variables that      **000200      
000826** Unisys has defined for the CRONOS2K project                  **000300      
000827** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000828******************************************************************000500      
000829                                                                  000600      
000830******************************************************************000700      
000831** These Variables are used to Accept the system date in long   **000800      
000832** format and get the century information                       **000900      
000833** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000834 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000835 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000836    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000837    05 FILLER      PIC X(1).                                      001400      
000838    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000839    05 FILLER      PIC X(1).                                      001600      
000840    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000841    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000842      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000843      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000844******************************************************************002100      
000845                                                                  002200      
000846******************************************************************002300      
000847** This variable defines a date in the format MMDDCCAA          **002400      
000848**                                                              **002500      
000849 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000850 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000851    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000852    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000853    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000854    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000855      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000856      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000857******************************************************************003400      
000858                                                                  003500      
000859******************************************************************003600      
000860** This variable defines a date in the format CCAAMMDD          **003700      
000861**                                                              **003800      
000862 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000863 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000864    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000865    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000866      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000867      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000868    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000869    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000870******************************************************************004700      
000871                                                                  004800      
000872******************************************************************004900      
000873** This variable defines a date in the format DDMMCCAA          **005000      
000874**                                                              **005100      
000875 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000876 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000877    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000878    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000879    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000880    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000881      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000882      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000883******************************************************************006000      
000884                                                                  006100      
000885******************************************************************006200      
000886** This variable defines a date in the Julian Format CCAADDD    **006300      
000887**                                                              **006400      
000888 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000889 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000890    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000891    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000892                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000893      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000894      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000895    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000896******************************************************************007300      
000897                                                                  007400      
000898******************************************************************007500      
000899** This variable defines a date in the format AAMMDD            **007600      
000900**                                                              **007700      
000901 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000902 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000903    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000904    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000905    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000906******************************************************************008300      
000907                                                                  008400      
000908******************************************************************008500      
000909** This variable defines a date in the format MMDDAA            **008600      
000910**                                                              **008700      
000911 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000912 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000913    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000914    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000915    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000916******************************************************************009300      
000917                                                                  009400      
000918******************************************************************009500      
000919** This variable defines a date in the format DDMMAA            **009600      
000920**                                                              **009700      
000921 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000922 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000923    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000924    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000925    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000926******************************************************************010300      
000927                                                                  010400      
000928******************************************************************010500      
000929** These variables are defined to be used for CALL bridge logic **010600      
000930**                                                              **010700      
000931 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000932 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000933 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000934 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000935 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000936 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000937******************************************************************011400      
000938                                                                  011500      
000939******************************************************************011600      
000940** This variable is used for converting only a year field AA to **011700      
000941** CCAA and a CCAA to AA                                        **011800      
000942 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000943 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000944    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000945    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000946 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000947 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000948******************************************************************012300      
000949                                                                  012400      
000950******************************************************************012500      
000951** These variables are Bridge Variables for Intercambio files   **012600      
000952** para EDOCTA                                                  **012700      
000953 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000954 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000955 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000956 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000957 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000958 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000959 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000960******************************************************************013500      
000961* Para MODULO                                                     013600      
000962 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000963******************************************************************013800      
000964******************************************************************013900      
000965** Para FMOVSCHABO                                                014000      
000966 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000967******************************************************************014200      
000968                                                                  014300      
000969******************************************************************014400      
000970***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000971******************************************************************014600      
000972                                                                  014700      
000973 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000974 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000975     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000976     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000977     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000978******************************************************************015300      
000979                                                                  015400      
000980******************************************************************015500      
000981***  These Variables Are Defined For Date In AAMM Format       ***015600      
000982******************************************************************015700      
000983                                                                  015800      
000984 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000985 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000986     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000987     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000988******************************************************************016300      
000989                                                                  016400      
000990                                                                  016500      
000991*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000992  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       004603      
000993*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004604      
000994                                                                  004651      
000995*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000996*  COPY "(S151)S151/FORMATO/DISPLAY.".                            004671      
000997                                                                  000100      
000998*===============================================================* 000200      
000999*         FORMATO PARA DISPLAYS                                 * 000300      
001000*===============================================================* 000400      
001001                                                                  000500      
001002 01 WKS-TIT-REPORTE2.                                             000600      
001003    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
001004    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
001005    02 FILLER                       PIC X(06) VALUE               000900      
001006                                              "/LIST/".           001000      
001007    02 WKS-PASO-BACK2               PIC X(04).                    001051      
001008    02 FILLER                       PIC X(01) VALUE "/".          001071      
001009    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
001010    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
001011    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
001012    02 FILLER                       PIC X(1)  VALUE "/".          001400      
001013    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
001014    02 FILLER                       PIC X(11) VALUE               001600      
001015                                              "/001MSGIMP.".      001700      
001016                                                                  002100      
001017 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
001018                                                                  002300      
001019***********************************************************       002400      
001020*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
001021***********************************************************       002600      
001022 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
001023*8D                                                               002800      
001024 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
001025 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
001026    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
001027    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
001028    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
001029*8D                                                               003400      
001030 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
001031 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
001032    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
001033    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
001034    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
001035                                                                  004100      
001036 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
001037                                                                  004300      
001038 01 WKS-FECHA-HORA2.                                              004400      
001039    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
001040    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
001041       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
001042       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
001043    02 WKS-TIME-MAQ2.                                             004600      
001044       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
001045       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
001046          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
001047          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
001048          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
001049       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
001050    02 FILLER                             PIC X(01).              004900      
001051    02 WKS-RESTO2                         PIC X(04).              005000      
001052                                                                  005100      
001053*8D                                                               005200      
001054****************** REPORTE DE MENSAJES *********************      005300      
001055 01 WLI-ENCAB-12.                                                 005400      
001056    03 FILLER                             PIC X(05) VALUE         005500      
001057       "S151-".                                                   005600      
001058    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
001059    03 FILLER                             PIC X(15) VALUE         005671      
001060       "-001IMPMENSAJES".                                         005691      
001061    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
001062    03 FILLER                             PIC X(34) VALUE         005800      
001063       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
001064    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
001065    03 FILLER                             PIC X(26) VALUE         006100      
001066       "FECHA DE LA INFORMACION : ".                              006200      
001067    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
001068    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
001069       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
001070       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
001071       05  WKS-SLASH1                         PIC X(01).          006356      
001072       05  WLI-RB-E1-MES                  PIC 99.                 006357      
001073       05  WKS-SLASH2                         PIC X(01).          006358      
001074       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
001075 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
001076 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
001077    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
001078    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
001079    03 FILLER                          PIC X(01).                 006371      
001080    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
001081    03 FILLER                          PIC X(01).                 006381      
001082    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
001083*8D                                                               006400      
001084 01 WLI-ENCAB-22.                                                 006500      
001085     03 FILLER                          PIC X(11) VALUE           006600      
001086        "F.PROCESO: ".                                            006700      
001087     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
001088     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
001089     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
001090     03 FILLER                          PIC X(01) VALUE ":".      007020      
001091     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
001092     03 FILLER                          PIC X(01) VALUE ":".      007060      
001093     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
001094     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
001095     03 FILLER                          PIC X(24) VALUE           007200      
001096              "IMPRESION MENSAJES DEL S".                         007300      
001097     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
001098     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
001099     03 FILLER                          PIC X(14) VALUE           007600      
001100        "TIPO PROCESO: ".                                         007700      
001101     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
001102*8D                                                               007900      
001103 01 WLI-ENCAB-32.                                                 008000      
001104     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
001105*       "VERSION  : ".                                            008200      
001106*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
001107     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
001108     03 FILLER                     PIC X(07) VALUE                008500      
001109        "HOJA : ".                                                008600      
001110     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
001111                                                                  008800      
001112 01 WLI-ENCAB-42.                                                 008900      
001113     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
001114     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
001115     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
001116                                                                  009300      
001117 01 WLI-ENCAB-52.                                                 009400      
001118    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
001119    03 WLI-TIPO-LJ                PIC X(02).                      009600      
001120    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
001121    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
001122                                                                  009900      
001123*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
001124 01 WLI-ENCAB-62.                                                 009910      
001125    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
001126    03 WLI-RESULT                 PIC X(04).                      009920      
001127    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
001128    03 WLI-TEXTO                  PIC X(110).                     009930      
001129                                                                  009935      
001130 01 WLI-TOT-ENVIO.                                                009940      
001131    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
001132    03 FILLER                     PIC X(37) VALUE                 009950      
001133       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
001134    03 WLI-ENV-CTD                PIC X(04).                      009960      
001135*FIN - INFOWARE                                                   009970      
001136****************************************************************  010000      
001137*                 CONTADORES DE HOJAS                          *  010100      
001138****************************************************************  010200      
001139                                                                  010300      
001140  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
001141*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001142******************************************************************004700      
001143*            NOMBRE EXTERNO DEL ARCHIVO SDOS DEL S151            *004800      
001144******************************************************************004900      
001145                                                                  005000      
001146 01  WKS-TIT-SDOENT.                                              005100      
001147     02  WKS-NOM-SDOENT                PIC X(34).                 005200      
001148     02  WKS-FEC-SDOENT                PIC 9(06).                 005300      
001149     02  WKS-FEC-SDOENT-R              REDEFINES WKS-FEC-SDOENT.  005400      
001150         03 WKS-FECSDO-AAMM            PIC 9(04).                 005500      
001151         03 WKS-FECSDO-DD              PIC 9(02).                 005600      
001152     02  FILLER                        PIC X(04) VALUE            005700      
001153                                       " ON ".                    005800      
001154     02  WKS-PK-SDOENT                 PIC X(17).                 005900      
001155     02  FILLER                        PIC X(01) VALUE ".".       006000      
001156                                                                  006100      
001157 01 WKS-NOMBD-SDO.                                                006200      
001158    02 FILLER                      PIC X(06) VALUE "(S151)".      006300      
001159    02 WKS-BDSDO                   PIC X(17).                     006400      
001160    02 FILLER                      PIC X(10) VALUE " ON CMEMP.".  006500      
001161 01 WKS-NOMBD-MOV.                                                006600      
001162    02 FILLER                      PIC X(06) VALUE "(S151)".      006700      
001163    02 WKS-BDMOV                   PIC X(17).                     006800      
001164    02 FILLER                      PIC X(10) VALUE " ON CMEMP.".  006900      
001165******************************************************************006910      
001166*           NOMBRE EXTERNO ARCHIVO DE SDOS PARA TESORERIA        *006920      
001167******************************************************************006930      
001168 01 WKS-TIT-SDOS.                                                 006940      
001169    02 FILLER                     PIC X(10) VALUE "(S151)S151".   006950      
001170    02 FILLER                     PIC X(10) VALUE "/FILE/E01/" .  006960      
001171    02 WKS-CSI-ETI                PIC 99.                         006970      
001172    02 FILLER                     PIC X(11) VALUE "/TESORERIA/" . 006975      
001173    02 WKS-TIT-FECENV             PIC 9(08).                      006980      
001174    02 FILLER                     PIC X(10) VALUE " ON CMEMP.".   006990      
001175 01 WKS-WFL-COPY.                                                 006991      
001176    02 FILLER           PIC X(22) VALUE "BEGIN JOB; COPY ".       006992      
001177    02 WKS-FILE-ORI     PIC X(50).                                006993      
001178    02 FILLER           PIC X(10) VALUE " AS (S151)".             006994      
001179    02 WKS-FILE-DEST    PIC X(50).                                006995      
001180    02 FILLER           PIC X(18) VALUE " FROM CMEMP(PACK) ".     006996      
001181    02 FILLER           PIC X(15) VALUE " TO CMEMP(PACK)".        006997      
001182    02 FILLER           PIC X(10) VALUE "; END JOB.".             006998      
001183 01 WKS-SDOS-INTELAR.                                             006999      
001184    02 FILLER          PIC X(24) VALUE "S151/FILE/INTS/15104S09/".007000      
001185    02 WKS-INTE-CSI     PIC 9(02).                                007001      
001186    02 FILLER           PIC X(01) VALUE "/".                      007002      
001187    02 WKS-INTE-LETRA   PIC X(01).                                007003      
001188    02 FILLER           PIC X(03)  VALUE "ST2".                   007004      
001189    02 WKS-INTE-MM      PIC 9(02).                                007005      
001190    02 WKS-INTE-DD      PIC 9(02).                                007006      
001191    02 FILLER           PIC X(14) VALUE "/TXT ON CMEMP.".         007007      
001192 77 W77-INTE-SNT                          PIC S9(11) BINARY.      007008      
001193 01 WKS-ERRNUM-INTELAR                    PIC 9(02).              007009      
001194 01 WKS-DET-SDOS.                                                 007010      
001195    03 WKS-FECHA-PRO                      PIC 9(08).              007011      
001196    03 FILLER                             PIC X VALUE ",".        007015      
001197    03 WKS-PROD-PRO                       PIC 9(04).              007030      
001198    03 FILLER                             PIC X VALUE ",".        007035      
001199    03 WKS-INST-PRO                       PIC 9(02).              007040      
001200    03 FILLER                             PIC X VALUE ",".        007045      
001201    03 WKS-MON-PRO                        PIC 9(02).              007050      
001202    03 FILLER                             PIC X VALUE ",".        007055      
001203    03 WKS-SDOANT-PRO                     PIC 9(14)V99.           007060      
001204    03 FILLER                             PIC X VALUE ",".        007065      
001205    03 WKS-SDOACT-PRO                     PIC 9(14)V99.           007070      
001206                                                                  007075      
001207 01 WKS-TIT-WFL.                                                  007077      
001208    02 FILLER                  PIC X(16) VALUE "BEGIN JOB;START ".007079      
001209    02 WKS-START-PROG             PIC X(36) VALUE                 007081      
001210        "(S006)S006/WFL/P940/01MTP001 ON XFER".                   007082      
001211    02 FILLER                     PIC X(02) VALUE " (".           007083      
001212    02 FILLER                     PIC X(01) VALUE QUOTES.         007084      
001213    02 WKS-START-LLAVE            PIC X(09) VALUE "S151TESO".     007085      
001214    02 FILLER                     PIC X(01) VALUE QUOTES.         007086      
001215    02 FILLER                     PIC X(01) VALUE ",".            007087      
001216    02 FILLER                     PIC X(01) VALUE QUOTES.         007088      
001217    02 WKS-START-FEC              PIC X(08).                      007089      
001218    02 FILLER                     PIC X(01) VALUE QUOTES.         007090      
001219    02 FILLER                     PIC X(12) VALUE ") ; END JOB.". 007097      
001220**************************************************************    007100      
001221******      NOMBRE EXTERNO DEL REPORTE DE CIFRAS       *******    007200      
001222**************************************************************    007300      
001223 01  WKS-TIT-REPMES.                                              007400      
001224     02  FILLER                        PIC X(01) VALUE "S".       007500      
001225     02  WLI-SIST-CIFRAS               PIC 9(03) VALUE 0.         007600      
001226     02  FILLER                        PIC X(11) VALUE            007700      
001227                                      "/LIST/P178/".              007800      
001228     02  WLI-CSI-CIFRAS                PIC 9(02).                 007900      
001229     02  FILLER                        PIC X(08) VALUE            008000      
001230                                      "00/R000/".                 008100      
001231     02  WLI-FECHA-CIFRAS              PIC 9(06) VALUE 0.         008200      
001232     02  FILLER                        PIC X(01) VALUE "/".       008300      
001233     02  WLI-NUMMIX-CIFRAS             PIC 9(07).                 008400      
001234     02  FILLER                        PIC X(01) VALUE "/".       008500      
001235     02  WLI-NUMREP                    PIC 9(03).                 008520      
001236     02  FILLER                        PIC X(01) VALUE "S".       008540      
001237     02  WLI-SIST-NOMEXT               PIC 9(03) VALUE 0.         008600      
001238     02  FILLER                        PIC X(07) VALUE "ERRSAL.". 008700      
001239                                                                  008800      
001240**************************************************************    008900      
001241******      NOMBRE EXTERNO DEL REPORTE N U E V O       *******    009000      
001242**************************************************************    009100      
001243 01  WKS-TIT-REPNVO.                                              009200      
001244     02  FILLER                        PIC X(01) VALUE "S".       009300      
001245     02  WLI-SIST-NUEVO                PIC 9(03) VALUE 0.         009400      
001246     02  FILLER                        PIC X(11) VALUE            009500      
001247                                      "/LIST/P178/".              009600      
001248     02  WLI-CSI-NUEVO                 PIC 9(02).                 009700      
001249     02  FILLER                        PIC X(08) VALUE            009800      
001250                                      "00/R000/".                 009900      
001251     02  WLI-FECHA-NUEVO               PIC 9(06) VALUE 0.         010000      
001252     02  FILLER                        PIC X(01) VALUE "/".       010100      
001253     02  WLI-NUMMIX-NUEVO              PIC 9(07).                 010200      
001254     02  FILLER                        PIC X(01) VALUE "/".       010300      
001255     02  WLI-NUMREP-2                  PIC 9(03).                 010400      
001256     02  FILLER                        PIC X(01) VALUE "S".       010450      
001257     02  WLI-SIST-NOMEXTNEW            PIC 9(03) VALUE 0.         010500      
001258     02  WLI-NOMB-REPORT               PIC X(08) VALUE SPACES.    010600      
001259     02  FILLER                        PIC X(01) VALUE ".".       010700      
001260                                                                  010800      
001261                                                                  010900      
001262 01  WLI-ENCABEZADO-1.                                            011000      
001263     02  WLI-DESCRIP-REP               PIC X(24) VALUE SPACES.    011100      
001264     02  FILLER                        PIC X(15) VALUE SPACES.    011200      
001265     02  FILLER                        PIC X(55) VALUE            011300      
001266      "B A N C O   N A C I O N A L   D E   M E X I C O   S. A.".  011400      
001267     02  FILLER                        PIC X(23) VALUE SPACES.    011500      
001268     02  FILLER                        PIC X(08) VALUE            011600      
001269                                    "HOJA :  ".                   011700      
001270     02  WLI-ENC1-PAG                  PIC ZZZ,ZZZ.               011800      
001271                                                                  011900      
001272 01  WLI-ENCABEZADO-2.                                            012000      
001273     02  FILLER                        PIC X(20) VALUE SPACES.    012100      
001274*INICIA CODIGO DE RENOVACION CRONOS 2000                          012801      
001275     02  FILLER                        PIC X(28) VALUE SPACES.    012802      
001276*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012803      
001277     02  FILLER                        PIC X(37) VALUE            012900      
001278         "ADMINISTRADOR DE SALDOS Y MOVIMIENTOS".                 013000      
001279*    02  FILLER                        PIC X(21) VALUE SPACES.    013100      
001280*INICIA CODIGO DE RENOVACION CRONOS 2000                          013101      
001281     02  FILLER                        PIC X(19) VALUE SPACES.    013102      
001282*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013103      
001283     02  FILLER                        PIC X(18) VALUE            013200      
001284                                    "FECHA EJECUCION : ".         013300      
001285*    02  WLI-FECEJEC-ENC               PIC 99/99/99.              013400      
001286*INICIA CODIGO DE RENOVACION CRONOS 2000                          013401      
001287     02  WLI-FECEJEC-ENC               PIC 99/99/9999.            013402      
001288*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013403      
001289                                                                  013500      
001290 01  WLI-ENCABEZADO-3.                                            013600      
001291     02  FILLER                        PIC X(16) VALUE            013700      
001292                                    "FECHA PROCESO : ".           013800      
001293*    02  WLI-FECPROC-ENC               PIC 99/99/99.              013900      
001294*INICIA CODIGO DE RENOVACION CRONOS 2000                          013901      
001295     02  WLI-FECPROC-ENC               PIC 9999/99/99.            013902      
001296*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013903      
001297*    02  FILLER                        PIC X(18) VALUE SPACES.    014000      
001298*INICIA CODIGO DE RENOVACION CRONOS 2000                          014001      
001299     02  FILLER                        PIC X(16) VALUE SPACES.    014002      
001300*TERMINA CODIGO DE RENOVACION CRONOS 2000                         014003      
001301     02  FILLER                        PIC X(46) VALUE            014100      
001302         "REPORTE DE CONTRATOS CON ERROR EN SALDOS DEL S".        014200      
001303     02  WLI-NUMSIS-ENC3               PIC 9(03).                 014300      
001304     02  FILLER                        PIC X(15) VALUE SPACES.    014400      
001305     02  FILLER                        PIC X(18) VALUE            014500      
001306                                    "HORA  EJECUCION : ".         014600      
001307     02  WLI-HH-EJEC-ENC              PIC 99.                     014700      
001308     02  FILLER                       PIC X(01) VALUE ":".        014720      
001309     02  WLI-MM-EJEC-ENC              PIC 99.                     014740      
001310     02  FILLER                       PIC X(01) VALUE ":".        014760      
001311     02  WLI-SS-EJEC-ENC              PIC 99.                     014780      
001312                                                                  014800      
001313 01  WLI-ENCABEZADO-4.                                            014900      
001314     02 FILLER                     PIC X(63) VALUE                015000      
001315     "       CONTRATO         PRD. INST.      CONCEPTO        SALD015100      
001316-    "O S".                                                       015200      
001317     02 WLI-NUMSIS-ENC4            PIC 9(03).                     015300      
001318     02 FILLER                     PIC X(43) VALUE                015400      
001319     "         SALDO S151                 LEYENDA".               015500      
001320 01  WLI-ENCABEZADO-6.                                            015600      
001321     02  FILLER                        PIC X(16) VALUE            015700      
001322                                    "FECHA PROCESO : ".           015800      
001323*    02  WLI-FECPROC-ENC6              PIC 99/99/99.              015900      
001324*INICIA CODIGO DE RENOVACION CRONOS 2000                          015901      
001325     02  WLI-FECPROC-ENC6              PIC 9999/99/99.            015902      
001326*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015903      
001327*    02  FILLER                        PIC X(15) VALUE SPACES.    016000      
001328*INICIA CODIGO DE RENOVACION CRONOS 2000                          016001      
001329     02  FILLER                        PIC X(13) VALUE SPACES.    016002      
001330*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016003      
001331     02  FILLER                        PIC X(54) VALUE            016100      
001332         "REPORTE DE TOTALES POR CLAVES DIARIAS CONTRA MENSUALES".016200      
001333     02  FILLER                        PIC X(13) VALUE SPACES.    016300      
001334     02  FILLER                        PIC X(18) VALUE            016400      
001335                                    "HORA  EJECUCION : ".         016500      
001336     02  WLI-HH-EJEC-ENC6              PIC 99.                    016600      
001337     02  FILLER                        PIC X VALUE ":".           016620      
001338     02  WLI-MM-EJEC-ENC6              PIC 99.                    016640      
001339     02  FILLER                        PIC X VALUE ":".           016660      
001340     02  WLI-SS-EJEC-ENC6              PIC 99.                    016680      
001341                                                                  016800      
001342 01  WLI-ENCABEZADO-7.                                            016900      
001343     02  FILLER                        PIC X(16) VALUE            017000      
001344                                    "FECHA PROCESO : ".           017100      
001345*    02  WLI-FECPROC-ENC7              PIC 99/99/99.              017200      
001346*INICIA CODIGO DE RENOVACION CRONOS 2000                          017201      
001347     02  WLI-FECPROC-ENC7              PIC 9999/99/99.            017202      
001348*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017203      
001349*    02  FILLER                        PIC X(18) VALUE SPACES.    017300      
001350*INICIA CODIGO DE RENOVACION CRONOS 2000                          017301      
001351     02  FILLER                        PIC X(16) VALUE SPACES.    017302      
001352*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017303      
001353     02  FILLER                        PIC X(49) VALUE            017400      
001354         "        REPORTE DE POSICION POR PRODUCTO         ".     017500      
001355     02  FILLER                        PIC X(15) VALUE SPACES.    017600      
001356     02  FILLER                        PIC X(18) VALUE            017700      
001357                                    "HORA  EJECUCION : ".         017800      
001358     02  WLI-HH-EJEC-ENC7              PIC 99.                    017900      
001359     02  FILLER                        PIC X VALUE ":".           017920      
001360     02  WLI-MM-EJEC-ENC7              PIC 99.                    017940      
001361     02  FILLER                        PIC X VALUE ":".           017960      
001362     02  WLI-SS-EJEC-ENC7              PIC 99.                    017980      
001363                                                                  018000      
001364 01  WLI-ENCABEZADO-20.                                           018100      
001365     02  FILLER                        PIC X(04) VALUE            018200      
001366                                    "9999".                       018300      
001367 01  WLI-DETALLE-1.                                               018400      
001368     02  FILLER                    PIC X(01) VALUE SPACES.        018500      
001369     02  WKS-D1-CNT                PIC Z(18)99B(02).              018600      
001370     02  WKS-D1-PRD                PIC ZZ99B(01).                 018700      
001371     02  WKS-D1-INS                PIC ZZ99B(01).                 018800      
001372     02  WKS-D1-CON                PIC X(16).                     018900      
001373     02  WKS-D1-SDOS500            PIC ----,---,---,--9.99B(02).  019000      
001374     02  WKS-D1-SDOS151            PIC ----,---,---,--9.99B(02).  019100      
001375     02  WKS-D1-LEY                PIC X(30).                     019200      
001376 01 WLI-ENCABEZADO-5.                                             019300      
001377*   02 FILLER                      PIC X(131) VALUE               019400      
001378*   " CVE/TRAN  SUC/OPE  CAJ/OPE           IMPORTE       FEC MOV  019500      
001379*-  " FEC CON  FEC VAL   AUT/ORI AUT/3ER/NIV AUT/S151 SEC/BD/CIC S019600      
001380*-  "TATUS MOV".                                                  019700      
001381*INICIA CODIGO DE RENOVACION CRONOS 2000                          019701      
001382    02 FILLER                      PIC X(131) VALUE               019702      
001383    " CVE/TRAN SUC/OPE CAJ/OPE           IMPORTE       FEC MOV    019703      
001384-   " FEC CON  FEC VAL   AUT/ORI AUT/3ER/NIV AUT/S151 SEC/BD/CIC S019704      
001385-   "TATUS MOV".                                                  019705      
001386*TERMINA CODIGO DE RENOVACION CRONOS 2000                         019706      
001387 01  WLI-DETALLE-2.                                               019800      
001388    02 FILLER                      PIC X(03) VALUE SPACES.        019900      
001389*   02 WKS-D2-CVETRA               PIC ZZZ9B(06).                 020000      
001390*INICIA CODIGO DE RENOVACION CRONOS 2000                          020001      
001391    02 WKS-D2-CVETRA               PIC ZZZ9B(03).                 020002      
001392*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020003      
001393*   02 WKS-D2-SUCOPE               PIC Z(04)B(05).                020100      
001394*INICIA CODIGO DE RENOVACION CRONOS 2000                          020101      
001395    02 WKS-D2-SUCOPE               PIC Z(04)B(04).                020102      
001396*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020103      
001397*   02 WKS-D2-CAJOPE               PIC Z(04)B(06).                020200      
001398*INICIA CODIGO DE RENOVACION CRONOS 2000                          020201      
001399    02 WKS-D2-CAJOPE               PIC Z(04)B(04).                020202      
001400*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020203      
001401    02 WKS-D2-IMP                  PIC $$$$,$$$,$$$,$$9.99B(01).  020300      
001402*   02 WKS-D2-FECMOV               PIC 99/99/99B(02).             020400      
001403*INICIA CODIGO DE RENOVACION CRONOS 2000                          020401      
001404    02 WKS-D2-FECMOV               PIC 9999/99/99B(02).           020402      
001405*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020403      
001406*   02 WKS-D2-FECCON               PIC 99/99/99B(01).             020500      
001407*INICIA CODIGO DE RENOVACION CRONOS 2000                          020501      
001408    02 WKS-D2-FECCON               PIC 9999/99/99B(01).           020502      
001409*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020503      
001410*   02 WKS-D2-FECVAL               PIC 99/99/99B(01).             020600      
001411*INICIA CODIGO DE RENOVACION CRONOS 2000                          020601      
001412    02 WKS-D2-FECVAL               PIC 9999/99/99B(01).           020602      
001413*TERMINA CODIGO DE RENOVACION CRONOS 2000                         020603      
001414    02 WKS-D2-AUTORI               PIC Z(08)B(03).                020700      
001415    02 WKS-D2-AUT3ERNIV            PIC Z(08)B(02).                020800      
001416    02 WKS-D2-AUTS151              PIC Z(08)B(02).                020900      
001417    02 WKS-D2-SEC                  PIC Z(10)B(05).                021000      
001418    02 WKS-D2-STAMOV               PIC Z(02).                     021100      
001419                                                                  021200      
001420 01 WLI-DETALLE-9.                                                021300      
001421    02 FILLER                      PIC X(52) VALUE                021400      
001422    "                             REPORTE SIN INFORMACION".       021500      
001423                                                                  021600      
001424 01 WLI-ENCABEZADO-8.                                             021700      
001425    02 FILLER                      PIC X(108) VALUE               021800      
001426       "                                           PRODUCTO       021900      
001427-      "   INSTRUMENTO          MONEDA                    ".      022000      
001428                                                                  022100      
001429 01 WLI-DETALLE-3.                                                022200      
001430    02 FILLER                      PIC X(45) VALUE SPACES.        022300      
001431    02 WKS-D3-PRD                  PIC ZZ99B(16).                 022400      
001432    02 WKS-D3-INS                  PIC ZZ99B(14).                 022500      
001433    02 WKS-D3-MON                  PIC ZZZ9B(21).                 022600      
001434                                                                  022700      
001435 01 WLI-ENCABEZADO-9.                                             022800      
001436    02 FILLER                      PIC X(125) VALUE               022900      
001437       "            LEYENDA              NUM DE MOVS        IMPORT023000      
001438-      "E                   LEYENDA              NUM DE MOVS      023100      
001439-      "  IMPORTE".                                               023200      
001440                                                                  023300      
001441 01 WLI-DETALLE-4.                                                023400      
001442    02 FILLER                      PIC X(01) VALUE SPACES.        023500      
001443    02 WKS-D4-LEYEND1              PIC X(30)B(03).                023600      
001444    02 WKS-D4-NMOVS1               PIC Z(08)9B(02).               023700      
001445    02 WKS-D4-IMPORT1              PIC $$$$,$$$,$$$,$$9.99-.      023800      
001446    02 FILLER                      PIC X(02) VALUE SPACES.        023900      
001447    02 WKS-D4-LEYEND2              PIC X(30)B(03).                024000      
001448    02 WKS-D4-NMOVS2               PIC Z(08)9B(02).               024100      
001449    02 WKS-D4-IMPORT2              PIC $$$$,$$$,$$$,$$9.99-.      024200      
001450                                                                  024300      
001451 01 WLI-ENCABEZADO-10.                                            024400      
001452    02 FILLER                      PIC X(110) VALUE               024500      
001453       "         PROCESO     CVE. TRANS.     ESQ. CON.     NUM. MO024600      
001454-      "V.       IMPORTE DEL MOV.                    LEYENDA".    024700      
001455                                                                  024800      
001456 01 WLI-DETALLE-5.                                                024900      
001457    02 FILLER                      PIC X(10) VALUE SPACES.        025000      
001458    02 WKS-D5-PROC                 PIC ZZZ9B(11).                 025100      
001459    02 WKS-D5-CVETRA               PIC ZZZ9B(11).                 025200      
001460    02 WKS-D5-ESQCON               PIC ZZZ9B(07).                 025300      
001461    02 WKS-D5-NUMMOV               PIC Z(08)B(04).                025400      
001462    02 WKS-D5-IMPMOV               PIC $$$$,$$$,$$$,$$9.99B(10).  025500      
001463    02 WKS-D5-LEYEND               PIC X(29).                     025600      
001464                                                                  025700      
001465 01 WLI-ENCABEZADO-11.                                            025800      
001466    02 FILLER                      PIC X(29) VALUE SPACES.        025900      
001467    02 FILLER                      PIC X(09) VALUE "S151  DIA".   026000      
001468    02 FILLER                      PIC X(56) VALUE SPACES.        026100      
001469    02 FILLER                      PIC X(11) VALUE "S151  CICLO". 026200      
001470                                                                  026300      
001471 01 WLI-ENCABEZADO-12.                                            026400      
001472    02 FILLER                     PIC X(128) VALUE                026500      
001473              "CVE.TRANS. ESQ.CONT. NUM.MOVS.   IMPORTE DEL MOV.  026600      
001474-             "PROC.  CVE.TRANS. ESQ.CONT. NUM.MOVS.   IMPORTE DEL026700      
001475-             " MOV.  PROC.    DIFERENCIA".                       026800      
001476                                                                  026900      
001477 01 WLI-DETALLE-6.                                                027000      
001478    02 FILLER                      PIC X(02) VALUE SPACES.        027100      
001479    02 WKS-D6-CVETRA1              PIC ZZZ9B(07).                 027200      
001480    02 WKS-D6-ESQCON1              PIC ZZZ9B(04).                 027300      
001481    02 WKS-D6-NUMMOV1              PIC Z(08)B(02).                027400      
001482    02 WKS-D6-IMPMOV1              PIC $$$$,$$$,$$$,$$9.99B(01).  027500      
001483    02 WKS-D6-PROC1                PIC ZZZ9B(05).                 027600      
001484    02 WKS-D6-CVETRA2              PIC ZZZ9B(07).                 027700      
001485    02 WKS-D6-ESQCON2              PIC ZZZ9B(04).                 027800      
001486    02 WKS-D6-NUMMOV2              PIC Z(08)B(02).                027900      
001487    02 WKS-D6-IMPMOV2              PIC $$$$,$$$,$$$,$$9.99B(01).  028000      
001488    02 WKS-D6-PROC2                PIC ZZZ9B(02).                 028100      
001489    02 WKS-D6-DIFEREN              PIC $$$,$$$,$$9.99CR.          028200      
001490 01  WLI-TOTAL-SDOS151.                                           028250      
001491     03 FILLER                     PIC X(10) VALUE SPACES.        028251      
001492     03 FILLER                     PIC X(40) VALUE                028252      
001493        "TOTAL DE CONTRATOS INEXISTENTES EN S151 ".               028253      
001494     03 FILLER                     PIC X(15) VALUE SPACES.        028254      
001495     03 WLI-NUMCTO-S151            PIC Z(05)9.                    028255      
001496     03 FILLER                     PIC X(09) VALUE                028256      
001497        " IMPORTE ".                                              028257      
001498     03 WLI-IMPCTO-S151            PIC ---,---,---,---,--9.99.    028258      
001499                                                                  028259      
001500 01  WLI-TOTAL-SDOSNNN.                                           028260      
001501     03 FILLER                     PIC X(10) VALUE SPACES.        028261      
001502     03 FILLER                     PIC X(36) VALUE                028262      
001503        "TOTAL DE CONTRATOS INEXISTENTES EN S".                   028263      
001504     03 WLI-SISCTO-SNNN            PIC 9(03).                     028264      
001505     03 FILLER                     PIC X(16) VALUE SPACES.        028265      
001506     03 WLI-NUMCTO-SNNN            PIC Z(05)9.                    028266      
001507     03 FILLER                     PIC X(09) VALUE                028267      
001508        " IMPORTE ".                                              028268      
001509     03 WLI-IMPCTO-SNNN            PIC ---,---,---,---,--9.99.    028269      
001510                                                                  028270      
001511 01  WLI-TOTAL-DIFSNNN.                                           028271      
001512     03 FILLER                     PIC X(10) VALUE SPACES.        028272      
001513     03 FILLER                     PIC X(49) VALUE                028273      
001514        "TOTAL DE CONTRATOS CON DIFERENCIAS ENTRE S151 Y S".      028274      
001515     03 WLI-SISDIF-SNNN            PIC 9(03).                     028275      
001516     03 FILLER                     PIC X(03) VALUE SPACES.        028276      
001517     03 WLI-NUMDIF-SNNN            PIC Z(05)9.                    028277      
001518     03 FILLER                     PIC X(09) VALUE                028278      
001519        " IMPORTE ".                                              028279      
001520     03 WLI-IMPDIF-SNNN            PIC ---,---,---,---,--9.99.    028280      
001521                                                                  028282      
001522 01  WKS-TOTALES-PUNTEO.                                          028284      
001523     03 WKS-NUMCTO-S151            PIC  9(06).                    028286      
001524     03 WKS-IMPCTO-S151            PIC S9(15)V9(02).              028288      
001525     03 WKS-NUMCTO-SNNN            PIC  9(06).                    028290      
001526     03 WKS-IMPCTO-SNNN            PIC S9(15)V9(02).              028292      
001527     03 WKS-NUMDIF-SNNN            PIC  9(06).                    028294      
001528     03 WKS-IMPDIF-SNNN            PIC S9(15)V9(02).              028296      
001529                                                                  028298      
001530                                                                  028300      
001531***************************************************************** 028400      
001532**           PARAMETROS PARA LIBRERIA CLTVERS                  ** 028500      
001533***************************************************************** 028600      
001534*                                                                 028700      
001535 01  WKS-CTLVER-NUMREG                 PIC 9(02).                 028800      
001536 01  WKS-CTLVER-LIBID                  PIC X(12).                 028900      
001537 01  WKS-CTLVER-NOMLIB                 PIC X(72).                 029000      
001538 77  W77-CTLVER-RSLT                   PIC S9(11) BINARY.         029100      
001539*                                                                 029200      
001540                                                                  029300      
001541***************************************************************** 029400      
001542*            PARAMETROS LIBRERIA DE ESTRUCTURA                  * 029500      
001543***************************************************************** 029600      
001544                                                                  029700      
001545 77  W77-L700-SISTEMA              PIC S9(11) BINARY.             029800      
001546 77  W77-L700-PROGRAMA             PIC S9(11) BINARY.             029900      
001547 01  WKS-L700-ENT.                                                030000      
001548     03 WKS-EL700-CAT              PIC 9(06) COMP.                030100      
001549     03 WKS-EL700-CLAVE            PIC 9(02) COMP.                030200      
001550     03 WKS-EL700-BUSQUEDA         PIC 9(02) COMP.                030300      
001551     03 WKS-EL700-REGISTROS        PIC 9(02) COMP.                030400      
001552     03 WKS-EL700-CVEREG           PIC 9(12).                     030500      
001553     03 WKS-EL700-REGASO           PIC 9(12).                     030600      
001554     03 WKS-EL700-NIVINI           PIC 9(02) COMP.                030700      
001555     03 WKS-EL700-FECINI           PIC 9(06) COMP.                030800      
001556     03 FILLER                     PIC X(14).                     030900      
001557                                                                  031000      
001558 01  WKS-L700-SAL.                                                031100      
001559     03 WKS-SL700-NUMREG           PIC 9(02) COMP.                031200      
001560     03 WKS-SL700-CAT              PIC 9(06) COMP.                031300      
001561     03 WKS-SL700-FECINI           PIC 9(06) COMP.                031400      
001562     03 WKS-SL700-NIVINI           PIC 9(02) COMP.                031500      
001563     03 WKS-SL700-SAL-REGISTROS.                                  031600      
001564        05 WKS-SL700-CVEREG        PIC 9(12).                     031700      
001565        05 WKS-SL700-REGASO        PIC 9(12).                     031800      
001566        05 WKS-SL700-TLARGO        PIC X(40).                     031900      
001567        05 WKS-SL700-TCORTO        PIC X(20).                     032000      
001568        05 WKS-SL700-TPANT         PIC X(12).                     032100      
001569        05 WKS-SL700-TABREV        PIC X(05).                     032200      
001570        05 WKS-SL700-FECALTA       PIC 9(06) COMP.                032300      
001571        05 WKS-SL700-FECBAJA       PIC 9(06) COMP.                032400      
001572        05 WKS-SL700-FECMOD        PIC 9(06) COMP.                032500      
001573        05 FILLER                  PIC X(10).                     032600      
001574 77  W77-L700-RESULT               PIC S9(11) BINARY.             032700      
001575                                                                  032800      
001576                                                                  032900      
001577*************************************************************     033000      
001578*  ARREGLO PARA CAT. DE DESCRIPCION DE SALDOS DEL SISTEMA   *     033100      
001579*************************************************************     033200      
001580                                                                  033300      
001581 01  WKS-SALDOS-SIS.                                              033400      
001582     03 WKS-TAB-SALDOS OCCURS 1000 TIMES.                         033500      
001583        05 WKS-SDOS-CVE            PIC 9(04) COMP.                033600      
001584        05 WKS-SDOS-LEY            PIC X(30).                     033700      
001585                                                                  033800      
001586*************************************************************     033900      
001587*                   C A T A L O G O S                       *     034000      
001588*************************************************************     034100      
001589*                                                                 034200      
001590                                                                  034300      
001591 77 W77-RESULTADO                       PIC S9(11) BINARY.        034400      
001592                                                                  034500      
001593***********************************************************       034600      
001594*      VARIABLES PARA OBTENER FECHA DE COMPILACION        *       034700      
001595***********************************************************       034800      
001596 01  COMPILA                         PIC 9(11)    BINARY.         034900      
001597                                                                  035000      
001598                                                                  035600      
001599 01  WKS-HORA-COMPILACION.                                        035700      
001600     02  WKS-HORA-COMP            PIC 9(13).                      035800      
001601     02  FILLER                   PIC X(187).                     035900      
001602                                                                  036100      
001603                                                                  036200      
001604****************************************************************  036300      
001605*             VARIABLES PARA EL MANEJO DE CORTES               *  036400      
001606****************************************************************  036500      
001607 77  W77-D                         PIC 9(4)   COMP VALUE ZEROS.   036600      
001608 77  W77-I                         PIC 9(4)   COMP.               036700      
001609 77  W77-J                         PIC 9(4)   COMP.               036800      
001610 77  W77-K                         PIC 9(4)   COMP.               036900      
001611 77  W77-P                         PIC 9(4)   COMP VALUE ZEROS.   037000      
001612 77  W77-Y                         PIC 9(4)   COMP VALUE ZEROS.   037100      
001613 77  WKS-IND                       PIC 9(4)   COMP VALUE ZEROS.   037200      
001614 77  W77-RESDIV                    PIC 9(04)  COMP.               037300      
001615 77  W77-RESDIV-ANT                PIC 9(04)  COMP.               037400      
001616 77  W77-REMANENTE                 PIC 9(04)  COMP.               037500      
001617 77  W77-ENCONTRE                  PIC 9(02)  COMP VALUE ZEROS.   037600      
001618 77  W77-CONT-MES                  PIC 9(02)  COMP.               037700      
001619 77  W77-CONT-MESOK                PIC 9(02)  COMP.               037800      
001620 77  W77-CONT-DIA                  PIC 9(02)  COMP.               037900      
001621 77  W77-CONT-DIAOK                PIC 9(02)  COMP.               038000      
001622 77  W77-EOF-MOVMES                PIC 9(02)  COMP.               038100      
001623 77  W77-EOF-MOVDIA                PIC 9(02)  COMP.               038200      
001624 77  W77-NUM-SUCPRO                PIC 9(04)  COMP.               038300      
001625 77  W77-EXI-SUCPRO                PIC 9(02)  COMP.               038400      
001626*77  W77-CON-ASORT                 PIC 9(08)  COMP VALUE ZEROS.   038500      
001627*77  W77-LEI-ASORT                 PIC 9(08)  COMP VALUE ZEROS.   038600      
001628 77  W77-CON-SORT3                 PIC 9(08)  COMP.               038700      
001629 77  W77-LEI-SORT3                 PIC 9(08)  COMP.               038800      
001630 77  W77-CON-SORT2                 PIC 9(08)  COMP.               038900      
001631 77  W77-LEI-SORT2                 PIC 9(08)  COMP.               039000      
001632 77  W77-NUM-PAG                   PIC 9(06)  COMP.               039100      
001633 77  W77-PRD1-ANT                  PIC 9(04)  COMP.               039200      
001634 77  W77-PRD2-ANT                  PIC 9(04)  COMP.               039300      
001635 77  W77-INS1-ANT                  PIC 9(04)  COMP.               039400      
001636 77  W77-INS2-ANT                  PIC 9(04)  COMP.               039500      
001637 77  W77-MON1-ANT                  PIC 9(04)  COMP.               039600      
001638 77  W77-MON2-ANT                  PIC 9(04)  COMP.               039700      
001639 77  W77-SDO-DIF                   PIC 9(01).                     039752      
001640 77  W77-ENCA-4                    PIC 9(01).                     039754      
001641*77  W77-PRIMERA-VEZ               PIC 9(02)  COMP VALUE ZEROS.   039800      
001642/                                                                 039900      
001643***************************************************************** 040000      
001644*       VARIABLES PARA ALMACENAR LAS FECHAS Y TIEMPOS           * 040100      
001645***************************************************************** 040200      
001646 01  FECHAS.                                                      040300      
001647*                                                                 040400      
001648     02  WKS-FECHA-ACTUAL-AMD.                                    040500      
001649*        03  WKS-AMO-ACTUAL-AMD        PIC 9(2).                  040600      
001650*INICIA CODIGO DE RENOVACION CRONOS 2000                          040601      
001651         03  WKS-AMO-ACTUAL-AMD        PIC 9(4).                  040602      
001652*TERMINA CODIGO DE RENOVACION CRONOS 2000                         040603      
001653         03  WKS-MES-ACTUAL-AMD        PIC 9(2).                  040700      
001654         03  WKS-DIA-ACTUAL-AMD        PIC 9(2).                  040800      
001655*                                                                 040900      
001656*    02  WKS-FECHA-PROCESO-DMA         PIC 9(06).                 041000      
001657*INICIA CODIGO DE RENOVACION CRONOS 2000                          041001      
001658     02 WKS-FECHA-PROCESO-DMA PIC 9(08).                          041002      
001659*TERMINA CODIGO DE RENOVACION CRONOS 2000                         041003      
001660                                                                  041100      
001661     02  WKS-FECHA-ACTUAL-DMA REDEFINES WKS-FECHA-PROCESO-DMA.    041200      
001662         03  WKS-DIA-ACTUAL-DMA        PIC 9(2).                  041300      
001663         03  WKS-MES-ACTUAL-DMA        PIC 9(2).                  041400      
001664*        03  WKS-AMO-ACTUAL-DMA        PIC 9(2).                  041500      
001665*INICIA CODIGO DE RENOVACION CRONOS 2000                          041501      
001666         03  WKS-AMO-ACTUAL-DMA        PIC 9(4).                  041502      
001667*TERMINA CODIGO DE RENOVACION CRONOS 2000                         041503      
001668*                                                                 041600      
001669     02  WKS-FECHA-TEMP.                                          041700      
001670         03  WKS-DIA-TEMP-DMA          PIC 9(2).                  041800      
001671         03  WKS-MES-TEMP-DMA          PIC 9(2).                  041900      
001672*        03  WKS-AMO-TEMP-DMA          PIC 9(2).                  042000      
001673*INICIA CODIGO DE RENOVACION CRONOS 2000                          042001      
001674         03  WKS-AMO-TEMP-DMA          PIC 9(4).                  042002      
001675*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042003      
001676     02  WKS-FECHA-ACTUAL-MDA.                                    042100      
001677         03  WKS-MES-ACTUAL-MDA        PIC 9(2).                  042200      
001678         03  WKS-DIA-ACTUAL-MDA        PIC 9(2).                  042300      
001679*        03  WKS-AMO-ACTUAL-MDA        PIC 9(2).                  042400      
001680*INICIA CODIGO DE RENOVACION CRONOS 2000                          042401      
001681         03  WKS-AMO-ACTUAL-MDA        PIC 9(4).                  042402      
001682*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042403      
001683                                                                  042500      
001684*    02  WKS-FECCONT                   PIC 9(06).                 042600      
001685*INICIA CODIGO DE RENOVACION CRONOS 2000                          042601      
001686     02 WKS-FECCONT PIC 9(08).                                    042602      
001687*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042603      
001688     02  WKS-FECCONT-R  REDEFINES   WKS-FECCONT.                  042700      
001689*        03  WKS-FC-AA                  PIC 9(02).                042800      
001690*INICIA CODIGO DE RENOVACION CRONOS 2000                          042801      
001691         03  WKS-FC-AA                  PIC 9(04).                042802      
001692*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042803      
001693         03  WKS-FC-MM                  PIC 9(02).                042900      
001694         03  WKS-FC-DD                  PIC 9(02).                043000      
001695                                                                  043100      
001696     02  WKS-FORMATO-FECHA.                                       043200      
001697         03  WKS-FORM-DD                PIC 9(02).                043300      
001698         03  FILLER                     PIC X(01) VALUE "/".      043400      
001699         03  WKS-FORM-MM                PIC X(03).                043500      
001700         03  FILLER                     PIC X(01) VALUE "/".      043600      
001701*        03  WKS-FORM-AA                PIC 9(02).                043700      
001702*INICIA CODIGO DE RENOVACION CRONOS 2000                          043701      
001703         03  WKS-FORM-AA                PIC 9(04).                043702      
001704*TERMINA CODIGO DE RENOVACION CRONOS 2000                         043703      
001705 01  WKS-FECHA-AAAAMMDD                   PIC 9(08).              043708      
001706 01  WKS-FECHA-AAAAMMDD-R REDEFINES WKS-FECHA-AAAAMMDD.           043713      
001707     03 WKS-AMO-AAAA                      PIC 9(04).              043718      
001708     03 WKS-MES-AAAA                      PIC 9(02).              043723      
001709     03 WKS-DIA-AAAA                      PIC 9(02).              043728      
001710                                                                  043730      
001711 01  WKS-FECHA-DDMMAAAA-R.                                        043738      
001712     03 WKS-DIA-DDMM                      PIC 9(02).              043743      
001713     03 WKS-MES-DDMM                      PIC 9(02).              043748      
001714     03 WKS-AMO-DDMM                      PIC 9(04).              043753      
001715                                                                  043773      
001716 01  WKS-FECHA-DDMMAAAA REDEFINES WKS-FECHA-DDMMAAAA-R PIC 9(08). 043793      
001717*                                                                 043800      
001718 01  WKS-HORA-OPERACION                 PIC 9(6) COMP.            043900      
001719                                                                  044000      
001720 01  WKS-HORA-OPERACION-R  REDEFINES WKS-HORA-OPERACION.          044100      
001721     02  WKS-HH-OP                      PIC 9(2) COMP.            044200      
001722     02  WKS-MM-OP                      PIC 9(2) COMP.            044300      
001723     02  WKS-SS-OP                      PIC 9(2) COMP.            044400      
001724*                                                                 044500      
001725 01  WKS-HORA-HS-R.                                               044600      
001726     02  WKS-HORA-HH                    PIC 9(2) COMP.            044700      
001727     02  WKS-HORA-MM                    PIC 9(2) COMP.            044800      
001728     02  FILLER                        PIC 9(4) COMP.             044900      
001729*                                                                 045000      
001730 01  WKS-HORA-HS-RR REDEFINES WKS-HORA-HS-R.                      045100      
001731     02  WKS-HR-HH                     PIC 9(2) COMP.             045200      
001732     02  WKS-HR-MM                     PIC 9(2) COMP.             045220      
001733     02  WKS-HR-SS                     PIC 9(2) COMP.             045240      
001734     02  FILLER                        PIC 9(2) COMP.             045300      
001735*                                                                 045400      
001736 01  WKS-HORA-HSS-R REDEFINES WKS-HORA-HS-R.                      045500      
001737     02  WKS-HORA-HSS-HH               PIC 9(2) COMP.             045600      
001738     02  WKS-HORA-HSS-MM               PIC 9(2) COMP.             045700      
001739     02  WKS-HORA-HSS-SS               PIC 9(2) COMP.             045800      
001740     02  FILLER                        PIC 9(2) COMP.             045900      
001741 01  WKS-HORA-HS    REDEFINES WKS-HORA-HS-R   PIC 9(8) COMP.      046000      
001742****************************************************************  046100      
001743*                 CONTADORES DE HOJAS                          *  046200      
001744****************************************************************  046300      
001745 01  CONTADORES.                                                  046400      
001746     02  WKS-NUM-HOJAS-SUC             PIC 9(3) COMP VALUE 0.     046500      
001747     02  WKS-TOTAL-HOJAS               PIC 9(4) COMP VALUE 0.     046600      
001748     02  WKS-NUM-LINEAS                PIC 9(2).                  046700      
001749     02  WKS-CONTADOR                  PIC 9(4) COMP VALUE 0.     046800      
001750/                                                                 046900      
001751****************************************************************  047000      
001752*             VARIABLES PARA LA LOCAL SUPPORT                  *  047100      
001753****************************************************************  047200      
001754 01  WKS-CODIGO-ESTRUCT                PIC 9(6).                  047300      
001755 01  WKS-CODIGO-ESTRUCT-R  REDEFINES WKS-CODIGO-ESTRUCT.          047400      
001756     03  WKS-LLAVE-ESTRUCT             PIC 9(4).                  047500      
001757     03  WKS-CLAVE-ESTRUCT             PIC 9(2).                  047600      
001758                                                                  047700      
001759 01  WKS-RESPUESTA-ESTRUCT.                                       047800      
001760     03  WKS-RESULTADO-ESTRUCT         PIC 9(1).                  047900      
001761     03  WKS-NOMBRE-SUC-ESTRUCT        PIC X(40).                 048000      
001762     03  FILLER                        PIC X(40).                 048100      
001763                                                                  048200      
001764 01  WKS-CSI-RESP-ESTRUCT.                                        048300      
001765     03  WKS-RESULT-CSI-ESTRUCT        PIC 9(1).                  048400      
001766     03  WKS-CSI-ESTRUCT               PIC 9(2).                  048500      
001767     03  FILLER                        PIC X(78).                 048600      
001768                                                                  048700      
001769 77  W77-IND                           PIC 9(03).                 048800      
001770 77  W77-IND3                          PIC 9(03).                 048900      
001771 77  W77-SISTEMA                       PIC 9(03).                 049000      
001772 77  W77-FUNCION                       PIC S9(11) BINARY.         049100      
001773 77  W77-FORMATO                       PIC S9(11) BINARY.         049200      
001774 77  W77-SUC-PRO                       PIC 9(04) COMP VALUE ZEROS.049300      
001775 77  W77-SUC-PRD                       PIC 9(04) COMP VALUE ZEROS.049400      
001776 77  W77-SUC-INS                       PIC 9(04) COMP VALUE ZEROS.049500      
001777 77  W77-SUC-MONEDA                    PIC 9(04) COMP VALUE ZEROS.049600      
001778 77  W77-TOT-CVECON                    PIC 9(03).                 049700      
001779 77  W77-LIB-TOTXCVETRA                PIC 9(02).                 049800      
001780 77  WKS-DIFERENCIA                    PIC 9(16)V9(02) VA ZEROS.  049900      
001781**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                049905      
001782 77  W77-ERROR                         PIC 9(02) VALUE 0.         049910      
001783**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                049915      
001784                                                                  050000      
001785*01  WKS-FECHA1                        PIC X(06).                 050100      
001786*INICIA CODIGO DE RENOVACION CRONOS 2000                          050101      
001787 01 WKS-FECHA1 PIC X(08).                                         050102      
001788*TERMINA CODIGO DE RENOVACION CRONOS 2000                         050103      
001789 01  WKS-FECHA1-RED   REDEFINES WKS-FECHA1.                       050200      
001790*    05  WKS-AMO1-RED                  PIC 9(02).                 050300      
001791*INICIA CODIGO DE RENOVACION CRONOS 2000                          050301      
001792     05  WKS-AMO1-RED                  PIC 9(04).                 050302      
001793*TERMINA CODIGO DE RENOVACION CRONOS 2000                         050303      
001794     05  WKS-MES1-RED                  PIC 9(02).                 050400      
001795     05  WKS-DIA1-RED                  PIC 9(02).                 050500      
001796*                                                                 050600      
001797*01  WKS-FECHA2                        PIC X(06).                 050700      
001798*INICIA CODIGO DE RENOVACION CRONOS 2000                          050701      
001799 01 WKS-FECHA2 PIC X(08).                                         050702      
001800*TERMINA CODIGO DE RENOVACION CRONOS 2000                         050703      
001801*                                                                 050800      
001802 01  WKS-FECHA2-RED   REDEFINES WKS-FECHA2.                       050900      
001803*    05  WKS-AMO2-RED                  PIC 9(02).                 051000      
001804*INICIA CODIGO DE RENOVACION CRONOS 2000                          051001      
001805     05  WKS-AMO2-RED                  PIC 9(04).                 051002      
001806*TERMINA CODIGO DE RENOVACION CRONOS 2000                         051003      
001807     05  WKS-MES2-RED                  PIC 9(02).                 051100      
001808     05  WKS-DIA2-RED                  PIC 9(02).                 051200      
001809*                                                                 051300      
001810 01  WKS-DATOS-HOST.                                              051400      
001811     03  WKS-NUMCSI                    PIC 9(02).                 051500      
001812     03  WKS-NOMEQUIPO                 PIC X(10).                 051600      
001813     03  WKS-NOMCSI                    PIC X(26).                 051700      
001814     03  WKS-LINEABATCH                PIC X(05).                 051800      
001815*                                                                 051900      
001816*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001817*  COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                  052000      
001818*================================================================ 000100      
001819*         ENTRY-POINT CONSISDIA :                               = 000200      
001820*                                                                 000300      
001821* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001822* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001823* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001824* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001825* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001826* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001827* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001828* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001829* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001830* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001831*                                                               = 001400      
001832*================================================================ 001500      
001833                                                                  001600      
001834                                                                  001700      
001835*================================================================ 001800      
001836* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001837*                                                               = 002000      
001838* ENTRADA REQUERIDA :                                           = 002100      
001839*                                                               = 002200      
001840*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001841*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001842*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001843*================================================================ 002600      
001844 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001845    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001846    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001847    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001848    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001849    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001850    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001851    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001852    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001853    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001854    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001855    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001856    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001857    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001858    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001859    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001860    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001861    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001862    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001863    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001864    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001865       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001866       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001867       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001868       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001869*==============================================================   005200      
001870*                                                             =   005300      
001871* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001872*                                                             =   005500      
001873* CAMPOS REQUERIDOS :                                         =   005600      
001874*                                                             =   005700      
001875* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001876* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001877* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001878* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001879*==============================================================   006200      
001880 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001881    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001882    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001883    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001884    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001885                                                                  006800      
001886*==============================================================   006900      
001887*                                                             =   007000      
001888* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001889*                                                             =   007200      
001890* CAMPOS REQUERIDOS :                                         =   007300      
001891*                                                             =   007400      
001892* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001893* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001894* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001895* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001896*==============================================================   007900      
001897 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001898    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001899    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001900    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001901    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001902                                                                  008500      
001903*==============================================================   008600      
001904*                                                             =   008700      
001905* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001906*                                                             =   008900      
001907* CAMPOS REQUERIDOS :                                         =   009000      
001908*                                                             =   009100      
001909* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001910* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001911* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001912* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001913*==============================================================   009600      
001914 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001915    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001916    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001917    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001918    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001919                                                                  010200      
001920*============================================================     010300      
001921* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001922*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001923*                                                           =     010600      
001924*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001925*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001926*                                                           =     010900      
001927*  ENTRADA REQUERIDA.                                       =     011000      
001928*                                                           =     011100      
001929*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001930*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001931*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001932*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001933*============================================================     011600      
001934                                                                  011700      
001935 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001936     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001937     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001938     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001939     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001940                                                                  012300      
001941*=============================================================    012400      
001942*                                                            =    012500      
001943* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001944*             B01-SIS-FECARMOV.                              =    012700      
001945*                                                            =    012800      
001946* ENTRADA REQUERIDAD :                                       =    012900      
001947*                                                            =    013000      
001948*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001949*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001950*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001951*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001952*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001953*=============================================================    013600      
001954                                                                  013700      
001955 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001956     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001957     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001958     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001959     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001960     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001961*================================================================ 014400      
001962*                                                               = 014500      
001963* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001964*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001965*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001966*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001967*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001968*                                                               = 015100      
001969* ENTRADA REQUERIDA :                                           = 015200      
001970*                                                               = 015300      
001971* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001972* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001973* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001974* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001975* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001976*================================================================ 015900      
001977 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001978    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001979    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001980    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001981    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001982    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001983                                                                  016600      
001984*============================================================     016700      
001985*                                                           =     016800      
001986* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001987*                                                           =     017000      
001988* DATOS REQUERIDOS :                                        =     017100      
001989*                                                           =     017200      
001990* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001991* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001992* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001993* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001994* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001995*============================================================     017800      
001996                                                                  017900      
001997 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001998     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001999     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
002000     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
002001     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
002002     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
002003                                                                  018600      
002004*============================================================     018700      
002005*                                                           =     018800      
002006* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
002007*                                                           =     019000      
002008* DATOS REQUERIDOS :                                        =     019100      
002009*                                                           =     019200      
002010* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
002011* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
002012* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
002013* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
002014* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
002015*============================================================     019800      
002016                                                                  019900      
002017 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
002018     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
002019     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
002020     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
002021     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
002022     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
002023                                                                  020600      
002024*===============================================================  020700      
002025*                                                              =  020800      
002026* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
002027*              MOVIMIENTOS.                                    =  021000      
002028* DATOS REQUERIDOS :                                           =  021100      
002029*                                                              =  021200      
002030* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
002031* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
002032* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
002033* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
002034* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
002035* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
002036*==============================================================   021900      
002037                                                                  022000      
002038 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
002039     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
002040     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
002041     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
002042     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
002043     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
002044     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
002045*==============================================================   022800      
002046*                                                             =   022900      
002047* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
002048*                                                             =   023100      
002049* CAMPOS REQUERIDOS :                                         =   023200      
002050*                                                             =   023300      
002051* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
002052* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
002053* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
002054* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
002055*==============================================================   023800      
002056 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
002057    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
002058    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
002059    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
002060    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
002061                                                                  024304      
002062*=================================================================024306      
002063*                ENTRY POINT CONSISB01                           =024308      
002064*                                                                =024310      
002065*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
002066*                                                                =024314      
002067*  FUNCIONES DISPONIBLES :                                       =024316      
002068*                                                                =024318      
002069*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
002070*                                                                =024322      
002071*  PARAMETROS REQUERIDOS                                         =024324      
002072*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
002073*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
002074*=================================================================024330      
002075                                                                  024332      
002076 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
002077     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
002078     03 WKS-CON-CSI                PIC 9(02).                     024336      
002079     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
002080     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
002081        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
002082        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
002083        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
002084        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
002085        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
002086                                                                  024400      
002087*=================================================================024500      
002088*                ENTRY POINT B02ARCINTER                         =024600      
002089*                                                                =024700      
002090*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
002091*                                                                =024900      
002092*  FUNCIONES DISPONIBLES :                                       =025000      
002093*                                                                =025100      
002094*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
002095* 19.- ALTAS DE ARCHIVOS.                                        =025300      
002096* 22.- BAJAS DE ARCHIVOS.                                        =025400      
002097* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
002098*                                                                =025600      
002099*  PARAMETROS REQUERIDOS                                         =025700      
002100*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
002101*                                                                =025900      
002102*=================================================================026000      
002103 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
002104     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
002105     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
002106     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
002107     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
002108     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
002109     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
002110     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
002111     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
002112     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
002113     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
002114     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
002115     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
002116     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
002117     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
002118     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
002119     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
002120     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
002121     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
002122     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
002123     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
002124     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
002125     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
002126     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
002127     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
002128     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
002129     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
002130     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
002131     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
002132                                                                  029000      
002133*=================================================================029100      
002134*                ENTRY POINT B04SISTEMA                          =029200      
002135*                                                                =029300      
002136*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
002137*                                                                =029500      
002138*  FUNCIONES DISPONIBLES :                                       =029600      
002139*                                                                =029700      
002140*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
002141*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
002142*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
002143*                                                                =030100      
002144*  PARAMETROS REQUERIDOS                                         =030200      
002145*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
002146*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
002147*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
002148*                                                                =030600      
002149*=================================================================030700      
002150 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
002151     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
002152     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
002153     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
002154     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
002155     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
002156     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
002157     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
002158                                                                  031600      
002159*================================================================ 031700      
002160*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
002161*                                                               = 031900      
002162*  FUNCION                                                      = 032000      
002163*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
002164*   19       ALTAS.                                             = 032200      
002165*   22       BAJAS                                              = 032300      
002166*   37       CAMBIOS.                                           = 032400      
002167*                                                               = 032500      
002168*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
002169*                      FECHA DE PROCESO                         = 032700      
002170*                      NUMERO DE PROCESO                        = 032800      
002171*                      FECHA INICIO                             = 032900      
002172*                      REGISTRO INICIAL                         = 033000      
002173*================================================================ 033100      
002174                                                                  033200      
002175 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
002176     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
002177     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
002178     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
002179     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
002180     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
002181     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
002182     03 WKS-B05-MIX                PIC 9(08).                     034000      
002183     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
002184     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
002185     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
002186     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
002187     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
002188     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
002189                                                                  034700      
002190                                                                  034800      
002191*================================================================ 034900      
002192*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
002193*                                                               = 035100      
002194*  FUNCION                                                      = 035200      
002195*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
002196*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
002197*                                                               = 035500      
002198*================================================================ 035600      
002199                                                                  035700      
002200 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
002201     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
002202     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
002203     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
002204     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
002205     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
002206     03 WKS-B09-NOMREN             PIC X(15).                     036400      
002207                                                                  036500      
002208*===============================================================  036600      
002209*                                                              =  036700      
002210*         ENTRY-POINT CONSISMEN                                =  036800      
002211*                                                              =  036900      
002212*   DATOS REQUERIDOS : FUNCION                                 =  037000      
002213*                      SISTEMA                                 =  037100      
002214*                                                              =  037200      
002215*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
002216*                                                              =  037400      
002217*===============================================================  037500      
002218 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
002219     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
002220     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
002221     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
002222     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
002223     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
002224     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
002225     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
002226     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
002227     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
002228     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
002229     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
002230     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
002231     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
002232     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
002233     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
002234        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
002235        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
002236        05 WKS-B03-AAMM            PIC 9(06).                     039402      
002237        05 WKS-B03-SECOK           PIC 9(10).                     039500      
002238        05 WKS-B03-SECINF          PIC 9(10).                     039600      
002239        05 WKS-B03-SECERR          PIC 9(10).                     039700      
002240        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
002241                                                                  039900      
002242*=====================================================            040000      
002243*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
002244*=====================================================            040200      
002245 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
002246     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
002247     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
002248     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002249                                                                  040700      
002250*=====================================================            040800      
002251*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002252*=====================================================            041000      
002253 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002254     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002255     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002256     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002257                                                                  041500      
002258*=====================================================            041600      
002259*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002260*=====================================================            041800      
002261 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002262     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002263     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002264     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002265*=====================================================            042300      
002266*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002267*=====================================================            042500      
002268 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002269     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002270     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002271     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002272                                                                  043000      
002273*=====================================================            043100      
002274*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002275*=====================================================            043300      
002276 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002277     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002278     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002279     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002280                                                                  043800      
002281*=====================================================            043900      
002282*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002283*=====================================================            044100      
002284 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002285     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002286     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002287     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002288                                                                  044600      
002289*=====================================================            044700      
002290*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002291*=====================================================            044900      
002292 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002293     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002294     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002295     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002296                                                                  045400      
002297*=====================================================            045500      
002298*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
002299*=====================================================            045700      
002300 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
002301     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
002302     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
002303     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
002304                                                                  046200      
002305*=====================================================            046300      
002306*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
002307*=====================================================            046500      
002308 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
002309     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
002310     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
002311     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
002312                                                                  047000      
002313*=====================================================            047100      
002314*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
002315*=====================================================            047300      
002316 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
002317     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
002318     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
002319     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
002320                                                                  047800      
002321*=====================================================            047900      
002322*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
002323*=====================================================            048100      
002324 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
002325     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
002326     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
002327     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
002328                                                                  048600      
002329*=====================================================            048700      
002330*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
002331*=====================================================            048900      
002332 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
002333     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
002334     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
002335     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
002336                                                                  049400      
002337*=====================================================            049500      
002338*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
002339*=====================================================            049700      
002340 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
002341     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
002342     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
002343     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
002344     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
002345     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
002346     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
002347     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
002348     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
002349     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
002350     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
002351                                                                  050900      
002352*=====================================================            051000      
002353*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
002354*=====================================================            051200      
002355 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
002356     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
002357     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
002358     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
002359     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
002360                                                                  051800      
002361*=====================================================            051900      
002362*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
002363*=====================================================            052100      
002364 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
002365     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
002366     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
002367     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
002368     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
002369                                                                  052700      
002370*=====================================================            052800      
002371*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
002372*=====================================================            053000      
002373 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
002374     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
002375     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
002376     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
002377     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
002378                                                                  053600      
002379*=====================================================            053700      
002380*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
002381*=====================================================            053900      
002382 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
002383     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
002384     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
002385     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
002386     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
002387                                                                  054500      
002388*=====================================================            054600      
002389*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
002390*=====================================================            054800      
002391 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
002392     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
002393     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
002394     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
002395     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
002396                                                                  055400      
002397*=====================================================            055500      
002398*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
002399*=====================================================            055700      
002400 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
002401     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
002402     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
002403     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
002404     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
002405                                                                  056300      
002406*=====================================================            056400      
002407*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
002408*=====================================================            056600      
002409 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
002410     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
002411     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
002412     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
002413     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
002414                                                                  057200      
002415 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
002416*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002417                                                                  052100      
002418*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002419* COPY "(S151)S151/FORMATO/LLAMADO/CVETRA." FROM 14000            052200      
002420*                                               TO   32000.       052300      
002421 01 WKS-L40-CVES.                                                 014000      
002422    03 WKS-L40-FUN-L040            PIC  9(02)       COMP.         015000      
002423    03 WKS-L40-FECHA               PIC  9(08)       COMP.         016000      
002424    03 WKS-L40-SISTEMA             PIC  9(04)       COMP.         017000      
002425    03 WKS-L40-PRODUCTO            PIC  9(04)       COMP.         018000      
002426    03 WKS-L40-INSTRUMENTO         PIC  9(04)       COMP.         019000      
002427    03 WKS-L40-PROCCON             PIC  9(04)       COMP.         020000      
002428    03 WKS-L40-BCOSCON             PIC  9(06)       COMP.         020050      
002429    03 WKS-L40-BCOSCON-R   REDEFINES WKS-L40-BCOSCON.             020070      
002430       05 WKS-L40-BORICON          PIC  9(03)       COMP.         020100      
002431       05 WKS-L40-BDESCON          PIC  9(03)       COMP.         020200      
002432    03 WKS-L40-MONCON              PIC  9(04)       COMP.         021000      
002433    03 WKS-L40-CVETRACON           PIC  9(04)       COMP.         022000      
002434    03 WKS-L40-ESQCONCON           PIC  9(04)       COMP.         023000      
002435    03 WKS-L40-IMPORTES            OCCURS 100 TIMES.              024000      
002436       04 WKS-L40-PROCESO          PIC  9(04)       COMP.         025000      
002437       04 WKS-L40-MONEDA           PIC  9(04)       COMP.         026000      
002438       04 WKS-L40-CVETRA           PIC  9(04)       COMP.         027000      
002439       04 WKS-L40-ESQCON           PIC  9(04)       COMP.         028000      
002440       04 WKS-L40-NUMMOV           PIC  9(08)       COMP.         029000      
002441       04 WKS-L40-IMPMOV           PIC S9(13)V99    COMP.         030000      
002442       04 WKS-L40-BCOSDET          PIC  9(06)       COMP.         030020      
002443       04 WKS-L40-BCOSDET-R   REDEFINES  WKS-L40-BCOSDET.         030040      
002444          05 WKS-L40-BCOORI        PIC  9(03)       COMP.         030100      
002445          05 WKS-L40-BCODES        PIC  9(03)       COMP.         030200      
002446                                                                  031000      
002447 77  W77-RESULT-S151               PIC S9(11) BINARY.             032000      
002448*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002449                                                                  052400      
002450*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002451* COPY "(S151)S151/FORMATO/ERROR/DMSII." FROM 1000 TO 59000.      052500      
002452                                                                  001000      
002453                                                                  002000      
002454                                                                  003000      
002455*=================================================================004000      
002456*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
002457*=================================================================006000      
002458                                                                  007000      
002459                                                                  008000      
002460                                                                  009000      
002461 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
002462 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
002463 01 WKS-TAB-ERRDMSII.                                             012000      
002464    02 FILLER                      PIC X(20)     VALUE            013000      
002465    "NOTFOUND          01".                                       014000      
002466    02 FILLER                      PIC X(20)     VALUE            015000      
002467    "DUPLICATES        02".                                       016000      
002468    02 FILLER                      PIC X(20)     VALUE            017000      
002469    "DEADLOCK          03".                                       018000      
002470    02 FILLER                      PIC X(20)     VALUE            019000      
002471    "DATAERROR         04".                                       020000      
002472    02 FILLER                      PIC X(20)     VALUE            021000      
002473    "NOTLOCKED         05".                                       022000      
002474    02 FILLER                      PIC X(20)     VALUE            023000      
002475    "KEYCHANGE         06".                                       024000      
002476    02 FILLER                      PIC X(20)     VALUE            025000      
002477    "SYSTEMERROR       07".                                       026000      
002478    02 FILLER                      PIC X(20)     VALUE            027000      
002479    "READONLY          08".                                       028000      
002480    02 FILLER                      PIC X(20)     VALUE            029000      
002481    "IOERROR           09".                                       030000      
002482    02 FILLER                      PIC X(20)     VALUE            031000      
002483    "LIMITERROR        10".                                       032000      
002484    02 FILLER                      PIC X(20)     VALUE            033000      
002485    "OPENERROR         11".                                       034000      
002486    02 FILLER                      PIC X(20)     VALUE            035000      
002487    "CLOSEERROR        12".                                       036000      
002488    02 FILLER                      PIC X(20)     VALUE            037000      
002489    "NORECORD          13".                                       038000      
002490    02 FILLER                      PIC X(20)     VALUE            039000      
002491    "INUSE             14".                                       040000      
002492    02 FILLER                      PIC X(20)     VALUE            041000      
002493    "AUDITERROR        15".                                       042000      
002494    02 FILLER                      PIC X(20)     VALUE            043000      
002495    "ABORT             16".                                       044000      
002496    02 FILLER                      PIC X(20)     VALUE            045000      
002497    "SECURITYERROR     17".                                       046000      
002498    02 FILLER                      PIC X(20)     VALUE            047000      
002499    "VERSIONERROR      18".                                       048000      
002500    02 FILLER                      PIC X(20)     VALUE            049000      
002501    "FATALERROR        19".                                       050000      
002502    02 FILLER                      PIC X(20)     VALUE            051000      
002503    "INTEGRITY ERROR   20".                                       052000      
002504    02 FILLER                      PIC X(20)     VALUE            053000      
002505    "INTLIBERROR       21".                                       054000      
002506 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
002507    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
002508       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
002509       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
002510                                                                  059000      
002511*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002512                                                                  052600      
002513 01  CSI.                                                         052700      
002514     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  1   ".   052800      
002515     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  2   ".   052900      
002516     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  3   ".   053000      
002517     02  FILLER       PIC X(25) VA "MONM O N T E R R E Y     ".   053100      
002518     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  5   ".   053200      
002519     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  6   ".   053300      
002520     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  7   ".   053400      
002521     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  8   ".   053500      
002522     02  FILLER       PIC X(25) VA "XXXN O  E X I S T E  9   ".   053600      
002523     02  FILLER       PIC X(25) VA "VDMV A L L E  DE  M E X .".   053700      
002524 01  TABLA-CSI REDEFINES CSI.                                     053800      
002525     02  TAB-CSI OCCURS 10 TIMES.                                 053900      
002526         03  WKS-NOMB-CSI              PIC X(03).                 054000      
002527 77 W77-PARAM-SISTEMA                  PIC 9(03).                 054100      
002528*01 W77-FECHA-PROC                     PIC 9(06).                 054200      
002529*INICIA CODIGO DE RENOVACION CRONOS 2000                          054201      
002530 01 W77-FECHA-PROC PIC 9(08).                                     054202      
002531*TERMINA CODIGO DE RENOVACION CRONOS 2000                         054203      
002532 01 W77-FECHA-PROC-R                   REDEFINES W77-FECHA-PROC.  054300      
002533*   02 W77-FECPRO-AA                   PIC 9(02).                 054400      
002534*INICIA CODIGO DE RENOVACION CRONOS 2000                          054401      
002535    02 W77-FECPRO-AA                   PIC 9(04).                 054402      
002536*TERMINA CODIGO DE RENOVACION CRONOS 2000                         054403      
002537    02 W77-FECPRO-MM                   PIC 9(02).                 054500      
002538    02 W77-FECPRO-DD                   PIC 9(02).                 054600      
002539 01 W77-FECHA-PROC-R1                  REDEFINES W77-FECHA-PROC.  054700      
002540*   02 W77-FECPRO-AAMM                 PIC 9(04).                 054800      
002541*INICIA CODIGO DE RENOVACION CRONOS 2000                          054801      
002542    02 W77-FECPRO-AAMM                 PIC 9(06).                 054802      
002543*TERMINA CODIGO DE RENOVACION CRONOS 2000                         054803      
002544    02 W77-FECPRO-DIA                  PIC 9(02).                 054900      
002545 77 W77-EOF-MOVCNTDIA                  PIC 9(02).                 055000      
002546 77 W77-EOF-MOVCNTMES                  PIC 9(02).                 055100      
002547 77 W77-EOF-MOVTODIA                   PIC 9(02).                 055200      
002548 77 W77-EOF-MOVTOSEM                   PIC 9(02).                 055300      
002549*77 W77-VALUE                          PIC 9(06) VALUE 0.         055400      
002550*INICIA CODIGO DE RENOVACION CRONOS 2000                          055401      
002551 77 W77-VALUE                          PIC 9(08) VALUE 0.         055402      
002552*TERMINA CODIGO DE RENOVACION CRONOS 2000                         055403      
002553 77 W77-STATUS                         PIC 9(04).                 055500      
002554 77 W77-NUMREG-001                     PIC 9(08) COMP.            055600      
002555 77 W77-NUMREG-066                     PIC 9(08) COMP.            055700      
002556 77 W77-SDOACT-001                     PIC S9(15)V99 COMP.        055800      
002557 77 W77-SDOACT-066                     PIC S9(15)V99 COMP.        055900      
002558 77 W77-NUMCTO-001                     PIC 9(08) COMP.            056000      
002559 77 W77-NUMCTO-066                     PIC 9(08) COMP.            056100      
002560 77 W77-FINLOG                         PIC 9(02).                 056200      
002561    88 W88-FINLOG                      VALUE 1.                   056300      
002562 77 W77-FILEOK                         PIC 9(02).                 056400      
002563    88 W88-FILEOK                      VALUE 1.                   056500      
002564 77 W77-EOF                            PIC 9(02) COMP VALUE ZEROS.056600      
002565 77 W77-CON-REG                        PIC 9(06) COMP.            056700      
002566 77 WS-EOF-ARCH1                       PIC 9(02) COMP VALUE ZEROS.056800      
002567 77 WS-EOF-ARCH2                       PIC 9(02) COMP VALUE ZEROS.056900      
002568 77 W77-IND-CON                        PIC 9(02).                 057000      
002569 77 W77-IND-B20                        PIC 9(04).                 057100      
002570 77 W77-CON-S084-INS15                 PIC 9(04).                 057200      
002571 88 W88-CON-S084-INS15                 VALUE 2, 313.              057300      
002572                                                                  057350      
002573 77 W77-CON-S408                       PIC 9(04).                 057355      
002574 88 W88-CON-S408                       VALUE 2,320, 321, 323, 324 057360      
002575                                               325, 326.          057365      
002576                                                                  057400      
002577 77 W77-S084-INS15-MEN                 PIC 9(04).                 057500      
002578 88 W88-S084-INS15-MEN                 VALUE 301, 302, 303, 306.  057600      
002579                                                                  057700      
002580 77 W77-CON-SISTEMA                    PIC 9(04).                 057800      
002581 88 W88-CON-SISTEMA                    VALUE 2.                   057900      
002582                                                                  058000      
002583 77 W77-CONCEPTO-VALIDO                PIC 9(02).                 058100      
002584 88 W88-CONCEPTO-VALIDO                VALUE 1.                   058200      
002585                                                                  058300      
002586 77 W77-GRABA-SDO                      PIC 9(02).                 058320      
002587 88 W88-GRABA-SDO                      VALUE 1.                   058340      
002588 77 W77-GRABA-500                      PIC 9(03).                 058360      
002589 88 W88-GRABA-500                      VALUE 500, 555.            058380      
002590                                                                  058390      
002591 77 WKS-TIPOERR-DMSII                  PIC 9(06) VALUE ZEROS.     058400      
002592 77 WKS-STRUCTU-DMSII                  PIC 9(06) VALUE ZEROS.     058500      
002593 77 W77-SDO-KEYCON                     PIC 9(16) COMP VALUE 0.    058600      
002594 77 W77-SDO-KEYPRD                     PIC 9(04) COMP VALUE 0.    058700      
002595 77 W77-SDO-KEYINS                     PIC 9(04) COMP VALUE 0.    058800      
002596 77 W77-IMP-MOV                        PIC 9(02) COMP VALUE 0.    058900      
002597                                                                  059000      
002598 01  WKS-COMPILA                       PIC 9(11) BINARY.          059100      
002599                                                                  059200      
002600*01  WKS-FECAPLI                       PIC 9(06).                 059300      
002601*INICIA CODIGO DE RENOVACION CRONOS 2000                          059301      
002602 01 WKS-FECAPLI PIC 9(08).                                        059302      
002603*TERMINA CODIGO DE RENOVACION CRONOS 2000                         059303      
002604 01  WKS-FECAPLI-R REDEFINES WKS-FECAPLI.                         059400      
002605*    03  WKS-AA-FECAPLI                PIC 9(02).                 059500      
002606*INICIA CODIGO DE RENOVACION CRONOS 2000                          059501      
002607     03  WKS-AA-FECAPLI                PIC 9(04).                 059502      
002608*TERMINA CODIGO DE RENOVACION CRONOS 2000                         059503      
002609     03  WKS-MM-FECAPLI                PIC 9(02).                 059600      
002610     03  WKS-DD-FECAPLI                PIC 9(02).                 059700      
002611                                                                  059800      
002612******************************************************************059900      
002613                                                                  060000      
002614*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002615*    COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".        060100      
002616**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
002617  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
002618  01 MENSAJE-LJ.                                                  100300      
002619     02 SISTEMA-LJ     PIC X(04).                                 100400      
002620     02 FILLER         PIC X VALUE "/".                           100500      
002621     02 PASO-LJ        PIC X(04).                                 100600      
002622     02 FILLER         PIC X VALUE "/".                           100700      
002623     02 MTP-LJ         PIC 9(03).                                 100800      
002624     02 FILLER         PIC X VALUE ":".                           100900      
002625     02 TIPO-LJ        PIC X.                                     101000      
002626     02 FILLER         PIC X VALUE ">".                           101100      
002627     02 CODIGO-LJ      PIC 9(06).                                 101200      
002628     02 FILLER         PIC X VALUE "<".                           101300      
002629     02 TEXTO-LJ       PIC X(250).                                101400      
002630*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002631                                                                  060200      
002632******************************************************************060300      
002633                                                                  060400      
002634 01  WKS-TEXTO.                                                   060500      
002635     02  FILLER    PIC X(20) VALUE "INICIO DE PROCESO : ".        060600      
002636*    02  FEC-TEX   PIC X(06).                                     060700      
002637*INICIA CODIGO DE RENOVACION CRONOS 2000                          060701      
002638     02 FEC-TEX PIC X(08).                                        060702      
002639*TERMINA CODIGO DE RENOVACION CRONOS 2000                         060703      
002640                                                                  060800      
002641 01 WKS-TAB-CON-SDOS.                                             060900      
002642    02 WKS-REL-SDOS OCCURS 5000 TIMES.                            061000      
002643       03 WKS-SDO-INDICE           PIC 9(02) COMP.                061100      
002644                                                                  061200      
002645 01 WKS-TAB-RELPROD.                                              061205      
002646    05 WKS-POS-PROD OCCURS 9999 TIMES PIC 9(04) COMP.             061208      
002647 01 WKS-TAB-RELINS.                                               061210      
002648    05 WKS-POS-INST OCCURS 9999 TIMES PIC 9(04) COMP.             061211      
002649 01 WKS-TAB-RELMON.                                               061213      
002650    05 WKS-POS-MON  OCCURS 9999 TIMES PIC 9(04) COMP.             061214      
002651                                                                  061217      
002652 01  WKS-TABLA-POSICION.                                          061220      
002653     03 WKS-TABPOS-PROD       OCCURS 25  TIMES.                   061223      
002654        05 WKS-TABPOS-INST    OCCURS 15  TIMES.                   061226      
002655           07 WKS-TABPOS-MON  OCCURS 19  TIMES.                   061229      
002656              09 WKS-TAB-IMP  PIC S9(15)V9(02) COMP.              061232      
002657                                                                  061235      
002658 77  W77-MONEDA                    PIC 9(04) COMP.                061238      
002659 77  W77-TOT-PROD                  PIC 9(04) COMP VALUE ZERO.     061241      
002660 77  W77-TOT-INST                  PIC 9(04) COMP VALUE ZERO.     061244      
002661 77  W77-TOT-MON                   PIC 9(04) COMP VALUE ZERO.     061247      
002662 77  W77-IND-PROD                  PIC 9(04) COMP VALUE ZERO.     061250      
002663 77  W77-IND-INST                  PIC 9(04) COMP VALUE ZERO.     061253      
002664 77  W77-IND-MON                   PIC 9(04) COMP VALUE ZERO.     061256      
002665 77  W77-DIFERENCIAS               PIC 9(01).                     061259      
002666 77  W77-SALIDA                    PIC 9(01).                     061279      
002667 77  W77-IND-IMP                   PIC 9(02).                     061284      
002668                                                                  061289      
002669                                                                  061294      
002670*01 WKS-EDOCTA                     PIC X(38).                     061300      
002671 01 WKS-EDOCTA                     PIC X(146).                    061350      
002672*01 WKS-EDOCTA-R                   REDEFINES WKS-EDOCTA.          061400      
002673*   02 WKS-DIASCICLO               PIC  9(03).                    061500      
002674*   02 WKS-DIASANO                 PIC  9(03).                    061600      
002675*   02 WKS-TASRENET                PIC  9(04)V9(04).              061700      
002676*   02 WKS-TASREBRU                PIC  9(04)V9(04).              061800      
002677*   02 WKS-TASREANO                PIC  9(04)V9(04).              061900      
002678*   02 WKS-STATION                 PIC  9(04).                    062000      
002679*   02 WKS-CTACON                  PIC  9(02).                    062100      
002680*   02 WKS-MONEDA                  PIC  9(02).                    062200      
002681 01 WKS-S084-R                     REDEFINES WKS-EDOCTA.          062250      
002682    02 WKS-TASNET                  PIC  9(04)V9(04).              062251      
002683    02 WKS-TASBRU                  PIC  9(04)V9(04).              062252      
002684    02 WKS-NETPER                  PIC  9(04)V9(04).              062253      
002685    02 WKS-NETANU                  PIC  9(04)V9(04).              062254      
002686    02 WKS-DIASPER                 PIC  9(02).                    062255      
002687    02 WKS-DIASANU                 PIC  9(02).                    062256      
002688    02 WKS-MONS084                 PIC  9(02).                    062257      
002689    02 FILLER                      PIC  X(108).                   062258      
002690 01 WKS-S084AVB-R                  REDEFINES WKS-EDOCTA.          062259      
002691    04 FILLER                      PIC  X(03).                    062260      
002692    04 WKS-FECAPE                  PIC  9(08).                    062261      
002693    04 WKS-FECSIGPAGO              PIC  9(06).                    062262      
002694    04 WKS-SORTEO                  PIC  9(02).                    062263      
002695    04 WKS-RESTANTES               PIC  9(03).                    062264      
002696    04 WKS-ANTICIPADAS             PIC  9(03).                    062265      
002697    04 WKS-OPORTUNAS               PIC  9(02).                    062266      
002698    04 WKS-TOTALES                 PIC  9(02).                    062267      
002699    04 WKS-ATRASOS                 PIC  9(02).                    062268      
002700    04 WKS-BONOS                   PIC  9(02).                    062269      
002701    04 WKS-ESQUEMA                 PIC  9(02).                    062270      
002702    04 WKS-MOVEDAAVB               PIC  9(02).                    062271      
002703    04 FILLER                      PIC  X(106).                   062272      
002704 01 WKS-S087-R                     REDEFINES WKS-EDOCTA.          062273      
002705    02 WKS-PLAZO                   PIC  9(02).                    062274      
002706    02 WKS-TASS087                 PIC  9(02)V9(02).              062275      
002707    02 WKS-INSTRUCCIONES           PIC  9(02).                    062276      
002708    02 WKS-TIPOPER                 PIC  9(02).                    062277      
002709    02 WKS-FILS087                 PIC  X(08).                    062278      
002710    02 WKS-MON                     PIC  9(02).                    062279      
002711    02 FILLER                      PIC X(108).                    062280      
002712 01 WKS-S500-R                     REDEFINES WKS-EDOCTA.          062281      
002713    02 WKS-DIASCICLO               PIC  9(03).                    062282      
002714    02 WKS-DIASANO                 PIC  9(03).                    062283      
002715    02 WKS-TASRENET                PIC  9(04)V9(04).              062284      
002716    02 WKS-TASREBRU                PIC  9(04)V9(04).              062285      
002717    02 WKS-TASREANO                PIC  9(04)V9(04).              062286      
002718    02 WKS-STATION                 PIC  9(04).                    062287      
002719    02 WKS-CTACON                  PIC  9(02).                    062288      
002720    02 WKS-MONEDA                  PIC  9(02).                    062289      
002721    02 FILLER                      PIC X(108).                    062290      
002722 01 WKS-S408-R                     REDEFINES WKS-EDOCTA.          062291      
002723    02 WKS-FECVEN                  PIC  9(08).                    062292      
002724    02 WKS-TASINT                  PIC  9(04)V9(04).              062293      
002725    02 WKS-DIASBG                  PIC  9(04).                    062294      
002726    02 WKS-LINEA                   PIC  9(04).                    062295      
002727    02 WKS-FOLIO                   PIC  9(04).                    062296      
002728    02 WKS-FILS408                 PIC  X(06).                    062297      
002729    02 FILLER                      PIC X(106).                    062299      
002730/**************************************************************** 062300      
002731*             P R O C E D U R E     D I V I S I O N             * 062400      
002732***************************************************************** 062500      
002733                                                                  062600      
002734                                                                  062700      
002735 PROCEDURE DIVISION USING W77-PARAM-SISTEMA.                      062800      
002736                                                                  062900      
002737 000000-INICIO SECTION.                                           063000      
002738 000000-INIC.                                                     063100      
002739     MOVE W77-PARAM-SISTEMA        TO WLI-NUMSIS-ENC3             063200      
002740                                      WLI-NUMSIS-ENC4             063300      
002741                                      WLI-SISDIF-SNNN             063350      
002742                                      WLI-SISCTO-SNNN             063360      
002743                                      WKS-SIS-BACK2               063370      
002744                                      WLI-RB-E3-SISTEMA2          063380      
002745                                      W77-GRABA-500.              063390      
002746     PERFORM 100000-INICIO                                        063400      
002747     PERFORM 200000-PROCESA UNTIL W77-EOF > ZEROS.                063500      
002748     PERFORM 999999-FIN.                                          063600      
002749                                                                  063700      
002750 100000-INICIO SECTION.                                           063800      
002751 100000-INI.                                                      063900      
002752     CHANGE ATTRIBUTE LIBACCESS         OF "ADMONXFERS"           063920      
002753                                        TO BYFUNCTION.            063940      
002754     CHANGE ATTRIBUTE FUNCTIONNAME      OF "ADMONXFERS"           063960      
002755                                        TO "ADMONXFERS".          063980      
002756     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   064000      
002757        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          064100      
002758     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   064200      
002759     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            064300      
002760                                      "SOPORTECOMS".              064400      
002761     CHANGE ATTRIBUTE LIBACCESS OF "CTLVER" TO BYFUNCTION.        064500      
002762     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO                 064600      
002763                                      "CTLVERS".                  064700      
002764                                                                  064800      
002765     MOVE "S080BD01CON"            TO WKS-CTLVER-LIBID.           064900      
002766     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            065000      
002767                                      WKS-CTLVER-NOMLIB           065100      
002768                               GIVING W77-CTLVER-RSLT.            065200      
002769                                                                  065300      
002770     IF W77-CTLVER-RSLT = 0                                       065400      
002771        CHANGE ATTRIBUTE TITLE OF "ESTRUCTURA" TO                 065500      
002772                                  WKS-CTLVER-NOMLIB.              065600      
002773                                                                  065700      
002774     MOVE 0                        TO W77-CTLVER-RSLT.            065800      
002775     MOVE "S151L001CTL"            TO WKS-CTLVER-LIBID.           065900      
002776     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            066000      
002777                                      WKS-CTLVER-NOMLIB           066100      
002778                               GIVING W77-CTLVER-RSLT.            066200      
002779     IF W77-CTLVER-RSLT = 0                                       066300      
002780        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                066400      
002781                                  WKS-CTLVER-NOMLIB               066500      
002782     ELSE                                                         066600      
002783*       MOVE 020901 TO CODIGO-LJ                                  066700      
002784*       STRING "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-CONTROL " 066800      
002785*       DELIMITED BY SIZE INTO TEXTO-LJ                           066900      
002786*       PERFORM 999999-DESPLIEGA                                  067000      
002787        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                067100      
002788            "(S151)S151/OBJECT/L001/CONTROL          ON CMEMP.".  067200      
002789                                                                  067300      
002790     MOVE "S151" TO SISTEMA-LJ                                    067400      
002791     MOVE "P178" TO PASO-LJ                                       067500      
002792                    WKS-PASO-BACK2                                067551      
002793                    WLI-RB-E1-PASO                                067571      
002794     MOVE "001"  TO MTP-LJ                                        067600      
002795     MOVE "W77-I"    TO TIPO-LJ                                   067700      
002796     MOVE 020101 TO CODIGO-LJ                                     067800      
002797     MOVE WKS-TEXTO TO TEXTO-LJ                                   067900      
002798                                                                  068000      
002799     PERFORM 1001000-CHECA-LIBCONTROL.                            068100      
002800     MOVE SPACES       TO      WLI-ENCAB-52,TEXTO-LJ              068151      
002801     MOVE "W77-I"    TO TIPO-LJ                                   068200      
002802     MOVE 020101 TO CODIGO-LJ                                     068300      
002803     MOVE W77-FECHA-PROC TO FEC-TEX.                              068400      
002804     MOVE WKS-TEXTO TO TEXTO-LJ.                                  068500      
002805     MOVE TIPO-LJ        TO      WLI-TIPO-LJ.                     068551      
002806     MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ.                    068571      
002807     PERFORM  000-030-IMPRIME-MENSAJE.                            068591      
002808*    PERFORM 999999-DESPLIEGA.                                    068600      
002809     CANCEL "CTLVER".                                             068700      
002810*    CANCEL "LOCALSUPPORT".                                       068800      
002811                                                                  068900      
002812                                                                  069000      
002813     GO TO 1001999-EXIT.                                          069100      
002814                                                                  069200      
002815                                                                  069300      
002816  1001000-CHECA-LIBCONTROL.                                       069400      
002817*---------------------------                                      069500      
002818     SET R01-REPMES(USERBACKUPNAME)     TO VALUE TRUE.            069600      
002819     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-VALUE.             069700      
002820     MOVE ATTRIBUTE STACKNO OF MYSELF   TO WLI-NUMMIX-CIFRAS.     069800      
002821     SET R02-REPPOS(USERBACKUPNAME)     TO VALUE TRUE.            069900      
002822     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-VALUE.             070000      
002823     MOVE ATTRIBUTE STACKNO OF MYSELF   TO WLI-NUMMIX-NUEVO.      070100      
002824     CALL "CSIID IN SOPORTECOMS" USING WKS-DATOS-HOST.            070200      
002825     MOVE W77-PARAM-SISTEMA    TO WKS-B01-SISTEMA                 070300      
002826                                 WLI-SIST-CIFRAS OF WKS-TIT-REPMES070400      
002827                                 WLI-SIST-NOMEXT OF WKS-TIT-REPMES070500      
002828                                 WLI-SIST-NUEVO  OF WKS-TIT-REPNVO070600      
002829                                 WLI-SIST-NOMEXTNEW OF            070700      
002830                                                    WKS-TIT-REPNVO070800      
002831                                 WLI-NUMREP-2                     070850      
002832     MOVE WKS-NUMCSI           TO WKS-B01-CSI                     070900      
002833                                  WKS-TR-CSI2                     070951      
002834                                  WKS-INTE-CSI                    070971      
002835                                  WLI-CSI-CIFRAS OF WKS-TIT-REPMES071000      
002836                                  WLI-CSI-NUEVO  OF WKS-TIT-REPNVO071100      
002837                                                                  071150      
002838     IF WKS-NUMCSI = 12 OR 10                                     071155      
002839        MOVE      10      TO      WKS-CSI-ETI                     071160      
002840                                  WKS-NUMCSI                      071165      
002841        MOVE "V"          TO      WKS-INTE-LETRA                  071167      
002842     ELSE                                                         071170      
002843        MOVE      04      TO      WKS-CSI-ETI                     071175      
002844                                  WKS-NUMCSI                      071185      
002845        MOVE "M"          TO      WKS-INTE-LETRA.                 071190      
002846                                                                  071195      
002847     MOVE 1                 TO WKS-B01-FUNCION.                   071200      
002848     CALL "CONSISDIA IN LIB-CONTROL" USING WKS-S151B01SISDIA      071300      
002849                                    GIVING W77-STATUS.            071400      
002850     IF W77-STATUS > 0                                            071500      
002851        MOVE "E"            TO      TIPO-LJ                       071600      
002852        MOVE 020901         TO      CODIGO-LJ                     071700      
002853        STRING "ERROR AL CONSULTAR LIB-CONTROL : ",               071800      
002854                         W77-STATUS                               071900      
002855        DELIMITED BY SIZE INTO TEXTO-LJ                           072000      
002856        PERFORM 999999-DESPLIEGA                                  072100      
002857        SET MYSELF(STATUS)  TO  -1.                               072200      
002858     IF W77-VALUE = 0                                             072300      
002859        MOVE WKS-B01-FECPRO151     TO W77-FECHA-PROC              072400      
002860                                      WLI-RB-E1-FECHA-INF2        072451      
002861     ELSE                                                         072500      
002862        MOVE W77-VALUE             TO W77-FECHA-PROC              072600      
002863                                      WLI-RB-E1-FECHA-INF2.       072651      
002864     MOVE "DIARIO"                 TO WLI-RB-E2-TIPO-PROC2.       072661      
002865                                                                  072671      
002866     MOVE W77-FECHA-PROC          TO      WKS-START-FEC  .        072673      
002867     MOVE W77-FECPRO-MM           TO  WKS-INTE-MM.                072674      
002868     MOVE W77-FECPRO-DD           TO  WKS-INTE-DD.                072675      
002869     PERFORM      100000-FORMATO-DISPLAY.                         072681      
002870                                                                  072700      
002871*    MOVE W77-FECHA-PROC           TO WLI-FECHA-CIFRAS            072800      
002872*                                     WLI-FECHA-NUEVO             072900      
002873*                                     WLI-FECPROC-ENC             073000      
002874*                                     WLI-FECPROC-ENC6            073100      
002875*                                     WLI-FECPROC-ENC7            073200      
002876*INICIA CODIGO DE RENOVACION CRONOS 2000                          073201      
002877$SET OMIT = OLDCODE                                               073202      
002878    MOVE W77-FECHA-PROC           TO WLI-FECHA-CIFRAS             073203      
002879                                      WLI-FECHA-NUEVO             073204      
002880                                      WLI-FECPROC-ENC             073205      
002881                                      WLI-FECPROC-ENC6            073206      
002882                                      WLI-FECPROC-ENC7            073207      
002883$POP OMIT                                                         073208      
002884$SET OMIT = NOT OLDCODE                                           073209      
002885     MOVE ZEROS TO A2K-FEC-CAMD-001                               073210      
002886     MOVE W77-FECHA-PROC  TO A2K-FEC-CAMD-001                     073211      
002887                             WLI-FECPROC-ENC                      073212      
002888                             WLI-FECPROC-ENC6                     073213      
002889                             WLI-FECPROC-ENC7                     073214      
002890     PERFORM A2K-CONV-CAMD-TO-AMD THRU                            073215      
002891             A2K-CONV-CAMD-TO-AMD-EXIT                            073216      
002892     MOVE A2K-FEC-AMD-001 TO WLI-FECHA-CIFRAS                     073217      
002893                             WLI-FECHA-NUEVO                      073218      
002894*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073219      
002895*    ACCEPT WLI-FECEJEC-ENC        FROM TODAYS-DATE               073300      
002896*INICIA CODIGO DE RENOVACION CRONOS 2000                          073301      
002897     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          073302      
002898             A2K-ACCEPT-TODAYS-DATE-EXIT.                         073303      
002899     MOVE A2K-FEC-MDCA-001 TO WLI-FECEJEC-ENC                     073304      
002900*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073305      
002901     MOVE W77-FECHA-PROC           TO WKS-TIT-FECENV,             073355      
002902                                      WKS-FECHA-AAAAMMDD.         073360      
002903     MOVE WKS-AMO-AAAA             TO WKS-AMO-DDMM                073365      
002904     MOVE WKS-MES-AAAA             TO WKS-MES-DDMM                073370      
002905     MOVE WKS-DIA-AAAA             TO WKS-DIA-DDMM                073375      
002906                                                                  073380      
002907     ACCEPT WKS-HORA-HS            FROM TIME                      073400      
002908     MOVE  WKS-HR-HH               TO WLI-HH-EJEC-ENC             073500      
002909                                      WLI-HH-EJEC-ENC6            073600      
002910                                      WLI-HH-EJEC-ENC7.           073700      
002911     MOVE  WKS-HR-MM               TO WLI-MM-EJEC-ENC             073710      
002912                                      WLI-MM-EJEC-ENC6            073720      
002913                                      WLI-MM-EJEC-ENC7.           073730      
002914     MOVE  WKS-HR-MM               TO WLI-SS-EJEC-ENC             073740      
002915                                      WLI-SS-EJEC-ENC6            073750      
002916                                      WLI-SS-EJEC-ENC7.           073760      
002917                                                                  073770      
002918*    CHANGE ATTRIBUTE LIBACCESS    OF "LOCALSUPPORT"              073800      
002919*                                  TO BYFUNCTION.                 073900      
002920*    CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCALSUPPORT"              074000      
002921*                                  TO "S006LOCSUP"                074100      
002922     MOVE ATTRIBUTE NAME OF MYSELF TO WKS-HORA-COMPILACION        074200      
002923*INICIA CODIGO DE RENOVACION CRONOS 2000                          074201      
002924*$SET OMIT = NOT OLDCODE                                          074202      
002925*    MOVE ZEROS TO A2K-FEC-CAMD-001                               074203      
002926*    MOVE WKS-FECHA-COMPILACION TO A2K-FEC-CAMD-001               074204      
002927*    PERFORM A2K-CONV-CAMD-TO-AMD THRU                            074205      
002928*            A2K-CONV-CAMD-TO-AMD-EXIT                            074206      
002929*$POP OMIT                                                        074207      
002930*TERMINA CODIGO DE RENOVACION CRONOS 2000                         074208      
002931*    CALL "CONVERT-DATE OF LOCALSUPPORT"                          074300      
002932*         USING WKS-HORA-COMPILACION                              074400      
002933*               WKS-FECHA-COMPILACION                             074500      
002934*INICIA CODIGO DE RENOVACION CRONOS 2000                          074501      
002935*$SET OMIT = OLDCODE                                              074502      
002936*          WKS-FECHA-COMPILACION                                  074503      
002937*$POP OMIT                                                        074504      
002938*$SET OMIT = NOT OLDCODE                                          074505      
002939*         A2K-FEC-AMD-001                                         074506      
002940*         PERFORM A2K-CONV-AMD-TO-CAMD THRU                       074507      
002941*                 A2K-CONV-AMD-TO-CAMD-EXIT                       074508      
002942*         MOVE A2K-FEC-CAMD-001 TO WKS-FECHA-COMPILACION          074509      
002943*$POP OMIT                                                        074510      
002944*TERMINA CODIGO DE RENOVACION CRONOS 2000                         074511      
002945                                                                  074600      
002946                                                                  075100      
002947                                                                  075200      
002948                                                                  075300      
002949     MOVE WKS-B01-NOMARCSAL        TO WKS-NOM-SDOENT              075400      
002950*    MOVE W77-FECHA-PROC           TO WKS-FEC-SDOENT              075500      
002951*INICIA CODIGO DE RENOVACION CRONOS 2000                          075501      
002952$SET OMIT = OLDCODE                                               075502      
002953      MOVE W77-FECHA-PROC           TO WKS-FEC-SDOENT             075503      
002954$POP OMIT                                                         075504      
002955$SET OMIT = NOT OLDCODE                                           075505      
002956        MOVE ZEROS TO A2K-FEC-CAMD-001                            075506      
002957        MOVE W77-FECHA-PROC TO A2K-FEC-CAMD-001                   075507      
002958        PERFORM A2K-CONV-CAMD-TO-AMD THRU                         075508      
002959                A2K-CONV-CAMD-TO-AMD-EXIT                         075509      
002960        MOVE A2K-FEC-AMD-001 TO WKS-FEC-SDOENT                    075510      
002961$POP OMIT                                                         075511      
002962*TERMINA CODIGO DE RENOVACION CRONOS 2000                         075512      
002963     MOVE WKS-B01-NOMPACSAL        TO WKS-PK-SDOENT               075600      
002964     MOVE 2                        TO WLI-NUMREP                  075650      
002965     CHANGE ATTRIBUTE TITLE OF R01-REPMES  TO                     075700      
002966                               WKS-TIT-REPMES                     075800      
002967     MOVE "POSICION"        TO WLI-NOMB-REPORT                    075900      
002968     CHANGE ATTRIBUTE TITLE OF R02-REPPOS  TO                     076000      
002969                               WKS-TIT-REPNVO                     076100      
002970                                                                  076200      
002971**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                076204      
002972     IF W77-VALUE = 0                                             076208      
002973          PERFORM 0101000-VERIFICA-B05.                           076212      
002974**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                076216      
002975                                                                  076220      
002976     PERFORM 1001105-VALIDA-STABDSDO UNTIL WKS-B03-STABDSAL = 3 OR076300      
002977                                                              4 OR076400      
002978                                                             99   076500      
002979                                                                  076600      
002980     IF WKS-B03-STABDSAL = 99                                     076700      
002981        MOVE 2                     TO W77-EOF                     076800      
002982     ELSE                                                         076900      
002983        PERFORM 1500000-CARGA-CONCEPTO-SDOS                       077000      
002984        PERFORM 1520000-CARGA-REL-SALDOS                          077100      
002985        OPEN INPUT  A01-SDOENT                                    077200      
002986        PERFORM 1001000-ABRE-LISTADOS                             077300      
002987     PERFORM 5000000-LEE-SDOS UNTIL A02-R00-TIPO-REG OF A01-SDOENT077500      
002988                                    = 81                          077600      
002989     MOVE ZEROS                TO W77-STATUS                      077700      
002990     MOVE W77-PARAM-SISTEMA    TO WKS-B03F09-SISTEMA              077800      
002991     MOVE 9                    TO WKS-B03F09-FUNCION              077900      
002992     MOVE 4                    TO WKS-B03F09-STABDSAL             078000      
002993     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN-F09  078100      
002994                                    GIVING W77-STATUS             078200      
002995     IF W77-STATUS > 0                                            078300      
002996        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          078351      
002997        MOVE "E"            TO      TIPO-LJ                       078400      
002998        MOVE 020901         TO      CODIGO-LJ                     078500      
002999        STRING "ERROR AL ACTUALIZAR LIB-CONTROL STATUS INICIO : ",078600      
003000                         W77-STATUS                               078700      
003001        DELIMITED BY SIZE INTO TEXTO-LJ                           078800      
003002        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   078851      
003003        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  078871      
003004        PERFORM  000-030-IMPRIME-MENSAJE                          078891      
003005        PERFORM 999999-DESPLIEGA                                  078900      
003006        SET MYSELF(STATUS)  TO  -1.                               079000      
003007                                                                  079100      
003008     IF W77-EOF = ZEROS                                           079200      
003009        IF WKS-B03-NOMBDSAL NOT = SPACES                          079300      
003010           MOVE WKS-B03-NOMBDSAL         TO WKS-BDSDO             079400      
003011           CHANGE ATTRIBUTE TITLE OF SDODB TO WKS-NOMBD-SDO       079500      
003012           OPEN UPDATE SDODB                                      079600      
003013                ON EXCEPTION                                      079700      
003014                PERFORM 900000-CHECA-STATUS.                      079800      
003015       PERFORM 1001100-CHECA-BDMOV VARYING W77-I FROM 1 BY 1 UNTIL079900      
003016                                        W77-I > WKS-B03-NUMCICDIA.080000      
003017                                                                  080100      
003018 1001000-ABRE-LISTADOS.                                           080110      
003019*=====================                                            080120      
003020     IF W77-PARAM-SISTEMA = 500                                   080130      
003021        OPEN OUTPUT R01-REPMES.                                   080140      
003022     OPEN OUTPUT    R02-REPPOS.                                   080150      
003023                                                                  080160      
003024                                                                  080200      
003025 100000-FORMATO-DISPLAY.                                          080251      
003026*=======================                                          080261      
003027                                                                  080271      
003028*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
003029*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".               080281      
003030                                                                  000100      
003031*===============================================================* 000200      
003032*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
003033*         PARA LLAMADO DE DISPLAY                               * 000400      
003034*===============================================================* 000500      
003035                                                                  000600      
003036     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
003037            TO BYFUNCTION.                                        000671      
003038                                                                  000691      
003039     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
003040          USING WKS-DATE-ARRAY2.                                  000800      
003041     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
003042     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
003043     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
003044     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
003045     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
003046     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
003047                                                                  001300      
003048     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
003049     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
003050     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
003051                               WKS-TIT-REPORTE2.                  001700      
003052*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
003053*                                  GIVING WKS-COMPILA2.           001900      
003054*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
003055*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
003056*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
003057*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
003058                                                                  002066      
003059*    IF WKS-AAA-VERSION2  < 50                                    002071      
003060*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
003061*    ELSE                                                         002081      
003062*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
003063                                                                  002091      
003064                                                                  002500      
003065*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
003066     OPEN OUTPUT V00-REPORTE2.                                    002700      
003067     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
003068     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
003069                                                                  003000      
003070 000-050-CHECA-SALTO-HOJA2.                                       003051      
003071*==========================                                       003071      
003072    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
003073     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
003074        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
003075     ELSE                                                         003079      
003076        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
003077     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
003078     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
003079     MOVE "/"                     TO WKS-SLASH1.                  003086      
003080     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
003081     MOVE "/"                     TO WKS-SLASH2.                  003088      
003082     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
003083     IF  WKS-NUM-LINEAS2 > 56                                     003091      
003084         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
003085         ADD 1                   TO    W77-CONT-HOJA2             003200      
003086         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
003087         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
003088         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
003089         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
003090         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
003091         MOVE SPACES             TO V00-R00-REPORTE2              003800      
003092         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
003093         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
003094                                                                  004100      
003095 000-030-IMPRIME-MENSAJE.                                         004200      
003096*========================                                         004300      
003097*LP                                                               004400      
003098     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
003099     ADD             2       TO WKS-NUM-LINEAS2                   004600      
003100     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
003101                                                                  004800      
003102*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003103                                                                  080291      
003104 1001105-VALIDA-STABDSDO.                                         080300      
003105     MOVE W77-PARAM-SISTEMA    TO WKS-B03-SISTEMA                 080400      
003106     MOVE 1                    TO WKS-B03-FUNCION.                080500      
003107     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN      080600      
003108                                    GIVING W77-STATUS.            080700      
003109     IF W77-STATUS > 0                                            080800      
003110        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          080851      
003111        MOVE "E"            TO      TIPO-LJ                       080900      
003112        MOVE 020901         TO      CODIGO-LJ                     081000      
003113        STRING "ERROR AL CONSULTAR B03 LIB-CONTROL : ",           081100      
003114                         W77-STATUS                               081200      
003115        DELIMITED BY SIZE INTO TEXTO-LJ                           081300      
003116        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   081351      
003117        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  081371      
003118        PERFORM  000-030-IMPRIME-MENSAJE                          081391      
003119        PERFORM 999999-DESPLIEGA                                  081400      
003120        SET MYSELF(STATUS)  TO  -1.                               081500      
003121*****IF W77-PARAM-SISTEMA = 408                                   081600      
003122*****   MOVE 99                   TO WKS-B03-STABDSAL.            081700      
003123     IF WKS-B03-STABDSAL < 3                                      081800      
003124        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          081851      
003125        MOVE "I"            TO      TIPO-LJ                       081900      
003126        MOVE 020601         TO      CODIGO-LJ                     082000      
003127        STRING "NO HA TERMINADO P025 DETENGO PROCESO 15 MINS: ",  082100      
003128                         WKS-B03-STABDSAL                         082200      
003129        DELIMITED BY SIZE INTO TEXTO-LJ                           082300      
003130        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   082351      
003131        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  082371      
003132        PERFORM  000-030-IMPRIME-MENSAJE                          082391      
003133        PERFORM 999999-DESPLIEGA                                  082400      
003134        WAIT (900)                                                082500      
003135     ELSE                                                         082600      
003136     IF WKS-B03-STABDSAL = 99                                     082700      
003137        NEXT SENTENCE                                             082800      
003138     ELSE                                                         082900      
003139     IF WKS-B03-STABDSAL > 4                                      083000      
003140**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                083004      
003141        IF WKS-B03-STABDSAL = 5                                   083008      
003142           MOVE 99        TO WKS-B03-STABDSAL                     083012      
003143        ELSE                                                      083016      
003144**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                083020      
003145           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       083051      
003146           MOVE "E"            TO      TIPO-LJ                    083100      
003147           MOVE 020701         TO      CODIGO-LJ                  083200      
003148           STRING "ERROR YA SE EJECUTO ESTE PROCESO : ",          083300      
003149                            WKS-B03-STABDSAL                      083400      
003150           DELIMITED BY SIZE INTO TEXTO-LJ                        083500      
003151           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                083551      
003152           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               083571      
003153           PERFORM  000-030-IMPRIME-MENSAJE                       083591      
003154           PERFORM 999999-DESPLIEGA                               083600      
003155           SET MYSELF(STATUS)  TO  -1.                            083700      
003156                                                                  083800      
003157 1001100-CHECA-BDMOV.                                             083900      
003158*INICIA CODIGO DE RENOVACION CRONOS 2000                          083901      
003159$SET OMIT = NOT OLDCODE                                           083902      
003160          MOVE ZEROS TO A2K-FEC-AM-001                            083903      
003161          MOVE WKS-FECSDO-AAMM   TO A2K-FEC-AM-001                083904      
003162          PERFORM A2K-CONV-AM-TO-CAM THRU                         083905      
003163                  A2K-CONV-AM-TO-CAM-EXIT                         083906      
003164$POP OMIT                                                         083907      
003165*TERMINA CODIGO DE RENOVACION CRONOS 2000                         083908      
003166     IF WKS-B03-NOMBDMOV(W77-I) NOT = SPACES AND                  084000      
003167*       WKS-B03-AAMM    (W77-I)     = WKS-FECSDO-AAMM             084100      
003168*INICIA CODIGO DE RENOVACION CRONOS 2000                          084101      
003169$SET OMIT = OLDCODE                                               084102      
003170        WKS-B03-AAMM    (W77-I)     = WKS-FECSDO-AAMM             084103      
003171$POP OMIT                                                         084104      
003172$SET OMIT = NOT OLDCODE                                           084105      
003173        WKS-B03-AAMM    (W77-I)     = A2K-FEC-CAM-001             084106      
003174$POP OMIT                                                         084107      
003175*TERMINA CODIGO DE RENOVACION CRONOS 2000                         084108      
003176        MOVE WKS-B03-NOMBDMOV(W77-I) TO WKS-BDMOV                 084200      
003177        CHANGE ATTRIBUTE TITLE OF MOVDB TO WKS-NOMBD-MOV          084300      
003178        COMPUTE W77-I = WKS-B03-NUMCICDIA + 1                     084400      
003179        OPEN INQUIRY MOVDB                                        084500      
003180             ON EXCEPTION                                         084600      
003181                PERFORM 900000-CHECA-STATUS.                      084700      
003182                                                                  084800      
003183                                                                  084900      
003184 1500000-CARGA-CONCEPTO-SDOS.                                     085000      
003185*============================                                     085100      
003186     MOVE ZERO                     TO W77-EOF                     085200      
003187                                      W77-IND.                    085300      
003188     MOVE 151                      TO W77-L700-SISTEMA.           085400      
003189     MOVE 178                      TO W77-L700-PROGRAMA.          085500      
003190     MOVE 185                      TO WKS-EL700-CAT.              085600      
003191     MOVE 20                       TO WKS-EL700-CLAVE.            085700      
003192     MOVE 1                        TO WKS-EL700-REGISTROS.        085800      
003193     MOVE 1                        TO WKS-EL700-BUSQUEDA.         085900      
003194     MOVE 0                        TO WKS-EL700-CVEREG.           086000      
003195     MOVE 0                        TO WKS-EL700-REGASO.           086100      
003196     MOVE 0                        TO WKS-EL700-NIVINI.           086200      
003197     MOVE 0                        TO WKS-EL700-FECINI.           086300      
003198     PERFORM 1510000-SDOS          UNTIL W77-EOF = 1.             086400      
003199     MOVE 0                        TO W77-EOF.                    086500      
003200                                                                  086600      
003201 1510000-SDOS.                                                    086700      
003202*=============                                                    086800      
003203     CALL "L700_CONSUL_DESC IN ESTRUCTURA"                        086900      
003204          USING W77-L700-SISTEMA,                                 087000      
003205                W77-L700-PROGRAMA,                                087100      
003206                WKS-L700-ENT,                                     087200      
003207                WKS-L700-SAL                                      087300      
003208          GIVING W77-L700-RESULT.                                 087400      
003209     IF W77-L700-RESULT = 1 OR 0                                  087500      
003210        MOVE WKS-SL700-CVEREG   TO W77-TOT-CVECON                 087600      
003211                                   WKS-EL700-CVEREG               087700      
003212        MOVE WKS-SL700-CVEREG   TO WKS-SDOS-CVE(W77-TOT-CVECON)   087800      
003213        MOVE WKS-SL700-NIVINI   TO WKS-EL700-NIVINI               087900      
003214        MOVE WKS-SL700-FECINI   TO WKS-EL700-FECINI               088000      
003215        MOVE WKS-SL700-REGASO   TO WKS-EL700-REGASO               088100      
003216        MOVE WKS-SL700-TLARGO   TO WKS-SDOS-LEY(W77-TOT-CVECON)   088200      
003217        IF W77-L700-RESULT = 0                                    088300      
003218           MOVE 1               TO W77-EOF                        088400      
003219        ELSE                                                      088500      
003220           NEXT SENTENCE                                          088600      
003221     ELSE                                                         088700      
003222        MOVE 1                     TO W77-EOF.                    088800      
003223*       MOVE "I"                   TO TIPO-LJ                     088900      
003224*       MOVE W77-L700-RESULT       TO W77-IND3                    089000      
003225*       MOVE 020901                TO CODIGO-LJ                   089100      
003226*       STRING "ERROR EN CAT. DESCRIP. S08001BD01CON, RESULT = "  089200      
003227*              W77-IND3                                           089300      
003228*       DELIMITED BY SIZE                                         089400      
003229*       INTO TEXTO-LJ                                             089500      
003230*       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                  089600      
003231*                                   MENSAJE-LJ.                   089700      
003232                                                                  089800      
003233 1520000-CARGA-REL-SALDOS.                                        089900      
003234*=========================                                        090000      
003235     MOVE 1                        TO WKS-SDO-INDICE(2).          090100      
003236     IF W77-PARAM-SISTEMA = 84                                    090200      
003237        MOVE 2                     TO WKS-SDO-INDICE(313)         090300      
003238        MOVE 3                     TO WKS-SDO-INDICE(301)         090400      
003239        MOVE 4                     TO WKS-SDO-INDICE(302)         090500      
003240        MOVE 5                     TO WKS-SDO-INDICE(303)         090600      
003241        MOVE 6                     TO WKS-SDO-INDICE(306)         090700      
003242        MOVE 7                     TO WKS-SDO-INDICE(308)         090800      
003243        MOVE 8                     TO WKS-SDO-INDICE(309)         090900      
003244        MOVE 9                     TO WKS-SDO-INDICE(311)         091000      
003245        MOVE 10                    TO WKS-SDO-INDICE(314)         091100      
003246        MOVE 9                     TO WKS-SDO-INDICE(311)         091200      
003247        MOVE 10                    TO WKS-SDO-INDICE(314)         091300      
003248        MOVE 11                    TO WKS-SDO-INDICE(315)         091400      
003249        MOVE 12                    TO WKS-SDO-INDICE(316)         091500      
003250        MOVE 13                    TO WKS-SDO-INDICE(317)         091600      
003251     ELSE                                                         091652      
003252     IF W77-PARAM-SISTEMA = 408                                   091656      
003253        MOVE 2                     TO WKS-SDO-INDICE(320)         091660      
003254        MOVE 3                     TO WKS-SDO-INDICE(321)         091664      
003255        MOVE 4                     TO WKS-SDO-INDICE(323)         091668      
003256        MOVE 5                     TO WKS-SDO-INDICE(324)         091672      
003257        MOVE 6                     TO WKS-SDO-INDICE(325)         091676      
003258        MOVE 7                     TO WKS-SDO-INDICE(326)         091680      
003259        MOVE 8                     TO WKS-SDO-INDICE(327)         091684      
003260        MOVE 9                     TO WKS-SDO-INDICE(328).        091688      
003261                                                                  091700      
003262 1001999-EXIT.                                                    091800      
003263     EXIT.                                                        091900      
003264                                                                  092000      
003265                                                                  092100      
003266 200000-PROCESA SECTION.                                          092200      
003267 200000-PROC.                                                     092300      
003268                                                                  092400      
003269     SORT A02-SORT ON ASCENDING KEY A02-R01-CNT      OF A02-SORT, 092500      
003270                                    A02-R01-PRD      OF A02-SORT, 092600      
003271                                    A02-R01-INS      OF A02-SORT, 092700      
003272                                    A02-R01-MONEDA   OF A02-SORT  092800      
003273          INPUT  PROCEDURE 210000-ORDENA-REGSDOS                  092900      
003274          OUTPUT PROCEDURE 220000-GRABA-BDSDOS                    093000      
003275          MEMORY    60000 WORDS                                   093100      
003276          DISK   30000000 WORDS.                                  093200      
003277                                                                  093300      
003278     SORT A03-SORT ON ASCENDING KEY A02-R01-SUCPRO OF A03-SORT,   093400      
003279                                    A02-R01-PRD    OF A03-SORT,   093500      
003280                                    A02-R01-INS    OF A03-SORT,   093600      
003281                                    A02-R01-MONEDA OF A03-SORT    093700      
003282          INPUT  PROCEDURE 410000-ORDENA-REGEDOCTA                093800      
003283          OUTPUT PROCEDURE 420000-GRABA-BDEDOCTA                  093900      
003284          MEMORY    60000 WORDS                                   094000      
003285          DISK   30000000 WORDS.                                  094100      
003286                                                                  094200      
003287     IF W88-GRABA-500                                             094210      
003288        OPEN OUTPUT E01-SDOS.                                     094220      
003289                                                                  094240      
003290     PERFORM 200010-PROCESO-POSICION.                             094300      
003291     PERFORM 200011-PROCESO-POSICIONNEXT UNTIL                    094400      
003292                                         W77-EOF-MOVTOSEM = 1.    094500      
003293     IF W88-GRABA-500                                             094510      
003294        CLOSE E01-SDOS WITH SAVE                                  094520      
003295*       CALL SYSTEM WFL USING WKS-TIT-WFL                         094620      
003296*       UNSTRING WKS-TIT-SDOS DELIMITED BY " "                    094622      
003297*                             INTO WKS-FILE-ORI                   094624      
003298*       UNSTRING WKS-SDOS-INTELAR DELIMITED BY " "                094626      
003299*                             INTO WKS-FILE-DEST                  094628      
003300*       CALL SYSTEM WFL USING WKS-WFL-COPY                        094630      
003301*       MOVE WKS-FILE-DEST    TO WKS-SDOS-INTELAR                 094632      
003302*       WAIT(60)                                                  094634      
003303        PERFORM 200005-ENVIO-POR-INTELAR.                         094639      
003304                                                                  094640      
003305     GO TO 200100-EXIT.                                           094700      
003306                                                                  094900      
003307 200005-ENVIO-POR-INTELAR.                                        094905      
003308*======================                                           094910      
003309     CALL "INTELARSND IN ADMONXFERS" USING  WKS-SDOS-INTELAR      094915      
003310                                     GIVING W77-INTE-SNT.         094920      
003311     IF W77-INTE-SNT NOT = 0                                      094925      
003312        MOVE "E"                       TO TIPO-LJ                 094930      
003313        MOVE 020901                    TO CODIGO-LJ               094935      
003314        MOVE W77-INTE-SNT              TO WKS-ERRNUM-INTELAR      094940      
003315        STRING "ERROR # " WKS-ERRNUM-INTELAR                      094945      
003316               " EN EL ENVIO POR INTELAR DEL ARCHIVO "            094950      
003317               WKS-SDOS-INTELAR                                   094955      
003318        DELIMITED BY SIZE                                         094960      
003319        INTO TEXTO-LJ                                             094965      
003320        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.      094970      
003321                                                                  094975      
003322 200010-PROCESO-POSICION.                                         095000      
003323     MOVE ZEROS            TO W77-EOF-MOVTOSEM                    095100      
003324                              WKS-NUM-LINEAS                      095200      
003325                              W77-NUM-PAG.                        095300      
003326                                                                  095400      
003327                                                                  095500      
003328     LOCK FIRST B70SXPOSICION AT  B70-SDO-KEYCSI = WKS-NUMCSI     095600      
003329                              AND B70-SDO-KEYFEC = W77-FECHA-PROC 095700      
003330          ON EXCEPTION                                            095800      
003331             IF DMSTATUS(NOTFOUND)                                095900      
003332                MOVE 1     TO W77-EOF-MOVTOSEM                    096000      
003333             ELSE                                                 096100      
003334                MOVE 1     TO W77-EOF-MOVTOSEM                    096152      
003335                PERFORM 900000-CHECA-STATUS.                      096200      
003336                                                                  096300      
003337 200011-PROCESO-POSICIONNEXT.                                     096400      
003338     MOVE ZERO                     TO W77-DIFERENCIAS.            096500      
003339     IF W77-EOF-MOVTOSEM = 0                                      096600      
003340        PERFORM 200020-IMPRIME-POSICION                           096700      
003341        PERFORM 200030-IMPRIME-B70 VARYING W77-D FROM 1 BY 1      096800      
003342                                   UNTIL W77-D > 9                096900      
003343        IF W77-DIFERENCIAS = 0                                    096910      
003344           FREE S151B70POSICION                                   096920      
003345             ON EXCEPTION NEXT SENTENCE                           096930      
003346        ELSE                                                      096940      
003347           STORE S151B70POSICION                                  096950      
003348              ON EXCEPTION                                        096960      
003349                 PERFORM 900000-CHECA-STATUS.                     096970      
003350                                                                  097000      
003351                                                                  097100      
003352     MOVE ZEROS           TO W77-EOF-MOVTODIA                     097200      
003353     FIND FIRST B71SXPOSDIAAD1 AT  B71-SDO-KEYFEC = B70-SDO-KEYFEC097300      
003354                               AND B71-SDO-KEYPRD = B70-SDO-KEYPRD097400      
003355                               AND B71-SDO-KEYINS = B70-SDO-KEYINS097500      
003356                               AND B71-SDO-KEYMON = B70-SDO-KEYMON097600      
003357          ON EXCEPTION                                            097700      
003358             IF DMSTATUS(NOTFOUND)                                097800      
003359                MOVE 1    TO W77-EOF-MOVTODIA                     097900      
003360             ELSE                                                 098000      
003361                PERFORM 900000-CHECA-STATUS.                      098100      
003362                                                                  098200      
003363     IF W77-EOF-MOVTODIA = ZEROS                                  098300      
003364        PERFORM 200040-VERIFICA-ADICIONALES UNTIL                 098400      
003365                                            W77-EOF-MOVTODIA = 1. 098500      
003366                                                                  098600      
003367     LOCK NEXT B70SXPOSICION AT  B70-SDO-KEYCSI = WKS-NUMCSI      098700      
003368                             AND B70-SDO-KEYFEC = W77-FECHA-PROC  098800      
003369          ON EXCEPTION                                            098900      
003370             IF DMSTATUS(NOTFOUND)                                099000      
003371                MOVE 1     TO W77-EOF-MOVTOSEM                    099100      
003372             ELSE                                                 099200      
003373                PERFORM 900000-CHECA-STATUS.                      099300      
003374                                                                  099400      
003375                                                                  099500      
003376 200040-VERIFICA-ADICIONALES.                                     099600      
003377                                                                  099700      
003378     MOVE ZEROS           TO      W77-P.                          099800      
003379                                                                  099900      
003380     PERFORM 200050-IMPRIME-B71 UNTIL W77-P > 11.                 100000      
003381                                                                  100100      
003382                                                                  100200      
003383     FIND NEXT B71SXPOSDIAAD1 AT  B71-SDO-KEYFEC = B70-SDO-KEYFEC 100300      
003384                              AND B71-SDO-KEYPRD = B70-SDO-KEYPRD 100400      
003385                              AND B71-SDO-KEYINS = B70-SDO-KEYINS 100500      
003386                              AND B71-SDO-KEYMON = B70-SDO-KEYMON 100600      
003387          ON EXCEPTION                                            100700      
003388             IF DMSTATUS(NOTFOUND)                                100800      
003389                MOVE 1     TO W77-EOF-MOVTODIA                    100900      
003390             ELSE                                                 101000      
003391                PERFORM 900000-CHECA-STATUS.                      101100      
003392                                                                  101200      
003393                                                                  101300      
003394 200020-IMPRIME-POSICION.                                         101400      
003395                                                                  101500      
003396     PERFORM 200025-IMPTIT-POSDIA.                                101600      
003397     WRITE R02-REG-REPPOS FROM WLI-ENCABEZADO-8 AFTER 2           101700      
003398     MOVE B70-SDO-KEYPRD   TO     WKS-D3-PRD                      101800      
003399     MOVE B70-SDO-KEYINS   TO     WKS-D3-INS                      101900      
003400     MOVE B70-SDO-KEYMON   TO     WKS-D3-MON                      102000      
003401     WRITE R02-REG-REPPOS FROM WLI-DETALLE-3                      102100      
003402     WRITE R02-REG-REPPOS FROM WLI-ENCABEZADO-9 AFTER 2           102200      
003403     ADD 5                 TO     WKS-NUM-LINEAS.                 102300      
003404                                                                  102400      
003405                                                                  102500      
003406 200025-IMPTIT-POSDIA.                                            102600      
003407     ADD 1                 TO     W77-NUM-PAG                     102700      
003408     MOVE W77-NUM-PAG      TO     WLI-ENC1-PAG                    102800      
003409     MOVE "S151-P178-001S151POSPRD" TO WLI-DESCRIP-REP            102900      
003410     WRITE R02-REG-REPPOS  FROM   WLI-ENCABEZADO-1 AFTER PAGE     103000      
003411     WRITE R02-REG-REPPOS  FROM   WLI-ENCABEZADO-2                103100      
003412     WRITE R02-REG-REPPOS  FROM   WLI-ENCABEZADO-7                103200      
003413     WRITE R02-REG-REPPOS  FROM   WLI-ENCABEZADO-20               103300      
003414     MOVE 3                TO     WKS-NUM-LINEAS.                 103400      
003415                                                                  103500      
003416                                                                  103600      
003417 200030-IMPRIME-B70.                                              103700      
003418     MOVE W77-D   TO      W77-GRABA-SDO.                          103750      
003419     IF WKS-NUM-LINEAS = 0 OR > 60                                103800      
003420        PERFORM 200025-IMPTIT-POSDIA                              103900      
003421        WRITE R02-REG-REPPOS FROM WLI-ENCABEZADO-9 AFTER 3        104000      
003422        ADD 3                     TO      WKS-NUM-LINEAS.         104100      
003423     MOVE SPACES                   TO WLI-DETALLE-4.              104200      
003424     IF B70-SDO-CNTMOV(W77-D) > 0 OR W77-D = 1                    104300      
003425        MOVE B70-SDO-CNTMOV(W77-D) TO      WKS-D4-NMOVS1          104400      
003426        MOVE B70-SDO-SD(W77-D)     TO      WKS-D4-IMPORT1         104500      
003427        MOVE WKS-SDOS-LEY(W77-D)   TO      WKS-D4-LEYEND1.        104600      
003428     ADD 1        TO      W77-D                                   104700      
003429     IF B70-SDO-CNTMOV(W77-D) > 0 OR W77-D = 2                    104800      
003430        MOVE B70-SDO-CNTMOV(W77-D) TO      WKS-D4-NMOVS2          104900      
003431        MOVE B70-SDO-SD(W77-D)     TO      WKS-D4-IMPORT2         105000      
003432        MOVE WKS-SDOS-LEY(W77-D)   TO      WKS-D4-LEYEND2.        105100      
003433     IF WKS-D4-LEYEND1 NOT = SPACES OR WKS-D4-LEYEND2 NOT = SPACES105200      
003434        WRITE R02-REG-REPPOS FROM WLI-DETALLE-4                   105300      
003435        ADD 1                        TO      WKS-NUM-LINEAS.      105400      
003436                                                                  105405      
003437     IF W88-GRABA-SDO                                             105410      
003438        MOVE WKS-FECHA-DDMMAAAA   TO      WKS-FECHA-PRO           105415      
003439        MOVE B70-SDO-KEYPRD       TO      WKS-PROD-PRO            105430      
003440        MOVE B70-SDO-KEYINS       TO      WKS-INST-PRO            105435      
003441        MOVE B70-SDO-KEYMON       TO      WKS-MON-PRO             105440      
003442        MOVE B70-SDO-SD(1)        TO      WKS-SDOANT-PRO          105445      
003443        MOVE B70-SDO-SD(2)        TO      WKS-SDOACT-PRO          105450      
003444        PERFORM 200034-COMPARA-SDOS                               105455      
003445        IF W88-GRABA-500                                          105458      
003446           WRITE REG-SDOS    FROM    WKS-DET-SDOS.                105459      
003447 200034-COMPARA-SDOS.                                             105461      
003448     IF WKS-PROD-PRO > 0  AND                                     105463      
003449        WKS-INST-PRO > 0  AND                                     105465      
003450        WKS-MON-PRO  > 0                                          105467      
003451        MOVE WKS-POS-PROD(WKS-PROD-PRO) TO W77-IND-PROD           105470      
003452        MOVE WKS-POS-INST(WKS-INST-PRO) TO W77-IND-INST           105472      
003453        MOVE WKS-POS-MON (WKS-MON-PRO ) TO W77-IND-MON            105474      
003454        IF W77-IND-PROD > 0 AND < 26 AND                          105477      
003455           W77-IND-INST > 0 AND < 16 AND                          105487      
003456           W77-IND-MON  > 0 AND < 20                              105497      
003457           IF WKS-SDOACT-PRO NOT =                                105510      
003458              WKS-TAB-IMP(W77-IND-PROD, W77-IND-INST, W77-IND-MON)105520      
003459           MOVE WKS-TAB-IMP(W77-IND-PROD,W77-IND-INST,W77-IND-MON)105522      
003460                                   TO B70-SDO-SD(2)               105524      
003461           MOVE 1                  TO W77-DIFERENCIAS.            105530      
003462                                                                  105600      
003463 200050-IMPRIME-B71.                                              105700      
003464     IF WKS-NUM-LINEAS = 0 OR > 60                                105800      
003465        PERFORM 200025-IMPTIT-POSDIA                              105900      
003466        WRITE R02-REG-REPPOS FROM WLI-ENCABEZADO-9 AFTER 3        106000      
003467        ADD 3                     TO      WKS-NUM-LINEAS.         106100      
003468     MOVE ZEROS                   TO      WKS-D4-NMOVS1           106200      
003469                                          WKS-D4-IMPORT1          106300      
003470                                          WKS-D4-NMOVS2           106400      
003471                                          WKS-D4-IMPORT2          106500      
003472     MOVE SPACES                  TO      WKS-D4-LEYEND1          106600      
003473                                          WKS-D4-LEYEND2.         106700      
003474     ADD 1                        TO      W77-P.                  106800      
003475     COMPUTE WKS-IND = ( B71-SDO-KEYIND * 12 ) - 2 + W77-P.       106900      
003476     IF B71-SDO-CNTMOV(W77-P) > 0                                 107000      
003477        IF WKS-IND > W77-TOT-CVECON                               107100      
003478           MOVE SPACES               TO      WKS-D4-LEYEND1       107200      
003479        ELSE                                                      107300      
003480           MOVE WKS-SDOS-LEY(WKS-IND)   TO   WKS-D4-LEYEND1.      107400      
003481     IF B71-SDO-CNTMOV(W77-P) > 0                                 107500      
003482        MOVE B71-SDO-CNTMOV(W77-P)   TO   WKS-D4-NMOVS1           107600      
003483        MOVE B71-SDO-SD(W77-P)       TO   WKS-D4-IMPORT1.         107700      
003484                                                                  107800      
003485     ADD 1                        TO      W77-P.                  107900      
003486     COMPUTE WKS-IND = ( B71-SDO-KEYIND * 12 ) - 2 + W77-P.       108000      
003487     IF B71-SDO-CNTMOV(W77-P) > 0                                 108100      
003488        IF WKS-IND > W77-TOT-CVECON                               108200      
003489           MOVE SPACES                TO      WKS-D4-LEYEND2      108300      
003490        ELSE                                                      108400      
003491           MOVE WKS-SDOS-LEY(WKS-IND) TO      WKS-D4-LEYEND2.     108500      
003492     IF B71-SDO-CNTMOV(W77-P) > 0                                 108600      
003493        MOVE B71-SDO-CNTMOV(W77-P)   TO   WKS-D4-NMOVS2           108700      
003494        MOVE B71-SDO-SD(W77-P)       TO   WKS-D4-IMPORT2.         108800      
003495                                                                  108900      
003496     IF WKS-D4-LEYEND1 NOT = SPACES OR WKS-D4-LEYEND2 NOT = SPACES109000      
003497        WRITE R02-REG-REPPOS FROM WLI-DETALLE-4                   109100      
003498        ADD 1                        TO   WKS-NUM-LINEAS.         109200      
003499                                                                  109300      
003500                                                                  109400      
003501                                                                  109500      
003502 200100-EXIT.                                                     109600      
003503     EXIT.                                                        109700      
003504                                                                  109800      
003505                                                                  109900      
003506 210000-ORDENA-REGSDOS SECTION.                                   110000      
003507 210000-ORDENA-REG.                                               110100      
003508                                                                  110200      
003509     MOVE ZEROS                    TO W77-EOF                     110300      
003510     PERFORM 210100-PROCESA UNTIL W77-EOF = 1.                    110400      
003511     GO TO 219999-EXIT.                                           110500      
003512                                                                  110600      
003513 210100-PROCESA.                                                  110700      
003514     IF A02-R00-TIPO-REG OF A01-SDOENT = 81                       110800      
003515        IF (W77-PARAM-SISTEMA = 500 OR 555) AND                   111060      
003516           A02-R01-PRD OF A01-SDOENT = 1 AND                      111065      
003517           A02-R01-INS OF A01-SDOENT = 3                          111070      
003518           PERFORM 210200-MUEVE-DATOS-APL                         111080      
003519           MOVE CORR A02-R00-SALDOS OF A01-SDOENT TO              111085      
003520                     A02-R00-SALDOS OF A02-SORT                   111090      
003521           RELEASE A02-R00-SALDOS    OF A02-SORT.                 111100      
003522     PERFORM 5000000-LEE-SDOS.                                    111200      
003523                                                                  111300      
003524 210200-MUEVE-DATOS-APL.                                          111350      
003525*=======================                                          111351      
003526     IF (W77-PARAM-SISTEMA = 500 OR 555)                          111355      
003527        MOVE A02-R01-MONEDA  OF A01-SDOENT TO W77-MONEDA          111356      
003528     ELSE                                                         111357      
003529     IF W77-PARAM-SISTEMA = 87                                    111358      
003530        MOVE A02-R01-MON     OF A01-SDOENT TO W77-MONEDA          111360      
003531     ELSE                                                         111362      
003532     IF W77-PARAM-SISTEMA = 84 AND                                111376      
003533        A02-R01-PRD OF A02-R01-REG-SAL OF A01-SDOENT = 84  AND    111377      
003534        ( A02-R01-INS OF A02-R01-REG-SAL OF A01-SDOENT = 15 OR 17)111378      
003535        MOVE 3                             TO W77-MONEDA          111380      
003536     ELSE                                                         111382      
003537     IF W77-PARAM-SISTEMA = 84                                    111384      
003538        MOVE A02-R01-MONS084 OF A01-SDOENT TO W77-MONEDA          111386      
003539     ELSE                                                         111388      
003540        MOVE 1                              TO W77-MONEDA.        111390      
003541                                                                  111391      
003542     IF A02-R01-PRD OF A01-SDOENT > 0 AND < 10000                 111392      
003543        IF WKS-POS-PROD(A02-R01-PRD OF A01-SDOENT) > 0            111393      
003544           MOVE WKS-POS-PROD(A02-R01-PRD OF A01-SDOENT)           111394      
003545                                   TO W77-IND-PROD                111395      
003546        ELSE                                                      111396      
003547           ADD 1                   TO W77-TOT-PROD                111397      
003548           MOVE W77-TOT-PROD       TO W77-IND-PROD                111400      
003549                          WKS-POS-PROD(A02-R01-PRD OF A01-SDOENT).111405      
003550                                                                  111410      
003551     IF A02-R01-INS OF A01-SDOENT > 0 AND < 10000                 111415      
003552        IF WKS-POS-INST(A02-R01-INS OF A01-SDOENT) > 0            111420      
003553           MOVE WKS-POS-INST(A02-R01-INS OF A01-SDOENT)           111425      
003554                                   TO W77-IND-INST                111427      
003555        ELSE                                                      111430      
003556           ADD 1                   TO W77-TOT-INST                111435      
003557           MOVE W77-TOT-INST       TO W77-IND-INST                111440      
003558                          WKS-POS-INST(A02-R01-INS OF A01-SDOENT).111445      
003559                                                                  111450      
003560     IF W77-MONEDA  > 0 AND < 10000                               111455      
003561        IF WKS-POS-MON(W77-MONEDA) > 0                            111460      
003562           MOVE WKS-POS-MON(W77-MONEDA) TO W77-IND-MON            111465      
003563        ELSE                                                      111470      
003564           ADD 1                   TO W77-TOT-MON                 111475      
003565           MOVE W77-TOT-MON        TO WKS-POS-MON(W77-MONEDA)     111478      
003566                                      W77-IND-MON.                111480      
003567     MOVE ZERO                     TO W77-SALIDA.                 111486      
003568     PERFORM 210300-BUSCA-IMPORTE VARYING W77-IND-IMP FROM 1 BY 1 111487      
003569*                                  UNTIL   W77-IND-IMP > 13   OR  111488      
003570                                  UNTIL   W77-IND-IMP > 30   OR   111489      
003571                                          W77-SALIDA > 0.         111490      
003572     IF W77-SALIDA > 0                                            111500      
003573      COMPUTE WKS-TAB-IMP(W77-IND-PROD,W77-IND-INST,W77-IND-MON) =111510      
003574              WKS-TAB-IMP(W77-IND-PROD, W77-IND-INST, W77-IND-MON)111515      
003575              + A02-R01-IMPT OF A02-R01-REG-SAL                   111520      
003576                             OF A01-SDOENT(W77-SALIDA).           111524      
003577                                                                  111529      
003578 210300-BUSCA-IMPORTE.                                            111530      
003579     IF A02-R01-CVESDO OF A02-R01-REG-SAL                         111535      
003580        OF A01-SDOENT(W77-IND-IMP) = 2                            111540      
003581        MOVE W77-IND-IMP           TO W77-SALIDA.                 111545      
003582 219999-EXIT.                                                     111550      
003583     EXIT.                                                        111600      
003584                                                                  111700      
003585                                                                  111800      
003586 220000-GRABA-BDSDOS SECTION.                                     111900      
003587 220000-GRBSDO.                                                   112000      
003588                                                                  112100      
003589     MOVE ZEROS                    TO W77-EOF                     112200      
003590     PERFORM 328000-LEE-SORT                                      112300      
003591     PERFORM 310000-PROCESA UNTIL W77-EOF = 1.                    112400      
003592     CLOSE A01-SDOENT WITH SAVE.                                  112500      
003593     IF (W77-PARAM-SISTEMA = 500 OR 555)                          112510      
003594        PERFORM 220100-REG-INEXISTENTES.                          112520      
003595     GO TO 400999-EXIT.                                           112530      
003596 220100-REG-INEXISTENTES.                                         112540      
003597*========================                                         112550      
003598     MOVE ZEROS                    TO W77-EOF                     112600      
003599     LOCK FIRST B20BXSDOMENCON                                    112700      
003600          ON EXCEPTION                                            112800      
003601             IF DMSTATUS(NOTFOUND)                                112900      
003602                MOVE 1             TO W77-EOF                     113000      
003603             ELSE                                                 113100      
003604                PERFORM 900000-CHECA-STATUS.                      113200      
003605     IF W77-EOF = ZEROS                                           113300      
003606        PERFORM 329000-PROCESA-BIT UNTIL W77-EOF = 1.             113400      
003607     MOVE ZEROS                    TO W77-EOF.                    113500      
003608                                                                  113600      
003609     IF WKS-NUMCTO-S151 > 0 OR                                    113700      
003610        WKS-NUMCTO-SNNN > 0 OR                                    113752      
003611        WKS-NUMDIF-SNNN > 0                                       113754      
003612        MOVE WKS-NUMCTO-S151       TO WLI-NUMCTO-S151             113756      
003613        MOVE WKS-IMPCTO-S151       TO WLI-IMPCTO-S151             113758      
003614        MOVE WKS-NUMCTO-SNNN       TO WLI-NUMCTO-SNNN             113760      
003615        MOVE WKS-IMPCTO-SNNN       TO WLI-IMPCTO-SNNN             113762      
003616        MOVE WKS-NUMDIF-SNNN       TO WLI-NUMDIF-SNNN             113764      
003617        MOVE WKS-IMPDIF-SNNN       TO WLI-IMPDIF-SNNN             113766      
003618        MOVE SPACES                TO R01-REG-REPMES              113768      
003619        WRITE R01-REG-REPMES                                      113770      
003620        WRITE R01-REG-REPMES FROM WLI-TOTAL-SDOS151               113772      
003621        WRITE R01-REG-REPMES FROM WLI-TOTAL-SDOSNNN               113774      
003622        WRITE R01-REG-REPMES FROM WLI-TOTAL-DIFSNNN               113780      
003623     ELSE                                                         113790      
003624        PERFORM 400100-IMPTIT-ERRMES                              113800      
003625        WRITE R01-REG-REPMES FROM WLI-DETALLE-9 AFTER 4.          113900      
003626                                                                  114000      
003627                                                                  114300      
003628 310000-PROCESA.                                                  114400      
003629     PERFORM 310100-COMPARA-SDOCNT.                               114500      
003630     IF A02-R01-EDOCTA OF A02-SORT > 0     AND                    114600      
003631        A02-R01-FECINI OF A02-SORT > ZEROS AND                    114700      
003632        A02-R01-FECFIN OF A02-SORT > ZEROS                        114800      
003633        PERFORM 311000-CORTECNT-EDOCTA.                           114900      
003634     PERFORM 328000-LEE-SORT.                                     115000      
003635                                                                  115100      
003636                                                                  115200      
003637 310100-COMPARA-SDOCNT.                                           115300      
003638     MOVE ZEROS                    TO W77-EOF-MOVCNTMES           115400      
003639     MOVE "S151BD11SDOS151"        TO WKS-NOM-BDERR-DMSII.        115500      
003640     LOCK B20SXSDOMENCON AT B20-SDO-KEYCON =                      115600      
003641                            A02-R01-CNT    OF A02-SORT            115700      
003642                        AND B20-SDO-KEYAM  =                      115800      
003643                            W77-FECPRO-AAMM                       115900      
003644                        AND B20-SDO-KEYPRD =                      116000      
003645                            A02-R01-PRD    OF A02-SORT            116100      
003646                        AND B20-SDO-KEYINS =                      116200      
003647                            A02-R01-INS    OF A02-SORT            116300      
003648                        AND B20-SDO-KEYMON =                      116400      
003649                            A02-R01-MONEDA OF A02-SORT            116500      
003650          ON EXCEPTION                                            116600      
003651             IF DMSTATUS(NOTFOUND)                                116700      
003652                MOVE 1             TO W77-EOF-MOVCNTMES           116800      
003653             ELSE                                                 116900      
003654                PERFORM 900000-CHECA-STATUS.                      117000      
003655                                                                  117100      
003656                                                                  117200      
003657                                                                  117300      
003658     IF W77-EOF-MOVCNTMES = 1                                     117400      
003659        CREATE S151B20SDOMENCON                                   117500      
003660        MOVE A02-R01-CVESDO OF A02-SORT (1)   TO W77-J            117600      
003661        MOVE "NO EXISTE CONTRATO EN S151 MES" TO WKS-D1-LEY       117700      
003662        ADD 1                      TO WKS-NUMCTO-S151             117750      
003663        COMPUTE WKS-IMPCTO-S151 = WKS-IMPCTO-S151 +               117760      
003664                                  A02-R01-IMPT OF A02-SORT (1)    117770      
003665                                                                  117780      
003666        PERFORM 400000-IMPERR-CNTMES                              117800      
003667        MOVE A02-R01-CNT    OF A02-SORT  TO B20-SDO-KEYCON        117900      
003668        MOVE W77-FECPRO-AAMM             TO B20-SDO-KEYAM         118000      
003669        MOVE A02-R01-PRD    OF A02-SORT  TO B20-SDO-KEYPRD        118100      
003670        MOVE A02-R01-INS    OF A02-SORT  TO B20-SDO-KEYINS        118200      
003671        MOVE A02-R01-MONEDA OF A02-SORT  TO B20-SDO-KEYMON.       118300      
003672     MOVE ZERO                           TO W77-RESDIV-ANT        118400      
003673                                            W77-SDO-DIF           118452      
003674                                            W77-ENCA-4.           118454      
003675     PERFORM 310200-VERI-SDOSMESCON VARYING W77-I FROM 1 BY 1     118500      
003676*                                      UNTIL W77-I > 13.          118600      
003677                                      UNTIL W77-I > 30.           118610      
003678     IF W77-SDO-DIF = 1                                           118652      
003679        PERFORM 400200-IMP-MOVMES UNTIL W77-EOF-MOVMES = 1.       118654      
003680     MOVE ZEROS                          TO B20-SDO-STAMOV        118700      
003681     STORE S151B20SDOMENCON                                       118800      
003682           ON EXCEPTION                                           118900      
003683              PERFORM 900000-CHECA-STATUS.                        119000      
003684                                                                  119100      
003685                                                                  119200      
003686                                                                  119300      
003687 310200-VERI-SDOSMESCON.                                          119400      
003688     IF A02-R01-CVESDO OF A02-SORT (W77-I) > ZEROS                119500      
003689        MOVE A02-R01-CVESDO OF A02-SORT (W77-I) TO W77-J          119600      
003690                                                   W77-IND-B20    119700      
003691        IF A02-R01-CVESDO OF A02-SORT (W77-I) < 11                119800      
003692           PERFORM 310210-VALIDA-CONCEPTO                         119900      
003693           IF W88-CONCEPTO-VALIDO                                 120000      
003694              IF A02-R01-IMPT OF A02-SORT (W77-I) =               120100      
003695                 B20-SDO-SD(W77-IND-B20)                          120200      
003696                 NEXT SENTENCE                                    120300      
003697              ELSE                                                120400      
003698              IF W77-EOF-MOVCNTMES = 1                            120500      
003699                 MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO         120600      
003700                      B20-SDO-SD(W77-IND-B20)                     120700      
003701              ELSE                                                120800      
003702               MOVE 1              TO W77-SDO-DIF                 120852      
003703               STRING "SALDOS DIFERENTES S"                       120900      
003704                      W77-PARAM-SISTEMA                           121000      
003705                      " VS S151"                                  121100      
003706               DELIMITED BY SIZE                                  121200      
003707               INTO WKS-D1-LEY                                    121300      
003708                                                                  121400      
003709               ADD 1               TO WKS-NUMDIF-SNNN             121450      
003710               COMPUTE WKS-IMPDIF-SNNN = B20-SDO-SD(W77-IND-B20)- 121460      
003711                                  A02-R01-IMPT OF A02-SORT (W77-I)121470      
003712               PERFORM 310220-VALIDA-ENC4                         121480      
003713               PERFORM 400000-IMPERR-CNTMES                       121500      
003714               MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO           121520      
003715                    B20-SDO-SD(W77-IND-B20)                       121540      
003716           ELSE                                                   121600      
003717              MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO            121700      
003718                   B20-SDO-SD(W77-IND-B20)                        121800      
003719        ELSE                                                      121900      
003720           PERFORM 310200-VERI-SDOSB21                            122000      
003721           PERFORM 310400-GRABA-SDOSB21.                          122100      
003722                                                                  122200      
003723 310200-VERI-SDOSB21.                                             122300      
003724*===================                                              122400      
003725     COMPUTE W77-K = W77-J + 1                                    122500      
003726     DIVIDE W77-K BY   12 GIVING W77-RESDIV                       122600      
003727                          REMAINDER W77-REMANENTE                 122700      
003728     ADD 1                   TO  W77-REMANENTE                    122800      
003729     MOVE W77-REMANENTE      TO  W77-IND-B20                      122900      
003730     PERFORM 310300-SDOS-MESADI                                   123000      
003731     PERFORM 310210-VALIDA-CONCEPTO                               123100      
003732     IF W88-CONCEPTO-VALIDO OR W88-S084-INS15-MEN                 123200      
003733        IF W88-CONCEPTO-VALIDO                                    123300      
003734           IF A02-R01-IMPT OF A02-SORT (W77-I) =                  123400      
003735              B21-SDO-SD(W77-IND-B20)                             123500      
003736              NEXT SENTENCE                                       123600      
003737           ELSE                                                   123700      
003738              IF W77-EOF-MOVCNTDIA = 1                            123800      
003739                 MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO         123900      
003740                      B21-SDO-SD(W77-IND-B20)                     124000      
003741              ELSE                                                124100      
003742                 MOVE 1            TO W77-SDO-DIF                 124152      
003743                 STRING "SALDOS DIFERENTES S"                     124200      
003744                        W77-PARAM-SISTEMA                         124300      
003745                        " VS S151"                                124400      
003746                 DELIMITED BY SIZE                                124500      
003747                 INTO WKS-D1-LEY                                  124600      
003748                 ADD 1               TO WKS-NUMDIF-SNNN           124650      
003749                 COMPUTE WKS-IMPDIF-SNNN= B21-SDO-SD(W77-IND-B20)-124660      
003750                                  A02-R01-IMPT OF A02-SORT (W77-I)124670      
003751                 PERFORM 310220-VALIDA-ENC4                       124700      
003752                 PERFORM 400000-IMPERR-CNTMES                     124800      
003753                 MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO         124820      
003754                      B21-SDO-SD(W77-IND-B20)                     124840      
003755                 IF W77-RESDIV > B20-SDO-APUIMP                   124900      
003756                    MOVE W77-RESDIV      TO B20-SDO-APUIMP        125000      
003757                 ELSE                                             125100      
003758                    NEXT SENTENCE                                 125200      
003759                                                                  125300      
003760        ELSE                                                      125400      
003761           IF W77-RESDIV > B20-SDO-APUIMP                         125500      
003762              MOVE W77-RESDIV      TO B20-SDO-APUIMP              125600      
003763              MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO            125652      
003764                   B21-SDO-SD(W77-IND-B20)                        125654      
003765           ELSE                                                   125700      
003766              MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO            125800      
003767                   B21-SDO-SD(W77-IND-B20)                        125900      
003768     ELSE                                                         126000      
003769        IF W77-RESDIV > B20-SDO-APUIMP                            126100      
003770           MOVE W77-RESDIV      TO B20-SDO-APUIMP                 126200      
003771           MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO               126252      
003772                B21-SDO-SD(W77-IND-B20)                           126254      
003773        ELSE                                                      126300      
003774           MOVE A02-R01-IMPT OF A02-SORT (W77-I) TO               126400      
003775                B21-SDO-SD(W77-IND-B20).                          126500      
003776                                                                  126600      
003777 310210-VALIDA-CONCEPTO.                                          126700      
003778*=======================                                          126800      
003779     MOVE ZERO                     TO W77-CON-S084-INS15          126900      
003780                                      W77-CON-S408                126950      
003781                                      W77-CON-SISTEMA             127000      
003782                                      W77-CONCEPTO-VALIDO         127100      
003783                                      W77-S084-INS15-MEN.         127200      
003784     IF A02-R01-SIS OF A02-SORT = 84 AND                          127300      
003785       (A02-R01-INS OF A02-SORT = 15 OR                           127400      
003786        A02-R01-INS OF A02-SORT = 17)                             127452      
003787        MOVE W77-J                 TO W77-CON-S084-INS15          127500      
003788        IF W88-CON-S084-INS15                                     127600      
003789           MOVE 1                  TO W77-CONCEPTO-VALIDO         127700      
003790        ELSE                                                      127800      
003791           MOVE W77-J              TO W77-S084-INS15-MEN          127900      
003792     ELSE                                                         128000      
003793     IF A02-R01-SIS OF A02-SORT = 408                             128050      
003794        MOVE W77-J                 TO W77-CON-S408                128055      
003795        IF W88-CON-S408                                           128056      
003796           MOVE 1                  TO W77-CONCEPTO-VALIDO         128057      
003797        ELSE                                                      128058      
003798           MOVE ZERO               TO W77-CONCEPTO-VALIDO         128059      
003799     ELSE                                                         128060      
003800        MOVE W77-J                 TO W77-CON-SISTEMA             128100      
003801        IF W88-CON-SISTEMA                                        128200      
003802           MOVE 1                  TO W77-CONCEPTO-VALIDO.        128300      
003803                                                                  128400      
003804 310220-VALIDA-ENC4.                                              128452      
003805*===================                                              128454      
003806     IF W77-ENCA-4 = 0                                            128456      
003807        IF WKS-NUM-LINEAS = 0                                     128457      
003808           PERFORM 400100-IMPTIT-ERRMES                           128458      
003809        ELSE                                                      128460      
003810           WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-4.            128461      
003811     MOVE 1                        TO W77-ENCA-4.                 128462      
003812                                                                  128500      
003813 310300-SDOS-MESADI.                                              128600      
003814*===================                                              128700      
003815                                                                  128800      
003816     IF W77-RESDIV-ANT = W77-RESDIV                               128900      
003817        NEXT SENTENCE                                             129000      
003818     ELSE                                                         129100      
003819        IF W77-RESDIV-ANT > 0                                     129200      
003820           PERFORM 310400-GRABA-SDOSB21                           129300      
003821*          MOVE W77-RESDIV         TO W77-RESDIV-ANT              129400      
003822           PERFORM 310310-LOCK-B21                                129500      
003823        ELSE                                                      129600      
003824           PERFORM 310310-LOCK-B21.                               129700      
003825     MOVE W77-RESDIV            TO W77-RESDIV-ANT.                129800      
003826                                                                  129852      
003827 310310-LOCK-B21.                                                 129900      
003828*================                                                 130000      
003829     MOVE ZEROS                    TO W77-EOF-MOVCNTDIA.          130100      
003830     LOCK B21SXSDMENCON1 AT                                       130200      
003831          B21-SDO-KEYCON = A02-R01-CNT OF A02-SORT   AND          130252      
003832          B21-SDO-KEYAM  = W77-FECPRO-AAMM           AND          130300      
003833          B21-SDO-KEYPRD = A02-R01-PRD OF A02-SORT   AND          130400      
003834          B21-SDO-KEYINS = A02-R01-INS OF A02-SORT   AND          130500      
003835          B21-SDO-KEYIND = W77-RESDIV                             130600      
003836       ON EXCEPTION                                               130700      
003837          IF DMSTATUS(NOTFOUND)                                   130800      
003838             MOVE 1             TO W77-EOF-MOVCNTDIA              130900      
003839          ELSE                                                    131000      
003840             PERFORM 900000-CHECA-STATUS.                         131100      
003841                                                                  131200      
003842     IF W77-EOF-MOVCNTDIA = 1                                     131300      
003843        CREATE S151B21SDMENCON1                                   131400      
003844        MOVE A02-R01-CNT OF A02-SORT TO B21-SDO-KEYCON            131500      
003845        MOVE W77-FECPRO-AAMM         TO B21-SDO-KEYAM             131600      
003846        MOVE A02-R01-PRD OF A02-SORT TO B21-SDO-KEYPRD            131700      
003847        MOVE A02-R01-INS OF A02-SORT TO B21-SDO-KEYINS            131800      
003848        MOVE W77-RESDIV              TO B21-SDO-KEYIND.           131900      
003849                                                                  132000      
003850 310400-GRABA-SDOSB21.                                            132100      
003851*=====================                                            132200      
003852     STORE S151B21SDMENCON1                                       132300      
003853           ON EXCEPTION                                           132400      
003854              PERFORM 900000-CHECA-STATUS.                        132500      
003855                                                                  132600      
003856                                                                  132700      
003857 311000-CORTECNT-EDOCTA.                                          132800      
003858     MOVE ZEROS                    TO W77-EOF-MOVCNTMES           132900      
003859                                                                  133000      
003860     LOCK B80SXEDOCTA AT B80-SDO-FECCON  = W77-FECHA-PROC         133100      
003861                     AND B80-SDO-KEYCON  =                        133200      
003862                         A02-R01-CNT    OF A02-SORT               133300      
003863                     AND B80-SDO-PRD     =                        133400      
003864                         A02-R01-PRD    OF A02-SORT               133500      
003865                     AND B80-SDO-INS    =                         133600      
003866                         A02-R01-INS    OF A02-SORT               133700      
003867          ON EXCEPTION                                            133800      
003868             IF DMSTATUS(NOTFOUND)                                133900      
003869                MOVE 1             TO W77-EOF-MOVCNTMES           134000      
003870             ELSE                                                 134100      
003871                PERFORM 900000-CHECA-STATUS.                      134200      
003872                                                                  134300      
003873     IF W77-EOF-MOVCNTMES = 1                                     134400      
003874        CREATE S151B80EDOCTA                                      134500      
003875        MOVE W77-FECHA-PROC             TO B80-SDO-FECCON         134600      
003876        MOVE A02-R01-CNT    OF A02-SORT TO B80-SDO-KEYCON         134700      
003877        MOVE A02-R01-PRD    OF A02-SORT TO B80-SDO-PRD            134800      
003878        MOVE A02-R01-INS    OF A02-SORT TO B80-SDO-INS.           134900      
003879     MOVE A02-R01-FECINI    OF A02-SORT TO B80-SDO-FCHINI         135000      
003880     MOVE A02-R01-FECFIN    OF A02-SORT TO B80-SDO-FCHFIN         135100      
003881*    MOVE A02-R01-DIASCICLO OF A02-SORT TO WKS-DIASCICLO          135200      
003882*    MOVE A02-R01-DIASANO   OF A02-SORT TO WKS-DIASANO            135300      
003883*    MOVE A02-R01-TASRENET  OF A02-SORT TO WKS-TASRENET           135400      
003884*    MOVE A02-R01-TASREBRU  OF A02-SORT TO WKS-TASREBRU           135500      
003885*    MOVE A02-R01-TASREANO  OF A02-SORT TO WKS-TASREANO           135600      
003886*    MOVE A02-R01-STATION   OF A02-SORT TO WKS-STATION            135700      
003887*    MOVE A02-R01-CTACON    OF A02-SORT TO WKS-CTACON             135800      
003888*    MOVE A02-R01-MONEDA    OF A02-SORT TO WKS-MONEDA             135900      
003889*    MOVE WKS-EDOCTA                    TO B80-SDO-DATOS          136000      
003890*    MOVE A02-R01-FILXAPL   OF A02-SORT TO B80-SDO-DATOS          136100      
003891     PERFORM 311100-MUEVE-EDOCTA.                                 136200      
003892     STORE S151B80EDOCTA                                          136300      
003893           ON EXCEPTION                                           136400      
003894              PERFORM 900000-CHECA-STATUS.                        136500      
003895 311100-MUEVE-EDOCTA.                                             136550      
003896*====================                                             136552      
003897      MOVE LOW-VALUES                           TO B80-SDO-DATOS  136554      
003898                                                   WKS-EDOCTA.    136555      
003899      IF W77-PARAM-SISTEMA = 84           AND                     136556      
003900        (A02-R01-INS    OF A02-SORT = 15  OR                      136557      
003901         A02-R01-INS    OF A02-SORT = 17  )                       136558      
003902         MOVE A02-R01-FECAPE      OF A02-SORT TO                  136559      
003903              WKS-FECAPE                                          136560      
003904         MOVE A02-R01-FECSIGPAGO  OF A02-SORT TO                  136561      
003905              WKS-FECSIGPAGO                                      136562      
003906         MOVE A02-R01-SORTEO      OF A02-SORT TO                  136563      
003907              WKS-SORTEO                                          136564      
003908         MOVE A02-R01-RESTANTES   OF A02-SORT TO                  136565      
003909              WKS-RESTANTES                                       136566      
003910         MOVE A02-R01-ANTICIPADAS OF A02-SORT TO                  136567      
003911              WKS-ANTICIPADAS                                     136568      
003912         MOVE A02-R01-OPORTUNAS   OF A02-SORT TO                  136569      
003913              WKS-OPORTUNAS                                       136570      
003914         MOVE A02-R01-TOTALES     OF A02-SORT TO                  136571      
003915              WKS-TOTALES                                         136572      
003916         MOVE A02-R01-ATRASOS     OF A02-SORT TO                  136573      
003917              WKS-ATRASOS                                         136574      
003918         MOVE A02-R01-BONOS       OF A02-SORT TO                  136575      
003919              WKS-BONOS                                           136576      
003920         MOVE A02-R01-ESQUEMA     OF A02-SORT TO                  136577      
003921              WKS-ESQUEMA                                         136578      
003922         MOVE A02-R01-MOVEDAAVB   OF A02-SORT TO                  136579      
003923              WKS-MOVEDAAVB                                       136580      
003924      ELSE                                                        136581      
003925      IF W77-PARAM-SISTEMA = 84                                   136582      
003926         MOVE A02-R01-TASNET      OF A02-SORT TO                  136583      
003927              WKS-TASNET                                          136584      
003928         MOVE A02-R01-TASBRU      OF A02-SORT TO                  136585      
003929              WKS-TASBRU                                          136586      
003930         MOVE A02-R01-NETPER      OF A02-SORT TO                  136587      
003931              WKS-NETPER                                          136588      
003932         MOVE A02-R01-NETANU      OF A02-SORT TO                  136589      
003933              WKS-NETANU                                          136590      
003934         MOVE A02-R01-DIASPER     OF A02-SORT TO                  136591      
003935              WKS-DIASPER                                         136592      
003936         MOVE A02-R01-DIASANU     OF A02-SORT TO                  136593      
003937              WKS-DIASANU                                         136594      
003938         MOVE A02-R01-MONS084     OF A02-SORT TO                  136595      
003939              WKS-MONS084                                         136596      
003940       ELSE                                                       136597      
003941       IF W77-PARAM-SISTEMA = 87                                  136598      
003942          MOVE A02-R01-PLAZO      OF A02-SORT TO                  136599      
003943               WKS-PLAZO                                          136600      
003944          MOVE A02-R01-TASS087    OF A02-SORT TO                  136601      
003945               WKS-TASS087                                        136602      
003946          MOVE A02-R01-INSTRUCCIONES OF A02-SORT TO               136603      
003947               WKS-INSTRUCCIONES                                  136604      
003948          MOVE A02-R01-TIPOPER    OF A02-SORT TO                  136605      
003949               WKS-TIPOPER                                        136606      
003950          MOVE A02-R01-FILS087    OF A02-SORT TO                  136607      
003951               WKS-FILS087                                        136608      
003952          MOVE A02-R01-MON        OF A02-SORT TO                  136609      
003953               WKS-MON                                            136610      
003954       ELSE                                                       136611      
003955       IF (W77-PARAM-SISTEMA = 500 OR 555)                        136612      
003956          MOVE A02-R01-DIASCICLO  OF A02-SORT TO                  136613      
003957               WKS-DIASCICLO                                      136614      
003958          MOVE A02-R01-DIASANO    OF A02-SORT TO                  136615      
003959               WKS-DIASANO                                        136616      
003960          MOVE A02-R01-TASRENET   OF A02-SORT TO                  136617      
003961               WKS-TASRENET                                       136618      
003962          MOVE A02-R01-TASREBRU   OF A02-SORT TO                  136619      
003963               WKS-TASREBRU                                       136620      
003964          MOVE A02-R01-TASREANO   OF A02-SORT TO                  136621      
003965               WKS-TASREANO                                       136622      
003966          MOVE A02-R01-STATION    OF A02-SORT TO                  136623      
003967               WKS-STATION                                        136624      
003968          MOVE A02-R01-CTACON     OF A02-SORT TO                  136625      
003969               WKS-CTACON                                         136626      
003970          MOVE A02-R01-MONEDA     OF A02-SORT TO                  136627      
003971               WKS-MONEDA                                         136628      
003972       ELSE                                                       136629      
003973       IF W77-PARAM-SISTEMA = 408                                 136630      
003974          MOVE A02-R01-FECVEN     OF A02-SORT TO                  136632      
003975               WKS-FECVEN                                         136634      
003976          MOVE A02-R01-TASINT     OF A02-SORT TO                  136636      
003977               WKS-TASINT                                         136638      
003978          MOVE A02-R01-DIASBG     OF A02-SORT TO                  136640      
003979               WKS-DIASBG                                         136642      
003980          MOVE A02-R01-LINEA      OF A02-SORT TO                  136644      
003981               WKS-LINEA                                          136646      
003982          MOVE A02-R01-FOLIO      OF A02-SORT TO                  136648      
003983               WKS-FOLIO                                          136650      
003984          MOVE A02-R01-FILS408    OF A02-SORT TO                  136652      
003985               WKS-FILS408.                                       136654      
003986     MOVE WKS-EDOCTA              TO B80-SDO-DATOS.               136656      
003987                                                                  136658      
003988                                                                  136700      
003989 328000-LEE-SORT.                                                 136800      
003990     RETURN A02-SORT AT END MOVE 1 TO W77-EOF.                    136900      
003991                                                                  137000      
003992 329000-PROCESA-BIT.                                              137100      
003993     MOVE ZEROS                    TO B20-SDO-STAMOV              137200      
003994     IF WKS-NUM-LINEAS = 0 OR > 60 AND B20-SDO-KEYCON > 1         137300      
003995        PERFORM 400100-IMPTIT-ERRMES.                             137400      
003996                                                                  137420      
003997     IF B20-SDO-KEYCON > 1                                        137440      
003998     STRING "CONTRATO SIN SALDOS EN S"                            137500      
003999            W77-PARAM-SISTEMA                                     137600      
004000            "   "                                                 137700      
004001     DELIMITED BY SIZE                                            137800      
004002     INTO WKS-D1-LEY                                              137900      
004003                                                                  138000      
004004     ADD 1                         TO WKS-NUMCTO-SNNN             138050      
004005     COMPUTE WKS-IMPCTO-SNNN = WKS-IMPCTO-SNNN + B20-SDO-SD(2)    138060      
004006*    MOVE 1                               TO W77-PRIMERA-VEZ      138100      
004007*    WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-4 AFTER 2           138200      
004008     MOVE B20-SDO-KEYCON                  TO WKS-D1-CNT           138300      
004009                                             W77-SDO-KEYCON       138400      
004010     MOVE B20-SDO-KEYPRD                  TO WKS-D1-PRD           138500      
004011                                             W77-SDO-KEYPRD       138600      
004012     MOVE B20-SDO-KEYINS                  TO WKS-D1-INS           138700      
004013                                             W77-SDO-KEYINS       138800      
004014     MOVE "SALDO ACTUAL"                  TO WKS-D1-CON           138900      
004015     MOVE ZEROS                           TO WKS-D1-SDOS500       139000      
004016     MOVE B20-SDO-SD(2)                   TO WKS-D1-SDOS151       139100      
004017     MOVE ZEROS                           TO W77-EOF-MOVMES       139200      
004018     WRITE R01-REG-REPMES FROM WLI-DETALLE-1                      139300      
004019     ADD 1                         TO WKS-NUM-LINEAS.             139400      
004020                                                                  139460      
004021*    PERFORM 400200-IMP-MOVMES UNTIL W77-EOF-MOVMES = 1.          139500      
004022                                                                  139600      
004023     STORE S151B20SDOMENCON                                       139700      
004024           ON EXCEPTION                                           139800      
004025              PERFORM 900000-CHECA-STATUS.                        139900      
004026                                                                  140000      
004027     LOCK NEXT  B20BXSDOMENCON                                    140100      
004028          ON EXCEPTION                                            140200      
004029             IF DMSTATUS(NOTFOUND)                                140300      
004030                MOVE 1             TO W77-EOF                     140400      
004031             ELSE                                                 140500      
004032                PERFORM 900000-CHECA-STATUS.                      140600      
004033                                                                  140700      
004034                                                                  140800      
004035 400000-IMPERR-CNTMES.                                            140900      
004036     IF W77-J > 0 AND W77-J < 5001                                141000      
004037        MOVE WKS-SDO-INDICE(W77-J)           TO W77-IND-CON       141100      
004038        IF W77-IND-CON > 0 AND < 14                               141200      
004039           IF WKS-NUM-LINEAS = 0 OR > 60                          141300      
004040              PERFORM 400100-IMPTIT-ERRMES                        141400      
004041              PERFORM 400050-IMPDET-ERRMES                        141500      
004042           ELSE                                                   141600      
004043              PERFORM 400050-IMPDET-ERRMES.                       141700      
004044                                                                  141800      
004045 400050-IMPDET-ERRMES.                                            141900      
004046*=====================                                            142000      
004047*    MOVE 1                               TO W77-PRIMERA-VEZ.     142100      
004048                                                                  142200      
004049     MOVE A02-R01-CNT    OF A02-SORT      TO WKS-D1-CNT           142300      
004050                                             W77-SDO-KEYCON.      142400      
004051     MOVE A02-R01-PRD    OF A02-SORT      TO WKS-D1-PRD           142500      
004052                                             W77-SDO-KEYPRD.      142600      
004053     MOVE A02-R01-INS    OF A02-SORT      TO WKS-D1-INS           142700      
004054                                             W77-SDO-KEYINS.      142800      
004055     MOVE WKS-SDOS-LEY(W77-J)             TO WKS-D1-CON.          142900      
004056     MOVE A02-R01-IMPT OF A02-SORT (W77-IND-CON)                  143000      
004057                                          TO WKS-D1-SDOS500.      143100      
004058     IF W77-J < 11                                                143200      
004059        IF W77-IND-B20 > 0 AND W77-IND-B20 < 11                   143300      
004060           MOVE B20-SDO-SD(W77-IND-B20)   TO WKS-D1-SDOS151       143400      
004061        ELSE                                                      143500      
004062           MOVE ZERO                      TO WKS-D1-SDOS151       143600      
004063     ELSE                                                         143700      
004064        IF W77-IND-B20 > 0 AND W77-IND-B20 < 13                   143800      
004065           MOVE B21-SDO-SD(W77-IND-B20)   TO WKS-D1-SDOS151       143900      
004066        ELSE                                                      144000      
004067           MOVE ZERO                      TO WKS-D1-SDOS151.      144100      
004068                                                                  144200      
004069     MOVE ZEROS                           TO W77-EOF-MOVMES       144300      
004070     WRITE R01-REG-REPMES FROM WLI-DETALLE-1                      144400      
004071     ADD 1                         TO WKS-NUM-LINEAS.             144500      
004072*    PERFORM 400200-IMP-MOVMES UNTIL W77-EOF-MOVMES = 1.          144600      
004073                                                                  144700      
004074                                                                  144800      
004075 400100-IMPTIT-ERRMES.                                            144900      
004076     ADD 1                         TO W77-NUM-PAG                 145000      
004077     MOVE W77-NUM-PAG              TO WLI-ENC1-PAG                145100      
004078     MOVE "S151-P178-002S151ERRSAL" TO WLI-DESCRIP-REP            145200      
004079     WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-1 AFTER PAGE        145300      
004080     WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-2                   145400      
004081     WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-3.                  145500      
004082     WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-4.                  145552      
004083     MOVE 3                        TO WKS-NUM-LINEAS.             145600      
004084                                                                  145700      
004085                                                                  145800      
004086 400200-IMP-MOVMES.                                               145900      
004087     MOVE ZEROS                    TO W77-EOF-MOVMES              146000      
004088     FIND FIRST B01SXMOVCTO AT B01-MOV-FECCON = W77-FECHA-PROC AND146100      
004089                               B01-MOV-KEYCON = W77-SDO-KEYCON    146154      
004090          ON EXCEPTION                                            146200      
004091             IF DMSTATUS(NOTFOUND)                                146300      
004092                MOVE 1             TO W77-EOF-MOVMES              146400      
004093             ELSE                                                 146500      
004094                PERFORM 900000-CHECA-STATUS.                      146600      
004095     MOVE ZEROS                    TO W77-IMP-MOV                 146700      
004096     IF W77-EOF-MOVMES = ZEROS                                    146800      
004097        IF B01-MOV-PRD = W77-SDO-KEYPRD AND                       146900      
004098           B01-MOV-INS = W77-SDO-KEYINS                           147000      
004099           WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2     147100      
004100           ADD  2     TO WKS-NUM-LINEAS                           147200      
004101           MOVE 1                  TO W77-IMP-MOV                 147300      
004102           PERFORM 400300-IMP-MOVMES UNTIL W77-EOF-MOVMES = 1     147400      
004103        ELSE                                                      147500      
004104           PERFORM 400300-IMP-MOVMES UNTIL W77-EOF-MOVMES = 1.    147600      
004105     MOVE ZEROS                    TO W77-EOF-MOVMES              147700      
004106                                      W77-IMP-MOV                 147800      
004107     FIND FIRST B51SXMOVCTO AT B51-MOV-FECCON = W77-FECHA-PROC AND147900      
004108                               B51-MOV-KEYCON = W77-SDO-KEYCON    147952      
004109          ON EXCEPTION                                            148000      
004110             IF DMSTATUS(NOTFOUND)                                148100      
004111                MOVE 1             TO W77-EOF-MOVMES              148200      
004112             ELSE                                                 148300      
004113                PERFORM 900000-CHECA-STATUS.                      148400      
004114     IF W77-EOF-MOVMES = ZEROS                                    148500      
004115        WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2        148600      
004116        ADD  2     TO WKS-NUM-LINEAS                              148700      
004117        PERFORM 400400-IMP-MOVERRMES UNTIL W77-EOF-MOVMES = 1.    148800      
004118                                                                  148900      
004119                                                                  149000      
004120 400300-IMP-MOVMES.                                               149100      
004121     IF B01-MOV-PRD = W77-SDO-KEYPRD AND                          149200      
004122        B01-MOV-INS = W77-SDO-KEYINS                              149300      
004123        MOVE 1                  TO W77-IMP-MOV.                   149400      
004124                                                                  149500      
004125     MOVE B01-MOV-CVETRA OF MOVDB  TO WKS-D2-CVETRA               149600      
004126     MOVE B01-MOV-SUCOPE           TO WKS-D2-SUCOPE               149700      
004127     MOVE B01-MOV-CAJOPE           TO WKS-D2-CAJOPE               149800      
004128     MOVE B01-MOV-IMP    OF MOVDB  TO WKS-D2-IMP                  149900      
004129     MOVE B01-MOV-FECMOV           TO WKS-D2-FECMOV               150000      
004130     MOVE B01-MOV-FECCON           TO WKS-D2-FECCON               150100      
004131     MOVE B01-MOV-FECVAL           TO WKS-D2-FECVAL               150200      
004132     MOVE B01-MOV-AUTORI           TO WKS-D2-AUTORI               150300      
004133     MOVE B01-MOV-AUT3ERNIV        TO WKS-D2-AUT3ERNIV            150400      
004134     MOVE B01-MOV-AUTS151 OF MOVDB TO WKS-D2-AUTS151              150500      
004135     MOVE B01-MOV-SEC              TO WKS-D2-SEC                  150600      
004136     MOVE B01-MOV-STAMOV           TO WKS-D2-STAMOV               150700      
004137     IF W77-IMP-MOV = 1                                           150800      
004138        IF WKS-NUM-LINEAS = 0 OR > 60                             150900      
004139           PERFORM 400100-IMPTIT-ERRMES                           151000      
004140           WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2     151100      
004141           ADD  2    TO WKS-NUM-LINEAS.                           151200      
004142     IF W77-IMP-MOV = 1                                           151300      
004143        ADD 1                         TO WKS-NUM-LINEAS           151400      
004144        WRITE R01-REG-REPMES FROM WLI-DETALLE-2.                  151500      
004145                                                                  151600      
004146     IF W77-IMP-MOV = 1                                           151700      
004147        FIND B02SXIMPADICIC AT B02-MOV-SEC = B01-MOV-SEC          151800      
004148             ON EXCEPTION                                         151900      
004149                IF DMSTATUS(NOTFOUND)                             152000      
004150                   MOVE 1             TO W77-EOF-MOVMES           152100      
004151                ELSE                                              152200      
004152                   PERFORM 900000-CHECA-STATUS.                   152300      
004153     IF W77-IMP-MOV = 1                                           152400      
004154        IF W77-EOF-MOVMES = ZEROS                                 152500      
004155           PERFORM 400310-IMPADI-MOVMES VARYING W77-J FROM 1 BY 1 152600      
004156                                           UNTIL W77-J > 4.       152700      
004157     MOVE ZEROS                    TO W77-EOF-MOVMES              152800      
004158                                      W77-IMP-MOV                 152900      
004159     FIND NEXT  B01SXMOVCTO AT B01-MOV-FECCON = W77-FECHA-PROC AND153000      
004160                               B01-MOV-KEYCON = W77-SDO-KEYCON    153054      
004161          ON EXCEPTION                                            153100      
004162             IF DMSTATUS(NOTFOUND)                                153200      
004163                MOVE 1             TO W77-EOF-MOVMES              153300      
004164           ELSE                                                   153400      
004165              PERFORM 900000-CHECA-STATUS.                        153500      
004166                                                                  153600      
004167                                                                  153700      
004168 400310-IMPADI-MOVMES.                                            153800      
004169     IF B02-MOV-CVETRA OF MOVDB (W77-J) > ZEROS                   153900      
004170        MOVE B02-MOV-CVETRA OF MOVDB (W77-J) TO WKS-D2-CVETRA     154000      
004171        MOVE B02-MOV-IMP    OF MOVDB (W77-J) TO WKS-D2-IMP        154100      
004172        MOVE B01-MOV-SUCOPE           TO WKS-D2-SUCOPE            154200      
004173        MOVE B01-MOV-CAJOPE           TO WKS-D2-CAJOPE            154300      
004174        MOVE B01-MOV-FECMOV           TO WKS-D2-FECMOV            154400      
004175        MOVE B01-MOV-FECCON           TO WKS-D2-FECCON            154500      
004176        MOVE B01-MOV-FECVAL           TO WKS-D2-FECVAL            154600      
004177        MOVE ZEROS                    TO WKS-D2-AUTORI            154700      
004178                                         WKS-D2-AUT3ERNIV         154800      
004179                                         WKS-D2-AUTS151           154900      
004180                                         WKS-D2-SEC               155000      
004181                                         WKS-D2-STAMOV            155100      
004182        ADD 1                         TO WKS-NUM-LINEAS           155200      
004183        WRITE R01-REG-REPMES FROM WLI-DETALLE-2                   155300      
004184        IF WKS-NUM-LINEAS = 0 OR > 60                             155400      
004185           PERFORM 400100-IMPTIT-ERRMES                           155500      
004186           WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2     155600      
004187           ADD 2          TO WKS-NUM-LINEAS.                      155700      
004188                                                                  155800      
004189                                                                  155900      
004190 400400-IMP-MOVERRMES.                                            156000      
004191     MOVE B51-MOV-CVETRA           TO WKS-D2-CVETRA               156100      
004192     MOVE B51-MOV-SUCOPE           TO WKS-D2-SUCOPE               156200      
004193     MOVE B51-MOV-CAJOPE           TO WKS-D2-CAJOPE               156300      
004194     MOVE B51-MOV-IMP              TO WKS-D2-IMP                  156400      
004195     MOVE B51-MOV-FECMOV           TO WKS-D2-FECMOV               156500      
004196     MOVE B51-MOV-FECCON           TO WKS-D2-FECCON               156600      
004197     MOVE B51-MOV-FECVAL           TO WKS-D2-FECVAL               156700      
004198     MOVE B51-MOV-AUTORI           TO WKS-D2-AUTORI               156800      
004199     MOVE B51-MOV-AUT3ERNIV        TO WKS-D2-AUT3ERNIV            156900      
004200     MOVE B51-MOV-AUTS151          TO WKS-D2-AUTS151              157000      
004201     MOVE B51-MOV-SEC              TO WKS-D2-SEC                  157100      
004202     MOVE B51-MOV-STAMOV           TO WKS-D2-STAMOV               157200      
004203     IF WKS-NUM-LINEAS = 0 OR > 60                                157300      
004204        PERFORM 400100-IMPTIT-ERRMES                              157400      
004205        WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2        157500      
004206        ADD 2     TO WKS-NUM-LINEAS.                              157600      
004207     ADD 1                         TO WKS-NUM-LINEAS              157700      
004208     WRITE R01-REG-REPMES FROM WLI-DETALLE-2.                     157800      
004209                                                                  157900      
004210     FIND B52SXIMPADIERR AT B52-MOV-SEC = B51-MOV-SEC             158000      
004211          ON EXCEPTION                                            158100      
004212             IF DMSTATUS(NOTFOUND)                                158200      
004213                MOVE 1             TO W77-EOF-MOVMES              158300      
004214             ELSE                                                 158400      
004215                PERFORM 900000-CHECA-STATUS.                      158500      
004216     IF W77-EOF-MOVMES = ZEROS                                    158600      
004217        PERFORM 400210-IMPADI-MOVMES VARYING W77-J FROM 1 BY 1    158700      
004218                                       UNTIL W77-J > 4.           158800      
004219     MOVE ZEROS                    TO W77-EOF-MOVMES              158900      
004220                                                                  159000      
004221     FIND NEXT  B51SXMOVCTO AT B51-MOV-FECCON = W77-FECHA-PROC AND159100      
004222                               B51-MOV-KEYCON = W77-SDO-KEYCON    159200      
004223          ON EXCEPTION                                            159300      
004224             IF DMSTATUS(NOTFOUND)                                159400      
004225                MOVE 1             TO W77-EOF-MOVMES              159500      
004226           ELSE                                                   159600      
004227              PERFORM 900000-CHECA-STATUS.                        159700      
004228                                                                  159800      
004229                                                                  159900      
004230 400210-IMPADI-MOVMES.                                            160000      
004231     IF B52-MOV-CVETRA(W77-J) > ZEROS                             160100      
004232        MOVE B52-MOV-CVETRA (W77-J)   TO WKS-D2-CVETRA            160200      
004233        MOVE B52-MOV-IMP (W77-J)      TO WKS-D2-IMP               160300      
004234        MOVE B51-MOV-SUCOPE           TO WKS-D2-SUCOPE            160400      
004235        MOVE B51-MOV-CAJOPE           TO WKS-D2-CAJOPE            160500      
004236        MOVE B51-MOV-FECMOV           TO WKS-D2-FECMOV            160600      
004237        MOVE B51-MOV-FECCON           TO WKS-D2-FECCON            160700      
004238        MOVE B51-MOV-FECVAL           TO WKS-D2-FECVAL            160800      
004239        MOVE ZEROS                    TO WKS-D2-AUTORI            160900      
004240                                         WKS-D2-AUT3ERNIV         161000      
004241                                         WKS-D2-AUTS151           161100      
004242                                         WKS-D2-SEC               161200      
004243                                         WKS-D2-STAMOV            161300      
004244        ADD 1                         TO WKS-NUM-LINEAS           161400      
004245        WRITE R01-REG-REPMES FROM WLI-DETALLE-2                   161500      
004246        IF WKS-NUM-LINEAS = 0 OR > 60                             161600      
004247           PERFORM 400100-IMPTIT-ERRMES                           161700      
004248           WRITE R01-REG-REPMES FROM WLI-ENCABEZADO-5 AFTER 2     161800      
004249           ADD 2     TO WKS-NUM-LINEAS.                           161900      
004250                                                                  162000      
004251                                                                  162100      
004252 400999-EXIT.                                                     162200      
004253     EXIT.                                                        162300      
004254                                                                  162400      
004255                                                                  162500      
004256 410000-ORDENA-REGEDOCTA SECTION.                                 162600      
004257 410000-REGEDOCTA.                                                162700      
004258                                                                  162800      
004259     OPEN INPUT  A01-SDOENT                                       162900      
004260*****MOVE ZEROS                    TO W77-EOF                     163000      
004261     MOVE 1                        TO W77-EOF                     163100      
004262*****PERFORM 5000000-LEE-SDOS 2 TIMES                             163200      
004263*****PERFORM 410100-PROCESA UNTIL W77-EOF = 1.                    163300      
004264     GO TO 419999-EXIT.                                           163400      
004265                                                                  163500      
004266 410100-PROCESA.                                                  163600      
004267     IF A02-R00-TIPO-REG OF A01-SDOENT = 81                       163700      
004268        IF A02-R01-EDOCTA OF A01-SDOENT = 1     AND               163800      
004269           A02-R01-FECINI OF A01-SDOENT > ZEROS AND               163900      
004270           A02-R01-FECFIN OF A01-SDOENT > ZEROS                   164000      
004271           MOVE CORR A02-R00-SALDOS OF A01-SDOENT TO              164100      
004272                     A02-R00-SALDOS OF A03-SORT                   164200      
004273           RELEASE A02-R00-SALDOS  OF A03-SORT.                   164300      
004274     PERFORM 5000000-LEE-SDOS.                                    164400      
004275                                                                  164500      
004276                                                                  164600      
004277 419999-EXIT.                                                     164700      
004278     EXIT.                                                        164800      
004279                                                                  164900      
004280                                                                  165000      
004281 420000-GRABA-BDEDOCTA SECTION.                                   165100      
004282 420000-BDEDOCTA.                                                 165200      
004283                                                                  165300      
004284*****MOVE ZEROS                    TO W77-EOF                     165400      
004285     MOVE 1                        TO W77-EOF                     165500      
004286*****PERFORM 428000-LEE-SORT                                      165600      
004287*****PERFORM 411000-PROCESA UNTIL W77-EOF = 1.                    165700      
004288     GO TO 429999-EXIT.                                           165800      
004289                                                                  165900      
004290                                                                  166000      
004291 411000-PROCESA.                                                  166100      
004292     MOVE A02-R01-SUCPRO OF A03-SORT  TO W77-NUM-SUCPRO.          166200      
004293*    MOVE ZEROS                    TO W77-EXI-SUCPRO              166300      
004294*    LOCK B81SXSUCEDOCTA AT B81-SDO-FECCON = W77-FECHA-PROC       166400      
004295*                  AND B81-SDO-KEYSUC = A02-R01-SUCPRO OF A03-SORT166500      
004296*                  AND B81-SDO-PRD    = A02-R01-PRD    OF A03-SORT166600      
004297*                  AND B81-SDO-INS    = A02-R01-INS    OF A03-SORT166700      
004298*         ON EXCEPTION                                            166800      
004299*            IF DMSTATUS(NOTFOUND)                                166900      
004300*               MOVE 1             TO W77-EXI-SUCPRO              167000      
004301*            ELSE                                                 167100      
004302*               PERFORM 900000-CHECA-STATUS.                      167200      
004303*    IF W77-EXI-SUCPRO = 1                                        167300      
004304*       CREATE S151B81SUCEDOCTA                                   167400      
004305*       MOVE W77-FECHA-PROC                TO B81-SDO-FECCON      167500      
004306*       MOVE A02-R01-SUCPRO OF A03-SORT    TO B81-SDO-KEYSUC      167600      
004307*       MOVE A02-R01-PRD    OF A03-SORT    TO B81-SDO-PRD         167700      
004308*       MOVE A02-R01-INS    OF A03-SORT    TO B81-SDO-INS.        167800      
004309*    PERFORM 411100-ADD-SUC UNTIL A02-R01-SUCPRO OF A03-SORT NOT =167900      
004310*                                 W77-NUM-SUCPRO OR W77-EOF = 1.  168000      
004311*    STORE S151B81SUCEDOCTA                                       168100      
004312*          ON EXCEPTION                                           168200      
004313*             PERFORM 900000-CHECA-STATUS.                        168300      
004314                                                                  168400      
004315 411100-ADD-SUC.                                                  168500      
004316*    ADD 1                         TO B81-SDO-TOT                 168600      
004317     PERFORM 428000-LEE-SORT.                                     168700      
004318                                                                  168800      
004319                                                                  168900      
004320 428000-LEE-SORT.                                                 169000      
004321     RETURN A03-SORT AT END MOVE 1 TO W77-EOF.                    169100      
004322*    IF W77-EOF = ZEROS                                           169200      
004323*       ADD 1                      TO W77-CON-SORT3               169300      
004324*                                     W77-LEI-SORT3               169400      
004325*       IF W77-CON-SORT3 = 50000                                  169500      
004326*          DISPLAY "REGISTROS LEIDOS "W77-LEI-SORT3               169600      
004327*          MOVE ZEROS              TO W77-CON-SORT3               169700      
004328*       ELSE                                                      169800      
004329*          NEXT SENTENCE                                          169900      
004330*    ELSE                                                         170000      
004331*       DISPLAY "TOTAL DE REGISTROS SORT3 "W77-LEI-SORT3.         170100      
004332                                                                  170200      
004333                                                                  170300      
004334 429999-EXIT.                                                     170400      
004335     EXIT.                                                        170500      
004336                                                                  170600      
004337                                                                  170700      
004338 5000000-LEE-SDOS SECTION.                                        170800      
004339 5000000-SDOS.                                                    170900      
004340     READ A01-SDOENT AT END MOVE 1 TO W77-EOF.                    171000      
004341     IF W77-EOF = ZEROS                                           171100      
004342        ADD 1              TO W77-CON-REG                         171200      
004343        IF A02-R00-TIPO-REG OF A01-SDOENT = 82                    171300      
004344           MOVE 1             TO W77-EOF                          171400      
004345        ELSE                                                      171420      
004346           IF W77-PARAM-SISTEMA = 87                              171440      
004347              PERFORM 5001000-PLAZOS.                             171450      
004348     GO TO 5999999-EXIT.                                          171460      
004349 5001000-PLAZOS.                                                  171461      
004350*===============                                                  171462      
004351     IF A02-R01-INS OF A01-SDOENT = 4 OR 7                        171463      
004352        IF A02-R01-PRD OF A01-SDOENT > 0 AND < 7                  171464      
004353           MOVE 1         TO A02-R01-PRD OF A01-SDOENT            171465      
004354        ELSE                                                      171466      
004355        IF A02-R01-PRD OF A01-SDOENT > 6 AND < 14                 171467      
004356           MOVE 7         TO A02-R01-PRD OF A01-SDOENT            171468      
004357        ELSE                                                      171469      
004358        IF A02-R01-PRD OF A01-SDOENT > 13 AND < 21                171470      
004359           MOVE 14        TO A02-R01-PRD OF A01-SDOENT            171471      
004360        ELSE                                                      171472      
004361        IF A02-R01-PRD OF A01-SDOENT > 20 AND < 28                171473      
004362           MOVE 21        TO A02-R01-PRD OF A01-SDOENT            171474      
004363        ELSE                                                      171475      
004364        IF A02-R01-PRD OF A01-SDOENT > 27 AND < 42                171476      
004365           MOVE 28        TO A02-R01-PRD OF A01-SDOENT            171477      
004366        ELSE                                                      171478      
004367        IF A02-R01-PRD OF A01-SDOENT > 41 AND < 63                171479      
004368           MOVE 42        TO A02-R01-PRD OF A01-SDOENT            171480      
004369        ELSE                                                      171481      
004370        IF A02-R01-PRD OF A01-SDOENT > 62 AND < 91                171482      
004371           MOVE 63        TO A02-R01-PRD OF A01-SDOENT            171483      
004372        ELSE                                                      171484      
004373        IF A02-R01-PRD OF A01-SDOENT > 90 AND < 182               171485      
004374           MOVE 91        TO A02-R01-PRD OF A01-SDOENT            171486      
004375        ELSE                                                      171487      
004376        IF A02-R01-PRD OF A01-SDOENT > 181 AND < 273              171488      
004377           MOVE 182       TO A02-R01-PRD OF A01-SDOENT            171489      
004378        ELSE                                                      171490      
004379        IF A02-R01-PRD OF A01-SDOENT > 272 AND < 378              171491      
004380           MOVE 273       TO A02-R01-PRD OF A01-SDOENT            171492      
004381        ELSE                                                      171493      
004382           MOVE 378       TO A02-R01-PRD OF A01-SDOENT            171494      
004383     ELSE                                                         171499      
004384        IF A02-R01-INS OF A01-SDOENT = 3 OR 5                     171504      
004385           IF A02-R01-PRD OF A01-SDOENT > 89 AND < 120            171509      
004386              MOVE 90        TO A02-R01-PRD OF A01-SDOENT         171514      
004387           ELSE                                                   171519      
004388           IF A02-R01-PRD OF A01-SDOENT > 119 AND < 150           171524      
004389              MOVE 120       TO A02-R01-PRD OF A01-SDOENT         171529      
004390           ELSE                                                   171534      
004391           IF A02-R01-PRD OF A01-SDOENT > 149 AND < 180           171539      
004392              MOVE 150       TO A02-R01-PRD OF A01-SDOENT         171544      
004393           ELSE                                                   171549      
004394           IF A02-R01-PRD OF A01-SDOENT > 179 AND < 368           171554      
004395              MOVE 180       TO A02-R01-PRD OF A01-SDOENT         171559      
004396           ELSE                                                   171564      
004397           IF A02-R01-PRD OF A01-SDOENT > 369 AND < 720           171569      
004398              MOVE 370       TO A02-R01-PRD OF A01-SDOENT         171574      
004399           ELSE                                                   171579      
004400              MOVE 720       TO A02-R01-PRD OF A01-SDOENT         171584      
004401     ELSE                                                         171589      
004402        IF A02-R01-INS OF A01-SDOENT = 1                          171594      
004403           IF A02-R01-PRD OF A01-SDOENT > 0 AND < 7               171599      
004404              MOVE 1         TO A02-R01-PRD OF A01-SDOENT         171604      
004405           ELSE                                                   171609      
004406           IF A02-R01-PRD OF A01-SDOENT > 6 AND < 14              171614      
004407              MOVE 7         TO A02-R01-PRD OF A01-SDOENT         171619      
004408           ELSE                                                   171624      
004409           IF A02-R01-PRD OF A01-SDOENT > 13 AND < 30             171629      
004410              MOVE 14        TO A02-R01-PRD OF A01-SDOENT         171634      
004411           ELSE                                                   171639      
004412           IF A02-R01-PRD OF A01-SDOENT > 29 AND < 60             171644      
004413              MOVE 30        TO A02-R01-PRD OF A01-SDOENT         171649      
004414           ELSE                                                   171654      
004415           IF A02-R01-PRD OF A01-SDOENT > 59 AND < 91             171659      
004416              MOVE 60        TO A02-R01-PRD OF A01-SDOENT         171664      
004417           ELSE                                                   171669      
004418           IF A02-R01-PRD OF A01-SDOENT > 90 AND < 120            171674      
004419              MOVE 91        TO A02-R01-PRD OF A01-SDOENT         171679      
004420           ELSE                                                   171684      
004421           IF A02-R01-PRD OF A01-SDOENT > 119 AND < 180           171686      
004422              MOVE 120       TO A02-R01-PRD OF A01-SDOENT         171688      
004423           ELSE                                                   171690      
004424              MOVE 180       TO A02-R01-PRD OF A01-SDOENT.        171692      
004425 5999999-EXIT.                                                    171700      
004426     EXIT.                                                        171800      
004427                                                                  171900      
004428                                                                  172000      
004429 999999-FIN SECTION.                                              172100      
004430 999999-OUT.                                                      172200      
004431                                                                  172300      
004432     IF W77-EOF = 1                                               172400      
004433        CLOSE SDODB                                               172500      
004434              ON EXCEPTION                                        172600      
004435                 PERFORM 900000-CHECA-STATUS.                     172700      
004436     IF W77-EOF = 1                                               172800      
004437        CLOSE MOVDB                                               172900      
004438              ON EXCEPTION                                        173000      
004439                 PERFORM 900000-CHECA-STATUS.                     173100      
004440                                                                  173200      
004441     IF W77-EOF = 1                                               173300      
004442        IF WKS-B05-STAPGM = 1                                     173305      
004443             NEXT SENTENCE                                        173310      
004444        ELSE                                                      173315      
004445             CLOSE A01-SDOENT                                     173400      
004446                   R02-REPPOS WITH SAVE                           173500      
004447                  IF W77-PARAM-SISTEMA= 500                       173550      
004448                      CLOSE R01-REPMES WITH SAVE.                 173600      
004449                                                                  173700      
004450     IF W77-EOF = 1                                               173800      
004451        MOVE ZEROS                TO W77-STATUS                   173900      
004452        MOVE W77-PARAM-SISTEMA    TO WKS-B03F09-SISTEMA           174000      
004453        MOVE 9                    TO WKS-B03F09-FUNCION           174100      
004454        MOVE 5                    TO WKS-B03F09-STABDSAL          174200      
004455       CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN-F09174300      
004456                                       GIVING W77-STATUS.         174400      
004457     IF W77-EOF = 1                                               174500      
004458        IF W77-STATUS > 0                                         174600      
004459           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       174651      
004460           MOVE "E"            TO      TIPO-LJ                    174700      
004461           MOVE 020901         TO      CODIGO-LJ                  174800      
004462           STRING "ERROR AL ACTUALIZAR LIB-CONTROL STATUS FIN : ",174900      
004463                            W77-STATUS                            175000      
004464           DELIMITED BY SIZE INTO TEXTO-LJ                        175100      
004465           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                175151      
004466           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               175171      
004467           PERFORM  000-030-IMPRIME-MENSAJE                       175191      
004468           PERFORM 999999-DESPLIEGA                               175200      
004469           SET MYSELF(STATUS)  TO  -1.                            175300      
004470                                                                  175400      
004471     CLOSE V00-REPORTE2.                                          175451      
004472**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                175455      
004473     IF W77-VALUE = 0                                             175459      
004474           PERFORM 0101200-ACTUALIZA-B05.                         175463      
004475**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                175467      
004476     STOP RUN.                                                    175500      
004477                                                                  175600      
004478                                                                  175700      
004479 999999-EXIT.                                                     175800      
004480     EXIT.                                                        175900      
004481                                                                  176000      
004482                                                                  176100      
004483*=================================================================176200      
004484*==         RUTINA DE VERIFICACION DE ERRORES DE DMSII         ===176300      
004485*=================================================================176400      
004486                                                                  176500      
004487                                                                  176600      
004488 900000-CHECA-STATUS SECTION.                                     176700      
004489 900010-CHECA.                                                    176800      
004490     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        176900      
004491     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-TIPOERR-DMSII    177000      
004492     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-STRUCTU-DMSII    177100      
004493     IF WKS-ERR-DMSII > ZEROS                                     177200      
004494        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          177251      
004495        MOVE "E"          TO      TIPO-LJ                         177300      
004496        MOVE  010101      TO      CODIGO-LJ                       177400      
004497        STRING "BASE DATOS : ", WKS-NOM-BDERR-DMSII               177500      
004498               "ERROR EN BD: ", WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)  177600      
004499                           " "  WKS-ERR-DMSII                     177700      
004500               "TIPO       : ", WKS-TIPOERR-DMSII                 177800      
004501               "ESTRUCTURA : ", WKS-STRUCTU-DMSII                 177900      
004502        DELIMITED BY SIZE INTO TEXTO-LJ                           178000      
004503        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   178051      
004504        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  178071      
004505        PERFORM  000-030-IMPRIME-MENSAJE                          178091      
004506        PERFORM 999999-DESPLIEGA.                                 178100      
004507                                                                  178200      
004508                                                                  178300      
004509 910000-EXIT.                                                     178400      
004510     EXIT.                                                        178500      
004511                                                                  178600      
004512                                                                  178700      
004513 999999-DESPLIEGA.                                                178800      
004514*=================                                                178900      
004515                                                                  179000      
004516     CALL "LJ IN LIB-DISP"                                        179100      
004517              USING CONTADOR-LJ, MENSAJE-LJ.                      179200      
004518                                                                  179300      
004519                                                                  179400      
004520*INICIA CODIGO DE RENOVACION CRONOS 2000                          179401      
004521 A2K-CPY-SECTION SECTION.                                         179402      
004522*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
004523*          COPY "S151/CRONOS2K/CPY/PD".                           179403      
004524** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
004525** Unisys has defined for CRONOS2K project                     ** 000200      
004526** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
004527***************************************************************** 000400      
004528***************************************************************** 000600      
004529** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
004530** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
004531** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
004532** date MMDDCCAA, which is returned into the variable          ** 001000      
004533** A2K-FEC-MDCA-001.                                           ** 001100      
004534***************************************************************** 001200      
004535                                                                  001300      
004536 A2K-ACCEPT-TODAYS-DATE.                                          001400      
004537        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
004538*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
004539        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
004540        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
004541        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
004542        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
004543        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
004544                                                                  002200      
004545 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
004546        EXIT.                                                     002240      
004547                                                                  002500      
004548****************************************************************  002600      
004549** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
004550**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
004551**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
004552**baseyear to add the century to the year part.               **  003000      
004553**INPUT is A2K-FEC-AMD-001                                    **  003100      
004554**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
004555****************************************************************  003300      
004556                                                                  003400      
004557 A2K-CONV-AMD-TO-CAMD.                                            003500      
004558         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
004559         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
004560         IF A2K-FEC-AMD-001 = 0                                   003720      
004561            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
004562         ELSE                                                     003741      
004563          IF A2K-FEC-AMD-001 = 999999                             003742      
004564             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
004565         ELSE                                                     003760      
004566         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
004567                 A2K-OBTAIN-CENTURY-EXIT                          003900      
004568         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
004569         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
004570         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
004571         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
004572                                                                  004400      
004573 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
004574         EXIT.                                                    004600      
004575                                                                  004700      
004576******************************************************************004800      
004577**A2K-CONV-MDA-TO-MDCA.                                         **004900      
004578**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
004579** an eight digit format as MMDDCCAA. It use a                  **005100      
004580** baseyear to add century to the yaer.                         **005200      
004581** INPUT is A2K-FEC-MDA-001                                     **005300      
004582** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
004583                                                                  005500      
004584 A2K-CONV-MDA-TO-MDCA.                                            005600      
004585     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
004586     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
004587     IF A2K-FEC-MDA-001 = 0                                       005820      
004588        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
004589     ELSE                                                         005845      
004590      IF A2K-FEC-MDA-001 = 999999                                 005850      
004591         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
004592     ELSE                                                         005860      
004593     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
004594             A2K-OBTAIN-CENTURY-EXIT                              006000      
004595     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
004596     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
004597     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
004598     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
004599                                                                  006500      
004600 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
004601     EXIT.                                                        006700      
004602                                                                  006800      
004603***************************************************************** 006900      
004604**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
004605**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
004606**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
004607**baseyear to add century to the year.                         ** 007300      
004608**INPUT is A2K-FEC-DMA-001                                     ** 007400      
004609**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
004610                                                                  007600      
004611 A2K-CONV-DMA-TO-DMCA.                                            007700      
004612       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
004613       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
004614       IF  A2K-FEC-DMA-001   = 0                                  007920      
004615          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
004616       ELSE                                                       007945      
004617        IF A2K-FEC-DMA-001 = 999999                               007950      
004618          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
004619       ELSE                                                       007960      
004620       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
004621               A2K-OBTAIN-CENTURY-EXIT                            008100      
004622       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
004623       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
004624       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
004625       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
004626                                                                  008600      
004627 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
004628       EXIT.                                                      008800      
004629                                                                  008900      
004630***************************************************************** 009000      
004631** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
004632** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
004633** a 6 digit format as AAMMDD.                                 ** 009300      
004634** It simply removes the century information in the output     ** 009400      
004635** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
004636** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
004637                                                                  009700      
004638 A2K-CONV-CAMD-TO-AMD.                                            009800      
004639     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
004640     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
004641     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
004642     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
004643                                                                  010300      
004644 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
004645      EXIT.                                                       010500      
004646                                                                  010600      
004647******************************************************************010700      
004648******************************************************************010800      
004649** A2K-CONV-MDCA-TO-MDA.                                        **010900      
004650** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
004651** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
004652** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
004653** INPUT is A2K-FEC-MDCA-001                                    **011300      
004654** OUTPUT is A2K-FEC-MDA-001                                    **011400      
004655                                                                  011500      
004656 A2K-CONV-MDCA-TO-MDA.                                            011600      
004657     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
004658     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
004659     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
004660     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
004661                                                                  012100      
004662 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
004663      EXIT.                                                       012300      
004664                                                                  012400      
004665******************************************************************012500      
004666***************************************************************** 012600      
004667** A2K-CONV-DMCA-TO-DMA.                                        **012700      
004668** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
004669** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
004670** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
004671** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
004672** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
004673                                                                  013300      
004674 A2K-CONV-DMCA-TO-DMA.                                            013400      
004675     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
004676     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
004677     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
004678     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
004679                                                                  013900      
004680 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
004681      EXIT.                                                       014100      
004682                                                                  014200      
004683***************************************************************** 014300      
004684 A2K-CONV-MDCA-TO-CAMD.                                           014400      
004685      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
004686      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
004687      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
004688      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
004689      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
004690 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
004691      EXIT.                                                       015100      
004692***************************************************************** 015200      
004693** This paragraph adds century to an year field which is 9(02) ** 015300      
004694** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
004695** Output is A2K-FEC-CCAA-001.                                 ** 015600      
004696***************************************************************** 015700      
004697 A2K-CONV-AA-TO-CCAA.                                             015800      
004698      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
004699      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
004700              A2K-OBTAIN-CENTURY-EXIT.                            016100      
004701      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
004702 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
004703      EXIT.                                                       016400      
004704***************************************************************** 016500      
004705** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
004706** format.                                                     ** 016700      
004707** Input is A2K-FEC-DMCA-001.                                  ** 016800      
004708** Output is A2K-FEC-CAMD-001.                                 ** 016900      
004709***************************************************************** 017000      
004710 A2K-CONV-DMCA-TO-CAMD.                                           017100      
004711      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
004712      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
004713      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
004714      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
004715      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
004716 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
004717      EXIT.                                                       017800      
004718***************************************************************** 017900      
004719** This paragraph desides the Century to be added depending    ** 018000      
004720** on the base year.                                           ** 018100      
004721** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
004722** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
004723***************************************************************** 018400      
004724 A2K-OBTAIN-CENTURY.                                              018500      
004725      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
004726          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
004727      ELSE                                                        018800      
004728          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
004729 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
004730      EXIT.                                                       019100      
004731                                                                  019200      
004732***************************************************************** 019300      
004733** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
004734**  Format                                                     ** 019500      
004735** Input Is A2K-FEC-CAMD-001                                   ** 019600      
004736** Output Is A2K-FEC-DMCA-001                                  ** 019700      
004737***************************************************************** 019800      
004738 A2K-CONV-CAMD-TO-DMCA.                                           019900      
004739      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
004740      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
004741      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
004742      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
004743      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
004744                                                                  020500      
004745 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
004746      EXIT.                                                       020700      
004747                                                                  020800      
004748******************************************************************020900      
004749******************************************************************021000      
004750 A2K-CONV-AM-TO-CAM.                                              021100      
004751      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
004752      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
004753      IF A2K-FEC-AM-001 = 0                                       021220      
004754         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
004755      ELSE                                                        021245      
004756      IF A2K-FEC-AM-001 = 9999                                    021250      
004757         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
004758      ELSE                                                        021260      
004759      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
004760      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
004761      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
004762              A2K-OBTAIN-CENTURY-EXIT                             021600      
004763      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
004764                                                                  021800      
004765 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
004766      EXIT.                                                       022000      
004767                                                                  022100      
004768******************************************************************022200      
004769******************************************************************022300      
004770 A2K-CONV-CAM-TO-AM.                                              022400      
004771      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
004772      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
004773      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
004774                                                                  022800      
004775 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
004776   EXIT.                                                          023000      
004777                                                                  023100      
004778                                                                  023200      
004779                                                                  023500      
004780*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
004781 A2K-CPY-EXIT-PARA.                                               179404      
004782          EXIT.                                                   179405      
004783*TERMINA CODIGO DE RENOVACION CRONOS 2000                         179406      
004784                                                                  179500      
004785**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                179600      
004786                                                                  179700      
004787 0101000-VERIFICA-B05.                                            179800      
004788***** CONSULTAR SI EXISTE B05 CON LA FECHA DE PROCESO             179900      
004789     MOVE 01                              TO WKS-B05-FUNCION      180000      
004790     MOVE W77-PARAM-SISTEMA               TO WKS-B05-SISTEMA      180100      
004791     MOVE W77-FECHA-PROC                  TO WKS-B05-FCHPRO       180200      
004792     MOVE 178                             TO WKS-B05-NUMPRO       180300      
004793     MOVE ZEROS                           TO WKS-B05-FCHINI       180400      
004794                                             WKS-B05-NUMREGINI.   180500      
004795                                                                  180600      
004796     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      180700      
004797                                     GIVING W77-RESULT-LIBCON.    180800      
004798                                                                  180900      
004799     IF W77-RESULT-LIBCON = 0                                     181000      
004800          IF WKS-B05-STAPGM = 0                                   181100      
004801              NEXT SENTENCE                                       181200      
004802          ELSE                                                    181300      
004803              MOVE 1       TO W77-EOF                             181400      
004804              PERFORM 999999-FIN                                  181500      
004805     ELSE                                                         181600      
004806          PERFORM 0101100-CREA-B05.                               181700      
004807                                                                  181800      
004808                                                                  181900      
004809 0101100-CREA-B05.                                                182000      
004810     MOVE 19                      TO WKS-B05-FUNCION              182100      
004811     MOVE W77-PARAM-SISTEMA       TO WKS-B05-SISTEMA              182200      
004812     MOVE W77-FECHA-PROC          TO WKS-B05-FCHPRO               182300      
004813     MOVE 178                     TO WKS-B05-NUMPRO               182400      
004814     MOVE ZEROS                   TO WKS-B05-FCHINI               182500      
004815                                     WKS-B05-NUMREGINI.           182600      
004816                                                                  182700      
004817     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      182800      
004818                                    GIVING W77-RESULT-LIBCON.     182900      
004819                                                                  183000      
004820     IF W77-RESULT-LIBCON = 0                                     183100      
004821         NEXT SENTENCE                                            183200      
004822     ELSE                                                         183300      
004823         MOVE "I" TO TIPO-LJ                                      183400      
004824         MOVE 051010 TO CODIGO-LJ                                 183500      
004825         MOVE W77-RESULT-LIBCON            TO W77-ERROR           183600      
004826                                                                  183700      
004827         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  183800      
004828         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    183900      
004829                       WKS-B05-NUMPRO " " W77-FECHA-PROC          184000      
004830         DELIMITED BY SIZE INTO TEXTO-LJ                          184100      
004831         PERFORM 999999-DESPLIEGA                                 184200      
004832         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 184300      
004833         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                184400      
004834         PERFORM 000-030-IMPRIME-MENSAJE.                         184500      
004835                                                                  184600      
004836                                                                  184700      
004837 0101200-ACTUALIZA-B05.                                           184800      
004838     MOVE 37                      TO WKS-B05-FUNCION              184900      
004839     MOVE W77-PARAM-SISTEMA       TO WKS-B05-SISTEMA              185000      
004840     MOVE W77-FECHA-PROC          TO WKS-B05-FCHPRO               185100      
004841     MOVE 178                     TO WKS-B05-NUMPRO               185200      
004842     MOVE ZEROS                   TO WKS-B05-FCHINI               185300      
004843                                     WKS-B05-NUMREGINI            185400      
004844****** ESTATUS DE TERMINACION DEL PROCESO                         185500      
004845     MOVE 01                      TO WKS-B05-STAPGM.              185600      
004846                                                                  185700      
004847     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      185800      
004848                                    GIVING W77-RESULT-LIBCON.     185900      
004849     IF W77-RESULT-LIBCON = 0                                     186000      
004850          NEXT SENTENCE                                           186100      
004851     ELSE                                                         186200      
004852         MOVE "I" TO TIPO-LJ                                      186300      
004853         MOVE 051010 TO CODIGO-LJ                                 186400      
004854         MOVE W77-RESULT-LIBCON            TO W77-ERROR           186500      
004855                                                                  186600      
004856         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  186700      
004857         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    186800      
004858                       WKS-B05-NUMPRO " " W77-FECHA-PROC          186900      
004859         DELIMITED BY SIZE INTO TEXTO-LJ                          187000      
004860         PERFORM 999999-DESPLIEGA                                 187100      
004861         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 187200      
004862         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                187300      
004863         PERFORM 000-030-IMPRIME-MENSAJE.                         187400      
004864                                                                  187500      
004865**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                187600      
