000001*$SET TARGET=LEVEL0                                               000100      
000002$SET LIST                                                         000200      
000003$SET OPTIMIZE                                                     000300      
000004*INICIA CODIGO DE RENOVACION CRONOS 2000                          000400      
000005$SET LISTOMITTED                                                  000500      
000006$SET OLDCODE                                                      000600      
000007$SET ERRORLIMIT=100                                               000650      
000008*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000700      
000009 IDENTIFICATION DIVISION.                                         000800      
000010 PROGRAM-ID.             CARSDOMOV.                               000900      
000011 AUTHOR.                 RICARDO MORENO ARZAVE.                   001000      
000012 INSTALLATION.           BANAMEX                                  001100      
000013                         INGENIERIA DE SISTEMAS                   001200      
000014                         CENTRO DE DESARROLLO LEON.               001300      
000015 DATE-WRITTEN.           MAYO DE 1996.                            001400      
000016 DATE-COMPILED.                                                   001500      
000017 SECURITY.               COPYRIGHT 1996 BY THE AUTHOR.            001600      
000018******************************************************************001605      
000019**JNRB 251113 SE LIBERA NUEVA VERSION POR PROCESO DE             *001610      
000020**RECOMPILACION                                                  *001615      
000021*                                                                *001620      
000022*                                                                *001625      
000023*                                                                *001630      
000024*                                                                *001635      
000025*                                                                *001640      
000026*                                                                *001645      
000027*                                                                *001650      
000028*                                                                *001655      
000029*                                                                *001660      
000030*                                                                *001665      
000031*                                                                *001670      
000032******************************************************************001675      
000033 ENVIRONMENT DIVISION.                                            001700      
000034 CONFIGURATION SECTION.                                           001800      
000035 SOURCE-COMPUTER.        A10.                                     001900      
000036 OBJECT-COMPUTER.        A10.                                     002000      
000037 INPUT-OUTPUT SECTION.                                            002100      
000038 FILE-CONTROL.                                                    002200      
000039      SELECT A01-S151MOV       ASSIGN TO DISK                     002300      
000040                               ORGANIZATION IS SEQUENTIAL         002400      
000041                               ACCESS MODE IS RANDOM              002500      
000042                               ACTUAL KEY IS W77-ULT-REG-LEIDO.   002600      
000043                                                                  002700      
000044      SELECT A02-S151DES       ASSIGN TO DISK                     002800      
000045                               RESERVE 0 AREAS                    002900      
000046                               ORGANIZATION IS SEQUENTIAL         003000      
000047                               ACCESS MODE IS RANDOM              003100      
000048                               ACTUAL KEY IS W77-LOGKEY.          003200      
000049                                                                  003300      
000050 DATA DIVISION.                                                   003400      
000051 FILE SECTION.                                                    003500      
000052*                                                                 003600      
000053 FD A01-S151MOV                                                   003700      
000054    VALUE OF                                                      003800      
000055                 SECURITYTYPE IS PUBLIC                           003900      
000056                 TITLE WKS-ETI-S151-MOV                           004000      
000057                 VALUE OF BUFFERS IS 1                            004400      
000058                 BLOCK CONTAINS 144 RECORDS.                      004500      
000059                                                                  004600      
000060*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000061*    COPY "S151/FORMATO/ARCHIVO/MOVTOS".                          004700      
000062                                                                  000100      
000063******************************************************************000200      
000064**            S151/FORMATO/ARCHIVO/MOVTOS/17MTP001              **000300      
000065**  DESCRIPCION DEL ARCHIVO DE MOVIMIENTOS                      **000400      
000066**  LONGITUD DEL REGISTRO 450 CARACTERES                        **000500      
000067******************************************************************000600      
000068                                                                  000700      
000069 01 A00-R00-HDR-MOV .                                             000800      
000070    02 A00-R00-HDR-HD                  PIC  X(02).                000900      
000071    02 A00-R00-HDR-FCH                 PIC  9(08).                001000      
000072    02 FILLER                          PIC  X(08).                001100      
000073    02 A00-R00-HDR-BANDES              PIC  9(02).                001200      
000074    02 FILLER                          PIC  X(430).               001300      
000075                                                                  001400      
000076 01 A00-R01-REGMOV .                                              001500      
000077    03 A00-R01-FUNCION                 PIC  9(02)      COMP.      001600      
000078    03 A00-R01-FORMATO                 PIC  9(02)      COMP.      001700      
000079    03 A00-R01-SISTEMA                 PIC  9(04)      COMP.      001800      
000080                                                                  001900      
000081    03 A00-R01-PRODUCTO                PIC  9(04)      COMP.      002000      
000082    03 A00-R01-TIPOCREDITO REDEFINES A00-R01-PRODUCTO             002100      
000083                                       PIC  9(04)      COMP.      002200      
000084    03 A00-R01-TIPO-PROD   REDEFINES A00-R01-PRODUCTO             002300      
000085                                       PIC  9(04)      COMP.      002400      
000086                                                                  002500      
000087    03 A00-R01-INSTRUMENTO             PIC  9(02)      COMP.      002600      
000088    03 A00-R01-PORTAFOLIO  REDEFINES A00-R01-INSTRUMENTO          002700      
000089                                       PIC  9(02)      COMP.      002800      
000090    03 A00-R01-FONDO       REDEFINES A00-R01-INSTRUMENTO          002900      
000091                                       PIC  9(02)      COMP.      003000      
000092    03 A00-R01-SERVICIO-ALERTA         PIC  9(04)      COMP.      003020      
000093    03 A00-R01-SERVICIO-ALERTA-R REDEFINES                        003040      
000094                                       A00-R01-SERVICIO-ALERTA.   003060      
000095       05 A00-R01-SERVICIO             PIC  9(02)      COMP.      003100      
000096       05 A00-R01-TIPO-OPERACION       PIC  X(01).                003200      
000097    03 A00-R01-TIPO-MOVIMIENTO         PIC  9(02)      COMP.      003300      
000098    03 A00-R01-AGRUP-DESV-PROD         PIC  9(04)      COMP.      003400      
000099    03 A00-R01-PRODUCTO-S016     REDEFINES A00-R01-AGRUP-DESV-PROD003410      
000100                                       PIC  9(04)      COMP.      003420      
000101    03 A00-R01-AGRUP-DESV-INST         PIC  9(04)      COMP.      003500      
000102    03 A00-R01-INSTRUMENTO-S016  REDEFINES A00-R01-AGRUP-DESV-INST003510      
000103                                       PIC  9(04)      COMP.      003520      
000104    03 A00-R01-SIRH-DESVIO             PIC  9(04)      COMP.      003600      
000105    03 A00-R01-LIBRO-CONTABLE          PIC  9(02)      COMP.      003700      
000106    03 A00-R01-IND-CONTA         REDEFINES A00-R01-LIBRO-CONTABLE 003800      
000107                                       PIC  9(02)      COMP.      003900      
000108                                                                  004000      
000109    03 A00-R01-CVEIMP                  PIC  X(95).                004100      
000110    03 A00-R01-CVEIMP-OC               REDEFINES A00-R01-CVEIMP.  004200      
000111       04 A00-R01-ELE-CVEIMP           OCCURS 5 TIMES.            004300      
000112          05 A00-R01-CVETRAN           PIC  9(06)      COMP.      004400      
000113          05 A00-R01-INDLEY            PIC  9(02)      COMP.      004500      
000114          05 A00-R01-ESQCON            PIC  9(04)      COMP.      004600      
000115          05 A00-R01-TM REDEFINES A00-R01-ESQCON PIC 9(04) COMP.  004700      
000116          05 A00-R01-IMPORTE           PIC  9(16)V99   COMP.      004800      
000117          05 A00-R01-CVE-DESVIO        PIC  9(04)      COMP.      004900      
000118          05 A00-R01-GUIA-DESVIO       PIC  9(04)      COMP.      005000      
000119                                                                  005100      
000120    03 A00-R01-CVEIMP-DE               REDEFINES A00-R01-CVEIMP.  005200      
000121       04 A00-R01-CVETRAN1             PIC  9(06)      COMP.      005300      
000122       04 A00-R01-INDLEY1              PIC  9(02)      COMP.      005400      
000123       04 A00-R01-ESQCON1              PIC  9(04)      COMP.      005500      
000124       04 A00-R01-TM1 REDEFINES A00-R01-ESQCON1 PIC 9(04) COMP.   005600      
000125       04 A00-R01-IMPORTE1             PIC  9(16)V99   COMP.      005700      
000126       04 A00-R01-CVE-DESVIO1          PIC  9(04)      COMP.      005800      
000127       04 A00-R01-GUIA-DESVIO1         PIC  9(04)      COMP.      005900      
000128                                                                  006000      
000129       04 A00-R01-CVETRAN2             PIC  9(06)      COMP.      006100      
000130       04 A00-R01-INDLEY2              PIC  9(02)      COMP.      006200      
000131       04 A00-R01-ESQCON2              PIC  9(04)      COMP.      006300      
000132       04 A00-R01-TM2 REDEFINES A00-R01-ESQCON2 PIC 9(04) COMP.   006400      
000133       04 A00-R01-IMPORTE2             PIC  9(16)V99   COMP.      006500      
000134       04 A00-R01-CVE-DESVIO2          PIC  9(04)      COMP.      006600      
000135       04 A00-R01-GUIA-DESVIO2         PIC  9(04)      COMP.      006700      
000136                                                                  006800      
000137       04 A00-R01-CVETRAN3             PIC  9(06)      COMP.      006900      
000138       04 A00-R01-INDLEY3              PIC  9(02)      COMP.      007000      
000139       04 A00-R01-ESQCON3              PIC  9(04)      COMP.      007100      
000140       04 A00-R01-TM3 REDEFINES A00-R01-ESQCON3 PIC 9(04) COMP.   007200      
000141       04 A00-R01-IMPORTE3             PIC  9(16)V99   COMP.      007300      
000142       04 A00-R01-CVE-DESVIO3          PIC  9(04)      COMP.      007400      
000143       04 A00-R01-GUIA-DESVIO3         PIC  9(04)      COMP.      007500      
000144                                                                  007600      
000145       04 A00-R01-CVETRAN4             PIC  9(06)      COMP.      007700      
000146       04 A00-R01-INDLEY4              PIC  9(02)      COMP.      007800      
000147       04 A00-R01-ESQCON4              PIC  9(04)      COMP.      007900      
000148       04 A00-R01-TM4 REDEFINES A00-R01-ESQCON4 PIC 9(04) COMP.   008000      
000149       04 A00-R01-IMPORTE4             PIC  9(16)V99   COMP.      008100      
000150       04 A00-R01-CVE-DESVIO4          PIC  9(04)      COMP.      008200      
000151       04 A00-R01-GUIA-DESVIO4         PIC  9(04)      COMP.      008300      
000152                                                                  008400      
000153       04 A00-R01-CVETRAN5             PIC  9(06)      COMP.      008500      
000154       04 A00-R01-INDLEY5              PIC  9(02)      COMP.      008600      
000155       04 A00-R01-ESQCON5              PIC  9(04)      COMP.      008700      
000156       04 A00-R01-TM5 REDEFINES A00-R01-ESQCON5 PIC 9(04) COMP.   008800      
000157       04 A00-R01-IMPORTE5             PIC  9(16)V99   COMP.      008900      
000158       04 A00-R01-CVE-DESVIO5          PIC  9(04)      COMP.      009000      
000159       04 A00-R01-GUIA-DESVIO5         PIC  9(04)      COMP.      009100      
000160                                                                  009200      
000161    03 A00-R01-MONEDA                  PIC  9(04)      COMP.      009300      
000162    03 A00-R01-ORIGEN                  PIC  9(02)      COMP.      009400      
000163    03 A00-R01-IND-EFEC                PIC  9(02)      COMP.      009500      
000164    03 A00-R01-SOBREGIRO               PIC  9(02)      COMP.      009600      
000165    03 A00-R01-IND-EDOCTA              PIC  9(02)      COMP.      009700      
000166    03 A00-R01-IND-EDOCTA-R            REDEFINES                  009800      
000167       A00-R01-IND-EDOCTA              PIC  X(01).                009900      
000168    03 A00-R01-ENVIO-CD                PIC  9(02)      COMP.      010000      
000169    03 A00-R01-IND-DATOS-ADIC          PIC  9(02)      COMP.      010100      
000170    03 A00-R01-IND-NUMREN              PIC  9(02)      COMP.      010200      
000171    03 A00-R01-FEC-VENCIMIENTO         PIC  9(08)      COMP.      010300      
000172    03 A00-R01-PLAZO                   PIC  9(04)      COMP.      010600      
000173    03 A00-R01-FEC-ULT-MOV             PIC  9(08)      COMP.      010700      
000174    03 A00-R01-BCOS                    PIC  9(10)      COMP.      010800      
000175    03 A00-R01-BCOS-R                  REDEFINES A00-R01-BCOS.    010900      
000176       05 A00-R01-BCO-ORI              PIC  9(05)      COMP.      011000      
000177       05 A00-R01-BCO-DES              PIC  9(05)      COMP.      011100      
000178    03 A00-R01-NODO-ORIG               PIC  9(02)      COMP.      011200      
000179    03 A00-R01-NODO-DESTINO            PIC  9(02)      COMP.      011300      
000180    03 A00-R01-SIST-ORIG               PIC  9(04)      COMP.      011400      
000181    03 A00-R01-PROD-ORIG               PIC  9(04)      COMP.      011500      
000182    03 A00-R01-INST-ORIG               PIC  9(02)      COMP.      011600      
000183    03 A00-R01-CVETR-ORIG              PIC  9(06)      COMP.      011700      
000184    03 A00-R01-REF-ORIG                PIC  9(18)      COMP.      011800      
000185    03 A00-R01-CLIENTE                 PIC  9(12)      COMP.      011900      
000186    03 A00-R01-SECTOR                  PIC  9(02)      COMP.      012000      
000187    03 A00-R01-SUCPROM                 PIC  9(04)      COMP.      012100      
000188    03 A00-R01-CONTRATO                PIC  9(16)      COMP.      012200      
000189    03 A00-R01-CVEMDA                  PIC  9(04)      COMP.      012300      
000190    03 A00-R01-NUMMDA                  PIC  9(20)      COMP.      012400      
000191    03 A00-R01-MDA-R                   REDEFINES A00-R01-NUMMDA   012500      
000192                                       PIC X(10).                 012600      
000193    03 A00-R01-NUMMDA-R                REDEFINES A00-R01-NUMMDA.  012700      
000194       05 A00-R01-MDA-SUC              PIC  9(04)      COMP.      012800      
000195       05 A00-R01-MDA-CTA              PIC  9(16)      COMP.      012900      
000196    03 A00-R01-CVEMDE                  PIC  9(02)      COMP.      013000      
000197    03 A00-R01-INTERCOMPANY            PIC  9(06)      COMP.      013100      
000198    03 A00-R01-FILIAL                  PIC  X(05).                013200      
000199    03 A00-R01-FILIAL-R                REDEFINES A00-R01-FILIAL.  013220      
000200       05 A00-R01-GRUPO-SOC            PIC  9(04)      COMP.      013240      
000201       05 A00-R01-BIN-TAR              PIC  9(06)      COMP.      013260      
000202                                                                  013300      
000203    03 A00-R01-REFNUM                  PIC  9(18)      COMP.      013400      
000204    03 A00-R01-REFNUM-R                REDEFINES A00-R01-REFNUM   013500      
000205                                       PIC  X(09).                013600      
000206    03 A00-R01-REFERENCIA              REDEFINES A00-R01-REFNUM   013700      
000207                                       PIC  9(18)      COMP.      013800      
000208    03 A00-R01-AUTORIZA                PIC  9(18)      COMP.      013900      
000209    03 A00-R01-AUTORIZA-R              REDEFINES A00-R01-AUTORIZA 014000      
000210                                       PIC  X(9).                 014100      
000211    03 A00-R01-AUT3ER                  PIC  9(10)      COMP.      014200      
000212    03 A00-R01-AUT3ER-R                REDEFINES A00-R01-AUT3ER   014300      
000213                                       PIC  X(05).                014400      
000214    03 A00-R01-NIO                     PIC  X(16).                014500      
000215    03 A00-R01-AUT-S151                PIC  9(08)      COMP.      014600      
000216    03 A00-R01-AUT-AELIM-S151          PIC  9(08)      COMP.      014700      
000217    03 A00-R01-AUT-AELIM-S151-R        REDEFINES                  014800      
000218       A00-R01-AUT-AELIM-S151          PIC  X(04).                014900      
000219    03 A00-R01-AUT-ANT-S151            PIC  9(08)      COMP.      015000      
000220    03 A00-R01-AUT-ANT-S151-R          REDEFINES                  015100      
000221       A00-R01-AUT-ANT-S151            PIC  X(04).                015200      
000222    03 A00-R01-TIPO-PROC               PIC  9(02)      COMP.      015300      
000223    03 A00-R01-FECMOV                  PIC  9(08)      COMP.      015400      
000224    03 A00-R01-HORMOV                  PIC  9(06)      COMP.      015500      
000225    03 A00-R01-FECCONT                 PIC  9(08)      COMP.      015600      
000226    03 A00-R01-FECVAL                  PIC  9(08)      COMP.      015700      
000227    03 A00-R01-FECVAL-R                REDEFINES A00-R01-FECVAL   015800      
000228                                       PIC  X(04).                015900      
000229    03 A00-R01-SUC-INIC                PIC  9(04)      COMP.      016000      
000230    03 A00-R01-CAJA-INIC               PIC  9(04)      COMP.      016100      
000231    03 A00-R01-CAJA-S501               REDEFINES A00-R01-CAJA-INIC016200      
000232                                       PIC  9(04)      COMP.      016300      
000233    03 A00-R01-SUCOPER                 PIC  9(04)      COMP.      016400      
000234    03 A00-R01-CAJAOPER                PIC  9(04)      COMP.      016500      
000235    03 A00-R01-SUCTRAN                 PIC  9(04)      COMP.      016600      
000236    03 A00-R01-CAJATRAN                PIC  9(04)      COMP.      016700      
000237    03 A00-R01-VERIF-FIRMA             PIC  9(02)      COMP.      016800      
000238                                                                  016900      
000239    03 A00-R01-NOMINA-OPE              PIC  9(14)      COMP.      017000      
000240    03 A00-R01-NOMINA-OPE-R            REDEFINES                  017100      
000241       A00-R01-NOMINA-OPE              PIC X(07).                 017200      
000242    03 A00-R01-FILXAPL                 PIC X(165).                017300      
000243                                                                  017400      
000244    03 A00-R01-RED018                  REDEFINES A00-R01-FILXAPL. 017500      
000245       05 FILLER                       PIC X(96).                 017510      
000246       05 A00-R01-BCO-S018             PIC 9(04)      COMP.       017600      
000247       05 FILLER                       PIC X(67).                 017700      
000248                                                                  017702      
000249    03 A00-R01-RED084                  REDEFINES A00-R01-FILXAPL. 017704      
000250       06 WKS-MOV-SUCEJE               PIC 9(04)      COMP.       017706      
000251       06 WKS-MOV-CTAEJE               PIC 9(12)      COMP.       017708      
000252       06 WKS-MOV-MENSUALIDAD          PIC 9(04)      COMP.       017710      
000253       06 WKS-MOV-ASESOR               PIC 9(02)      COMP.       017712      
000254       06 WKS-MOV-FILS084              PIC X(154).                017714      
000255                                                                  017800      
000256    03 A00-R01-REDS087                 REDEFINES A00-R01-FILXAPL. 017900      
000257       05 A00-R01-PZO                  PIC 9(04)      COMP.       018000      
000258       05 A00-R01-EMISION              PIC 9(08)      COMP.       018100      
000259       05 A00-R01-FIL-CTE              PIC 9(12)      COMP.       018105      
000260       05 A00-R01-PROD-S087            PIC 9(04)      COMP.       018110      
000261       05 A00-R01-INST-S016            PIC 9(02)      COMP.       018120      
000262       05 A00-R01-IMPINTRB             PIC 9(14)V99   COMP.       018130      
000263       05 A00-R01-SERV-S087            PIC 9(02)      COMP.       018140      
000264       05 A00-R01-SUCREEMB             PIC 9(04)      COMP.       018150      
000265       05 A00-R01-CTAREEMB             PIC 9(16)      COMP.       018155      
000266*      CAMPOS NUEVOS                                              018160      
000267       05 A00-R01-SUCFOND              PIC 9(04)      COMP.       018161      
000268       05 A00-R01-CTAFOND              PIC 9(16)      COMP.       018162      
000269       05 A00-R01-OPBANEL              PIC 9(04)      COMP.       018163      
000270       05 A00-R01-GATN                 PIC S9(03)V99   COMP.      018164      
000271       05 A00-R01-GATR                 PIC S9(03)V99   COMP.      018165      
000272       05 A00-R01-FECGAT               PIC 9(08)      COMP.       018166      
000273       05 FILLER                       PIC X(43).                 018167      
000274*       05 FILLER                       PIC X(62).                018170      
000275       05 A00-R01-CTE-087              PIC X(07).                 018210      
000276       05 A00-R01-REDEF-087 REDEFINES A00-R01-CTE-087.            018250      
000277          07 A00-R01-FECVEN-087        PIC 9(08)      COMP.       018260      
000278          07 A00-R01-SUFIJO            PIC 9(04)      COMP.       018280      
000279          07 FILLER                    PIC X(01).                 018281      
000280       05 A00-R01-PM                   PIC 9(02)      COMP.       018300      
000281       05 FILLER                       PIC X(58).                 018400      
000282                                                                  018500      
000283    03 A00-R01-REDC252                 REDEFINES A00-R01-FILXAPL. 018600      
000284       05 FILLER                       PIC  X(96).                018610      
000285       05 A00-R01-FEC-PARTIDA          PIC  9(08) COMP.           018620      
000286       05 FILLER                       PIC  X(65).                018630      
000287                                                                  018640      
000288    03 A00-R01-REDC252-FT00            REDEFINES A00-R01-FILXAPL. 018650      
000289       05 A00-R01-FORMATO0             PIC  9(02).                018700      
000290       05 A00-R01-DESCRIPCION          PIC  X(20).                018800      
000291       05 A00-R01-NATUTRAN             PIC  9(02).                018900      
000292       05 FILLER                       PIC  X(141).               018910      
000293                                                                  019100      
000294    03 A00-R01-REDC252-FT01            REDEFINES A00-R01-FILXAPL. 019200      
000295       05 A00-R01-FORMATO1             PIC  9(02).                019300      
000296       05 A00-R01-DESCRIPCION1         PIC  X(20).                019400      
000297       05 A00-R01-NATUTRAN1            PIC  9(02).                019500      
000298       05 A00-R01-TIPOAUX              PIC  9(01).                019600      
000299       05 A00-R01-NUMEROCTE            PIC  9(12).                019700      
000300       05 A00-R01-NOMBRECTE            PIC  X(34).                019800      
000301       05 A00-R01-NUMPARTIDA           PIC  9(10).                019900      
000302       05 A00-R01-ENTSAL               PIC  X(01).                020000      
000303       05 A00-R01-SALDO                PIC  9(12)V99.             020100      
000304       05 FILLER                       PIC  X(69).                020200      
000305                                                                  020300      
000306    03 A00-R01-REDC252-FT02            REDEFINES A00-R01-FILXAPL. 020400      
000307       05 A00-R01-FORMATO2             PIC  9(02).                020500      
000308       05 A00-R01-DESCRIPCION2         PIC  X(20).                020600      
000309       05 A00-R01-NATUTRAN2            PIC  9(02).                020700      
000310       05 A00-R01-NUMACREEDOR          PIC  9(12).                020800      
000311       05 A00-R01-NOMACREEDOR          PIC  X(36).                020900      
000312       05 A00-R01-FUNCAUTOR2           PIC  9(08).                021000      
000313       05 A00-R01-FECHAAUTOR2          PIC  9(08).                021100      
000314       05 FILLER                       PIC  X(77).                021200      
000315                                                                  021300      
000316    03 A00-R01-REDC252-FT03            REDEFINES A00-R01-FILXAPL. 021400      
000317       05 A00-R01-FORMATO3             PIC  9(02).                021500      
000318       05 A00-R01-DESCRIPCION3         PIC  X(20).                021600      
000319       05 A00-R01-NATUTRAN3            PIC  9(02).                021700      
000320       05 A00-R01-FUNCAUTOR3           PIC  9(08).                021800      
000321       05 A00-R01-FUNCPROPO3           PIC  9(08).                021900      
000322       05 A00-R01-NUMDEUDOR            PIC  9(12).                022000      
000323       05 A00-R01-NOMDEUDOR            PIC  X(36).                022100      
000324       05 A00-R01-FECHAAUTOR3          PIC  9(08).                022200      
000325       05 FILLER                       PIC  X(69).                022300      
000326                                                                  022400      
000327    03 A00-R01-REDC252-FT04            REDEFINES A00-R01-FILXAPL. 022500      
000328       05 A00-R01-FORMATO4             PIC  9(02).                022600      
000329       05 A00-R01-DESCRIPCION4         PIC  X(20).                022700      
000330       05 A00-R01-NATUTRAN4            PIC  9(02).                022800      
000331       05 A00-R01-TIPOPERS             PIC  9(01).                022900      
000332       05 A00-R01-RFCFT04              PIC  X(13).                023000      
000333       05 A00-R01-ENTIDADFED           PIC  9(02).                023100      
000334       05 A00-R01-DIRECCION            PIC  X(40).                023200      
000335       05 FILLER                       PIC  X(85).                023300      
000336                                                                  023400      
000337    03 A00-R01-REDS264                 REDEFINES A00-R01-FILXAPL. 023404      
000338       05 A00-R01-COBERTURA            PIC  X(01).                023408      
000339       05 A00-R01-MODALIDAD            PIC  9(02)    COMP.        023412      
000340       05 A00-R01-NUMEMISOR            PIC  9(04)    COMP.        023416      
000341       05 A00-R01-NUMSUBEMI            PIC  9(02)    COMP.        023420      
000342       05 A00-R01-FOLIOEMIS            PIC  9(10)    COMP.        023424      
000343       05 A00-R01-DATOSEMIS            PIC  X(12).                023428      
000344       05 A00-R01-NOMBORDEN            PIC  X(34).                023432      
000345       05 A00-R01-FORPAGORD            PIC  9(02)    COMP.        023436      
000346       05 A00-R01-TIPPERORD            PIC  X(01).                023440      
000347       05 A00-R01-RFCCURPOR            PIC  X(18).                023444      
000348       05 A00-R01-NOMBBENEF            PIC  X(55).                023448      
000349       05 A00-R01-FORPAGBEN            PIC  X(01).                023452      
000350       05 A00-R01-TIPPERBEN            PIC  X(01).                023456      
000351       05 A00-R01-ESTATOPER            PIC  9(02)    COMP.        023460      
000352       05 A00-R01-ESTATANTI            PIC  9(02)    COMP.        023464      
000353       05 A00-R01-SUCQUEIMP            PIC  9(04)    COMP.        023468      
000354       05 A00-R01-CAJQUEIMP            PIC  9(04)    COMP.        023472      
000355       05 A00-R01-CVEIMPRES            PIC  9(02)    COMP.        023476      
000356       05 A00-R01-NOMQUEIMP            PIC  9(14)    COMP.        023480      
000357       05 A00-R01-FECHAIMPR            PIC  9(08)    COMP.        023484      
000358       05 A00-R01-HORAIMPRE            PIC  9(06)    COMP.        023488      
000359       05 A00-R01-SIS-ORIGINAL         PIC  X(06).                023490      
000360       05 FILLER                       PIC  X(05).                023492      
000361                                                                  023497      
000362    03 A00-R01-REDC402                 REDEFINES A00-R01-FILXAPL. 023500      
000363       05 A00-R01-4CEROS               PIC  9(04).                023600      
000364       05 A00-R01-FIDEICO402           PIC  9(04).                023700      
000365       05 FILLER                       PIC  X(157).               023800      
000366                                                                  023900      
000367    03 A00-R01-REDS403                 REDEFINES A00-R01-FILXAPL. 024000      
000368       05 A00-R01-OPCION               PIC  9(02)    COMP.        024100      
000369        05 A00-R01-FECCOTI              PIC  9(06)    COMP.       024200      
000370       05 A00-R01-FIDEICO              PIC  9(06)    COMP.        024300      
000371       05 A00-R01-IMPVAL               PIC  9(14)V99 COMP.        024400      
000372       05 A00-R01-SUCADIC              PIC  9(04)    COMP.        024500      
000373       05 A00-R01-CAJAADIC             PIC  9(02)    COMP.        024600      
000374       05 A00-R01-PROGRAMA             PIC  9(04)    COMP.        024700      
000375       05 A00-R01-PLAZO-S403           PIC  9(04)    COMP.        024800      
000376       05 A00-R01-TIPOPLAZO            PIC  9(02)    COMP.        024900      
000377       05 A00-R01-TASAREF              PIC  9(06)V99 COMP.        025000      
000378       05 A00-R01-TASAREAL             PIC  9(04)V9999 COMP.      025100      
000379       05 A00-R01-CTE-403              PIC  9(12)    COMP.        025200      
000380       05 A00-R01-TIPOCREALFA          PIC  X(08)        .        025300      
000381       05 A00-R01-AUTS151ORI           PIC  9(08)    COMP.        025400      
000382       05 A00-R01-TIPOCON              PIC  9(02)    COMP.        025500      
000383       05 A00-R01-INDCONTABLE          PIC  9(02)    COMP.        025600      
000384       05 A00-R01-INTERCOMPAN          PIC  9(05)    COMP.        025700      
000385       05 A00-R01-FILLER-COMP          PIC  9(01)    COMP.        025800      
000386       05 A00-R01-DESTINO-CRED         PIC  9(02)    COMP.        025820      
000387       05 A00-R01-FILLER               PIC  X(41).                025850      
000388       05 A00-R01-FOLIO-S403           PIC  9(04)    COMP.        025900      
000389       05 A00-R01-RENGLON-S403         PIC  9(02)    COMP.        026000      
000390       05 A00-R01-SCVECON-S403         PIC  9(04)    COMP.        026100      
000391       05 A00-R01-INDPAGO              PIC  9(01).                026200      
000392       05 FILLER                       PIC  X(01).                026210      
000393       05 A00-R01-IND-EFE-403          PIC  9(02)    COMP.        026220      
000394       05 A00-R01-REF-S403             PIC  9(18)    COMP.        026230      
000395       05 FILLER                       PIC  X(52).                026300      
000396                                                                  026400      
000397    03 A00-R01-REDS404                 REDEFINES A00-R01-FILXAPL. 026500      
000398       05 A00-R01-OPCION-404           PIC  9(02)    COMP.        026600      
000399       05 A00-R01-FECCOTI-404          PIC  9(06)    COMP.        026700      
000400       05 A00-R01-FIDEICO-404          PIC  9(06)    COMP.        026800      
000401       05 A00-R01-IMPVAL-404           PIC  9(14)V99 COMP.        026900      
000402       05 A00-R01-SUCADIC-404          PIC  9(04)    COMP.        027000      
000403       05 A00-R01-CAJAADIC-404         PIC  9(02)    COMP.        027100      
000404       05 A00-R01-PROGRAMA-404         PIC  9(04)    COMP.        027200      
000405       05 A00-R01-PLAZO-404            PIC  9(04)    COMP.        027300      
000406       05 A00-R01-TIPOPLAZO-404        PIC  9(02)    COMP.        027400      
000407       05 A00-R01-TASAREF-404          PIC  9(04)V99 COMP.        027500      
000408       05 A00-R01-TASAREAL-404         PIC  9(04)V99 COMP.        027600      
000409       05 A00-R01-CTE-404              PIC  9(12)    COMP.        027700      
000410       05 A00-R01-VALUDI-PRODNAT       REDEFINES A00-R01-CTE-404. 027800      
000411          07 A00-R01-VAL-UDI           PIC  9(02)V9(06) COMP.     027900      
000412          07 A00-R01-PRODUCTONAT       PIC  9(04)    COMP.        028000      
000413       05 A00-R01-CRE-CAUSACV          PIC  9(02)    COMP.        028100      
000414       05 A00-R01-PAG-NUMPAGOS         OCCURS 5 TIMES.            028200      
000415          07 A00-R01-PAG-PAGNUM        PIC  9(04)    COMP.        028300      
000416       05 A00-R01-CRE-STA              OCCURS 5 TIMES.            028400      
000417          07 A00-R01-CRE-STATUS        PIC  9(02)    COMP.        028500      
000418       05 A00-R01-CRE-FAS              OCCURS 5 TIMES.            028600      
000419          07 A00-R01-CRE-FASE          PIC  9(02)    COMP.        028700      
000420       05 A00-R01-PAG-ESTATUS          OCCURS 5 TIMES.            028800      
000421          07 A00-R01-PAG-STATUS        PIC  9(02)    COMP.        028900      
000422       05 A00-R01-ESTATUS-MEN          OCCURS 5 TIMES.            029000      
000423          07 A00-R01-PAG-STAVEN        PIC  9(02)    COMP.        029100      
000424       05 A00-R01-ESTATUS-CARVEN       OCCURS 5 TIMES.            029200      
000425          07 A00-R01-PAG-STACARV       PIC  9(02)    COMP.        029300      
000426       05 A00-R01-MOV-CONCEPTOS        OCCURS 5 TIMES.            029400      
000427          07 A00-R01-MOV-CONCEPTO      PIC 9(04)    COMP.         029500      
000428       05 A00-R01-MOV-TIPMOV           OCCURS 5 TIMES.            029600      
000429          07 A00-R01-MOV-TM            PIC 9(02)     COMP.        029700      
000430       05 A00-R01-MOV-MOVIMIENTOS      OCCURS 5 TIMES.            029800      
000431          07 A00-R01-MOV-MOVIMIENTO    PIC 9(04)     COMP.        029900      
000432       05 WKS-TAB-FLUJO-EFEC           OCCURS 5 TIMES.            029910      
000433          07 A00-R01-FLUJOEFEC-NEGOCIO PIC 9(01)     COMP.        029920      
000434          07 A00-R01-FLUJOEFEC-BANCO   PIC 9(01)     COMP.        030000      
000435       05 A00-R01-ID-CORPORATIVO       PIC 9(04)     COMP.        030100      
000436       05 FILLER                       PIC X(01).                 030101      
000437       05 A00-R01-TASA-PORDESCUENTO    PIC 99V99     COMP.        030102      
000438       05 A00-R01-ZEROS                PIC 9(08)     COMP.        030103      
000439       05 A00-R01-REF-S404             PIC 9(06)     COMP.        030104      
000440       05 A01-R02-IMPBASE-ESQFINAN     PIC 9(14)V9(02) COMP.      030105      
000441       05 A00-R01-PRODGEN              PIC 9(03)     COMP.        030109      
000442       05 A00-R01-SUBPRODGEN           PIC 9(03)     COMP.        030110      
000443       05 A00-R01-CRE-FOLIO            PIC 9(04)     COMP.        030120      
000444       05 A00-R01-CONSECUTIVO          OCCURS 5 TIMES.            030130      
000445          06 A00-R01-CONSEC            PIC 9(08)     COMP.        030140      
000446       05 A00-R01-MON-CONTRUC          PIC 9(02)     COMP.        030160      
000447       05 A00-R01-TIPO-CREDITO         PIC 9(04)     COMP.        030260      
000448       05 A00-R01-TIPO-VIVIENDA        PIC 9(04)     COMP.        030360      
000449       05 FILLER                       PIC X(14).                 030700      
000450                                                                  030800      
000451    03 A00-R01-S408                    REDEFINES A00-R01-FILXAPL. 030900      
000452       05 A00-R01-FOLIO                PIC  9(04)     COMP.       031000      
000453       05 A00-R01-NUMLIN               PIC  9(04)     COMP.       031100      
000454       05 A00-R01-TASA-S408            PIC  9(4)V9(4) COMP.       031200      
000455       05 A00-R01-FINI-S408            PIC  9(08)     COMP.       031300      
000456       05 A00-R01-FFIN-S408            PIC  9(08)     COMP.       031400      
000457       05 A00-R01-IMPORTE-S408         PIC  9(12)V99  COMP.       031500      
000458       05 A00-R01-151-CITI             PIC  9(02)     COMP.       031520      
000459       05 A00-R01-151-IND-BNE          PIC  9(02)     COMP.       031540      
000460       05 FILLER                       PIC  X(140).               031600      
000461                                                                  031700      
000462    03 A00-R01-REDS500                 REDEFINES A00-R01-FILXAPL. 031800      
000463       05 A00-R01-CVEAVISO             PIC  9(04)     COMP.       031900      
000464       05 A00-R01-BANCA                PIC  9(02)     COMP.       032000      
000465       05 A00-R01-ESTACION             PIC  9(04)     COMP.       032100      
000466       05 A00-R01-CHVV                 PIC  9(04)     COMP.       032200      
000467       05 A00-R01-TCHEQ                PIC  9(02)     COMP.       032300      
000468       05 A00-R01-CTACON               PIC  9(02)     COMP.       032400      
000469       05 A00-R01-CVECAUSA             PIC  9(04)     COMP.       032500      
000470       05 A00-R01-FECDEV               PIC  9(08)     COMP.       032600      
000471       05 A00-R01-MOTIVO-DEV           PIC  X(30).                032700      
000472       05 A00-R01-MOTIVO-DEV-REDS050 REDEFINES A00-R01-MOTIVO-DEV.032710      
000473          07 A00-R01-CTA-CLABE-SPEI    PIC  9(20).                032720      
000474          07 A00-R01-NUM-PLAZO         PIC  9(02).                032730      
000475          07 FILLER                    PIC  X(08).                032740      
000476       05 A00-R01-BCO                  PIC  9(04)     COMP.       032800      
000477       05 A00-R01-NOMB-BCO             PIC  X(20).                032900      
000478       05 A00-R01-NOMORD               PIC  X(30).                033000      
000479       05 A00-R01-CAUSAORD             PIC  X(50).                033300      
000480       05 A00-R01-SUCORD               PIC  9(04)     COMP.       033400      
000481       05 A00-R01-REF-CECO             PIC  X(07).                033500      
000482       05 A00-R01-NUM-ORD-PAGO         PIC  9(18)     COMP.       033600      
000483       05 A00-R01-NUM-ORD-PAGO-R       REDEFINES                  033700      
000484          A00-R01-NUM-ORD-PAGO.                                   033800      
000485          07 A00-R01-NUM-ORD-PAGO-1    PIC 9(04)      COMP.       033900      
000486          07 A00-R01-NUM-ORD-PAGO-2    PIC 9(14)      COMP.       034000      
000487                                                                  034100      
000488    03 A00-R01-REDS501          REDEFINES A00-R01-FILXAPL.        034120      
000489       05 A00-R01-ESTADO               PIC  9(02)      COMP.      034140      
000490       05 A00-R01-RFC-S501             PIC  X(13).                034160      
000491       05 FILLER                       PIC  X(151).               034180      
000492                                                                  034190      
000493    03 A00-R01-REDS701                 REDEFINES A00-R01-FILXAPL. 034200      
000494       05 A00-R01-DATOS-S701           PIC X(116).                034300      
000495       05 A00-R01-PAG-SERV             REDEFINES                  034400      
000496                                       A00-R01-DATOS-S701.        034500      
000497          07 A00-R01-ID                PIC X(30).                 034600      
000498          07 A00-R01-FECREC            PIC 9(06).                 034700      
000499          07 A00-R01-REF1              PIC X(20).                 034800      
000500          07 A00-R01-REF2              PIC X(20).                 034900      
000501          07 A00-R01-TIPOPAGO          PIC 9(06).                 035000      
000502          07 A00-R01-TIPOPAGO-R        REDEFINES                  035100      
000503                                       A00-R01-TIPOPAGO.          035200      
000504             09 A00-R01-ESTAB          PIC 9(04).                 035300      
000505             09 A00-R01-SEQ            PIC 9(02).                 035400      
000506          07 A00-R01-AUT-S701          PIC 9(08) COMP.            035500      
000507          07 A00-R01-FPAGO             PIC 9(02) COMP.            035600      
000508          07 A00-R01-EBPP              PIC 9(03).                 035700      
000509          07 A00-R01-PLAZA             PIC 9(04) COMP.            035720      
000510          07 A00-R01-EDO               PIC 9(02) COMP.            035725      
000511          07 FILLER                    PIC X(01).                 035728      
000512          07 A00-R01-FEC-VEN           PIC 9(08) COMP.            035740      
000513          07 FILLER                    PIC X(18).                 035760      
000514       05 A00-R01-PAG-IMPT             REDEFINES                  035800      
000515                                       A00-R01-DATOS-S701.        035900      
000516          07 A00-R01-RFC               PIC X(13).                 036000      
000517          07 A00-R01-FORMULARIO        PIC X(10).                 036100      
000518          07 A00-R01-MEDIO-PAGO        PIC 9(04).                 036120      
000519          07 A00-R01-TIPO-IMP          PIC 9(02).                 036140      
000520          07 A00-R01-FMA-PAGO          PIC 9(02).                 036160      
000521          07 FILLER                    PIC X(85).                 036200      
000522       05 FILLER                       PIC X(49).                 036300      
000523                                                                  036400      
000524    03 A00-R01-REDS702                 REDEFINES A00-R01-FILXAPL. 036500      
000525       05 A00-R01-CTE-S702             PIC 9(12).                 036600      
000526       05 A00-R01-CTA-S702             PIC X(40).                 036700      
000527       05 FILLER                       PIC X(113).                036710      
000528                                                                  036720      
000529    03 A00-R01-REDS703                 REDEFINES A00-R01-FILXAPL. 036730      
000530       05 A00-R01-703-FLAGTX           PIC X(01).                 036740      
000531       05 A00-R01-703-FLAGTW           PIC X(02).                 036750      
000532       05 A00-R01-703-DESCRIPCION      PIC X(18).                 036760      
000533       05 A00-R01-703-FECHAOPE         PIC 9(06).                 036770      
000534       05 A00-R01-703-HORAOPE          PIC 9(06).                 036780      
000535       05 A00-R01-703-NOMBREBEN        PIC X(60).                 036790      
000536       05 FILLER                       PIC X(72).                 036800      
000537                                                                  036810      
000538                                                                  036820      
000539    03 A00-R01-REDS711                 REDEFINES A00-R01-FILXAPL. 036905      
000540       05 A00-R01-TRUI-S711.                                      036915      
000541          07 A00-R01-CSIREC-S711       PIC 9(08) COMP.            036920      
000542          07 A00-R01-CSIOR-S711        PIC 9(08) COMP.            036925      
000543          07 A00-R01-NUMOP-S711        PIC 9(08) COMP.            036930      
000544           07 A00-R01-NUMTR-S711        PIC 9(08) COMP.           036935      
000545          07 A00-R01-INSMN-S711        PIC 9(02) COMP.            036940      
000546       05 A00-R01-MICR-S711.                                      036945      
000547          07 A00-R01-CODSEG-S711       PIC 9(04) COMP.            036947      
000548          07 A00-R01-VERPRE-S711       PIC 9(02) COMP.            036949      
000549          07 A00-R01-CTRMON-S711       PIC 9(02) COMP.            036950      
000550          07 A00-R01-PLCEC-S711        PIC 9(04) COMP.            036952      
000551          07 A00-R01-BNCEM-S711        PIC 9(04) COMP.            036954      
000552          07 A00-R01-DVEIN-S711        PIC 9(02) COMP.            036955      
000553          07 A00-R01-CTACH-S711        PIC 9(12) COMP.            036957      
000554          07 A00-R01-REFCH-S711        PIC 9(08) COMP.            036959      
000555       05 A00-R01-BCREC-S711           PIC 9(04) COMP.            036960      
000556       05 A00-R01-NOMBEN-S711          PIC X(40).                 036962      
000557       05 A00-R01-RFCBCO-S711          PIC X(13).                 036964      
000558       05 A00-R01-FIL-S711             PIC X(05).                 036965      
000559       05 A00-R01-CTABEN-S711          PIC 9(20) COMP.            036970      
000560       05 A00-R01-REFNUM-S711          PIC 9(20) COMP.            036980      
000561       05 A00-R01-FILLER-S711          PIC X(49).                 036985      
000562                                                                  036990      
000563    03 A00-R01-REDS502                 REDEFINES A00-R01-FILXAPL. 037000      
000564       05 A00-R01-RFC-502              PIC  X(13).                037100      
000565       05 A00-R01-TABCPTOS             OCCURS 12 TIMES.           037150      
000566          07 A00-R01-CVECPTO-502       PIC  9(05) COMP.           037200      
000567          07 A00-R01-PDO-502           PIC  9(03) COMP.           037300      
000568          07 A00-R01-EJER-502          PIC  9(04) COMP.           037400      
000569          07 A00-R01-TIPPAG-502        PIC  9(01) COMP.           037500      
000570          07 A00-R01-IMP-502           PIC  9(10) COMP.           037600      
000571          07 FILLER                    PIC  9(01) COMP.           037650      
000572       05 A00-R01-FMA-PAGO-502         PIC  9(02) COMP.           037750      
000573       05 A00-R01-TIPO-IMPTO           PIC  9(02) COMP.           037850      
000574       05 FILLER                       PIC  X(06).                038680      
000575                                                                  038682      
000576    03 A01-R01-REDS254-120             REDEFINES A00-R01-FILXAPL. 038710      
000577       05 A01-R01-FOLIO-AM             PIC  9(04).                038715      
000578       05 A01-R01-LINEA-AM             PIC  9(04).                038720      
000579       05 A01-R01-CANTIDAD-AM          PIC  9(17).                038725      
000580       05 A01-R01-NUMBIEN-AM           PIC  9(08).                038730      
000581       05 A01-R01-TIPBIEN-AM           PIC  X(30).                038735      
000582       05 A01-R01-PROPIET-AM           PIC  X(05).                038740      
000583       05 A01-R01-VALVTA-AM            PIC  9(14)V99.             038745      
000584       05 FILLER                       PIC  X(81).                038750      
000585                                                                  038755      
000586    03 A00-R01-REDS707                 REDEFINES A00-R01-FILXAPL. 038800      
000587       05 A00-R01-COP                  PIC  9(13)        .        038900      
000588       05 A00-R01-IMP-ORIG             PIC  9(16)V99     .        039000      
000589       05 A00-R01-FORMA-COB            PIC  9(02)        .        039100      
000590       05 A00-R01-IND-RECEP-PAGO       PIC  9(01)        .        039200      
000591       05 A00-R01-MDA-PAGO             PIC  9(04)        .        039300      
000592       05 A00-R01-TIPO-CAMBIO          PIC  9(10)V9(06)  .        039400      
000593       05 A00-R01-IND-CLTE-BANAMEX     PIC  9(01)        .        039500      
000594       05 A00-R01-FEC-LIM-PAGO         PIC  9(08)        .        039600      
000595       05 A00-R01-IND-CARGO-DESCUENT   PIC  9(01)        .        039700      
000596       05 A00-R01-DIAS-BASE            PIC  9(02)        .        039800      
000597       05 A00-R0107-PLAZO              PIC  9(02)        .        039900      
000598       05 A00-R01-PERIODO              PIC  9(02)        .        040000      
000599       05 A00-R01-IND-TARIFA           PIC  9(01)        .        040100      
000600       05 A00-R01-VALOR-TARIFA         PIC  9(07)V99     .        040200      
000601       05 A00-R01-ESQUEMA-COBRO        PIC  9(02)        .        040300      
000602       05 A00-R01-DOCUMENTOS           PIC  9(02)        .        040700      
000603       05 FILLER                       PIC  X(81)        .        040800      
000604                                                                  040810      
000605    03 A00-R01-REDS203                 REDEFINES A00-R01-FILXAPL. 040820      
000606       05 A00-R01-CVE-IMPTO1           PIC  9(06).                040830      
000607       05 A00-R01-FORMA-PAG1           PIC  9(03).                040840      
000608       05 A00-R01-IMP-IMPTO1           PIC  9(12).                040850      
000609       05 A00-R01-CVE-IMPTO2           PIC  9(06).                040860      
000610       05 A00-R01-FORMA-PAG2           PIC  9(03).                040870      
000611       05 A00-R01-IMP-IMPTO2           PIC  9(12).                040880      
000612       05 A00-R01-CVE-IMPTO3           PIC  9(06).                040890      
000613       05 A00-R01-FORMA-PAG3           PIC  9(03).                040900      
000614       05 A00-R01-IMP-IMPTO3           PIC  9(12).                040910      
000615       05 A00-R01-CVE-IMPTO4           PIC  9(06).                040920      
000616       05 A00-R01-FORMA-PAG4           PIC  9(03).                040930      
000617       05 A00-R01-IMP-IMPTO4           PIC  9(12).                040940      
000618       05 A00-R01-CVE-IMPTO5           PIC  9(06).                040950      
000619       05 A00-R01-FORMA-PAG5           PIC  9(03).                040960      
000620       05 A00-R01-IMP-IMPTO5           PIC  9(12).                040970      
000621       05 A00-R01-CVE-IMPTO6           PIC  9(06).                040980      
000622       05 A00-R01-FORMA-PAG6           PIC  9(03).                040990      
000623       05 A00-R01-IMP-IMPTO6           PIC  9(12).                041000      
000624       05 A00-R01-CVE-IMPTO7           PIC  9(06).                041010      
000625       05 A00-R01-FORMA-PAG7           PIC  9(03).                041020      
000626       05 A00-R01-IMP-IMPTO7           PIC  9(12).                041030      
000627       05 FILLER                       PIC  X(18).                041040      
000628                                                                  041400      
000629    03 A00-R01-APUDES                  PIC 9(08)  COMP.           138900      
000630    03 A00-R01-STATUS                  PIC 9(02)  COMP.           139000      
000631*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000632                                                                  004800      
000633 FD A02-S151DES                                                   004900      
000634    VALUE OF                                                      005000      
000635                 SECURITYTYPE IS PUBLIC                           005100      
000636                 TITLE IS WKS-ETI-S151-DES                        005200      
000637                 VALUE OF BUFFERS IS 1                            005360      
000638                 BLOCK CONTAINS 120 RECORDS.                      005400      
000639                                                                  005500      
000640*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000641*     COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/DATOSADIC".           005600      
000642 01 A01-R00-HDR-DES .                                             000100      
000643     03 A00-R00-HDR-HD                 PIC X(02).                 000200      
000644     03 A00-R00-HDR-FCH                PIC 9(08).                 000300      
000645     03 FILLER                         PIC X(530).                000400      
000646 01 A01-R01-DATOS.                                                000500      
000647     03 A01-R01-AUTS151ORI             PIC 9(08) COMP.            000600      
000648     03 A01-R01-DATOS-1.                                          000610      
000649        05 A01-R01-REF-BANAMEX         PIC X(26).                 000620      
000650        05 A01-R01-CVECON-YREFLOC REDEFINES                       000640      
000651           A01-R01-REF-BANAMEX         PIC X(26).                 000700      
000652        05 A01-R01-CVECON-Y-REFV REDEFINES A01-R01-REF-BANAMEX.   000800      
000653           07 A01-R01-CONT-ORIG        PIC 9(20) COMP.            000900      
000654           07 A01-R01-REFLOC-BNM       PIC X(12).                 001000      
000655           07 A01-R01-REFLOC-23POS REDEFINES A01-R01-REFLOC-BNM.  001100      
000656              09 A01-R01-COMPREF       PIC 9(01) COMP.            001200      
000657              09 A01-R01-REF23POS      PIC 9(23) COMP.            001250      
000658           07 A01-R01-REFALFA REDEFINES A01-R01-REFLOC-BNM        001270      
000659                                       PIC X(12).                 001290      
000660           07 FILLER                   PIC X(04).                 001300      
000661        05 A01-R01-REFLOC7-BNM REDEFINES A01-R01-REF-BANAMEX.     001400      
000662           07 FILLER                   PIC X(02).                 001500      
000663           07 A01-R01-LOC07BNM         PIC X(24).                 001600      
000664        05 A01-R01-NOMINA-FUN1         PIC 9(14) COMP.            003600      
000665        05 A01-R01-NOMINA-FUN2         PIC 9(14) COMP.            003700      
000666        05 A01-R01-SDO-FIN.                                       003720      
000667           07 A01-R01-SDO-FIN-S500     PIC S9(15)V99 COMP.        003740      
000668           07 FILLER                   PIC X(05).                 003760      
000669        05 A01-R01-NOMINAS-MC REDEFINES A01-R01-SDO-FIN.          003780      
000670           07 A01-R01-NOM-MAKER        PIC 9(14) COMP.            003800      
000671           07 A01-R01-NOM-CHECKER      PIC 9(14) COMP.            003900      
000672        05 A01-R01-REF-CLIENTE         PIC X(16).                 004000      
000673        05 A01-R01-REFERENCIA1         PIC X(35).                 004100      
000674        05 A01-R01-REFERENCIA1-S500 REDEFINES A01-R01-REFERENCIA1.004110      
000675           07 A01-R01-ORIG-HRAMOV      PIC 9(06).                 004120      
000676           07 A01-R01-ORIG-FECMOV      PIC 9(06).                 004130      
000677           07 A01-R01-ORIG-FOLIO       PIC X(12).                 004140      
000678           07 A01-R01-ORIG-MDE         PIC 9(02).                 004150      
000679           07 A01-R01-ORIG-FILREF1     PIC X(09).                 004160      
000680        05 A01-R01-REF2-CTE            PIC X(35).                 004200      
000681        05 A01-R01-REF3-CTE            PIC X(35).                 004300      
000682        05 A01-R01-REF4-CTE            PIC X(35).                 004400      
000683        05 A01-R01-DATOS-2.                                       004450      
000684           07 A01-R01-LEY1             PIC X(40).                 004500      
000685           07 A01-R02-LEY2             PIC X(40).                 004600      
000686           07 A01-R02-LEY3             PIC X(40).                 004700      
000687           07 A01-R02-LEY4             PIC X(40).                 004800      
000688           07 A01-R02-LEY5             PIC X(40).                 004900      
000689           07 A01-R01-FILXAPL          PIC X(120).                004910      
000690           07 A01-R01-FILXAPL-S203 REDEFINES A01-R01-FILXAPL.     004912      
000691              09 A01-R01-CVE-IMPTO10   PIC 9(06).                 004914      
000692              09 A01-R01-FORMA-PAG10   PIC 9(03).                 004916      
000693              09 A01-R01-IMP-IMPTO10   PIC 9(12).                 004918      
000694              09 A01-R01-CVE-IMPTO11   PIC 9(06).                 004920      
000695              09 A01-R01-FORMA-PAG11   PIC 9(03).                 004922      
000696              09 A01-R01-IMP-IMPTO11   PIC 9(12).                 004924      
000697              09 A01-R01-CVE-IMPTO12   PIC 9(06).                 004926      
000698              09 A01-R01-FORMA-PAG12   PIC 9(03).                 004928      
000699              09 A01-R01-IMP-IMPTO12   PIC 9(12).                 004930      
000700              09 A01-R01-CVE-IMPTO13   PIC 9(06).                 004932      
000701              09 A01-R01-FORMA-PAG13   PIC 9(03).                 004934      
000702              09 A01-R01-IMP-IMPTO13   PIC 9(12).                 004936      
000703              09 A01-R01-CVE-IMPTO14   PIC 9(06).                 004938      
000704              09 A01-R01-FORMA-PAG14   PIC 9(03).                 004940      
000705              09 A01-R01-IMP-IMPTO14   PIC 9(12).                 004942      
000706              09 FILLER                PIC X(15).                 004944      
000707                                                                  004946      
000708*          07 A01-R01-FILXAPL-S711 REDEFINES A01-R01-FILXAPL.     004948      
000709*             09 A01-R01-TRUI-S711.                               004949      
000710*                11 A01-R01-CSIREC-S711 PIC 9(08) COMP.           004950      
000711*                11 A01-R01-CSIOR-S711  PIC 9(08) COMP.           004951      
000712*                11 A01-R01-NUMOP-S711  PIC 9(08) COMP.           004952      
000713*                11 A01-R01-NUMTR-S711  PIC 9(08) COMP.           004953      
000714*                11 A01-R01-INSMN-S711  PIC 9(02) COMP.           004954      
000715*             09 A01-R01-MICR-S711.                               004955      
000716*                11 A01-R01-CODSEG-S711 PIC 9(04) COMP.           004956      
000717*                11 A01-R01-VERPRE-S711 PIC 9(02) COMP.           004957      
000718*                11 A01-R01-CTRMON-S711 PIC 9(02) COMP.           004958      
000719*                11 A01-R01-PLCEC-S711  PIC 9(04) COMP.           004959      
000720*                11 A01-R01-BNCEM-S711  PIC 9(04) COMP.           004960      
000721*                11 A01-R01-DVEIN-S711  PIC 9(02) COMP.           004961      
000722*                11 A01-R01-CTACH-S711  PIC 9(12) COMP.           004962      
000723*                11 A01-R01-REFCH-S711  PIC 9(08) COMP.           004963      
000724*             09 A01-R01-CTABEN-S711    PIC 9(20) COMP.           004964      
000725*             09 A01-R01-BCREC-S711     PIC 9(04) COMP.           004965      
000726*             09 A01-R01-NOMBEN-S711    PIC X(40).                004966      
000727*             09 A01-R01-RFCBCO-S711    PIC X(13).                004967      
000728*             09 A01-R01-FILLER-S711    PIC X(19).                004968      
000729                                                                  004969      
000730           07 A01-R01-FILXAPL-S701 REDEFINES A01-R01-FILXAPL.     004970      
000731              09 A01-R01-NVAAUT-S701   PIC 9(08).                 004971      
000732              09 A01-R01-NVASUCTR-S701 PIC 9(04).                 004972      
000733              09 A01-R01-NVACAJTR-S701 PIC 9(02).                 004973      
000734              09 A01-R01-NVAFECT-S701  PIC 9(08).                 004974      
000735              09 A01-R01-NVOMDPA-S701  PIC 9(02).                 004975      
000736              09 A01-R01-NVALINC-S701  PIC X(30).                 004976      
000737              09 A01-R01-FILLER2-S701  PIC X(66).                 004977      
000738                                                                  004978      
000739           07 A01-R01-FILXAPL-S702 REDEFINES A01-R01-FILXAPL.     004979      
000740              09 A01-R01-STTRAN-S702   PIC 9(01).                 004980      
000741              09 A01-R01-CTEEMI-S702   PIC 9(12) COMP.            004981      
000742              09 A01-R01-CTADES-S702   PIC 9(20) COMP.            004982      
000743              09 A01-R01-IDEORI-S702   PIC 9(01).                 004983      
000744              09 A01-R01-IDEDES-S702   PIC 9(01).                 004984      
000745              09 A01-R01-TCTAEM-S702   PIC 9(02) COMP.            004985      
000746              09 A01-R01-TIARCH-S702   PIC X(01).                 004986      
000747              09 A01-R01-FECARC-S702   PIC 9(08) COMP.            004987      
000748              09 A01-R01-SECARC-S702   PIC 9(02) COMP.            004988      
000749              09 A01-R01-AUTORI-S702   PIC 9(20) COMP.            004989      
000750              09 A01-R01-NOMUSU-S702   PIC X(40).                 004990      
000751              09 A01-R01-TCTAUS-S702   PIC 9(02) COMP.            004991      
000752              09 A01-R01-SUCCON-S702   PIC 9(04) COMP.            004992      
000753              09 A01-R01-CAJCON-S702   PIC 9(04) COMP.            004993      
000754              09 A01-R01-FILLER-S702   PIC X(39).                 004994      
000755                                                                  004995      
000756           07 A01-R01-FILXAPL-S500 REDEFINES A01-R01-FILXAPL.     004996      
000757              09 A01-R01-NOMB-CTE          PIC  X(36).            004997      
000758              09 A01-R01-NOMB-BENEF        PIC  X(50).            004998      
000759              09 A01-R01-CVE-RASTREO-S500  PIC  X(30).            004999      
000760* INI VML                                                         005000      
000761              09 A01-R01-CVE-RASTREO-S500-R REDEFINES             005001      
000762                              A01-R01-CVE-RASTREO-S500.           005002      
000763                 11 A01-R01-TIP-CTA-TRASP  PIC 9(02).             005004      
000764                 11 A01-R01-BCO-CTA-TRASP  PIC 9(05).             005006      
000765                 11 A01-R01-NUM-CTA-TRASP  PIC 9(18).             005007      
000766                 11 A01-R01-FILLER-TRASP   PIC X(05).             005008      
000767* FIN VML                                                         005009      
000768              09 A01-R01-FECHA-PAGO        PIC  9(08)     COMP.   005010      
000769        05 A01-R01-DATOS-2-S264 REDEFINES A01-R01-DATOS-2.        005012      
000770           07 A01-R01-NOMINA-FUN3      PIC 9(14) COMP.            005014      
000771           07 A01-R01-COMISION         PIC 9(10)V99 COMP.         005016      
000772           07 A01-R01-SITUACION        PIC 9(10)V99 COMP.         005018      
000773           07 A01-R01-IVA-COMIS        PIC 9(08)V99 COMP.         005020      
000774           07 A01-R01-IVA-SITUACION    PIC 9(08)V99 COMP.         005022      
000775           07 A01-R01-IVA-FISCAL       PIC 9(12)V99 COMP.         005024      
000776           07 A01-R01-FOLIO-RECEP      PIC 9(10) COMP.            005026      
000777           07 A01-R01-OCUPACION        PIC X(40).                 005028      
000778           07 A01-R01-POBLACION        PIC X(40).                 005030      
000779           07 A01-R01-TIPO-CTA         PIC 9(02) COMP.            005032      
000780           07 A01-R01-NUM-CTE          PIC 9(12) COMP.            005034      
000781           07 A01-R01-NUM-CTA          PIC 9(20) COMP.            005036      
000782           07 A01-R01-CVE-TIPO-IDEN    PIC 9(02) COMP.            005038      
000783           07 A01-R01-NUM-IDEN-OFIC    PIC X(18).                 005040      
000784           07 A01-R01-FECHA-NAC-BEN    PIC 9(08) COMP.            005042      
000785           07 A01-R01-DOMICILIO        PIC X(55).                 005044      
000786           07 A01-R01-COLONIA          PIC X(30).                 005046      
000787           07 A01-R01-TELEFONO         PIC X(10).                 005048      
000788           07 A01-R01-COD-POS          PIC 9(06) COMP.            005050      
000789           07 A01-R01-REF-EMISOR       PIC X(20).                 005052      
000790           07 A01-R01-PIN              PIC 9(12) COMP.            005054      
000791           07 A01-R01-TIPO-CHQ-ORD     PIC 9(02) COMP.            005056      
000792           07 A01-R01-FECHA-EVENTO     PIC 9(08) COMP.            005058      
000793           07 A01-R01-CVE-RASTREO-S264 PIC X(30).                 005060      
000794     03 A01-R01-DATOS-1-R    REDEFINES A01-R01-DATOS-1.           005062      
000795        05 A01-R01-SUB-STA-DOC         PIC 9(02) COMP.            005064      
000796        05 A01-R01-SUC-DESTINO         PIC 9(04) COMP.            005066      
000797        05 A01-R01-TIPO-PREV           PIC X(01).                 005068      
000798        05 A01-R01-CAUSA-CAN-DEV       PIC 9(04) COMP.            005070      
000799        05 A01-R01-NVO-BCO-ORI         PIC 9(06) COMP.            005072      
000800        05 A01-R01-NVO-BCO-DES         PIC 9(06) COMP.            005074      
000801        05 A01-R01-NOM-BENEF-IDEN      PIC X(55).                 005076      
000802        05 A01-R01-NVO-NOM-BENEF       PIC X(55).                 005078      
000803        05 A01-R01-RFC-CURP-BENEF      PIC X(18).                 005080      
000804        05 A01-R01-GTOS-ORD-PAGO       PIC 9(16)V99 COMP.         005082      
000805        05 A01-R01-TIPO-PAGO-CECO      PIC 9(02) COMP.            005084      
000806        05 A01-R01-TIPO-PAGO-SPEI      PIC 9(02) COMP.            005086      
000807        05 A01-R01-TIPO-CONVENIO       PIC 9(02) COMP.            005088      
000808        05 A01-R01-PZA-EDO             PIC 9(06) COMP.            005090      
000809        05 A01-R01-TIPO-CTA-ABO        PIC 9(02) COMP.            005092      
000810        05 A01-R01-NUM-CTE-ABO         PIC 9(12) COMP.            005094      
000811        05 A01-R01-NUM-CTA-ABO         PIC 9(20) COMP.            005096      
000812        05 FILLER                      PIC X(358).                005098      
000813                                                                  005100      
000814     03 A01-R01-DATOS-2-S500 REDEFINES A01-R01-DATOS-1.           005102      
000815        05 A01-R01-TRUI.                                          005104      
000816           07 A01-R01-CSIID-RECEPTOR   PIC 9(08) COMP.            005106      
000817           07 A01-R01-CSIID-ORIGEN     PIC 9(08) COMP.            005108      
000818           07 A01-R01-NUM-OPERACION    PIC 9(08) COMP.            005110      
000819           07 A01-R01-NUM-TRANSACCI    PIC 9(08) COMP.            005112      
000820           07 A01-R01-INST-MONETARIO   PIC 9(02) COMP.            005114      
000821        05 A01-R01-MICR.                                          005116      
000822           07 A01-R01-COD-SEGURIDAD    PIC 9(04) COMP.            005118      
000823           07 A01-R01-VER-PREMARCADO   PIC 9(02) COMP.            005120      
000824           07 A01-R01-COD-TRANSMONE    PIC 9(02) COMP.            005122      
000825           07 A01-R01-PLAZA-CECOBAN    PIC 9(04) COMP.            005124      
000826           07 A01-R01-COD-BCOEMISOR    PIC 9(04) COMP.            005126      
000827           07 A01-R01-DIG-VINTERCAM    PIC 9(02) COMP.            005128      
000828           07 A01-R01-NUM-CTACHEQUE    PIC 9(12) COMP.            005130      
000829           07 A01-R01-NUM-REFCHEQUE    PIC 9(08) COMP.            005132      
000830        05 A01-R01-CTA-BENEFOTROBCO    PIC 9(20) COMP.            005134      
000831        05 A01-R01-BCO-RECEPOTROBCO    PIC 9(04) COMP.            005136      
000832        05 A01-R01-NOM-BENEFOTROBCO    PIC X(40).                 005138      
000833        05 A01-R01-RFC-OTROBCO         PIC X(13).                 005140      
000834        05 A01-R01-NOMPAN-S500         PIC X(05).                 005142      
000835        05 A01-R01-OPCPAN-S500         PIC X(01).                 005144      
000836        05 A01-R01-NUMCTO1-S500        PIC 9(16) COMP.            005146      
000837        05 A01-R01-NUMCTO2-S500        PIC 9(16) COMP.            005148      
000838        05 A01-R01-NUMCTO3-S500        PIC 9(16) COMP.            005150      
000839        05 A01-R01-INDIC-EST           PIC 9(08) COMP.            005152      
000840        05 A01-R01-FILLER-DATOS2-S500  PIC X(395).                005160      
000841                                                                  005170      
000842     03 FILLER                         PIC X(01).                 005198      
000843     03 A01-R01-APUDES                 PIC 9(08) COMP.            005200      
000844     03 A01-R01-TIPREG                 PIC 9(02) COMP.            005300      
000845                                                                  005400      
000846*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000847                                                                  005700      
000848/                                                                 005800      
000849 WORKING-STORAGE SECTION.                                         005900      
000850*INICIA CODIGO DE RENOVACION CRONOS 2000                          006000      
000851*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000852*      COPY "S151/CRONOS2K/CPY/WS".                               006100      
000853******************************************************************000100      
000854** This copyBook defines all the additional variables that      **000200      
000855** Unisys has defined for the CRONOS2K project                  **000300      
000856** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000857******************************************************************000500      
000858                                                                  000600      
000859******************************************************************000700      
000860** These Variables are used to Accept the system date in long   **000800      
000861** format and get the century information                       **000900      
000862** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000863 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000864 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000865    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000866    05 FILLER      PIC X(1).                                      001400      
000867    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000868    05 FILLER      PIC X(1).                                      001600      
000869    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000870    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000871      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000872      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000873******************************************************************002100      
000874                                                                  002200      
000875******************************************************************002300      
000876** This variable defines a date in the format MMDDCCAA          **002400      
000877**                                                              **002500      
000878 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000879 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000880    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000881    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000882    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000883    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000884      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000885      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000886******************************************************************003400      
000887                                                                  003500      
000888******************************************************************003600      
000889** This variable defines a date in the format CCAAMMDD          **003700      
000890**                                                              **003800      
000891 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000892 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000893    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000894    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000895      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000896      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000897    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000898    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000899******************************************************************004700      
000900                                                                  004800      
000901******************************************************************004900      
000902** This variable defines a date in the format DDMMCCAA          **005000      
000903**                                                              **005100      
000904 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000905 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000906    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000907    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000908    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000909    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000910      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000911      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000912******************************************************************006000      
000913                                                                  006100      
000914******************************************************************006200      
000915** This variable defines a date in the Julian Format CCAADDD    **006300      
000916**                                                              **006400      
000917 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000918 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000919    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000920    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000921                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000922      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000923      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000924    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000925******************************************************************007300      
000926                                                                  007400      
000927******************************************************************007500      
000928** This variable defines a date in the format AAMMDD            **007600      
000929**                                                              **007700      
000930 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000931 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000932    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000933    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000934    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000935******************************************************************008300      
000936                                                                  008400      
000937******************************************************************008500      
000938** This variable defines a date in the format MMDDAA            **008600      
000939**                                                              **008700      
000940 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000941 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000942    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000943    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000944    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000945******************************************************************009300      
000946                                                                  009400      
000947******************************************************************009500      
000948** This variable defines a date in the format DDMMAA            **009600      
000949**                                                              **009700      
000950 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000951 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000952    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000953    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000954    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000955******************************************************************010300      
000956                                                                  010400      
000957******************************************************************010500      
000958** These variables are defined to be used for CALL bridge logic **010600      
000959**                                                              **010700      
000960 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000961 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000962 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000963 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000964 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000965 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000966******************************************************************011400      
000967                                                                  011500      
000968******************************************************************011600      
000969** This variable is used for converting only a year field AA to **011700      
000970** CCAA and a CCAA to AA                                        **011800      
000971 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000972 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000973    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000974    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000975 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000976 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000977******************************************************************012300      
000978                                                                  012400      
000979******************************************************************012500      
000980** These variables are Bridge Variables for Intercambio files   **012600      
000981** para EDOCTA                                                  **012700      
000982 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000983 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000984 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000985 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000986 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000987 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000988 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000989******************************************************************013500      
000990* Para MODULO                                                     013600      
000991 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000992******************************************************************013800      
000993******************************************************************013900      
000994** Para FMOVSCHABO                                                014000      
000995 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000996******************************************************************014200      
000997                                                                  014300      
000998******************************************************************014400      
000999***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
001000******************************************************************014600      
001001                                                                  014700      
001002 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
001003 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
001004     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
001005     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
001006     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
001007******************************************************************015300      
001008                                                                  015400      
001009******************************************************************015500      
001010***  These Variables Are Defined For Date In AAMM Format       ***015600      
001011******************************************************************015700      
001012                                                                  015800      
001013 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
001014 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
001015     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
001016     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
001017******************************************************************016300      
001018                                                                  016400      
001019                                                                  016500      
001020*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001021*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001022*       COPY "S151/CRONOS2K/CPY/P025/WS".                         006200      
001023******************************************************************000100      
001024*                                                                *000200      
001025*   This copybook has been created to handle the CALL            *000300      
001026*   "S151LIB020 IN LIB-L020" USING WKS-MOV-DATOS                 *000400      
001027*                                  W77-RES-LIB,                  *000500      
001028*                                  W77-RES-FIL.                  *000600      
001029******************************************************************000700      
001030                                                                  000800      
001031 01 A2K-WKS-MOV-DATOS WITH LOWER-BOUNDS.                          000900      
001032*01 A2K-WKS-MOV-DATOS.                                            001000      
001033    03 A2K-WKS-MOV-FUNCION                 PIC  9(02)      COMP.  001100      
001034    03 A2K-WKS-MOV-SISTEMA                 PIC  9(04)      COMP.  001200      
001035    03 A2K-WKS-MOV-PRODUCTO                PIC  9(04)      COMP.  001300      
001036    03 A2K-WKS-MOV-INSTRUMENTO             PIC  9(02)      COMP.  001400      
001037    03 A2K-WKS-MOV-SUCPROM                 PIC  9(04)      COMP.  001500      
001038    03 A2K-WKS-MOV-CONTRATO                PIC  9(16)      COMP.  001600      
001039                                                                  001700      
001040    03 A2K-WKS-TAB-CVEIMP                  OCCURS 5 TIMES.        001800      
001041       04 A2K-WKS-MOV-CVETRAN              PIC  9(04)      COMP.  001900      
001042       04 A2K-WKS-MOV-INDLEY               PIC  9(02)      COMP.  002000      
001043       04 A2K-WKS-MOV-ESQCON               PIC  9(04)      COMP.  002100      
001044       04 A2K-WKS-MOV-IMPORTE              PIC  9(14)V99   COMP.  002200      
001045                                                                  002300      
001046    03 A2K-WKS-MOV-FECMOV                  PIC  9(08)      COMP.  002400      
001047    03 A2K-WKS-MOV-HORMOV                  PIC  9(06)      COMP.  002500      
001048    03 A2K-WKS-MOV-FECCONT                 PIC  9(08)      COMP.  002600      
001049    03 A2K-WKS-MOV-FECCONT-R      REDEFINES A2K-WKS-MOV-FECCONT.  002700      
001050       04 A2K-WKS-MOV-FECCONT-AAMM         PIC  9(06)      COMP.  002800      
001051       04 A2K-WKS-MOV-FECCONT-DD           PIC  9(02)      COMP.  002900      
001052    03 A2K-WKS-MOV-FECVAL                  PIC  9(08)      COMP.  003000      
001053    03 A2K-WKS-MOV-AUTORIZA                PIC  9(08)      COMP.  003100      
001054    03 A2K-WKS-MOV-AUT3ER                  PIC  9(08)      COMP.  003200      
001055    03 A2K-WKS-MOV-REFNUM                  PIC  9(20)      COMP.  003300      
001056    03 A2K-WKS-MOV-CVEMDA                  PIC  9(02)      COMP.  003400      
001057    03 A2K-WKS-MOV-NUMMDA                  PIC  9(20)      COMP.  003500      
001058    03 A2K-WKS-MOV-NUMMDA-R        REDEFINES A2K-WKS-MOV-NUMMDA.  003600      
001059       05 A2K-WKS-MOV-MDA-SUC              PIC  9(04)      COMP.  003700      
001060       05 A2K-WKS-MOV-MDA-CTA              PIC  9(16)      COMP.  003800      
001061    03 A2K-WKS-MOV-CVEMDE                  PIC  9(02)      COMP.  003900      
001062    03 A2K-WKS-MOV-SUC-INIC                PIC  9(04)      COMP.  004000      
001063    03 A2K-WKS-MOV-CAJA-INIC               PIC  9(02)      COMP.  004100      
001064    03 A2K-WKS-MOV-SUCOPER                 PIC  9(04)      COMP.  004200      
001065    03 A2K-WKS-MOV-CAJAOPER                PIC  9(02)      COMP.  004300      
001066    03 A2K-WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.  004400      
001067    03 A2K-WKS-MOV-CAJATRAN                PIC  9(02)      COMP.  004500      
001068    03 A2K-WKS-MOV-NOMINA-OPE              PIC  9(08)      COMP.  004600      
001069    03 A2K-WKS-MOV-ORIGEN                  PIC  9(02)      COMP.  004700      
001070    03 A2K-WKS-MOV-MONEDA                  PIC  9(04)      COMP.  004800      
001071    03 A2K-WKS-MOV-AUT-S151                PIC  9(08)      COMP.  004900      
001072    03 A2K-WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.  005000      
001073    03 A2K-WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.  005100      
001074    03 A2K-WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.  005200      
001075    03 A2K-WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.  005300      
001076    03 A2K-WKS-MOV-CVEAVISO                PIC  9(04)      COMP.  005400      
001077    03 A2K-WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.  005500      
001078    03 A2K-WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.  005600      
001079    03 A2K-WKS-MOV-IND-CONTA               PIC  9(02)      COMP.  005700      
001080    03 A2K-WKS-MOV-IND-NUMREN              PIC  9(02)      COMP.  005800      
001081    03 A2K-WKS-MOV-ACTIVIDAD               PIC  9(06)      COMP.  005900      
001082    03 A2K-WKS-MOV-SECTOR                  PIC  9(02)      COMP.  006000      
001083    03 A2K-WKS-MOV-BANCA                   PIC  9(02)      COMP.  006100      
001084    03 A2K-WKS-MOV-FIL-FUTURO              PIC  X(10).            006200      
001085    03 A2K-WKS-MOV-REDEF-S087 REDEFINES A2K-WKS-MOV-FIL-FUTURO.   006300      
001086       05 FILLER                       PIC  X(03).                006400      
001087       05 A2K-WKS-MOV-FEC-VEN          PIC  9(06)          COMP.  006500      
001088       05 FILLER                       PIC  X(04).                006600      
001089    03 A2K-WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.  006700      
001090    03 A2K-WKS-MOV-APU-DESC                PIC  9(08)      COMP.  006800      
001091    03 A2K-WKS-MOV-STATUS                  PIC  9(02)      COMP.  006900      
001092                                                                  007000      
001093    03 A2K-WKS-MOV-DATOS-ADIC              PIC  X(354).           007100      
001094    03 A2K-WKS-MOV-MOV-DATOS-ADIC-R                               007200      
001095                               REDEFINES A2K-WKS-MOV-DATOS-ADIC.  007300      
001096       05 A2K-WKS-MOV-NOMINA-FUN1          PIC  9(08)      COMP.  007400      
001097       05 A2K-WKS-MOV-NOMINA-FUN2          PIC  9(08)      COMP.  007500      
001098       05 A2K-WKS-MOV-SIST-ORIG            PIC  9(04)      COMP.  007600      
001099       05 A2K-WKS-MOV-PROD-ORIG            PIC  9(04)      COMP.  007700      
001100       05 A2K-WKS-MOV-INST-ORIG            PIC  9(02)      COMP.  007800      
001101       05 A2K-WKS-MOV-CVETR-ORIG           PIC  9(04)      COMP.  007900      
001102       05 A2K-WKS-MOV-CONT-ORIG            PIC  9(20)      COMP.  008000      
001103       05 A2K-WKS-MOV-REFLOC-BNM           PIC  X(14).            008100      
001104       05 A2K-WKS-MOV-FILLERXAPLI          PIC  X(96).            008200      
001105                                                                  008300      
001106       05 A2K-WKS-MOV-REDS084  REDEFINES A2K-WKS-MOV-FILLERXAPLI. 008400      
001107          06 A2K-WKS-MOV-SUCEJE            PIC 9(04)       COMP.  008500      
001108          06 A2K-WKS-MOV-CTAEJE            PIC 9(12)       COMP.  008600      
001109          06 A2K-WKS-MOV-MENSUALIDAD       PIC 9(04)       COMP.  008700      
001110          06 A2K-WKS-MOV-FILS084           PIC X(86).             008800      
001111                                                                  008900      
001112       05 A2K-WKS-MOV-REDS087  REDEFINES A2K-WKS-MOV-FILLERXAPLI. 009000      
001113          06 A2K-WKS-MOV-PZO               PIC 9(04)       COMP.  009100      
001114          06 A2K-WKS-MOV-EMISION           PIC 9(08)       COMP.  009200      
001115          06 A2K-WKS-MOV-FILS087           PIC X(90).             009300      
001116                                                                  009400      
001117       05 A2K-WKS-MOV-REDS408  REDEFINES A2K-WKS-MOV-FILLERXAPLI. 009500      
001118          06 A2K-WKS-MOV-FOLIO             PIC  9(04)      COMP.  009600      
001119          06 A2K-WKS-MOV-NUMLIN            PIC  9(04)      COMP.  009700      
001120          06 A2K-WKS-MOV-FILS408           PIC  X(92).            009800      
001121                                                                  009900      
001122       05 A2K-WKS-MOV-REDS500  REDEFINES A2K-WKS-MOV-FILLERXAPLI. 010000      
001123          06 A2K-WKS-MOV-CVECAUSA          PIC  9(04)      COMP.  010100      
001124          06 A2K-WKS-MOV-FECDEV            PIC  9(06)      COMP.  010200      
001125          06 A2K-WKS-MOV-BCO               PIC  9(04)      COMP.  010300      
001126          06 A2K-WKS-MOV-NOMORD            PIC  X(30).            010400      
001127          06 A2K-WKS-MOV-CAUSAORD          PIC  X(50).            010500      
001128          06 A2K-WKS-MOV-SUCORD            PIC  9(04)      COMP.  010600      
001129          06 A2K-WKS-MOV-FILS500           PIC  X(07).            010700      
001130                                                                  010800      
001131       05 A2K-WKS-MOV-REDS701  REDEFINES A2K-WKS-MOV-FILLERXAPLI. 010900      
001132          06 A2K-WKS-MOV-DATOS-S701        PIC  X(76).            011000      
001133          06 A2K-MOV-PAG-SERV  REDEFINES A2K-WKS-MOV-DATOS-S701.  011100      
001134             07 A2K-WKS-MOV-S701-ID        PIC  X(30).            011200      
001135             07 A2K-WKS-MOV-S701-FCHREC    PIC  9(06)      COMP.  011300      
001136             07 A2K-WKS-MOV-S701-REF1      PIC  X(20).            011400      
001137             07 A2K-WKS-MOV-S701-REF2      PIC  X(20).            011500      
001138             07 A2K-WKS-MOV-S701-TIPPAG    PIC  9(06)      COMP.  011600      
001139             07 A2K-WKS-MOV-S701-TIPPAG-R  REDEFINES              011700      
001140                A2K-WKS-MOV-S701-TIPPAG.                          011800      
001141                08 A2K-WKS-MOV-S701-ESTAB  PIC  9(04)      COMP.  011900      
001142                08 A2K-WKS-MOV-S701-SEQ    PIC  9(02)      COMP.  012000      
001143          06 A2K-WKS-MOV-PAG-IMPT                                 012100      
001144                             REDEFINES A2K-WKS-MOV-DATOS-S701.    012200      
001145             07 A2K-WKS-MOV-S701-RFC       PIC  X(13).            012300      
001146             07 A2K-WKS-MOV-S701-FORMULARI PIC  X(10).            012400      
001147             07 FILLER                     PIC  X(53).            012500      
001148          06 A2K-WKS-MOV-FILS701           PIC  X(20).            012600      
001149       05 A2K-WKS-MOV-LEYENDAS             PIC  X(200).           012700      
001150       05 A2K-WKS-MOV-LEYENDAS-R  REDEFINES A2K-WKS-MOV-LEYENDAS. 012800      
001151          06 A2K-WKS-MOV-LEY1              PIC  X(40).            012900      
001152          06 A2K-WKS-MOV-LEY2              PIC  X(40).            013000      
001153          06 A2K-WKS-MOV-LEY3              PIC  X(40).            013100      
001154          06 A2K-WKS-MOV-LEY4              PIC  X(40).            013200      
001155          06 A2K-WKS-MOV-LEY5              PIC  X(40).            013300      
001156       05 A2K-WKS-MOV-LEYENDAS-R1 REDEFINES A2K-WKS-MOV-LEYENDAS. 013400      
001157          06 A2K-WKS-MOV-ELEM-LEY          OCCURS 5 TIMES.        013500      
001158             07 A2K-WKS-MOV-LEY            PIC  X(40).            013600      
001159             07 A2K-WKS-MOV-LEY-R    REDEFINES A2K-WKS-MOV-LEY.   013700      
001160                08 A2K-WKS-MOV-CHQEXE      PIC  9(10).            013800      
001161                08 A2K-WKS-MOV-CHQGIR      PIC  9(10).            013900      
001162                08 A2K-WKS-MOV-FILL        PIC  X(20).            014000      
001163       05 FILLER                       PIC  X(19).                014100      
001164 01  K                                 PIC  9.                    014200      
001165*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001166 01  A2K-BASE-YEAR     PIC 9(02) VALUE   50.                      006300      
001167*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006400      
001168                                                                  006500      
001169 77 W77-LOGKEY                     PIC 9(08).                     006600      
001170 77 W77-CON-LEI                    PIC 9(08) VALUE ZEROS.         006700      
001171 77 W77-LEI                        PIC 9(06) VALUE ZEROS.         006800      
001172 77 W77-STATUS                     PIC S9(11) BINARY.             006900      
001173 77 W77-ULT-REG-LEIDO              PIC 9(08) VALUE ZEROS.         007000      
001174 77 W77-EOF-SORT                   PIC 9(02) COMP VALUE ZEROS.    007100      
001175 77 W77-CONT-REG                   PIC 9(10) COMP VALUE ZEROS.    007200      
001176 77 W77-CONT-DISP                  PIC 9(06) COMP VALUE ZEROS.    007300      
001177                                                                  007400      
001178                                                                  007500      
001179 77 WKS-STATUS                     PIC S9(11).                    007600      
001180 77 WKS-RES-L020                   PIC S9(11).                    007700      
001181 77 WKK-MOV-AUT-S151               PIC S9(11).                    007800      
001182 77 WKS-R01-APUDES                 PIC 9(08).                     007900      
001183                                                                  008000      
001184 01 WKS-ETI-S151-MOV.                                             008100      
001185    02 WKS-NOM-ARCHMOV    PIC X(34).                              008200      
001186    02 WKS-FEC-ARCHMOV    PIC 9(06).                              008300      
001187    02 FILLER             PIC X(04) VALUE " ON ".                 008400      
001188    02 WKS-PAC-ARCHMOV    PIC X(17).                              008500      
001189    02 FILLER             PIC X(01) VALUE ".".                    008600      
001190                                                                  008700      
001191 01 WKS-ETI-S151-DES.                                             008800      
001192    02 WKS-NOM-ARCHDES    PIC X(34).                              008900      
001193    02 WKS-FEC-ARCHDES    PIC 9(06).                              009000      
001194    02 FILLER             PIC X(04) VALUE " ON ".                 009100      
001195    02 WKS-PAC-ARCHDES    PIC X(17).                              009200      
001196    02 FILLER             PIC X(01) VALUE ".".                    009300      
001197                                                                  009400      
001198******************************************************************009500      
001199                                                                  009600      
001200*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001201* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           009700      
001202**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001203  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001204  01 MENSAJE-LJ.                                                  100300      
001205     02 SISTEMA-LJ     PIC X(04).                                 100400      
001206     02 FILLER         PIC X VALUE "/".                           100500      
001207     02 PASO-LJ        PIC X(04).                                 100600      
001208     02 FILLER         PIC X VALUE "/".                           100700      
001209     02 MTP-LJ         PIC 9(03).                                 100800      
001210     02 FILLER         PIC X VALUE ":".                           100900      
001211     02 TIPO-LJ        PIC X.                                     101000      
001212     02 FILLER         PIC X VALUE ">".                           101100      
001213     02 CODIGO-LJ      PIC 9(06).                                 101200      
001214     02 FILLER         PIC X VALUE "<".                           101300      
001215     02 TEXTO-LJ       PIC X(250).                                101400      
001216*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001217                                                                  009800      
001218******************************************************************009900      
001219                                                                  010000      
001220*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001221* COPY "S151/FORMATO/ENVIO/P025".                                 010100      
001222                                                                  001000      
001223                                                                  002000      
001224                                                                  003000      
001225                                                                  004000      
001226******************************************************************005000      
001227*                                                                *006000      
001228*   FORMATO DE LLAMADO DE MOVIMIENTOS AL S151 PARA TODOS         *007000      
001229*   LOS SISTEMAS:                                                *008000      
001230*   - LONGITUD DEL REGISTRO 540 CARACTERES                       *009000      
001231*     - LONGITUD DE DATOS GENERALES   180 CARACTERES             *010000      
001232*     - LONGITUD DE DATOS ADICIONALES 360 CARACTERES             *011000      
001233*                                                                *012000      
001234******************************************************************013000      
001235                                                                  014000      
001236 01 WKS-MOV-DATOS WITH LOWER-BOUNDS.                              015000      
001237*01 WKS-MOV-DATOS.                                                015010      
001238    03 WKS-MOV-FUNCION                 PIC  9(02)      COMP.      016000      
001239    03 WKS-MOV-SISTEMA                 PIC  9(04)      COMP.      017000      
001240    03 WKS-MOV-PRODUCTO                PIC  9(04)      COMP.      018000      
001241    03 WKS-MOV-TIPOCREDITO REDEFINES WKS-MOV-PRODUCTO             018100      
001242                                       PIC  9(04)      COMP.      018200      
001243    03 WKS-MOV-INSTRUMENTO             PIC  9(02)      COMP.      019000      
001244    03 WKS-MOV-FONDO       REDEFINES WKS-MOV-INSTRUMENTO          019100      
001245                                       PIC  9(02)      COMP.      019200      
001246    03 WKS-MOV-SUCPROM                 PIC  9(04)      COMP.      020000      
001247    03 WKS-MOV-CONTRATO                PIC  9(16)      COMP.      021000      
001248                                                                  022000      
001249    03 WKS-TAB-CVEIMP                  OCCURS 5 TIMES.            023000      
001250       04 WKS-MOV-CVETRAN              PIC  9(04)      COMP.      024000      
001251       04 WKS-MOV-INDLEY               PIC  9(02)      COMP.      025000      
001252       04 WKS-MOV-ESQCON               PIC  9(04)      COMP.      026000      
001253       04 WKS-MOV-TM REDEFINES WKS-MOV-ESQCON                     026100      
001254                                       PIC  9(04)      COMP.      026200      
001255       04 WKS-MOV-IMPORTE              PIC  9(14)V99   COMP.      027000      
001256                                                                  028000      
001257    03 WKS-MOV-FECMOV                  PIC  9(08)      COMP.      029000      
001258    03 WKS-MOV-HORMOV                  PIC  9(06)      COMP.      030000      
001259    03 WKS-MOV-FECCONT                 PIC  9(08)      COMP.      031000      
001260    03 WKS-MOV-FECCONT-R               REDEFINES WKS-MOV-FECCONT. 032000      
001261       04 WKS-MOV-FECCONT-AAMM         PIC  9(06)      COMP.      033000      
001262       04 WKS-MOV-FECCONT-DD           PIC  9(02)      COMP.      034000      
001263    03 WKS-MOV-FECVAL                  PIC  9(08)      COMP.      035000      
001264    03 WKS-MOV-AUTORIZA                PIC  9(08)      COMP.      036000      
001265    03 WKS-MOV-AUT3ER                  PIC  9(08)      COMP.      037000      
001266    03 WKS-MOV-REFNUM                  PIC  9(20)      COMP.      038000      
001267    03 WKS-MOV-REFNUM-S500             REDEFINES WKS-MOV-REFNUM.  038200      
001268         04 WKS-MOV-EFEC-S500          PIC  9(02)      COMP.      038300      
001269         04 WKS-MOV-CHVV               PIC  9(04)      COMP.      038400      
001270         04 WKS-MOV-REFERENCIA         PIC  9(14)      COMP.      038500      
001271    03 WKS-MOV-REFNUM-S087             REDEFINES WKS-MOV-REFNUM.  038552      
001272       04 FILLER                       PIC  9(04)      COMP.      038554      
001273       04 WKS-MOV-PM                   PIC  9(02)      COMP.      038556      
001274       04 WKS-MOV-REF                  PIC  9(14)      COMP.      038558      
001275    03 WKS-MOV-REFNUM-S404             REDEFINES WKS-MOV-REFNUM.  038658      
001276       04 WKS-MOV-IND-EFECTIVO         PIC  9(02)      COMP.      038758      
001277       04 WKS-MOV-PORCENTAJE-DESCUENTO PIC  99V99      COMP.      038808      
001278       04 WKS-MOV-ZEROS                PIC  9(08)      COMP.      038858      
001279       04 WKS-MOV-REF-S404             PIC  9(06)      COMP.      038958      
001280    03 WKS-MOV-CVEMDA                  PIC  9(02)      COMP.      039000      
001281    03 WKS-MOV-NUMMDA                  PIC  9(20)      COMP.      040000      
001282    03 WKS-MOV-NUMMDA-R                REDEFINES WKS-MOV-NUMMDA.  041000      
001283       05 WKS-MOV-MDA-SUC              PIC  9(04)      COMP.      042000      
001284       05 WKS-MOV-MDA-CTA              PIC  9(16)      COMP.      043000      
001285    03 WKS-MOV-CVEMDE                  PIC  9(02)      COMP.      044000      
001286    03 WKS-MOV-SUC-INIC                PIC  9(04)      COMP.      045000      
001287    03 WKS-MOV-CAJA-INIC               PIC  9(02)      COMP.      046000      
001288    03 WKS-MOV-SUCOPER                 PIC  9(04)      COMP.      047000      
001289    03 WKS-MOV-CAJAOPER                PIC  9(02)      COMP.      048000      
001290    03 WKS-MOV-SUCTRAN                 PIC  9(04)      COMP.      049000      
001291    03 WKS-MOV-CAJATRAN                PIC  9(02)      COMP.      050000      
001292    03 WKS-MOV-NOMINA-OPE              PIC  9(08)      COMP.      051000      
001293    03 WKS-MOV-ORIGEN                  PIC  9(02)      COMP.      052000      
001294    03 WKS-MOV-MONEDA                  PIC  9(04)      COMP.      053000      
001295    03 WKS-MOV-AUT-S151                PIC  9(08)      COMP.      054000      
001296    03 WKS-MOV-AUT-AELIM-S151          PIC  9(08)      COMP.      055000      
001297    03 WKS-MOV-AUT-ANT-S151            PIC  9(08)      COMP.      056000      
001298    03 WKS-MOV-TIPO-PROC               PIC  9(02)      COMP.      057000      
001299    03 WKS-MOV-SOBREGIRO               PIC  9(02)      COMP.      058000      
001300    03 WKS-MOV-CVEAVISO                PIC  9(04)      COMP.      059000      
001301    03 WKS-MOV-IND-EDOCTA              PIC  9(02)      COMP.      060000      
001302    03 WKS-MOV-IND-DATOS-ADIC          PIC  9(02)      COMP.      061000      
001303    03 WKS-MOV-IND-CONTA               PIC  9(02)      COMP.      062000      
001304    03 WKS-MOV-FEC-ULTMOV              PIC  9(08)      COMP.      062100      
001305    03 WKS-MOV-FEC-ULTMOV-R REDEFINES WKS-MOV-FEC-ULTMOV.         062200      
001306       05 WKS-MOV-IND-NUMREN           PIC  9(02)      COMP.      063000      
001307       05 WKS-MOV-ACTIVIDAD            PIC  9(06)      COMP.      064000      
001308    03 WKS-MOV-SECTOR                  PIC  9(02)      COMP.      065000      
001309    03 WKS-MOV-BANCA                   PIC  9(02)      COMP.      066000      
001310    03 WKS-MOV-FIL-FUTURO              PIC  X(07).                067000      
001311    03 WKS-MOV-REDEF-S264 REDEFINES WKS-MOV-FIL-FUTURO.           067010      
001312       05 WKS-BCO-S264                 PIC  9(08) COMP.           067050      
001313       05 WKS-MOV-BORI-S264            PIC  9(03) COMP.           067070      
001314       05 WKS-MOV-BDES-S264            PIC  9(03) COMP.           067090      
001315    03 WKS-MOV-REDEF-S087 REDEFINES WKS-MOV-FIL-FUTURO.           067100      
001316       05 WKS-MOV-FEC-VEN              PIC  9(08)      COMP.      067400      
001317       05 FILLER                       PIC  X(03).                067500      
001318    03 WKS-MOV-REDEF-S500 REDEFINES WKS-MOV-FIL-FUTURO.           067520      
001319       05 WKS-MOV-S015                 PIC  9(08) COMP.           067560      
001320       05 WKS-MOV-BCO-ORI              PIC  9(03) COMP.           067580      
001321       05 WKS-MOV-BCO-DES              PIC  9(03) COMP.           067600      
001322    03 WKS-MOV-REDEF-S501 REDEFINES WKS-MOV-FIL-FUTURO.           067620      
001323       05 WKS-MOV-CAJA-S501            PIC  9(04)      COMP.      067660      
001324       05 FILLER                       PIC  X(05).                067680      
001325    03 WKS-MOV-REDEF-S403 REDEFINES WKS-MOV-FIL-FUTURO.           067700      
001326       05 WKS-MOV-FOLIO-S403           PIC  9(04)       COMP.     067740      
001327       05 WKS-MOV-RENGLON-S403         PIC  9(02)       COMP.     067760      
001328       05 WKS-MOV-SCVECON-S403         PIC  9(04)       COMP.     067780      
001329       05 FILLER                       PIC  X(02).                067800      
001330    03 WKS-MOV-REDEF-S252 REDEFINES WKS-MOV-FIL-FUTURO.           067810      
001331       05 WKS-MOV-FEC-PARTIDA          PIC  9(08)       COMP.     067820      
001332       05 FILLER                       PIC  X(03).                067830      
001333    03 WKS-MOV-NODO-ORIG               PIC  9(02)      COMP.      068000      
001334    03 WKS-MOV-APU-DESC                PIC  9(08)      COMP.      069000      
001335    03 WKS-MOV-STATUS                  PIC  9(02)      COMP.      070000      
001336                                                                  071000      
001337    03 WKS-MOV-DATOS-ADIC              PIC  X(354).               072000      
001338    03 WKS-MOV-MOV-DATOS-ADIC-R   REDEFINES WKS-MOV-DATOS-ADIC.   073000      
001339       05 WKS-MOV-NOMINA-FUN1          PIC  9(08)      COMP.      074000      
001340       05 WKS-MOV-NOMINA-FUN2          PIC  9(08)      COMP.      075000      
001341       05 WKS-MOV-SIST-ORIG            PIC  9(04)      COMP.      076000      
001342       05 WKS-MOV-PROD-ORIG            PIC  9(04)      COMP.      077000      
001343       05 WKS-MOV-INST-ORIG            PIC  9(02)      COMP.      078000      
001344       05 WKS-MOV-CVECON-YREFLOC       PIC  X(26).                078100      
001345       05 WKS-MOV-CVECON-REF-R REDEFINES WKS-MOV-CVECON-YREFLOC.  078200      
001346          06 WKS-MOV-CVETR-ORIG        PIC  9(04)      COMP.      079000      
001347          06 WKS-MOV-CONT-ORIG         PIC  9(20)      COMP.      080000      
001348          06 WKS-MOV-REFLOC-BNM        PIC  X(14).                081000      
001349          06 WKS-MOV-REFLOC-OC         REDEFINES                  081100      
001350             WKS-MOV-REFLOC-BNM.                                  081200      
001351             07 WKS-MOV-REFLOC-PZA     PIC  9(03)      COMP.      081300      
001352             07 WKS-MOV-REFLOC-SUC     PIC  9(03)      COMP.      081400      
001353             07 WKS-MOV-REFLOC-TERM    PIC  X(04).                081500      
001354             07 WKS-MOV-REFLOC-AUT     PIC  9(06)      COMP.      081600      
001355             07 WKS-MOV-REFLOC-VF      PIC  9(01)      COMP.      081700      
001356             07 WKS-MOV-REFLOC-TCHQ    PIC  9(01)      COMP.      081800      
001357             07 FILLER                 PIC  X(03).                081900      
001358       05 WKS-MOV-FILLERXAPLI          PIC  X(96).                082000      
001359                                                                  083000      
001360       05 WKS-MOV-REDS084          REDEFINES WKS-MOV-FILLERXAPLI. 083100      
001361          06 WKS-MOV-SUCEJE            PIC 9(04)       COMP.      083200      
001362          06 WKS-MOV-CTAEJE            PIC 9(12)       COMP.      083300      
001363          06 WKS-MOV-MENSUALIDAD       PIC 9(04)       COMP.      083350      
001364          06 WKS-MOV-FILS084           PIC X(86).                 083400      
001365                                                                  083500      
001366       05 WKS-MOV-REDS087          REDEFINES WKS-MOV-FILLERXAPLI. 084000      
001367          06 WKS-MOV-PZO               PIC 9(04)       COMP.      085000      
001368          06 WKS-MOV-EMISION           PIC 9(08)       COMP.      086000      
001369          06 WKS-MOV-FILS087           PIC X(90).                 087000      
001370                                                                  088000      
001371       05 WKS-MOV-REDS408          REDEFINES WKS-MOV-FILLERXAPLI. 089000      
001372          06 WKS-MOV-FOLIO             PIC  9(04)      COMP.      090000      
001373          06 WKS-MOV-NUMLIN            PIC  9(04)      COMP.      091000      
001374          06 WKS-MOV-BCOS              PIC  9(04)      COMP.      091100      
001375          06 WKS-MOV-FILS408           PIC  X(90).                092000      
001376                                                                  093000      
001377       05 WKS-MOV-REDS500          REDEFINES WKS-MOV-FILLERXAPLI. 094000      
001378          06 WKS-MOV-CVECAUSA          PIC  9(04)      COMP.      095000      
001379          06 WKS-MOV-FECDEV            PIC  9(08)      COMP.      096000      
001380          06 WKS-MOV-BCO               PIC  9(04)      COMP.      097000      
001381          06 WKS-MOV-NOMORD            PIC  X(30).                098000      
001382          06 WKS-MOV-CAUSAORD          PIC  X(50).                099000      
001383          06 WKS-MOV-SUCORD            PIC  9(04)      COMP.      100000      
001384          06 WKS-MOV-CTACON            PIC  9(02)      COMP.      100100      
001385          06 WKS-MOV-FILS500           PIC  X(05).                101000      
001386                                                                  102000      
001387       05 WKS-MOV-REDS403           REDEFINES WKS-MOV-FILLERXAPLI.102050      
001388          06 WKS-MOV-OPCION         PIC  9(02)    COMP.           102100      
001389          06 WKS-MOV-FECCOTI        PIC  9(06)    COMP.           102150      
001390          06 WKS-MOV-FIDEICO        PIC  9(06)    COMP.           102200      
001391          06 WKS-MOV-IMPVAL         PIC  9(14)V99 COMP.           102250      
001392          06 WKS-MOV-SUCADIC        PIC  9(04)    COMP.           102300      
001393          06 WKS-MOV-CAJAADIC       PIC  9(02)    COMP.           102350      
001394          06 WKS-MOV-PROGRAMA       PIC  9(04)    COMP.           102400      
001395          06 WKS-MOV-PLAZO          PIC  9(04)    COMP.           102450      
001396          06 WKS-MOV-TIPOPLAZO      PIC  9(02)    COMP.           102500      
001397          06 WKS-MOV-TASAREF        PIC  9(06)V99 COMP.           102550      
001398          06 WKS-MOV-TASAREAL       PIC  9(04)V9999 COMP.         102600      
001399          06 WKS-MOV-CTE            PIC  9(12)    COMP.           102650      
001400          06 WKS-MOV-TIPOCREALFA    PIC  X(08).                   102670      
001401          06 WKS-MOV-AUTS151ORI     PIC  9(08)    COMP.           102690      
001402          06 WKS-MOV-TIPOCON        PIC  9(02)    COMP.           102710      
001403          06 WKS-MOV-INDCONTABLE    PIC  9(02)    COMP.           102730      
001404          06 FILLER                 PIC  X(45).                   102750      
001405                                                                  102800      
001406      05 WKS-MOV-REDS404           REDEFINES WKS-MOV-FILLERXAPLI. 102805      
001407         06 WKS-MOV-PRODUCTONAT    PIC  9(04)    COMP.            102810      
001408         06 WKS-MOV-NUMPAGO        PIC  9(04)    COMP.            102812      
001409         06 WKS-MOV-FIDEICOMISO    PIC  9(06)    COMP.            102815      
001410         06 WKS-MOV-VAL-UDI        PIC  9(02)V9(06) COMP.         102820      
001411         06 WKS-MOV-PRODGEN        PIC  9(03)    COMP.            102825      
001412         06 WKS-MOV-SUBPRODGEN     PIC  9(03)    COMP.            102830      
001413         06 WKS-MOV-ESTATUS-CRED   PIC  9(02)    COMP.            102840      
001414         06 WKS-MOV-FASE-CRED      PIC  9(02)    COMP.            102845      
001415         06 WKS-MOV-TRAS-CARVEN    PIC  9(02)    COMP.            102850      
001416         06 WKS-MOV-ESTATUS-PAGO   PIC  9(02)    COMP.            102855      
001417         06 WKS-MOV-ESTATUS-MEN    PIC  9(02)    COMP.            102860      
001418         06 WKS-MOV-ESTATUS-CARVEN PIC  9(02)    COMP.            102865      
001419         06 WKS-MOV-CONCEPTOS     OCCURS 5 TIMES.                 102870      
001420            08 WKS-MOV-CONCEPTO    PIC  9(04)    COMP.            102875      
001421         06 WKS-MOV-ESQUEMAS-CONT OCCURS 5 TIMES.                 102880      
001422            08 WKS-MOV-ESQ-CONT    PIC  9(02)    COMP.            102885      
001423         06 WKS-MOV-MOVIMIENTOS   OCCURS 5 TIMES.                 102890      
001424            08 WKS-MOV-MOVIMIENTO  PIC  9(04)    COMP.            102895      
001425         06 WKS-MOV-CONSECUTIVO   OCCURS 5 TIMES.                 102897      
001426            08 WKS-MOV-CONSEC      PIC  9(10)    COMP.            102899      
001427         06 WKS-MOV-FOLIO-S404     PIC  9(04)    COMP.            102905      
001428         06 WKS-MOV-NUM-PROG       PIC  9(04)    COMP.            102915      
001429         06 WKS-MOV-CVE-ESPECIAL   PIC  9(02)    COMP.            102920      
001430         06 WKS-MOV-STATION        PIC  X(08).                    102925      
001431         06 WKS-MOV-PANTALLA       PIC  X(05).                    102935      
001432         06 FILLER                 PIC  X(08).                    102945      
001433                                                                  102955      
001434      05 WKS-MOV-REDS701          REDEFINES WKS-MOV-FILLERXAPLI.  103000      
001435          06 WKS-MOV-DATOS-S701        PIC  X(95).                104000      
001436          06 MOV-MOV-PAG-SERV      REDEFINES WKS-MOV-DATOS-S701.  105000      
001437             07 WKS-MOV-S701-ID        PIC  X(30).                106000      
001438             07 WKS-MOV-S701-FCHREC    PIC  9(06).                107000      
001439             07 WKS-MOV-S701-REF1      PIC  X(20).                108000      
001440             07 WKS-MOV-S701-REF2      PIC  X(20).                109000      
001441             07 WKS-MOV-S701-TIPPAG    PIC  9(06).                110000      
001442             07 WKS-MOV-S701-TIPPAG-R  REDEFINES                  111000      
001443                WKS-MOV-S701-TIPPAG.                              112000      
001444                08 WKS-MOV-S701-ESTAB  PIC  9(04).                113000      
001445                08 WKS-MOV-S701-SEQ    PIC  9(02).                114000      
001446             07 WKS-MOV-S701-AUT       PIC  9(08).                114050      
001447             07 WKS-MOV-S701-FPAGO     PIC  9(02).                114100      
001448             07 WKS-MOV-S701-EBPP      PIC  9(03).                114200      
001449          06 WKS-MOV-PAG-IMPT       REDEFINES WKS-MOV-DATOS-S701. 115000      
001450             07 WKS-MOV-S701-RFC       PIC  X(13).                116000      
001451             07 WKS-MOV-S701-FORMULARI PIC  X(10).                117000      
001452             07 FILLER                 PIC  X(72).                118000      
001453          06 WKS-MOV-FILS701           PIC  X(01).                119000      
001454      05 WKS-MOV-REDS702          REDEFINES WKS-MOV-FILLERXAPLI.  119020      
001455         06 WKS-MOV-S702-CTE           PIC  9(12).                119040      
001456         06 WKS-MOV-S702-CTA           PIC  X(40).                119050      
001457         06 FILLER                     PIC  X(44).                119060      
001458       05 WKS-MOV-LEYENDAS             PIC  X(200).               119100      
001459       05 WKS-MOV-LEYENDAS-R           REDEFINES WKS-MOV-LEYENDAS.119200      
001460          06 WKS-MOV-LEY1              PIC  X(40).                120000      
001461          06 WKS-MOV-LEY2              PIC  X(40).                121000      
001462          06 WKS-MOV-LEY3              PIC  X(40).                122000      
001463          06 WKS-MOV-LEY4              PIC  X(40).                123000      
001464          06 WKS-MOV-LEY5              PIC  X(40).                124000      
001465       05 WKS-MOV-LEYENDAS-R1          REDEFINES WKS-MOV-LEYENDAS.124100      
001466          06 WKS-MOV-ELEM-LEY          OCCURS 5 TIMES.            124200      
001467             07 WKS-MOV-LEY            PIC  X(40).                124300      
001468             07 WKS-MOV-LEY-R          REDEFINES WKS-MOV-LEY.     124400      
001469                08 WKS-MOV-CHQEXE      PIC  9(10).                124500      
001470                08 WKS-MOV-CHQGIR      PIC  9(10).                124600      
001471                08 WKS-MOV-FILL        PIC  X(20).                124700      
001472       05 WKS-MOV-SALDO                PIC S9(15)V99 COMP.        124800      
001473       05 WKS-MOV-IMPBASE-ESQFINAN     PIC  9(14)V99 COMP.        124900      
001474       05 FILLER                       PIC  X(02).                125000      
001475                                                                  126000      
001476******************************************************************127000      
001477* DATOS REQUERIDOS PARA:                                          128000      
001478*                                                                 129000      
001479* INICIO, FIN Y ELIMINACION DE PROCESO:                           130000      
001480*    WKS-MOV-FUNCION                                              131000      
001481*    WKS-MOV-SISTEMA                                              132000      
001482*    WKS-MOV-TIPO-PROC                                            133000      
001483*    WKS-MOV-FECCONT                                              134000      
001484*                                                                 135000      
001485*                                                                 136000      
001486* ELIMINACION A PARTIR DE UNA AUTORIZACION DEL S151               137000      
001487*    WKS-MOV-FUNCION                                              138000      
001488*    WKS-MOV-SISTEMA                                              139000      
001489*    WKS-MOV-FECCONT                                              140000      
001490*    WKS-MOV-AUT-AELIM-S151                                       141000      
001491*    NUMERO DE AUTORIZACION INICIAL A ELIMINAR                    142000      
001492*    WKS-MOV-AUT-ANT-S151                                         143000      
001493*    NUMERO DE AUTORIZACION FINAL   A ELIMINAR                    144000      
001494*    (SI ESTE CAMPO ES IGUAL A CEROS LA ELIMINACION ES DESDE EL   145000      
001495*     AUTORIZACION INICIAL A ELIMINAR HASTA EL FIN DE ARCHIVO)    146000      
001496*                                                                 147000      
001497******************************************************************148000      
001498*    MOVE "S151L002R" TO WKS-LIBID-NOMB.                          148050      
001499*    ACCEPT LOG-SISTEMA                                           148100      
001500*    MOVE LOG-SISTEMA TO WKS-LIBID-SIST.                          148150      
001501*    CALL "DAME_TIT IN CTRLVERS" USING WKS-CTLVER-LIBID           148200      
001502*                                     WKS-CTLVER-NOMLIB           148250      
001503*                              GIVING W77-CTLVER-RSLT.            148300      
001504*    IF W77-CTLVER-RSLT = 0                                       148350      
001505*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148400      
001506*                                 WKS-CTLVER-NOMLIB               148450      
001507*    ELSE                                                         148500      
001508*       CHANGE ATTRIBUTE TITLE OF "LIB-REGISTRA" TO               148550      
001509*       "(S151)S151/OBJECT/L002/REGISTRASNNN/01MTP00  ON CMEMP.". 148600      
001510*                                                                 148650      
001511*                                                                 148700      
001512*    CALL "CARGAMOV1 IN LIB-REGISTRA"  USING LOG-DATOS            149000      
001513*                               GIVING WS-151-RESULT              150000      
001514*                                                                 151000      
001515                                                                  152000      
001516                                                                  153000      
001517                                                                  154000      
001518                                                                  155000      
001519                                                                  156000      
001520*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001521                                                                  010200      
001522*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001523* COPY "(S151)S151/FORMATO/ERROR/DMSII." FROM                     010300      
001524*      1000 TO 59000.                                             010400      
001525                                                                  001000      
001526                                                                  002000      
001527                                                                  003000      
001528*=================================================================004000      
001529*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
001530*=================================================================006000      
001531                                                                  007000      
001532                                                                  008000      
001533                                                                  009000      
001534 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
001535 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
001536 01 WKS-TAB-ERRDMSII.                                             012000      
001537    02 FILLER                      PIC X(20)     VALUE            013000      
001538    "NOTFOUND          01".                                       014000      
001539    02 FILLER                      PIC X(20)     VALUE            015000      
001540    "DUPLICATES        02".                                       016000      
001541    02 FILLER                      PIC X(20)     VALUE            017000      
001542    "DEADLOCK          03".                                       018000      
001543    02 FILLER                      PIC X(20)     VALUE            019000      
001544    "DATAERROR         04".                                       020000      
001545    02 FILLER                      PIC X(20)     VALUE            021000      
001546    "NOTLOCKED         05".                                       022000      
001547    02 FILLER                      PIC X(20)     VALUE            023000      
001548    "KEYCHANGE         06".                                       024000      
001549    02 FILLER                      PIC X(20)     VALUE            025000      
001550    "SYSTEMERROR       07".                                       026000      
001551    02 FILLER                      PIC X(20)     VALUE            027000      
001552    "READONLY          08".                                       028000      
001553    02 FILLER                      PIC X(20)     VALUE            029000      
001554    "IOERROR           09".                                       030000      
001555    02 FILLER                      PIC X(20)     VALUE            031000      
001556    "LIMITERROR        10".                                       032000      
001557    02 FILLER                      PIC X(20)     VALUE            033000      
001558    "OPENERROR         11".                                       034000      
001559    02 FILLER                      PIC X(20)     VALUE            035000      
001560    "CLOSEERROR        12".                                       036000      
001561    02 FILLER                      PIC X(20)     VALUE            037000      
001562    "NORECORD          13".                                       038000      
001563    02 FILLER                      PIC X(20)     VALUE            039000      
001564    "INUSE             14".                                       040000      
001565    02 FILLER                      PIC X(20)     VALUE            041000      
001566    "AUDITERROR        15".                                       042000      
001567    02 FILLER                      PIC X(20)     VALUE            043000      
001568    "ABORT             16".                                       044000      
001569    02 FILLER                      PIC X(20)     VALUE            045000      
001570    "SECURITYERROR     17".                                       046000      
001571    02 FILLER                      PIC X(20)     VALUE            047000      
001572    "VERSIONERROR      18".                                       048000      
001573    02 FILLER                      PIC X(20)     VALUE            049000      
001574    "FATALERROR        19".                                       050000      
001575    02 FILLER                      PIC X(20)     VALUE            051000      
001576    "INTEGRITY ERROR   20".                                       052000      
001577    02 FILLER                      PIC X(20)     VALUE            053000      
001578    "INTLIBERROR       21".                                       054000      
001579 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
001580    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
001581       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
001582       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
001583                                                                  059000      
001584*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001585*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001586* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL".                   010500      
001587*================================================================ 000100      
001588*         ENTRY-POINT CONSISDIA :                               = 000200      
001589*                                                                 000300      
001590* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
001591* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
001592* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
001593* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
001594* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
001595* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
001596* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
001597* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
001598* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
001599* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
001600*                                                               = 001400      
001601*================================================================ 001500      
001602                                                                  001600      
001603                                                                  001700      
001604*================================================================ 001800      
001605* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
001606*                                                               = 002000      
001607* ENTRADA REQUERIDA :                                           = 002100      
001608*                                                               = 002200      
001609*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
001610*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
001611*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
001612*================================================================ 002600      
001613 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
001614    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
001615    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
001616    03 WKS-B01-CSI                 PIC 9(02).                     003000      
001617    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
001618    03 WKS-B01-FECCON              PIC 9(08).                     003202      
001619    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
001620    03 WKS-B01-STAREG              PIC 9(02).                     003400      
001621    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
001622    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
001623    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
001624    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
001625    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
001626    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
001627    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
001628    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
001629    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
001630    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
001631    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
001632    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
001633    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
001634       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
001635       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
001636       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
001637       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
001638*==============================================================   005200      
001639*                                                             =   005300      
001640* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
001641*                                                             =   005500      
001642* CAMPOS REQUERIDOS :                                         =   005600      
001643*                                                             =   005700      
001644* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
001645* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
001646* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
001647* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
001648*==============================================================   006200      
001649 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
001650    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
001651    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
001652    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
001653    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
001654                                                                  006800      
001655*==============================================================   006900      
001656*                                                             =   007000      
001657* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
001658*                                                             =   007200      
001659* CAMPOS REQUERIDOS :                                         =   007300      
001660*                                                             =   007400      
001661* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
001662* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
001663* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
001664* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
001665*==============================================================   007900      
001666 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
001667    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
001668    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
001669    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
001670    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
001671                                                                  008500      
001672*==============================================================   008600      
001673*                                                             =   008700      
001674* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
001675*                                                             =   008900      
001676* CAMPOS REQUERIDOS :                                         =   009000      
001677*                                                             =   009100      
001678* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
001679* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
001680* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
001681* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
001682*==============================================================   009600      
001683 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
001684    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
001685    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
001686    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
001687    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
001688                                                                  010200      
001689*============================================================     010300      
001690* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
001691*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
001692*                                                           =     010600      
001693*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
001694*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
001695*                                                           =     010900      
001696*  ENTRADA REQUERIDA.                                       =     011000      
001697*                                                           =     011100      
001698*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
001699*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
001700*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
001701*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
001702*============================================================     011600      
001703                                                                  011700      
001704 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
001705     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
001706     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
001707     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
001708     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
001709                                                                  012300      
001710*=============================================================    012400      
001711*                                                            =    012500      
001712* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
001713*             B01-SIS-FECARMOV.                              =    012700      
001714*                                                            =    012800      
001715* ENTRADA REQUERIDAD :                                       =    012900      
001716*                                                            =    013000      
001717*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
001718*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
001719*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
001720*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
001721*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
001722*=============================================================    013600      
001723                                                                  013700      
001724 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
001725     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
001726     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
001727     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
001728     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
001729     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
001730*================================================================ 014400      
001731*                                                               = 014500      
001732* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
001733*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
001734*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
001735*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
001736*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
001737*                                                               = 015100      
001738* ENTRADA REQUERIDA :                                           = 015200      
001739*                                                               = 015300      
001740* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
001741* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
001742* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
001743* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
001744* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
001745*================================================================ 015900      
001746 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
001747    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
001748    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
001749    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
001750    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
001751    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
001752                                                                  016600      
001753*============================================================     016700      
001754*                                                           =     016800      
001755* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
001756*                                                           =     017000      
001757* DATOS REQUERIDOS :                                        =     017100      
001758*                                                           =     017200      
001759* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
001760* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
001761* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
001762* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
001763* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
001764*============================================================     017800      
001765                                                                  017900      
001766 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
001767     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
001768     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
001769     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
001770     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
001771     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
001772                                                                  018600      
001773*============================================================     018700      
001774*                                                           =     018800      
001775* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
001776*                                                           =     019000      
001777* DATOS REQUERIDOS :                                        =     019100      
001778*                                                           =     019200      
001779* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
001780* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
001781* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
001782* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
001783* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
001784*============================================================     019800      
001785                                                                  019900      
001786 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
001787     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
001788     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
001789     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
001790     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
001791     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
001792                                                                  020600      
001793*===============================================================  020700      
001794*                                                              =  020800      
001795* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
001796*              MOVIMIENTOS.                                    =  021000      
001797* DATOS REQUERIDOS :                                           =  021100      
001798*                                                              =  021200      
001799* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
001800* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
001801* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
001802* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
001803* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
001804* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
001805*==============================================================   021900      
001806                                                                  022000      
001807 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
001808     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
001809     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
001810     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
001811     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
001812     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
001813     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
001814*==============================================================   022800      
001815*                                                             =   022900      
001816* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
001817*                                                             =   023100      
001818* CAMPOS REQUERIDOS :                                         =   023200      
001819*                                                             =   023300      
001820* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
001821* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
001822* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
001823* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
001824*==============================================================   023800      
001825 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
001826    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
001827    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
001828    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
001829    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
001830                                                                  024304      
001831*=================================================================024306      
001832*                ENTRY POINT CONSISB01                           =024308      
001833*                                                                =024310      
001834*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
001835*                                                                =024314      
001836*  FUNCIONES DISPONIBLES :                                       =024316      
001837*                                                                =024318      
001838*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
001839*                                                                =024322      
001840*  PARAMETROS REQUERIDOS                                         =024324      
001841*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
001842*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
001843*=================================================================024330      
001844                                                                  024332      
001845 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
001846     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
001847     03 WKS-CON-CSI                PIC 9(02).                     024336      
001848     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
001849     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
001850        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
001851        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
001852        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
001853        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
001854        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
001855                                                                  024400      
001856*=================================================================024500      
001857*                ENTRY POINT B02ARCINTER                         =024600      
001858*                                                                =024700      
001859*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
001860*                                                                =024900      
001861*  FUNCIONES DISPONIBLES :                                       =025000      
001862*                                                                =025100      
001863*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
001864* 19.- ALTAS DE ARCHIVOS.                                        =025300      
001865* 22.- BAJAS DE ARCHIVOS.                                        =025400      
001866* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
001867*                                                                =025600      
001868*  PARAMETROS REQUERIDOS                                         =025700      
001869*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
001870*                                                                =025900      
001871*=================================================================026000      
001872 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
001873     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
001874     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
001875     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
001876     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
001877     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
001878     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
001879     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
001880     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
001881     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
001882     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
001883     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
001884     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
001885     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
001886     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
001887     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
001888     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
001889     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
001890     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
001891     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
001892     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
001893     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
001894     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
001895     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
001896     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
001897     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
001898     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
001899     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
001900     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
001901                                                                  029000      
001902*=================================================================029100      
001903*                ENTRY POINT B04SISTEMA                          =029200      
001904*                                                                =029300      
001905*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
001906*                                                                =029500      
001907*  FUNCIONES DISPONIBLES :                                       =029600      
001908*                                                                =029700      
001909*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
001910*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
001911*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
001912*                                                                =030100      
001913*  PARAMETROS REQUERIDOS                                         =030200      
001914*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
001915*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
001916*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
001917*                                                                =030600      
001918*=================================================================030700      
001919 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
001920     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
001921     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
001922     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
001923     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
001924     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
001925     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
001926     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
001927                                                                  031600      
001928*================================================================ 031700      
001929*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
001930*                                                               = 031900      
001931*  FUNCION                                                      = 032000      
001932*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
001933*   19       ALTAS.                                             = 032200      
001934*   22       BAJAS                                              = 032300      
001935*   37       CAMBIOS.                                           = 032400      
001936*                                                               = 032500      
001937*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
001938*                      FECHA DE PROCESO                         = 032700      
001939*                      NUMERO DE PROCESO                        = 032800      
001940*                      FECHA INICIO                             = 032900      
001941*                      REGISTRO INICIAL                         = 033000      
001942*================================================================ 033100      
001943                                                                  033200      
001944 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
001945     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
001946     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
001947     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
001948     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
001949     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
001950     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
001951     03 WKS-B05-MIX                PIC 9(08).                     034000      
001952     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
001953     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
001954     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
001955     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
001956     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
001957     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
001958                                                                  034700      
001959                                                                  034800      
001960*================================================================ 034900      
001961*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
001962*                                                               = 035100      
001963*  FUNCION                                                      = 035200      
001964*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
001965*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
001966*                                                               = 035500      
001967*================================================================ 035600      
001968                                                                  035700      
001969 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
001970     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
001971     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
001972     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
001973     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
001974     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
001975     03 WKS-B09-NOMREN             PIC X(15).                     036400      
001976                                                                  036500      
001977*===============================================================  036600      
001978*                                                              =  036700      
001979*         ENTRY-POINT CONSISMEN                                =  036800      
001980*                                                              =  036900      
001981*   DATOS REQUERIDOS : FUNCION                                 =  037000      
001982*                      SISTEMA                                 =  037100      
001983*                                                              =  037200      
001984*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
001985*                                                              =  037400      
001986*===============================================================  037500      
001987 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
001988     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
001989     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
001990     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
001991     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
001992     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
001993     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
001994     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
001995     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
001996     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
001997     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
001998     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
001999     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
002000     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
002001     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
002002     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
002003        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
002004        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
002005        05 WKS-B03-AAMM            PIC 9(06).                     039402      
002006        05 WKS-B03-SECOK           PIC 9(10).                     039500      
002007        05 WKS-B03-SECINF          PIC 9(10).                     039600      
002008        05 WKS-B03-SECERR          PIC 9(10).                     039700      
002009        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
002010                                                                  039900      
002011*=====================================================            040000      
002012*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
002013*=====================================================            040200      
002014 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
002015     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
002016     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
002017     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
002018                                                                  040700      
002019*=====================================================            040800      
002020*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
002021*=====================================================            041000      
002022 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
002023     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
002024     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
002025     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
002026                                                                  041500      
002027*=====================================================            041600      
002028*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
002029*=====================================================            041800      
002030 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
002031     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
002032     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
002033     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
002034*=====================================================            042300      
002035*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
002036*=====================================================            042500      
002037 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
002038     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
002039     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
002040     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
002041                                                                  043000      
002042*=====================================================            043100      
002043*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
002044*=====================================================            043300      
002045 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
002046     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
002047     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
002048     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
002049                                                                  043800      
002050*=====================================================            043900      
002051*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
002052*=====================================================            044100      
002053 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
002054     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
002055     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
002056     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
002057                                                                  044600      
002058*=====================================================            044700      
002059*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
002060*=====================================================            044900      
002061 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
002062     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
002063     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
002064     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
002065                                                                  045400      
002066*=====================================================            045500      
002067*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
002068*=====================================================            045700      
002069 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
002070     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
002071     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
002072     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
002073                                                                  046200      
002074*=====================================================            046300      
002075*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
002076*=====================================================            046500      
002077 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
002078     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
002079     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
002080     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
002081                                                                  047000      
002082*=====================================================            047100      
002083*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
002084*=====================================================            047300      
002085 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
002086     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
002087     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
002088     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
002089                                                                  047800      
002090*=====================================================            047900      
002091*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
002092*=====================================================            048100      
002093 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
002094     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
002095     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
002096     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
002097                                                                  048600      
002098*=====================================================            048700      
002099*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
002100*=====================================================            048900      
002101 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
002102     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
002103     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
002104     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
002105                                                                  049400      
002106*=====================================================            049500      
002107*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
002108*=====================================================            049700      
002109 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
002110     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
002111     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
002112     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
002113     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
002114     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
002115     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
002116     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
002117     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
002118     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
002119     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
002120                                                                  050900      
002121*=====================================================            051000      
002122*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
002123*=====================================================            051200      
002124 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
002125     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
002126     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
002127     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
002128     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
002129                                                                  051800      
002130*=====================================================            051900      
002131*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
002132*=====================================================            052100      
002133 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
002134     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
002135     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
002136     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
002137     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
002138                                                                  052700      
002139*=====================================================            052800      
002140*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
002141*=====================================================            053000      
002142 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
002143     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
002144     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
002145     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
002146     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
002147                                                                  053600      
002148*=====================================================            053700      
002149*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
002150*=====================================================            053900      
002151 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
002152     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
002153     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
002154     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
002155     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
002156                                                                  054500      
002157*=====================================================            054600      
002158*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
002159*=====================================================            054800      
002160 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
002161     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
002162     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
002163     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
002164     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
002165                                                                  055400      
002166*=====================================================            055500      
002167*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
002168*=====================================================            055700      
002169 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
002170     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
002171     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
002172     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
002173     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
002174                                                                  056300      
002175*=====================================================            056400      
002176*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
002177*=====================================================            056600      
002178 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
002179     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
002180     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
002181     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
002182     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
002183                                                                  057200      
002184 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
002185*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002186                                                                  010600      
002187 77 W77-FIN                        PIC 9(02) COMP VALUE ZEROS.    010700      
002188 77 W77-RES-LIB                    PIC S9(11) BINARY.             010800      
002189 77 W77-RES-FIL                    PIC S9(11) BINARY.             010900      
002190 77 W77-REG-CALL                   PIC 9(06) VALUE ZEROS.         011000      
002191 77 W77-IMP-CALL                   PIC 9(14)V99 VALUE ZEROS.      011100      
002192 01 WKS-RESULTADO                  PIC 9(11).                     011200      
002193 01 WKS-RESULTADO-R                REDEFINES WKS-RESULTADO.       011300      
002194    02 W77-MOV-AUT-S151            PIC  9(08).                    011400      
002195    02 W77-RES-L020                PIC  9(03).                    011500      
002196 77 W77-LEE-AUT-S151               PIC 9(08) COMP.                011600      
002197 77 W77-LEE-OTRAVEZ                PIC 9(02) COMP.                011700      
002198 77 W77-BD-SDOS                    PIC 9(02) COMP VALUE ZEROS.    011800      
002199 01 WKS-PARAMETRO                  PIC X(03).                     011900      
002200 01 WKS-PARAMETRO-R REDEFINES      WKS-PARAMETRO.                 012000      
002201    02 WKS-PARAM-SIS               PIC 9(03).                     012100      
002202 01 WKS-DATOS-HOST.                                               012200      
002203    03 WKS-NUMCSI-HOST             PIC 9(02).                     012300      
002204    03 WKS-NOMEQUIPO               PIC X(10).                     012400      
002205    03 WKS-NOMCSI                  PIC X(26).                     012500      
002206    03 WKS-LINEA-BATCH             PIC X(05).                     012600      
002207 01 WKS-PARAM-LIB                  PIC X(12).                     012700      
002208 01 WKS-PARAM-LIB-R                REDEFINES WKS-PARAM-LIB.       012800      
002209    02 WKS-LIB-FIJO                PIC X(09).                     012900      
002210    02 WKS-LIB-SIS                 PIC 9(03).                     013000      
002211***************************************************************** 013100      
002212**           PARAMETROS PARA LIBRERIA CLTVERS                  ** 013200      
002213***************************************************************** 013300      
002214*                                                                 013400      
002215 01  WKS-CTLVER-NUMREG                 PIC 9(02).                 013500      
002216 01  WKS-CTLVER-LIBID                  PIC X(12).                 013600      
002217 01  WKS-CTLVER-NOMLIB                 PIC X(72).                 013700      
002218 77  W77-CTLVER-RSLT                   PIC S9(11) BINARY.         013800      
002219*                                                                 013900      
002220                                                                  014000      
002221 PROCEDURE DIVISION USING WKS-PARAMETRO.                          014100      
002222                                                                  014200      
002223 DECLARATIVES.                                                    014300      
002224 HI-INTERRUPT SECTION.                                            014400      
002225       USE AS INTERRUPT PROCEDURE.                                014500      
002226 INTERRUP-BY-HI.                                                  014600      
002227     DISALLOW INTERRUPT.                                          014700      
002228     IF (ATTRIBUTE TASKVALUE OF MYSELF) = 4                       014800      
002229        MOVE "I"          TO      TIPO-LJ                         014900      
002230        STRING " TERMINACION ANORMAL P025/ASINSDOMOV POR HI 4 "   015000      
002231        DELIMITED BY SIZE INTO TEXTO-LJ                           015100      
002232        PERFORM 999999-DESPLIEGA                                  015200      
002233        SET MYSELF(STATUS)  TO  -1                                015300      
002234     ELSE                                                         015400      
002235     IF (ATTRIBUTE TASKVALUE OF MYSELF) = 20                      015500      
002236        STRING "NIVEL DE ACTUALIZACION " W77-ULT-REG-LEIDO        015600      
002237        DELIMITED BY SIZE INTO TEXTO-LJ                           015700      
002238        PERFORM 999999-DESPLIEGA                                  015800      
002239     ELSE                                                         015900      
002240        STRING " HI NO IMPLEMENTADO "                             016000      
002241        DELIMITED BY SIZE INTO TEXTO-LJ                           016100      
002242        PERFORM 999999-DESPLIEGA.                                 016200      
002243     ALLOW INTERRUPT.                                             016300      
002244                                                                  016400      
002245 END DECLARATIVES.                                                016500      
002246                                                                  016600      
002247*=================================================================016700      
002248*==                       RUT-000000-INIC-PROGRAMA              ==016800      
002249*=================================================================016900      
002250 000000-INIC-PROGRAMA SECTION.                                    017000      
002251 000000-INI-PGM.                                                  017100      
002252     PERFORM 100000-INICIO.                                       017200      
002253     PERFORM 200000-PROCESO UNTIL W77-FIN = 1.                    017300      
002254     PERFORM 900000-TERMINA.                                      017400      
002255                                                                  017500      
002256                                                                  017600      
002257                                                                  017700      
002258*=================================================================017800      
002259*==                       RUT-100000-INICIO                     ==017900      
002260*=================================================================018000      
002261 100000-INICIO SECTION.                                           018100      
002262 100000-INI.                                                      018200      
002263     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      018300      
002264        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          018400      
002265     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.018500      
002266     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               018600      
002267                                   TO "SOPORTECOMS".              018700      
002268                                                                  018800      
002269     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            018900      
002270                                                                  019000      
002271     CHANGE ATTRIBUTE LIBACCESS OF "CTLVER" TO BYFUNCTION.        019100      
002272     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO                 019200      
002273                                      "CTLVERS".                  019300      
002274     MOVE "S151"  TO      SISTEMA-LJ                              019400      
002275     MOVE "P025"  TO      PASO-LJ                                 019500      
002276     MOVE "002"   TO      MTP-LJ                                  019600      
002277     MOVE "I"     TO      TIPO-LJ                                 019700      
002278     MOVE 020101  TO      CODIGO-LJ.                              019800      
002279                                                                  019900      
002280     MOVE 0                        TO W77-CTLVER-RSLT.            020000      
002281     MOVE "S151L001CTL"            TO WKS-CTLVER-LIBID.           020100      
002282     CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID            020200      
002283                                      WKS-CTLVER-NOMLIB           020300      
002284                               GIVING W77-CTLVER-RSLT.            020400      
002285     IF W77-CTLVER-RSLT = 0                                       020500      
002286        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                020600      
002287                                  WKS-CTLVER-NOMLIB               020700      
002288     ELSE                                                         020800      
002289        MOVE 020901       TO      CODIGO-LJ                       020900      
002290        STRING "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-CONTROL " 021000      
002291        DELIMITED BY SIZE INTO TEXTO-LJ                           021100      
002292        PERFORM 999999-DESPLIEGA                                  021200      
002293        SET MYSELF(STATUS)  TO  -1.                               021300      
002294                                                                  021400      
002295                                                                  021500      
002296     MOVE WKS-PARAM-SIS            TO WKS-B01-SISTEMA             021600      
002297     MOVE WKS-NUMCSI-HOST          TO WKS-B01-CSI                 021700      
002298     MOVE 1                        TO WKS-B01-FUNCION.            021800      
002299     CALL "CONSISDIA IN LIB-CONTROL" USING WKS-S151B01SISDIA      021900      
002300                                    GIVING W77-STATUS.            022000      
002301     IF W77-STATUS > 0                                            022100      
002302        MOVE W77-STATUS   TO      WKS-STATUS                      022200      
002303        MOVE 020901       TO      CODIGO-LJ                       022300      
002304        STRING "ERROR EN LIB-CONTROL S151B01SISDIA ", WKS-STATUS  022400      
002305        DELIMITED BY SIZE INTO TEXTO-LJ                           022500      
002306        MOVE 020501                TO CODIGO-LJ                   022600      
002307        PERFORM 999999-DESPLIEGA.                                 022700      
002308                                                                  022800      
002309     IF WKS-B01-FECCON NOT < WKS-B01-FECPRO151                    022900      
002310        NEXT SENTENCE                                             023000      
002311     ELSE                                                         023100      
002312        STRING "ERROR EN FECHAS CONTABLE Y PROCESO DEL S151"      023200      
002313               "FECHA CONTABLE     : ", WKS-B01-FECCON            023300      
002314               "FECHA PROCESO S151 : ", WKS-B01-FECPRO151         023400      
002315               "DESCONTINUO PROCESO"                              023500      
002316        DELIMITED BY SIZE INTO TEXTO-LJ                           023600      
002317        MOVE 020501                TO CODIGO-LJ                   023700      
002318        PERFORM 999999-DESPLIEGA.                                 023800      
002319                                                                  023900      
002320     MOVE WKS-B01-NOMARCMOV        TO WKS-NOM-ARCHMOV             024000      
002321     MOVE WKS-B01-NOMPACMOV        TO WKS-PAC-ARCHMOV             024100      
002322     MOVE WKS-B01-FECPRO151        TO WKS-FEC-ARCHMOV             024200      
002323                                                                  024300      
002324     MOVE WKS-B01-NOMARCDES        TO WKS-NOM-ARCHDES             024400      
002325     MOVE WKS-B01-NOMPACDES        TO WKS-PAC-ARCHDES             024500      
002326     MOVE WKS-B01-FECPRO151        TO WKS-FEC-ARCHDES             024600      
002327                                                                  024700      
002328     MOVE ZEROS                    TO W77-STATUS                  024800      
002329                                      WKS-STATUS                  024900      
002330     MOVE WKS-PARAM-SIS            TO WKS-B03-SISTEMA             025000      
002331     MOVE 1                        TO WKS-B03-FUNCION.            025100      
002332     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN      025200      
002333                                    GIVING W77-STATUS.            025300      
002334     IF W77-STATUS > 0                                            025400      
002335        MOVE W77-STATUS   TO      WKS-STATUS                      025500      
002336        MOVE 020901       TO      CODIGO-LJ                       025600      
002337        STRING "ERROR EN LIB-CONTROL S151B03SISMEN ", WKS-STATUS  025700      
002338        DELIMITED BY SIZE INTO TEXTO-LJ                           025800      
002339        MOVE 020501                TO CODIGO-LJ                   025900      
002340        PERFORM 999999-DESPLIEGA                                  026000      
002341        SET MYSELF(STATUS)  TO  -1.                               026100      
002342                                                                  026200      
002343     IF WKS-B03-STABDSAL = 4 OR 5 OR 6                            026300      
002344        MOVE 020601       TO      CODIGO-LJ                       026400      
002345        STRING "ERROR NO SE HA EJECUTADO P197 : ",WKS-B03-STABDSAL026500      
002346        DELIMITED BY SIZE INTO TEXTO-LJ                           026600      
002347        MOVE 020501                TO CODIGO-LJ                   026700      
002348        PERFORM 999999-DESPLIEGA                                  026800      
002349        SET MYSELF(STATUS)  TO  -1                                026900      
002350     ELSE                                                         027000      
002351     IF WKS-B03-STABDSAL = 3                                      027100      
002352        MOVE 020501                TO CODIGO-LJ                   027200      
002353        STRING "ERROR PROCESO YA EJECUTADO : ", WKS-B03-STABDSAL  027300      
002354        DELIMITED BY SIZE INTO TEXTO-LJ                           027400      
002355        PERFORM 999999-DESPLIEGA                                  027500      
002356        SET MYSELF(STATUS)  TO  -1                                027600      
002357     ELSE                                                         027700      
002358     IF WKS-B03-STABDSAL = 99                                     027800      
002359        MOVE 1                  TO W77-BD-SDOS.                   027900      
002360                                                                  028000      
002361     MOVE ZEROS                    TO W77-STATUS                  028100      
002362                                      WKS-STATUS                  028200      
002363     MOVE WKS-PARAM-SIS            TO WKS-B03F09-SISTEMA          028300      
002364     MOVE 9                        TO WKS-B03F09-FUNCION.         028400      
002365     MOVE 2                        TO WKS-B03F09-STABDSAL         028500      
002366     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN-F09  028600      
002367                                    GIVING W77-STATUS.            028700      
002368     IF W77-STATUS > 0                                            028800      
002369        MOVE W77-STATUS   TO      WKS-STATUS                      028900      
002370        MOVE 020901       TO      CODIGO-LJ                       029000      
002371        STRING "ERROR ACTUALIZA LIB-CONTROL INI B03SISMEN-F09 ",  029100      
002372                         WKS-STATUS                               029200      
002373        DELIMITED BY SIZE INTO TEXTO-LJ                           029300      
002374        PERFORM 999999-DESPLIEGA.                                 029400      
002375                                                                  029500      
002376     CANCEL "SOPORTECOMS".                                        029600      
002377                                                                  029700      
002378     OPEN INPUT A01-S151MOV A02-S151DES                           029800      
002379     ADD 1                 TO W77-ULT-REG-LEIDO                   030000      
002380     READ A01-S151MOV INTO A00-R00-HDR-MOV OF A01-S151MOV         030100      
002381     INVALID KEY                                                  030200      
002382             MOVE "E"         TO      TIPO-LJ                     030300      
002383             MOVE 010105      TO      CODIGO-LJ                   030400      
002384             STRING " ERROR AL LEER LOG DEL S151  ",              030500      
002385                    " CON LA LLAVE : ", W77-ULT-REG-LEIDO         030600      
002386             DELIMITED BY SIZE INTO TEXTO-LJ                      030700      
002387             PERFORM 999999-DESPLIEGA                             030800      
002388             MOVE 1                        TO W77-FIN.            030900      
002389     IF W77-FIN = ZEROS                                           031000      
002390     IF A00-R00-HDR-FCH OF A01-S151MOV NOT = WKS-B01-FECPRO151    031100      
002391        MOVE 010401       TO      CODIGO-LJ                       031200      
002392        STRING "ERROR EN FECHAS DE PROCESO Y DE ARCHIVO MOVTOS"   031300      
002393               "FCH ARCH MOVS ",A00-R00-HDR-FCH OF A01-S151MOV    031400      
002394               "FCH PROCESO : ", WKS-B01-FECPRO151                031500      
002395               "DESCONTINUO PROCESO"                              031600      
002396        DELIMITED BY SIZE INTO TEXTO-LJ                           031700      
002397        MOVE 020501                TO CODIGO-LJ                   031800      
002398        PERFORM 999999-DESPLIEGA                                  031900      
002399        SET MYSELF(STATUS)  TO  -1.                               032000      
002400                                                                  032100      
002401     IF W77-FIN = ZEROS AND W77-BD-SDOS = ZEROS                   032200      
002402        MOVE "S151L020S"               TO WKS-LIB-FIJO            032300      
002403        MOVE WKS-PARAM-SIS             TO WKS-LIB-SIS             032400      
002404        MOVE WKS-PARAM-LIB             TO WKS-CTLVER-LIBID.       032500      
002405        CALL "DAME_TIT IN CTLVER" USING  WKS-CTLVER-LIBID         032600      
002406                                         WKS-CTLVER-NOMLIB        032700      
002407                                  GIVING W77-CTLVER-RSLT.         032800      
002408        IF W77-CTLVER-RSLT = 0 AND W77-BD-SDOS = ZEROS            032900      
002409           CHANGE ATTRIBUTE TITLE OF "LIB-L020"  TO               033000      
002410                                     WKS-CTLVER-NOMLIB            033100      
002411        ELSE                                                      033200      
002412        IF W77-BD-SDOS = ZEROS                                    033300      
002413           MOVE 020901       TO      CODIGO-LJ                    033400      
002414           STRING "ERROR EN CTLVERS, NO ENCONTRO ID DE LIB-L020"  033500      
002415           DELIMITED BY SIZE INTO TEXTO-LJ                        033600      
002416           MOVE 020501                TO CODIGO-LJ                033700      
002417           PERFORM 999999-DESPLIEGA.                              033800      
002418                                                                  033900      
002419     IF W77-FIN = ZEROS                                           034000      
002420        PERFORM 7000000-LEE-S151MOV.                              034100      
002421                                                                  034200      
002422     IF W77-BD-SDOS = ZEROS                                       034300      
002423        MOVE LOW-VALUES               TO WKS-MOV-DATOS            034400      
002424        MOVE ZEROS                    TO W77-MOV-AUT-S151         034500      
002425                                         W77-ULT-REG-LEIDO        034600      
002426        MOVE WKS-PARAM-SIS            TO WKS-MOV-SISTEMA          034700      
002427        MOVE WKS-B01-FECPRO151        TO WKS-MOV-FECCONT          034800      
002428        CALL "S151LIB020 IN LIB-L020" USING WKS-MOV-DATOS,        034900      
002429                                            W77-RES-LIB,          035000      
002430                                            W77-RES-FIL.          035100      
002431                                                                  035200      
002432     IF W77-BD-SDOS = ZEROS                                       035300      
002433        MOVE W77-RES-LIB              TO WKS-RESULTADO            035400      
002434        IF W77-RES-L020   > ZEROS                                 035500      
002435           IF W77-RES-L020   = 999                                035600      
002436              MOVE 1                  TO W77-BD-SDOS              035700      
002437           ELSE                                                   035800      
002438              MOVE W77-RES-L020 TO      WKS-RES-L020              035900      
002439              MOVE 020901       TO CODIGO-LJ                      036000      
002440              STRING "ERROR EN CALL L020 ", WKS-RES-L020          036100      
002441              DELIMITED BY SIZE INTO TEXTO-LJ                     036200      
002442              PERFORM 999999-DESPLIEGA                            036300      
002443        ELSE                                                      036400      
002444           MOVE W77-MOV-AUT-S151      TO W77-ULT-REG-LEIDO        036500      
002445           IF W77-ULT-REG-LEIDO > ZEROS                           036600      
002446              ADD 1                   TO W77-ULT-REG-LEIDO        036700      
002447              PERFORM 7000000-LEE-S151MOV.                        036800      
002448                                                                  036900      
002449                                                                  037000      
002450     ATTACH HI-INTERRUPT TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF.   037100      
002451     ALLOW INTERRUPT.                                             037200      
002452                                                                  037300      
002453     GO TO 100999-EXIT.                                           037400      
002454                                                                  037500      
002455                                                                  037600      
002456 100999-EXIT.                                                     037700      
002457     EXIT.                                                        037800      
002458                                                                  037900      
002459                                                                  038000      
002460 200000-PROCESO.                                                  038100      
002461     IF A00-R01-FUNCION OF A01-S151MOV = 99                       038200      
002462        CLOSE A01-S151MOV                                         038300      
002463              A02-S151DES                                         038400      
002464        WAIT (180)                                                038500      
002465        OPEN INPUT A01-S151MOV A02-S151DES                        038600      
002466        SUBTRACT 1 FROM W77-ULT-REG-LEIDO                         038700      
002467        PERFORM 7000000-LEE-S151MOV                               038800      
002468     ELSE                                                         038900      
002469        PERFORM 310100-PROCESA                                    039100      
002470        PERFORM 7000000-LEE-S151MOV.                              039200      
002471                                                                  039300      
002472                                                                  039400      
002473 310100-PROCESA.                                                  039500      
002474     IF A00-R01-PRODUCTO  OF A01-S151MOV = 84 AND                 039600      
002475        A00-R01-INSTRUMENTO OF A01-S151MOV = 15                   039700      
002476        IF A00-R01-CVETRAN OF A01-S151MOV (1) = 13 OR 14 OR 15    039800      
002477            OR 16 OR 17 OR 23 OR 25 OR 26 OR 28 OR 33 OR 34       039900      
002478            OR 35 OR 36 OR 37 OR 38                               040000      
002479           IF A00-R01-IND-EDOCTA OF A01-S151MOV = 1               040100      
002480              MOVE 0       TO A00-R01-IND-EDOCTA OF A01-S151MOV   040200      
002481           ELSE                                                   040300      
002482              NEXT SENTENCE                                       040400      
002483        ELSE                                                      040500      
002484        IF A00-R01-CVETRAN OF A01-S151MOV (1) = 18 OR 19 OR 20    040600      
002485            OR 21 OR 22 OR 27 OR 29 OR 31 OR 32                   040700      
002486          IF A00-R01-IND-EDOCTA OF A01-S151MOV = 0                040800      
002487             MOVE 1       TO A00-R01-IND-EDOCTA OF A01-S151MOV.   040900      
002488                                                                  041000      
002489     IF A00-R01-FUNCION    OF A01-S151MOV = 1 AND                 041100      
002490        A00-R01-STATUS     OF A01-S151MOV = 1 AND                 041200      
002491        A00-R01-IND-EDOCTA OF A01-S151MOV = 1                     041300      
002492        ADD 1                      TO W77-CONT-REG                041400      
002493        PERFORM 350100-CALL-L020.                                 041700      
002494                                                                  041800      
002495                                                                  041900      
002496 350100-CALL-L020.                                                042000      
002497     MOVE ZEROS                    TO W77-RES-L020                042100      
002498                                      W77-MOV-AUT-S151            042200      
002499     MOVE ALL @00@                 TO WKS-MOV-DATOS               042300      
002500                                                                  042400      
002501     MOVE A00-R01-FUNCION     OF A01-S151MOV TO WKS-MOV-FUNCION   042500      
002502     MOVE A00-R01-SISTEMA     OF A01-S151MOV TO WKS-MOV-SISTEMA   042600      
002503     MOVE A00-R01-PRODUCTO    OF A01-S151MOV TO WKS-MOV-PRODUCTO  042700      
002504     MOVE A00-R01-INSTRUMENTO OF A01-S151MOV TO                   042800      
002505          WKS-MOV-INSTRUMENTO                                     042900      
002506                                                                  043200      
002507     MOVE A00-R01-CVETRAN OF A01-S151MOV (1) TO WKS-MOV-CVETRAN(1)043300      
002508     MOVE A00-R01-INDLEY  OF A01-S151MOV (1) TO WKS-MOV-INDLEY (1)043400      
002509     MOVE A00-R01-ESQCON  OF A01-S151MOV (1) TO WKS-MOV-ESQCON (1)043500      
002510     MOVE A00-R01-IMPORTE OF A01-S151MOV (1) TO WKS-MOV-IMPORTE(1)043600      
002511                                                                  043700      
002512     MOVE A00-R01-CVETRAN OF A01-S151MOV (2) TO WKS-MOV-CVETRAN(2)043800      
002513     MOVE A00-R01-INDLEY  OF A01-S151MOV (2) TO WKS-MOV-INDLEY (2)043900      
002514     MOVE A00-R01-ESQCON  OF A01-S151MOV (2) TO WKS-MOV-ESQCON (2)044000      
002515     MOVE A00-R01-IMPORTE OF A01-S151MOV (2) TO WKS-MOV-IMPORTE(2)044100      
002516                                                                  044200      
002517     MOVE A00-R01-CVETRAN OF A01-S151MOV (3) TO WKS-MOV-CVETRAN(3)044300      
002518     MOVE A00-R01-INDLEY  OF A01-S151MOV (3) TO WKS-MOV-INDLEY (3)044400      
002519     MOVE A00-R01-ESQCON  OF A01-S151MOV (3) TO WKS-MOV-ESQCON (3)044500      
002520     MOVE A00-R01-IMPORTE OF A01-S151MOV (3) TO WKS-MOV-IMPORTE(3)044600      
002521                                                                  044700      
002522     MOVE A00-R01-CVETRAN OF A01-S151MOV (4) TO WKS-MOV-CVETRAN(4)044800      
002523     MOVE A00-R01-INDLEY  OF A01-S151MOV (4) TO WKS-MOV-INDLEY (4)044900      
002524     MOVE A00-R01-ESQCON  OF A01-S151MOV (4) TO WKS-MOV-ESQCON (4)045000      
002525     MOVE A00-R01-IMPORTE OF A01-S151MOV (4) TO WKS-MOV-IMPORTE(4)045100      
002526                                                                  045200      
002527     MOVE A00-R01-CVETRAN OF A01-S151MOV (5) TO WKS-MOV-CVETRAN(5)045300      
002528     MOVE A00-R01-INDLEY  OF A01-S151MOV (5) TO WKS-MOV-INDLEY (5)045400      
002529     MOVE A00-R01-ESQCON  OF A01-S151MOV (5) TO WKS-MOV-ESQCON (5)045500      
002530     MOVE A00-R01-IMPORTE OF A01-S151MOV (5) TO WKS-MOV-IMPORTE(5)045600      
002531                                                                  045700      
002532     MOVE A00-R01-MONEDA   OF A01-S151MOV TO WKS-MOV-MONEDA       045800      
002533     MOVE A00-R01-ORIGEN   OF A01-S151MOV TO WKS-MOV-ORIGEN       045900      
002534     MOVE A00-R01-SOBREGIRO OF A01-S151MOV TO                     046100      
002535          WKS-MOV-SOBREGIRO                                       046150      
002536     MOVE A00-R01-IND-EDOCTA  OF A01-S151MOV TO WKS-MOV-IND-EDOCTA046200      
002537     MOVE A00-R01-IND-DATOS-ADIC OF A01-S151MOV TO                046400      
002538          WKS-MOV-IND-DATOS-ADIC                                  046450      
002539     MOVE A00-R01-IND-NUMREN  OF A01-S151MOV TO WKS-MOV-IND-NUMREN046500      
002540     MOVE A00-R01-FEC-VEN     OF A01-S151MOV TO WKS-MOV-FEC-VEN   046600      
002541     MOVE A00-R01-PLAZO       OF A01-S151MOV TO WKS-MOV-PLAZO     046700      
002542     MOVE A00-R01-BCOS        OF A01-S151MOV TO WKS-MOV-BCOS      046900      
002543     MOVE A00-R01-NODO-ORIG   OF A01-S151MOV TO                   047000      
002544          WKS-MOV-NODO-ORIG                                       047050      
002545     MOVE A00-R01-SIST-ORIG   OF A01-S151MOV TO WKS-MOV-SIST-ORIG 047200      
002546     MOVE A00-R01-PROD-ORIG   OF A01-S151MOV TO WKS-MOV-PROD-ORIG 047300      
002547     MOVE A00-R01-INST-ORIG   OF A01-S151MOV TO WKS-MOV-INST-ORIG 047400      
002548     MOVE A00-R01-CVETR-ORIG  OF A01-S151MOV TO WKS-MOV-CVETR-ORIG047500      
002549     MOVE A00-R01-SECTOR      OF A01-S151MOV TO WKS-MOV-SECTOR    047800      
002550     MOVE A00-R01-SUCPROM     OF A01-S151MOV TO WKS-MOV-SUCPROM   047900      
002551     MOVE A00-R01-CONTRATO    OF A01-S151MOV TO WKS-MOV-CONTRATO  048000      
002552     MOVE A00-R01-CVEMDA      OF A01-S151MOV TO WKS-MOV-CVEMDA    048100      
002553     MOVE A00-R01-NUMMDA      OF A01-S151MOV TO WKS-MOV-NUMMDA    048200      
002554     MOVE A00-R01-CVEMDE      OF A01-S151MOV TO WKS-MOV-CVEMDE    048300      
002555     MOVE A00-R01-REFNUM      OF A01-S151MOV TO WKS-MOV-REFNUM    048600      
002556     MOVE A00-R01-AUTORIZA    OF A01-S151MOV TO WKS-MOV-AUTORIZA  048700      
002557     MOVE A00-R01-AUT3ER      OF A01-S151MOV TO WKS-MOV-AUT3ER    048800      
002558     MOVE A00-R01-AUT-S151    OF A01-S151MOV TO WKS-MOV-AUT-S151  049000      
002559     MOVE A00-R01-AUT-AELIM-S151 OF A01-S151MOV TO                049100      
002560          WKS-MOV-AUT-AELIM-S151                                  049150      
002561     MOVE A00-R01-AUT-ANT-S151 OF A01-S151MOV TO                  049200      
002562          WKS-MOV-AUT-ANT-S151                                    049220      
002563     MOVE A00-R01-TIPO-PROC   OF A01-S151MOV TO WKS-MOV-TIPO-PROC 049250      
002564     MOVE A00-R01-FECMOV      OF A01-S151MOV TO WKS-MOV-FECMOV    049300      
002565     MOVE A00-R01-HORMOV      OF A01-S151MOV TO WKS-MOV-HORMOV    049400      
002566     MOVE A00-R01-FECCONT     OF A01-S151MOV TO WKS-MOV-FECCONT   049405      
002567     MOVE A00-R01-FECVAL      OF A01-S151MOV TO WKS-MOV-FECVAL    049410      
002568     MOVE A00-R01-SUC-INIC    OF A01-S151MOV TO WKS-MOV-SUC-INIC  049415      
002569     MOVE A00-R01-CAJA-INIC   OF A01-S151MOV TO WKS-MOV-CAJA-INIC 049420      
002570     MOVE A00-R01-SUCOPER     OF A01-S151MOV TO WKS-MOV-SUCOPER   049425      
002571     MOVE A00-R01-CAJAOPER    OF A01-S151MOV TO WKS-MOV-CAJAOPER  049430      
002572     MOVE A00-R01-SUCTRAN     OF A01-S151MOV TO WKS-MOV-SUCTRAN   049435      
002573     MOVE A00-R01-CAJATRAN    OF A01-S151MOV TO WKS-MOV-CAJATRAN  049440      
002574     MOVE A00-R01-NOMINA-OPE  OF A01-S151MOV TO WKS-MOV-NOMINA-OPE049455      
002575     MOVE A00-R01-FILXAPL    OF A01-S151MOV TO WKS-MOV-FILLERXAPLI049460      
002576                                                                  049500      
002577     IF W77-BD-SDOS = ZEROS                                       049600      
002578        IF A00-R01-APUDES OF A01-S151MOV > ZEROS                  049700      
002579           PERFORM 800000-LEE-S151DES.                            049800      
002580                                                                  049900      
002581     IF A00-R01-FUNCION OF A01-S151MOV = 1 AND                    050000      
002582        A00-R01-STATUS  OF A01-S151MOV = 1 AND                    050100      
002583        W77-BD-SDOS                 = ZEROS                       050200      
002584        CALL "S151LIB020 IN LIB-L020" USING WKS-MOV-DATOS,        050300      
002585                                            W77-RES-LIB,          050400      
002586                                            W77-RES-FIL.          050500      
002587        MOVE W77-RES-LIB              TO WKS-RESULTADO            050600      
002588                                                                  050700      
002589        IF W77-RES-L020 > ZEROS                                   050800      
002590           IF W77-RES-L020   = 999                                050900      
002591              NEXT SENTENCE                                       051000      
002592           ELSE                                                   051100      
002593              MOVE W77-RES-L020      TO      WKS-RES-L020         051200      
002594              MOVE W77-MOV-AUT-S151  TO      WKK-MOV-AUT-S151     051300      
002595              MOVE 020901    TO      CODIGO-LJ                    051400      
002596              STRING "ERROR EN CALL LIB-L020 ", WKS-RES-L020      051500      
002597                     "AUTORIZACION : ", WKK-MOV-AUT-S151          051600      
002598              DELIMITED BY SIZE INTO TEXTO-LJ                     051700      
002599              PERFORM 999999-DESPLIEGA                            051800      
002600              SET MYSELF(STATUS)  TO  -1                          051900      
002601        ELSE                                                      052000      
002602           MOVE ZEROS              TO W77-MOV-AUT-S151.           052100      
002603                                                                  052200      
002604                                                                  052300      
002605 7000000-LEE-S151MOV SECTION.                                     052400      
002606 7000000-LEE-MOV.                                                 052500      
002607     ADD 1                 TO W77-ULT-REG-LEIDO                   052600      
002608     READ A01-S151MOV                                             052700      
002609     INVALID KEY                                                  052800      
002610             MOVE "E"         TO      TIPO-LJ                     052900      
002611             MOVE 010105      TO      CODIGO-LJ                   053000      
002612             STRING " ERROR AL LEER LOG DEL S151  ",              053100      
002613                    " CON LA LLAVE : ", W77-ULT-REG-LEIDO         053200      
002614             DELIMITED BY SIZE INTO TEXTO-LJ                      053300      
002615             PERFORM 999999-DESPLIEGA                             053400      
002616             MOVE 1                        TO W77-FIN.            053500      
002617                                                                  053600      
002618     IF W77-FIN = ZEROS                                           053700      
002619        ADD 1              TO W77-CON-LEI                         053800      
002620                              W77-LEI                             053900      
002621        IF A00-R01-FUNCION OF A01-S151MOV = 98                    054000      
002622           MOVE 9               TO W77-FIN                        054100      
002623           ADD 1                TO W77-ULT-REG-LEIDO              054200      
002624           READ A01-S151MOV                                       054300      
002625           INVALID KEY                                            054400      
002626                   MOVE "E"         TO      TIPO-LJ               054500      
002627                   MOVE 010105      TO      CODIGO-LJ             054600      
002628                   STRING " ERROR AL LEER LOG DEL S151  ",        054700      
002629                   " CON LA LLAVE : ", W77-ULT-REG-LEIDO          054800      
002630                   DELIMITED BY SIZE INTO TEXTO-LJ                054900      
002631                   PERFORM 999999-DESPLIEGA                       055000      
002632                   MOVE 1                        TO W77-FIN.      055100      
002633     IF W77-FIN = 9                                               055200      
002634        IF A00-R01-FUNCION OF A01-S151MOV = 99                    055300      
002635           MOVE 1          TO W77-FIN                             055400      
002636        ELSE                                                      055500      
002637           MOVE ZEROS      TO W77-FIN.                            055600      
002638                                                                  055700      
002639                                                                  055800      
002640 7000999-EXIT.                                                    055900      
002641     EXIT.                                                        056000      
002642                                                                  056100      
002643                                                                  056200      
002644 800000-LEE-S151DES SECTION.                                      056300      
002645 800000-LEE-DES.                                                  056400      
002646     COMPUTE W77-LOGKEY = A00-R01-APUDES OF A01-S151MOV + 1       056500      
002647     READ A02-S151DES  INTO  A01-R01-DATOS                        056600      
002648          INVALID KEY                                             056700      
002649                  MOVE A00-R01-APUDES OF A01-S151MOV    TO        056800      
002650                       WKS-R01-APUDES                             056900      
002651                  MOVE 010106     TO      CODIGO-LJ               057000      
002652                  STRING "ERROR ARCHIVO DESCRIPCIONES  "          057100      
002653                         "LOGKEY : ", W77-LOGKEY                  057200      
002654                         "  NIVDES : ", WKS-R01-APUDES            057300      
002655                  DELIMITED BY SIZE INTO TEXTO-LJ.                057400      
002656     PERFORM 802000-FORMATO1-S151ADIC.                            057700      
002657                                                                  058500      
002658     GO TO 800999-EXIT.                                           058600      
002659                                                                  060700      
002660 802000-FORMATO1-S151ADIC.                                        060800      
002661     MOVE A01-R01-CVECON-YREFLOC TO WKS-MOV-CVECON-YREFLOC        060840      
002662     MOVE A01-R01-NOMINA-FUN1   TO WKS-MOV-NOMINA-FUN1            060900      
002663     MOVE A01-R01-NOMINA-FUN2   TO WKS-MOV-NOMINA-FUN2            061000      
002664     MOVE A01-R01-LEY1          TO WKS-MOV-LEY1.                  061800      
002665                                                                  061900      
002666     MOVE A01-R02-LEY2          TO WKS-MOV-LEY2                   062200      
002667     MOVE A01-R02-LEY3          TO WKS-MOV-LEY3                   062300      
002668     MOVE A01-R02-LEY4          TO WKS-MOV-LEY4                   062400      
002669     MOVE A01-R02-LEY5          TO WKS-MOV-LEY5.                  062500      
002670     MOVE A01-R01-FILXAPL       TO WKS-MOV-FILLERXAPLI.           062600      
002671                                                                  062700      
002672 800999-EXIT.                                                     062800      
002673     EXIT.                                                        062900      
002674                                                                  063000      
002675                                                                  063100      
002676 999999-DESPLIEGA SECTION.                                        063200      
002677 999999-DESP.                                                     063300      
002678*=================                                                063400      
002679                                                                  063500      
002680     CALL "LJ IN LIB-DISP"                                        063600      
002681              USING CONTADOR-LJ, MENSAJE-LJ.                      063700      
002682                                                                  063800      
002683                                                                  063900      
002684 999999-EXIT.                                                     064000      
002685     EXIT.                                                        064100      
002686                                                                  064200      
002687                                                                  064300      
002688 900000-TERMINA SECTION.                                          064400      
002689 900000-FIN.                                                      064500      
002690     CLOSE A01-S151MOV A02-S151DES WITH LOCK.                     064600      
002691     MOVE ZEROS                    TO W77-STATUS                  064700      
002692                                      WKS-STATUS                  064800      
002693*****MOVE WKS-PARAM-SIS            TO WKS-B03F09-SISTEMA          064900      
002694     MOVE 9                        TO WKS-B03F09-FUNCION.         065000      
002695     IF W77-BD-SDOS = ZEROS                                       065100      
002696        MOVE 3                     TO WKS-B03F09-STABDSAL         065200      
002697     ELSE                                                         065300      
002698        MOVE 99                    TO WKS-B03F09-STABDSAL.        065400      
002699                                                                  065500      
002700     CALL "CONSISMEN IN LIB-CONTROL" USING WKS-S151B03SISMEN-F09  065600      
002701                                    GIVING W77-STATUS.            065700      
002702     IF W77-STATUS > 0                                            065800      
002703        MOVE W77-STATUS   TO      WKS-STATUS                      065900      
002704        MOVE "E"          TO      TIPO-LJ                         066000      
002705        MOVE 020901       TO      CODIGO-LJ                       066100      
002706        STRING "ERROR ACTUALIZA LIB-CONTROL FIN B03SISMEN-F09 ",  066200      
002707                         WKS-STATUS                               066300      
002708        DELIMITED BY SIZE INTO TEXTO-LJ                           066400      
002709        PERFORM 999999-DESPLIEGA                                  066500      
002710        SET MYSELF(STATUS)  TO  -1.                               066600      
002711                                                                  066700      
002712     CANCEL "LIB-CONTROL".                                        066800      
002713                                                                  066900      
002714     STOP RUN.                                                    067000      
002715                                                                  067100      
002716                                                                  067200      
002717 900999-EXIT.                                                     067300      
002718     EXIT.                                                        067400      
002719                                                                  067500      
002720*INICIA CODIGO DE RENOVACION CRONOS 2000                          067600      
002721 A2K-CPY-SECTION SECTION.                                         067700      
002722*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002723*    COPY "S151/CRONOS2K/CPY/PD".                                 067800      
002724** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
002725** Unisys has defined for CRONOS2K project                     ** 000200      
002726** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
002727***************************************************************** 000400      
002728***************************************************************** 000600      
002729** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
002730** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
002731** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
002732** date MMDDCCAA, which is returned into the variable          ** 001000      
002733** A2K-FEC-MDCA-001.                                           ** 001100      
002734***************************************************************** 001200      
002735                                                                  001300      
002736 A2K-ACCEPT-TODAYS-DATE.                                          001400      
002737        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
002738*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
002739        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
002740        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
002741        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
002742        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
002743        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
002744                                                                  002200      
002745 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
002746        EXIT.                                                     002240      
002747                                                                  002500      
002748****************************************************************  002600      
002749** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
002750**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
002751**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
002752**baseyear to add the century to the year part.               **  003000      
002753**INPUT is A2K-FEC-AMD-001                                    **  003100      
002754**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
002755****************************************************************  003300      
002756                                                                  003400      
002757 A2K-CONV-AMD-TO-CAMD.                                            003500      
002758         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
002759         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
002760         IF A2K-FEC-AMD-001 = 0                                   003720      
002761            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
002762         ELSE                                                     003741      
002763          IF A2K-FEC-AMD-001 = 999999                             003742      
002764             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
002765         ELSE                                                     003760      
002766         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
002767                 A2K-OBTAIN-CENTURY-EXIT                          003900      
002768         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
002769         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
002770         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
002771         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
002772                                                                  004400      
002773 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
002774         EXIT.                                                    004600      
002775                                                                  004700      
002776******************************************************************004800      
002777**A2K-CONV-MDA-TO-MDCA.                                         **004900      
002778**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
002779** an eight digit format as MMDDCCAA. It use a                  **005100      
002780** baseyear to add century to the yaer.                         **005200      
002781** INPUT is A2K-FEC-MDA-001                                     **005300      
002782** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
002783                                                                  005500      
002784 A2K-CONV-MDA-TO-MDCA.                                            005600      
002785     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
002786     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
002787     IF A2K-FEC-MDA-001 = 0                                       005820      
002788        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
002789     ELSE                                                         005845      
002790      IF A2K-FEC-MDA-001 = 999999                                 005850      
002791         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
002792     ELSE                                                         005860      
002793     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
002794             A2K-OBTAIN-CENTURY-EXIT                              006000      
002795     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
002796     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
002797     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
002798     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
002799                                                                  006500      
002800 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
002801     EXIT.                                                        006700      
002802                                                                  006800      
002803***************************************************************** 006900      
002804**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
002805**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
002806**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
002807**baseyear to add century to the year.                         ** 007300      
002808**INPUT is A2K-FEC-DMA-001                                     ** 007400      
002809**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
002810                                                                  007600      
002811 A2K-CONV-DMA-TO-DMCA.                                            007700      
002812       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
002813       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
002814       IF  A2K-FEC-DMA-001   = 0                                  007920      
002815          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
002816       ELSE                                                       007945      
002817        IF A2K-FEC-DMA-001 = 999999                               007950      
002818          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
002819       ELSE                                                       007960      
002820       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
002821               A2K-OBTAIN-CENTURY-EXIT                            008100      
002822       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
002823       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
002824       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
002825       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
002826                                                                  008600      
002827 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
002828       EXIT.                                                      008800      
002829                                                                  008900      
002830***************************************************************** 009000      
002831** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002832** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002833** a 6 digit format as AAMMDD.                                 ** 009300      
002834** It simply removes the century information in the output     ** 009400      
002835** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002836** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002837                                                                  009700      
002838 A2K-CONV-CAMD-TO-AMD.                                            009800      
002839     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002840     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002841     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002842     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002843                                                                  010300      
002844 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002845      EXIT.                                                       010500      
002846                                                                  010600      
002847******************************************************************010700      
002848******************************************************************010800      
002849** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002850** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002851** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002852** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002853** INPUT is A2K-FEC-MDCA-001                                    **011300      
002854** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002855                                                                  011500      
002856 A2K-CONV-MDCA-TO-MDA.                                            011600      
002857     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002858     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002859     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002860     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002861                                                                  012100      
002862 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002863      EXIT.                                                       012300      
002864                                                                  012400      
002865******************************************************************012500      
002866***************************************************************** 012600      
002867** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002868** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002869** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002870** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002871** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002872** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
002873                                                                  013300      
002874 A2K-CONV-DMCA-TO-DMA.                                            013400      
002875     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
002876     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
002877     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
002878     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
002879                                                                  013900      
002880 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
002881      EXIT.                                                       014100      
002882                                                                  014200      
002883***************************************************************** 014300      
002884 A2K-CONV-MDCA-TO-CAMD.                                           014400      
002885      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
002886      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
002887      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
002888      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
002889      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
002890 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
002891      EXIT.                                                       015100      
002892***************************************************************** 015200      
002893** This paragraph adds century to an year field which is 9(02) ** 015300      
002894** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
002895** Output is A2K-FEC-CCAA-001.                                 ** 015600      
002896***************************************************************** 015700      
002897 A2K-CONV-AA-TO-CCAA.                                             015800      
002898      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
002899      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
002900              A2K-OBTAIN-CENTURY-EXIT.                            016100      
002901      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
002902 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
002903      EXIT.                                                       016400      
002904***************************************************************** 016500      
002905** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
002906** format.                                                     ** 016700      
002907** Input is A2K-FEC-DMCA-001.                                  ** 016800      
002908** Output is A2K-FEC-CAMD-001.                                 ** 016900      
002909***************************************************************** 017000      
002910 A2K-CONV-DMCA-TO-CAMD.                                           017100      
002911      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
002912      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
002913      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
002914      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
002915      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
002916 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
002917      EXIT.                                                       017800      
002918***************************************************************** 017900      
002919** This paragraph desides the Century to be added depending    ** 018000      
002920** on the base year.                                           ** 018100      
002921** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
002922** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
002923***************************************************************** 018400      
002924 A2K-OBTAIN-CENTURY.                                              018500      
002925      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
002926          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
002927      ELSE                                                        018800      
002928          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
002929 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
002930      EXIT.                                                       019100      
002931                                                                  019200      
002932***************************************************************** 019300      
002933** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
002934**  Format                                                     ** 019500      
002935** Input Is A2K-FEC-CAMD-001                                   ** 019600      
002936** Output Is A2K-FEC-DMCA-001                                  ** 019700      
002937***************************************************************** 019800      
002938 A2K-CONV-CAMD-TO-DMCA.                                           019900      
002939      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
002940      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
002941      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
002942      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
002943      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
002944                                                                  020500      
002945 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
002946      EXIT.                                                       020700      
002947                                                                  020800      
002948******************************************************************020900      
002949******************************************************************021000      
002950 A2K-CONV-AM-TO-CAM.                                              021100      
002951      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
002952      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
002953      IF A2K-FEC-AM-001 = 0                                       021220      
002954         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
002955      ELSE                                                        021245      
002956      IF A2K-FEC-AM-001 = 9999                                    021250      
002957         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
002958      ELSE                                                        021260      
002959      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
002960      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
002961      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
002962              A2K-OBTAIN-CENTURY-EXIT                             021600      
002963      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
002964                                                                  021800      
002965 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
002966      EXIT.                                                       022000      
002967                                                                  022100      
002968******************************************************************022200      
002969******************************************************************022300      
002970 A2K-CONV-CAM-TO-AM.                                              022400      
002971      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
002972      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
002973      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
002974                                                                  022800      
002975 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
002976   EXIT.                                                          023000      
002977                                                                  023100      
002978                                                                  023200      
002979                                                                  023500      
002980*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002981*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002982*   COPY "S151/CRONOS2K/CPY/P025/PD".                             067900      
002983                                                                  001000      
002984                                                                  002000      
002985*FOR CONVERTING GROUP VARIABLE OF CALL "S151LIB020 IN LIB-L020"*  003000      
002986                                                                  004000      
002987                                                                  014000      
002988 A2K-1-WKS-MOV-DATOS-PARA.                                        015000      
002989     MOVE  WKS-MOV-FUNCION      TO A2K-WKS-MOV-FUNCION.           016000      
002990     MOVE  WKS-MOV-SISTEMA      TO A2K-WKS-MOV-SISTEMA.           017000      
002991     MOVE  WKS-MOV-PRODUCTO     TO A2K-WKS-MOV-PRODUCTO.          018000      
002992     MOVE  WKS-MOV-INSTRUMENTO  TO A2K-WKS-MOV-INSTRUMENTO.       019000      
002993     MOVE  WKS-MOV-SUCPROM      TO A2K-WKS-MOV-SUCPROM.           020000      
002994     MOVE  WKS-MOV-CONTRATO     TO A2K-WKS-MOV-CONTRATO.          021000      
002995   PERFORM A2K-1-WKS-TAB-CVEIMP-PARA THRU                         022000      
002996              A2K-1-WKS-TAB-CVEIMP-PARA-X                         022050      
002997                 VARYING K FROM 1 BY 1 UNTIL K > 5.               022100      
002998                                                                  028000      
002999    MOVE ZEROS TO A2K-FEC-AMD-001                                 028100      
003000    MOVE WKS-MOV-FECMOV TO A2K-FEC-AMD-001                        029000      
003001    PERFORM A2K-CONV-AMD-TO-CAMD THRU                             029100      
003002            A2K-CONV-AMD-TO-CAMD-EXIT                             029200      
003003    MOVE A2K-FEC-CAMD-001 TO A2K-WKS-MOV-FECMOV.                  029300      
003004    MOVE  WKS-MOV-HORMOV TO A2K-WKS-MOV-HORMOV.                   030000      
003005    MOVE ZEROS TO A2K-FEC-AMD-001                                 030100      
003006    MOVE WKS-MOV-FECCONT TO A2K-FEC-AMD-001                       030200      
003007    PERFORM A2K-CONV-AMD-TO-CAMD THRU                             030300      
003008            A2K-CONV-AMD-TO-CAMD-EXIT                             030400      
003009    MOVE A2K-FEC-CAMD-001 TO A2K-WKS-MOV-FECCONT.                 030500      
003010                                                                  031000      
003011    MOVE ZEROS TO A2K-FEC-AMD-001                                 035000      
003012    MOVE WKS-MOV-FECVAL TO A2K-FEC-AMD-001                        035100      
003013    PERFORM A2K-CONV-AMD-TO-CAMD THRU                             035200      
003014            A2K-CONV-AMD-TO-CAMD-EXIT                             035300      
003015    MOVE  A2K-FEC-CAMD-001    TO   A2K-WKS-MOV-FECVAL.            035400      
003016    MOVE  WKS-MOV-AUTORIZA       TO   A2K-WKS-MOV-AUTORIZA.       036000      
003017    MOVE   WKS-MOV-AUT3ER        TO   A2K-WKS-MOV-AUT3ER.         037000      
003018    MOVE   WKS-MOV-REFNUM        TO   A2K-WKS-MOV-REFNUM.         038000      
003019    MOVE   WKS-MOV-CVEMDA        TO   A2K-WKS-MOV-CVEMDA.         039000      
003020    MOVE   WKS-MOV-NUMMDA        TO   A2K-WKS-MOV-NUMMDA.         040000      
003021    MOVE  WKS-MOV-CVEMDE         TO   A2K-WKS-MOV-CVEMDE.         044000      
003022    MOVE  WKS-MOV-SUC-INIC       TO   A2K-WKS-MOV-SUC-INIC.       045000      
003023    MOVE  WKS-MOV-CAJA-INIC      TO   A2K-WKS-MOV-CAJA-INIC.      046000      
003024    MOVE  WKS-MOV-SUCOPER        TO   A2K-WKS-MOV-SUCOPER.        047000      
003025    MOVE  WKS-MOV-CAJAOPER       TO   A2K-WKS-MOV-CAJAOPER.       048000      
003026    MOVE  WKS-MOV-SUCTRAN        TO   A2K-WKS-MOV-SUCTRAN.        049000      
003027    MOVE  WKS-MOV-CAJATRAN       TO   A2K-WKS-MOV-CAJATRAN.       050000      
003028    MOVE  WKS-MOV-NOMINA-OPE     TO   A2K-WKS-MOV-NOMINA-OPE.     051000      
003029    MOVE  WKS-MOV-ORIGEN         TO   A2K-WKS-MOV-ORIGEN.         052000      
003030    MOVE  WKS-MOV-MONEDA         TO   A2K-WKS-MOV-MONEDA.         053000      
003031    MOVE  WKS-MOV-AUT-S151       TO   A2K-WKS-MOV-AUT-S151.       054000      
003032    MOVE  WKS-MOV-AUT-AELIM-S151 TO   A2K-WKS-MOV-AUT-AELIM-S151. 055000      
003033    MOVE  WKS-MOV-AUT-ANT-S151   TO   A2K-WKS-MOV-AUT-ANT-S151.   056000      
003034    MOVE  WKS-MOV-TIPO-PROC      TO   A2K-WKS-MOV-TIPO-PROC.      057000      
003035    MOVE  WKS-MOV-SOBREGIRO      TO   A2K-WKS-MOV-SOBREGIRO.      058000      
003036    MOVE  WKS-MOV-CVEAVISO       TO   A2K-WKS-MOV-CVEAVISO.       059000      
003037    MOVE  WKS-MOV-IND-EDOCTA     TO   A2K-WKS-MOV-IND-EDOCTA.     060000      
003038    MOVE  WKS-MOV-IND-DATOS-ADIC TO   A2K-WKS-MOV-IND-DATOS-ADIC. 061000      
003039    MOVE  WKS-MOV-IND-CONTA      TO   A2K-WKS-MOV-IND-CONTA.      062000      
003040    MOVE  WKS-MOV-IND-NUMREN     TO   A2K-WKS-MOV-IND-NUMREN.     063000      
003041    MOVE  WKS-MOV-ACTIVIDAD      TO   A2K-WKS-MOV-ACTIVIDAD.      064000      
003042    MOVE  WKS-MOV-SECTOR         TO   A2K-WKS-MOV-SECTOR.         065000      
003043    MOVE  WKS-MOV-BANCA          TO  A2K-WKS-MOV-BANCA.           066000      
003044    MOVE  WKS-MOV-FIL-FUTURO     TO  A2K-WKS-MOV-FIL-FUTURO.      067000      
003045    MOVE  WKS-MOV-NODO-ORIG      TO  A2K-WKS-MOV-NODO-ORIG.       068000      
003046    MOVE  WKS-MOV-APU-DESC       TO  A2K-WKS-MOV-APU-DESC.        069000      
003047    MOVE  WKS-MOV-STATUS         TO  A2K-WKS-MOV-STATUS.          070000      
003048                                                                  071000      
003049    MOVE  WKS-MOV-DATOS-ADIC     TO  A2K-WKS-MOV-DATOS-ADIC.      072000      
003050                                                                  073000      
003051 A2K-1-WKS-MOV-DATOS-PARA-X.                                      073020      
003052    EXIT.                                                         073040      
003053                                                                  073100      
003054 A2K-1-WKS-TAB-CVEIMP-PARA.                                       073200      
003055    MOVE WKS-MOV-CVETRAN(K)      TO  A2K-WKS-MOV-CVETRAN(K).      073300      
003056    MOVE WKS-MOV-INDLEY(K)       TO  A2K-WKS-MOV-INDLEY(K).       073400      
003057    MOVE WKS-MOV-ESQCON(K)       TO  A2K-WKS-MOV-ESQCON(K).       073500      
003058    MOVE WKS-MOV-IMPORTE(K)      TO  A2K-WKS-MOV-IMPORTE(K).      073600      
003059 A2K-1-WKS-TAB-CVEIMP-PARA-X.                                     073700      
003060    EXIT.                                                         073800      
003061                                                                  073900      
003062                                                                  074000      
003063*FOR REVERTING GROUP VARIABLE OF CALL "S151LIB020 IN LIB-L020"**  074100      
003064                                                                  074200      
003065                                                                  074300      
003066 A2K-2-WKS-MOV-DATOS-PARA.                                        074400      
003067     MOVE  A2K-WKS-MOV-FUNCION      TO WKS-MOV-FUNCION.           074500      
003068     MOVE  A2K-WKS-MOV-SISTEMA      TO WKS-MOV-SISTEMA.           074600      
003069     MOVE  A2K-WKS-MOV-PRODUCTO     TO WKS-MOV-PRODUCTO.          074700      
003070     MOVE  A2K-WKS-MOV-INSTRUMENTO  TO WKS-MOV-INSTRUMENTO.       074800      
003071     MOVE  A2K-WKS-MOV-SUCPROM      TO WKS-MOV-SUCPROM.           074900      
003072     MOVE  A2K-WKS-MOV-CONTRATO     TO WKS-MOV-CONTRATO.          075000      
003073   PERFORM A2K-2-WKS-TAB-CVEIMP-PARA THRU                         075100      
003074              A2K-2-WKS-TAB-CVEIMP-PARA-X                         075200      
003075                 VARYING K FROM 1 BY 1 UNTIL K > 5.               075300      
003076                                                                  075400      
003077    MOVE ZEROS TO A2K-FEC-CAMD-001                                075500      
003078    MOVE A2K-WKS-MOV-FECMOV TO A2K-FEC-CAMD-001                   075600      
003079    PERFORM A2K-CONV-CAMD-TO-AMD THRU                             075700      
003080            A2K-CONV-CAMD-TO-AMD-EXIT                             075800      
003081    MOVE A2K-FEC-AMD-001 TO WKS-MOV-FECMOV.                       075900      
003082    MOVE  A2K-WKS-MOV-HORMOV TO WKS-MOV-HORMOV.                   076000      
003083    MOVE ZEROS TO A2K-FEC-CAMD-001                                076100      
003084    MOVE A2K-WKS-MOV-FECCONT TO A2K-FEC-CAMD-001                  076200      
003085    PERFORM A2K-CONV-CAMD-TO-AMD THRU                             076300      
003086            A2K-CONV-CAMD-TO-AMD-EXIT                             076400      
003087    MOVE A2K-FEC-AMD-001 TO WKS-MOV-FECCONT.                      076500      
003088                                                                  076600      
003089    MOVE ZEROS TO A2K-FEC-CAMD-001                                076700      
003090    MOVE A2K-WKS-MOV-FECVAL TO A2K-FEC-CAMD-001                   076800      
003091    PERFORM A2K-CONV-CAMD-TO-AMD THRU                             076900      
003092            A2K-CONV-CAMD-TO-AMD-EXIT                             077000      
003093    MOVE  A2K-FEC-AMD-001    TO   WKS-MOV-FECVAL.                 077100      
003094    MOVE  A2K-WKS-MOV-AUTORIZA       TO   WKS-MOV-AUTORIZA.       077200      
003095    MOVE   A2K-WKS-MOV-AUT3ER        TO   WKS-MOV-AUT3ER.         077300      
003096    MOVE   A2K-WKS-MOV-REFNUM        TO   WKS-MOV-REFNUM.         077400      
003097    MOVE   A2K-WKS-MOV-CVEMDA        TO   WKS-MOV-CVEMDA.         077500      
003098    MOVE   A2K-WKS-MOV-NUMMDA        TO   WKS-MOV-NUMMDA.         077600      
003099    MOVE  A2K-WKS-MOV-CVEMDE         TO   WKS-MOV-CVEMDE.         078000      
003100    MOVE  A2K-WKS-MOV-SUC-INIC       TO   WKS-MOV-SUC-INIC.       078100      
003101    MOVE  A2K-WKS-MOV-CAJA-INIC      TO   WKS-MOV-CAJA-INIC.      078200      
003102    MOVE  A2K-WKS-MOV-SUCOPER        TO   WKS-MOV-SUCOPER.        078300      
003103    MOVE  A2K-WKS-MOV-CAJAOPER       TO   WKS-MOV-CAJAOPER.       078400      
003104    MOVE  A2K-WKS-MOV-SUCTRAN        TO   WKS-MOV-SUCTRAN.        078500      
003105    MOVE  A2K-WKS-MOV-CAJATRAN       TO   WKS-MOV-CAJATRAN.       078600      
003106    MOVE  A2K-WKS-MOV-NOMINA-OPE     TO   WKS-MOV-NOMINA-OPE.     078700      
003107    MOVE  A2K-WKS-MOV-ORIGEN         TO   WKS-MOV-ORIGEN.         078800      
003108    MOVE  A2K-WKS-MOV-MONEDA         TO   WKS-MOV-MONEDA.         078900      
003109    MOVE  A2K-WKS-MOV-AUT-S151       TO   WKS-MOV-AUT-S151.       079000      
003110    MOVE  A2K-WKS-MOV-AUT-AELIM-S151 TO   WKS-MOV-AUT-AELIM-S151. 079100      
003111    MOVE  A2K-WKS-MOV-AUT-ANT-S151   TO   WKS-MOV-AUT-ANT-S151.   079200      
003112    MOVE  A2K-WKS-MOV-TIPO-PROC      TO   WKS-MOV-TIPO-PROC.      079300      
003113    MOVE  A2K-WKS-MOV-SOBREGIRO      TO   WKS-MOV-SOBREGIRO.      079400      
003114    MOVE  A2K-WKS-MOV-CVEAVISO       TO   WKS-MOV-CVEAVISO.       079500      
003115    MOVE  A2K-WKS-MOV-IND-EDOCTA     TO   WKS-MOV-IND-EDOCTA.     079600      
003116    MOVE  A2K-WKS-MOV-IND-DATOS-ADIC TO   WKS-MOV-IND-DATOS-ADIC. 079700      
003117    MOVE  A2K-WKS-MOV-IND-CONTA      TO   WKS-MOV-IND-CONTA.      079800      
003118    MOVE  A2K-WKS-MOV-IND-NUMREN     TO   WKS-MOV-IND-NUMREN.     079900      
003119    MOVE  A2K-WKS-MOV-ACTIVIDAD      TO   WKS-MOV-ACTIVIDAD.      080000      
003120    MOVE  A2K-WKS-MOV-SECTOR         TO   WKS-MOV-SECTOR.         080100      
003121    MOVE  A2K-WKS-MOV-BANCA          TO   WKS-MOV-BANCA.          080200      
003122    MOVE  A2K-WKS-MOV-FIL-FUTURO     TO   WKS-MOV-FIL-FUTURO.     080300      
003123    MOVE  A2K-WKS-MOV-NODO-ORIG      TO   WKS-MOV-NODO-ORIG.      080400      
003124    MOVE  A2K-WKS-MOV-APU-DESC       TO   WKS-MOV-APU-DESC.       080500      
003125    MOVE  A2K-WKS-MOV-STATUS         TO   WKS-MOV-STATUS.         080600      
003126                                                                  080700      
003127    MOVE  A2K-WKS-MOV-DATOS-ADIC     TO   WKS-MOV-DATOS-ADIC.     080800      
003128                                                                  080900      
003129 A2K-2-WKS-MOV-DATOS-PARA-X.                                      081000      
003130    EXIT.                                                         081100      
003131                                                                  081200      
003132 A2K-2-WKS-TAB-CVEIMP-PARA.                                       081300      
003133    MOVE A2K-WKS-MOV-CVETRAN(K)      TO  WKS-MOV-CVETRAN(K).      081400      
003134    MOVE A2K-WKS-MOV-INDLEY(K)       TO  WKS-MOV-INDLEY(K).       081500      
003135    MOVE A2K-WKS-MOV-ESQCON(K)       TO  WKS-MOV-ESQCON(K).       081600      
003136    MOVE A2K-WKS-MOV-IMPORTE(K)      TO  WKS-MOV-IMPORTE(K).      081700      
003137 A2K-2-WKS-TAB-CVEIMP-PARA-X.                                     081800      
003138    EXIT.                                                         081900      
003139*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003140 A2K-CPY-EXIT-PARA.                                               068000      
003141   EXIT.                                                          068100      
003142*TERMINA CODIGO DE RENOVACION CRONOS 2000                         068200      
