000001$SET LIST ERRORLIMIT = 5                                          000100      
000002*$SET TADS                                                        000200      
000003 IDENTIFICATION DIVISION.                                         000300      
000004 AUTHOR. INFOWARE.                                                000400      
000005******************************************************************000500      
000006* GENERA PUNTEO DE SALDOS ENTRE LOS ARCHIVOS CITIDIRECT          *000600      
000007* AHR  VS  ACC .                                                 *000700      
000008*                                                                *000710      
000009* RECOMPILACION POR EL UPGRADE DEL MCP A 55                      *000712      
000010* 20141208 15MTP001 MJGRG                                        *000714      
000011******************************************************************000800      
000012 ENVIRONMENT DIVISION.                                            000900      
000013 INPUT-OUTPUT SECTION.                                            001000      
000014 FILE-CONTROL.                                                    001100      
000015                                                                  001200      
000016      SELECT ARCH-AHR       ASSIGN TO DISK.                       001300      
000017                                                                  001400      
000018      SELECT ARCH-ACC       ASSIGN TO DISK.                       001500      
000019                                                                  001600      
000020      SELECT ARCH-ACC2      ASSIGN TO DISK                        001700      
000021                            ORGANIZATION IS INDEXED               001800      
000022                            ACCESS MODE IS DYNAMIC                001900      
000023                            RECORD KEY IS ACC-LLAVE.              002000      
000024                                                                  002100      
000025      SELECT V00-REP-SDOS   ASSIGN TO PRINTER.                    002200      
000026                                                                  002250      
000027      SELECT ARCHIVO-P171   ASSIGN TO DISK.                       002300      
000028                                                                  002302      
000029      SELECT ARCH-CTAS      ASSIGN TO DISK                        002304      
000030                ORGANIZATION IS INDEXED                           002306      
000031                ACCESS MODE IS DYNAMIC                            002308      
000032                RECORD KEY IS WKS-LLAVE-CTAS.                     002310      
000033                                                                  002312      
000034      SELECT ARCH-CTAS2     ASSIGN TO DISK                        002314      
000035                ORGANIZATION IS INDEXED                           002316      
000036                ACCESS MODE IS SEQUENTIAL                         002318      
000037                RECORD KEY IS WKS-LLAVE-CTAS2.                    002319      
000038                                                                  002320      
000039 DATA DIVISION.                                                   002400      
000040 FILE SECTION.                                                    002500      
000041                                                                  002600      
000042 FD ARCH-AHR                                                      002700      
000043*===========                                                      002800      
000044    VALUE OF                                                      002900      
000045          SECURITYTYPE IS PUBLIC                                  003000      
000046          TITLE IS WKS-TIT-AHR                                    003100      
000047          DEPENDENTSPECS IS TRUE.                                 003200      
000048                                                                  003300      
000049*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000050*    COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/AHR".                  003400      
000051                                                                  000100      
000052*=================================================================000200      
000053*==  REGISTRO DEL ARCHIVO DE INTERFASE PARA CITI  *** AHR ***   ==000300      
000054*=================================================================000400      
000055                                                                  000500      
000056** REGISTRO AHR.                                                  000600      
000057                                                                  000700      
000058 01 AHRST-REC.                                                    000800      
000059    02 AHRST-RECORD-TYPE         PIC X(03).                       000900      
000060    02 AHRST-GRP-KEY             PIC X(44).                       001000      
000061    02 AHRST-GRP-KEY-R           REDEFINES AHRST-GRP-KEY.         001100      
000062       05 AHRST-BRCH-NBR         PIC 9(03).                       001200      
000063       05 AHRST-ACCT-NBR.                                         001300      
000064          07 AHRST-ACCT-NBR1     PIC 9(12).                       001320      
000065          07 AHRST-ACCT-NBR2     PIC 9(23).                       001340      
000066       05 AHRST-TXN-DATE         PIC 9(06).                       001400      
000067    02 AHRST-VAL-DATE            PIC 9(06).                       001500      
000068    02 AHRST-SUBSYSTEM-CODE      PIC X(03).                       001600      
000069    02 AHRST-TXN-CODE            PIC 9(04).                       001700      
000070    02 AHRST-DR-CR-IND           PIC X(01).                       001800      
000071    02 AHRST-CCY-CODE            PIC 9(03).                       001900      
000072    02 AHRST-TXN-AMT             PIC 9(15)V9(02).                 002000      
000073    02 AHRST-TXN-AMT-SIGN        PIC X(01).                       002100      
000074    02 AHRST-LDGR-AMT            PIC 9(15)V9(02).                 002200      
000075    02 AHRST-LDGR-AMT-SIGN       PIC X(01).                       002300      
000076    02 AHRST-CTRCT-REF-NBR       PIC X(16).                       002400      
000077    02 AHRST-CTRCT-HIST-SEQ-NBR  PIC 9(04).                       002500      
000078    02 AHRST-THEIR-REF-NBR       PIC X(16).                       002600      
000079    02 AHRST-REVRS-IND           PIC X(01).                       002700      
000080    02 AHRST-SWIFT-CCY-CODE      PIC X(04).                       002800      
000081    02 AHRST-TEXT-LINE-COUNT     PIC 9(01).                       002900      
000082    02 AHRST-TEXT-LINE1          PIC X(35).                       003000      
000083    02 AHRST-TEXT-LINE2          PIC X(35).                       003100      
000084    02 AHRST-TEXT-LINE3          PIC X(35).                       003200      
000085    02 AHRST-TEXT-LINE4          PIC X(35).                       003300      
000086    02 AHRST-TEXT-LINE5          PIC X(35).                       003400      
000087*AHM INI SAT Regulation Anexo 20                                  003403      
000088    02 AHRST-CVE-ORD             PIC X(35).                       003406      
000089    02 AHRST-CVE-ORD-R           REDEFINES AHRST-CVE-ORD.         003409      
000090       05 AHRST-CVE-ORD-15       PIC 9(15).                       003412      
000091       05 AHRST-CVE-ORD-20       PIC 9(20).                       003415      
000092    02 AHRST-NOM-ORD             PIC X(120).                      003418      
000093    02 AHRST-RFC-ORD             PIC X(20).                       003421      
000094    02 AHRST-BCO-ORD             PIC X(20).                       003424      
000095    02 AHRST-CTA-BENEF           PIC X(35).                       003427      
000096    02 AHRST-CTA-BENEF-R         REDEFINES AHRST-CTA-BENEF.       003430      
000097       05 AHRST-CTA-BENEF-15     PIC 9(15).                       003433      
000098       05 AHRST-CTA-BENEF-20     PIC 9(20).                       003436      
000099    02 AHRST-NOM-BENEF           PIC X(120).                      003439      
000100    02 AHRST-RFC-BENEF           PIC X(20).                       003442      
000101    02 AHRST-BCO-BENEF           PIC X(20).                       003445      
000102    02 AHRST-CVE-RASTREO         PIC X(30).                       003448      
000103    02 AHRST-FEC-LIQUID          PIC 9(08).                       003451      
000104    02 AHRST-HORA-LIQUID         PIC 9(08).                       003454      
000105    02 AHRST-HORA-LIQUID-R       REDEFINES AHRST-HORA-LIQUID.     003457      
000106       05 AHRST-HORA-LIQUID-6    PIC 9(06).                       003460      
000107       05 AHRST-HORA-LIQUID-2    PIC 9(02).                       003463      
000108    02 AHRST-SELLO-DIGIT         PIC X(400).                      003466      
000109    02 AHRST-FEC-DEV             PIC 9(08).                       003469      
000110    02 AHRST-HORA-DEV            PIC 9(06).                       003472      
000111    02 AHRST-CAUSA-DEV           PIC X(120).                      003475      
000112    02 AHRST-ID-DEV              PIC 9(01).                       003478      
000113    02 AHRST-INT-DEV             PIC 9(20).                       003481      
000114    02 AHRST-FEC-ENV             PIC 9(08).                       003484      
000115    02 AHRST-HORA-ENV            PIC 9(08).                       003487      
000116    02 AHRST-ESTADO-TRAN         PIC X(40).                       003490      
000117*AHM FIN                                                          003493      
000118    02 AHRST-PRIME-DELIMETER     PIC X(01).                       003500      
000119    02 AHRST-DFT-PAYMENT-TYPE    PIC 9(01).                       003520      
000120    02 AHRST-FILLER              PIC X(02).                       003550      
000121                                                                  003600      
000122 01 AHRST-REC-TRAILER.                                            003700      
000123    02 AHRST-LEYENDA             PIC X(11).                       003800      
000124    02 FILLER                    PIC X(1357).                     003900      
000125                                                                  004000      
000126                                                                  004100      
000127*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000128                                                                  003500      
000129 FD ARCH-ACC                                                      003600      
000130*===========                                                      003700      
000131    BLOCK CONTAINS 5 RECORDS                                      003800      
000132    VALUE OF TITLE IS WKS-TIT-ACC                                 003900      
000133             SECURITYTYPE IS PUBLIC.                              004000      
000134                                                                  004100      
000135*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000136*    COPY "CITIDIRECT/S151/FORMATO/ARCHIVO/ACC" FROM 100 TO 3900. 004200      
000137******************************************************************000100      
000138*                                                                *000200      
000139*             FORMATO DEL ARCHIVO DE SALDOS CBII ACC             *000300      
000140*                                                                *000400      
000141******************************************************************000500      
000142                                                                  000600      
000143                                                                  000700      
000144                                                                  000800      
000145 01 ACCI-INT-REC.                                                 000900      
000146    05 ACCI-RECORD-TYPE            PIC  X(03).                    001000      
000147    05 ACCI-KEY-GRP.                                              001100      
000148       10 ACCI-BRCH-NBR            PIC 9(03).                     001200      
000149       10 ACCI-GEN-CUST            PIC 9(12).                     001300      
000150       10 ACCI-CCY-CODE            PIC 9(03).                     001400      
000151       10 ACCI-ACCT-NBR.                                          001500      
000152          15 ACCI-ACCT-NBR1        PIC 9(12).                     001520      
000153          15 ACCI-ACCT-NBR2        PIC 9(23).                     001540      
000154       10 ACCI-LIA-NBR             PIC 9(11).                     001600      
000155    05 ACCI-SWIFT-CCY-CODE         PIC X(04).                     001700      
000156    05 ACCI-SHORT-NAME-TEXT        PIC X(32).                     001800      
000157    05 ACCI-ACCT-STAT-IND          PIC X(01).                     001900      
000158    05 ACCI-CAT-CODE               PIC 9(07).                     002000      
000159    05 ACCI-LAST-TXN-DATE          PIC 9(07).                     002100      
000160    05 ACCI-ACCT-BAL-AMT           PIC 9(15)V99.                  002200      
000161    05 ACCI-ACCT-BAL-AMT-SIGN      PIC X(01).                     002300      
000162    05 ACCI-LCY-ACCT-BAL-AMT       PIC 9(15)V99.                  002400      
000163    05 ACCI-LCY-BAL-AMT-SIGN       PIC X(01).                     002500      
000164    05 ACCI-DISP-VAL-BAL-AMT       PIC 9(15)V99.                  002600      
000165    05 ACCI-DISP-BAL-AMT-SIGN      PIC X(01).                     002700      
000166    05 ACCI-BANK-NON-BANK          PIC X(03).                     002800      
000167    05 ACCI-MAIL                   PIC X(04).                     002900      
000168    05 ACCI-MAIL-TO-COLLECT        PIC X(01).                     003000      
000169    05 ACCI-MAIL-RULEOFF           PIC X(02).                     003100      
000170    05 ACCI-LANGUAGE-CODE          PIC 9(02).                     003200      
000171    05 ACCI-FILLER                 PIC X(25).                     003300      
000172    05 ACCI-CUSTOMER-NAME          PIC X(35).                     003400      
000173    05 ACCI-CBR-ADDRESS-1          PIC X(35).                     003500      
000174    05 ACCI-CBR-ADDRESS-2          PIC X(35).                     003600      
000175    05 ACCI-CBR-ADDRESS-3          PIC X(35).                     003700      
000176    05 ACCI-CBR-ADDRESS-4          PIC X(35).                     003800      
000177    05 ACCI-PRIME-DELIMETER        PIC X(01).                     003900      
000178*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000179                                                                  004250      
000180 01 ACCI-TR-REC.                                                  004255      
000181    05 ACCI-ENDOFFILE                        PIC X(11).           004260      
000182    05 FILLER                                PIC X(374).          004270      
000183                                                                  004300      
000184 FD ARCH-ACC2                                                     004400      
000185    VALUE OF BUFFERS IS 40                                        004500      
000186    VALUE OF TITLE IS "(S151)S151/FILE/ACC2CD ON CMEMP.".         004600      
000187                                                                  004700      
000188 01 REG-ARCH-ACC2.                                                004800      
000189    03 ACC-LLAVE.                                                 004900      
000190       05 ACC-CUENTA                         PIC  9(11).          005000      
000191    03 ACC-RESTO-REG.                                             005100      
000192       05 ACC-CTA-FTOBANAMEX                 PIC  9(11).          005200      
000193       05 ACC-SALDO                          PIC  9(14)V99.       005300      
000194       05 ACC-SSDO                           PIC  X(01).          005400      
000195       05 FILLER                             PIC  X(03).          005500      
000196                                                                  005600      
000197 FD V00-REP-SDOS.                                                 005700      
000198*================                                                 005800      
000199 01 V00-R00-SDOS                             PIC X(132).          005900      
000200                                                                  006000      
000201 FD ARCHIVO-P171                                                  006010      
000202*===============                                                  006020      
000203    VALUE OF                                                      006040      
000204                 SECURITYTYPE IS PUBLIC                           006050      
000205                 TITLE WKS-TIT-AR-BAN                             006060      
000206                 DEPENDENTSPECS IS TRUE.                          006070      
000207                                                                  006080      
000208 01 REG-ARCH-171                            PIC X(10).            006090      
000209                                                                  006092      
000210 FD ARCH-CTAS                                                     006094      
000211    VALUE OF BUFFERS IS 40                                        006096      
000212    VALUE OF TITLE IS "(S151)S151/FILE/CTAS ON CMEMP.".           006098      
000213                                                                  006100      
000214 01 REG-ARCH-CTAS.                                                006102      
000215    03 WKS-LLAVE-CTAS .                                           006104      
000216       05 WKS-CTA-AHR                         PIC  9(11)    .     006106      
000217    03 WKS-RESTO-REG.                                             006108      
000218       05 WKS-SDO-AHR                         PIC  9(12)V99 .     006110      
000219       05 WKS-SDO-ACC                         PIC  9(14)V99 .     006112      
000220       05 WKS-SSDO-AHR                        PIC  X(01)    .     006114      
000221       05 WKS-SSDO-ACC                        PIC  X(01)    .     006116      
000222*                                                                 006118      
000223 FD ARCH-CTAS2                                                    006120      
000224    VALUE OF BUFFERS IS 40                                        006122      
000225    VALUE OF TITLE IS "(S151)S151/FILE/CTAS ON CMEMP.".           006124      
000226                                                                  006126      
000227 01 REG-ARCH-CTAS2.                                               006128      
000228    03 WKS-LLAVE-CTAS2.                                           006130      
000229       05 WKS-CTA2-AHR                        PIC  9(11)    .     006132      
000230    03 WKS-RESTO2-REG.                                            006134      
000231       05 WKS-SDO2-AHR                        PIC  9(12)V99 .     006136      
000232       05 WKS-SDO2-ACC                        PIC  9(14)V99 .     006138      
000233       05 WKS-SSDO2-AHR                       PIC  X(01)    .     006140      
000234       05 WKS-SSDO2-ACC                       PIC  X(01)    .     006142      
000235                                                                  006144      
000236 WORKING-STORAGE SECTION.                                         006200      
000237                                                                  006300      
000238*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000239* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL ON CMEMP.".         006400      
000240*================================================================ 000100      
000241*         ENTRY-POINT CONSISDIA :                               = 000200      
000242*                                                                 000300      
000243* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000244* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000245* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000246* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000247* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000248* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000249* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000250* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000251* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000252* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000253*                                                               = 001400      
000254*================================================================ 001500      
000255                                                                  001600      
000256                                                                  001700      
000257*================================================================ 001800      
000258* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000259*                                                               = 002000      
000260* ENTRADA REQUERIDA :                                           = 002100      
000261*                                                               = 002200      
000262*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000263*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000264*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000265*================================================================ 002600      
000266 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000267    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000268    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000269    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000270    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000271    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000272    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000273    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000274    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000275    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000276    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000277    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000278    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000279    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000280    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000281    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000282    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000283    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000284    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000285    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000286    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000287       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000288       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000289       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000290       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000291*==============================================================   005200      
000292*                                                             =   005300      
000293* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000294*                                                             =   005500      
000295* CAMPOS REQUERIDOS :                                         =   005600      
000296*                                                             =   005700      
000297* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000298* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000299* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000300* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000301*==============================================================   006200      
000302 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000303    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000304    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000305    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000306    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000307                                                                  006800      
000308*==============================================================   006900      
000309*                                                             =   007000      
000310* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000311*                                                             =   007200      
000312* CAMPOS REQUERIDOS :                                         =   007300      
000313*                                                             =   007400      
000314* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000315* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000316* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000317* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000318*==============================================================   007900      
000319 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000320    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000321    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000322    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000323    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000324                                                                  008500      
000325*==============================================================   008600      
000326*                                                             =   008700      
000327* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000328*                                                             =   008900      
000329* CAMPOS REQUERIDOS :                                         =   009000      
000330*                                                             =   009100      
000331* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000332* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000333* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000334* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000335*==============================================================   009600      
000336 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000337    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000338    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000339    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000340    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000341                                                                  010200      
000342*============================================================     010300      
000343* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000344*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000345*                                                           =     010600      
000346*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000347*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000348*                                                           =     010900      
000349*  ENTRADA REQUERIDA.                                       =     011000      
000350*                                                           =     011100      
000351*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000352*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000353*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000354*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000355*============================================================     011600      
000356                                                                  011700      
000357 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000358     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000359     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000360     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000361     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000362                                                                  012300      
000363*=============================================================    012400      
000364*                                                            =    012500      
000365* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000366*             B01-SIS-FECARMOV.                              =    012700      
000367*                                                            =    012800      
000368* ENTRADA REQUERIDAD :                                       =    012900      
000369*                                                            =    013000      
000370*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000371*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000372*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000373*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000374*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000375*=============================================================    013600      
000376                                                                  013700      
000377 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000378     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000379     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000380     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000381     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000382     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000383*================================================================ 014400      
000384*                                                               = 014500      
000385* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000386*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000387*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000388*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000389*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000390*                                                               = 015100      
000391* ENTRADA REQUERIDA :                                           = 015200      
000392*                                                               = 015300      
000393* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000394* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000395* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000396* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000397* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000398*================================================================ 015900      
000399 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000400    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000401    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000402    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000403    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000404    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000405                                                                  016600      
000406*============================================================     016700      
000407*                                                           =     016800      
000408* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000409*                                                           =     017000      
000410* DATOS REQUERIDOS :                                        =     017100      
000411*                                                           =     017200      
000412* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000413* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000414* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000415* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000416* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000417*============================================================     017800      
000418                                                                  017900      
000419 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000420     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000421     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000422     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000423     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000424     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000425                                                                  018600      
000426*============================================================     018700      
000427*                                                           =     018800      
000428* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000429*                                                           =     019000      
000430* DATOS REQUERIDOS :                                        =     019100      
000431*                                                           =     019200      
000432* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000433* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000434* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000435* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000436* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000437*============================================================     019800      
000438                                                                  019900      
000439 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000440     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000441     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000442     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000443     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000444     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000445                                                                  020600      
000446*===============================================================  020700      
000447*                                                              =  020800      
000448* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000449*              MOVIMIENTOS.                                    =  021000      
000450* DATOS REQUERIDOS :                                           =  021100      
000451*                                                              =  021200      
000452* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000453* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000454* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000455* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000456* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000457* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000458*==============================================================   021900      
000459                                                                  022000      
000460 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000461     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000462     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000463     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000464     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000465     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000466     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000467*==============================================================   022800      
000468*                                                             =   022900      
000469* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000470*                                                             =   023100      
000471* CAMPOS REQUERIDOS :                                         =   023200      
000472*                                                             =   023300      
000473* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000474* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000475* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000476* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000477*==============================================================   023800      
000478 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000479    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000480    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000481    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000482    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000483                                                                  024304      
000484*=================================================================024306      
000485*                ENTRY POINT CONSISB01                           =024308      
000486*                                                                =024310      
000487*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000488*                                                                =024314      
000489*  FUNCIONES DISPONIBLES :                                       =024316      
000490*                                                                =024318      
000491*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000492*                                                                =024322      
000493*  PARAMETROS REQUERIDOS                                         =024324      
000494*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000495*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000496*=================================================================024330      
000497                                                                  024332      
000498 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000499     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000500     03 WKS-CON-CSI                PIC 9(02).                     024336      
000501     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000502     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000503        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000504        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000505        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000506        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000507        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000508                                                                  024400      
000509*=================================================================024500      
000510*                ENTRY POINT B02ARCINTER                         =024600      
000511*                                                                =024700      
000512*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000513*                                                                =024900      
000514*  FUNCIONES DISPONIBLES :                                       =025000      
000515*                                                                =025100      
000516*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000517* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000518* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000519* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000520*                                                                =025600      
000521*  PARAMETROS REQUERIDOS                                         =025700      
000522*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000523*                                                                =025900      
000524*=================================================================026000      
000525 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000526     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000527     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000528     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000529     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000530     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000531     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000532     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000533     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000534     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000535     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000536     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000537     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000538     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000539     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000540     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000541     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000542     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000543     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000544     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000545     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000546     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000547     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000548     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000549     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000550     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000551     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000552     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000553     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000554                                                                  029000      
000555*=================================================================029100      
000556*                ENTRY POINT B04SISTEMA                          =029200      
000557*                                                                =029300      
000558*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000559*                                                                =029500      
000560*  FUNCIONES DISPONIBLES :                                       =029600      
000561*                                                                =029700      
000562*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000563*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000564*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000565*                                                                =030100      
000566*  PARAMETROS REQUERIDOS                                         =030200      
000567*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000568*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000569*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000570*                                                                =030600      
000571*=================================================================030700      
000572 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000573     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000574     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000575     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000576     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000577     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000578     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000579     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000580                                                                  031600      
000581*================================================================ 031700      
000582*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000583*                                                               = 031900      
000584*  FUNCION                                                      = 032000      
000585*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000586*   19       ALTAS.                                             = 032200      
000587*   22       BAJAS                                              = 032300      
000588*   37       CAMBIOS.                                           = 032400      
000589*                                                               = 032500      
000590*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000591*                      FECHA DE PROCESO                         = 032700      
000592*                      NUMERO DE PROCESO                        = 032800      
000593*                      FECHA INICIO                             = 032900      
000594*                      REGISTRO INICIAL                         = 033000      
000595*================================================================ 033100      
000596                                                                  033200      
000597 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000598     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000599     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000600     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000601     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000602     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000603     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000604     03 WKS-B05-MIX                PIC 9(08).                     034000      
000605     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000606     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000607     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000608     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000609     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000610     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000611                                                                  034700      
000612                                                                  034800      
000613*================================================================ 034900      
000614*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000615*                                                               = 035100      
000616*  FUNCION                                                      = 035200      
000617*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000618*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000619*                                                               = 035500      
000620*================================================================ 035600      
000621                                                                  035700      
000622 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000623     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000624     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000625     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000626     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000627     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000628     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000629                                                                  036500      
000630*===============================================================  036600      
000631*                                                              =  036700      
000632*         ENTRY-POINT CONSISMEN                                =  036800      
000633*                                                              =  036900      
000634*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000635*                      SISTEMA                                 =  037100      
000636*                                                              =  037200      
000637*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000638*                                                              =  037400      
000639*===============================================================  037500      
000640 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000641     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000642     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000643     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000644     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000645     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000646     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000647     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000648     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000649     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000650     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000651     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000652     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000653     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000654     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000655     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000656        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000657        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000658        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000659        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000660        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000661        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000662        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000663                                                                  039900      
000664*=====================================================            040000      
000665*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000666*=====================================================            040200      
000667 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000668     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000669     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000670     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000671                                                                  040700      
000672*=====================================================            040800      
000673*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000674*=====================================================            041000      
000675 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000676     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000677     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000678     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000679                                                                  041500      
000680*=====================================================            041600      
000681*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000682*=====================================================            041800      
000683 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000684     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000685     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000686     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000687*=====================================================            042300      
000688*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000689*=====================================================            042500      
000690 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000691     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000692     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000693     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000694                                                                  043000      
000695*=====================================================            043100      
000696*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000697*=====================================================            043300      
000698 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000699     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000700     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000701     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000702                                                                  043800      
000703*=====================================================            043900      
000704*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000705*=====================================================            044100      
000706 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000707     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000708     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000709     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000710                                                                  044600      
000711*=====================================================            044700      
000712*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000713*=====================================================            044900      
000714 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000715     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000716     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000717     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000718                                                                  045400      
000719*=====================================================            045500      
000720*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000721*=====================================================            045700      
000722 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000723     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000724     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000725     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000726                                                                  046200      
000727*=====================================================            046300      
000728*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000729*=====================================================            046500      
000730 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000731     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000732     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000733     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000734                                                                  047000      
000735*=====================================================            047100      
000736*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000737*=====================================================            047300      
000738 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000739     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000740     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000741     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000742                                                                  047800      
000743*=====================================================            047900      
000744*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000745*=====================================================            048100      
000746 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000747     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000748     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000749     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000750                                                                  048600      
000751*=====================================================            048700      
000752*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000753*=====================================================            048900      
000754 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000755     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000756     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000757     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000758                                                                  049400      
000759*=====================================================            049500      
000760*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000761*=====================================================            049700      
000762 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000763     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000764     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000765     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000766     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000767     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000768     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000769     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000770     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000771     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000772     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000773                                                                  050900      
000774*=====================================================            051000      
000775*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000776*=====================================================            051200      
000777 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000778     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000779     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000780     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000781     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000782                                                                  051800      
000783*=====================================================            051900      
000784*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000785*=====================================================            052100      
000786 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000787     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000788     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000789     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000790     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000791                                                                  052700      
000792*=====================================================            052800      
000793*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000794*=====================================================            053000      
000795 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000796     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000797     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000798     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000799     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000800                                                                  053600      
000801*=====================================================            053700      
000802*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000803*=====================================================            053900      
000804 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000805     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000806     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000807     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000808     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000809                                                                  054500      
000810*=====================================================            054600      
000811*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000812*=====================================================            054800      
000813 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000814     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000815     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000816     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000817     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000818                                                                  055400      
000819*=====================================================            055500      
000820*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000821*=====================================================            055700      
000822 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000823     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000824     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000825     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000826     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000827                                                                  056300      
000828*=====================================================            056400      
000829*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000830*=====================================================            056600      
000831 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000832     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000833     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000834     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000835     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000836                                                                  057200      
000837 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000838*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000839*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000840* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           006500      
000841**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000842  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000843  01 MENSAJE-LJ.                                                  100300      
000844     02 SISTEMA-LJ     PIC X(04).                                 100400      
000845     02 FILLER         PIC X VALUE "/".                           100500      
000846     02 PASO-LJ        PIC X(04).                                 100600      
000847     02 FILLER         PIC X VALUE "/".                           100700      
000848     02 MTP-LJ         PIC 9(03).                                 100800      
000849     02 FILLER         PIC X VALUE ":".                           100900      
000850     02 TIPO-LJ        PIC X.                                     101000      
000851     02 FILLER         PIC X VALUE ">".                           101100      
000852     02 CODIGO-LJ      PIC 9(06).                                 101200      
000853     02 FILLER         PIC X VALUE "<".                           101300      
000854     02 TEXTO-LJ       PIC X(250).                                101400      
000855*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000856*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000857* COPY "S151/CRONOS2K/CPY/WS".                                    006600      
000858******************************************************************000100      
000859** This copyBook defines all the additional variables that      **000200      
000860** Unisys has defined for the CRONOS2K project                  **000300      
000861** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000862******************************************************************000500      
000863                                                                  000600      
000864******************************************************************000700      
000865** These Variables are used to Accept the system date in long   **000800      
000866** format and get the century information                       **000900      
000867** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000868 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000869 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000870    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000871    05 FILLER      PIC X(1).                                      001400      
000872    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000873    05 FILLER      PIC X(1).                                      001600      
000874    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000875    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000876      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000877      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000878******************************************************************002100      
000879                                                                  002200      
000880******************************************************************002300      
000881** This variable defines a date in the format MMDDCCAA          **002400      
000882**                                                              **002500      
000883 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000884 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000885    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000886    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000887    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000888    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000889      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000890      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000891******************************************************************003400      
000892                                                                  003500      
000893******************************************************************003600      
000894** This variable defines a date in the format CCAAMMDD          **003700      
000895**                                                              **003800      
000896 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000897 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000898    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000899    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000900      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000901      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000902    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000903    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000904******************************************************************004700      
000905                                                                  004800      
000906******************************************************************004900      
000907** This variable defines a date in the format DDMMCCAA          **005000      
000908**                                                              **005100      
000909 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000910 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000911    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000912    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000913    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000914    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000915      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000916      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000917******************************************************************006000      
000918                                                                  006100      
000919******************************************************************006200      
000920** This variable defines a date in the Julian Format CCAADDD    **006300      
000921**                                                              **006400      
000922 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000923 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000924    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000925    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000926                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000927      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000928      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000929    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000930******************************************************************007300      
000931                                                                  007400      
000932******************************************************************007500      
000933** This variable defines a date in the format AAMMDD            **007600      
000934**                                                              **007700      
000935 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000936 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000937    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000938    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000939    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000940******************************************************************008300      
000941                                                                  008400      
000942******************************************************************008500      
000943** This variable defines a date in the format MMDDAA            **008600      
000944**                                                              **008700      
000945 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000946 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000947    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000948    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000949    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000950******************************************************************009300      
000951                                                                  009400      
000952******************************************************************009500      
000953** This variable defines a date in the format DDMMAA            **009600      
000954**                                                              **009700      
000955 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000956 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000957    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000958    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000959    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000960******************************************************************010300      
000961                                                                  010400      
000962******************************************************************010500      
000963** These variables are defined to be used for CALL bridge logic **010600      
000964**                                                              **010700      
000965 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000966 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000967 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000968 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000969 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000970 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000971******************************************************************011400      
000972                                                                  011500      
000973******************************************************************011600      
000974** This variable is used for converting only a year field AA to **011700      
000975** CCAA and a CCAA to AA                                        **011800      
000976 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000977 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000978    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000979    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000980 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000981 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000982******************************************************************012300      
000983                                                                  012400      
000984******************************************************************012500      
000985** These variables are Bridge Variables for Intercambio files   **012600      
000986** para EDOCTA                                                  **012700      
000987 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000988 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000989 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000990 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000991 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000992 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000993 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000994******************************************************************013500      
000995* Para MODULO                                                     013600      
000996 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000997******************************************************************013800      
000998******************************************************************013900      
000999** Para FMOVSCHABO                                                014000      
001000 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
001001******************************************************************014200      
001002                                                                  014300      
001003******************************************************************014400      
001004***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
001005******************************************************************014600      
001006                                                                  014700      
001007 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
001008 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
001009     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
001010     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
001011     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
001012******************************************************************015300      
001013                                                                  015400      
001014******************************************************************015500      
001015***  These Variables Are Defined For Date In AAMM Format       ***015600      
001016******************************************************************015700      
001017                                                                  015800      
001018 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
001019 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
001020     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
001021     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
001022******************************************************************016300      
001023                                                                  016400      
001024                                                                  016500      
001025*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001026 01  A2K-BASE-YEAR                        PIC 9(02) VALUE 50.     006700      
001027***************************************************************   006800      
001028*          LIBRERIA CTLVERS       ( S006)                     *   006900      
001029***************************************************************   007000      
001030 01  WKS-CTLVERS-LIBRERIA            PIC X(12).                   007100      
001031 01  WKS-CTLVERS-TITULO              PIC X(72).                   007200      
001032 01  WKS-CTLVERS-STATUS              PIC S9(11) BINARY.           007300      
001033                                                                  007400      
001034 01  WKS-CTLVERS-NUMREG              PIC 9(02).                   007500      
001035 01  WKS-CTLVERS-LIBID               PIC X(12).                   007600      
001036 01  WKS-CTLVERS-LIBID-R REDEFINES WKS-CTLVERS-LIBID.             007700      
001037     03 WKS-LIBID-NOMB               PIC X(09).                   007800      
001038     03 WKS-LIBID-SIST               PIC X(03).                   007900      
001039***************************************************************   008000      
001040*          LIBRERIA SOPORTECOMS                               *   008100      
001041***************************************************************   008200      
001042 01  WKS-DATOSHOST.                                               008300      
001043     02 WKS-DH-NUMCSI                PIC 9(02).                   008400      
001044     02 WKS-DH-NOMEQUIPO             PIC X(10).                   008500      
001045     02 WKS-DH-NOMCSI                PIC X(26).                   008600      
001046     02 WKS-DH-LINEABATCH            PIC X(05).                   008700      
001047                                                                  008800      
001048******************************************************************008900      
001049*            NOMBRE DE LOS ARCHIVOS                              *009000      
001050******************************************************************009100      
001051  01 WKS-TIT-AHR.                                                 009200      
001052     03 FILLER            PIC X(21) VALUE "(S151)S151/FILE/INTS/".009300      
001053     03 FILLER            PIC X(13) VALUE "15118S01/E01/".        009350      
001054     03 FILLER            PIC X(16) VALUE "S500AHRCD/10/01/".     009400      
001055     03 WKS-AHR-FECHA     PIC 9(06).                              009500      
001056     03 FILLER            PIC X(10) VALUE " ON CMEMP.".           009600      
001057                                                                  009700      
001058  01 WKS-TIT-ACC.                                                 009800      
001059     03 FILLER            PIC X(20) VALUE "(S151)S151/FILE/E01/". 009900      
001060     03 FILLER            PIC X(16) VALUE "S500ACCCD/10/01/".     010000      
001061     03 WKS-ACC-FECHA     PIC 9(06).                              010100      
001062     03 FILLER            PIC X(10) VALUE " ON CMEMP.".           010200      
001063                                                                  010300      
001064******************************************************************010400      
001065*                     NOMBRE DE LOS LISTADOS                     *010500      
001066******************************************************************010600      
001067                                                                  010700      
001068 01 WKS-TIT-LISTOTXCVE.                                           010800      
001069    02 FILLER                      PIC X(01) VALUE "S".           010900      
001070    02 WKS-SIS-TOTXCVE             PIC 9(03).                     011000      
001071    02 FILLER                      PIC X(11) VALUE "/LIST/P171/". 011100      
001072    02 WKS-CSI-TOTXCVE             PIC 9(02) VALUE 0.             011200      
001073    02 FILLER                      PIC X(03) VALUE "00/".         011300      
001074    02 WKS-REP-TOTXCVE             PIC X(01) VALUE SPACES.        011400      
001075    02 FILLER                      PIC X(04) VALUE "000/".        011500      
001076    02 WKS-FECHA-TOTXCVE           PIC 9(06).                     011600      
001077    02 FILLER                      PIC X(01) VALUE "/".           011700      
001078    02 WKS-MIX-TOTXCVE             PIC 9(07).                     011800      
001079    02 FILLER                      PIC X(01) VALUE "/".           011900      
001080    02 WKS-NOMB-REPORTE.                                          012000      
001081       04 WKS-NUM-BACK             PIC 9(03) VALUE 0.             012100      
001082       04 FILLER                   PIC X(04) VALUE "S151".        012200      
001083       04 WKS-NOMBRE-BACK          PIC X(10).                     012300      
001084    02 FILLER                      PIC X(01) VALUE ".".           012400      
001085                                                                  012500      
001086******************************************************************012600      
001087*                     CONTADOR DE HOJAS                          *012700      
001088******************************************************************012800      
001089 01 CONTADOR.                                                     012900      
001090    02 WKS-NUM-HOJAS                   PIC 9(6) COMP VALUE 0.     013000      
001091******************************************************************013100      
001092*            VARIABLES PARA EL CONTROL DE CORTES                 *013200      
001093******************************************************************013300      
001094                                                                  013400      
001095 01 WKS-VARS-TEMPORALES.                                          013500      
001096    03 WKS-CUENTA-ANT                 PIC 9(11).                  013600      
001097    03 WKS-CUENTA-T                   PIC 9(11).                  013700      
001098    03 WKS-SALDO-T                    PIC 9(14)V99.               013800      
001099    03 WKS-SSDO-T                     PIC X(01).                  013900      
001100 01 WKS-TOTREG-ARCH-CTAS              PIC 9(08).                  014000      
001101 01 WKS-PARAMETRO                 PIC 9(11).                      015800      
001102 01 WKS-PARAMETRO-R REDEFINES  WKS-PARAMETRO.                     015900      
001103    03 WKS-SISTEMA-PARAM          PIC 9(03).                      016000      
001104    03 WKS-FECHA-PRO              PIC 9(08).                      016100      
001105******************************************************************016200      
001106*                  CAMPOS DE FECHAS Y HORAS                      *016300      
001107******************************************************************016400      
001108                                                                  016500      
001109 01  WKS-FECHA-COMP                PIC 9(08).                     016600      
001110 01  WKS-FECHA-COMP-R              REDEFINES WKS-FECHA-COMP.      016700      
001111     02  WKS-FECHA-COMP-AA         PIC 9(04).                     016800      
001112     02  WKS-FECHA-COMP-MM         PIC 9(02).                     016900      
001113     02  WKS-FECHA-COMP-DD         PIC 9(02).                     017000      
001114                                                                  017100      
001115 01  WKS-HORA-COMP-HHMMSS          PIC 9(06).                     017200      
001116 01  WKS-HORA-COMP-HHMMSS-R REDEFINES WKS-HORA-COMP-HHMMSS.       017300      
001117     02  WKS-HORA-COMP-HH          PIC 9(02).                     017400      
001118     02  WKS-HORA-COMP-MM          PIC 9(02).                     017500      
001119     02  WKS-HORA-COMP-SS          PIC 9(02).                     017600      
001120                                                                  017700      
001121 01  WKS-HORA-COMPILACION.                                        017800      
001122     02  WKS-HORA-COMP             PIC 9(13).                     017900      
001123     02  FILLER                    PIC X(187).                    018000      
001124 01  WKS-FECHA-COMPILACION         PIC 9(08).                     018100      
001125                                                                  018200      
001126 01 WKS-FECHA-MAQ                  PIC 9(08).                     018300      
001127 01 WKS-FECHA-MAQ-R REDEFINES WKS-FECHA-MAQ.                      018400      
001128     03 WKS-FM-AMO                 PIC 9(4).                      018500      
001129     03 WKS-FM-MES                 PIC 9(2).                      018600      
001130     03 WKS-FM-DIA                 PIC 9(2).                      018700      
001131                                                                  018800      
001132 01 WKS-FECHA-PROCESO              PIC 9(08).                     018900      
001133 01 WKS-FECHA-PROCESO-R REDEFINES WKS-FECHA-PROCESO.              019000      
001134    03  WKS-FP-AMO                 PIC 9(4).                      019100      
001135    03  WKS-FP-MES                 PIC 9(2).                      019200      
001136    03  WKS-FP-DIA                 PIC 9(2).                      019300      
001137 01 WKS-FEC-PROCA6D REDEFINES WKS-FECHA-PROCESO.                  019400      
001138    03  WKS-FPRO-AA1               PIC 9(02).                     019500      
001139    03  WKS-FPROCESO-A6            PIC 9(06).                     019600      
001140                                                                  019700      
001141 01 WKS-FECHA-TEMP                 PIC 9(08).                     019800      
001142 01 WKS-FECHA-TEMP-R REDEFINES WKS-FECHA-TEMP.                    019900      
001143     03  WKS-MES-TEMP              PIC 9(2).                      020000      
001144     03  WKS-DIA-TEMP              PIC 9(2).                      020100      
001145     03  WKS-AMO-TEMP              PIC 9(4).                      020200      
001146                                                                  020300      
001147 01 WKS-HORA-MAQ                   PIC 9(08).                     020400      
001148 01 WKS-HORA-MAQ-R REDEFINES WKS-HORA-MAQ.                        020500      
001149    03  WKS-HORA-HHMMSS            PIC 9(06).                     020600      
001150    03  FILLER                     PIC 9(02).                     020700      
001151 01 WKS-HORAM-MAQ-R REDEFINES WKS-HORA-MAQ.                       020800      
001152    03  WKS-HORA-HHMM              PIC 9(02).                     020900      
001153    03  WKS-MINU-HHMM              PIC 9(02).                     021000      
001154    03  FILLER                     PIC 9(04).                     021100      
001155******************************************************************021200      
001156*                       HORA DE PROCESO                          *021300      
001157******************************************************************021400      
001158 01  WKS-HORA-PROCESO              PIC 9(08).                     021500      
001159                                                                  021600      
001160 01  WKS-HORA-R REDEFINES WKS-HORA-PROCESO.                       021700      
001161     03  WKS-HORA-HMS.                                            021800      
001162         05 WKS-HORA-HH            PIC 9(02).                     021802      
001163         05 WKS-HORA-MM            PIC 9(02).                     021804      
001164         05 WKS-HORA-SS            PIC 9(02).                     021806      
001165     03  FILLER                    PIC X(02).                     021900      
001166******************************************************************022000      
001167*                ENCABEZADO COMUN PARA REPORTES.                 *022100      
001168******************************************************************022200      
001169 01  WLI-TIT1-ENCAB.                                              022300      
001170     03 FILLER                     PIC X(10) VALUE "S151-P171-".  022400      
001171     03 WLI-ENC-SUPDER             PIC X(13).                     022500      
001172     03 FILLER                     PIC X(20) VALUE SPACES.        022600      
001173     03 FILLER                     PIC X(42) VALUE                022700      
001174                   "       ADMINISTRACION DE MOVIMIENTOS      ".  022800      
001175     03 FILLER                     PIC X(11) VALUE SPACES.        022900      
001176     03 FILLER                     PIC X(26) VALUE                023000      
001177                                   "FECHA DE LA INFORMACION : ".  023100      
001178     03 WLI-RP-E1-FECHA-INF        PIC 9999/99/99.                023200      
001179******************************************************************023300      
001180*  ENCABEZADO DEL REPORTE DE TOTALES POR CLAVES DE TRANSACCION.  *023400      
001181******************************************************************023500      
001182 01  WLI-TIT2-ENCAB.                                              023600      
001183     03 FILLER                     PIC X(11) VALUE                023700      
001184                                   "F.PROCESO: ".                 023800      
001185     03 WLI-RP-E2-FECHA-PROC       PIC 9999/99/99.                023900      
001186     03 FILLER                     PIC X      VALUE SPACE.        024000      
001187     03 WLI-RP-E2-HORA-HH          PIC 9(02).                     024002      
001188     03 FILLER                     PIC X(01) VALUE ":".           024004      
001189     03 WLI-RP-E2-HORA-MM          PIC 9(02).                     024006      
001190     03 FILLER                     PIC X(01) VALUE ":".           024008      
001191     03 WLI-RP-E2-HORA-DD          PIC 9(02).                     024010      
001192     03 FILLER                     PIC X(22) VALUE SPACES.        024200      
001193     03 FILLER                     PIC X(27) VALUE                024300      
001194                                   "   AUDITOR DE SALDOS CITD  ". 024400      
001195     03 FILLER                     PIC X(29) VALUE SPACES.        024500      
001196     03 FILLER                     PIC X(24) VALUE                024600      
001197                                   "TIPO DE PROCESO : DIARIO".    024700      
001198******************************************************************024800      
001199*                ENCABEZADO COMUN PARA REPORTES.                 *024900      
001200******************************************************************025000      
001201 01  WLI-TIT3-ENCAB.                                              025100      
001202     03 FILLER                     PIC X(11) VALUE                025200      
001203                                   "VERSION  : ".                 025300      
001204     03 WSR-RP-E3-VERSION          PIC 9999/99/99.                025400      
001205     03 FILLER                     PIC X(31) VALUE SPACES.        025500      
001206     03 FILLER                     PIC X(13) VALUE                025600      
001207                                   "DEL SISTEMA S".               025700      
001208     03 WSR-RP-E3-SISTEMA          PIC 9(03).                     025800      
001209     03 FILLER                     PIC X(10) VALUE                025900      
001210                                   "  VS  S151".                  026000      
001211     03 FILLER                     PIC X(41) VALUE SPACES.        026100      
001212     03 FILLER                     PIC X(07) VALUE "HOJA : ".     026200      
001213     03 WSR-RP-E3-HOJA             PIC ZZZZZ9.                    026300      
001214******************************************************************026400      
001215*    TITULOS DEL REPORTE DE AUDITOR SALDOS CITD                  *026500      
001216******************************************************************026600      
001217 01  WLI-TIT1-SDOS.                                               026700      
001218     03 FILLER            PIC X(06) VALUE "CTA. F".               026800      
001219     03 FILLER            PIC X(08) VALUE "TO. INT.".             026900      
001220     03 FILLER            PIC X(04) VALUE " CTA".                 027000      
001221     03 FILLER            PIC X(11) VALUE ". BANAMEX".            027100      
001222     03 FILLER            PIC X(04) VALUE SPACES.                 027200      
001223     03 FILLER            PIC X(20) VALUE "     SALDO   AHR    ". 027300      
001224     03 FILLER            PIC X(07) VALUE SPACES.                 027400      
001225     03 FILLER            PIC X(20) VALUE "    SALDO   ACC     ". 027500      
001226     03 FILLER            PIC X(07) VALUE SPACES.                 027520      
001227     03 FILLER            PIC X(20) VALUE "    DIFERENCIA      ". 027540      
001228                                                                  027600      
001229 01  WLI-TIT2-SDOS.                                               027700      
001230     03 FILLER            PIC X(40) VALUE SPACES.                 027800      
001231     03 FILLER            PIC X(08) VALUE "SALDO   ".             027900      
001232     03 FILLER            PIC X(10) VALUE SPACES.                 028000      
001233     03 FILLER            PIC X(20) VALUE "      IMPORTE       ". 028100      
001234     03 FILLER            PIC X(04) VALUE SPACES.                 028200      
001235     03 FILLER            PIC X(07) VALUE "  CLAVE".              028300      
001236     03 FILLER            PIC X(08) VALUE SPACES.                 028400      
001237     03 FILLER            PIC X(13) VALUE "  REF. NUM.  ".        028500      
001238     03 FILLER            PIC X(15) VALUE "   REF. CLIENTE".      028600      
001239                                                                  028700      
001240 01 WLI-REP-COMPSDO.                                              028800      
001241    03 WLI-CTA-FTOINT              PIC ZZZZZZZZZZ9.               029000      
001242    03 FILLER                      PIC X(04) VALUE SPACES.        029100      
001243    03 WLI-CTA-FTOBANAMEX          PIC ZZZZZZZZZZ9.               029200      
001244    03 FILLER                      PIC X(02) VALUE SPACES.        029300      
001245    03 WLI-SDO-AHR                 PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.      029400      
001246    03 FILLER                      PIC X(02) VALUE SPACES.        029500      
001247    03 WLI-SSDO-AHR                PIC X(01) VALUE SPACES.        029600      
001248    03 FILLER                      PIC X(04) VALUE " <> ".        029700      
001249    03 WLI-SDO-ACC                 PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.      029800      
001250    03 FILLER                      PIC X(02) VALUE SPACES.        029900      
001251    03 WLI-SSDO-ACC                PIC X(01) VALUE SPACES.        030000      
001252    03 FILLER                      PIC X(04) VALUE SPACES.        030020      
001253    03 WLI-DIFERENCIA              PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99.      030040      
001254                                                                  030100      
001255 01 WLI-REP-DETSDO.                                               030200      
001256    03 FILLER                      PIC X(30) VALUE SPACES.        030300      
001257    03 WLI-IMP-SDO                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99.        030600      
001258    03 FILLER                      PIC X(02) VALUE SPACES.        030700      
001259    03 WLI-SSDO                    PIC X(01) VALUE SPACES.        030800      
001260    03 FILLER                      PIC X(06) VALUE SPACES.        030900      
001261    03 WLI-IMP-CVE                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99.        031000      
001262    03 FILLER                      PIC X(02) VALUE SPACES.        031100      
001263    03 WLI-SCVE                    PIC X(01) VALUE SPACES.        031200      
001264    03 FILLER                      PIC X(08) VALUE SPACES.        031300      
001265    03 WLI-CVE                     PIC ZZ9.                       031320      
001266    03 FILLER                      PIC X(10) VALUE SPACES.        031340      
001267    03 WLI-REFNUM                  PIC ZZZZZZZZZ9.                031400      
001268    03 FILLER                      PIC X(04) VALUE SPACES.        031500      
001269    03 WLI-RECTE                   PIC X(16).                     031600      
001270                                                                  031700      
001271******************************************************************031800      
001272*            VARIABLES MISCELANEAS                               *031900      
001273******************************************************************032000      
001274 77 W77-EOF                               PIC 9.                  032100      
001275 77 W77-EOF2                              PIC 9.                  032200      
001276 77 W77-EOF3                              PIC 9.                  032300      
001277 77 W77-EOF4                              PIC 9.                  032400      
001278 77 W77-EOF5                              PIC 9.                  032500      
001279 77 W77-ACC                               PIC 9.                  032600      
001280 77 W77-CSI-PROCESO                       PIC 9(02).              032700      
001281 77 W77-RESULT                            PIC S9(11) BINARY.      032800      
001282 77 W77-IND                               PIC 9(04).              032900      
001283 77 W77-IND2                              PIC 9(02).              032950      
001284 77 W77-NUM-LINEAS                        PIC 9(02) VALUE 0.      033000      
001285 01 WKS-VAR-DISPLAY.                                              033100      
001286    03 WKS-SIS-DISP                       PIC 9(04).              033200      
001287    03 WKS-FEC-DISP                       PIC 9(08).              033300      
001288 01 WKS-TOT-ARCHIVOS.                                             033400      
001289    03 WKS-NUM-ARCHSNNN                   PIC 9(08)    COMP.      033500      
001290    03 WKS-IMP-ARCHSNNN                   PIC 9(16)V99 COMP.      033600      
001291    03 WKS-NUM-ARCHS151                   PIC 9(08)    COMP.      033700      
001292    03 WKS-IMP-ARCHS151                   PIC 9(16)V99 COMP.      033800      
001293                                                                  033802      
001294 01 WKS-AHRST-ACCT-NBR.                                           033804      
001295    03 FILLER                             PIC X(12).              033806      
001296    03 WKS-AHR-ACCT-NBR                   PIC 9(11).              033808      
001297                                                                  033810      
001298 77 W77-ENCONTRE                          PIC 9.                  033812      
001299    88 W88-ENCONTRE               VALUE 1.                        033814      
001300                                                                  033996      
001301 77 W77-CTA-1A                            PIC 9.                  033998      
001302    88 W88-CTA-1A                 VALUE 1.                        034000      
001303******************************************************************034004      
001304*       VARIABLE PARA CONVERSION DE FORMATO (CUENTA)             *034006      
001305******************************************************************034100      
001306  01 WKS-NUM-CUENTA-T2                 PIC 9(11).                 034200      
001307  01 WKS-NUM-CUENTA-T22.                                          034300      
001308     03 WKS-1DIG-CTA                   PIC 9(01).                 034400      
001309     03 WKS-DIG-MUEVE                  PIC 9(01).                 034500      
001310     03 WKS-6DIG-CTA                   PIC 9(06).                 034600      
001311     03 WKS-3DIG-CTA                   PIC 9(03).                 034700      
001312                                                                  034800      
001313                                                                  034820      
001314 01 WKS-CTA-FTOINT                    PIC 9(11).                  034840      
001315 01 WKS-CTA-FTOINT-R REDEFINES WKS-CTA-FTOINT.                    034900      
001316    03 WKS-1DIG-CTAFTOI               PIC 9(01).                  035000      
001317    03 WKS-6DIG-CTAFTOI               PIC 9(06).                  035100      
001318    03 WKS-7DIG-CTAFTOI               PIC 9(01).                  035200      
001319    03 WKS-3DIG-CTAFTOI               PIC 9(03).                  035300      
001320                                                                  035400      
001321****************************************************************  035410      
001322******     NOMBRE DE ARCHIVO BANDERA PARA EL PROCESO    ********  035420      
001323******        SYSTEM/FORZA P171/AUDITORCITD             ********  035430      
001324****************************************************************  035440      
001325                                                                  035450      
001326  01 WKS-TIT-AR-BAN.                                              035460      
001327     03 FILLER            PIC X(20) VALUE "(S151)S151/FILE/E01/". 035470      
001328     03 FILLER            PIC X(16) VALUE "S500/BANDERACTD/".     035480      
001329     03 WKS-ARB-FECHA     PIC 9(06).                              035490      
001330     03 FILLER            PIC X(10) VALUE " ON CMEMP.".           035500      
001331                                                                  035510      
001332/**************************************************************** 035800      
001333*             P R O C E D U R E     D I V I S I O N             * 035900      
001334***************************************************************** 036000      
001335 PROCEDURE DIVISION USING WKS-PARAMETRO.                          036100      
001336 000000-PROGRAMA.                                                 036200      
001337*================                                                 036300      
001338                                                                  036400      
001339     CHANGE ATTRIBUTE TITLE OF "LIB-DISP"    TO                   036500      
001340        "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".          036600      
001341                                                                  036700      
001342     MOVE "S151" TO SISTEMA-LJ                                    036800      
001343     MOVE "P171" TO PASO-LJ                                       036900      
001344     MOVE "002"  TO MTP-LJ                                        037000      
001345     PERFORM 10000-INICIO-PROGRAMA.                               037100      
001346     PERFORM 11000-GENERA-ACC2.                                   037200      
001347     PERFORM 20000-LEE-AHR.                                       037300      
001348     PERFORM 30000-DETALLE-MOVS.                                  037400      
001349     STOP RUN.                                                    037500      
001350                                                                  037600      
001351 10000-INICIO-PROGRAMA.                                           037700      
001352*======================                                           037800      
001353                                                                  037900      
001354     CHANGE ATTRIBUTE LIBACCESS    OF "CTRLVERS" TO BYFUNCTION.   038000      
001355     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTRLVERS" TO "CTLVERS".    038100      
001356                                                                  038200      
001357     MOVE WKS-SISTEMA-PARAM TO   WSR-RP-E3-SISTEMA                038300      
001358                                 WKS-SIS-TOTXCVE.                 038400      
001359     MOVE WKS-FECHA-PRO     TO   WKS-FECHA-PROCESO.               038500      
001360     MOVE WKS-FECHA-PROCESO TO   WKS-AHR-FECHA, WKS-ACC-FECHA,    038600      
001361                                 WKS-ARB-FECHA.                   038650      
001362     ACCEPT   WKS-HORA-MAQ   FROM TIME                            038700      
001363                                                                  038800      
001364******************************************************************038900      
001365*                  FECHA  Y  HORA DE COMPILACION                 *039000      
001366******************************************************************039100      
001367                                                                  039200      
001368     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP"                    039300      
001369                                   TO BYFUNCTION.                 039400      
001370     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP"                    039500      
001371                                   TO "LOCSUP"                    039600      
001372                                                                  039700      
001373     MOVE ATTRIBUTE NAME OF MYSELF TO WKS-HORA-COMPILACION        039800      
001374                                                                  039900      
001375     CALL "CONVERT-DATE IN LOCSUP"                                040000      
001376          USING WKS-HORA-COMPILACION    A2K-FEC-DMA-001           040100      
001377        PERFORM A2K-CONV-DMA-TO-DMCA THRU                         040200      
001378                A2K-CONV-DMA-TO-DMCA-EXIT                         040300      
001379        MOVE A2K-FEC-DMCA-001 TO WKS-FECHA-COMPILACION            040400      
001380                                                                  040500      
001381     MOVE WKS-FECHA-COMPILACION    TO WKS-FECHA-TEMP              040600      
001382     MOVE WKS-DIA-TEMP             TO WKS-FECHA-COMP-DD           040700      
001383     MOVE WKS-MES-TEMP             TO WKS-FECHA-COMP-MM           040800      
001384     MOVE WKS-AMO-TEMP             TO WKS-FECHA-COMP-AA           040900      
001385                                                                  041000      
001386     COMPUTE WKS-HORA-COMP = WKS-HORA-COMP / 60                   041100      
001387     COMPUTE WKS-HORA-COMP-HH    =                                041200      
001388             FUNCTION DIV (WKS-HORA-COMP, 3600 )                  041300      
001389     COMPUTE W77-IND          =                                   041400      
001390             FUNCTION DIV (WKS-HORA-COMP, 60 )                    041500      
001391     COMPUTE WKS-HORA-COMP-MM    =                                041600      
001392             FUNCTION MOD (W77-IND   , 60 )                       041700      
001393     COMPUTE WKS-HORA-COMP-SS    =                                041800      
001394             FUNCTION MOD (WKS-HORA-COMP, 60 )                    041900      
001395                                                                  042000      
001396     PERFORM A2K-ACCEPT-TODAYS-DATE THRU                          042100      
001397             A2K-ACCEPT-TODAYS-DATE-EXIT.                         042200      
001398            MOVE A2K-FEC-MDCA-001 TO WKS-FECHA-TEMP.              042300      
001399                                                                  042400      
001400     MOVE WKS-AMO-TEMP      TO    WKS-FM-AMO                      042500      
001401     MOVE WKS-MES-TEMP      TO    WKS-FM-MES                      042600      
001402     MOVE WKS-DIA-TEMP      TO    WKS-FM-DIA                      042700      
001403     MOVE WKS-FPROCESO-A6          TO WKS-FECHA-TOTXCVE.          042800      
001404                                                                  042900      
001405     MOVE WKS-FECHA-MAQ            TO WLI-RP-E2-FECHA-PROC.       043000      
001406                                                                  043100      
001407     MOVE WKS-FECHA-PROCESO        TO WLI-RP-E1-FECHA-INF.        043200      
001408     MOVE ATTRIBUTE STACKNO OF MYSELF     TO WKS-MIX-TOTXCVE.     043400      
001409                                                                  043500      
001410     MOVE 10                       TO WKS-CSI-TOTXCVE.            043600      
001411                                                                  043700      
001412     ACCEPT WKS-HORA-PROCESO       FROM TIME.                     043800      
001413                                                                  043900      
001414     MOVE WKS-HORA-HH              TO WLI-RP-E2-HORA-HH.          044010      
001415     MOVE WKS-HORA-MM              TO WLI-RP-E2-HORA-MM.          044020      
001416     MOVE WKS-HORA-SS              TO WLI-RP-E2-HORA-DD.          044030      
001417                                                                  044100      
001418     MOVE WKS-FECHA-COMP           TO WSR-RP-E3-VERSION.          044200      
001419                                                                  044300      
001420                                                                  044400      
001421     STRING "INICIO PROCESO CON FECHA ",                          044500      
001422            WKS-FECHA-PROCESO                                     044600      
001423            DELIMITED BY SIZE                                     044700      
001424            INTO TEXTO-LJ                                         044800      
001425     CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ.         044900      
001426                                                                  044905      
001427                                                                  045000      
001428 11000-GENERA-ACC2.                                               045100      
001429*==================                                               045200      
001430    CHANGE ATTRIBUTE PACKNAME   OF ARCH-ACC TO  "CMEMP".          045300      
001431    CHANGE ATTRIBUTE NORECOVERY OF ARCH-ACC2 TO 1.                045400      
001432    CHANGE ATTRIBUTE FILEORGANIZATION OF ARCH-ACC2 TO             045500      
001433           VALUE(KEYEDIOII).                                      045600      
001434    CHANGE ATTRIBUTE PACKNAME   OF ARCH-CTAS TO  "CMEMP".         045610      
001435    OPEN OUTPUT ARCH-CTAS.                                        045620      
001436    CLOSE ARCH-CTAS WITH SAVE.                                    045630      
001437    OPEN I-O ARCH-CTAS.                                           045640      
001438    MOVE ZERO                     TO WKS-TOTREG-ARCH-CTAS.        045650      
001439    OPEN OUTPUT ARCH-ACC2.                                        045700      
001440    CLOSE ARCH-ACC2 WITH SAVE.                                    045800      
001441    OPEN I-O ARCH-ACC2.                                           045900      
001442    OPEN INPUT ARCH-ACC.                                          046000      
001443    MOVE 0 TO W77-EOF                                             046100      
001444    PERFORM 11100-LEE-ARCH-ACC UNTIL W77-EOF = 1.                 046200      
001445    CLOSE ARCH-ACC2 WITH SAVE.                                    046300      
001446    CLOSE ARCH-ACC  WITH SAVE.                                    046400      
001447                                                                  046500      
001448 11100-LEE-ARCH-ACC.                                              046600      
001449*===================                                              046700      
001450     READ ARCH-ACC  AT END MOVE 1 TO W77-EOF.                     046800      
001451                                                                  046900      
001452     IF W77-EOF = 0                                               047000      
001453        PERFORM 11200-GRABA-ACC2 UNTIL W77-EOF = 1.               047100      
001454                                                                  047200      
001455 11200-GRABA-ACC2.                                                047300      
001456*=================                                                047400      
001457     MOVE ZEROS TO ACC-CUENTA,ACC-CTA-FTOBANAMEX,ACC-SALDO,       047500      
001458                   ACC-SSDO.                                      047600      
001459     MOVE ACCI-ACCT-NBR2          TO      ACC-CUENTA              047700      
001460     MOVE ACCI-ACCT-BAL-AMT       TO      ACC-SALDO               047800      
001461     MOVE ACCI-ACCT-BAL-AMT-SIGN  TO      ACC-SSDO                047900      
001462                                                                  048000      
001463     WRITE REG-ARCH-ACC2                                          048100      
001464           INVALID KEY                                            048200      
001465                MOVE "E"        TO      TIPO-LJ                   048300      
001466                MOVE 020202     TO      CODIGO-LJ                 048400      
001467                MOVE "ERROR AL GRABAR ARCH-ACC2"  TO TEXTO-LJ     048500      
001468                CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,          048600      
001469                                            MENSAJE-LJ.           048700      
001470                                                                  048900      
001471     READ ARCH-ACC  AT END MOVE 1 TO W77-EOF.                     049000      
001472                                                                  049100      
001473     MOVE ACCI-INT-REC TO ACCI-TR-REC                             049200      
001474     IF ACCI-ENDOFFILE = "END OF FILE"                            049300      
001475        MOVE 1 TO W77-EOF.                                        049400      
001476                                                                  049500      
001477 20000-LEE-AHR.                                                   049600      
001478*==============                                                   049700      
001479     MOVE 0 TO W77-EOF, W77-IND, W77-CTA-1A.                      049800      
001480     OPEN INPUT ARCH-AHR.                                         049900      
001481     OPEN INPUT ARCH-ACC2.                                        050000      
001482     READ ARCH-AHR AT END MOVE 1 TO W77-EOF.                      050100      
001483     IF W77-EOF = 0                                               050200      
001484        MOVE AHRST-ACCT-NBR2      TO      WKS-AHRST-ACCT-NBR      050300      
001485        MOVE WKS-AHR-ACCT-NBR     TO      WKS-CUENTA-ANT          050350      
001486        PERFORM 20100-LEE-ARCH-AHR UNTIL W77-EOF = 1.             050400      
001487     CLOSE ARCH-AHR      WITH SAVE.                               050500      
001488     CLOSE ARCH-CTAS     WITH SAVE.                               050510      
001489 20100-LEE-ARCH-AHR.                                              050700      
001490*===================                                              050800      
001491     IF WKS-AHR-ACCT-NBR = WKS-CUENTA-ANT                         050900      
001492        MOVE WKS-AHR-ACCT-NBR     TO      WKS-CUENTA-ANT          051000      
001493                                          WKS-CUENTA-T            051050      
001494        MOVE AHRST-LDGR-AMT       TO      WKS-SALDO-T             051100      
001495        MOVE AHRST-LDGR-AMT-SIGN  TO      WKS-SSDO-T              051200      
001496     ELSE                                                         051300      
001497        MOVE 0 TO W77-ACC                                         051400      
001498        PERFORM 20200-LEE-ACC2                                    051500      
001499        MOVE WKS-AHR-ACCT-NBR     TO WKS-CUENTA-ANT               051600      
001500                                     WKS-CUENTA-T                 051650      
001501        IF W77-ACC = 0                                            051700      
001502           IF WKS-SALDO-T = ACC-SALDO                             051800      
001503*             WKS-SSDO-T  = ACC-SSDO                              051900      
001504              MOVE WKS-AHR-ACCT-NBR     TO WKS-CUENTA-ANT         051960      
001505                                           WKS-CUENTA-T           051980      
001506              MOVE AHRST-LDGR-AMT       TO WKS-SALDO-T            052000      
001507              MOVE AHRST-LDGR-AMT-SIGN  TO WKS-SSDO-T             052050      
001508           ELSE                                                   052100      
001509              ADD 1 TO W77-IND                                    052200      
001510              MOVE WKS-CUENTA-T         TO WKS-CTA-AHR            052300      
001511              MOVE WKS-SALDO-T          TO WKS-SDO-AHR            052400      
001512              MOVE WKS-SSDO-T           TO WKS-SSDO-AHR           052500      
001513              MOVE ACC-SALDO            TO WKS-SDO-ACC            052600      
001514              MOVE ACC-SSDO             TO WKS-SSDO-ACC           052700      
001515              MOVE WKS-AHR-ACCT-NBR     TO WKS-CUENTA-ANT         052720      
001516                                           WKS-CUENTA-T           052730      
001517              MOVE AHRST-LDGR-AMT       TO WKS-SALDO-T            052740      
001518              MOVE AHRST-LDGR-AMT-SIGN  TO WKS-SSDO-T             052760      
001519              PERFORM 20170-GRABA-CTAS                            052770      
001520        ELSE                                                      052800      
001521           ADD 1                        TO W77-IND                052900      
001522           MOVE WKS-CUENTA-T            TO WKS-CTA-AHR            053000      
001523           MOVE WKS-SALDO-T             TO WKS-SDO-AHR            053100      
001524           MOVE WKS-SSDO-T              TO WKS-SSDO-AHR           053200      
001525           MOVE 0                       TO WKS-SDO-ACC            053300      
001526           MOVE "+"                     TO WKS-SSDO-ACC           053400      
001527           MOVE WKS-AHR-ACCT-NBR        TO WKS-CUENTA-ANT         053420      
001528                                           WKS-CUENTA-T           053430      
001529           MOVE AHRST-LDGR-AMT          TO WKS-SALDO-T            053440      
001530           MOVE AHRST-LDGR-AMT-SIGN     TO WKS-SSDO-T             053460      
001531           PERFORM 20170-GRABA-CTAS.                              053470      
001532                                                                  053500      
001533    READ ARCH-AHR AT END MOVE 1 TO W77-EOF.                       053600      
001534    MOVE AHRST-ACCT-NBR2        TO WKS-AHRST-ACCT-NBR.            053700      
001535                                                                  053850      
001536 20200-LEE-ACC2.                                                  053900      
001537*===============                                                  054000      
001538     MOVE ZERO               TO W77-ACC.                          054050      
001539     MOVE WKS-CUENTA-ANT     TO ACC-CUENTA.                       054100      
001540     READ ARCH-ACC2                                               054200      
001541          INVALID KEY MOVE 1 TO W77-ACC.                          054300      
001542                                                                  054302      
001543 20170-GRABA-CTAS.                                                054304      
001544*=================                                                054306      
001545     ADD 1                  TO WKS-TOTREG-ARCH-CTAS.              054308      
001546     WRITE REG-ARCH-CTAS INVALID KEY                              054310      
001547     PERFORM 20180-REGRABA-CTAS.                                  054312      
001548                                                                  054314      
001549  20180-REGRABA-CTAS.                                             054316      
001550*===================                                              054318      
001551     COMPUTE WKS-TOTREG-ARCH-CTAS = WKS-TOTREG-ARCH-CTAS - 1.     054320      
001552     REWRITE REG-ARCH-CTAS INVALID KEY                            054322      
001553             NEXT SENTENCE.                                       054324      
001554                                                                  054400      
001555*=======================                                          054510      
001556 30000-DETALLE-MOVS.                                              054598      
001557*===================                                              054600      
001558     MOVE "R"                      TO WKS-REP-TOTXCVE.            054700      
001559     MOVE  1                       TO WKS-NUM-BACK                054800      
001560     MOVE "AUDSDOSCTD"             TO WKS-NOMBRE-BACK.            054900      
001561     SET V00-REP-SDOS(USERBACKUPNAME)                             055000      
001562                                   TO VALUE TRUE                  055100      
001563     CHANGE ATTRIBUTE TITLE OF V00-REP-SDOS TO                    055200      
001564                                   WKS-TIT-LISTOTXCVE.            055300      
001565     MOVE "001AUDSDOSCTD"          TO WLI-ENC-SUPDER              055400      
001566     MOVE 56                       TO W77-NUM-LINEAS              055500      
001567     OPEN OUTPUT V00-REP-SDOS.                                    055600      
001568                                                                  055700      
001569     OPEN INPUT ARCH-CTAS2.                                       055710      
001570     OPEN INPUT ARCH-AHR.                                         055800      
001571     MOVE 0 TO W77-EOF, W77-EOF2, W77-IND.                        055900      
001572     READ ARCH-CTAS2 AT END MOVE 1 TO W77-EOF.                    056000      
001573     MOVE REG-ARCH-CTAS2 TO REG-ARCH-CTAS.                        056050      
001574     IF WKS-CTA-AHR > 0                                           056100      
001575        PERFORM 30100-LEE-ARCHIVOS UNTIL W77-EOF = 1              056200      
001576     ELSE                                                         056300      
001577        MOVE 1             TO   WKS-NUM-HOJAS                     056400      
001578        MOVE WKS-NUM-HOJAS TO   WSR-RP-E3-HOJA                    056500      
001579        WRITE V00-R00-SDOS FROM WLI-TIT1-ENCAB AFTER PAGE         056600      
001580        WRITE V00-R00-SDOS FROM WLI-TIT2-ENCAB                    056700      
001581        WRITE V00-R00-SDOS FROM WLI-TIT3-ENCAB                    056800      
001582        MOVE SPACES       TO    V00-R00-SDOS                      056900      
001583        WRITE V00-R00-SDOS                                        057000      
001584        MOVE "                              NO HUBO INFORMACION " 057100      
001585                           TO    V00-R00-SDOS                     057200      
001586        WRITE V00-R00-SDOS.                                       057300      
001587                                                                  057400      
001588     CLOSE V00-REP-SDOS WITH SAVE.                                057500      
001589     CLOSE ARCH-AHR     WITH SAVE.                                057600      
001590     OPEN  OUTPUT ARCHIVO-P171.                                   057700      
001591     MOVE  "BANDE-171" TO        REG-ARCH-171.                    057710      
001592     WRITE REG-ARCH-171.                                          057720      
001593     CLOSE ARCHIVO-P171 WITH SAVE.                                057730      
001594     CLOSE ARCH-CTAS2   WITH PURGE.                               057750      
001595 30100-LEE-ARCHIVOS.                                              057800      
001596*===================                                              057900      
001597     ADD 1 TO W77-IND.                                            058000      
001598     MOVE 0 TO W77-EOF2, W77-EOF3.                                058100      
001599     IF WKS-CTA-AHR > 0                                           058200      
001600        MOVE REG-ARCH-CTAS2         TO REG-ARCH-CTAS              058210      
001601        PERFORM 30250-LEE-ARH                                     058260      
001602        PERFORM 30200-ENCONTRE    UNTIL  W77-EOF2 > 0             058300      
001603        IF W77-EOF2 = 1                                           058350      
001604           PERFORM 30400-LEE-DET2 UNTIL  W77-EOF3 = 1.            058400      
001605     READ ARCH-CTAS2 AT END MOVE 1  TO   W77-EOF.                 058600      
001606                                                                  058800      
001607 30200-ENCONTRE.                                                  058900      
001608*===============                                                  059000      
001609     IF WKS-AHR-ACCT-NBR = WKS-CTA-AHR                            059100      
001610        MOVE 1                      TO W77-EOF2                   059200      
001611        PERFORM 30300-GRABA-DET1                                  059250      
001612     ELSE                                                         059300      
001613        PERFORM 30250-LEE-ARH                                     059400      
001614        IF W77-EOF2 = 0                                           059450      
001615           MOVE AHRST-ACCT-NBR2     TO    WKS-AHRST-ACCT-NBR      059500      
001616           IF WKS-AHR-ACCT-NBR NOT = WKS-CTA-AHR                  059520      
001617              MOVE 2                      TO W77-EOF2.            059540      
001618                                                                  059550      
001619 30250-LEE-ARH.                                                   059560      
001620*==============                                                   059570      
001621    READ ARCH-AHR AT END MOVE 3 TO   W77-EOF2.                    059580      
001622                                                                  059590      
001623 30300-GRABA-DET1.                                                059600      
001624*=================                                                059700      
001625                                                                  059800      
001626    IF W77-NUM-LINEAS > 47                                        059900      
001627       PERFORM 36300-IMP-ENCABEZADO.                              060000      
001628                                                                  060100      
001629    MOVE WKS-CTA-AHR              TO      WLI-CTA-FTOINT,         060200      
001630                                          WKS-CTA-FTOINT.         060210      
001631    MOVE WKS-1DIG-CTAFTOI         TO      WKS-1DIG-CTA            060220      
001632    MOVE WKS-6DIG-CTAFTOI         TO      WKS-6DIG-CTA            060230      
001633    MOVE WKS-7DIG-CTAFTOI         TO      WKS-DIG-MUEVE           060240      
001634    MOVE WKS-3DIG-CTAFTOI         TO      WKS-3DIG-CTA            060250      
001635    MOVE WKS-NUM-CUENTA-T22       TO      WKS-NUM-CUENTA-T2       060260      
001636    MOVE WKS-NUM-CUENTA-T2        TO      WLI-CTA-FTOBANAMEX      060270      
001637    MOVE WKS-SDO-AHR              TO      WLI-SDO-AHR             060300      
001638    MOVE WKS-SSDO-AHR             TO      WLI-SSDO-AHR            060400      
001639    MOVE WKS-SDO-ACC              TO      WLI-SDO-ACC             060500      
001640    MOVE WKS-SSDO-ACC             TO      WLI-SSDO-ACC            060600      
001641    IF WKS-SSDO-AHR          = WKS-SSDO-ACC                       060605      
001642       IF WKS-SDO-AHR          > WKS-SDO-ACC                      060610      
001643          COMPUTE WKS-SALDO-T = WKS-SDO-AHR          -            060615      
001644                                WKS-SDO-ACC                       060620      
001645          MOVE WKS-SALDO-T        TO      WLI-DIFERENCIA          060625      
001646       ELSE                                                       060630      
001647          COMPUTE WKS-SALDO-T = WKS-SDO-ACC          -            060635      
001648                                WKS-SDO-AHR                       060640      
001649          MOVE WKS-SALDO-T        TO      WLI-DIFERENCIA          060645      
001650    ELSE                                                          060650      
001651       COMPUTE WKS-SALDO-T = WKS-SDO-ACC          +               060655      
001652                             WKS-SDO-AHR                          060660      
001653       MOVE WKS-SALDO-T   TO      WLI-DIFERENCIA.                 060665      
001654    WRITE V00-R00-SDOS FROM WLI-REP-COMPSDO AFTER 2.              060700      
001655    MOVE SPACES TO V00-R00-SDOS                                   060800      
001656    WRITE V00-R00-SDOS                                            060900      
001657    ADD 3 TO W77-NUM-LINEAS.                                      061000      
001658                                                                  061100      
001659 30400-LEE-DET2.                                                  061200      
001660*===============                                                  061300      
001661     IF AHRST-ACCT-NBR = WKS-CTA-AHR                              061400      
001662        PERFORM 30500-GRABA-DET2                                  061500      
001663        READ ARCH-AHR AT END MOVE 1 TO W77-EOF3,W77-EOF           061600      
001664     ELSE                                                         061700      
001665        MOVE 1 TO W77-EOF3.                                       061800      
001666                                                                  061900      
001667 30500-GRABA-DET2 .                                               062000      
001668*==================                                               062100      
001669                                                                  062200      
001670     IF W77-NUM-LINEAS > 47                                       062300      
001671        PERFORM 36300-IMP-ENCABEZADO.                             062400      
001672                                                                  062500      
001673      MOVE AHRST-TXN-CODE         TO      WLI-CVE                 062600      
001674      MOVE AHRST-TXN-AMT          TO      WLI-IMP-CVE             062700      
001675      MOVE AHRST-DR-CR-IND        TO      WLI-SCVE                062800      
001676      MOVE AHRST-LDGR-AMT         TO      WLI-IMP-SDO             062900      
001677      MOVE AHRST-LDGR-AMT-SIGN    TO      WLI-SSDO                063000      
001678      MOVE AHRST-CTRCT-REF-NBR    TO      WLI-REFNUM              063100      
001679      MOVE AHRST-THEIR-REF-NBR    TO      WLI-RECTE               063200      
001680      WRITE V00-R00-SDOS FROM WLI-REP-DETSDO.                     063300      
001681      ADD 1 TO W77-NUM-LINEAS.                                    063400      
001682                                                                  063500      
001683 36300-IMP-ENCABEZADO.                                            063600      
001684*=====================                                            063700      
001685    ADD  1                TO       WKS-NUM-HOJAS                  063800      
001686    MOVE WKS-NUM-HOJAS    TO       WSR-RP-E3-HOJA                 063900      
001687    WRITE V00-R00-SDOS    FROM     WLI-TIT1-ENCAB  AFTER PAGE.    064000      
001688    WRITE V00-R00-SDOS    FROM     WLI-TIT2-ENCAB                 064100      
001689    WRITE V00-R00-SDOS    FROM     WLI-TIT3-ENCAB                 064200      
001690    MOVE SPACES           TO       V00-R00-SDOS                   064300      
001691    WRITE V00-R00-SDOS                                            064400      
001692    WRITE V00-R00-SDOS    FROM     WLI-TIT1-SDOS.                 064500      
001693    MOVE SPACES           TO       V00-R00-SDOS                   064520      
001694    WRITE V00-R00-SDOS.                                           064540      
001695    WRITE V00-R00-SDOS    FROM     WLI-TIT2-SDOS.                 064600      
001696    MOVE SPACES           TO       V00-R00-SDOS                   064700      
001697    WRITE V00-R00-SDOS.                                           064800      
001698    MOVE 11 TO W77-NUM-LINEAS.                                    064900      
001699                                                                  065000      
001700                                                                  065100      
001701*==============================                                   065200      
001702*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001703*    COPY "S151/CRONOS2K/CPY/PD".                                 065300      
001704** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
001705** Unisys has defined for CRONOS2K project                     ** 000200      
001706** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
001707***************************************************************** 000400      
001708***************************************************************** 000600      
001709** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
001710** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
001711** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
001712** date MMDDCCAA, which is returned into the variable          ** 001000      
001713** A2K-FEC-MDCA-001.                                           ** 001100      
001714***************************************************************** 001200      
001715                                                                  001300      
001716 A2K-ACCEPT-TODAYS-DATE.                                          001400      
001717        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
001718*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
001719        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
001720        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
001721        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
001722        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
001723        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
001724                                                                  002200      
001725 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
001726        EXIT.                                                     002240      
001727                                                                  002500      
001728****************************************************************  002600      
001729** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
001730**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
001731**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
001732**baseyear to add the century to the year part.               **  003000      
001733**INPUT is A2K-FEC-AMD-001                                    **  003100      
001734**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
001735****************************************************************  003300      
001736                                                                  003400      
001737 A2K-CONV-AMD-TO-CAMD.                                            003500      
001738         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
001739         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
001740         IF A2K-FEC-AMD-001 = 0                                   003720      
001741            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
001742         ELSE                                                     003741      
001743          IF A2K-FEC-AMD-001 = 999999                             003742      
001744             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
001745         ELSE                                                     003760      
001746         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
001747                 A2K-OBTAIN-CENTURY-EXIT                          003900      
001748         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
001749         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
001750         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
001751         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
001752                                                                  004400      
001753 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
001754         EXIT.                                                    004600      
001755                                                                  004700      
001756******************************************************************004800      
001757**A2K-CONV-MDA-TO-MDCA.                                         **004900      
001758**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
001759** an eight digit format as MMDDCCAA. It use a                  **005100      
001760** baseyear to add century to the yaer.                         **005200      
001761** INPUT is A2K-FEC-MDA-001                                     **005300      
001762** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
001763                                                                  005500      
001764 A2K-CONV-MDA-TO-MDCA.                                            005600      
001765     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
001766     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
001767     IF A2K-FEC-MDA-001 = 0                                       005820      
001768        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
001769     ELSE                                                         005845      
001770      IF A2K-FEC-MDA-001 = 999999                                 005850      
001771         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
001772     ELSE                                                         005860      
001773     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
001774             A2K-OBTAIN-CENTURY-EXIT                              006000      
001775     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
001776     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
001777     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
001778     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
001779                                                                  006500      
001780 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
001781     EXIT.                                                        006700      
001782                                                                  006800      
001783***************************************************************** 006900      
001784**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
001785**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
001786**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
001787**baseyear to add century to the year.                         ** 007300      
001788**INPUT is A2K-FEC-DMA-001                                     ** 007400      
001789**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
001790                                                                  007600      
001791 A2K-CONV-DMA-TO-DMCA.                                            007700      
001792       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
001793       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
001794       IF  A2K-FEC-DMA-001   = 0                                  007920      
001795          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
001796       ELSE                                                       007945      
001797        IF A2K-FEC-DMA-001 = 999999                               007950      
001798          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
001799       ELSE                                                       007960      
001800       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
001801               A2K-OBTAIN-CENTURY-EXIT                            008100      
001802       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
001803       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
001804       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
001805       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
001806                                                                  008600      
001807 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
001808       EXIT.                                                      008800      
001809                                                                  008900      
001810***************************************************************** 009000      
001811** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
001812** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
001813** a 6 digit format as AAMMDD.                                 ** 009300      
001814** It simply removes the century information in the output     ** 009400      
001815** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
001816** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
001817                                                                  009700      
001818 A2K-CONV-CAMD-TO-AMD.                                            009800      
001819     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
001820     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
001821     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
001822     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
001823                                                                  010300      
001824 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
001825      EXIT.                                                       010500      
001826                                                                  010600      
001827******************************************************************010700      
001828******************************************************************010800      
001829** A2K-CONV-MDCA-TO-MDA.                                        **010900      
001830** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
001831** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
001832** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
001833** INPUT is A2K-FEC-MDCA-001                                    **011300      
001834** OUTPUT is A2K-FEC-MDA-001                                    **011400      
001835                                                                  011500      
001836 A2K-CONV-MDCA-TO-MDA.                                            011600      
001837     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
001838     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
001839     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
001840     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
001841                                                                  012100      
001842 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
001843      EXIT.                                                       012300      
001844                                                                  012400      
001845******************************************************************012500      
001846***************************************************************** 012600      
001847** A2K-CONV-DMCA-TO-DMA.                                        **012700      
001848** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
001849** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
001850** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
001851** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
001852** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
001853                                                                  013300      
001854 A2K-CONV-DMCA-TO-DMA.                                            013400      
001855     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
001856     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
001857     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
001858     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
001859                                                                  013900      
001860 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
001861      EXIT.                                                       014100      
001862                                                                  014200      
001863***************************************************************** 014300      
001864 A2K-CONV-MDCA-TO-CAMD.                                           014400      
001865      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
001866      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
001867      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
001868      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
001869      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
001870 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
001871      EXIT.                                                       015100      
001872***************************************************************** 015200      
001873** This paragraph adds century to an year field which is 9(02) ** 015300      
001874** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
001875** Output is A2K-FEC-CCAA-001.                                 ** 015600      
001876***************************************************************** 015700      
001877 A2K-CONV-AA-TO-CCAA.                                             015800      
001878      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
001879      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
001880              A2K-OBTAIN-CENTURY-EXIT.                            016100      
001881      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
001882 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
001883      EXIT.                                                       016400      
001884***************************************************************** 016500      
001885** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
001886** format.                                                     ** 016700      
001887** Input is A2K-FEC-DMCA-001.                                  ** 016800      
001888** Output is A2K-FEC-CAMD-001.                                 ** 016900      
001889***************************************************************** 017000      
001890 A2K-CONV-DMCA-TO-CAMD.                                           017100      
001891      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
001892      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
001893      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
001894      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
001895      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
001896 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
001897      EXIT.                                                       017800      
001898***************************************************************** 017900      
001899** This paragraph desides the Century to be added depending    ** 018000      
001900** on the base year.                                           ** 018100      
001901** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
001902** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
001903***************************************************************** 018400      
001904 A2K-OBTAIN-CENTURY.                                              018500      
001905      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
001906          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
001907      ELSE                                                        018800      
001908          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
001909 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
001910      EXIT.                                                       019100      
001911                                                                  019200      
001912***************************************************************** 019300      
001913** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
001914**  Format                                                     ** 019500      
001915** Input Is A2K-FEC-CAMD-001                                   ** 019600      
001916** Output Is A2K-FEC-DMCA-001                                  ** 019700      
001917***************************************************************** 019800      
001918 A2K-CONV-CAMD-TO-DMCA.                                           019900      
001919      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
001920      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
001921      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
001922      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
001923      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
001924                                                                  020500      
001925 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
001926      EXIT.                                                       020700      
001927                                                                  020800      
001928******************************************************************020900      
001929******************************************************************021000      
001930 A2K-CONV-AM-TO-CAM.                                              021100      
001931      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
001932      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
001933      IF A2K-FEC-AM-001 = 0                                       021220      
001934         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
001935      ELSE                                                        021245      
001936      IF A2K-FEC-AM-001 = 9999                                    021250      
001937         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
001938      ELSE                                                        021260      
001939      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
001940      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
001941      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
001942              A2K-OBTAIN-CENTURY-EXIT                             021600      
001943      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
001944                                                                  021800      
001945 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
001946      EXIT.                                                       022000      
001947                                                                  022100      
001948******************************************************************022200      
001949******************************************************************022300      
001950 A2K-CONV-CAM-TO-AM.                                              022400      
001951      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
001952      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
001953      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
001954                                                                  022800      
001955 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
001956   EXIT.                                                          023000      
001957                                                                  023100      
001958                                                                  023200      
001959                                                                  023500      
001960*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
