000001$$ SET LIST  STAKCK FREE LINEINFO                                 000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000101      
000003$SET LISTOMITTED                                                  000102      
000004$SET OLDCODE                                                      000103      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000104      
000006$ SET LIST MAPINFO XREF LINEINFO ERRORLIMIT = 100                 000151      
000007*$$ SET OPTIMIZE FEDLEVEL = 5                                     000200      
000008*$$ TARGET=LEVEL2                                                 000300      
000009 IDENTIFICATION DIVISION.                                         000400      
000010 PROGRAM-ID. ROTABASE.                                            000500      
000011******************************************************************000600      
000012* OBJETIVO : EFECTUAR LA ACTUALIZACION DE SDOS. MENSUALES, SDOS. *000700      
000013*            DIARIOS Y LA ROTACION DE BASES ARCHIVOS DE MOVTOS.  *000800      
000014*            CICLICOS.                                           *000900      
000015*                    P A R A M E T R O S                         *001000      
000016* ============================================================== *001100      
000017*                                                                *001200      
000018*   ENTRADA : SISTEMA.                                           *001300      
000019*                                                                *001400      
000020*   SALIDA  : NOMBRE DE LA BASE A INICIALIZAR.                   *001500      
000021*                                                                *001600      
000022*                                                                *002700      
000023*   RECOMPILACION POR EL UPGRADE DEL MCP A 55                    *002710      
000024*   20141208 15MTP001 MJGRG                                      *002712      
000025******************************************************************002800      
000026 ENVIRONMENT DIVISION.                                            002900      
000027 INPUT-OUTPUT SECTION.                                            003000      
000028 FILE-CONTROL.                                                    003100      
000029                                                                  003151      
000030     SELECT V00-REPORTE2      ASSIGN TO PRINTER.                  003171      
000031                                                                  003191      
000032 DATA DIVISION.                                                   003200      
000033                                                                  003251      
000034 FILE SECTION.                                                    003256      
000035                                                                  003261      
000036 FD  V00-REPORTE2                                                 003266      
000037     VALUE OF TITLE IS WKS-TIT-REPORTE2.                          003271      
000038                                                                  003276      
000039 01  V00-R00-REPORTE2             PIC X(132).                     003281      
000040                                                                  003300      
000041 DATA-BASE SECTION.                                               003400      
000042 DB BASESDO = S151BD11SDOS151.                                    003500      
000043 DB BASEMOV = S151BD12MC001S151.                                  003600      
000044*DB BASEHIS = S151BD13MOVHIS151.                                  003700      
000045                                                                  003800      
000046 WORKING-STORAGE SECTION.                                         003900      
000047*INICIA CODIGO DE RENOVACION CRONOS 2000                          003901      
000048*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000049* COPY "S151/CRONOS2K/CPY/WS".                                    003902      
000050******************************************************************000100      
000051** This copyBook defines all the additional variables that      **000200      
000052** Unisys has defined for the CRONOS2K project                  **000300      
000053** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000054******************************************************************000500      
000055                                                                  000600      
000056******************************************************************000700      
000057** These Variables are used to Accept the system date in long   **000800      
000058** format and get the century information                       **000900      
000059** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000060 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000061 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000062    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000063    05 FILLER      PIC X(1).                                      001400      
000064    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000065    05 FILLER      PIC X(1).                                      001600      
000066    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000067    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000068      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000069      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000070******************************************************************002100      
000071                                                                  002200      
000072******************************************************************002300      
000073** This variable defines a date in the format MMDDCCAA          **002400      
000074**                                                              **002500      
000075 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000076 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000077    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000078    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000079    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000080    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000081      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000082      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000083******************************************************************003400      
000084                                                                  003500      
000085******************************************************************003600      
000086** This variable defines a date in the format CCAAMMDD          **003700      
000087**                                                              **003800      
000088 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000089 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000090    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000091    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000092      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000093      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000094    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000095    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000096******************************************************************004700      
000097                                                                  004800      
000098******************************************************************004900      
000099** This variable defines a date in the format DDMMCCAA          **005000      
000100**                                                              **005100      
000101 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000102 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000103    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000104    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000105    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000106    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000107      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000108      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000109******************************************************************006000      
000110                                                                  006100      
000111******************************************************************006200      
000112** This variable defines a date in the Julian Format CCAADDD    **006300      
000113**                                                              **006400      
000114 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000115 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000116    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000117    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000118                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000119      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000120      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000121    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000122******************************************************************007300      
000123                                                                  007400      
000124******************************************************************007500      
000125** This variable defines a date in the format AAMMDD            **007600      
000126**                                                              **007700      
000127 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000128 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000129    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000130    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000131    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000132******************************************************************008300      
000133                                                                  008400      
000134******************************************************************008500      
000135** This variable defines a date in the format MMDDAA            **008600      
000136**                                                              **008700      
000137 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000138 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000139    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000140    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000141    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000142******************************************************************009300      
000143                                                                  009400      
000144******************************************************************009500      
000145** This variable defines a date in the format DDMMAA            **009600      
000146**                                                              **009700      
000147 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000148 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000149    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000150    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000151    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000152******************************************************************010300      
000153                                                                  010400      
000154******************************************************************010500      
000155** These variables are defined to be used for CALL bridge logic **010600      
000156**                                                              **010700      
000157 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000158 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000159 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000160 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000161 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000162 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000163******************************************************************011400      
000164                                                                  011500      
000165******************************************************************011600      
000166** This variable is used for converting only a year field AA to **011700      
000167** CCAA and a CCAA to AA                                        **011800      
000168 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000169 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000170    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000171    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000172 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000173 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000174******************************************************************012300      
000175                                                                  012400      
000176******************************************************************012500      
000177** These variables are Bridge Variables for Intercambio files   **012600      
000178** para EDOCTA                                                  **012700      
000179 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000180 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000181 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000182 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000183 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000184 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000185 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000186******************************************************************013500      
000187* Para MODULO                                                     013600      
000188 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000189******************************************************************013800      
000190******************************************************************013900      
000191** Para FMOVSCHABO                                                014000      
000192 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000193******************************************************************014200      
000194                                                                  014300      
000195******************************************************************014400      
000196***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000197******************************************************************014600      
000198                                                                  014700      
000199 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000200 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000201     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000202     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000203     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000204******************************************************************015300      
000205                                                                  015400      
000206******************************************************************015500      
000207***  These Variables Are Defined For Date In AAMM Format       ***015600      
000208******************************************************************015700      
000209                                                                  015800      
000210 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000211 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000212     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000213     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000214******************************************************************016300      
000215                                                                  016400      
000216                                                                  016500      
000217*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000218  01  A2K-BASE-YEAR     PIC 9(02) VALUE 50.                       003903      
000219*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003904      
000220                                                                  004000      
000221*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000222* COPY "(S151)S151/FORMATO/DISPLAY.".                             004051      
000223                                                                  000100      
000224*===============================================================* 000200      
000225*         FORMATO PARA DISPLAYS                                 * 000300      
000226*===============================================================* 000400      
000227                                                                  000500      
000228 01 WKS-TIT-REPORTE2.                                             000600      
000229    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000230    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000231    02 FILLER                       PIC X(06) VALUE               000900      
000232                                              "/LIST/".           001000      
000233    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000234    02 FILLER                       PIC X(01) VALUE "/".          001071      
000235    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000236    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000237    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000238    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000239    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000240    02 FILLER                       PIC X(11) VALUE               001600      
000241                                              "/001MSGIMP.".      001700      
000242                                                                  002100      
000243 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000244                                                                  002300      
000245***********************************************************       002400      
000246*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000247***********************************************************       002600      
000248 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000249*8D                                                               002800      
000250 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000251 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000252    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000253    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000254    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000255*8D                                                               003400      
000256 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000257 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000258    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000259    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000260    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000261                                                                  004100      
000262 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000263                                                                  004300      
000264 01 WKS-FECHA-HORA2.                                              004400      
000265    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000266    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000267       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000268       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000269    02 WKS-TIME-MAQ2.                                             004600      
000270       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000271       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000272          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000273          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000274          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000275       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000276    02 FILLER                             PIC X(01).              004900      
000277    02 WKS-RESTO2                         PIC X(04).              005000      
000278                                                                  005100      
000279*8D                                                               005200      
000280****************** REPORTE DE MENSAJES *********************      005300      
000281 01 WLI-ENCAB-12.                                                 005400      
000282    03 FILLER                             PIC X(05) VALUE         005500      
000283       "S151-".                                                   005600      
000284    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000285    03 FILLER                             PIC X(15) VALUE         005671      
000286       "-001IMPMENSAJES".                                         005691      
000287    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000288    03 FILLER                             PIC X(34) VALUE         005800      
000289       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000290    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000291    03 FILLER                             PIC X(26) VALUE         006100      
000292       "FECHA DE LA INFORMACION : ".                              006200      
000293    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000294    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000295       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000296       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000297       05  WKS-SLASH1                         PIC X(01).          006356      
000298       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000299       05  WKS-SLASH2                         PIC X(01).          006358      
000300       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000301 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000302 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000303    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000304    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000305    03 FILLER                          PIC X(01).                 006371      
000306    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000307    03 FILLER                          PIC X(01).                 006381      
000308    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000309*8D                                                               006400      
000310 01 WLI-ENCAB-22.                                                 006500      
000311     03 FILLER                          PIC X(11) VALUE           006600      
000312        "F.PROCESO: ".                                            006700      
000313     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000314     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000315     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000316     03 FILLER                          PIC X(01) VALUE ":".      007020      
000317     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000318     03 FILLER                          PIC X(01) VALUE ":".      007060      
000319     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000320     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000321     03 FILLER                          PIC X(24) VALUE           007200      
000322              "IMPRESION MENSAJES DEL S".                         007300      
000323     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000324     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000325     03 FILLER                          PIC X(14) VALUE           007600      
000326        "TIPO PROCESO: ".                                         007700      
000327     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000328*8D                                                               007900      
000329 01 WLI-ENCAB-32.                                                 008000      
000330     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000331*       "VERSION  : ".                                            008200      
000332*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000333     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000334     03 FILLER                     PIC X(07) VALUE                008500      
000335        "HOJA : ".                                                008600      
000336     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000337                                                                  008800      
000338 01 WLI-ENCAB-42.                                                 008900      
000339     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000340     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000341     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000342                                                                  009300      
000343 01 WLI-ENCAB-52.                                                 009400      
000344    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000345    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000346    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000347    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000348                                                                  009900      
000349*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000350 01 WLI-ENCAB-62.                                                 009910      
000351    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000352    03 WLI-RESULT                 PIC X(04).                      009920      
000353    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000354    03 WLI-TEXTO                  PIC X(110).                     009930      
000355                                                                  009935      
000356 01 WLI-TOT-ENVIO.                                                009940      
000357    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000358    03 FILLER                     PIC X(37) VALUE                 009950      
000359       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000360    03 WLI-ENV-CTD                PIC X(04).                      009960      
000361*FIN - INFOWARE                                                   009970      
000362****************************************************************  010000      
000363*                 CONTADORES DE HOJAS                          *  010100      
000364****************************************************************  010200      
000365                                                                  010300      
000366  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000367*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000368                                                                  004071      
000369*=========================================================        004100      
000370*         VARIABLES PARA CONTROL DE VERSIONES            =        004200      
000371*=========================================================        004300      
000372                                                                  004400      
000373 01  WKS-LIBID                     PIC X(12).                     004500      
000374 01  WKS-NOMBLIB                   PIC X(72).                     004600      
000375 77  W77-ERR-CTLVER                PIC S9(11) BINARY.             004700      
000376                                                                  004800      
000377*=========================================================        004900      
000378*         VARIABLES PARA LIBRERIA DE CONTROL             =        005000      
000379*=========================================================        005100      
000380                                                                  005200      
000381*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000382* COPY "(S151)S151/FORMATO/LLAMADA/LIBCONTROL.".                  005300      
000383*================================================================ 000100      
000384*         ENTRY-POINT CONSISDIA :                               = 000200      
000385*                                                                 000300      
000386* FUNCION 1  .- CONSULTA  S151B01SISDIA                         = 000400      
000387* FUNCION 2  .- ACTUALIZA FECHA DE CONSULTA                     = 000500      
000388* FUNCION 3  .- ACTUALIZA FECHA DE PROCESO                      = 000600      
000389* FUNCION 4  .- ACTUALIZA ESTATUS DE BASE SEMANAL               = 000700      
000390* FUNCION 5  .- HABILITA FECHA.                                 = 000800      
000391* FUNCION 6  .- ACTUALIZA FECHA.                                = 000900      
000392* FUNCION 7  .- ACTUALIZA EL STATUS DEL ARCHIVO LOG.            = 001000      
000393* FUNCION 8  .- ACTUALIZA EL NIVEL DE ARCHIVO DE MOVIMIENTOS.   = 001100      
000394* FUNCION 9  .- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.         = 001200      
000395* FUNCION 10 .- ACTUALIZA EL NIVEL DE LA BASE Y ARCHIVO DE MOVS = 001300      
000396*                                                               = 001400      
000397*================================================================ 001500      
000398                                                                  001600      
000399                                                                  001700      
000400*================================================================ 001800      
000401* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 001900      
000402*                                                               = 002000      
000403* ENTRADA REQUERIDA :                                           = 002100      
000404*                                                               = 002200      
000405*   WKS-B01-FUNCION : FUNCION = 01.                             = 002300      
000406*   WKS-B01-SISTEMA : SISTEMA.                                  = 002400      
000407*   WKS-B01-CSI     : NUMERO DE CSI.                            = 002500      
000408*================================================================ 002600      
000409 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          002700      
000410    03 WKS-B01-FUNCION             PIC 9(02).                     002800      
000411    03 WKS-B01-SISTEMA             PIC 9(04).                     002900      
000412    03 WKS-B01-CSI                 PIC 9(02).                     003000      
000413    03 WKS-B01-FECPRO              PIC 9(08).                     003102      
000414    03 WKS-B01-FECCON              PIC 9(08).                     003202      
000415    03 WKS-B01-FECPRO151           PIC 9(08).                     003302      
000416    03 WKS-B01-STAREG              PIC 9(02).                     003400      
000417    03 WKS-B01-NOMARCSAL           PIC X(34).                     003500      
000418    03 WKS-B01-NOMPACSAL           PIC X(17).                     003600      
000419    03 WKS-B01-NOMARCMOV           PIC X(34).                     003700      
000420    03 WKS-B01-NOMPACMOV           PIC X(17).                     003800      
000421    03 WKS-B01-NOMARCDES           PIC X(34).                     003900      
000422    03 WKS-B01-NOMPACDES           PIC X(17).                     004000      
000423    03 WKS-B01-NOMARCERR           PIC X(34).                     004100      
000424    03 WKS-B01-NOMPACERR           PIC X(17).                     004200      
000425    03 WKS-B01-NOMBDSEM            PIC X(17).                     004300      
000426    03 WKS-B01-STABDSEM            PIC 9(02).                     004400      
000427    03 WKS-B01-NUMARC              PIC 9(02).                     004500      
000428    03 WKS-B01-3ERNIV              PIC 9(02).                     004600      
000429    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       004700      
000430       05 WKS-B01-FECARCMOV        PIC 9(08).                     004802      
000431       05 WKS-B01-NIVARCMOV        PIC 9(08).                     004900      
000432       05 WKS-B01-NIVBDMOV         PIC 9(08).                     005000      
000433       05 WKS-B01-STAARCLOG        PIC 9(02).                     005100      
000434*==============================================================   005200      
000435*                                                             =   005300      
000436* FUNCION 2 .- ACTUALIZA LA FECHA DE CONSULTA.                =   005400      
000437*                                                             =   005500      
000438* CAMPOS REQUERIDOS :                                         =   005600      
000439*                                                             =   005700      
000440* WKS-B01F02-FUNCION : FUNCION = 2                            =   005800      
000441* WKS-B01F02-SISTEMA : SISTEMA                                =   005900      
000442* WKS-B01F02-CSI     : NUMERO DE CSI                          =   006000      
000443* WKS-B01F02-FECCON  : FECHA DE CONSULTA A COLOCAR            =   006100      
000444*==============================================================   006200      
000445 01 WKS-CONSISDIA-F02 WITH LOWER-BOUNDS.                          006300      
000446    03 WKS-B01F02-FUNCION          PIC 9(02).                     006400      
000447    03 WKS-B01F02-SISTEMA          PIC 9(04).                     006500      
000448    03 WKS-B01F02-CSI              PIC 9(02).                     006600      
000449    03 WKS-B01F02-FECCON           PIC 9(08).                     006702      
000450                                                                  006800      
000451*==============================================================   006900      
000452*                                                             =   007000      
000453* FUNCION 3 .- ACTUALIZA LA FECHA DE PROCESO.                 =   007100      
000454*                                                             =   007200      
000455* CAMPOS REQUERIDOS :                                         =   007300      
000456*                                                             =   007400      
000457* WKS-B01F03-FUNCION : FUNCION = 3                            =   007500      
000458* WKS-B01F03-SISTEMA : SISTEMA                                =   007600      
000459* WKS-B01F03-CSI     : NUMERO DE CSI                          =   007700      
000460* WKS-B01F03-FECPRO  : FECHA DE CONSULTA A COLOCAR            =   007800      
000461*==============================================================   007900      
000462 01 WKS-CONSISDIA-F03 WITH LOWER-BOUNDS.                          008000      
000463    03 WKS-B01F03-FUNCION          PIC 9(02).                     008100      
000464    03 WKS-B01F03-SISTEMA          PIC 9(04).                     008200      
000465    03 WKS-B01F03-CSI              PIC 9(02).                     008300      
000466    03 WKS-B01F03-FECPRO           PIC 9(08).                     008402      
000467                                                                  008500      
000468*==============================================================   008600      
000469*                                                             =   008700      
000470* FUNCION 4 .- ACTUALIZA EL STATUS DE LA BASE SEMANAL.        =   008800      
000471*                                                             =   008900      
000472* CAMPOS REQUERIDOS :                                         =   009000      
000473*                                                             =   009100      
000474* WKS-B01F04-FUNCION  : FUNCION = 4                           =   009200      
000475* WKS-B01F04-SISTEMA  : SISTEMA                               =   009300      
000476* WKS-B01F04-CSI      : NUMERO DE CSI                         =   009400      
000477* WKS-B01F04-STABDSEM : ESTATUS BASE DE DATOS SEMANAL (0, 1)  =   009500      
000478*==============================================================   009600      
000479 01 WKS-CONSISDIA-F04 WITH LOWER-BOUNDS.                          009700      
000480    03 WKS-B01F04-FUNCION          PIC 9(02).                     009800      
000481    03 WKS-B01F04-SISTEMA          PIC 9(04).                     009900      
000482    03 WKS-B01F04-CSI              PIC 9(02).                     010000      
000483    03 WKS-B01F04-STABDSEM         PIC 9(02).                     010100      
000484                                                                  010200      
000485*============================================================     010300      
000486* FUNCION 5.- CAMBIA EL ESTATUS DEL CAMPO B01-SIS-STAREG.   =     010400      
000487*             LOS VALORES PERMITIDOS A CAMBIAR SON 0 Y 1.   =     010500      
000488*                                                           =     010600      
000489*  EL VALOR 0 PERMITE  QUE EL P000 PUEDE SER EJECUTADO.     =     010700      
000490*  EL VALOR 1 NO PERMITE LA EJECUCION DEL P000.             =     010800      
000491*                                                           =     010900      
000492*  ENTRADA REQUERIDA.                                       =     011000      
000493*                                                           =     011100      
000494*  WKS-B01F05-FUNCION   : FUNCION = 5.                      =     011200      
000495*  WKS-B01F05-SISTEMA   : SISTEMA.                          =     011300      
000496*  WKS-B01F05-CSI       : NUMERO DE CSI.                    =     011400      
000497*  WKS-B01F05-VALOR     : VALOR A COLOCAR ( 0, 1 ).         =     011500      
000498*============================================================     011600      
000499                                                                  011700      
000500 01  WKS-CONSISDIA-F05 WITH LOWER-BOUNDS.                         011800      
000501     03 WKS-B01F05-FUNCION                 PIC 9(02).             011900      
000502     03 WKS-B01F05-SISTEMA                 PIC 9(04).             012000      
000503     03 WKS-B01F05-CSI                     PIC 9(02).             012100      
000504     03 WKS-B01F05-VALOR                   PIC 9(02).             012200      
000505                                                                  012300      
000506*=============================================================    012400      
000507*                                                            =    012500      
000508* FUNCION 6.- ACTUALIZA EN EL DATASET S151B01SISDIA EL CAMPO =    012600      
000509*             B01-SIS-FECARMOV.                              =    012700      
000510*                                                            =    012800      
000511* ENTRADA REQUERIDAD :                                       =    012900      
000512*                                                            =    013000      
000513*  WKS-B01F06-FUNCION  : FUNCION = 06.                       =    013100      
000514*  WKS-B01F06-SISTEMA  : SISTEMA.                            =    013200      
000515*  WKS-B01F06-CSI      : NUMERO DE CSI.                      =    013300      
000516*  WKS-B01F06-FECACT   : FECHA ACTUAL.                       =    013400      
000517*  WKS-B01F06-FECNVA   : FECHA NUEVA.                        =    013500      
000518*=============================================================    013600      
000519                                                                  013700      
000520 01  WKS-CONSISDIA-F06 WITH LOWER-BOUNDS.                         013800      
000521     03 WKS-B01F06-FUNCION        PIC 9(02).                      013900      
000522     03 WKS-B01F06-SISTEMA        PIC 9(04).                      014000      
000523     03 WKS-B01F06-CSI            PIC 9(02).                      014100      
000524     03 WKS-B01F06-FECACT         PIC 9(08).                      014202      
000525     03 WKS-B01F06-FECNVA         PIC 9(08).                      014302      
000526*================================================================ 014400      
000527*                                                               = 014500      
000528* FUNCION 7.- ACTUALIZA EL ESTATUS DEL ARCHIVO DE MOVIMIENTOS.  = 014600      
000529*             ESTE CAMPO INDICA AL ASICRONO SI EL ARCHIVO ESTA  = 014700      
000530*             O NO DISPOSIBLE PARA SU USO.                      = 014800      
000531*             0.- INDICA ARCHIVO DE MOVS. DISPONIBLE.           = 014900      
000532*             1.- INDICA ARCHIVO DE MOVS. NO DISPONIBLE         = 015000      
000533*                                                               = 015100      
000534* ENTRADA REQUERIDA :                                           = 015200      
000535*                                                               = 015300      
000536* WKS-B01F07-FUNCION  : FUNCION = 07.                           = 015400      
000537* WKS-B01F07-SISTEMA  : SISTEMA.                                = 015500      
000538* WKS-B01F07-CSI      : NUMERO DE CSI.                          = 015600      
000539* WKS-B01F07-FECHA    : FECHA DEL ESTATUS A MOFIFICAR.          = 015700      
000540* WKS-B01F07-ESTATUS  : VALOR A COLOCAR COMO ESTUTUS ( 0, 1 )   = 015800      
000541*================================================================ 015900      
000542 01 WKS-CONSISDIA-F07 WITH LOWER-BOUNDS.                          016000      
000543    03 WKS-B01F07-FUNCION          PIC 9(02).                     016100      
000544    03 WKS-B01F07-SISTEMA          PIC 9(04).                     016200      
000545    03 WKS-B01F07-CSI              PIC 9(02).                     016300      
000546    03 WKS-B01F07-FECHA            PIC 9(08).                     016402      
000547    03 WKS-B01F07-ESTATUS          PIC 9(02).                     016500      
000548                                                                  016600      
000549*============================================================     016700      
000550*                                                           =     016800      
000551* FUNCION 8.- ACTUALIZA EL NIVEL DEL ARCHIVO DE MOVIMIENTOS.=     016900      
000552*                                                           =     017000      
000553* DATOS REQUERIDOS :                                        =     017100      
000554*                                                           =     017200      
000555* WKS-B01F08-FUNCION : FUNCION = 08.                        =     017300      
000556* WKS-B01F08-SISTEMA : SISTEMA.                             =     017400      
000557* WKS-B01F08-CSI     : NUMERO DE CSI.                       =     017500      
000558* WKS-B01F08-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     017600      
000559* WKS-B01F08-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     017700      
000560*============================================================     017800      
000561                                                                  017900      
000562 01  WKS-CONSISDIA-F08 WITH LOWER-BOUNDS.                         018000      
000563     03 WKS-B01F08-FUNCION         PIC 9(02).                     018100      
000564     03 WKS-B01F08-SISTEMA         PIC 9(04).                     018200      
000565     03 WKS-B01F08-CSI             PIC 9(02).                     018300      
000566     03 WKS-B01F08-FECHA           PIC 9(08).                     018402      
000567     03 WKS-B01F08-NIVEL           PIC 9(08).                     018500      
000568                                                                  018600      
000569*============================================================     018700      
000570*                                                           =     018800      
000571* FUNCION 9.- ACTUALIZA EL NIVEL DE LA BASE DE DATOS.       =     018900      
000572*                                                           =     019000      
000573* DATOS REQUERIDOS :                                        =     019100      
000574*                                                           =     019200      
000575* WKS-B01F09-FUNCION : FUNCION = 09.                        =     019300      
000576* WKS-B01F09-SISTEMA : SISTEMA.                             =     019400      
000577* WKS-B01F09-CSI     : NUMERO DE CSI.                       =     019500      
000578* WKS-B01F09-FECHA   : FECHA DEL NIVEL A MODIFICAR.         =     019600      
000579* WKS-B01F09-NIVEL   : VALOR A COLOCAR EN EL CAMPO DE NIVEL =     019700      
000580*============================================================     019800      
000581                                                                  019900      
000582 01  WKS-CONSISDIA-F09 WITH LOWER-BOUNDS.                         020000      
000583     03 WKS-B01F09-FUNCION         PIC 9(02).                     020100      
000584     03 WKS-B01F09-SISTEMA         PIC 9(04).                     020200      
000585     03 WKS-B01F09-CSI             PIC 9(02).                     020300      
000586     03 WKS-B01F09-FECHA           PIC 9(08).                     020402      
000587     03 WKS-B01F09-NIVEL           PIC 9(08).                     020500      
000588                                                                  020600      
000589*===============================================================  020700      
000590*                                                              =  020800      
000591* FUNCION 10.- ACTUALIZA LOS NIVELES DE LA BASE Y ARCHIVO DE   =  020900      
000592*              MOVIMIENTOS.                                    =  021000      
000593* DATOS REQUERIDOS :                                           =  021100      
000594*                                                              =  021200      
000595* WKS-B01F10-FUNCION : FUNCION = 10.                           =  021300      
000596* WKS-B01F10-SISTEMA : SISTEMA.                                =  021400      
000597* WKS-B01F10-CSI     : NUMERO DE CSI.                          =  021500      
000598* WKS-B01F10-FECHA   : FECHA DEL NIVEL A MODIFICAR.            =  021600      
000599* WKS-B01F10-NIVBASE : VALOR A COLOCAR EN EL NIVEL DE LA BASE  =  021700      
000600* WKS-B01F10-NIVARCM : VALOR A COLOCAR EN EL NIVEL DEL ARCHIVO =  021800      
000601*==============================================================   021900      
000602                                                                  022000      
000603 01  WKS-CONSISDIA-F10 WITH LOWER-BOUNDS.                         022100      
000604     03 WKS-B01F10-FUNCION         PIC 9(02).                     022200      
000605     03 WKS-B01F10-SISTEMA         PIC 9(04).                     022300      
000606     03 WKS-B01F10-CSI             PIC 9(02).                     022400      
000607     03 WKS-B01F10-FECHA           PIC 9(08).                     022502      
000608     03 WKS-B01F10-NIVBASE         PIC 9(08).                     022600      
000609     03 WKS-B01F10-NIVARCM         PIC 9(08).                     022700      
000610*==============================================================   022800      
000611*                                                             =   022900      
000612* FUNCION 11.- ACTUALIZA LA FECHA DE PROCESO PARA EL 151.     =   023000      
000613*                                                             =   023100      
000614* CAMPOS REQUERIDOS :                                         =   023200      
000615*                                                             =   023300      
000616* WKS-B01F11-FUNCION   : FUNCION = 11                         =   023400      
000617* WKS-B01F11-SISTEMA   : SISTEMA                              =   023500      
000618* WKS-B01F11-CSI       : NUMERO DE CSI                        =   023600      
000619* WKS-B01F11-FECPRO151 : FECHA DE CONSULTA A COLOCAR          =   023700      
000620*==============================================================   023800      
000621 01 WKS-CONSISDIA-F11 WITH LOWER-BOUNDS.                          023900      
000622    03 WKS-B01F11-FUNCION          PIC 9(02).                     024000      
000623    03 WKS-B01F11-SISTEMA          PIC 9(04).                     024100      
000624    03 WKS-B01F11-CSI              PIC 9(02).                     024200      
000625    03 WKS-B01F11-FECPRO151        PIC 9(08).                     024302      
000626                                                                  024304      
000627*=================================================================024306      
000628*                ENTRY POINT CONSISB01                           =024308      
000629*                                                                =024310      
000630*  ACCESA LA INFORMACION DEL DATASET S151B01CONSISDIA            =024312      
000631*                                                                =024314      
000632*  FUNCIONES DISPONIBLES :                                       =024316      
000633*                                                                =024318      
000634*  1.- CONS. INFORMACION PARA LOS SISTEMAS DADOS DE ALTA EN B01  =024320      
000635*                                                                =024322      
000636*  PARAMETROS REQUERIDOS                                         =024324      
000637*    WKS-CON-CSI       : NUMERO DE CSI.                          =024326      
000638*    WKS-CON-SISTEMA   : NUMERO DE SISTEMA.                      =024328      
000639*=================================================================024330      
000640                                                                  024332      
000641 01  WKS-B01-CONB01 WITH LOWER-BOUNDS.                            024334      
000642     03 WKS-CON-FUNCION            PIC 9(02).                     024335      
000643     03 WKS-CON-CSI                PIC 9(02).                     024336      
000644     03 WKS-CON-SISTEMA            PIC 9(04).                     024338      
000645     03 WKS-CON-DATOS OCCURS 15 TIMES.                            024340      
000646        05 WKS-DAT-SISTEMA         PIC 9(04).                     024342      
000647        05 WKS-DAT-FECCON          PIC 9(08).                     024344      
000648        05 WKS-DAT-FECPRO          PIC 9(08).                     024354      
000649        05 WKS-DAT-FEC151          PIC 9(08).                     024364      
000650        05 WKS-DAT-STAREG          PIC 9(02).                     024374      
000651                                                                  024400      
000652*=================================================================024500      
000653*                ENTRY POINT B02ARCINTER                         =024600      
000654*                                                                =024700      
000655*  ACCESA LA INFORMACION DEL DATASET S151B02ARCINTER             =024800      
000656*                                                                =024900      
000657*  FUNCIONES DISPONIBLES :                                       =025000      
000658*                                                                =025100      
000659*  1.- CONSULTA INFORMACION DADO UN SISTEMA.                     =025200      
000660* 19.- ALTAS DE ARCHIVOS.                                        =025300      
000661* 22.- BAJAS DE ARCHIVOS.                                        =025400      
000662* 37.- CAMBIO DE ARCHIVOS.                                       =025500      
000663*                                                                =025600      
000664*  PARAMETROS REQUERIDOS                                         =025700      
000665*    WKS-B02-SISTEMA   : NUMERO DE SISTEMA                       =025800      
000666*                                                                =025900      
000667*=================================================================026000      
000668 01  WKS-B02ARCINTER WITH LOWER-BOUNDS.                           026100      
000669     03 WKS-B02-FUNCION            PIC 9(02).                     026200      
000670     03 WKS-B02-SISTEMA            PIC 9(04).                     026300      
000671     03 WKS-B02-NOMARC028          PIC X(34).                     026400      
000672     03 WKS-B02-NOMPAC028          PIC X(17).                     026500      
000673     03 WKS-B02-NOMARC250          PIC X(34).                     026600      
000674     03 WKS-B02-NOMPAC250          PIC X(17).                     026700      
000675     03 WKS-B02-NOMARC030          PIC X(34).                     026800      
000676     03 WKS-B02-NOMPAC030          PIC X(17).                     026900      
000677     03 WKS-B02-NOMARC015          PIC X(34).                     027000      
000678     03 WKS-B02-NOMPAC015          PIC X(17).                     027100      
000679     03 WKS-B02-NOMARC050S         PIC X(34).                     027200      
000680     03 WKS-B02-NOMPAC050S         PIC X(17).                     027300      
000681     03 WKS-B02-NOMARC050M         PIC X(34).                     027400      
000682     03 WKS-B02-NOMPAC050M         PIC X(17).                     027500      
000683     03 WKS-B02-NOMARC253          PIC X(34).                     027600      
000684     03 WKS-B02-NOMPAC253          PIC X(17).                     027700      
000685     03 WKS-B02-NOMARC264          PIC X(34).                     027800      
000686     03 WKS-B02-NOMPAC264          PIC X(17).                     027900      
000687     03 WKS-B02-NOMARC275S         PIC X(34).                     028000      
000688     03 WKS-B02-NOMPAC275S         PIC X(17).                     028100      
000689     03 WKS-B02-NOMARC275M         PIC X(34).                     028200      
000690     03 WKS-B02-NOMPAC275M         PIC X(17).                     028300      
000691     03 WKS-B02-NOMARCSIG          PIC X(34).                     028400      
000692     03 WKS-B02-NOMPACSIG          PIC X(17).                     028500      
000693     03 WKS-B02-NOMARC750          PIC X(34).                     028600      
000694     03 WKS-B02-NOMPAC750          PIC X(17).                     028700      
000695     03 WKS-B02-NOMARC136          PIC X(34).                     028800      
000696     03 WKS-B02-NOMPAC136          PIC X(17).                     028900      
000697                                                                  029000      
000698*=================================================================029100      
000699*                ENTRY POINT B04SISTEMA                          =029200      
000700*                                                                =029300      
000701*  ACCESA LA INFORMACION DEL DATASET S151B04SISTEM               =029400      
000702*                                                                =029500      
000703*  FUNCIONES DISPONIBLES :                                       =029600      
000704*                                                                =029700      
000705*  1.- CONSULTA INFORMACION DADO UN SISTEMA, PROD. E INSTRUMENTO =029800      
000706*  2.- CONSULTA DE INFORMACION DE UN SIST MAYOR AL PROPORCIONADO =029900      
000707*      CON MISMO PRODUCTO E INSTRUMENTO.                         =030000      
000708*                                                                =030100      
000709*  PARAMETROS REQUERIDOS                                         =030200      
000710*    WKS-B04-SISTEMA   : NUMERO DE SISTEMA                       =030300      
000711*    WKS-B04-PRODUCTO  : NUMERO DE PRODUCTO                      =030400      
000712*    WKS-B04-INSTRUM   : NUMERO DE INTRUMENTO                    =030500      
000713*                                                                =030600      
000714*=================================================================030700      
000715 01  WKS-B04SISTEMA WITH LOWER-BOUNDS.                            030800      
000716     03 WKS-B04-FUNCION            PIC 9(02).                     030900      
000717     03 WKS-B04-SISTEMA            PIC 9(04).                     031000      
000718     03 WKS-B04-PRODUCTO           PIC 9(04).                     031100      
000719     03 WKS-B04-INSTRUM            PIC 9(04).                     031200      
000720     03 WKS-B04-NOMCOR             PIC X(20).                     031300      
000721     03 WKS-B04-NOMLAR             PIC X(40).                     031400      
000722     03 WKS-B04-ESTATUS            PIC 9(02).                     031500      
000723                                                                  031600      
000724*================================================================ 031700      
000725*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 031800      
000726*                                                               = 031900      
000727*  FUNCION                                                      = 032000      
000728*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 032100      
000729*   19       ALTAS.                                             = 032200      
000730*   22       BAJAS                                              = 032300      
000731*   37       CAMBIOS.                                           = 032400      
000732*                                                               = 032500      
000733*   DATOS REQUERIDOS : SISTEMA                                  = 032600      
000734*                      FECHA DE PROCESO                         = 032700      
000735*                      NUMERO DE PROCESO                        = 032800      
000736*                      FECHA INICIO                             = 032900      
000737*                      REGISTRO INICIAL                         = 033000      
000738*================================================================ 033100      
000739                                                                  033200      
000740 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        033300      
000741     03 WKS-B05-FUNCION            PIC 9(02).                     033400      
000742     03 WKS-B05-SISTEMA            PIC 9(04).                     033500      
000743     03 WKS-B05-FCHPRO             PIC 9(08).                     033602      
000744     03 WKS-B05-NUMPRO             PIC 9(04).                     033700      
000745     03 WKS-B05-NOMPGM             PIC X(04).                     033800      
000746     03 WKS-B05-STAPGM             PIC 9(02).                     033900      
000747     03 WKS-B05-MIX                PIC 9(08).                     034000      
000748     03 WKS-B05-FCHINI             PIC 9(06).                     034102      
000749     03 WKS-B05-HORAINI            PIC 9(06).                     034200      
000750     03 WKS-B05-FCHFIN             PIC 9(06).                     034302      
000751     03 WKS-B05-HORAFIN            PIC 9(06).                     034400      
000752     03 WKS-B05-NUMREGINI          PIC 9(08).                     034500      
000753     03 WKS-B05-NUMREGFIN          PIC 9(08).                     034600      
000754                                                                  034700      
000755                                                                  034800      
000756*================================================================ 034900      
000757*  ENTRY POINT B09CONXSIS.- ACCESA EL DATASET S151B09CONXSIS.   = 035000      
000758*                                                               = 035100      
000759*  FUNCION                                                      = 035200      
000760*    1       PROPORCIONA EL NOMBRE DEL RENGLON, DADO EL SISTEMA = 035300      
000761*            PROD., INSTRUMENTO Y NUMERO DE RENGLON.            = 035400      
000762*                                                               = 035500      
000763*================================================================ 035600      
000764                                                                  035700      
000765 01  WKS-S151B09CONXSIS WITH LOWER-BOUNDS.                        035800      
000766     03 WKS-B09-FUNCION            PIC 9(02).                     035900      
000767     03 WKS-B09-SISTEMA            PIC 9(04).                     036000      
000768     03 WKS-B09-PRODUCTO           PIC 9(04).                     036100      
000769     03 WKS-B09-INSTRUM            PIC 9(04).                     036200      
000770     03 WKS-B09-NUMREN             PIC 9(02).                     036300      
000771     03 WKS-B09-NOMREN             PIC X(15).                     036400      
000772                                                                  036500      
000773*===============================================================  036600      
000774*                                                              =  036700      
000775*         ENTRY-POINT CONSISMEN                                =  036800      
000776*                                                              =  036900      
000777*   DATOS REQUERIDOS : FUNCION                                 =  037000      
000778*                      SISTEMA                                 =  037100      
000779*                                                              =  037200      
000780*   FUNCION  1 .- CONSULTA S151B03SISMEN                       =  037300      
000781*                                                              =  037400      
000782*===============================================================  037500      
000783 01  WKS-S151B03SISMEN WITH LOWER-BOUNDS.                         037600      
000784     03 WKS-B03-FUNCION            PIC 9(02).                     037700      
000785     03 WKS-B03-SISTEMA            PIC 9(04).                     037800      
000786     03 WKS-B03-MODSIS             PIC 9(02).                     037900      
000787     03 WKS-B03-RESCSI             PIC 9(02).                     038000      
000788     03 WKS-B03-TIPBD              PIC 9(02).                     038100      
000789     03 WKS-B03-NUMCICDIA          PIC 9(04).                     038200      
000790     03 WKS-B03-NUMCICMES          PIC 9(04).                     038300      
000791     03 WKS-B03-NOMBDSAL           PIC X(17).                     038400      
000792     03 WKS-B03-STABDSAL           PIC 9(02).                     038500      
000793     03 WKS-B03-NOMBDMOVHI         PIC X(17).                     038600      
000794     03 WKS-B03-SECOKHI            PIC 9(10).                     038700      
000795     03 WKS-B03-SECINFHI           PIC 9(10).                     038800      
000796     03 WKS-B03-SECERRHI           PIC 9(10).                     038900      
000797     03 WKS-B03-STABDMOVHI         PIC 9(02).                     039000      
000798     03 WKS-B03-CICLO OCCURS 99 TIMES.                            039100      
000799        05 WKS-B03-NOMBDMOV        PIC X(17).                     039200      
000800        05 WKS-B03-NUMBDMOV        PIC 9(02).                     039300      
000801        05 WKS-B03-AAMM            PIC 9(06).                     039402      
000802        05 WKS-B03-SECOK           PIC 9(10).                     039500      
000803        05 WKS-B03-SECINF          PIC 9(10).                     039600      
000804        05 WKS-B03-SECERR          PIC 9(10).                     039700      
000805        05 WKS-B03-STABDMOV        PIC 9(02).                     039800      
000806                                                                  039900      
000807*=====================================================            040000      
000808*         FUNCION 3 MODIFICA EL CAMPO MODSIS         =            040100      
000809*=====================================================            040200      
000810 01  WKS-S151B03SISMEN-F03  WITH LOWER-BOUNDS.                    040300      
000811     03 WKS-B03F03-FUNCION         PIC 9(02).                     040400      
000812     03 WKS-B03F03-SISTEMA         PIC 9(04).                     040500      
000813     03 WKS-B03F03-MODSIS          PIC 9(02).                     040600      
000814                                                                  040700      
000815*=====================================================            040800      
000816*         FUNCION 4 MODIFICA EL CAMPO RESCSI         =            040900      
000817*=====================================================            041000      
000818 01  WKS-S151B03SISMEN-F04  WITH LOWER-BOUNDS.                    041100      
000819     03 WKS-B03F04-FUNCION         PIC 9(02).                     041200      
000820     03 WKS-B03F04-SISTEMA         PIC 9(04).                     041300      
000821     03 WKS-B03F04-RESCSI          PIC 9(02).                     041400      
000822                                                                  041500      
000823*=====================================================            041600      
000824*         FUNCION 5 MODIFICA EL CAMPO TIPBD          =            041700      
000825*=====================================================            041800      
000826 01  WKS-S151B03SISMEN-F05  WITH LOWER-BOUNDS.                    041900      
000827     03 WKS-B03F05-FUNCION         PIC 9(02).                     042000      
000828     03 WKS-B03F05-SISTEMA         PIC 9(04).                     042100      
000829     03 WKS-B03F05-TIPBD           PIC 9(02).                     042200      
000830*=====================================================            042300      
000831*         FUNCION 6 MODIFICA EL CAMPO NUMCICDIA      =            042400      
000832*=====================================================            042500      
000833 01  WKS-S151B03SISMEN-F06  WITH LOWER-BOUNDS.                    042600      
000834     03 WKS-B03F06-FUNCION         PIC 9(02).                     042700      
000835     03 WKS-B03F06-SISTEMA         PIC 9(04).                     042800      
000836     03 WKS-B03F06-NUMCICDIA       PIC 9(04).                     042900      
000837                                                                  043000      
000838*=====================================================            043100      
000839*         FUNCION 7 MODIFICA EL CAMPO NUMCICMES      =            043200      
000840*=====================================================            043300      
000841 01  WKS-S151B03SISMEN-F07  WITH LOWER-BOUNDS.                    043400      
000842     03 WKS-B03F07-FUNCION         PIC 9(02).                     043500      
000843     03 WKS-B03F07-SISTEMA         PIC 9(04).                     043600      
000844     03 WKS-B03F07-NUMCICMES       PIC 9(04).                     043700      
000845                                                                  043800      
000846*=====================================================            043900      
000847*         FUNCION 8 MODIFICA EL CAMPO NOMBDSAL       =            044000      
000848*=====================================================            044100      
000849 01  WKS-S151B03SISMEN-F08  WITH LOWER-BOUNDS.                    044200      
000850     03 WKS-B03F08-FUNCION         PIC 9(02).                     044300      
000851     03 WKS-B03F08-SISTEMA         PIC 9(04).                     044400      
000852     03 WKS-B03F08-NOMBDSAL        PIC X(17).                     044500      
000853                                                                  044600      
000854*=====================================================            044700      
000855*         FUNCION 9 MODIFICA EL CAMPO STABDSAL       =            044800      
000856*=====================================================            044900      
000857 01  WKS-S151B03SISMEN-F09  WITH LOWER-BOUNDS.                    045000      
000858     03 WKS-B03F09-FUNCION         PIC 9(02).                     045100      
000859     03 WKS-B03F09-SISTEMA         PIC 9(04).                     045200      
000860     03 WKS-B03F09-STABDSAL        PIC 9(02).                     045300      
000861                                                                  045400      
000862*=====================================================            045500      
000863*         FUNCION 10 MODIFICA EWL CAMPO NOMBDMOVHI   =            045600      
000864*=====================================================            045700      
000865 01  WKS-S151B03SISMEN-F10  WITH LOWER-BOUNDS.                    045800      
000866     03 WKS-B03F10-FUNCION         PIC 9(02).                     045900      
000867     03 WKS-B03F10-SISTEMA         PIC 9(04).                     046000      
000868     03 WKS-B03F10-NOMBDMOVHI      PIC X(17).                     046100      
000869                                                                  046200      
000870*=====================================================            046300      
000871*         FUNCION 11 MODIFICA EL CAMPO SECOKHI       =            046400      
000872*=====================================================            046500      
000873 01  WKS-S151B03SISMEN-F11  WITH LOWER-BOUNDS.                    046600      
000874     03 WKS-B03F11-FUNCION         PIC 9(02).                     046700      
000875     03 WKS-B03F11-SISTEMA         PIC 9(04).                     046800      
000876     03 WKS-B03F11-SECOKHI         PIC 9(10).                     046900      
000877                                                                  047000      
000878*=====================================================            047100      
000879*         FUNCION 12 MODIFICA EL CAMPO SECINFHI      =            047200      
000880*=====================================================            047300      
000881 01  WKS-S151B03SISMEN-F12  WITH LOWER-BOUNDS.                    047400      
000882     03 WKS-B03F12-FUNCION         PIC 9(02).                     047500      
000883     03 WKS-B03F12-SISTEMA         PIC 9(04).                     047600      
000884     03 WKS-B03F12-SECINFHI        PIC 9(10).                     047700      
000885                                                                  047800      
000886*=====================================================            047900      
000887*         FUNCION 13 MODIFICA EL CAMPO SECERRHI      =            048000      
000888*=====================================================            048100      
000889 01  WKS-S151B03SISMEN-F13  WITH LOWER-BOUNDS.                    048200      
000890     03 WKS-B03F13-FUNCION         PIC 9(02).                     048300      
000891     03 WKS-B03F13-SISTEMA         PIC 9(04).                     048400      
000892     03 WKS-B03F13-SECERRHI        PIC 9(10).                     048500      
000893                                                                  048600      
000894*=====================================================            048700      
000895*         FUNCION 14 MODIFICA EL CAMPO MODSIS        =            048800      
000896*=====================================================            048900      
000897 01  WKS-S151B03SISMEN-F14  WITH LOWER-BOUNDS.                    049000      
000898     03 WKS-B03F14-FUNCION         PIC 9(02).                     049100      
000899     03 WKS-B03F14-SISTEMA         PIC 9(04).                     049200      
000900     03 WKS-B03F14-STABDMOV        PIC 9(02).                     049300      
000901                                                                  049400      
000902*=====================================================            049500      
000903*         FUNCION 15 MODIFICA CICLO DE BASES         =            049600      
000904*=====================================================            049700      
000905 01  WKS-S151B03SISMEN-F15 WITH LOWER-BOUNDS.                     049800      
000906     03 WKS-B03F15-FUNCION         PIC 9(02).                     049900      
000907     03 WKS-B03F15-SISTEMA         PIC 9(04).                     050000      
000908     03 WKS-B03F15-AAMMANT         PIC 9(06).                     050102      
000909     03 WKS-B03F15-NOMBDMOV        PIC X(17).                     050200      
000910     03 WKS-B03F15-NUMBDMOV        PIC 9(02).                     050300      
000911     03 WKS-B03F15-AAMM            PIC 9(06).                     050402      
000912     03 WKS-B03F15-SECOK           PIC 9(10).                     050500      
000913     03 WKS-B03F15-SECINF          PIC 9(10).                     050600      
000914     03 WKS-B03F15-SECERR          PIC 9(10).                     050700      
000915     03 WKS-B03F15-STABDMOV        PIC 9(02).                     050800      
000916                                                                  050900      
000917*=====================================================            051000      
000918*         FUNCION 16 MODIFICA EL NOMBRE DE LA BASE   =            051100      
000919*=====================================================            051200      
000920 01  WKS-S151B03SISMEN-F16 WITH LOWER-BOUNDS.                     051300      
000921     03 WKS-B03F16-FUNCION         PIC 9(02).                     051400      
000922     03 WKS-B03F16-SISTEMA         PIC 9(04).                     051500      
000923     03 WKS-B03F16-AAMMANT         PIC 9(06).                     051602      
000924     03 WKS-B03F16-NOMBDMOV        PIC X(17).                     051700      
000925                                                                  051800      
000926*=====================================================            051900      
000927*         FUNCION 17 MODIFICA EL NUMERO DE LA BASE   =            052000      
000928*=====================================================            052100      
000929 01  WKS-S151B03SISMEN-F17 WITH LOWER-BOUNDS.                     052200      
000930     03 WKS-B03F17-FUNCION         PIC 9(02).                     052300      
000931     03 WKS-B03F17-SISTEMA         PIC 9(04).                     052400      
000932     03 WKS-B03F17-AAMM            PIC 9(06).                     052502      
000933     03 WKS-B03F17-NUMBDMOV        PIC 9(02).                     052600      
000934                                                                  052700      
000935*=====================================================            052800      
000936*         FUNCION 18 CAMBIA AL A@O MES.              =            052900      
000937*=====================================================            053000      
000938 01  WKS-S151B03SISMEN-F18 WITH LOWER-BOUNDS.                     053100      
000939     03 WKS-B03F18-FUNCION         PIC 9(02).                     053200      
000940     03 WKS-B03F18-SISTEMA         PIC 9(04).                     053300      
000941     03 WKS-B03F18-AAMM            PIC 9(06).                     053402      
000942     03 WKS-B03F18-AAMMNVO         PIC 9(06).                     053502      
000943                                                                  053600      
000944*=====================================================            053700      
000945*         FUNCION 19 MODIFICA EL SEC. OK DE GRAB.    =            053800      
000946*=====================================================            053900      
000947 01  WKS-S151B03SISMEN-F19 WITH LOWER-BOUNDS.                     054000      
000948     03 WKS-B03F19-FUNCION         PIC 9(02).                     054100      
000949     03 WKS-B03F19-SISTEMA         PIC 9(04).                     054200      
000950     03 WKS-B03F19-AAMM            PIC 9(06).                     054302      
000951     03 WKS-B03F19-SECOK           PIC 9(10).                     054400      
000952                                                                  054500      
000953*=====================================================            054600      
000954*         FUNCION 20 MODIFICA EL SEC. DE INF.        =            054700      
000955*=====================================================            054800      
000956 01  WKS-S151B03SISMEN-F20 WITH LOWER-BOUNDS.                     054900      
000957     03 WKS-B03F20-FUNCION         PIC 9(02).                     055000      
000958     03 WKS-B03F20-SISTEMA         PIC 9(04).                     055100      
000959     03 WKS-B03F20-AAMM            PIC 9(06).                     055202      
000960     03 WKS-B03F20-SECINF          PIC 9(10).                     055300      
000961                                                                  055400      
000962*=====================================================            055500      
000963*         FUNCION 21 MODIFICA EL SEC. DE ERROR       =            055600      
000964*=====================================================            055700      
000965 01  WKS-S151B03SISMEN-F21 WITH LOWER-BOUNDS.                     055800      
000966     03 WKS-B03F21-FUNCION         PIC 9(02).                     055900      
000967     03 WKS-B03F21-SISTEMA         PIC 9(04).                     056000      
000968     03 WKS-B03F21-AAMM            PIC 9(06).                     056102      
000969     03 WKS-B03F21-SECERR          PIC 9(10).                     056200      
000970                                                                  056300      
000971*=====================================================            056400      
000972*         FUNCION 22 MODIFICA EL STATUS DE BA B.D.   =            056500      
000973*=====================================================            056600      
000974 01  WKS-S151B03SISMEN-F22 WITH LOWER-BOUNDS.                     056700      
000975     03 WKS-B03F22-FUNCION         PIC 9(02).                     056800      
000976     03 WKS-B03F22-SISTEMA         PIC 9(04).                     056900      
000977     03 WKS-B03F22-AAMM            PIC 9(06).                     057002      
000978     03 WKS-B03F22-STABDMOV        PIC 9(02).                     057100      
000979                                                                  057200      
000980 77  W77-RESULT-LIBCON             PIC S9(11) BINARY.             057300      
000981*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000982                                                                  005400      
000983*=========================================================        005500      
000984*         VARIABLES PARA LA LIBRERIA L002/REGISTRA       =        005600      
000985*=========================================================        005700      
000986                                                                  005800      
000987 01  WKS-LIBID-L002.                                              005900      
000988     03 FILLER                     PIC X(09) VALUE "S151L002R".   006000      
000989     03 WKS-SIS-L002               PIC 9(03).                     006100      
000990                                                                  006200      
000991 01  WKS-S151-DATOS WITH LOWER-BOUNDS.                            006300      
000992     03 WKS-DEL-FUNCION            PIC 9(04).                     006400      
000993*    03 WKS-DEL-FECHA              PIC 9(06).                     006500      
000994*INICIA CODIGO DE RENOVACION CRONOS 2000                          006501      
000995     03 WKS-DEL-FECHA              PIC 9(08).                     006502      
000996*TERMINA CODIGO DE RENOVACION CRONOS 2000                         006503      
000997     03 WKS-DEL-NUMLOG             PIC 9(02).                     006600      
000998     03 WKS-DEL-PRODUCTO           PIC 9(04).                     006700      
000999     03 WKS-DEL-PROCESO            PIC 9(02).                     006800      
001000                                                                  006900      
001001 01  WKS-ERRORES.                                                 007000      
001002     03 FILLER PIC X(31) VALUE "SISTEMA NO HABILITADO EN S151  ". 007100      
001003     03 FILLER PIC X(31) VALUE "FUNCION NO VALIDA              ". 007200      
001004     03 FILLER PIC X(31) VALUE "TRANSACION NO CATALOGADA       ". 007300      
001005     03 FILLER PIC X(31) VALUE "FECHA CONTABLE NO VALIDA       ". 007400      
001006     03 FILLER PIC X(31) VALUE "FALTA LA SUCURSAL PROMOTORA    ". 007500      
001007     03 FILLER PIC X(31) VALUE "FALTA LA SUCURSAL OPERADORA    ". 007600      
001008     03 FILLER PIC X(31) VALUE "EL IMPORTE ES 0                ". 007700      
001009     03 FILLER PIC X(31) VALUE "FALTA REF S151 PARA ELIMINAR   ". 007800      
001010     03 FILLER PIC X(31) VALUE "MOVIMIENTO A ELIMINAR NO EXISTE". 007900      
001011     03 FILLER PIC X(31) VALUE "ORIGEN ERRONEO                 ". 008000      
001012     03 FILLER PIC X(31) VALUE "ELIMINANDO A REG DE ELIMINACION". 008100      
001013 01  WKS-ERRORES-R REDEFINES WKS-ERRORES.                         008200      
001014     03 WKS-ERROR PIC X(31) OCCURS 11 TIMES.                      008300      
001015                                                                  008400      
001016 77  WKS-S151-RESULT               PIC S9(11) BINARY.             008500      
001017                                                                  008600      
001018*=========================================================        008700      
001019*         VARIABLES LIBRERIA SOPORTECOMS.                =        008800      
001020*=========================================================        008900      
001021 01 WKS-DATOS-HOST.                                               009000      
001022    03 WKS-NUMCSI                  PIC 9(02).                     009100      
001023    03 WKS-NOMEQUIPO               PIC X(10).                     009200      
001024    03 WKS-NOMCSI                  PIC X(26).                     009300      
001025    03 WKS-LINEA-BATCH             PIC X(05).                     009400      
001026                                                                  009500      
001027*=========================================================        009600      
001028*         VARIABLES NOMBRE BASE DE SALDOS                =        009700      
001029*=========================================================        009800      
001030                                                                  009900      
001031 01 WKS-NOMBASE-SDO.                                              010000      
001032    02 FILLER                      PIC X(06) VALUE "(S151)".      010100      
001033    02 WKS-NOMBD                   PIC X(17).                     010200      
001034    02 FILLER                      PIC X(10) VALUE                010300      
001035       " ON CMEMP.".                                              010400      
001036*=========================================================        010500      
001037*         VARIABLES NOMBRE BASE DE SALDOS                =        010600      
001038*=========================================================        010700      
001039                                                                  010800      
001040 01 WKS-NOMBASE-HIS.                                              010900      
001041    02 FILLER                      PIC X(06) VALUE "(S151)".      011000      
001042    02 WKS-NOMBDHIS                PIC X(17).                     011100      
001043    02 FILLER                      PIC X(10) VALUE                011200      
001044       " ON CMEMP.".                                              011300      
001045*=========================================================        011400      
001046*         VARIABLES NOMBRE BASE DE MOVIMIRNTOS           =        011500      
001047*=========================================================        011600      
001048                                                                  011700      
001049 01 WKS-NOMBASE-MOV.                                              011800      
001050    02 FILLER                      PIC X(06) VALUE "(S151)".      011900      
001051    02 WKS-NOMBDMOV                PIC X(17).                     012000      
001052    02 FILLER                      PIC X(10) VALUE                012100      
001053       " ON CMEMP.".                                              012200      
001054                                                                  012300      
001055*=========================================================        012400      
001056*         VARIABLES LIBRERIA CALENDAR                    =        012500      
001057*=========================================================        012600      
001058*01  WKS-FECHA1                    PIC X(06).                     012700      
001059*INICIA CODIGO DE RENOVACION CRONOS 2000                          012701      
001060 01  WKS-FECHA1                    PIC X(08).                     012702      
001061*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012703      
001062*01  WKS-FECHA1-R  REDEFINES WKS-FECHA1 PIC 9(06).                012800      
001063*INICIA CODIGO DE RENOVATION CRONOS 2000                          012801      
001064 01  WKS-FECHA1-R  REDEFINES WKS-FECHA1 PIC 9(08).                012802      
001065*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012803      
001066*01  WKS-FECHA2                    PIC X(06).                     012900      
001067*INICIA CODIGO DE RENOVACION CRONOS 2000                          012901      
001068 01  WKS-FECHA2                    PIC X(08).                     012902      
001069*TERMINA CODIGO DE RENOVACION CRONOS 2000                         012903      
001070*01  WKS-FECHA2-R  REDEFINES WKS-FECHA2 PIC 9(06).                013000      
001071*INICIA CODIGO DE RENOVATION CRONOS 2000                          013001      
001072 01  WKS-FECHA2-R  REDEFINES WKS-FECHA2 PIC 9(08).                013002      
001073*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013003      
001074 77  W77-FORMATO                   PIC S9(11) BINARY.             013100      
001075 77  W77-FUNCION                   PIC S9(11) BINARY.             013200      
001076                                                                  013300      
001077*=========================================================        013400      
001078*         ERRORES Y MENSAJES DE DMSII                    =        013500      
001079*=========================================================        013600      
001080*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001081* COPY "S151/FORMATO/ERROR/DMSII."                                013700      
001082*       FROM 1000 TO 60000.                                       013750      
001083                                                                  001000      
001084                                                                  002000      
001085                                                                  003000      
001086*=================================================================004000      
001087*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
001088*=================================================================006000      
001089                                                                  007000      
001090                                                                  008000      
001091                                                                  009000      
001092 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
001093 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
001094 01 WKS-TAB-ERRDMSII.                                             012000      
001095    02 FILLER                      PIC X(20)     VALUE            013000      
001096    "NOTFOUND          01".                                       014000      
001097    02 FILLER                      PIC X(20)     VALUE            015000      
001098    "DUPLICATES        02".                                       016000      
001099    02 FILLER                      PIC X(20)     VALUE            017000      
001100    "DEADLOCK          03".                                       018000      
001101    02 FILLER                      PIC X(20)     VALUE            019000      
001102    "DATAERROR         04".                                       020000      
001103    02 FILLER                      PIC X(20)     VALUE            021000      
001104    "NOTLOCKED         05".                                       022000      
001105    02 FILLER                      PIC X(20)     VALUE            023000      
001106    "KEYCHANGE         06".                                       024000      
001107    02 FILLER                      PIC X(20)     VALUE            025000      
001108    "SYSTEMERROR       07".                                       026000      
001109    02 FILLER                      PIC X(20)     VALUE            027000      
001110    "READONLY          08".                                       028000      
001111    02 FILLER                      PIC X(20)     VALUE            029000      
001112    "IOERROR           09".                                       030000      
001113    02 FILLER                      PIC X(20)     VALUE            031000      
001114    "LIMITERROR        10".                                       032000      
001115    02 FILLER                      PIC X(20)     VALUE            033000      
001116    "OPENERROR         11".                                       034000      
001117    02 FILLER                      PIC X(20)     VALUE            035000      
001118    "CLOSEERROR        12".                                       036000      
001119    02 FILLER                      PIC X(20)     VALUE            037000      
001120    "NORECORD          13".                                       038000      
001121    02 FILLER                      PIC X(20)     VALUE            039000      
001122    "INUSE             14".                                       040000      
001123    02 FILLER                      PIC X(20)     VALUE            041000      
001124    "AUDITERROR        15".                                       042000      
001125    02 FILLER                      PIC X(20)     VALUE            043000      
001126    "ABORT             16".                                       044000      
001127    02 FILLER                      PIC X(20)     VALUE            045000      
001128    "SECURITYERROR     17".                                       046000      
001129    02 FILLER                      PIC X(20)     VALUE            047000      
001130    "VERSIONERROR      18".                                       048000      
001131    02 FILLER                      PIC X(20)     VALUE            049000      
001132    "FATALERROR        19".                                       050000      
001133    02 FILLER                      PIC X(20)     VALUE            051000      
001134    "INTEGRITY ERROR   20".                                       052000      
001135    02 FILLER                      PIC X(20)     VALUE            053000      
001136    "INTLIBERROR       21".                                       054000      
001137 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
001138    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
001139       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
001140       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
001141                                                                  059000      
001142 01 WKS-ERR-BD                     PIC 9(04).                     059100      
001143 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
001144                                                                  060000      
001145*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001146                                                                  013800      
001147*=========================================================        013900      
001148*         VARIABLES PARA LIBRERIA DE DESPLIEGE           =        014000      
001149*=========================================================        014100      
001150                                                                  014200      
001151*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001152* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           014300      
001153**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
001154  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
001155  01 MENSAJE-LJ.                                                  100300      
001156     02 SISTEMA-LJ     PIC X(04).                                 100400      
001157     02 FILLER         PIC X VALUE "/".                           100500      
001158     02 PASO-LJ        PIC X(04).                                 100600      
001159     02 FILLER         PIC X VALUE "/".                           100700      
001160     02 MTP-LJ         PIC 9(03).                                 100800      
001161     02 FILLER         PIC X VALUE ":".                           100900      
001162     02 TIPO-LJ        PIC X.                                     101000      
001163     02 FILLER         PIC X VALUE ">".                           101100      
001164     02 CODIGO-LJ      PIC 9(06).                                 101200      
001165     02 FILLER         PIC X VALUE "<".                           101300      
001166     02 TEXTO-LJ       PIC X(250).                                101400      
001167*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001168                                                                  014400      
001169                                                                  014500      
001170*=========================================================        014600      
001171*         PARAMETROS DE EJECUCION                        =        014700      
001172*=========================================================        014800      
001173 01  WKS-PARAM-SISTEMA             PIC 9(03).                     014900      
001174                                                                  015000      
001175 01  WKS-SAL-NOMBD11               PIC X(17).                     015100      
001176 01  WKS-SAL-NOMBD12               PIC X(17).                     015200      
001177 01  WKS-SAL-NOMBD12-INI           PIC X(17).                     015300      
001178*=========================================================        015400      
001179*         FECHA HOY Y FECHA MA@ANA                       =        015500      
001180*=========================================================        015600      
001181*01  WKS-FECHA-HOY                 PIC 9(06).                     015700      
001182*INICIA CODIGO DE RENOVACION CRONOS 2000                          015701      
001183 01  WKS-FECHA-HOY                 PIC 9(08).                     015702      
001184*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015703      
001185 01  WKS-FECHA-HOY-R REDEFINES WKS-FECHA-HOY.                     015800      
001186*    03 WKS-FECHOY-AAMM            PIC 9(04).                     015900      
001187*INICIA CODIGO DE RENOVACION CRONOS 2000                          015901      
001188     03 WKS-FECHOY-AAMM            PIC 9(06).                     015902      
001189*TERMINA CODIGO DE RENOVACION CRONOS 2000                         015903      
001190     03 WKS-FECHOY-AAMM-R REDEFINES WKS-FECHOY-AAMM.              016000      
001191*       05 WKS-FECHOY-AA           PIC 9(02).                     016100      
001192*INICIA CODIGO DE RENOVACION CRONOS 2000                          016101      
001193        05 WKS-FECHOY-AA           PIC 9(04).                     016102      
001194*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016104      
001195        05 WKS-FECHOY-MM           PIC 9(02).                     016200      
001196     03 WKS-FECHOY-DD              PIC 9(02).                     016300      
001197                                                                  016400      
001198*01  WKS-FECHA-MAN                 PIC 9(06).                     016500      
001199*INICIA CODIGO DE RENOVACION CRONOS 2000                          016501      
001200 01  WKS-FECHA-MAN                 PIC 9(08).                     016502      
001201*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016503      
001202 01  WKS-FECHA-MAN-R REDEFINES WKS-FECHA-MAN.                     016600      
001203*    03 WKS-FECMAN-AAMM            PIC 9(04).                     016700      
001204*INICIA CODIGO DE RENOVACION CRONOS 2000                          016701      
001205     03 WKS-FECMAN-AAMM            PIC 9(06).                     016702      
001206*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016703      
001207     03 WKS-FECMAN-AAMM-R REDEFINES WKS-FECMAN-AAMM.              016800      
001208*       05 WKS-FECMAN-AA           PIC 9(02).                     016900      
001209*INICIA CODIGO DE RENOVACION CRONOS 2000                          016901      
001210        05 WKS-FECMAN-AA           PIC 9(04).                     016902      
001211*TERMINA CODIGO DE RENOVACION CRONOS 2000                         016904      
001212        05 WKS-FECMAN-MM           PIC 9(02).                     017000      
001213     03 WKS-FECMAN-DD              PIC 9(02).                     017100      
001214                                                                  017200      
001215*01  WKS-FECDIA-BORRAR             PIC 9(06).                     017300      
001216*INICIA CODIGO DE RENOVACION CRONOS 2000                          017301      
001217 01  WKS-FECDIA-BORRAR             PIC 9(08).                     017302      
001218*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017303      
001219*01  WKS-FECB80-BORRAR             PIC 9(06).                     017400      
001220*INICIA CODIGO DE RENOVACION CRONOS 2000                          017401      
001221 01  WKS-FECB80-BORRAR             PIC 9(08).                     017402      
001222*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017403      
001223*01  WKS-FECMEN-BORRAR             PIC 9(06).                     017500      
001224*INICIA CODIGO DE RENOVACION CRONOS 2000                          017501      
001225 01  WKS-FECMEN-BORRAR             PIC 9(08).                     017502      
001226*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017503      
001227 01  WKS-FECMEN-BORRAR-R REDEFINES WKS-FECMEN-BORRAR.             017600      
001228*    03 WKS-FECMEN-AAMM            PIC 9(04).                     017700      
001229*INICIA CODIGO DE RENOVACION CRONOS 2000                          017701      
001230     03 WKS-FECMEN-AAMM            PIC 9(06).                     017702      
001231*TERMINA CODIGO DE RENOVACION CRONOS 2000                         017703      
001232     03 WKS-FECMEN-DD              PIC 9(02).                     017800      
001233                                                                  017900      
001234* 01  WKS-FECMEN-INST15             PIC 9(06).                    018000      
001235*INICIA CODIGO DE RENOVACION CRONOS 2000                          018001      
001236  01  WKS-FECMEN-INST15             PIC 9(08).                    018002      
001237*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018003      
001238  01  WKS-FECMEN-INST15-R REDEFINES WKS-FECMEN-INST15.            018100      
001239*     03 WKS-INST15-AAMM            PIC 9(04).                    018200      
001240*INICIA CODIGO DE RENOVACION CRONOS 2000                          018201      
001241      03 WKS-INST15-AAMM            PIC 9(06).                    018202      
001242*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018203      
001243      03 WKS-INST15-DD              PIC 9(02).                    018300      
001244                                                                  018400      
001245*01  WKS-FEC-MOVTOS                PIC 9(06).                     018500      
001246*INICIA CODIGO DE RENOVACION CRONOS 2000                          018501      
001247 01  WKS-FEC-MOVTOS                PIC 9(08).                     018502      
001248*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018503      
001249 01  WKS-FEC-MOVTOS-R REDEFINES WKS-FEC-MOVTOS.                   018600      
001250*    03 WKS-FECMOV-AAMM            PIC 9(04).                     018700      
001251*INICIA CODIGO DE RENOVACION CRRONOS 2000                         018701      
001252     03 WKS-FECMOV-AAMM            PIC 9(06).                     018702      
001253*TERMINA CODIGO DE RENOVACION CRONOS 2000                         018703      
001254     03 WKS-FECMOV-DD              PIC 9(02).                     018800      
001255 01  WKS-ESPACIOS                  PIC X(17) VALUE SPACES.        018900      
001256 01  WKS-NULOS                     PIC X(17).                     019000      
001257                                                                  019100      
001258*=========================================================        019200      
001259*         VARIABLES DE WORKING PARA ALGUNOS DATASETS     =        019300      
001260*         DE LA BASE DE SALDOS                           =        019400      
001261*=========================================================        019500      
001262                                                                  019600      
001263 01  WKS-B20-MENCON.                                              021200      
001264     03 WKS-B20-KEYAM              PIC 9(06) COMP.                021300      
001265     03 WKS-B20-KEYCON             PIC 9(20) COMP.                021400      
001266     03 WKS-B20-KEYPRD             PIC 9(04) COMP.                021500      
001267     03 WKS-B20-KEYINS             PIC 9(04) COMP.                021600      
001268     03 WKS-B20-KEYMON             PIC 9(04) COMP.                021700      
001269     03 WKS-B20-SUCPRO             PIC 9(04) COMP.                021800      
001270     03 WKS-B20-STAMOV             PIC 9(02) COMP.                021900      
001271     03 WKS-B20-APUIMP             PIC 9(02) COMP.                022000      
001272     03 WKS-B20-FILLER             PIC X(14).                     022100      
001273     03 WKS-B20-SALDOS OCCURS 10 TIMES.                           022200      
001274        05 WKS-B20-NUMMOV          PIC 9(08) COMP.                022300      
001275        05 WKS-B20-SD              PIC S9(13)V9(02) COMP.         022400      
001276                                                                  022500      
001277     01  WKS-B21-MENCON.                                          022600      
001278         03 WKS-B21-KEYAM              PIC 9(06) COMP.            022700      
001279         03 WKS-B21-KEYCON             PIC 9(20) COMP.            022800      
001280         03 WKS-B21-KEYPRD             PIC 9(04) COMP.            022900      
001281         03 WKS-B21-KEYINS             PIC 9(04) COMP.            023000      
001282         03 WKS-B21-KEYIND             PIC 9(04) COMP.            023100      
001283         03 FILLER                     PIC X(06).                 023200      
001284         03 WKS-B21-SALDOS OCCURS 12 TIMES.                       023300      
001285            05 WKS-B21-NUMMOV          PIC 9(08) COMP.            023400      
001286            05 WKS-B21-SD              PIC S9(13)V9(02) COMP.     023500      
001287                                                                  027200      
001288 01  WKS-B70-POSICION.                                            027300      
001289     03 WKS-B70-KEYCSI             PIC 9(04) COMP.                027400      
001290*    03 WKS-B70-KEYFEC             PIC 9(06) COMP.                027500      
001291*INICIA CODIGO DE RENOVACION CRONOS 2000                          027501      
001292     03 WKS-B70-KEYFEC             PIC 9(08) COMP.                027502      
001293*TERMINA CODIGO DE RENOVACION CRONOS 2000                         027503      
001294     03 WKS-B70-KEYPRD             PIC 9(04) COMP.                027600      
001295     03 WKS-B70-KEYINS             PIC 9(04) COMP.                027700      
001296     03 WKS-B70-KEYMON             PIC 9(04) COMP.                027800      
001297     03 WKS-B70-APUIMP             PIC 9(02) COMP.                027900      
001298     03 WKS-B70-FILLER             PIC X(16).                     028000      
001299     03 WKS-B70-SDO                OCCURS 10 TIMES.               028100      
001300        05 WKS-B70-CNTMOV          PIC 9(10) COMP.                028200      
001301        05 WKS-B70-SD              PIC S9(15)V9(02) COMP.         028300      
001302                                                                  028400      
001303 01  WKS-B71-POSDIAAD1.                                           028500      
001304     03 WKS-B71-KEYCSI             PIC 9(02) COMP.                028600      
001305*    03 WKS-B71-KEYFEC             PIC 9(06) COMP.                028700      
001306*INICIA CODIGO DE RENOVACION CRONOS 2000                          028701      
001307     03 WKS-B71-KEYFEC             PIC 9(08) COMP.                028702      
001308*TERMINA CODIGO DE RENOVACION CRONOS 2000                         028703      
001309     03 WKS-B71-KEYPRD             PIC 9(04) COMP.                028800      
001310     03 WKS-B71-KEYINS             PIC 9(04) COMP.                028900      
001311     03 WKS-B71-KEYMON             PIC 9(04) COMP.                029000      
001312     03 WKS-B71-KEYIND             PIC 9(04) COMP.                029100      
001313     03 WKS-B71-SDO                OCCURS 12 TIMES.               029200      
001314        05 WKS-B71-CNTMOV          PIC 9(08) COMP.                029300      
001315        05 WKS-B71-SD              PIC S9(15)V9(02) COMP.         029400      
001316                                                                  029500      
001317 01  WKS-HIS-SEC                   PIC 9(12).                     029600      
001318 01  WKS-MOV-SEC                   PIC 9(12).                     029700      
001319                                                                  029800      
001320*==========================================================       029900      
001321*         VARIABLE DE RESULTADO DE LA FUNCION             =       030000      
001322*==========================================================       030100      
001323                                                                  030200      
001324 77  W77-NUMCON-B21                PIC 9(03).                     030300      
001325 77  W77-BORRA-DIA1                PIC 9(02).                     030400      
001326 77  W77-BORRA-DIA2                PIC 9(02).                     030500      
001327 77  W77-BORRA-DIA3                PIC 9(02).                     030600      
001328 77  W77-MESES-INST15              PIC 9(03).                     030700      
001329 77  W77-ABRE-SDO                  PIC 9(01).                     030800      
001330 77  W77-ABRE-MOV                  PIC 9(01).                     030900      
001331 77  W77-FUN-CALE                  PIC 9(02).                     031100      
001332 77  W77-SW-B02                    PIC 9(01).                     031200      
001333 77  W77-SW-B03                    PIC 9(01).                     031300      
001334 77  W77-SW-B04                    PIC 9(01).                     031400      
001335 77  W77-NUMDIA-HOY                PIC 9(01).                     031500      
001336 77  W77-NUMDIA-MAN                PIC 9(01).                     031600      
001337 77  W77-RES-LIBCTL                PIC S9(11) BINARY.             031700      
001338 77  W77-ERR-CALE                  PIC 9(02).                     031800      
001339 77  W77-ERR-LIBCTL                PIC 9(02).                     031900      
001340 77  W77-EOF                       PIC 9(02).                     032000      
001341 77  W77-EOF-ADI                   PIC 9(02).                     032100      
001342 77  W77-EOF-B21                   PIC 9(02).                     032200      
001343 77  W77-ERROR-B21                 PIC 9(02).                     032300      
001344 77  W77-EOF-B71                   PIC 9(02).                     032400      
001345 77  W77-IND                       PIC 9(04).                     032500      
001346 77  W77-IND-MOV                   PIC 9(03).                     032600      
001347 77  W77-APUIMP                    PIC 9(02).                     032700      
001348 77  W77-NUM-APUIMP                PIC 9(02).                     032800      
001349 77  W77-NUMMAX-APUIMP             PIC 9(02).                     032900      
001350*77  W77-AAMM-MENOR                PIC 9(04).                     033000      
001351*INICIA CODIGO DE RENOVACION CRONOS 2000                          033001      
001352 77  W77-AAMM-MENOR                PIC 9(06).                     033002      
001353*TERMINA CODIGO DE RENOVACION CRONOS 2000                         033003      
001354 77  W77-IND-INICIALIZA            PIC 9(04).                     033100      
001355 77  W77-SUC-ANT                   PIC 9(04).                     033200      
001356 77  W77-ENCONTRADO                PIC 9(02).                     033300      
001357**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                033304      
001358 77  W77-ERROR                     PIC 9(02).                     033308      
001359**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                033312      
001360                                                                  033400      
001361*=================================================================033500      
001362*         INICIA PROCEDURE DIVISION                              =033600      
001363*=================================================================033700      
001364                                                                  033800      
001365 PROCEDURE DIVISION USING WKS-PARAM-SISTEMA,                      033810      
001366                          WKS-SAL-NOMBD11  ,                      033820      
001367                          WKS-SAL-NOMBD12  ,                      033830      
001368                          WKS-SAL-NOMBD12-INI.                    033840      
001369                                                                  033850      
001370 01-0000-INICIO.                                                  033860      
001371*=============                                                    033900      
001372     PERFORM 01-0100-LIBRERIAS.                                   034600      
001373     MOVE WKS-PARAM-SISTEMA        TO WKS-SIS-BACK2               034651      
001374                                      WLI-RB-E3-SISTEMA2.         034671      
001375     MOVE "DIARIO"                 TO WLI-RB-E2-TIPO-PROC2.       034691      
001376                                                                  034696      
001377     MOVE 0151                     TO SISTEMA-LJ.                 034700      
001378     MOVE 0197                     TO PASO-LJ.                    034800      
001379     MOVE "P197"                   TO WKS-PASO-BACK2              034851      
001380                                      WLI-RB-E1-PASO.             034871      
001381*    MOVE 005                      TO MTP-LJ                      034900      
001382     MOVE 001                      TO MTP-LJ                      034910      
001383*    MOVE "I"                      TO WLI-TIPO-LJ.                035000      
001384*    MOVE 020101                   TO CODIGO-LJ.                  035100      
001385*    MOVE "INICIO PROCESO"         TO WLI-TEXTO-LJ.               035200      
001386*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     035300      
001387*                                MENSAJE-LJ.                      035400      
001388                                                                  035500      
001389     IF WKS-PARAM-SISTEMA > 0                                     035600      
001390        PERFORM 01-00300-PROYECTA-FECHAS                          035700      
001391        PERFORM 01-0190-L001-B03                                  035800      
001392        PERFORM 01-0110-FECHA-MOVTOS                              035900      
001393        PERFORM 01-0200-CHECA-BASES                               036000      
001394**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                036004      
001395        PERFORM 01-00200-VERIFICA-B05                             036008      
001396**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                036012      
001397        IF WKS-FECHOY-AAMM = WKS-FECMAN-AAMM                      036100      
001398           PERFORM 01-0310-PROCESO-DIARIO                         036200      
001399           IF WKS-PARAM-SISTEMA = 84                              036300      
001400              MOVE SPACES          TO WKS-SAL-NOMBD12-INI         036400      
001401           ELSE                                                   036500      
001402              NEXT SENTENCE                                       036600      
001403        ELSE                                                      036700      
001404           PERFORM 01-0310-PROCESO-DIARIO                         036800      
001405           PERFORM 01-0476-LIMPIA-CUENTA                          036810      
001406           IF WKS-B03-STABDSAL = 99 OR 1                          036820      
001407              NEXT SENTENCE                                       036840      
001408           ELSE                                                   036860      
001409              PERFORM 01-0400-PROCESO-MENSUAL                     036900      
001410     ELSE                                                         037000      
001411        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          037051      
001412        MOVE "E"                   TO TIPO-LJ                     037100      
001413        MOVE 051001                TO CODIGO-LJ                   037200      
001414        MOVE "EL NUMERO DE SISTEMA DEBE DE SER MAYOR A CERO"      037300      
001415                                   TO TEXTO-LJ                    037400      
001416        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   037451      
001417        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  037471      
001418        PERFORM  000-030-IMPRIME-MENSAJE                          037491      
001419        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                  037500      
001420                                    MENSAJE-LJ                    037600      
001421        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  037700      
001422                                                                  037800      
001423     PERFORM 01-0230-CIERRA-BASES.                                037900      
001424*     PERFORM 01-0150-GRABA-FEC151.                               038000      
001425                                                                  038100      
001426      IF WKS-B03-STABDSAL = 99 OR 1                               038200      
001427         NEXT SENTENCE                                            038300      
001428      ELSE                                                        038400      
001429         PERFORM 01-0160-GRABA-STABDSAL.                          038500      
001430     PERFORM 01-0150-GRABA-FEC151.                                038550      
001431     PERFORM 01-00220-ACTUALIZA-B05.                              038552      
001432     CLOSE V00-REPORTE2.                                          038555      
001433     PERFORM 01-0170-LEVANTA-L002.                                038600      
001434                                                                  038700      
001435*    MOVE "I"                      TO WLI-TIPO-LJ.                038800      
001436*    MOVE 020201                   TO CODIGO-LJ.                  038900      
001437*    MOVE "TERMINACION NORNAL DE PROCESO"                         039000      
001438*                                  TO WLI-TEXTO-LJ.               039100      
001439*    CALL "LJ IN LIB-DISP" USING CONTADOR-LJ,                     039200      
001440*                                MENSAJE-LJ.                      039300      
001441*     CLOSE V00-REPORTE2.                                         039351      
001442**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                039355      
001443*     PERFORM 01-00220-ACTUALIZA-B05.                             039359      
001444**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                039363      
001445     STOP RUN.                                                    039400      
001446                                                                  039500      
001447 01-0100-PROCEDURE-DISPLAY.                                       039551      
001448*==========================                                       039561      
001449                                                                  039571      
001450*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001451*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY.".               039581      
001452                                                                  000100      
001453*===============================================================* 000200      
001454*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
001455*         PARA LLAMADO DE DISPLAY                               * 000400      
001456*===============================================================* 000500      
001457                                                                  000600      
001458     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
001459            TO BYFUNCTION.                                        000671      
001460                                                                  000691      
001461     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
001462          USING WKS-DATE-ARRAY2.                                  000800      
001463     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
001464     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
001465     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
001466     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
001467     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
001468     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
001469                                                                  001300      
001470     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
001471     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
001472     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
001473                               WKS-TIT-REPORTE2.                  001700      
001474*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
001475*                                  GIVING WKS-COMPILA2.           001900      
001476*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
001477*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
001478*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
001479*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
001480                                                                  002066      
001481*    IF WKS-AAA-VERSION2  < 50                                    002071      
001482*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
001483*    ELSE                                                         002081      
001484*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
001485                                                                  002091      
001486                                                                  002500      
001487*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
001488     OPEN OUTPUT V00-REPORTE2.                                    002700      
001489     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
001490     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
001491                                                                  003000      
001492 000-050-CHECA-SALTO-HOJA2.                                       003051      
001493*==========================                                       003071      
001494    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
001495     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
001496        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
001497     ELSE                                                         003079      
001498        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
001499     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
001500     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
001501     MOVE "/"                     TO WKS-SLASH1.                  003086      
001502     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
001503     MOVE "/"                     TO WKS-SLASH2.                  003088      
001504     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
001505     IF  WKS-NUM-LINEAS2 > 56                                     003091      
001506         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
001507         ADD 1                   TO    W77-CONT-HOJA2             003200      
001508         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
001509         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
001510         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
001511         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
001512         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
001513         MOVE SPACES             TO V00-R00-REPORTE2              003800      
001514         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
001515         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
001516                                                                  004100      
001517 000-030-IMPRIME-MENSAJE.                                         004200      
001518*========================                                         004300      
001519*LP                                                               004400      
001520     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
001521     ADD             2       TO WKS-NUM-LINEAS2                   004600      
001522     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
001523                                                                  004800      
001524*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001525                                                                  039591      
001526 01-0100-LIBRERIAS.                                               039600      
001527*==================                                               039700      
001528     CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.039800      
001529     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               039900      
001530                                   TO "SOPORTECOMS".              040000      
001531                                                                  040100      
001532     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVER" TO BYFUNCTION.     040200      
001533     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVER" TO "CTLVERS".      040300      
001534     MOVE "S151L001CTL"            TO WKS-LIBID.                  040400      
001535     CALL "DAME_TIT IN CTLVER"  USING  WKS-LIBID, WKS-NOMBLIB     040500      
001536                                GIVING W77-ERR-CTLVER.            040600      
001537     IF W77-ERR-CTLVER = 0                                        040700      
001538        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO WKS-NOMBLIB    040800      
001539     ELSE                                                         040900      
001540        CHANGE ATTRIBUTE TITLE OF "LIB-CONTROL" TO                041000      
001541               "(S151)S151/OBJECT/L001/LIBCONTROL ON CMEMP".      041100      
001542                                                                  041200      
001543     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      041300      
001544           "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".        041400      
001545                                                                  041500      
001546     CHANGE ATTRIBUTE LIBACCESS    OF "LOCSUP" TO BYFUNCTION.     041600      
001547     CHANGE ATTRIBUTE FUNCTIONNAME OF "LOCSUP" TO "LOCSUP".       041620      
001548                                                                  041640      
001549     CANCEL "CTLVER".                                             041700      
001550                                                                  041800      
001551 01-0110-FECHA-MOVTOS.                                            041900      
001552*=====================                                            042000      
001553     MOVE 10                       TO W77-FUNCION                 042100      
001554                                      W77-FUN-CALE.               042200      
001555     MOVE WKS-FECHA-HOY            TO WKS-FECHA1                  042300      
001556                                      WKS-FEC-MOVTOS.             042350      
001557*    MOVE "000007"                 TO WKS-FECHA2.                 042400      
001558*INICIA CODIGO DE RENOVACION CRONOS 2000                          042401      
001559     MOVE "00000030"               TO WKS-FECHA2.                 042402      
001560*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042403      
001561*    MOVE 3                        TO W77-FORMATO.                042500      
001562*INICIA CODIGO DE RENOVACION CRONOS 2000                          042501      
001563     MOVE 13                       TO W77-FORMATO.                042502      
001564*TERMINA CODIGO DE RENOVACION CRONOS 2000                         042503      
001565     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              042600      
001566                                      WKS-FECHA1 ,                042700      
001567                                      WKS-FECHA2 ,                042800      
001568                                      W77-FORMATO.                042900      
001569     IF W77-FUNCION > 0                                           043000      
001570        PERFORM 01-0900-ERROR-CALE.                               043100      
001571     MOVE WKS-FECHA1            TO WKS-FECDIA-BORRAR.             043300      
001572                                                                  043400      
001573     MOVE 22                       TO W77-FUNCION                 043500      
001574                                      W77-FUN-CALE.               043600      
001575     MOVE WKS-FECHA-HOY            TO WKS-FECHA1.                 043700      
001576                                                                  043800      
001577     IF WKS-B03-NUMCICDIA = 0                                     043900      
001578*        MOVE "000001"              TO WKS-FECHA2                 044000      
001579*INICIA CODIGO DE RENOVACION CRONOS 2000                          044001      
001580         MOVE "00000001"            TO WKS-FECHA2                 044002      
001581*TERMINA CODIGO DE RENOVACION CRONOS 2000                         044003      
001582     ELSE                                                         044100      
001583        MOVE WKS-B03-NUMCICDIA     TO WKS-FECHA2-R.               044200      
001584*    MOVE 3                        TO W77-FORMATO.                044300      
001585*INICIA CODIGO DE RENOVACION CRONOS 2000                          044301      
001586     MOVE 13                       TO W77-FORMATO.                044302      
001587*TERMINA CODIGO DE RENOVACION CRONOS 2000                         044303      
001588     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              044400      
001589                                      WKS-FECHA1 ,                044500      
001590                                      WKS-FECHA2 ,                044600      
001591                                      W77-FORMATO.                044700      
001592     IF W77-FUNCION > 0                                           044800      
001593        PERFORM 01-0900-ERROR-CALE.                               044900      
001594                                                                  045000      
001595     MOVE WKS-FECHA1               TO WKS-FECB80-BORRAR.          045100      
001596                                                                  045200      
001597 01-0150-GRABA-FEC151.                                            045300      
001598*=======================                                          045400      
001599     MOVE 11                       TO WKS-B01F11-FUNCION.         045500      
001600     MOVE WKS-PARAM-SISTEMA        TO WKS-B01F11-SISTEMA.         045600      
001601     MOVE WKS-NUMCSI               TO WKS-B01F11-CSI.             045700      
001602     MOVE WKS-FECHA-MAN            TO WKS-B01F11-FECPRO151.       045800      
001603     CALL "CONSISDIA IN LIB-CONTROL" USING WKS-CONSISDIA-F11      045900      
001604                                     GIVING W77-RES-LIBCTL.       046000      
001605     IF W77-RES-LIBCTL = 0                                        046100      
001606        NEXT SENTENCE                                             046200      
001607     ELSE                                                         046300      
001608        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          046351      
001609        MOVE "O"                   TO TIPO-LJ                     046400      
001610        MOVE 051001                TO CODIGO-LJ                   046500      
001611        MOVE W77-RES-LIBCTL        TO W77-ERR-LIBCTL              046600      
001612        MOVE "ERROR AL GRABAR LA FECHA S151 EN BASE DE CONTROL"   046700      
001613                                   TO TEXTO-LJ                    047000      
001614        MOVE TIPO-LJ   TO  WLI-TIPO-LJ                            047051      
001615        MOVE TEXTO-LJ  TO  WLI-TEXTO-LJ                           047071      
001616        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   047100      
001617                                    MENSAJE-LJ                    047200      
001618        PERFORM  000-030-IMPRIME-MENSAJE                          047251      
001619        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  047300      
001620                                                                  047400      
001621 01-0160-GRABA-STABDSAL.                                          047500      
001622*=======================                                          047600      
001623     MOVE 9                        TO WKS-B03F09-FUNCION.         047700      
001624     MOVE WKS-PARAM-SISTEMA        TO WKS-B03F09-SISTEMA.         047800      
001625     MOVE 1                        TO WKS-B03F09-STABDSAL.        047900      
001626     CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN-F09 048000      
001627                                     GIVING W77-RESULT-LIBCON.    048100      
001628     IF W77-RESULT-LIBCON > 0                                     048200      
001629        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          048251      
001630        MOVE "O"                   TO TIPO-LJ                     048271      
001631        MOVE 051001                TO CODIGO-LJ                   048300      
001632        MOVE W77-RES-LIBCTL        TO W77-ERR-LIBCTL              048400      
001633        STRING "ERROR " W77-ERR-LIBCTL                            048500      
001634               " AL GRABAR EL ESTATUS EN BASE DE CONTROL"         048600      
001635        DELIMITED BY SIZE                                         048700      
001636        INTO TEXTO-LJ                                             048800      
001637        MOVE TIPO-LJ           TO  WLI-TIPO-LJ                    048851      
001638        MOVE TEXTO-LJ          TO  WLI-TEXTO-LJ                   048871      
001639        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   048900      
001640                                    MENSAJE-LJ                    049000      
001641        PERFORM  000-030-IMPRIME-MENSAJE                          049051      
001642        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  049100      
001643                                                                  049200      
001644 01-0170-LEVANTA-L002.                                            049300      
001645*=====================                                            049400      
001646     MOVE WKS-PARAM-SISTEMA        TO WKS-SIS-L002.               049500      
001647     MOVE WKS-LIBID-L002           TO WKS-LIBID.                  049600      
001648     CALL "DAME_TIT IN CTLVER"     USING  WKS-LIBID,              049700      
001649                                          WKS-NOMBLIB             049800      
001650                                   GIVING W77-ERR-CTLVER.         049900      
001651     IF W77-ERR-CTLVER = 0                                        050000      
001652        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO WKS-NOMBLIB      050100      
001653     ELSE                                                         050200      
001654        CHANGE ATTRIBUTE TITLE  OF "LIB-L002" TO                  050300      
001655         "(S151)S151/OBJECT/L002/REGISTRA ON CMEMP".              050400      
001656     MOVE 0025                     TO WKS-DEL-FUNCION.            050500      
001657     CALL "CONTROLES IN LIB-L002" USING  WKS-S151-DATOS           050600      
001658                                  GIVING WKS-S151-RESULT.         050700      
001659                                                                  050800      
001660*    IF WKS-S151-RESULT > 0                                       050900      
001661*       MOVE 051001                TO CODIGO-LJ                   051000      
001662*       MOVE "I"                   TO WLI-TIPO-LJ                 051100      
001663*       STRING WKS-ERROR(WKS-S151-RESULT)                         051200      
001664*              "EN LLAMADO A L002"                                051300      
001665*       DELIMITED BY SIZE                                         051400      
001666*       INTO WLI-TEXTO-LJ                                         051500      
001667*       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   051600      
001668*                                   MENSAJE-LJ.                   051700      
001669                                                                  051800      
001670 01-0190-L001-B03.                                                051900      
001671*=================                                                052000      
001672     MOVE 1                        TO WKS-B03-FUNCION.            052100      
001673     MOVE WKS-PARAM-SISTEMA        TO WKS-B03-SISTEMA.            052200      
001674     CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN     052300      
001675                                     GIVING W77-RES-LIBCTL.       052400      
001676     IF W77-RES-LIBCTL = 0                                        052500      
001677        NEXT SENTENCE                                             052600      
001678     ELSE                                                         052700      
001679        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          052751      
001680        MOVE "O"                   TO TIPO-LJ                     052800      
001681        MOVE 051001                TO CODIGO-LJ                   052900      
001682        MOVE "ERROR EL LIB-CONTROL SOBRE S151B03SISMEN"           053000      
001683                                   TO TEXTO-LJ                    053100      
001684        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   053151      
001685        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  053171      
001686        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   053200      
001687                                      MENSAJE-LJ                  053300      
001688        PERFORM  000-030-IMPRIME-MENSAJE                          053351      
001689        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                  053400      
001690                                                                  053500      
001691 01-0200-CHECA-BASES.                                             053600      
001692*====================                                             053700      
001693     IF WKS-B03-TIPBD = 0   OR                                    053800      
001694        (WKS-B03-MODSIS > 0 AND                                   053900      
001695         WKS-B03-RESCSI NOT EQUAL TO WKS-NUMCSI)                  054000      
001696        MOVE SPACES                TO WKS-SAL-NOMBD11             054100      
001697                                      WKS-SAL-NOMBD12             054200      
001698                                      WKS-SAL-NOMBD12-INI         054300      
001699     ELSE                                                         054400      
001700     IF WKS-B03-STABDSAL = 99 OR 1                                054500      
001701        MOVE WKS-B03-NOMBDSAL      TO WKS-SAL-NOMBD11             054600      
001702        PERFORM 01-0210-ABRE-SALDOS                               054650      
001703        PERFORM 01-0225-BUSCA-BASE                                054700      
001704                VARYING W77-IND FROM 1 BY 1                       054800      
001705                UNTIL   W77-IND > WKS-B03-NUMCICDIA OR            054900      
001706                        W77-ENCONTRADO = 1                        055000      
001707        IF W77-ENCONTRADO = 1                                     055100      
001708           MOVE WKS-B03-NOMBDMOV(W77-IND-MOV)                     055200      
001709                                   TO WKS-SAL-NOMBD12             055300      
001710                                      WKS-SAL-NOMBD12-INI         055400      
001711        ELSE                                                      055500      
001712           MOVE SPACES             TO WKS-SAL-NOMBD12             055600      
001713                                      WKS-SAL-NOMBD12-INI         055700      
001714     ELSE                                                         055800      
001715     IF WKS-B03-STABDSAL = 5                                      055900      
001716        MOVE 1                     TO WKS-B04-FUNCION             056000      
001717        MOVE WKS-PARAM-SISTEMA     TO WKS-B04-SISTEMA             056100      
001718        MOVE ZERO                  TO WKS-B04-PRODUCTO            056200      
001719                                      WKS-B04-INSTRUM             056300      
001720        CALL "B04SISTEM IN LIB-CONTROL" USING  WKS-B04SISTEMA     056400      
001721                                        GIVING W77-RES-LIBCTL     056500      
001722        IF W77-RES-LIBCTL = 0                                     056600      
001723           IF WKS-B04-ESTATUS = 3                                 056700      
001724              IF WKS-B03-TIPBD = 2                                056800      
001725                 PERFORM 01-0210-ABRE-SALDOS                      056900      
001726              ELSE                                                057000      
001727              IF WKS-B03-TIPBD = 5                                057100      
001728                 PERFORM 01-0210-ABRE-SALDOS                      057200      
001729                 PERFORM 01-0220-ABRE-MOVTOS                      057300      
001730              ELSE                                                057400      
001731              IF WKS-B03-TIPBD = 4                                057500      
001732                 NEXT SENTENCE                                    057600      
001733              ELSE                                                057700      
001734              IF WKS-B03-TIPBD = 7                                057800      
001735                 PERFORM 01-0220-ABRE-MOVTOS                      057900      
001736              ELSE                                                058100      
001737              IF WKS-B03-TIPBD = 6                                058200      
001738                 PERFORM 01-0210-ABRE-SALDOS                      058300      
001739              ELSE                                                058500      
001740              IF WKS-B03-TIPBD = 1                                058600      
001741                 PERFORM 01-0210-ABRE-SALDOS                      058700      
001742                 PERFORM 01-0220-ABRE-MOVTOS                      058900      
001743              ELSE                                                059000      
001744                 IF WKS-B03-TIPBD = 0                             059100      
001745                    NEXT SENTENCE                                 059200      
001746                 ELSE                                             059300      
001747          MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ        059351      
001748                    MOVE "I"    TO TIPO-LJ                        059400      
001749                    MOVE 051001 TO CODIGO-LJ                      059500      
001750                    MOVE "CONFIGURACION DE BASES INVALIDA"        059600      
001751                                TO TEXTO-LJ                       059700      
001752                    MOVE TIPO-LJ        TO      WLI-TIPO-LJ       059751      
001753                    MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ      059771      
001754                    PERFORM  000-030-IMPRIME-MENSAJE              059791      
001755*                   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ       059800      
001756*                                               MENSAJE-LJ        059900      
001757           ELSE                                                   060000      
001758              MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ    060051      
001759              MOVE "I"          TO TIPO-LJ                        060100      
001760              MOVE 051001       TO CODIGO-LJ                      060200      
001761              MOVE "ESQUEMA INVALIDO PARA ESTE SISTEMA"           060300      
001762                                TO TEXTO-LJ                       060400      
001763              MOVE TIPO-LJ        TO      WLI-TIPO-LJ             060451      
001764              MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ            060471      
001765              PERFORM  000-030-IMPRIME-MENSAJE                    060491      
001766              CALL "LJ IN LIB-DISP" USING CONTADOR-LJ             060500      
001767                                          MENSAJE-LJ              060600      
001768        ELSE                                                      060800      
001769           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       060851      
001770           MOVE "I"                TO TIPO-LJ                     060900      
001771           MOVE 051001             TO CODIGO-LJ                   061000      
001772           MOVE W77-RES-LIBCTL     TO W77-ERR-LIBCTL              061100      
001773           STRING "ERROR " W77-ERR-LIBCTL                         061200      
001774                  " EN LIBCTL B04SISTEM"                          061300      
001775           DELIMITED BY SIZE                                      061400      
001776           INTO TEXTO-LJ                                          061500      
001777           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                061551      
001778           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               061571      
001779           PERFORM  000-030-IMPRIME-MENSAJE                       061591      
001780           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                061600      
001781                                       MENSAJE-LJ                 061700      
001782           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                061800      
001783        ELSE                                                      061900      
001784           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       061951      
001785           MOVE "I"                TO TIPO-LJ                     062000      
001786           MOVE 051001             TO CODIGO-LJ                   062100      
001787           MOVE "ESTATUS DE PROYECCION INVALIDO EN BASE DE SALDOS"062200      
001788                                   TO TEXTO-LJ                    062300      
001789           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                062351      
001790           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               062371      
001791           PERFORM  000-030-IMPRIME-MENSAJE                       062391      
001792           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                062400      
001793                                       MENSAJE-LJ                 062500      
001794           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               062600      
001795                                                                  062700      
001796 01-0210-ABRE-SALDOS.                                             062800      
001797*===================                                              062900      
001798     MOVE ZERO                     TO W77-ABRE-SDO.               063000      
001799     MOVE LOW-VALUES               TO WKS-NULOS.                  063100      
001800     IF WKS-B03-NOMBDSAL = WKS-ESPACIOS OR                        063200      
001801        WKS-B03-NOMBDSAL = WKS-NULOS                              063300      
001802        MOVE ZERO                  TO W77-ABRE-SDO                064000      
001803     ELSE                                                         064100      
001804        MOVE WKS-B03-NOMBDSAL      TO WKS-NOMBD                   064200      
001805                                      WKS-SAL-NOMBD11             064300      
001806        MOVE 1                        TO W77-ABRE-SDO             064350      
001807        CHANGE ATTRIBUTE TITLE  OF BASESDO TO WKS-NOMBASE-SDO     064400      
001808        OPEN UPDATE  BASESDO                                      064500      
001809          ON EXCEPTION                                            064600      
001810             MOVE ZERO             TO W77-ABRE-SDO                064700      
001811             PERFORM 900000-CHE-STA                               064800      
001812             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             064900      
001813                                                                  067400      
001814 01-0220-ABRE-MOVTOS.                                             067500      
001815*====================                                             067600      
001816     MOVE ZERO                     TO W77-ABRE-MOV.               067700      
001817     MOVE ZERO                     TO W77-ENCONTRADO.             067800      
001818     PERFORM 01-0225-BUSCA-BASE                                   067900      
001819             VARYING W77-IND FROM 1 BY 1                          068000      
001820             UNTIL   W77-IND > WKS-B03-NUMCICDIA OR               068100      
001821                     W77-ENCONTRADO = 1.                          068200      
001822     IF W77-ENCONTRADO = 0                                        068300      
001823        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          068351      
001824        MOVE "I"                   TO TIPO-LJ                     068400      
001825        MOVE 050110                TO CODIGO-LJ                   068500      
001826        STRING "NO EXISTE BASE DE MOVIMIENTOS "                   068600      
001827               WKS-FECMEN-AAMM                                    068700      
001828        DELIMITED BY SIZE                                         068800      
001829        INTO TEXTO-LJ                                             068900      
001830        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   068951      
001831        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  068971      
001832        PERFORM  000-030-IMPRIME-MENSAJE                          068991      
001833*       CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   069000      
001834*                                   MENSAJE-LJ                    069100      
001835     ELSE                                                         069200      
001836        MOVE 1                     TO W77-ABRE-MOV                069300      
001837        MOVE WKS-B03-NOMBDMOV(W77-IND-MOV)                        069400      
001838                                   TO WKS-NOMBDMOV                069500      
001839                                      WKS-SAL-NOMBD12             069600      
001840                                      WKS-SAL-NOMBD12-INI         069700      
001841        CHANGE ATTRIBUTE TITLE OF BASEMOV TO WKS-NOMBASE-MOV      069800      
001842        OPEN UPDATE BASEMOV                                       069900      
001843          ON EXCEPTION                                            070000      
001844             MOVE ZERO             TO W77-ABRE-MOV                070100      
001845             PERFORM 900000-CHE-STA.                              070200      
001846                                                                  070400      
001847 01-0225-BUSCA-BASE.                                              070500      
001848*===================                                              070600      
001849     IF WKS-B03-AAMM(W77-IND) = WKS-FECMOV-AAMM                   070700      
001850        MOVE 1                     TO W77-ENCONTRADO              070800      
001851        MOVE W77-IND               TO W77-IND-MOV.                070900      
001852                                                                  071000      
001853 01-0230-CIERRA-BASES.                                            071100      
001854*=====================                                            071200      
001855     IF W77-ABRE-SDO = 1                                          071300      
001856        CLOSE BASESDO ON EXCEPTION NEXT SENTENCE.                 071400      
001857                                                                  071500      
001858     IF W77-ABRE-MOV = 1                                          071600      
001859        CLOSE BASEMOV ON EXCEPTION NEXT SENTENCE.                 071700      
001860                                                                  071800      
001861 01-00300-PROYECTA-FECHAS.                                        072200      
001862*=========================                                        072300      
001863     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOS-HOST.            072400      
001864     CANCEL "SOPORTECOMS".                                        072500      
001865     MOVE 1                        TO WKS-B01-FUNCION.            072600      
001866     MOVE WKS-PARAM-SISTEMA        TO WKS-B01-SISTEMA.            072700      
001867     MOVE WKS-NUMCSI               TO WKS-B01-CSI                 072800      
001868                                      WKS-TR-CSI2.                072851      
001869     CALL "CONSISDIA IN LIB-CONTROL" USING  WKS-S151B01SISDIA     072900      
001870                                     GIVING W77-RES-LIBCTL.       073000      
001871     IF W77-RES-LIBCTL = 0                                        073100      
001872        MOVE WKS-B01-FECPRO151     TO WKS-FECHA-HOY               073200      
001873                                      WLI-RB-E1-FECHA-INF2        073251      
001874                                      WKS-FECHA1                  073300      
001875        PERFORM   01-0100-PROCEDURE-DISPLAY                       073351      
001876        MOVE "00000001"            TO WKS-FECHA2                  073400      
001877        MOVE 13                    TO W77-FUNCION                 073500      
001878                                      W77-FUN-CALE                073600      
001879*       MOVE 3                     TO W77-FORMATO                 073700      
001880*INICIA CODIGO DE RENOVACION CRONOS 2000                          073701      
001881        MOVE 13                    TO W77-FORMATO                 073702      
001882*TERMINA CODIGO DE RENOVACION CRONOS 2000                         073703      
001883        CALL "THECALENDAR  IN LOCSUP" USING W77-FUNCION,          073800      
001884                                          WKS-FECHA1 ,            073900      
001885                                          WKS-FECHA2 ,            074000      
001886                                          W77-FORMATO             074100      
001887        IF W77-FUNCION > 0                                        074200      
001888           PERFORM 01-0900-ERROR-CALE                             074300      
001889        ELSE                                                      074400      
001890          MOVE WKS-FECHA1          TO WKS-FECHA-MAN               074500      
001891     ELSE                                                         074600      
001892        MOVE WKS-FEMAQ6D2          TO WLI-RB-E1-FECHA-INF2        074651      
001893        PERFORM    01-0100-PROCEDURE-DISPLAY                      074671      
001894        IF W77-RES-LIBCTL = 1                                     074700      
001895           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       074751      
001896           MOVE "I"                TO TIPO-LJ                     074800      
001897           MOVE 051001             TO CODIGO-LJ                   074900      
001898           MOVE "NO EXISTE EL SISTEMA EN DATASET DIARIO"          075000      
001899                                   TO TEXTO-LJ                    075100      
001900           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                075151      
001901           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               075171      
001902           PERFORM  000-030-IMPRIME-MENSAJE                       075191      
001903           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    075200      
001904           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                075300      
001905        ELSE                                                      075400      
001906           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       075451      
001907           MOVE "I"                TO TIPO-LJ                     075500      
001908           MOVE 051001             TO CODIGO-LJ                   075600      
001909           STRING "ERROR " W77-ERR-LIBCTL " EN LIB. DE CONTROL"   075700      
001910           DELIMITED BY SIZE INTO TEXTO-LJ                        075800      
001911           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                075851      
001912           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               075871      
001913           PERFORM  000-030-IMPRIME-MENSAJE                       075891      
001914           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ, MENSAJE-LJ    075900      
001915           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               076000      
001916                                                                  076100      
001917*=================================================================076200      
001918*         PROCESO DIARIO.- VERIFICACION DE FIN DE SEMANA         =076300      
001919*=================================================================076400      
001920                                                                  076500      
001921 01-0310-PROCESO-DIARIO.                                          076600      
001922*=======================                                          076700      
001923     MOVE ZERO                     TO W77-EOF.                    076800      
001924     MOVE WKS-FECHA-HOY            TO WKS-FECHA1.                 076900      
001925*    MOVE "000000"                 TO WKS-FECHA2.                 077000      
001926*INICIA CODIGO DE RENOVACION CRONOS 2000                          077001      
001927     MOVE "00000000"               TO WKS-FECHA2.                 077002      
001928*TERMINA CODIGO DE RENOVACION CRONOS 2000                         077003      
001929     MOVE 6                        TO W77-FUNCION                 077100      
001930                                      W77-FUN-CALE.               077200      
001931*    MOVE 3                        TO W77-FORMATO.                077300      
001932*INICIA CODIGO DE RENOVACION CRONOS 2000                          077301      
001933     MOVE 13                       TO W77-FORMATO.                077302      
001934*TERMINA CODIGO DE RENOVACION CRONOS 2000                         077303      
001935     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              077400      
001936                                      WKS-FECHA1 ,                077500      
001937                                      WKS-FECHA2 ,                077600      
001938                                      W77-FORMATO.                077700      
001939     IF W77-FUNCION > 0                                           077800      
001940        PERFORM 01-0900-ERROR-CALE.                               077900      
001941                                                                  078000      
001942     MOVE WKS-FECHA1               TO W77-NUMDIA-HOY.             078100      
001943     MOVE WKS-FECHA-MAN            TO WKS-FECHA1.                 078200      
001944*    MOVE "000000"                 TO WKS-FECHA2.                 078300      
001945*INICIA CODIGO DE RENOVACION CRONOS 2000                          078301      
001946     MOVE "00000000"               TO WKS-FECHA2.                 078302      
001947*TERMINA CODIGO DE RENOVACION CRONOS 2000                         078303      
001948     MOVE 6                        TO W77-FUNCION                 078400      
001949                                      W77-FUN-CALE.               078500      
001950*    MOVE 3                        TO W77-FORMATO.                078600      
001951*INICIA CODIGO DE RENOVACION CRONOS 2000                          078601      
001952     MOVE 13                       TO W77-FORMATO.                078602      
001953*TERMINA CODIGO DE RENOVACION CRONOS 2000                         078603      
001954     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              078700      
001955                                      WKS-FECHA1 ,                078800      
001956                                      WKS-FECHA2 ,                078900      
001957                                      W77-FORMATO.                079000      
001958     IF W77-FUNCION > 0                                           079100      
001959        PERFORM 01-0900-ERROR-CALE.                               079200      
001960                                                                  079300      
001961     MOVE WKS-FECHA1               TO W77-NUMDIA-MAN.             079400      
001962     IF W77-ABRE-MOV = 1                                          079500      
001963           PERFORM 01-0350-BORRA-NIVELES.                         079600      
001964                                                                  079700      
001965     IF W77-ABRE-SDO = 1                                          079800      
001966*       MOVE WKS-FEC-MOVTOS        TO WKS-FECDIA-BORRAR           079900      
001967        PERFORM 01-0401-BORRA-SALDIA                              080000      
001968        PERFORM 01-0550-GRABA-B70POS.                             080100      
001969                                                                  080200      
001970*=================================================================080300      
001971*         MANTENIMIENTO A BASE DE MOVIMIENTOS                    =080400      
001972*                                                                =080500      
001973*=================================================================080600      
001974 01-0320-FF-MOVTOS.                                               080700      
001975*==================                                               080800      
001976     FIND FIRST B01SXMOVCTO  OF BASEMOV                           080900      
001977             AT B01-MOV-FECCON NOT > WKS-FEC-MOVTOS               081000      
001978             ON EXCEPTION                                         081100      
001979                IF DMSTATUS(NOTFOUND)                             081200      
001980                   MOVE 1          TO W77-EOF                     081300      
001981                ELSE                                              081400      
001982                   PERFORM 900000-CHE-STA                         081500      
001983                   CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.       081600      
001984 01-0330-BORRA-MOV.                                               081700      
001985*==================                                               081800      
001986     MOVE ZERO                     TO W77-SW-B02                  081900      
001987                                      W77-SW-B03                  082000      
001988                                      W77-SW-B03.                 082100      
001989     MOVE B01-MOV-SEC              TO WKS-MOV-SEC.                082200      
001990     DELETE S151B01MOVCTO.                                        082300      
001991     LOCK B02SXIMPADICIC OF BASEMOV AT                            082400      
001992          B02-MOV-SEC = WKS-MOV-SEC                               082500      
001993       ON EXCEPTION                                               082600      
001994          IF DMSTATUS(NOTFOUND)                                   082700      
001995             MOVE 1                TO W77-SW-B02                  082800      
001996          ELSE                                                    082900      
001997             PERFORM 900000-CHE-STA                               083000      
001998             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             083100      
001999                                                                  083200      
002000     IF W77-SW-B02 = 0                                            083300      
002001        DELETE S151B02IMPADI OF BASEMOV.                          083400      
002002                                                                  083500      
002003     LOCK B03SXDATADIC OF BASEMOV AT                              083600      
002004          B03-MOV-SEC = WKS-MOV-SEC                               083700      
002005       ON EXCEPTION                                               083800      
002006          IF DMSTATUS(NOTFOUND)                                   083900      
002007             MOVE 1                TO W77-SW-B03                  084000      
002008          ELSE                                                    084100      
002009             PERFORM 900000-CHE-STA                               084200      
002010             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             084300      
002011                                                                  084400      
002012     IF W77-SW-B03 = 0                                            084500      
002013        DELETE S151B03DATADI OF BASEMOV.                          084600      
002014 01-0350-BORRA-NIVELES.                                           087000      
002015*======================                                           087100      
002016     LOCK BASESDO                                                 087200      
002017       ON EXCEPTION                                               087300      
002018          PERFORM 900000-CHE-STA                                  087400      
002019          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                087500      
002020     MOVE WKS-FECMOV-DD            TO W77-BORRA-DIA1.             087600      
002021     MOVE ZERO               TO B00-SDO-LECARCDIA(W77-BORRA-DIA1) 087700      
002022                                B00-SDO-MOVCICDIA(W77-BORRA-DIA1) 087800      
002023                                B00-SDO-SDOCICDIA(W77-BORRA-DIA1).087900      
002024*    MOVE "000001"                TO WKS-FECHA2.                  088000      
002025*INICIA CODIGO DE RENOVACION CRONOS 2000                          088001      
002026     MOVE "00000001"              TO WKS-FECHA2.                  088002      
002027*TERMINA CODIGO DE RENOVACION CRONOS 2000                         088003      
002028     MOVE WKS-FEC-MOVTOS          TO WKS-FECHA1.                  088100      
002029     MOVE 10                      TO W77-FUNCION                  088200      
002030                                     W77-FUN-CALE.                088300      
002031*    MOVE 3                       TO W77-FORMATO.                 088400      
002032*INICIA CODIGO DE RENOVACION CRONOS 2000                          088401      
002033     MOVE 13                      TO W77-FORMATO.                 088402      
002034*TERMINA CODIGO DE RENOVACION CRONOS 2000                         088403      
002035     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              088500      
002036                                      WKS-FECHA1 ,                088600      
002037                                      WKS-FECHA2 ,                088700      
002038                                      W77-FORMATO.                088800      
002039     IF W77-FUNCION > 0                                           088900      
002040        PERFORM 01-0900-ERROR-CALE.                               089000      
002041                                                                  089100      
002042     MOVE WKS-FECHA1               TO WKS-FEC-MOVTOS.             089200      
002043     MOVE WKS-FECMOV-DD            TO W77-BORRA-DIA2.             089300      
002044     MOVE ZERO               TO B00-SDO-LECARCDIA(W77-BORRA-DIA2) 089400      
002045                                B00-SDO-MOVCICDIA(W77-BORRA-DIA2) 089500      
002046                                B00-SDO-SDOCICDIA(W77-BORRA-DIA2).089600      
002047*    MOVE "000001"                TO WKS-FECHA2.                  089700      
002048*INICIA CODIGO DE RENOVACION CRONOS 2000                          089701      
002049     MOVE "00000001"              TO WKS-FECHA2.                  089702      
002050*TERMINA CODIGO DE RENOVACION CRONOS 2000                         089703      
002051     MOVE WKS-FEC-MOVTOS          TO WKS-FECHA1.                  089800      
002052     MOVE 10                      TO W77-FUNCION                  089900      
002053                                     W77-FUN-CALE.                090000      
002054*    MOVE 3                       TO W77-FORMATO.                 090100      
002055*INICIA CODIGO DE RENOVACION CRONOS 2000                          090101      
002056     MOVE 13                      TO W77-FORMATO.                 090102      
002057*TERMINA CODIGO DE RENOVACION CRONOS 2000                         090103      
002058     CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,              090200      
002059                                      WKS-FECHA1 ,                090300      
002060                                      WKS-FECHA2 ,                090400      
002061                                      W77-FORMATO.                090500      
002062     IF W77-FUNCION > 0                                           090600      
002063        PERFORM 01-0900-ERROR-CALE.                               090700      
002064                                                                  090800      
002065     MOVE WKS-FECHA2               TO WKS-FEC-MOVTOS.             090900      
002066     MOVE WKS-FECMOV-DD            TO W77-BORRA-DIA3.             091000      
002067     MOVE ZERO               TO B00-SDO-LECARCDIA(W77-BORRA-DIA3) 091100      
002068                                B00-SDO-MOVCICDIA(W77-BORRA-DIA3) 091200      
002069                                B00-SDO-SDOCICDIA(W77-BORRA-DIA3).091300      
002070     STORE BASESDO                                                091400      
002071        ON EXCEPTION                                              091500      
002072           PERFORM 900000-CHE-STA                                 091600      
002073           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               091700      
002074     LOCK BASEMOV                                                 091800      
002075       ON EXCEPTION                                               091900      
002076          PERFORM 900000-CHE-STA                                  092000      
002077          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                092100      
002078     MOVE ZERO               TO B00-MOV-LECARCDIA(W77-BORRA-DIA1) 092200      
002079                                B00-MOV-MOVCICDIA(W77-BORRA-DIA1) 092300      
002080                                B00-MOV-SDOCICDIA(W77-BORRA-DIA1).092400      
002081     MOVE ZERO               TO B00-MOV-LECARCDIA(W77-BORRA-DIA2) 092500      
002082                                B00-MOV-MOVCICDIA(W77-BORRA-DIA2) 092600      
002083                                B00-MOV-SDOCICDIA(W77-BORRA-DIA2).092700      
002084     MOVE ZERO               TO B00-SDO-LECARCDIA(W77-BORRA-DIA3) 092800      
002085                                B00-SDO-MOVCICDIA(W77-BORRA-DIA3) 092900      
002086                                B00-SDO-SDOCICDIA(W77-BORRA-DIA3).093000      
002087     STORE BASEMOV                                                093100      
002088        ON EXCEPTION                                              093200      
002089           PERFORM 900000-CHE-STA                                 093300      
002090           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               093400      
002091                                                                  093500      
002092 01-0400-PROCESO-MENSUAL.                                         093600      
002093*=========================                                        093700      
002094                                                                  093800      
002095*===== FECHA DE BORRADO PARA DATASETS DIARIOS                     093900      
002096                                                                  094000      
002097     IF WKS-B03-NUMCICDIA > 0 AND                                 094100      
002098        (WKS-B03-TIPBD = 1 OR 2 OR 5 OR 6)                        094200      
002099        MOVE WKS-B01-FECPRO        TO WKS-FECHA1                  094300      
002100        MOVE WKS-B03-NUMCICDIA     TO WKS-FECHA2-R                094400      
002101        MOVE 22                    TO W77-FUNCION                 094500      
002102                                      W77-FUN-CALE                094600      
002103*       MOVE 3                     TO W77-FORMATO                 094700      
002104*INICIA CODIGO DE RENOVACION CRONOS 2000                          094701      
002105        MOVE 13                    TO W77-FORMATO                 094702      
002106*TERMINA CODIGO DE RENOVACION CRONOS 2000                         094703      
002107        CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,           094800      
002108                                         WKS-FECHA1 ,             094900      
002109                                         WKS-FECHA2 ,             095000      
002110                                         W77-FORMATO              095100      
002111        IF W77-FUNCION > 0                                        095200      
002112           PERFORM 01-0900-ERROR-CALE                             095300      
002113        ELSE                                                      095400      
002114           IF W77-ABRE-SDO = 1                                    095500      
002115              MOVE WKS-FECHA1      TO WKS-FECDIA-BORRAR           095600      
002116              PERFORM 01-0401-BORRA-SALDIA.                       095700      
002117                                                                  095800      
002118*===== FECHA DE BORRADO PARA DATASETS MENSUALES                   095900      
002119                                                                  096000      
002120     IF WKS-B03-NUMCICMES > 0 AND                                 096100      
002121        (WKS-B03-TIPBD = 1 OR 2 OR 4 OR 5 OR 6 OR 7)              096200      
002122        MOVE WKS-B01-FECPRO        TO WKS-FECHA1                  096300      
002123        MOVE WKS-B03-NUMCICMES     TO WKS-FECHA2-R                096400      
002124        MOVE 22                    TO W77-FUNCION                 096500      
002125                                      W77-FUN-CALE                096600      
002126*       MOVE 3                     TO W77-FORMATO                 096700      
002127*INICIA CODIGO DE RENOVACION CRONOS 2000                          096701      
002128        MOVE 13                    TO W77-FORMATO                 096702      
002129*TERMINA CODIGO DE RENOVACION CRONOS 2000                         096703      
002130        CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,           096800      
002131                                         WKS-FECHA1 ,             096900      
002132                                         WKS-FECHA2 ,             097000      
002133                                         W77-FORMATO              097100      
002134        IF W77-FUNCION > 0                                        097200      
002135           PERFORM 01-0900-ERROR-CALE                             097300      
002136        ELSE                                                      097400      
002137           MOVE WKS-FECHA1                TO WKS-FECMEN-BORRAR    097500      
002138           IF WKS-PARAM-SISTEMA = 84                              097600      
002139              MOVE WKS-B01-FECPRO         TO WKS-FECHA1           097700      
002140              COMPUTE W77-MESES-INST15 = WKS-B03-NUMCICMES + 1    097800      
002141              MOVE W77-MESES-INST15       TO WKS-FECHA2-R         097900      
002142              MOVE 22                     TO W77-FUNCION          098000      
002143                                             W77-FUN-CALE         098100      
002144*             MOVE 3                      TO W77-FORMATO          098200      
002145*INICIA CODIGO DE RENOVACION CRONOS 2000                          098201      
002146              MOVE 13                     TO W77-FORMATO          098202      
002147*TERMINA CODIGO DE RENOVACION CRONOS 2000                         098203      
002148              CALL "THECALENDAR IN LOCSUP" USING W77-FUNCION,     098300      
002149                                               WKS-FECHA1 ,       098400      
002150                                               WKS-FECHA2 ,       098500      
002151                                               W77-FORMATO        098600      
002152              IF W77-FUNCION > 0                                  098700      
002153                 PERFORM 01-0900-ERROR-CALE                       098800      
002154              ELSE                                                098900      
002155                 MOVE WKS-FECHA1        TO WKS-FECMEN-INST15.     099000      
002156                                                                  099100      
002157                                                                  099200      
002158     IF WKS-B03-NUMCICMES > 0 AND                                 099300      
002159        (WKS-B03-TIPBD = 1 OR 2 OR 4 OR 5 OR 6 OR 7)              099400      
002160        IF WKS-B03-TIPBD = 2 OR 5                                 099500      
002161           IF W77-ABRE-SDO = 1                                    099600      
002162              PERFORM 01-0402-SALDOS                              099700      
002163           ELSE                                                   099800      
002164              NEXT SENTENCE                                       099900      
002165        ELSE                                                      100000      
002166           IF WKS-B03-TIPBD = 4 OR 7                              100100      
002167              NEXT SENTENCE                                       100500      
002168           ELSE                                                   100600      
002169              IF W77-ABRE-SDO = 1                                 100700      
002170                 PERFORM 01-0402-SALDOS.                          100800      
002171                                                                  101000      
002172*=================================================================101100      
002173*    BORRADO DE INFORMACION EN DATASETS DIARIOS BASE SALDOS      =101200      
002174*=================================================================101300      
002175                                                                  101400      
002176 01-0401-BORRA-SALDIA.                                            101500      
002177*=====================                                            101600      
002178                                                                  101700      
002179     PERFORM 01-0470-BORRA-B72CONTA.                              102200      
002180     PERFORM 01-0460-BORRA-B70POS.                                102300      
002181     PERFORM 01-0480-BORRA-B80EDO.                                102400      
002182                                                                  102500      
002183*=================================================================102600      
002184*         BORRADO EN DATASETS MENSUALES EN BASE DE SALDOS        =102700      
002185*=================================================================102800      
002186                                                                  102900      
002187 01-0402-SALDOS.                                                  103000      
002188*===============                                                  103100      
002189     PERFORM 01-0550-GRABA-B20CTO.                                103200      
002190     PERFORM 01-0510-BORRA-B20CTO.                                103400      
002191     PERFORM 01-0590-ROTABASES.                                   103800      
002192     PERFORM 01-0596-NIVELBD11.                                   103900      
002193                                                                  104000      
002194                                                                  128100      
002195 01-0460-BORRA-B70POS.                                            128200      
002196*======================                                           128300      
002197     MOVE ZERO                     TO W77-EOF.                    128400      
002198     PERFORM 01-0462-FF-B70POSDIA.                                128500      
002199     PERFORM 01-0464-FN-B70POSDIA UNTIL W77-EOF = 1.              128600      
002200     MOVE ZERO                     TO W77-EOF.                    128700      
002201     PERFORM 01-0465-FF-B71POSDIA.                                128720      
002202     PERFORM 01-0466-FN-B71POSDIA UNTIL W77-EOF = 1.              128740      
002203 01-0462-FF-B70POSDIA.                                            128800      
002204*=====================                                            128900      
002205     FIND FIRST B70SXPOSICION                                     129000      
002206             AT B70-SDO-KEYCSI = WKS-NUMCSI       AND             129100      
002207                B70-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            129200      
002208             ON EXCEPTION                                         129300      
002209                MOVE 1             TO W77-EOF                     129400      
002210                IF DMSTATUS(NOTFOUND)                             129500      
002211                   NEXT SENTENCE                                  129600      
002212                ELSE                                              129700      
002213                   PERFORM 900000-CHE-STA.                        129800      
002214                                                                  129900      
002215 01-0464-FN-B70POSDIA.                                            130000      
002216*=====================                                            130100      
002217     DELETE S151B70POSICION.                                      130900      
002218     FIND NEXT B70SXPOSICION                                      131000      
002219             AT B70-SDO-KEYCSI = WKS-NUMCSI   AND                 131100      
002220                B70-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            131200      
002221             ON EXCEPTION                                         131300      
002222                MOVE 1             TO W77-EOF                     131400      
002223                IF DMSTATUS(NOTFOUND)                             131500      
002224                   NEXT SENTENCE                                  131600      
002225                ELSE                                              131700      
002226                   PERFORM 900000-CHE-STA.                        131800      
002227                                                                  131900      
002228 01-0465-FF-B71POSDIA.                                            132000      
002229*==================                                               132100      
002230     FIND FIRST B71SXPOSDIAAD1 AT                                 132200      
002231                B71-SDO-KEYCSI     = 0                 AND        132400      
002232                B71-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            132500      
002233             ON EXCEPTION                                         133000      
002234                IF DMSTATUS(NOTFOUND)                             133200      
002235                   MOVE 1          TO W77-EOF                     133300      
002236                ELSE                                              133400      
002237                   PERFORM 900000-CHE-STA.                        133500      
002238                                                                  133800      
002239 01-0466-FN-B71POSDIA.                                            133805      
002240*=====================                                            133810      
002241     DELETE S151B71POSDIAAD1.                                     133815      
002242     FIND NEXT  B71SXPOSDIAAD1 AT                                 133820      
002243                B71-SDO-KEYCSI     = 0                 AND        133825      
002244                B71-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            133830      
002245             ON EXCEPTION                                         133835      
002246                IF DMSTATUS(NOTFOUND)                             133840      
002247                   MOVE 1          TO W77-EOF                     133845      
002248                ELSE                                              133850      
002249                   PERFORM 900000-CHE-STA.                        133855      
002250 01-0470-BORRA-B72CONTA.                                          133900      
002251*=======================                                          134000      
002252     MOVE ZERO                     TO W77-EOF.                    134100      
002253     PERFORM 01-0472-FF-B72POSCON.                                134200      
002254     PERFORM 01-0474-FN-B72POSCON UNTIL W77-EOF = 1.              134300      
002255                                                                  134400      
002256 01-0472-FF-B72POSCON.                                            134500      
002257*=====================                                            134600      
002258     FIND FIRST B72SXPOSCONTA                                     134700      
002259             AT B72-SDO-KEYCSI = WKS-NUMCSI       AND             134800      
002260                B72-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            134900      
002261             ON EXCEPTION                                         135000      
002262                MOVE 1             TO W77-EOF                     135100      
002263                IF DMSTATUS(NOTFOUND)                             135200      
002264                   NEXT SENTENCE                                  135300      
002265                ELSE                                              135400      
002266                   PERFORM 900000-CHE-STA.                        135500      
002267                                                                  135600      
002268 01-0474-FN-B72POSCON.                                            135700      
002269*=====================                                            135800      
002270     DELETE S151B72POSCONTA.                                      135900      
002271     FIND NEXT B72SXPOSCONTA                                      136000      
002272             AT B72-SDO-KEYCSI = WKS-NUMCSI   AND                 136100      
002273                B72-SDO-KEYFEC NOT > WKS-FECDIA-BORRAR            136200      
002274             ON EXCEPTION                                         136300      
002275                MOVE 1             TO W77-EOF                     136400      
002276                IF DMSTATUS(NOTFOUND)                             136500      
002277                   NEXT SENTENCE                                  136600      
002278                ELSE                                              136700      
002279                   PERFORM 900000-CHE-STA.                        136800      
002280 01-0476-LIMPIA-CUENTA.                                           136820      
002281*======================                                           136823      
002282     IF WKS-PARAM-SISTEMA = 87                                    136826      
002283        MOVE ZERO                          TO W77-EOF             136829      
002284        LOCK FIRST B72SXPOSCONTA                                  136832      
002285                AT B72-SDO-KEYCSI = WKS-NUMCSI       AND          136835      
002286                   B72-SDO-KEYFEC = WKS-FECHA-HOY    AND          136838      
002287                   B72-SDO-KEYCTA = 231107000000                  136841      
002288                ON EXCEPTION                                      136844      
002289                   MOVE 1             TO W77-EOF                  136847      
002290                   IF DMSTATUS(NOTFOUND)                          136850      
002291                      NEXT SENTENCE                               136853      
002292                   ELSE                                           136856      
002293                      PERFORM 900000-CHE-STA.                     136859      
002294     IF WKS-PARAM-SISTEMA = 87                                    136862      
002295        PERFORM 01-0478-LIMPIA-231107 UNTIL W77-EOF = 1.          136865      
002296                                                                  136868      
002297 01-0478-LIMPIA-231107.                                           136871      
002298*======================                                           136874      
002299     MOVE ZERO                     TO B72-SDO-SDOACT.             136875      
002300     STORE S151B72POSCONTA ON EXCEPTION                           136876      
002301                           PERFORM 900000-CHE-STA.                136877      
002302     LOCK NEXT  B72SXPOSCONTA                                     136878      
002303          AT    B72-SDO-KEYCSI = WKS-NUMCSI       AND             136880      
002304                B72-SDO-KEYFEC = WKS-FECHA-HOY    AND             136883      
002305                B72-SDO-KEYCTA = 231107000000                     136885      
002306             ON EXCEPTION                                         136887      
002307                MOVE 1             TO W77-EOF                     136889      
002308                IF DMSTATUS(NOTFOUND)                             136891      
002309                   NEXT SENTENCE                                  136893      
002310                ELSE                                              136895      
002311                   MOVE 1          TO W77-EOF                     136896      
002312                   PERFORM 900000-CHE-STA.                        136897      
002313                                                                  136899      
002314 01-0480-BORRA-B80EDO.                                            136900      
002315*=====================                                            137000      
002316     MOVE ZERO                     TO W77-EOF.                    137100      
002317     PERFORM 01-0482-FF-B80EDOCTA.                                137200      
002318     PERFORM 01-0484-FN-B80EDOCTA UNTIL W77-EOF = 1.              137300      
002319                                                                  137400      
002320 01-0482-FF-B80EDOCTA.                                            137500      
002321*=====================                                            137600      
002322     FIND FIRST B80SXEDOCTA                                       137700      
002323             AT B80-SDO-FECCON NOT > WKS-FECB80-BORRAR            137800      
002324             ON EXCEPTION                                         137900      
002325                MOVE 1             TO W77-EOF                     138000      
002326                IF DMSTATUS(NOTFOUND)                             138100      
002327                   NEXT SENTENCE                                  138200      
002328                ELSE                                              138300      
002329                   PERFORM 900000-CHE-STA.                        138400      
002330                                                                  138500      
002331 01-0484-FN-B80EDOCTA.                                            138600      
002332*=====================                                            138700      
002333     DELETE S151B80EDOCTA.                                        138800      
002334     FIND NEXT B80SXEDOCTA                                        138900      
002335            AT  B80-SDO-FECCON NOT > WKS-FECB80-BORRAR            139000      
002336             ON EXCEPTION                                         139100      
002337                MOVE 1             TO W77-EOF                     139200      
002338                IF DMSTATUS(NOTFOUND)                             139300      
002339                   NEXT SENTENCE                                  139400      
002340                ELSE                                              139500      
002341                   PERFORM 900000-CHE-STA.                        139600      
002342                                                                  139700      
002343 01-0510-BORRA-B20CTO.                                            139800      
002344*=====================                                            139900      
002345     MOVE ZERO                     TO W77-EOF.                    140000      
002346     PERFORM 01-0512-FF-B20MENCON.                                140100      
002347     PERFORM 01-0514-FN-B20MENCON UNTIL W77-EOF = 1.              140200      
002348                                                                  140300      
002349 01-0512-FF-B20MENCON.                                            140400      
002350*=====================                                            140500      
002351     FIND FIRST B20SXSDOMENCON                                    140600      
002352             AT B20-SDO-KEYAM    NOT > WKS-FECMEN-AAMM            140700      
002353             ON EXCEPTION                                         140800      
002354                MOVE 1             TO W77-EOF                     140900      
002355                IF DMSTATUS(NOTFOUND)                             141000      
002356                   NEXT SENTENCE                                  141100      
002357                ELSE                                              141200      
002358                   PERFORM 900000-CHE-STA.                        141300      
002359                                                                  141400      
002360 01-0514-FN-B20MENCON.                                            141500      
002361*=====================                                            141600      
002362     IF B20-SDO-APUIMP > 0                                        141700      
002363        MOVE ZERO                  TO W77-EOF-ADI                 141800      
002364        PERFORM 01-0515-BORRA-ADI                                 141900      
002365                VARYING W77-IND FROM 1 BY 1                       142000      
002366                UNTIL   W77-IND > B20-SDO-APUIMP OR               142100      
002367                        W77-EOF-ADI > 0.                          142200      
002368     DELETE S151B20SDOMENCON.                                     142300      
002369     FIND NEXT B20SXSDOMENCON                                     142400      
002370             AT B20-SDO-KEYAM    NOT > WKS-FECMEN-AAMM            142500      
002371             ON EXCEPTION                                         142600      
002372                MOVE 1             TO W77-EOF                     142700      
002373                IF DMSTATUS(NOTFOUND)                             142800      
002374                   NEXT SENTENCE                                  142900      
002375                ELSE                                              143000      
002376                   PERFORM 900000-CHE-STA.                        143100      
002377 01-0515-BORRA-ADI.                                               143200      
002378*==================                                               143300      
002379     FIND B21SXSDMENCON1 AT                                       143400      
002380          B21-SDO-KEYCON     = B20-SDO-KEYCON AND                 143500      
002381          B21-SDO-KEYAM      = B20-SDO-KEYAM  AND                 143600      
002382          B21-SDO-KEYPRD     = B20-SDO-KEYPRD AND                 143700      
002383          B21-SDO-KEYINS     = B20-SDO-KEYINS AND                 143800      
002384          B21-SDO-KEYIND NOT < W77-IND                            143900      
002385       ON EXCEPTION                                               144000      
002386          MOVE 1             TO W77-EOF-ADI                       144100      
002387          IF DMSTATUS(NOTFOUND)                                   144200      
002388             NEXT SENTENCE                                        144300      
002389          ELSE                                                    144400      
002390             PERFORM 900000-CHE-STA.                              144500      
002391     IF W77-EOF-ADI = 0                                           144600      
002392        IF WKS-PARAM-SISTEMA = 84                         AND     144700      
002393           ( B20-SDO-KEYINS = 15 OR B20-SDO-KEYINS = 17 ) AND     144752      
002394           B21-SDO-KEYAM < WKS-INST15-AAMM                        144800      
002395           DELETE S151B21SDMENCON1                                144900      
002396        ELSE                                                      145000      
002397           DELETE S151B21SDMENCON1.                               145100      
002398                                                                  145200      
002399 01-0550-GRABA-B20CTO.                                            158400      
002400*=====================                                            158500      
002401     MOVE ZERO                     TO W77-EOF.                    158600      
002402     PERFORM 01-0552-FF-B20MENCON.                                158700      
002403     PERFORM 01-0554-FN-B20MENCON UNTIL W77-EOF = 1.              158800      
002404                                                                  158900      
002405 01-0552-FF-B20MENCON.                                            159000      
002406*=====================                                            159100      
002407     FIND FIRST B20SXSDOMENCON                                    159200      
002408             AT B20-SDO-KEYAM = WKS-FECHOY-AAMM                   159300      
002409             ON EXCEPTION                                         159400      
002410                MOVE 1             TO W77-EOF                     159500      
002411                IF DMSTATUS(NOTFOUND)                             159600      
002412                   NEXT SENTENCE                                  159700      
002413                ELSE                                              159800      
002414                   PERFORM 900000-CHE-STA.                        159900      
002415                                                                  160000      
002416 01-0554-FN-B20MENCON.                                            160100      
002417*=====================                                            160200      
002418     MOVE S151B20SDOMENCON         TO WKS-B20-MENCON.             160300      
002419     IF WKS-B20-SD(2) = 0                                         160400      
002420        IF WKS-PARAM-SISTEMA = 84                        AND      160500      
002421           (WKS-B20-KEYINS = 15 OR WKS-B20-KEYINS = 17 ) OR       160552      
002422           WKS-B20-APUIMP > 0                                     160600      
002423           PERFORM 01-0555-GRABA-B20                              160700      
002424        ELSE                                                      160800      
002425           NEXT SENTENCE                                          160900      
002426     ELSE                                                         161000      
002427        PERFORM 01-0555-GRABA-B20.                                161200      
002428                                                                  161300      
002429     FIND FIRST B20SXSDOMENCON AT                                 161400      
002430        B20-SDO-KEYAM   = WKS-FECHOY-AAMM  AND                    161500      
002431        B20-SDO-KEYCON  = WKS-B20-KEYCON   AND                    161600      
002432        B20-SDO-KEYPRD  = WKS-B20-KEYPRD   AND                    161700      
002433        B20-SDO-KEYINS  = WKS-B20-KEYINS   AND                    161800      
002434        B20-SDO-KEYMON  > WKS-B20-KEYMON                          161900      
002435     ON EXCEPTION                                                 162000      
002436        IF DMSTATUS(NOTFOUND)                                     162100      
002437           FIND FIRST B20SXSDOMENCON AT                           162200      
002438                B20-SDO-KEYAM   = WKS-FECHOY-AAMM  AND            162300      
002439                B20-SDO-KEYCON  = WKS-B20-KEYCON   AND            162400      
002440                B20-SDO-KEYPRD  = WKS-B20-KEYPRD   AND            162500      
002441                B20-SDO-KEYINS  > WKS-B20-KEYINS                  162600      
002442             ON EXCEPTION                                         162700      
002443                IF DMSTATUS(NOTFOUND)                             162800      
002444                   FIND FIRST B20SXSDOMENCON AT                   162900      
002445                      B20-SDO-KEYAM   = WKS-FECHOY-AAMM  AND      163000      
002446                      B20-SDO-KEYCON  = WKS-B20-KEYCON   AND      163100      
002447                      B20-SDO-KEYPRD  > WKS-B20-KEYPRD            163200      
002448                   ON EXCEPTION                                   163300      
002449                      IF DMSTATUS(NOTFOUND)                       163400      
002450                         FIND FIRST B20SXSDOMENCON AT             163500      
002451                            B20-SDO-KEYAM   = WKS-FECHOY-AAMM  AND163600      
002452                            B20-SDO-KEYCON  > WKS-B20-KEYCON      163700      
002453                         ON EXCEPTION                             163800      
002454                            IF DMSTATUS(NOTFOUND)                 163900      
002455                               MOVE 1  TO W77-EOF                 164000      
002456                            ELSE                                  164100      
002457                               PERFORM 900000-CHE-STA             164200      
002458                      ELSE                                        164300      
002459                         PERFORM 900000-CHE-STA                   164400      
002460                ELSE                                              164500      
002461                   PERFORM 900000-CHE-STA                         164600      
002462          ELSE                                                    164700      
002463             PERFORM 900000-CHE-STA.                              164800      
002464                                                                  164900      
002465 01-0555-GRABA-B20.                                               165000      
002466*==================                                               165100      
002467     PERFORM 01-0556-GRABA-MES.                                   165200      
002468     IF WKS-PARAM-SISTEMA = 84                           AND      165300      
002469        ( WKS-B20-KEYINS  = 15  OR  WKS-B20-KEYINS = 17 )         165352      
002470        MOVE WKS-B20-KEYCON        TO WKS-B21-KEYCON              165400      
002471        MOVE WKS-B20-KEYPRD        TO WKS-B21-KEYPRD              165500      
002472        MOVE WKS-B20-KEYINS        TO WKS-B21-KEYINS              165600      
002473        MOVE ZERO                  TO W77-EOF-B21                 165700      
002474        PERFORM 01-0558-GRABA-B21.                                165800      
002475                                                                  165900      
002476 01-0556-GRABA-MES.                                               166000      
002477*===================                                              166100      
002478     LOCK B20SXSDOMENCON AT                                       166200      
002479          B20-SDO-KEYAM   = WKS-FECMAN-AAMM       AND             166300      
002480          B20-SDO-KEYCON  = WKS-B20-KEYCON        AND             166400      
002481          B20-SDO-KEYPRD  = WKS-B20-KEYPRD        AND             166500      
002482          B20-SDO-KEYINS  = WKS-B20-KEYINS        AND             166600      
002483          B20-SDO-KEYMON  = WKS-B20-KEYMON                        166700      
002484        ON EXCEPTION                                              166800      
002485           IF DMSTATUS(NOTFOUND)                                  166900      
002486              CREATE S151B20SDOMENCON                             167000      
002487           ELSE                                                   167100      
002488              IF DMSTATUS(DUPLICATES)                             167200      
002489                 NEXT SENTENCE                                    167300      
002490              ELSE                                                167400      
002491                 PERFORM 900000-CHE-STA                           167500      
002492                 CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.         167600      
002493     MOVE WKS-B20-KEYCON           TO B20-SDO-KEYCON.             167700      
002494     MOVE WKS-FECMAN-AAMM          TO B20-SDO-KEYAM.              167800      
002495     MOVE WKS-B20-KEYPRD           TO B20-SDO-KEYPRD.             167900      
002496     MOVE WKS-B20-KEYINS           TO B20-SDO-KEYINS.             168000      
002497     MOVE WKS-B20-KEYMON           TO B20-SDO-KEYMON.             168100      
002498     MOVE WKS-B20-SUCPRO           TO B20-SDO-SUCPRO.             168200      
002499     MOVE WKS-B20-SD(2)            TO B20-SDO-SD(1)               168300      
002500                                      B20-SDO-SD(2).              168400      
002501     STORE S151B20SDOMENCON                                       168500      
002502        ON EXCEPTION                                              168600      
002503           PERFORM 900000-CHE-STA                                 168700      
002504           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               168800      
002505                                                                  168900      
002506 01-0558-GRABA-B21.                                               169000      
002507*===================                                              169100      
002508     MOVE ZERO                     TO W77-EOF-B21.                169200      
002509     LOCK FIRST B21SXSDMENCON1 AT                                 169300      
002510          B21-SDO-KEYAM   = WKS-FECHOY-AAMM       AND             169400      
002511          B21-SDO-KEYCON  = WKS-B21-KEYCON        AND             169500      
002512          B21-SDO-KEYPRD  = WKS-B21-KEYPRD        AND             169600      
002513          B21-SDO-KEYINS  = WKS-B21-KEYINS        AND             169700      
002514          B21-SDO-KEYIND  > 0                                     169800      
002515       ON EXCEPTION                                               169900      
002516          IF DMSTATUS(NOTFOUND)                                   170000      
002517             MOVE 1                TO W77-EOF-B21                 170100      
002518           ELSE                                                   170200      
002519              PERFORM 900000-CHE-STA                              170300      
002520              MOVE 1               TO W77-EOF-B21.                170400      
002521                                                                  170500      
002522     PERFORM 01-0559-PROY-B21 UNTIL W77-EOF-B21 = 1.              170600      
002523                                                                  170700      
002524 01-0559-PROY-B21.                                                170800      
002525*=================                                                170900      
002526     MOVE ZERO                     TO W77-ERROR-B21.              171000      
002527     MOVE S151B21SDMENCON1         TO WKS-B21-MENCON.             171100      
002528     LOCK B21SXSDMENCON1 AT                                       171200      
002529          B21-SDO-KEYAM   = WKS-FECHOY-AAMM       AND             171300      
002530          B21-SDO-KEYCON  = WKS-B21-KEYCON        AND             171400      
002531          B21-SDO-KEYPRD  = WKS-B21-KEYPRD        AND             171500      
002532          B21-SDO-KEYINS  = WKS-B21-KEYINS        AND             171600      
002533          B21-SDO-KEYIND  = WKS-B21-KEYIND                        171700      
002534       ON EXCEPTION                                               171800      
002535          IF DMSTATUS(NOTFOUND)                                   171900      
002536             CREATE S151B21SDMENCON1                              172000      
002537             MOVE WKS-B21-KEYCON   TO B21-SDO-KEYCON              172100      
002538             MOVE WKS-FECMAN-AAMM  TO B21-SDO-KEYAM               172200      
002539             MOVE WKS-B21-KEYPRD   TO B21-SDO-KEYPRD              172300      
002540             MOVE WKS-B21-KEYINS   TO B21-SDO-KEYINS              172400      
002541             MOVE WKS-B21-KEYIND   TO B21-SDO-KEYIND              172500      
002542          ELSE                                                    172600      
002543             MOVE 1                TO W77-ERROR-B21.              172700      
002544                                                                  172800      
002545     IF W77-ERROR-B21 = 0                                         172900      
002546        PERFORM 01-0559-MUEVE-CONCEPTO                            173000      
002547                VARYING W77-IND FROM 1 BY 1 UNTIL W77-IND > 12    173100      
002548        STORE S151B21SDMENCON1                                    173200      
002549           ON EXCEPTION                                           173300      
002550              PERFORM 900000-CHE-STA                              173400      
002551              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.            173500      
002552                                                                  173600      
002553     LOCK FIRST B21SXSDMENCON1 AT                                 173700      
002554          B21-SDO-KEYAM   = WKS-FECHOY-AAMM       AND             173800      
002555          B21-SDO-KEYCON  = WKS-B21-KEYCON        AND             173900      
002556          B21-SDO-KEYPRD  = WKS-B21-KEYPRD        AND             174000      
002557          B21-SDO-KEYINS  = WKS-B21-KEYINS        AND             174100      
002558          B21-SDO-KEYIND  > WKS-B21-KEYIND                        174200      
002559       ON EXCEPTION                                               174300      
002560          IF DMSTATUS(NOTFOUND)                                   174400      
002561             MOVE 1                TO W77-EOF-B21                 174500      
002562          ELSE                                                    174600      
002563             PERFORM 900000-CHE-STA                               174700      
002564             MOVE 1                TO W77-EOF-B21.                174800      
002565                                                                  174900      
002566 01-0559-MUEVE-CONCEPTO.                                          175000      
002567*=======================                                          175100      
002568     COMPUTE W77-NUMCON-B21 = WKS-B21-KEYIND * 12 - 2 + W77-IND.  175200      
002569     IF W77-NUMCON-B21 = 301 OR 302 OR 303 OR 306 OR 314 OR 315   175300      
002570                         OR 316 OR 317                            175400      
002571        MOVE ZERO                  TO B21-SDO-SD(W77-IND)         175500      
002572                                      B21-SDO-CNTMOV(W77-IND)     175600      
002573     ELSE                                                         175700      
002574     IF W77-NUMCON-B21 = 313                                      175800      
002575        MOVE WKS-B21-SD(W77-IND)   TO B21-SDO-SD(3)               175900      
002576                                      B21-SDO-SD(2)               176000      
002577     ELSE                                                         176100      
002578        MOVE WKS-B21-SD(W77-IND)     TO B21-SDO-SD(W77-IND)       176200      
002579        MOVE WKS-B21-NUMMOV(W77-IND) TO B21-SDO-CNTMOV(W77-IND).  176300      
002580                                                                  176400      
002581 01-0550-GRABA-B70POS.                                            176500      
002582*=====================                                            176600      
002583     MOVE ZERO                     TO W77-EOF.                    176700      
002584     PERFORM 01-0552-FF-B70POSDIA.                                176800      
002585     PERFORM 01-0554-FN-B70POSDIA UNTIL W77-EOF = 1.              176900      
002586                                                                  177000      
002587 01-0552-FF-B70POSDIA.                                            177100      
002588*=====================                                            177200      
002589     FIND FIRST B70SXPOSICION                                     177300      
002590             AT B70-SDO-KEYCSI = WKS-NUMCSI       AND             177400      
002591                B70-SDO-KEYFEC = WKS-FECHA-HOY                    177500      
002592             ON EXCEPTION                                         177600      
002593                MOVE 1             TO W77-EOF                     177700      
002594                IF DMSTATUS(NOTFOUND)                             177800      
002595                   NEXT SENTENCE                                  177900      
002596                ELSE                                              178000      
002597                   PERFORM 900000-CHE-STA.                        178100      
002598 01-0554-FN-B70POSDIA.                                            178200      
002599*=====================                                            178300      
002600     MOVE S151B70POSICION          TO WKS-B70-POSICION.           178400      
002601     PERFORM 01-0555-GRABA-B70.                                   178500      
002602     IF WKS-PARAM-SISTEMA = 84                         AND        178600      
002603        ( WKS-B70-KEYINS  = 15 OR WKS-B70-KEYINS = 17 )           178652      
002604        PERFORM 01-0558-GRABA-B71.                                178700      
002605     FIND FIRST B70SXPOSICION  AT                                 178800      
002606        B70-SDO-KEYCSI = WKS-B70-KEYCSI   AND                     178900      
002607        B70-SDO-KEYFEC = WKS-FECHA-HOY    AND                     179000      
002608        B70-SDO-KEYPRD = WKS-B70-KEYPRD   AND                     179100      
002609        B70-SDO-KEYINS = WKS-B70-KEYINS   AND                     179200      
002610        B70-SDO-KEYMON > WKS-B70-KEYMON                           179300      
002611     ON EXCEPTION                                                 179400      
002612        IF DMSTATUS(NOTFOUND)                                     179500      
002613           FIND FIRST B70SXPOSICION  AT                           179600      
002614                B70-SDO-KEYCSI = WKS-B70-KEYCSI    AND            179700      
002615                B70-SDO-KEYFEC = WKS-FECHA-HOY     AND            179800      
002616                B70-SDO-KEYPRD = WKS-B70-KEYPRD    AND            179900      
002617                B70-SDO-KEYINS > WKS-B70-KEYINS                   180000      
002618             ON EXCEPTION                                         180100      
002619                IF DMSTATUS(NOTFOUND)                             180200      
002620                   FIND FIRST B70SXPOSICION  AT                   180300      
002621                      B70-SDO-KEYCSI = WKS-B70-KEYCSI    AND      180400      
002622                      B70-SDO-KEYFEC = WKS-FECHA-HOY     AND      180500      
002623                      B70-SDO-KEYPRD > WKS-B70-KEYPRD             180600      
002624                   ON EXCEPTION                                   180700      
002625                      MOVE 1       TO W77-EOF                     180800      
002626                      IF DMSTATUS(NOTFOUND)                       180900      
002627                         NEXT SENTENCE                            181000      
002628                      ELSE                                        181100      
002629                         PERFORM 900000-CHE-STA                   181200      
002630                ELSE                                              181300      
002631                   PERFORM 900000-CHE-STA                         181400      
002632          ELSE                                                    181500      
002633             PERFORM 900000-CHE-STA.                              181600      
002634                                                                  181700      
002635 01-0555-GRABA-B70.                                               181800      
002636*==================                                               181900      
002637     LOCK B70SXPOSICION  AT                                       182000      
002638          B70-SDO-KEYCSI = WKS-B70-KEYCSI     AND                 182100      
002639          B70-SDO-KEYFEC = WKS-FECHA-MAN      AND                 182200      
002640          B70-SDO-KEYPRD = WKS-B70-KEYPRD     AND                 182300      
002641          B70-SDO-KEYINS = WKS-B70-KEYINS     AND                 182400      
002642          B70-SDO-KEYMON = WKS-B70-KEYMON                         182500      
002643        ON EXCEPTION                                              182600      
002644           IF DMSTATUS(NOTFOUND)                                  182700      
002645              CREATE S151B70POSICION                              182800      
002646           ELSE                                                   182900      
002647              PERFORM 900000-CHE-STA                              183000      
002648              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.            183100      
002649     MOVE WKS-B70-KEYCSI           TO B70-SDO-KEYCSI.             183200      
002650     MOVE WKS-FECHA-MAN            TO B70-SDO-KEYFEC.             183300      
002651     MOVE WKS-B70-KEYPRD           TO B70-SDO-KEYPRD.             183400      
002652     MOVE WKS-B70-KEYINS           TO B70-SDO-KEYINS.             183500      
002653     MOVE WKS-B70-KEYMON           TO B70-SDO-KEYMON.             183600      
002654     MOVE WKS-B70-SD(2)            TO B70-SDO-SD(1)               183700      
002655                                      B70-SDO-SD(2).              183800      
002656     STORE S151B70POSICION                                        183900      
002657        ON EXCEPTION                                              184000      
002658           PERFORM 900000-CHE-STA                                 184100      
002659           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.               184200      
002660                                                                  184300      
002661 01-0558-GRABA-B71.                                               184400      
002662*===================                                              184500      
002663     MOVE ZERO                     TO W77-EOF-B71.                184600      
002664     FIND FIRST B71SXPOSDIAAD1 AT                                 184700      
002665          B71-SDO-KEYFEC  = WKS-FECHA-HOY         AND             184800      
002666          B71-SDO-KEYPRD  = WKS-B70-KEYPRD        AND             184900      
002667          B71-SDO-KEYINS  = WKS-B70-KEYINS        AND             185000      
002668          B71-SDO-KEYMON  = WKS-B70-KEYMON        AND             185100      
002669          B71-SDO-KEYIND  = 26                                    185200      
002670       ON EXCEPTION                                               185300      
002671          IF DMSTATUS(NOTFOUND)                                   185400      
002672             MOVE 1                TO W77-EOF-B21                 185500      
002673           ELSE                                                   185600      
002674              PERFORM 900000-CHE-STA                              185700      
002675              MOVE 1               TO W77-EOF-B21.                185800      
002676                                                                  185900      
002677     IF W77-EOF-B71 = 0                                           186000      
002678        MOVE S151B71POSDIAAD1      TO WKS-B71-POSDIAAD1           186100      
002679        PERFORM 01-0559-LOCKB71                                   186200      
002680        IF W77-EOF-B71 = 0                                        186300      
002681           MOVE WKS-B71-SD(3)      TO B71-SDO-SD(3)               186400      
002682                                      B71-SDO-SD(2)               186500      
002683           STORE S151B71POSDIAAD1                                 186600      
002684              ON EXCEPTION                                        186700      
002685                 PERFORM 900000-CHE-STA                           186800      
002686                 CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.         186900      
002687                                                                  187000      
002688 01-0559-LOCKB71.                                                 187100      
002689*================                                                 187200      
002690     LOCK B71SXPOSDIAAD1 AT                                       187300      
002691          B71-SDO-KEYCSI  = WKS-B71-KEYCSI        AND             187400      
002692          B71-SDO-KEYFEC  = WKS-FECHA-MAN         AND             187500      
002693          B71-SDO-KEYPRD  = WKS-B71-KEYPRD        AND             187600      
002694          B71-SDO-KEYINS  = WKS-B71-KEYINS        AND             187700      
002695          B71-SDO-KEYMON  = WKS-B71-KEYMON        AND             187800      
002696          B71-SDO-KEYIND  = 26                                    187900      
002697       ON EXCEPTION                                               188000      
002698          IF DMSTATUS(NOTFOUND)                                   188100      
002699             CREATE S151B71POSDIAAD1                              188200      
002700             MOVE WKS-B71-KEYCSI     TO B71-SDO-KEYCSI            188300      
002701             MOVE WKS-FECHA-MAN      TO B71-SDO-KEYFEC            188400      
002702             MOVE WKS-B71-KEYPRD     TO B71-SDO-KEYPRD            188500      
002703             MOVE WKS-B71-KEYINS     TO B71-SDO-KEYINS            188600      
002704             MOVE WKS-B71-KEYMON     TO B71-SDO-KEYMON            188700      
002705             MOVE 26                 TO B71-SDO-KEYIND            188800      
002706          ELSE                                                    188900      
002707             IF DMSTATUS(DUPLICATES)                              189000      
002708                NEXT SENTENCE                                     189100      
002709             ELSE                                                 189200      
002710                PERFORM 900000-CHE-STA                            189300      
002711                MOVE 1             TO W77-EOF-B21.                189400      
002712                                                                  201700      
002713                                                                  209900      
002714 01-0590-ROTABASES.                                               210000      
002715*==================                                               210100      
002716     IF WKS-B03-NUMCICDIA > 0                                     210200      
002717        MOVE 1                     TO W77-IND-INICIALIZA          210300      
002718        MOVE WKS-B03-AAMM(1)       TO W77-AAMM-MENOR              210400      
002719        PERFORM 01-0592-BUSCA-INDICE                              210500      
002720                VARYING W77-IND FROM 1 BY 1                       210600      
002721                UNTIL   W77-IND > WKS-B03-NUMCICDIA               210700      
002722        MOVE 15                    TO WKS-B03F15-FUNCION          210800      
002723        MOVE WKS-PARAM-SISTEMA     TO WKS-B03F15-SISTEMA          210900      
002724        MOVE WKS-B03-AAMM(W77-IND-INICIALIZA)                     211000      
002725                                   TO WKS-B03F15-AAMMANT          211100      
002726        MOVE WKS-B03-NOMBDMOV(W77-IND-INICIALIZA)                 211200      
002727                                   TO WKS-B03F15-NOMBDMOV         211300      
002728                                      WKS-SAL-NOMBD12-INI         211400      
002729        MOVE WKS-B03-NUMBDMOV(W77-IND-INICIALIZA)                 211500      
002730                                   TO WKS-B03F15-NUMBDMOV         211600      
002731        MOVE WKS-FECMAN-AAMM       TO WKS-B03F15-AAMM             211700      
002732        MOVE ZERO                  TO WKS-B03F15-SECOK            211800      
002733                                      WKS-B03F15-SECINF           211900      
002734                                      WKS-B03F15-SECERR           212000      
002735                                      WKS-B03F15-STABDMOV         212100      
002736        CALL "CONSISMEN IN LIB-CONTROL"                           212200      
002737             USING  WKS-S151B03SISMEN-F15                         212300      
002738             GIVING W77-RES-LIBCTL.                               212400      
002739        IF W77-RES-LIBCTL > 0                                     212500      
002740           MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ       212551      
002741           MOVE W77-RES-LIBCTL     TO W77-ERR-LIBCTL              212600      
002742           MOVE 051001             TO CODIGO-LJ                   212700      
002743           MOVE "O"                TO TIPO-LJ                     212800      
002744           MOVE "ERROR EN GRABADO DE ROTACION DE BASES"           212900      
002745                                   TO TEXTO-LJ                    213300      
002746           MOVE TIPO-LJ        TO      WLI-TIPO-LJ                213351      
002747           MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ               213361      
002748           PERFORM  000-030-IMPRIME-MENSAJE                       213371      
002749           CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                213400      
002750                                       MENSAJE-LJ.                213500      
002751                                                                  213700      
002752        MOVE 1                        TO WKS-B03-FUNCION.         213800      
002753        MOVE WKS-PARAM-SISTEMA        TO WKS-B03-SISTEMA.         213900      
002754        CALL "CONSISMEN IN LIB-CONTROL" USING  WKS-S151B03SISMEN  214000      
002755                                        GIVING W77-RES-LIBCTL.    214100      
002756                                                                  214200      
002757        PERFORM 01-0594-GRABA-NUMBASE                             214300      
002758                VARYING W77-IND FROM 1 BY 1                       214400      
002759                UNTIL   W77-IND > WKS-B03-NUMCICDIA.              214500      
002760                                                                  214600      
002761 01-0592-BUSCA-INDICE.                                            214700      
002762*=====================                                            214800      
002763     IF WKS-B03-AAMM(W77-IND) < W77-AAMM-MENOR                    214900      
002764        MOVE W77-IND               TO W77-IND-INICIALIZA          215000      
002765        MOVE WKS-B03-AAMM(W77-IND) TO W77-AAMM-MENOR.             215100      
002766                                                                  215200      
002767 01-0594-GRABA-NUMBASE.                                           215300      
002768*======================                                           215400      
002769     ADD 1                         TO WKS-B03-NUMBDMOV(W77-IND).  215500      
002770     IF WKS-B03-NUMBDMOV(W77-IND)  > WKS-B03-NUMCICDIA            215600      
002771        MOVE 1                     TO WKS-B03-NUMBDMOV(W77-IND).  215700      
002772     MOVE 17                       TO WKS-B03F17-FUNCION.         215800      
002773     MOVE WKS-PARAM-SISTEMA        TO WKS-B03F17-SISTEMA.         215900      
002774     MOVE WKS-B03-NUMBDMOV(W77-IND) TO WKS-B03F17-NUMBDMOV.       216000      
002775     MOVE WKS-B03-AAMM(W77-IND)    TO WKS-B03F17-AAMM.            216100      
002776     MOVE ZERO                     TO W77-RES-LIBCTL.             216200      
002777     CALL "CONSISMEN IN LIB-CONTROL"                              216300      
002778          USING  WKS-S151B03SISMEN-F17                            216400      
002779          GIVING W77-RES-LIBCTL.                                  216500      
002780                                                                  216600      
002781     IF W77-RES-LIBCTL > 0                                        216700      
002782        MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ          216751      
002783        MOVE W77-RES-LIBCTL     TO W77-ERR-LIBCTL                 216800      
002784        MOVE 051001             TO CODIGO-LJ                      216900      
002785        MOVE "O"                TO TIPO-LJ                        217000      
002786        MOVE "ERROR EN ROTACION DE NUMERO DE BASE "               217100      
002787                               TO TEXTO-LJ                        217600      
002788        MOVE TIPO-LJ        TO      WLI-TIPO-LJ                   217651      
002789        MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                  217661      
002790        PERFORM  000-030-IMPRIME-MENSAJE                          217671      
002791        CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                   217700      
002792                                    MENSAJE-LJ.                   217800      
002793                                                                  218000      
002794 01-0596-NIVELBD11.                                               218100      
002795*==================                                               218200      
002796     LOCK  BASESDO ON EXCEPTION                                   218300      
002797                      PERFORM 900000-CHE-STA.                     218400      
002798     PERFORM 01-0598-BORRA-NIVELES                                218500      
002799             VARYING W77-IND FROM 1 BY 1                          218600      
002800             UNTIL   W77-IND > 31.                                218700      
002801     STORE BASESDO ON EXCEPTION                                   218800      
002802                      PERFORM 900000-CHE-STA.                     218900      
002803                                                                  219000      
002804 01-0598-BORRA-NIVELES.                                           219100      
002805*======================                                           219200      
002806     MOVE ZERO                     TO B00-SDO-LECARCDIA(W77-IND)  219300      
002807                                      B00-SDO-MOVCICDIA(W77-IND). 219400      
002808                                                                  219500      
002809*=================================================================219600      
002810*         BORRADO DE INFORMACION EN BASE HISTORICA               =219700      
002811*=================================================================219800      
002812                                                                  219900      
002813 01-0900-ERROR-CALE.                                              227300      
002814*===================                                              227400      
002815     MOVE SPACES       TO      WLI-ENCAB-52, TEXTO-LJ             227451      
002816     MOVE "I"                     TO TIPO-LJ                      227500      
002817     MOVE 051001                  TO CODIGO-LJ                    227600      
002818     MOVE W77-FUNCION             TO W77-ERR-CALE                 227700      
002819     STRING "FUNCION " W77-FUN-CALE  " ERROR "                    227800      
002820            " ERROR " W77-ERR-CALE                                227900      
002821     DELIMITED BY SIZE                                            228000      
002822     INTO TEXTO-LJ                                                228100      
002823     MOVE TIPO-LJ        TO      WLI-TIPO-LJ                      228151      
002824     MOVE TEXTO-LJ       TO      WLI-TEXTO-LJ                     228171      
002825     PERFORM  000-030-IMPRIME-MENSAJE                             228191      
002826     CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ                     228200      
002827                                  MENSAJE-LJ                      228300      
002828     CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                     228400      
002829                                                                  228500      
002830*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002831* COPY "S151/FORMATO/ERROR/DMSII."                                228600      
002832*      FROM 68000 TO 78000.                                       228601      
002833 900000-CHE-STA.                                                  068000      
002834     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
002835     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
002836     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
002837                                                                  069300      
002838     IF WKS-ERR-DMSII > ZEROS                                     070000      
002839        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
002840                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
002841                           " " WKS-ERR-DMSII                      073000      
002842                "TIPO        " WKS-ERR-BD                         074000      
002843                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
002844        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
002845        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
002846                                                                  078000      
002847*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
002848*INICIA CODIGO DE RENOVACION CRONOS 2000                          228602      
002849*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
002850*    COPY "S151/CRONOS2K/CPY/PD".                                 228603      
002851** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
002852** Unisys has defined for CRONOS2K project                     ** 000200      
002853** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
002854***************************************************************** 000400      
002855***************************************************************** 000600      
002856** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
002857** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
002858** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
002859** date MMDDCCAA, which is returned into the variable          ** 001000      
002860** A2K-FEC-MDCA-001.                                           ** 001100      
002861***************************************************************** 001200      
002862                                                                  001300      
002863 A2K-ACCEPT-TODAYS-DATE.                                          001400      
002864        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
002865*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
002866        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
002867        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
002868        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
002869        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
002870        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
002871                                                                  002200      
002872 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
002873        EXIT.                                                     002240      
002874                                                                  002500      
002875****************************************************************  002600      
002876** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
002877**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
002878**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
002879**baseyear to add the century to the year part.               **  003000      
002880**INPUT is A2K-FEC-AMD-001                                    **  003100      
002881**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
002882****************************************************************  003300      
002883                                                                  003400      
002884 A2K-CONV-AMD-TO-CAMD.                                            003500      
002885         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
002886         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
002887         IF A2K-FEC-AMD-001 = 0                                   003720      
002888            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
002889         ELSE                                                     003741      
002890          IF A2K-FEC-AMD-001 = 999999                             003742      
002891             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
002892         ELSE                                                     003760      
002893         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
002894                 A2K-OBTAIN-CENTURY-EXIT                          003900      
002895         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
002896         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
002897         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
002898         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
002899                                                                  004400      
002900 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
002901         EXIT.                                                    004600      
002902                                                                  004700      
002903******************************************************************004800      
002904**A2K-CONV-MDA-TO-MDCA.                                         **004900      
002905**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
002906** an eight digit format as MMDDCCAA. It use a                  **005100      
002907** baseyear to add century to the yaer.                         **005200      
002908** INPUT is A2K-FEC-MDA-001                                     **005300      
002909** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
002910                                                                  005500      
002911 A2K-CONV-MDA-TO-MDCA.                                            005600      
002912     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
002913     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
002914     IF A2K-FEC-MDA-001 = 0                                       005820      
002915        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
002916     ELSE                                                         005845      
002917      IF A2K-FEC-MDA-001 = 999999                                 005850      
002918         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
002919     ELSE                                                         005860      
002920     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
002921             A2K-OBTAIN-CENTURY-EXIT                              006000      
002922     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
002923     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
002924     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
002925     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
002926                                                                  006500      
002927 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
002928     EXIT.                                                        006700      
002929                                                                  006800      
002930***************************************************************** 006900      
002931**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
002932**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
002933**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
002934**baseyear to add century to the year.                         ** 007300      
002935**INPUT is A2K-FEC-DMA-001                                     ** 007400      
002936**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
002937                                                                  007600      
002938 A2K-CONV-DMA-TO-DMCA.                                            007700      
002939       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
002940       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
002941       IF  A2K-FEC-DMA-001   = 0                                  007920      
002942          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
002943       ELSE                                                       007945      
002944        IF A2K-FEC-DMA-001 = 999999                               007950      
002945          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
002946       ELSE                                                       007960      
002947       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
002948               A2K-OBTAIN-CENTURY-EXIT                            008100      
002949       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
002950       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
002951       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
002952       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
002953                                                                  008600      
002954 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
002955       EXIT.                                                      008800      
002956                                                                  008900      
002957***************************************************************** 009000      
002958** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
002959** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
002960** a 6 digit format as AAMMDD.                                 ** 009300      
002961** It simply removes the century information in the output     ** 009400      
002962** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
002963** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
002964                                                                  009700      
002965 A2K-CONV-CAMD-TO-AMD.                                            009800      
002966     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
002967     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
002968     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
002969     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
002970                                                                  010300      
002971 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
002972      EXIT.                                                       010500      
002973                                                                  010600      
002974******************************************************************010700      
002975******************************************************************010800      
002976** A2K-CONV-MDCA-TO-MDA.                                        **010900      
002977** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
002978** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
002979** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
002980** INPUT is A2K-FEC-MDCA-001                                    **011300      
002981** OUTPUT is A2K-FEC-MDA-001                                    **011400      
002982                                                                  011500      
002983 A2K-CONV-MDCA-TO-MDA.                                            011600      
002984     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
002985     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
002986     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
002987     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
002988                                                                  012100      
002989 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
002990      EXIT.                                                       012300      
002991                                                                  012400      
002992******************************************************************012500      
002993***************************************************************** 012600      
002994** A2K-CONV-DMCA-TO-DMA.                                        **012700      
002995** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
002996** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
002997** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
002998** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
002999** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
003000                                                                  013300      
003001 A2K-CONV-DMCA-TO-DMA.                                            013400      
003002     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
003003     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
003004     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
003005     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
003006                                                                  013900      
003007 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
003008      EXIT.                                                       014100      
003009                                                                  014200      
003010***************************************************************** 014300      
003011 A2K-CONV-MDCA-TO-CAMD.                                           014400      
003012      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
003013      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
003014      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
003015      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
003016      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
003017 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
003018      EXIT.                                                       015100      
003019***************************************************************** 015200      
003020** This paragraph adds century to an year field which is 9(02) ** 015300      
003021** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
003022** Output is A2K-FEC-CCAA-001.                                 ** 015600      
003023***************************************************************** 015700      
003024 A2K-CONV-AA-TO-CCAA.                                             015800      
003025      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
003026      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
003027              A2K-OBTAIN-CENTURY-EXIT.                            016100      
003028      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
003029 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
003030      EXIT.                                                       016400      
003031***************************************************************** 016500      
003032** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
003033** format.                                                     ** 016700      
003034** Input is A2K-FEC-DMCA-001.                                  ** 016800      
003035** Output is A2K-FEC-CAMD-001.                                 ** 016900      
003036***************************************************************** 017000      
003037 A2K-CONV-DMCA-TO-CAMD.                                           017100      
003038      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
003039      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
003040      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
003041      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
003042      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
003043 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
003044      EXIT.                                                       017800      
003045***************************************************************** 017900      
003046** This paragraph desides the Century to be added depending    ** 018000      
003047** on the base year.                                           ** 018100      
003048** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
003049** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
003050***************************************************************** 018400      
003051 A2K-OBTAIN-CENTURY.                                              018500      
003052      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
003053          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
003054      ELSE                                                        018800      
003055          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
003056 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
003057      EXIT.                                                       019100      
003058                                                                  019200      
003059***************************************************************** 019300      
003060** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
003061**  Format                                                     ** 019500      
003062** Input Is A2K-FEC-CAMD-001                                   ** 019600      
003063** Output Is A2K-FEC-DMCA-001                                  ** 019700      
003064***************************************************************** 019800      
003065 A2K-CONV-CAMD-TO-DMCA.                                           019900      
003066      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
003067      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
003068      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
003069      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
003070      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
003071                                                                  020500      
003072 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
003073      EXIT.                                                       020700      
003074                                                                  020800      
003075******************************************************************020900      
003076******************************************************************021000      
003077 A2K-CONV-AM-TO-CAM.                                              021100      
003078      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
003079      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
003080      IF A2K-FEC-AM-001 = 0                                       021220      
003081         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
003082      ELSE                                                        021245      
003083      IF A2K-FEC-AM-001 = 9999                                    021250      
003084         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
003085      ELSE                                                        021260      
003086      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
003087      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
003088      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
003089              A2K-OBTAIN-CENTURY-EXIT                             021600      
003090      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
003091                                                                  021800      
003092 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
003093      EXIT.                                                       022000      
003094                                                                  022100      
003095******************************************************************022200      
003096******************************************************************022300      
003097 A2K-CONV-CAM-TO-AM.                                              022400      
003098      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
003099      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
003100      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
003101                                                                  022800      
003102 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
003103   EXIT.                                                          023000      
003104                                                                  023100      
003105                                                                  023200      
003106                                                                  023500      
003107*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
003108 A2K-CPY-EXIT-PARA.                                               228604      
003109     EXIT.                                                        228605      
003110*TERMINA CODIGO DE RENOVACION CRONOS 2000                         228606      
003111                                                                  228700      
003112**** JCNS INI - ALTA DISPONIBILIDAD * IBM 21-01-15                228800      
003113                                                                  228900      
003114 01-00200-VERIFICA-B05.                                           229000      
003115***** CONSULTAR SI EXISTE B05 CON LA FECHA DE PROCESO             229100      
003116     MOVE 01                      TO WKS-B05-FUNCION              229200      
003117     MOVE WKS-PARAM-SISTEMA       TO WKS-B05-SISTEMA              229300      
003118     MOVE WKS-FECHA-HOY           TO WKS-B05-FCHPRO               229400      
003119     MOVE 197                     TO WKS-B05-NUMPRO               229500      
003120     MOVE ZEROS                   TO WKS-B05-FCHINI               229600      
003121                                     WKS-B05-NUMREGINI.           229700      
003122                                                                  229800      
003123     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      229900      
003124                                     GIVING W77-RESULT-LIBCON.    230000      
003125                                                                  230100      
003126     IF W77-RESULT-LIBCON = 0                                     230200      
003127          IF WKS-B05-STAPGM = 0                                   230300      
003128              NEXT SENTENCE                                       230400      
003129          ELSE                                                    230500      
003130             PERFORM 01-0150-GRABA-FEC151                         230550      
003131             PERFORM 01-0170-LEVANTA-L002                         230555      
003132             STOP RUN                                             230600      
003133     ELSE                                                         230700      
003134          PERFORM 01-00210-CREA-B05.                              230800      
003135                                                                  230900      
003136                                                                  231000      
003137 01-00210-CREA-B05.                                               231100      
003138     MOVE 19                      TO WKS-B05-FUNCION              231200      
003139     MOVE WKS-PARAM-SISTEMA       TO WKS-B05-SISTEMA              231300      
003140     MOVE WKS-FECHA-HOY           TO WKS-B05-FCHPRO               231400      
003141     MOVE 197                     TO WKS-B05-NUMPRO               231500      
003142     MOVE ZEROS                   TO WKS-B05-FCHINI               231600      
003143                                     WKS-B05-NUMREGINI.           231700      
003144                                                                  231800      
003145     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      231900      
003146                                    GIVING W77-RESULT-LIBCON.     232000      
003147                                                                  232100      
003148     IF W77-RESULT-LIBCON = 0                                     232200      
003149         NEXT SENTENCE                                            232300      
003150     ELSE                                                         232400      
003151         MOVE "I" TO TIPO-LJ                                      232500      
003152         MOVE 051010 TO CODIGO-LJ                                 232600      
003153         MOVE W77-RESULT-LIBCON            TO W77-ERROR           232700      
003154                                                                  232800      
003155         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  232900      
003156         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    233000      
003157                       WKS-B05-NUMPRO " " WKS-FECHA-HOY           233100      
003158         DELIMITED BY SIZE INTO TEXTO-LJ                          233200      
003159         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           233300      
003160                                           MENSAJE-LJ             233400      
003161         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 233500      
003162         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                233600      
003163         PERFORM 000-030-IMPRIME-MENSAJE.                         233700      
003164                                                                  233800      
003165                                                                  233900      
003166 01-00220-ACTUALIZA-B05.                                          234000      
003167     MOVE 37                      TO WKS-B05-FUNCION              234100      
003168     MOVE WKS-PARAM-SISTEMA       TO WKS-B05-SISTEMA              234200      
003169     MOVE WKS-FECHA-HOY           TO WKS-B05-FCHPRO               234300      
003170     MOVE 197                     TO WKS-B05-NUMPRO               234400      
003171     MOVE ZEROS                   TO WKS-B05-FCHINI               234500      
003172                                     WKS-B05-NUMREGINI            234600      
003173****** ESTATUS DE TERMINACION DEL PROCESO                         234700      
003174     MOVE 01                      TO WKS-B05-STAPGM.              234800      
003175                                                                  234900      
003176     CALL "B05PROCESOS IN LIB-CONTROL" USING WKS-B05PROCESOS      235000      
003177                                    GIVING W77-RESULT-LIBCON.     235100      
003178     IF W77-RESULT-LIBCON = 0                                     235200      
003179          NEXT SENTENCE                                           235300      
003180     ELSE                                                         235400      
003181         MOVE "I" TO TIPO-LJ                                      235500      
003182         MOVE 051010 TO CODIGO-LJ                                 235600      
003183         MOVE W77-RESULT-LIBCON            TO W77-ERROR           235700      
003184                                                                  235800      
003185         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  235900      
003186         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    236000      
003187                       WKS-B05-NUMPRO " " WKS-FECHA-HOY           236100      
003188         DELIMITED BY SIZE INTO TEXTO-LJ                          236200      
003189         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           236300      
003190                                           MENSAJE-LJ             236400      
003191         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 236500      
003192         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                236600      
003193         PERFORM 000-030-IMPRIME-MENSAJE.                         236700      
003194                                                                  236800      
003195**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 21-01-15                236900      
