000001$SET OPTIMIZE LIST                                                000100      
000002*INICIA CODIGO DE RENOVACION CRONOS 2000                          000101      
000003$SET LISTOMITTED                                                  000102      
000004$SET OLDCODE                                                      000103      
000005*TERMINA CODIGO DE RENOVACION CRONOS 2000                         000104      
000006 IDENTIFICATION DIVISION.                                         000200      
000007******************************************************************000300      
000008*   FUNCION : GENERAR A PARTIR DE LA BASE DE CONTROL ARCHIVOS    *000400      
000009*             QUE CONTENGAN LA INFORMACION DE LOS DATASETS       *000500      
000010*             B01SISDIA, B02ARCINTER, B03SISMEN, B04SISTEM       *000600      
000011*             B05PROCESOS, B09CONXSIS.                           *000700      
000012*                                                                *000710      
000013*   RECOMPILACION POR EL UPGRADE DEL MCP A 55                    *000712      
000014*   20141208 15MTP001 MJGRG                                      *000714      
000015******************************************************************000800      
000016                                                                  000900      
000017 ENVIRONMENT DIVISION.                                            001000      
000018 INPUT-OUTPUT SECTION.                                            001100      
000019 FILE-CONTROL.                                                    001200      
000020     SELECT A01-B01SISDIA          ASSIGN TO DISK.                001300      
000021     SELECT A02-B02ARCINTER        ASSIGN TO DISK.                001400      
000022     SELECT A03-B03SISMEN          ASSIGN TO DISK.                001500      
000023     SELECT A04-B04SISTEM          ASSIGN TO DISK.                001600      
000024     SELECT A06-B05PROCESOS        ASSIGN TO DISK.                001650      
000025     SELECT A05-B09CONXSIS         ASSIGN TO DISK.                001700      
000026     SELECT V00-REPORTE2           ASSIGN TO PRINTER.             001750      
000027 DATA DIVISION.                                                   001800      
000028 FILE SECTION.                                                    001900      
000029 FD  A01-B01SISDIA                                                002000      
000030*    RECORD CONTAINS 357 CHARACTERS                               002100      
000031*INICIA CODIGO DE RENOVACION CRONOS 2000                          002101      
000032     RECORD CONTAINS 370 CHARACTERS                               002102      
000033*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002103      
000034     BLOCK  CONTAINS 5  RECORDS                                   002200      
000035     VALUE  OF TITLE IS WKS-NOMARCH-B01SISDIA.                    002300      
000036                                                                  002400      
000037 01  A01-R00-SISDIA.                                              002500      
000038     03 A01-R00-SISTEMA            PIC 9(04) COMP.                002600      
000039     03 A01-R00-CSI                PIC 9(02) COMP.                002700      
000040*    03 A01-R00-FECPRO             PIC 9(06) COMP.                002800      
000041*INICIA CODIGO DE RENOVACION CRONOS 2000                          002801      
000042     03 A01-R00-FECPRO             PIC 9(08) COMP.                002802      
000043*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002803      
000044*    03 A01-R00-FECCON             PIC 9(06) COMP.                002900      
000045*INICIA CODIGO DE RENOVACION CRONOS 2000                          002901      
000046     03 A01-R00-FECCON             PIC 9(08) COMP.                002902      
000047*TERMINA CODIGO DE RENOVACION CRONOS 2000                         002903      
000048*    03 A01-R00-FECPROS151         PIC 9(06) COMP.                003000      
000049*INICIA CODIGO DE RENOVACION CRONOS 2000                          003001      
000050     03 A01-R00-FECPROS151         PIC 9(08) COMP.                003002      
000051*TERMINA CODIGO DE RENOVACION CRONOS 2000                         003003      
000052     03 A01-R00-STAREG             PIC 9(02) COMP.                003100      
000053     03 A01-R00-NOMARCSAL          PIC X(34).                     003200      
000054     03 A01-R00-NOMPACSAL          PIC X(17).                     003300      
000055     03 A01-R00-NOMARCMOV          PIC X(34).                     003400      
000056     03 A01-R00-NOMPACMOV          PIC X(17).                     003500      
000057     03 A01-R00-NOMARCDES          PIC X(34).                     003600      
000058     03 A01-R00-NOMPACDES          PIC X(17).                     003700      
000059     03 A01-R00-NOMARCERR          PIC X(34).                     003800      
000060     03 A01-R00-NOMPACERR          PIC X(17).                     003900      
000061     03 A01-R00-NOMBDSEM           PIC X(17).                     004000      
000062     03 A01-R00-STABDSEM           PIC 9(02) COMP.                004100      
000063     03 A01-R00-NUMARC             PIC 9(02) COMP.                004200      
000064     03 A01-R00-3ERNIV             PIC 9(02) COMP.                004300      
000065     03 A01-R00-CTL-DIA            OCCURS 10 TIMES.               004400      
000066*       05 A01-R00-FECARCMOV       PIC 9(06) COMP.                004500      
000067*INICIA CODIGO DE RENOVACION CRONOS 2000                          004501      
000068        05 A01-R00-FECARCMOV       PIC 9(08) COMP.                004502      
000069*TERMINA CODIGO DE RENOVACION CRONOS 2000                         004503      
000070        05 A01-R00-NIVARCMOV       PIC 9(08) COMP.                004600      
000071        05 A01-R00-NIVBDSEM        PIC 9(08) COMP.                004700      
000072        05 A01-R00-STAARCHLOG      PIC 9(02) COMP.                004800      
000073                                                                  004900      
000074 FD  A02-B02ARCINTER                                              005000      
000075     RECORD CONTAINS 612 CHARACTERS                               005100      
000076     BLOCK CONTAINS  7  RECORDS                                   005200      
000077     VALUE OF TITLE IS WKS-NOMARCH-B02ARCINTER.                   005300      
000078                                                                  005400      
000079 01  A02-R00-ARCINTER.                                            005500      
000080     03 A02-R00-SISTEMA            PIC 9(04) COMP.                005600      
000081     03 A02-R00-NOMARC028          PIC X(34).                     005700      
000082     03 A02-R00-NOMPAC028          PIC X(17).                     005800      
000083     03 A02-R00-NOMARC250          PIC X(34).                     005900      
000084     03 A02-R00-NOMPAC250          PIC X(17).                     006000      
000085     03 A02-R00-NOMARC030          PIC X(34).                     006100      
000086     03 A02-R00-NOMPAC030          PIC X(17).                     006200      
000087     03 A02-R00-NOMARC015          PIC X(34).                     006300      
000088     03 A02-R00-NOMPAC015          PIC X(17).                     006400      
000089     03 A02-R00-NOMARC050S         PIC X(34).                     006500      
000090     03 A02-R00-NOMPAC050S         PIC X(17).                     006600      
000091     03 A02-R00-NOMARC253          PIC X(34).                     006700      
000092     03 A02-R00-NOMPAC253          PIC X(17).                     006800      
000093     03 A02-R00-NOMARC264          PIC X(34).                     006900      
000094     03 A02-R00-NOMPAC264          PIC X(17).                     007000      
000095     03 A02-R00-NOMARC275S         PIC X(34).                     007100      
000096     03 A02-R00-NOMPAC275S         PIC X(17).                     007200      
000097     03 A02-R00-NOMARC275M         PIC X(34).                     007300      
000098     03 A02-R00-NOMPAC275M         PIC X(17).                     007400      
000099     03 A02-R00-NOMARCSIG          PIC X(34).                     007500      
000100     03 A02-R00-NOMPACSIG          PIC X(17).                     007600      
000101     03 A02-R00-NOMARC750          PIC X(34).                     007700      
000102     03 A02-R00-NOMPAC750          PIC X(17).                     007800      
000103     03 A02-R00-NOMARC136          PIC X(34).                     007900      
000104     03 A02-R00-NOMPAC136          PIC X(17).                     008000      
000105                                                                  008100      
000106 FD  A03-B03SISMEN                                                008200      
000107*    RECORD CONTAINS 240  CHARACTERS                              008300      
000108*INICIA CODIGO DE RENOVACION CRONOS 2000                          008301      
000109     RECORD CONTAINS 241  CHARACTERS                              008302      
000110*TERMINA CODIGA DE RENOVACION CRONOS 2000                         008303      
000111     BLOCK  CONTAINS   3  RECORDS                                 008400      
000112     VALUE OF TITLE IS WKS-NOMARCH-B03SISMEN.                     008500      
000113                                                                  008600      
000114 01  A03-R00-SISMEN.                                              008700      
000115     03 A03-R00-SISTEMA            PIC 9(04) COMP.                008800      
000116     03 A03-R00-MODSIS             PIC 9(02) COMP.                008900      
000117     03 A03-R00-RESCSI             PIC 9(02) COMP.                009000      
000118     03 A03-R00-TIPBD              PIC 9(02) COMP.                009100      
000119     03 A03-R00-NUMCICDIA          PIC 9(04) COMP.                009200      
000120     03 A03-R00-NUMCICMES          PIC 9(04) COMP.                009300      
000121     03 A03-R00-NOMBDSAL           PIC X(17).                     009400      
000122     03 A03-R00-STABDSAL           PIC 9(02) COMP.                009500      
000123     03 A03-R00-NOMBDMOVHI         PIC X(17).                     009600      
000124     03 A03-R00-SECOKHI            PIC 9(10) COMP.                009700      
000125     03 A03-R00-SECINFHI           PIC 9(10) COMP.                009800      
000126     03 A03-R00-SECERRHI           PIC 9(10) COMP.                009900      
000127     03 A03-R00-STABDMOVHI         PIC 9(02) COMP.                010000      
000128     03 A03-R00-CTL-MEN            OCCURS 5 TIMES.                010100      
000129        05 A03-R00-NOMBDMOV        PIC X(17).                     010200      
000130        05 A03-R00-NUMBDMOV        PIC 9(02) COMP.                010300      
000131*       05 A03-R00-AAMM            PIC 9(04) COMP.                010400      
000132*INICIA CODIGO DE RENOVACION CRONOS 2000                          010401      
000133        05 A03-R00-AAMM            PIC 9(06) COMP.                010402      
000134*TERMINA CODIGO DE RENOVACION CRONOS 2000                         010403      
000135        05 A03-R00-SECOK           PIC 9(10) COMP.                010500      
000136        05 A03-R00-SECINF          PIC 9(10) COMP.                010600      
000137        05 A03-R00-SECERR          PIC 9(10) COMP.                010700      
000138        05 A03-R00-STABDMOV        PIC 9(02) COMP.                010800      
000139                                                                  010900      
000140 FD  A04-B04SISTEM                                                011000      
000141     RECORD CONTAINS 67   CHARACTERS                              011100      
000142     BLOCK  CONTAINS 8    RECORDS                                 011200      
000143     VALUE OF TITLE IS WKS-NOMARCH-B04SISTEM.                     011300      
000144                                                                  011400      
000145 01  A04-R00-SISTEM.                                              011500      
000146     03 A04-R00-SISTEMA            PIC 9(04) COMP.                011600      
000147     03 A04-R00-PROD               PIC 9(04) COMP.                011700      
000148     03 A04-R00-INST               PIC 9(04) COMP.                011800      
000149     03 A04-R00-NOMCOR             PIC X(20).                     011900      
000150     03 A04-R00-NOMLAR             PIC X(40).                     012000      
000151     03 A04-R00-STATUS             PIC 9(02) COMP.                012100      
000152                                                                  012200      
000153 FD  A06-B05PROCESOS                                              012205      
000154     RECORD CONTAINS 75   CHARACTERS                              012210      
000155     BLOCK  CONTAINS 36   RECORDS                                 012215      
000156     VALUE OF TITLE IS WKS-NOMARCH-B05SISTEMA.                    012220      
000157                                                                  012225      
000158 01  A06-R00-PROCESOS.                                            012230      
000159     03 A06-R00-SISTEMA            PIC 9(04) COMP.                012235      
000160     03 A06-R00-FCHPRO             PIC 9(08) COMP.                012240      
000161     03 A06-R00-NUMPRO             PIC 9(04) COMP.                012245      
000162     03 A06-R00-NOMPGM             PIC X(04).                     012250      
000163     03 A06-R00-STAPGM             PIC 9(02) COMP.                012255      
000164     03 A06-R00-MIX                PIC 9(08) COMP.                012260      
000165     03 A06-R00-FCHINI             PIC 9(08) COMP.                012265      
000166     03 A06-R00-HORAINI            PIC 9(06) COMP.                012270      
000167     03 A06-R00-FCHFIN             PIC 9(08) COMP.                012275      
000168     03 A06-R00-HORAFIN            PIC 9(06) COMP.                012280      
000169     03 A06-R00-NUMREGINI          PIC 9(08) COMP.                012285      
000170     03 A06-R00-NUMREGFIN          PIC 9(08) COMP.                012290      
000171                                                                  012295      
000172 FD  A05-B09CONXSIS                                               012300      
000173     RECORD CONTAINS  22  CHARACTERS                              012400      
000174     BLOCK  CONTAINS  8   RECORDS                                 012500      
000175     VALUE OF TITLE IS WKS-NOMARCH-B09CONXSIS.                    012600      
000176                                                                  012700      
000177 01  A05-R00-CONXSIS.                                             012800      
000178     03 A05-R00-SISTEMA            PIC 9(04) COMP.                012900      
000179     03 A05-R00-PRO                PIC 9(04) COMP.                013000      
000180     03 A05-R00-INS                PIC 9(04) COMP.                013100      
000181     03 A05-R00-NUM-REN            PIC 9(02) COMP.                013200      
000182     03 A05-R00-NOM-REN            PIC X(15).                     013300      
000183                                                                  013400      
000184 FD  V00-REPORTE2                                                 013450      
000185     VALUE OF TITLE IS WKS-TIT-REPORTE2.                          013451      
000186                                                                  013452      
000187 01  V00-R00-REPORTE2                  PIC X(132).                013453      
000188                                                                  013500      
000189 DATA-BASE SECTION.                                               013600      
000190 DB  S151BD99CONTROL.                                             013700      
000191 WORKING-STORAGE SECTION.                                         013800      
000192*INICIA CODIGO DE RENOVACION CRONOS 2000                          013801      
000193*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000194* COPY "S151/CRONOS2K/CPY/WS".                                    013802      
000195******************************************************************000100      
000196** This copyBook defines all the additional variables that      **000200      
000197** Unisys has defined for the CRONOS2K project                  **000300      
000198** Include this CopyBook into the WORKING-STORAGE SECTION.      **000400      
000199******************************************************************000500      
000200                                                                  000600      
000201******************************************************************000700      
000202** These Variables are used to Accept the system date in long   **000800      
000203** format and get the century information                       **000900      
000204** FORMAT OF THE DATE RETURNED IS MM/DD/CCAA                      001000      
000205 01 A2K-SYSTEM-FECHA      PIC X(10) TYPE IS NUMERIC-DATE.         001100      
000206 01 A2K-SYSTEM-FECHA-R REDEFINES A2K-SYSTEM-FECHA.                001200      
000207    05 A2K-SYSTEM-FECHA-MM PIC X(2).                              001300      
000208    05 FILLER      PIC X(1).                                      001400      
000209    05 A2K-SYSTEM-FECHA-DD   PIC X(2).                            001500      
000210    05 FILLER      PIC X(1).                                      001600      
000211    05 A2K-SYSTEM-FECHA-CCAA PIC X(4).                            001700      
000212    05 A2K-SYSTEM-FECHA-CCAA-R REDEFINES A2K-SYSTEM-FECHA-CCAA.   001800      
000213      10 A2K-SYSTEM-FECHA-CC PIC X(2).                            001900      
000214      10 A2K-SYSTEM-FECHA-AA PIC X(2).                            002000      
000215******************************************************************002100      
000216                                                                  002200      
000217******************************************************************002300      
000218** This variable defines a date in the format MMDDCCAA          **002400      
000219**                                                              **002500      
000220 01 A2K-FEC-MDCA-001   PIC 9(8).                                  002600      
000221 01 A2K-FEC-MDCA-001-R REDEFINES A2K-FEC-MDCA-001.                002700      
000222    05 A2K-FEC-MDCA-MM-001   PIC 9(2).                            002800      
000223    05 A2K-FEC-MDCA-DD-001   PIC 9(2).                            002900      
000224    05 A2K-FEC-MDCA-CA-001   PIC 9(4).                            003000      
000225    05 A2K-FEC-MDCA-CA-001-R REDEFINES  A2K-FEC-MDCA-CA-001.      003100      
000226      10 A2K-FEC-MDCA-CC-001   PIC 9(2).                          003200      
000227      10 A2K-FEC-MDCA-AA-001   PIC 9(2).                          003300      
000228******************************************************************003400      
000229                                                                  003500      
000230******************************************************************003600      
000231** This variable defines a date in the format CCAAMMDD          **003700      
000232**                                                              **003800      
000233 01 A2K-FEC-CAMD-001   PIC 9(8).                                  003900      
000234 01 A2K-FEC-CAMD-001-R REDEFINES A2K-FEC-CAMD-001.                004000      
000235    05 A2K-FEC-CAMD-CA-001   PIC 9(4).                            004100      
000236    05 A2K-FEC-CAMD-CA-001-R REDEFINES  A2K-FEC-CAMD-CA-001.      004200      
000237      10 A2K-FEC-CAMD-CC-001   PIC 9(2).                          004300      
000238      10 A2K-FEC-CAMD-AA-001   PIC 9(2).                          004400      
000239    05 A2K-FEC-CAMD-MM-001   PIC 9(2).                            004500      
000240    05 A2K-FEC-CAMD-DD-001   PIC 9(2).                            004600      
000241******************************************************************004700      
000242                                                                  004800      
000243******************************************************************004900      
000244** This variable defines a date in the format DDMMCCAA          **005000      
000245**                                                              **005100      
000246 01 A2K-FEC-DMCA-001   PIC 9(8).                                  005200      
000247 01 A2K-FEC-DMCA-001-R REDEFINES A2K-FEC-DMCA-001.                005300      
000248    05 A2K-FEC-DMCA-DD-001   PIC 9(2).                            005400      
000249    05 A2K-FEC-DMCA-MM-001   PIC 9(2).                            005500      
000250    05 A2K-FEC-DMCA-CA-001   PIC 9(4).                            005600      
000251    05 A2K-FEC-DMCA-CA-001-R REDEFINES  A2K-FEC-DMCA-CA-001.      005700      
000252      10 A2K-FEC-DMCA-CC-001   PIC 9(2).                          005800      
000253      10 A2K-FEC-DMCA-AA-001   PIC 9(2).                          005900      
000254******************************************************************006000      
000255                                                                  006100      
000256******************************************************************006200      
000257** This variable defines a date in the Julian Format CCAADDD    **006300      
000258**                                                              **006400      
000259 01 A2K-FEC-JUL-CADDD-001   PIC 9(7).                             006500      
000260 01 A2K-FEC-JUL-CADDD-001-R REDEFINES A2K-FEC-JUL-CADDD-001.      006600      
000261    05 A2K-FEC-JUL-CADDD-CA-001   PIC 9(4).                       006700      
000262    05 A2K-FEC-JUL-CADDD-CA-001-R REDEFINES                       006800      
000263                   A2K-FEC-JUL-CADDD-CA-001.                      006900      
000264      10 A2K-FEC-JUL-CADDD-CC-001   PIC 9(2).                     007000      
000265      10 A2K-FEC-JUL-CADDD-AA-001   PIC 9(2).                     007100      
000266    05 A2K-FEC-JUL-CADDD-DDD-001  PIC 9(3).                       007200      
000267******************************************************************007300      
000268                                                                  007400      
000269******************************************************************007500      
000270** This variable defines a date in the format AAMMDD            **007600      
000271**                                                              **007700      
000272 01 A2K-FEC-AMD-001   PIC 9(6).                                   007800      
000273 01 A2K-FEC-AMD-001-R REDEFINES A2K-FEC-AMD-001.                  007900      
000274    05 A2K-FEC-AMD-AA-001   PIC 9(2).                             008000      
000275    05 A2K-FEC-AMD-MM-001   PIC 9(2).                             008100      
000276    05 A2K-FEC-AMD-DD-001   PIC 9(2).                             008200      
000277******************************************************************008300      
000278                                                                  008400      
000279******************************************************************008500      
000280** This variable defines a date in the format MMDDAA            **008600      
000281**                                                              **008700      
000282 01 A2K-FEC-MDA-001   PIC 9(6).                                   008800      
000283 01 A2K-FEC-MDA-001-R REDEFINES A2K-FEC-MDA-001.                  008900      
000284    05 A2K-FEC-MDA-MM-001   PIC 9(2).                             009000      
000285    05 A2K-FEC-MDA-DD-001   PIC 9(2).                             009100      
000286    05 A2K-FEC-MDA-AA-001   PIC 9(2).                             009200      
000287******************************************************************009300      
000288                                                                  009400      
000289******************************************************************009500      
000290** This variable defines a date in the format DDMMAA            **009600      
000291**                                                              **009700      
000292 01 A2K-FEC-DMA-001   PIC 9(6).                                   009800      
000293 01 A2K-FEC-DMA-001-R REDEFINES A2K-FEC-DMA-001.                  009900      
000294    05 A2K-FEC-DMA-DD-001   PIC 9(2).                             010000      
000295    05 A2K-FEC-DMA-MM-001   PIC 9(2).                             010100      
000296    05 A2K-FEC-DMA-AA-001   PIC 9(2).                             010200      
000297******************************************************************010300      
000298                                                                  010400      
000299******************************************************************010500      
000300** These variables are defined to be used for CALL bridge logic **010600      
000301**                                                              **010700      
000302 01 A2K-BRIDGE-FEC-MDA-001   PIC 9(6).                            010800      
000303 01 A2K-BRIDGE-FEC-MDA-002   PIC 9(6).                            010900      
000304 01 A2K-BRIDGE-FEC-AMD-001   PIC 9(6).                            011000      
000305 01 A2K-BRIDGE-FEC-AMD-002   PIC 9(6).                            011100      
000306 01 A2K-BRIDGE-FEC-DMA-001   PIC 9(6).                            011200      
000307 01 A2K-BRIDGE-FEC-DMA-002   PIC 9(6).                            011300      
000308******************************************************************011400      
000309                                                                  011500      
000310******************************************************************011600      
000311** This variable is used for converting only a year field AA to **011700      
000312** CCAA and a CCAA to AA                                        **011800      
000313 01 A2K-FEC-CCAA-001   PIC 9(4).                                  011900      
000314 01 A2K-FEC-CCAA-001-R REDEFINES A2K-FEC-CCAA-001.                012000      
000315    05 A2K-FEC-CCAA-CC-001   PIC 9(2).                            012100      
000316    05 A2K-FEC-CCAA-AA-001   PIC 9(2).                            012200      
000317 01 A2K-FEC-YEAR-AA    PIC 9(2).                                  012220      
000318 01 A2K-FEC-YEAR-CC    PIC 9(2).                                  012240      
000319******************************************************************012300      
000320                                                                  012400      
000321******************************************************************012500      
000322** These variables are Bridge Variables for Intercambio files   **012600      
000323** para EDOCTA                                                  **012700      
000324 01 A2K-BRIDGE-EDOCTA-MOV-FECINI     PIC 9(8).                    012800      
000325 01 A2K-BRIDGE-EDOCTA-MOV-FECFIN     PIC 9(8) COMP.               012900      
000326 01 A2K-BRIDGE-EDOCTA-HDR-FEC-BASE   PIC 9(8).                    013000      
000327 01 A2K-BRIDGE-EDOCTA-HDR-FEC-PROC   PIC 9(8).                    013100      
000328 01 A2K-BRIDGE-EDOCTA-INS-FEC-INI    PIC 9(8) COMP.               013200      
000329 01 A2K-BRIDGE-EDOCTA-MOV-FEC-FIN    PIC 9(8) COMP.               013300      
000330 01 A2K-BRIDGE-EDOCTA-MOV-FECPROC    PIC 9(8) COMP.               013400      
000331******************************************************************013500      
000332* Para MODULO                                                     013600      
000333 01 A2K-BRIDGE-HDR-FEC-PROCES       PIC 9(8).                     013700      
000334******************************************************************013800      
000335******************************************************************013900      
000336** Para FMOVSCHABO                                                014000      
000337 01 A2K-BRIDGE-HDR-FECHA-PAGO       PIC 9(8).                     014100      
000338******************************************************************014200      
000339                                                                  014300      
000340******************************************************************014400      
000341***  These Variables Are Defined For Date In CCAAMM Format     ***014500      
000342******************************************************************014600      
000343                                                                  014700      
000344 01 A2K-FEC-CAM-001                 PIC 9(6).                     014800      
000345 01 A2K-FEC-CAM-001-R REDEFINES A2K-FEC-CAM-001.                  014900      
000346     05 A2K-FEC-CAM-CC-001          PIC 9(2).                     015000      
000347     05 A2K-FEC-CAM-AA-001          PIC 9(2).                     015100      
000348     05 A2K-FEC-CAM-MM-001          PIC 9(2).                     015200      
000349******************************************************************015300      
000350                                                                  015400      
000351******************************************************************015500      
000352***  These Variables Are Defined For Date In AAMM Format       ***015600      
000353******************************************************************015700      
000354                                                                  015800      
000355 01 A2K-FEC-AM-001                  PIC 9(4).                     015900      
000356 01 A2K-FEC-AM-001-R REDEFINES A2K-FEC-AM-001.                    016000      
000357     05 A2K-FEC-AM-AA-001           PIC 9(2).                     016100      
000358     05 A2K-FEC-AM-MM-001           PIC 9(2).                     016200      
000359******************************************************************016300      
000360                                                                  016400      
000361                                                                  016500      
000362*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000363  01  A2K-BASE-YEAR     PIC 9(02) VALUE   50.                     013803      
000364*TERMINA CODIGO DE RENOVACION CRONOS 2000                         013804      
000365*HSC IBM ALTA DISPONIBILIDAD INI                                  013810      
000366  01  W77-VALUE         PIC 9(08) VALUE    0.                     013815      
000367*HSC IBM ALTA DISPONIBILIDAD FIN                                  013900      
000368**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                013901      
000369*================================================================ 013902      
000370*  ENTRY POINT B05PROCESOS.-ACCESA EL DATASET S151B05PROCESOS   = 013903      
000371*                                                               = 013904      
000372*  FUNCION                                                      = 013905      
000373*    1       CONSULTA SOBRE EL DATA SET DE PROCESOS.            = 013906      
000374*   19       ALTAS.                                             = 013907      
000375*   22       BAJAS                                              = 013908      
000376*   37       CAMBIOS.                                           = 013909      
000377*                                                               = 013910      
000378*   DATOS REQUERIDOS : SISTEMA                                  = 013911      
000379*                      FECHA DE PROCESO                         = 013912      
000380*                      NUMERO DE PROCESO                        = 013913      
000381*                      FECHA INICIO                             = 013914      
000382*                      REGISTRO INICIAL                         = 013915      
000383*================================================================ 013916      
000384                                                                  013917      
000385 01  WKS-B05PROCESOS    WITH LOWER-BOUNDS.                        013918      
000386     03 WKS-B05-FUNCION            PIC 9(02).                     013919      
000387     03 WKS-B05-SISTEMA            PIC 9(04).                     013920      
000388     03 WKS-B05-FCHPRO             PIC 9(08).                     013921      
000389     03 WKS-B05-NUMPRO             PIC 9(04).                     013922      
000390     03 WKS-B05-NOMPGM             PIC X(04).                     013923      
000391     03 WKS-B05-STAPGM             PIC 9(02).                     013924      
000392     03 WKS-B05-MIX                PIC 9(08).                     013925      
000393     03 WKS-B05-FCHINI             PIC 9(06).                     013926      
000394     03 WKS-B05-HORAINI            PIC 9(06).                     013927      
000395     03 WKS-B05-FCHFIN             PIC 9(06).                     013928      
000396     03 WKS-B05-HORAFIN            PIC 9(06).                     013929      
000397     03 WKS-B05-NUMREGINI          PIC 9(08).                     013930      
000398     03 WKS-B05-NUMREGFIN          PIC 9(08).                     013931      
000399                                                                  013932      
000400*================================================================ 013933      
000401* FUNCION 1.- CONSULTA DEL DATASET S151B01SISDIA                = 013934      
000402*                                                               = 013935      
000403* ENTRADA REQUERIDA :                                           = 013936      
000404*                                                               = 013937      
000405*   WKS-B01-FUNCION : FUNCION = 01.                             = 013938      
000406*   WKS-B01-SISTEMA : SISTEMA.                                  = 013939      
000407*   WKS-B01-CSI     : NUMERO DE CSI.                            = 013940      
000408*================================================================ 013941      
000409 01 WKS-S151B01SISDIA WITH LOWER-BOUNDS.                          013942      
000410    03 WKS-B01-FUNCION             PIC 9(02).                     013943      
000411    03 WKS-B01-SISTEMA             PIC 9(04).                     013944      
000412    03 WKS-B01-CSI                 PIC 9(02).                     013945      
000413    03 WKS-B01-FECPRO              PIC 9(08).                     013946      
000414    03 WKS-B01-FECCON              PIC 9(08).                     013947      
000415    03 WKS-B01-FECPRO151           PIC 9(08).                     013948      
000416    03 WKS-B01-STAREG              PIC 9(02).                     013949      
000417    03 WKS-B01-NOMARCSAL           PIC X(34).                     013950      
000418    03 WKS-B01-NOMPACSAL           PIC X(17).                     013951      
000419    03 WKS-B01-NOMARCMOV           PIC X(34).                     013952      
000420    03 WKS-B01-NOMPACMOV           PIC X(17).                     013953      
000421    03 WKS-B01-NOMARCDES           PIC X(34).                     013954      
000422    03 WKS-B01-NOMPACDES           PIC X(17).                     013955      
000423    03 WKS-B01-NOMARCERR           PIC X(34).                     013956      
000424    03 WKS-B01-NOMPACERR           PIC X(17).                     013957      
000425    03 WKS-B01-NOMBDSEM            PIC X(17).                     013958      
000426    03 WKS-B01-STABDSEM            PIC 9(02).                     013959      
000427    03 WKS-B01-NUMARC              PIC 9(02).                     013960      
000428    03 WKS-B01-3ERNIV              PIC 9(02).                     013961      
000429    03 WKS-B01-CTL-DIA     OCCURS 10 TIMES.                       013962      
000430       05 WKS-B01-FECARCMOV        PIC 9(08).                     013963      
000431       05 WKS-B01-NIVARCMOV        PIC 9(08).                     013964      
000432       05 WKS-B01-NIVBDMOV         PIC 9(08).                     013965      
000433       05 WKS-B01-STAARCLOG        PIC 9(02).                     013966      
000434                                                                  013967      
000435** VARIABLES PARA ALMACENAR EL ERROR Y LA FECHA DE PROCESO        013968      
000436 77 W77-ERROR                      PIC 9(02).                     013969      
000437 77 WKS-FECHA-PROC                 PIC 9(08).                     013970      
000438 77 W77-RESULT-LIBCON              PIC 9(02).                     013971      
000439*** VARIABLES PARA USO DE LIBRERIA                                013972      
000440 01 WKS-CTLVER-LIBID             PIC X(12).                       013973      
000441 01 WKS-CTLVER-NOMLIB            PIC X(72).                       013974      
000442 01 W77-CTLVER-RESULT            PIC S9(11) BINARY.               013975      
000443                                                                  013976      
000444**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                013977      
000445                                                                  013978      
000446*==========================================================       014000      
000447*         VARIABLES LIBRERIA DE DESPLIEGE                 =       014100      
000448*==========================================================       014200      
000449                                                                  014300      
000450*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000451* COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".           014400      
000452**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ      100100      
000453  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                  100200      
000454  01 MENSAJE-LJ.                                                  100300      
000455     02 SISTEMA-LJ     PIC X(04).                                 100400      
000456     02 FILLER         PIC X VALUE "/".                           100500      
000457     02 PASO-LJ        PIC X(04).                                 100600      
000458     02 FILLER         PIC X VALUE "/".                           100700      
000459     02 MTP-LJ         PIC 9(03).                                 100800      
000460     02 FILLER         PIC X VALUE ":".                           100900      
000461     02 TIPO-LJ        PIC X.                                     101000      
000462     02 FILLER         PIC X VALUE ">".                           101100      
000463     02 CODIGO-LJ      PIC 9(06).                                 101200      
000464     02 FILLER         PIC X VALUE "<".                           101300      
000465     02 TEXTO-LJ       PIC X(250).                                101400      
000466*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000467                                                                  014500      
000468 01  WKS-NOMARCH-B01SISDIA.                                       014600      
000469     03 FILLER                     PIC X(26)                      014700      
000470        VALUE "(S151)S151/FILE/B01SISDIA/".                       014800      
000471     03 WKS-FECHA-B01SISDIA        PIC 9(06).                     014900      
000472     03 FILLER                     PIC X(10)                      015000      
000473        VALUE " ON CMEMP.".                                       015100      
000474                                                                  015200      
000475 01  WKS-NOMARCH-B02ARCINTER.                                     015300      
000476     03 FILLER                     PIC X(28)                      015400      
000477        VALUE "(S151)S151/FILE/B02ARCINTER/".                     015500      
000478     03 WKS-FECHA-B02ARCINTER      PIC 9(06).                     015600      
000479     03 FILLER                     PIC X(10)                      015700      
000480        VALUE " ON CMEMP.".                                       015800      
000481                                                                  015900      
000482 01  WKS-NOMARCH-B03SISMEN.                                       016000      
000483     03 FILLER                     PIC X(26)                      016100      
000484        VALUE "(S151)S151/FILE/B03SISMEN/".                       016200      
000485     03 WKS-FECHA-B03SISMEN        PIC 9(06).                     016300      
000486     03 FILLER                     PIC X(10)                      016400      
000487        VALUE " ON CMEMP.".                                       016500      
000488                                                                  016600      
000489 01  WKS-NOMARCH-B04SISTEM.                                       016700      
000490     03 FILLER                     PIC X(26)                      016800      
000491        VALUE "(S151)S151/FILE/B04SISTEM/".                       016900      
000492     03 WKS-FECHA-B04SISTEM        PIC 9(06).                     017000      
000493     03 FILLER                     PIC X(10)                      017100      
000494        VALUE " ON CMEMP.".                                       017200      
000495                                                                  017300      
000496 01  WKS-NOMARCH-B05SISTEMA.                                      017310      
000497     03 FILLER                     PIC X(28)                      017320      
000498        VALUE "(S151)S151/FILE/B05PROCESOS/".                     017330      
000499     03 WKS-FECHA-B05SISTEMA       PIC 9(06).                     017340      
000500     03 FILLER                     PIC X(10)                      017350      
000501        VALUE " ON CMEMP.".                                       017360      
000502                                                                  017370      
000503 01  WKS-NOMARCH-B09CONXSIS.                                      017400      
000504     03 FILLER                     PIC X(27)                      017500      
000505        VALUE "(S151)S151/FILE/B09CONXSIS/".                      017600      
000506     03 WKS-FECHA-B09CONXSIS       PIC 9(06).                     017700      
000507     03 FILLER                     PIC X(10)                      017800      
000508        VALUE " ON CMEMP.".                                       017900      
000509                                                                  018000      
000510 01  WKS-DATOSHOST.                                               018050      
000511     03 WKS-DH-NUMCSI              PIC 9(02).                     018051      
000512     03 WKS-DH-NOMEQUIPO           PIC X(10).                     018052      
000513     03 WKS-DH-NOMCSI              PIC X(26).                     018053      
000514     03 WKS-DH-LINEABATCH          PIC X(05).                     018054      
000515                                                                  018055      
000516 77 W77-EOF                        PIC 9(01).                     018100      
000517 77 W77-IND                        PIC 9(02).                     018200      
000518 77 W77-IND2                       PIC 9(02).                     018250      
000519                                                                  018280      
000520*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000521* COPY "S151/FORMATO/ERROR/DMSII" FROM 1000 TO  60000.            018300      
000522                                                                  001000      
000523                                                                  002000      
000524                                                                  003000      
000525*=================================================================004000      
000526*==            FORMATO PARA MANEJO DE ERRORES DE DMSII         ===005000      
000527*=================================================================006000      
000528                                                                  007000      
000529                                                                  008000      
000530                                                                  009000      
000531 01 WKS-NOM-BDERR-DMSII            PIC  X(20).                    010000      
000532 77 WKS-ERR-DMSII                  PIC  9(02)    VALUE ZEROS.     011000      
000533 01 WKS-TAB-ERRDMSII.                                             012000      
000534    02 FILLER                      PIC X(20)     VALUE            013000      
000535    "NOTFOUND          01".                                       014000      
000536    02 FILLER                      PIC X(20)     VALUE            015000      
000537    "DUPLICATES        02".                                       016000      
000538    02 FILLER                      PIC X(20)     VALUE            017000      
000539    "DEADLOCK          03".                                       018000      
000540    02 FILLER                      PIC X(20)     VALUE            019000      
000541    "DATAERROR         04".                                       020000      
000542    02 FILLER                      PIC X(20)     VALUE            021000      
000543    "NOTLOCKED         05".                                       022000      
000544    02 FILLER                      PIC X(20)     VALUE            023000      
000545    "KEYCHANGE         06".                                       024000      
000546    02 FILLER                      PIC X(20)     VALUE            025000      
000547    "SYSTEMERROR       07".                                       026000      
000548    02 FILLER                      PIC X(20)     VALUE            027000      
000549    "READONLY          08".                                       028000      
000550    02 FILLER                      PIC X(20)     VALUE            029000      
000551    "IOERROR           09".                                       030000      
000552    02 FILLER                      PIC X(20)     VALUE            031000      
000553    "LIMITERROR        10".                                       032000      
000554    02 FILLER                      PIC X(20)     VALUE            033000      
000555    "OPENERROR         11".                                       034000      
000556    02 FILLER                      PIC X(20)     VALUE            035000      
000557    "CLOSEERROR        12".                                       036000      
000558    02 FILLER                      PIC X(20)     VALUE            037000      
000559    "NORECORD          13".                                       038000      
000560    02 FILLER                      PIC X(20)     VALUE            039000      
000561    "INUSE             14".                                       040000      
000562    02 FILLER                      PIC X(20)     VALUE            041000      
000563    "AUDITERROR        15".                                       042000      
000564    02 FILLER                      PIC X(20)     VALUE            043000      
000565    "ABORT             16".                                       044000      
000566    02 FILLER                      PIC X(20)     VALUE            045000      
000567    "SECURITYERROR     17".                                       046000      
000568    02 FILLER                      PIC X(20)     VALUE            047000      
000569    "VERSIONERROR      18".                                       048000      
000570    02 FILLER                      PIC X(20)     VALUE            049000      
000571    "FATALERROR        19".                                       050000      
000572    02 FILLER                      PIC X(20)     VALUE            051000      
000573    "INTEGRITY ERROR   20".                                       052000      
000574    02 FILLER                      PIC X(20)     VALUE            053000      
000575    "INTLIBERROR       21".                                       054000      
000576 01 WKS-TAB-ERRDMSII-R REDEFINES WKS-TAB-ERRDMSII.                055000      
000577    02 WKS-ELETAB-ERRDMSII         OCCURS 21 TIMES.               056000      
000578       03 WKS-LEY-ERR-DMSII        PIC X(18).                     057000      
000579       03 WKS-NUM-ERR-DMSII        PIC 99.                        058000      
000580                                                                  059000      
000581 01 WKS-ERR-BD                     PIC 9(04).                     059100      
000582 01 WKS-ESTRUCT-BD                 PIC X(17).                     059200      
000583                                                                  060000      
000584*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000585                                                                  018350      
000586                                                                  018400      
000587*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000588* COPY "(S151)S151/FORMATO/DISPLAY ON CMEMP".                     018450      
000589                                                                  000100      
000590*===============================================================* 000200      
000591*         FORMATO PARA DISPLAYS                                 * 000300      
000592*===============================================================* 000400      
000593                                                                  000500      
000594 01 WKS-TIT-REPORTE2.                                             000600      
000595    02 FILLER                       PIC X(07) VALUE "(S151)S".    000700      
000596    02 WKS-SIS-BACK2                PIC 9(03).                    000800      
000597    02 FILLER                       PIC X(06) VALUE               000900      
000598                                              "/LIST/".           001000      
000599    02 WKS-PASO-BACK2               PIC X(04).                    001051      
000600    02 FILLER                       PIC X(01) VALUE "/".          001071      
000601    02 WKS-TR-CSI2                  PIC 9(02) VALUE 0.            001100      
000602    02 FILLER                       PIC X(08) VALUE "00/R000/".   001200      
000603    02 WKS-TR-FECHA-BACKUP2         PIC 9(06).                    001300      
000604    02 FILLER                       PIC X(1)  VALUE "/".          001400      
000605    02 WKS-TR-MIX2                  PIC 9(07).                    001500      
000606    02 FILLER                       PIC X(11) VALUE               001600      
000607                                              "/001MSGIMP.".      001700      
000608                                                                  002100      
000609 77 W77-CONT-HOJA2                        PIC  9(06).             002200      
000610                                                                  002300      
000611***********************************************************       002400      
000612*             VARIABLES PARA OBTENER FECHA DE COMPILACION *       002500      
000613***********************************************************       002600      
000614 01 WKS-COMPILA2                           PIC 9(11) BINARY.      002700      
000615*8D                                                               002800      
000616 01 WKS-VERSION2                           PIC 9(06) COMP.        002900      
000617 01 WKS-VERSION-R2   REDEFINES       WKS-VERSION2.                003000      
000618    03 WKS-MES-VERSION2                    PIC 9(02) COMP.        003100      
000619    03 WKS-DIA-VERSION2                    PIC 9(02) COMP.        003200      
000620    03 WKS-AAA-VERSION2                    PIC 9(02) COMP.        003300      
000621*8D                                                               003400      
000622 01 WKS-FECHA-PRO-6D2                     PIC 9(08).              003500      
000623 01 WKS-FECHA-PRO-6D-R2 REDEFINES WKS-FECHA-PRO-6D2.              003600      
000624    03 WKS-FPRO-AA22                      PIC 9(04).              003800      
000625    03 WKS-FPRO-MM2                       PIC 9(02).              003900      
000626    03 WKS-FPRO-DD2                       PIC 9(02).              004000      
000627                                                                  004100      
000628 01 WKS-DATE-ARRAY2       PIC X(21) DISPLAY WITH LOWER-BOUNDS.    004200      
000629                                                                  004300      
000630 01 WKS-FECHA-HORA2.                                              004400      
000631    02 WKS-FEMAQ8D2                       PIC 9(08).              004451      
000632    02 WKS-FEMAQ8D2-RED REDEFINES       WKS-FEMAQ8D2.             004500      
000633       03 WKS-FEMAQ2D2                    PIC 9(02).              004551      
000634       03 WKS-FEMAQ6D2                    PIC 9(06).              004571      
000635    02 WKS-TIME-MAQ2.                                             004600      
000636       04 WKS-HMS-MAQ2                    PIC 9(06).              004700      
000637       04 WKS-HMS-MAQ2-R REDEFINES      WKS-HMS-MAQ2.             004720      
000638          06 WKS-HMS-MAQ2-HH              PIC 9(02).              004740      
000639          06 WKS-HMS-MAQ2-MM              PIC 9(02).              004760      
000640          06 WKS-HMS-MAQ2-SS              PIC 9(02).              004780      
000641       04 WKS-DSS-MAQ2                    PIC 9(02).              004800      
000642    02 FILLER                             PIC X(01).              004900      
000643    02 WKS-RESTO2                         PIC X(04).              005000      
000644                                                                  005100      
000645*8D                                                               005200      
000646****************** REPORTE DE MENSAJES *********************      005300      
000647 01 WLI-ENCAB-12.                                                 005400      
000648    03 FILLER                             PIC X(05) VALUE         005500      
000649       "S151-".                                                   005600      
000650    03 WLI-RB-E1-PASO                     PIC X(04).              005651      
000651    03 FILLER                             PIC X(15) VALUE         005671      
000652       "-001IMPMENSAJES".                                         005691      
000653    03 FILLER                             PIC X(17) VALUE SPACES. 005700      
000654    03 FILLER                             PIC X(34) VALUE         005800      
000655       " ADMINISTRADOR   DE   MOVIMIENTOS ".                      005900      
000656    03 FILLER                             PIC X(09) VALUE SPACES. 006000      
000657    03 FILLER                             PIC X(26) VALUE         006100      
000658       "FECHA DE LA INFORMACION : ".                              006200      
000659    03 WLI-RB-E1-FECHA-INF2               PIC 9999/99/99.         006300      
000660    03 WLI-RB-E1-FECHA-INF2-RED  REDEFINES WLI-RB-E1-FECHA-INF2.  006351      
000661       05  WLI-RB-E1-ANIO41               PIC 99.                 006353      
000662       05  WLI-RB-E1-ANIO42               PIC 99.                 006355      
000663       05  WKS-SLASH1                         PIC X(01).          006356      
000664       05  WLI-RB-E1-MES                  PIC 99.                 006357      
000665       05  WKS-SLASH2                         PIC X(01).          006358      
000666       05  WLI-RB-E1-DIA                  PIC 99.                 006359      
000667 01 WKS-RB-E1-FECHA-INF2               PIC X(10).                 006361      
000668 01 WKS-RB-E1-FECHA-INF2-RED REDEFINES WKS-RB-E1-FECHA-INF2.      006363      
000669    03 WKS-RB-E1-FECHA-INF2-A1         PIC 9(02).                 006365      
000670    03 WKS-RB-E1-FECHA-INF2-A2         PIC 9(02).                 006367      
000671    03 FILLER                          PIC X(01).                 006371      
000672    03 WKS-RB-E1-FECHA-INF2-MM         PIC 9(02).                 006376      
000673    03 FILLER                          PIC X(01).                 006381      
000674    03 WKS-RB-E1-FECHA-INF2-DD         PIC 9(02).                 006386      
000675*8D                                                               006400      
000676 01 WLI-ENCAB-22.                                                 006500      
000677     03 FILLER                          PIC X(11) VALUE           006600      
000678        "F.PROCESO: ".                                            006700      
000679     03 WLI-RB-E2-FECHA-PROC2           PIC 9999/99/99.           006800      
000680     03 FILLER                          PIC X(01) VALUE SPACES.   006900      
000681     03 WLI-RB-E2-HORA-TIT2-HH          PIC 99.                   007000      
000682     03 FILLER                          PIC X(01) VALUE ":".      007020      
000683     03 WLI-RB-E2-HORA-TIT2-MM          PIC 99.                   007040      
000684     03 FILLER                          PIC X(01) VALUE ":".      007060      
000685     03 WLI-RB-E2-HORA-TIT2-SS          PIC 99.                   007080      
000686     03 FILLER                          PIC X(14) VALUE SPACES.   007100      
000687     03 FILLER                          PIC X(24) VALUE           007200      
000688              "IMPRESION MENSAJES DEL S".                         007300      
000689     03 WLI-RB-E3-SISTEMA2           PIC 9(03).                   007400      
000690     03 FILLER                          PIC X(28) VALUE SPACES.   007500      
000691     03 FILLER                          PIC X(14) VALUE           007600      
000692        "TIPO PROCESO: ".                                         007700      
000693     03 WLI-RB-E2-TIPO-PROC2            PIC X(13).                007800      
000694*8D                                                               007900      
000695 01 WLI-ENCAB-32.                                                 008000      
000696     03 FILLER                     PIC X(11) VALUE SPACES.        008100      
000697*       "VERSION  : ".                                            008200      
000698*    03 WLI-RB-E3-VERSION2         PIC 9999/99/99.                008300      
000699     03 FILLER                     PIC X(98) VALUE SPACES.        008400      
000700     03 FILLER                     PIC X(07) VALUE                008500      
000701        "HOJA : ".                                                008600      
000702     03 WLI-RB-E3-HOJA2            PIC ZZZZZ9.                    008700      
000703                                                                  008800      
000704 01 WLI-ENCAB-42.                                                 008900      
000705     03 FILLER                 PIC X(15) VALUE "TIPO DE MENSAJE". 009000      
000706     03 FILLER                 PIC X(07) VALUE SPACES.            009100      
000707     03 FILLER                 PIC X(07) VALUE "MENSAJE".         009200      
000708                                                                  009300      
000709 01 WLI-ENCAB-52.                                                 009400      
000710    03 FILLER                     PIC X(07) VALUE SPACES.         009500      
000711    03 WLI-TIPO-LJ                PIC X(02).                      009600      
000712    03 FILLER                     PIC X(13) VALUE SPACES.         009700      
000713    03 WLI-TEXTO-LJ               PIC X(108).                     009800      
000714                                                                  009900      
000715*INI - INFOWARE(AGREGA ENCABEZADO PARA RESULT DEL S016 PARA P169) 009905      
000716 01 WLI-ENCAB-62.                                                 009910      
000717    03 FILLER                     PIC X(07) VALUE SPACES.         009915      
000718    03 WLI-RESULT                 PIC X(04).                      009920      
000719    03 FILLER                     PIC X(11) VALUE SPACES.         009925      
000720    03 WLI-TEXTO                  PIC X(110).                     009930      
000721                                                                  009935      
000722 01 WLI-TOT-ENVIO.                                                009940      
000723    03 FILLER                     PIC X(22) VALUE SPACES.         009945      
000724    03 FILLER                     PIC X(37) VALUE                 009950      
000725       "TOTAL DE REGISTROS ENVIO CITIDIRECT: ".                   009955      
000726    03 WLI-ENV-CTD                PIC X(04).                      009960      
000727*FIN - INFOWARE                                                   009970      
000728****************************************************************  010000      
000729*                 CONTADORES DE HOJAS                          *  010100      
000730****************************************************************  010200      
000731                                                                  010300      
000732  01 WKS-NUM-LINEAS2                 PIC 9(2) COMP VALUE 0.       010600      
000733*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000734                                                                  018451      
000735  PROCEDURE DIVISION.                                             018500      
000736*======================                                           018600      
000737                                                                  018700      
000738  00-0000-CONTROL.                                                018800      
000739*=================                                                018900      
000740                                                                  018950      
000741     MOVE "151"                   TO  WKS-SIS-BACK2               018952      
000742                                      WLI-RB-E3-SISTEMA2.         018954      
000743     MOVE "P195"                  TO  WKS-PASO-BACK2              018956      
000744                                      WLI-RB-E1-PASO.             018958      
000745     MOVE "DIARIO"                TO  WLI-RB-E2-TIPO-PROC2.       018960      
000746**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                018962      
000747     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-VALUE.             018963      
000748    CHANGE ATTRIBUTE LIBACCESS         OF "CTRLVERS"              018964      
000749                                       TO BYFUNCTION.             018966      
000750    CHANGE ATTRIBUTE FUNCTIONNAME      OF "CTRLVERS"              018968      
000751                                       TO "CTLVERS".              018970      
000752**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                018972      
000753     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.   018974      
000754     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO            018976      
000755                                      "SOPORTECOMS".              018978      
000756     CALL "CSIID OF SOPORTECOMS" USING WKS-DATOSHOST.             018980      
000757                                                                  018982      
000758     MOVE WKS-DH-NUMCSI   TO      WKS-TR-CSI2.                    018984      
000759                                                                  019000      
000760*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000761*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"        019050      
000762*          FROM 100 TO 2800.                                      019051      
000763                                                                  000100      
000764*===============================================================* 000200      
000765*         PROCEDIMIENTO PARA INICIAR VARIABLES DE ENCABEZADO    * 000300      
000766*         PARA LLAMADO DE DISPLAY                               * 000400      
000767*===============================================================* 000500      
000768                                                                  000600      
000769     CHANGE ATTRIBUTE LIBACCESS OF "GENERALSUPPORT"               000651      
000770            TO BYFUNCTION.                                        000671      
000771                                                                  000691      
000772     CALL "CURRENT_DATE OF GENERALSUPPORT"                        000700      
000773          USING WKS-DATE-ARRAY2.                                  000800      
000774     MOVE WKS-DATE-ARRAY2          TO  WKS-FECHA-HORA2.           000900      
000775     MOVE WKS-FEMAQ6D2             TO  WKS-TR-FECHA-BACKUP2.      001000      
000776     MOVE WKS-FEMAQ8D2             TO  WLI-RB-E2-FECHA-PROC2.     001100      
000777     MOVE WKS-HMS-MAQ2-HH          TO  WLI-RB-E2-HORA-TIT2-HH.    001200      
000778     MOVE WKS-HMS-MAQ2-MM          TO  WLI-RB-E2-HORA-TIT2-MM.    001220      
000779     MOVE WKS-HMS-MAQ2-SS          TO  WLI-RB-E2-HORA-TIT2-SS.    001240      
000780                                                                  001300      
000781     MOVE  ATTRIBUTE STACKNO OF MYSELF TO  WKS-TR-MIX2            001400      
000782     SET V00-REPORTE2(USERBACKUPNAME)   TO VALUE TRUE             001500      
000783     CHANGE ATTRIBUTE TITLE OF V00-REPORTE2 TO                    001600      
000784                               WKS-TIT-REPORTE2.                  001700      
000785*    CALL "COMPILETIME-15 IN COBOL74"                             001800      
000786*                                  GIVING WKS-COMPILA2.           001900      
000787*    MOVE WKS-COMPILA2              TO WKS-VERSION2.              002000      
000788*    MOVE WKS-MES-VERSION2          TO WKS-FPRO-MM2               002051      
000789*    MOVE WKS-DIA-VERSION2          TO WKS-FPRO-DD2               002056      
000790*    MOVE WKS-AAA-VERSION2          TO WKS-FPRO-AA22              002061      
000791                                                                  002066      
000792*    IF WKS-AAA-VERSION2  < 50                                    002071      
000793*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 2000        002076      
000794*    ELSE                                                         002081      
000795*       COMPUTE WKS-FPRO-AA22    = WKS-AAA-VERSION2 + 1900.       002086      
000796                                                                  002091      
000797                                                                  002500      
000798*    MOVE WKS-FECHA-PRO-6D2        TO WLI-RB-E3-VERSION2.         002600      
000799     OPEN OUTPUT V00-REPORTE2.                                    002700      
000800     MOVE 57               TO WKS-NUM-LINEAS2.                    002800      
000801*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000802                                                                  019052      
000803     MOVE WKS-FEMAQ6D2            TO  WLI-RB-E1-FECHA-INF2.       019053      
000804                                                                  019054      
000805*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000806*     COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"        019055      
000807*          FROM 2900 TO 3000.                                     019056      
000808     PERFORM 000-050-CHECA-SALTO-HOJA2.                           002900      
000809                                                                  003000      
000810*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000811                                                                  019057      
000812     CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                      019100      
000813            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".       019200      
000814                                                                  019300      
000815**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                019304      
000816     MOVE "S151L001CTL"                 TO     WKS-CTLVER-LIBID.  019308      
000817     CALL "DAME_TIT IN CTRLVERS"        USING  WKS-CTLVER-LIBID   019312      
000818                                               WKS-CTLVER-NOMLIB  019316      
000819                                        GIVING W77-CTLVER-RESULT. 019320      
000820      IF W77-CTLVER-RESULT = 0                                    019324      
000821         CHANGE ATTRIBUTE TITLE         OF "S151-L001"            019328      
000822                                        TO WKS-CTLVER-NOMLIB      019332      
000823      ELSE                                                        019336      
000824         CHANGE ATTRIBUTE TITLE         OF "S151-L001" TO         019340      
000825                "(S151)S151/OBJECT/L001/CONTROL ON CMEMP.".       019344      
000826                                                                  019348      
000827*** REALIZA CONSULTA A B01 PARA OBTENER LA FECHA DE PROCESO       019352      
000828     MOVE 01 TO WKS-B01-FUNCION.                                  019356      
000829     MOVE 151  TO WKS-B01-SISTEMA.                                019360      
000830     CALL "CONSISDIA IN S151-L001" USING  WKS-S151B01SISDIA       019364      
000831                                  GIVING W77-RESULT-LIBCON.       019368      
000832                                                                  019372      
000833     IF W77-RESULT-LIBCON = 0                                     019376      
000834          MOVE WKS-B01-FECPRO151 TO WKS-FECHA-PROC.               019380      
000835                                                                  019384      
000836**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                019388      
000837                                                                  019392      
000838     MOVE 0151                     TO SISTEMA-LJ.                 019400      
000839     MOVE "P195"                   TO PASO-LJ.                    019500      
000840*    MOVE "007"                    TO MTP-LJ.                     019600      
000841     MOVE "001"                    TO MTP-LJ.                     019610      
000842     MOVE "I"                      TO TIPO-LJ.                    019700      
000843     MOVE 020101                   TO CODIGO-LJ.                  019800      
000844     MOVE "INICIO DE PROCESO "     TO TEXTO-LJ.                   019900      
000845**   CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ              020000      
000846**                                       MENSAJE-LJ.              020100      
000847     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     020150      
000848     MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                    020151      
000849     PERFORM 000-030-IMPRIME-MENSAJE                              020152      
000850                                                                  020200      
000851     PERFORM 01-00100-ABRE-ENTRADA.                               020300      
000852**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                020305      
000853** ACTUALIZAR STATUS DE LA B05CONTROL A 1                         020310      
000854     IF W77-VALUE = 1                                             020312      
000855       PERFORM 08-01000-VERIFICA-B05.                             020315      
000856** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                  020320      
000857     PERFORM 02-00100-GENERA-B01SISDIA.                           020400      
000858     PERFORM 03-00100-GENERA-B02ARCINTER.                         020500      
000859     PERFORM 04-00100-GENERA-B03SISMEN.                           020600      
000860     PERFORM 05-00100-GENERA-B04SISTEM.                           020700      
000861     PERFORM 07-00100-GENERA-B05SISTEMA.                          020750      
000862     PERFORM 06-00100-GENERA-B09CONXSIS.                          020800      
000863**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                020805      
000864     IF W77-VALUE = 1                                             020807      
000865        PERFORM 08-01200-ACTUALIZA-B05.                           020810      
000866**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                020815      
000867     PERFORM 01-00200-CIERRA-ENTRADA.                             020900      
000868                                                                  021000      
000869     MOVE "I"                      TO TIPO-LJ.                    021100      
000870     MOVE 020102                   TO CODIGO-LJ.                  021200      
000871     MOVE "FIN NORMAL DE PROCESO"  TO TEXTO-LJ.                   021300      
000872**   CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ              021400      
000873**                                       MENSAJE-LJ.              021500      
000874     CANCEL "LIB-DISP".                                           021600      
000875                                                                  021700      
000876     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     021750      
000877     MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                    021751      
000878     PERFORM 000-030-IMPRIME-MENSAJE                              021752      
000879     CLOSE V00-REPORTE2 WITH SAVE.                                021753      
000880     STOP RUN.                                                    021800      
000881                                                                  021900      
000882*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
000883* COPY "(S151)S151/FORMATO/PROCEDURE/DISPLAY ON CMEMP"            021950      
000884*      FROM 3051 TO 4800.                                         021951      
000885 000-050-CHECA-SALTO-HOJA2.                                       003051      
000886*==========================                                       003071      
000887    MOVE  WLI-RB-E1-FECHA-INF2 TO WKS-RB-E1-FECHA-INF2.           003073      
000888     IF WKS-RB-E1-FECHA-INF2-A2 < 50                              003075      
000889        MOVE 20              TO WKS-RB-E1-FECHA-INF2-A1           003077      
000890     ELSE                                                         003079      
000891        MOVE 19              TO WKS-RB-E1-FECHA-INF2-A1.          003081      
000892     MOVE WKS-RB-E1-FECHA-INF2-A1 TO WLI-RB-E1-ANIO41.            003083      
000893     MOVE WKS-RB-E1-FECHA-INF2-A2 TO WLI-RB-E1-ANIO42.            003085      
000894     MOVE "/"                     TO WKS-SLASH1.                  003086      
000895     MOVE WKS-RB-E1-FECHA-INF2-MM TO WLI-RB-E1-MES.               003087      
000896     MOVE "/"                     TO WKS-SLASH2.                  003088      
000897     MOVE WKS-RB-E1-FECHA-INF2-DD TO WLI-RB-E1-DIA.               003089      
000898     IF  WKS-NUM-LINEAS2 > 56                                     003091      
000899         MOVE SPACES             TO    V00-R00-REPORTE2           003100      
000900         ADD 1                   TO    W77-CONT-HOJA2             003200      
000901         MOVE W77-CONT-HOJA2     TO    WLI-RB-E3-HOJA2            003300      
000902         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-12 AFTER PAGE     003400      
000903         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-22 AFTER 1        003500      
000904         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-32 AFTER 1        003600      
000905         WRITE V00-R00-REPORTE2 FROM  WLI-ENCAB-42 AFTER 4        003700      
000906         MOVE SPACES             TO V00-R00-REPORTE2              003800      
000907         WRITE V00-R00-REPORTE2      AFTER 1                      003900      
000908         MOVE           9        TO WKS-NUM-LINEAS2.              004000      
000909                                                                  004100      
000910 000-030-IMPRIME-MENSAJE.                                         004200      
000911*========================                                         004300      
000912*LP                                                               004400      
000913     WRITE V00-R00-REPORTE2 FROM WLI-ENCAB-52   AFTER 1           004500      
000914     ADD             2       TO WKS-NUM-LINEAS2                   004600      
000915     PERFORM 000-050-CHECA-SALTO-HOJA2.                           004700      
000916                                                                  004800      
000917*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
000918                                                                  021952      
000919 01-00100-ABRE-ENTRADA.                                           022000      
000920*======================                                           022100      
000921     OPEN INQUIRY S151BD99CONTROL                                 022200      
000922          ON EXCEPTION                                            022300      
000923             PERFORM 900000-CHE-STA                               022400      
000924             MOVE "O"                      TO TIPO-LJ             022500      
000925             MOVE 020103                   TO CODIGO-LJ           022600      
000926             MOVE "TERMINACION ANORMAL DE PROCESO" TO TEXTO-LJ    022700      
000927             CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ      022800      
000928                                                 MENSAJE-LJ       022900      
000929             MOVE TIPO-LJ         TO      WLI-TIPO-LJ             022950      
000930             MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ            022951      
000931             PERFORM 000-030-IMPRIME-MENSAJE                      022952      
000932             CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.             023000      
000933                                                                  023100      
000934 01-00200-CIERRA-ENTRADA.                                         023200      
000935*========================                                         023300      
000936     CLOSE S151BD99CONTROL                                        023400      
000937           ON EXCEPTION                                           023500      
000938              NEXT SENTENCE.                                      023600      
000939                                                                  023700      
000940 02-00100-GENERA-B01SISDIA.                                       023800      
000941*==========================                                       023900      
000942     MOVE ZERO                     TO W77-EOF.                    024000      
000943     FIND FIRST S151B01SISDIA                                     024100      
000944                ON EXCEPTION                                      024200      
000945                   IF DMSTATUS(NOTFOUND)                          024300      
000946                      MOVE 1       TO W77-EOF                     024400      
000947                   ELSE                                           024500      
000948                      PERFORM 900000-CHE-STA.                     024600      
000949     IF W77-EOF = 1                                               024700      
000950        MOVE ZERO                  TO WKS-FECHA-B01SISDIA         024800      
000951                                      WKS-FECHA-B02ARCINTER       024900      
000952                                      WKS-FECHA-B03SISMEN         025000      
000953                                      WKS-FECHA-B04SISTEM         025100      
000954                                      WKS-FECHA-B05SISTEMA        025150      
000955                                      WKS-FECHA-B09CONXSIS        025200      
000956     ELSE                                                         025300      
000957*       MOVE B01-SIS-FECPRO        TO WKS-FECHA-B01SISDIA         025400      
000958*                                     WKS-FECHA-B02ARCINTER       025500      
000959*                                     WKS-FECHA-B03SISMEN         025600      
000960*                                     WKS-FECHA-B04SISTEM         025700      
000961*                                     WKS-FECHA-B09CONXSIS.       025705      
000962*INICIA CODIGO DE RENOVACION CRONOS 2000                          025710      
000963$SET OMIT=OLDCODE                                                 025715      
000964        MOVE B01-SIS-FECPRO        TO WKS-FECHA-B01SISDIA         025720      
000965                                      WKS-FECHA-B02ARCINTER       025725      
000966                                      WKS-FECHA-B03SISMEN         025730      
000967                                      WKS-FECHA-B04SISTEM         025735      
000968                                      WKS-FECHA-B05SISTEMA        025737      
000969                                      WKS-FECHA-B09CONXSIS.       025740      
000970$POP OMIT                                                         025743      
000971$SET OMIT=NOT OLDCODE                                             025746      
000972 MOVE ZEROES TO A2K-FEC-CAMD-001                                  025749      
000973 MOVE B01-SIS-FECPRO  TO A2K-FEC-CAMD-001                         025752      
000974 PERFORM A2K-CONV-CAMD-TO-AMD THRU                                025755      
000975         A2K-CONV-CAMD-TO-AMD-EXIT                                025758      
000976 MOVE A2K-FEC-AMD-001 TO            WKS-FECHA-B01SISDIA           025761      
000977                                    WKS-FECHA-B02ARCINTER         025764      
000978                                    WKS-FECHA-B03SISMEN           025767      
000979                                    WKS-FECHA-B04SISTEM           025770      
000980                                    WKS-FECHA-B05SISTEMA          025772      
000981                                    WKS-FECHA-B09CONXSIS.         025773      
000982$POP OMIT                                                         025819      
000983*TERMINA CODIGO DE RENOVACION CRONOS 2000                         025820      
000984     OPEN OUTPUT A01-B01SISDIA.                                   025900      
000985     PERFORM 02-00110-VACIA-B01SISDIA UNTIL W77-EOF = 1.          026000      
000986     CLOSE A01-B01SISDIA WITH SAVE.                               026100      
000987                                                                  026200      
000988 02-00110-VACIA-B01SISDIA.                                        026300      
000989*=========================                                        026400      
000990     MOVE S151B01SISDIA            TO A01-R00-SISDIA.             026500      
000991     WRITE A01-R00-SISDIA.                                        026600      
000992     FIND NEXT S151B01SISDIA                                      026700      
000993               ON EXCEPTION                                       026800      
000994                  MOVE 1           TO W77-EOF                     026900      
000995                  IF DMSTATUS(NOTFOUND)                           027000      
000996                     NEXT SENTENCE                                027100      
000997                  ELSE                                            027200      
000998                     PERFORM 900000-CHE-STA.                      027300      
000999                                                                  027350      
001000 03-00100-GENERA-B02ARCINTER.                                     027400      
001001*============================                                     027500      
001002     MOVE ZERO                     TO W77-EOF.                    027600      
001003     OPEN OUTPUT A02-B02ARCINTER.                                 027700      
001004     FIND FIRST S151B02ARCINTER                                   027800      
001005                ON EXCEPTION                                      027900      
001006                   IF DMSTATUS(NOTFOUND)                          028000      
001007                      MOVE 1       TO W77-EOF                     028100      
001008                   ELSE                                           028200      
001009                      PERFORM 900000-CHE-STA.                     028300      
001010     PERFORM 03-00110-VACIA-B02ARCINTER UNTIL W77-EOF = 1.        028400      
001011     CLOSE A02-B02ARCINTER WITH SAVE.                             028500      
001012                                                                  028600      
001013 03-00110-VACIA-B02ARCINTER.                                      028700      
001014*===========================                                      028800      
001015     MOVE S151B02ARCINTER          TO A02-R00-ARCINTER.           028900      
001016     WRITE A02-R00-ARCINTER.                                      029000      
001017     FIND NEXT S151B02ARCINTER                                    029100      
001018               ON EXCEPTION                                       029200      
001019                  MOVE 1           TO W77-EOF                     029300      
001020                  IF DMSTATUS(NOTFOUND)                           029400      
001021                     NEXT SENTENCE                                029500      
001022                  ELSE                                            029600      
001023                     PERFORM 900000-CHE-STA.                      029700      
001024                                                                  029750      
001025 04-00100-GENERA-B03SISMEN.                                       029800      
001026*==========================                                       029900      
001027     MOVE ZERO                     TO W77-EOF.                    030000      
001028     OPEN OUTPUT A03-B03SISMEN.                                   030100      
001029     FIND FIRST S151B03SISMEN                                     030200      
001030                ON EXCEPTION                                      030300      
001031                   IF DMSTATUS(NOTFOUND)                          030400      
001032                      MOVE 1       TO W77-EOF                     030500      
001033                   ELSE                                           030600      
001034                      PERFORM 900000-CHE-STA.                     030700      
001035     PERFORM 04-00110-VACIA-B03SISMEN UNTIL W77-EOF = 1.          030800      
001036     CLOSE A03-B03SISMEN WITH SAVE.                               030900      
001037                                                                  031000      
001038 04-00110-VACIA-B03SISMEN.                                        031100      
001039*=========================                                        031200      
001040                                                                  031250      
001041*SE LIMPIAN VARIABLES DE NOMBRES DE BASES BDSAL Y BDMOVHI         031255      
001042     MOVE SPACES                   TO  A03-R00-NOMBDSAL           031260      
001043                                       A03-R00-NOMBDMOVHI.        031265      
001044*JMF                                                              031270      
001045                                                                  031275      
001046     MOVE B03-SIS-SISTEMA          TO A03-R00-SISTEMA.            031300      
001047     MOVE B03-SIS-MODSIS           TO A03-R00-MODSIS.             031400      
001048     MOVE B03-SIS-RESCSI           TO A03-R00-RESCSI.             031500      
001049     MOVE B03-SIS-TIPBD            TO A03-R00-TIPBD.              031600      
001050     MOVE B03-SIS-NUMCICDIA        TO A03-R00-NUMCICDIA.          031700      
001051     MOVE B03-SIS-NUMCICMES        TO A03-R00-NUMCICMES.          031800      
001052     MOVE B03-SIS-NOMBDSAL         TO A03-R00-NOMBDSAL.           031900      
001053     MOVE B03-SIS-STABDSAL         TO A03-R00-STABDSAL.           032000      
001054     MOVE B03-SIS-NOMBDMOVHI       TO A03-R00-NOMBDMOVHI.         032100      
001055     MOVE B03-SIS-SECOKHI          TO A03-R00-SECOKHI.            032200      
001056     MOVE B03-SIS-SECINFHI         TO A03-R00-SECINFHI.           032300      
001057     MOVE B03-SIS-SECERRHI         TO A03-R00-SECINFHI.           032400      
001058     MOVE B03-SIS-STABDMOVHI       TO A03-R00-STABDMOVHI.         032500      
001059                                                                  032600      
001060     PERFORM 04-00111-BASES-CICLO                                 032700      
001061             VARYING W77-IND FROM 1 BY 1                          032800      
001062             UNTIL   W77-IND > 5    OR                            032900      
001063                     W77-IND > B03-SIS-NUMCICMES.                 033000      
001064                                                                  033100      
001065     WRITE A03-R00-SISMEN.                                        033200      
001066                                                                  033300      
001067*JMF                                                              033350      
001068     PERFORM 04-00112-LIMPIA-VAR-BASES                            033355      
001069             VARYING W77-IND2  FROM 1 BY 1                        033360      
001070             UNTIL   W77-IND2 > 5    OR                           033365      
001071                     W77-IND2 > B03-SIS-NUMCICMES.                033370      
001072*JMF                                                              033375      
001073                                                                  033380      
001074     FIND NEXT S151B03SISMEN                                      033400      
001075               ON EXCEPTION                                       033500      
001076                  MOVE 1           TO W77-EOF                     033600      
001077                  IF DMSTATUS(NOTFOUND)                           033700      
001078                     NEXT SENTENCE                                033800      
001079                  ELSE                                            033900      
001080                     PERFORM 900000-CHE-STA.                      034000      
001081                                                                  034100      
001082 04-00111-BASES-CICLO.                                            034200      
001083*=====================                                            034300      
001084                                                                  034350      
001085     MOVE B03-SIS-NOMBDMOV(W77-IND) TO A03-R00-NOMBDMOV(W77-IND). 034400      
001086     MOVE B03-SIS-NUMBDMOV(W77-IND) TO A03-R00-NUMBDMOV(W77-IND). 034500      
001087     MOVE B03-SIS-AAMM(W77-IND)     TO A03-R00-AAMM(W77-IND).     034600      
001088     MOVE B03-SIS-SECOK(W77-IND)    TO A03-R00-SECOK(W77-IND).    034700      
001089     MOVE B03-SIS-SECINF(W77-IND)   TO A03-R00-SECINF(W77-IND).   034800      
001090     MOVE B03-SIS-SECERR(W77-IND)   TO A03-R00-SECERR(W77-IND).   034900      
001091     MOVE B03-SIS-STABDMOV(W77-IND) TO A03-R00-STABDMOV(W77-IND). 035000      
001092                                                                  035050      
001093*JMF                                                              035053      
001094                                                                  035056      
001095 04-00112-LIMPIA-VAR-BASES.                                       035059      
001096*==========================                                       035062      
001097                                                                  035065      
001098    MOVE SPACES                     TO A03-R00-NOMBDMOV(W77-IND2).035068      
001099    MOVE ZEROS                      TO A03-R00-NUMBDMOV(W77-IND2) 035071      
001100                                       A03-R00-AAMM(W77-IND2)     035074      
001101                                       A03-R00-SECOK(W77-IND2)    035077      
001102                                       A03-R00-SECINF(W77-IND2)   035080      
001103                                       A03-R00-SECERR(W77-IND2)   035083      
001104                                       A03-R00-STABDMOV(W77-IND2).035086      
001105*JMF                                                              035089      
001106                                                                  035092      
001107 05-00100-GENERA-B04SISTEM.                                       035100      
001108*===========================                                      035200      
001109     MOVE ZERO                     TO W77-EOF.                    035300      
001110     OPEN OUTPUT A04-B04SISTEM.                                   035400      
001111     FIND FIRST S151B04SISTEM                                     035500      
001112                ON EXCEPTION                                      035600      
001113                   IF DMSTATUS(NOTFOUND)                          035700      
001114                      MOVE 1       TO W77-EOF                     035800      
001115                   ELSE                                           035900      
001116                      PERFORM 900000-CHE-STA.                     036000      
001117     PERFORM 05-00110-VACIA-B04SISTEM  UNTIL W77-EOF = 1.         036100      
001118     CLOSE A04-B04SISTEM  WITH SAVE.                              036200      
001119                                                                  036300      
001120 05-00110-VACIA-B04SISTEM.                                        036400      
001121*=========================                                        036500      
001122     MOVE S151B04SISTEM            TO A04-R00-SISTEM.             036600      
001123     WRITE A04-R00-SISTEM.                                        036700      
001124     FIND NEXT S151B04SISTEM                                      036800      
001125               ON EXCEPTION                                       036900      
001126                  MOVE 1           TO W77-EOF                     037000      
001127                  IF DMSTATUS(NOTFOUND)                           037100      
001128                     NEXT SENTENCE                                037200      
001129                  ELSE                                            037300      
001130                     PERFORM 900000-CHE-STA.                      037400      
001131                                                                  037405      
001132 07-00100-GENERA-B05SISTEMA.                                      037410      
001133*===========================                                      037415      
001134     MOVE ZERO                     TO W77-EOF.                    037420      
001135     OPEN OUTPUT A06-B05PROCESOS.                                 037425      
001136     FIND FIRST S151B05PROCESOS                                   037430      
001137                ON EXCEPTION                                      037435      
001138                   IF DMSTATUS(NOTFOUND)                          037440      
001139                      MOVE 1       TO W77-EOF                     037445      
001140                   ELSE                                           037450      
001141                      PERFORM 900000-CHE-STA.                     037453      
001142     PERFORM 07-00110-VACIA-B05SISTEMA  UNTIL W77-EOF = 1.        037456      
001143     CLOSE A06-B05PROCESOS  WITH SAVE.                            037459      
001144                                                                  037462      
001145 07-00110-VACIA-B05SISTEMA.                                       037465      
001146*==========================                                       037468      
001147     MOVE S151B05PROCESOS           TO A06-R00-PROCESOS.          037471      
001148     WRITE A06-R00-PROCESOS.                                      037474      
001149     FIND NEXT S151B05PROCESOS                                    037475      
001150               ON EXCEPTION                                       037476      
001151                  MOVE 1           TO W77-EOF                     037477      
001152                  IF DMSTATUS(NOTFOUND)                           037478      
001153                     NEXT SENTENCE                                037479      
001154                  ELSE                                            037480      
001155                     PERFORM 900000-CHE-STA.                      037481      
001156                                                                  037482      
001157 06-00100-GENERA-B09CONXSIS.                                      037483      
001158*===========================                                      037492      
001159     MOVE ZERO                     TO W77-EOF.                    037501      
001160     OPEN OUTPUT A05-B09CONXSIS.                                  037510      
001161     FIND FIRST S151B09CONXSIS                                    037519      
001162                ON EXCEPTION                                      038000      
001163                   IF DMSTATUS(NOTFOUND)                          038100      
001164                      MOVE 1       TO W77-EOF                     038200      
001165                   ELSE                                           038300      
001166                      PERFORM 900000-CHE-STA.                     038400      
001167     PERFORM 06-00110-VACIA-B09CONXSIS UNTIL W77-EOF = 1.         038500      
001168     CLOSE A05-B09CONXSIS WITH SAVE.                              038600      
001169                                                                  038700      
001170 06-00110-VACIA-B09CONXSIS.                                       038800      
001171*==========================                                       038900      
001172     MOVE S151B09CONXSIS           TO A05-R00-CONXSIS             039000      
001173     WRITE A05-R00-CONXSIS.                                       039100      
001174     FIND NEXT S151B09CONXSIS                                     039200      
001175               ON EXCEPTION                                       039300      
001176                  MOVE 1           TO W77-EOF                     039400      
001177                  IF DMSTATUS(NOTFOUND)                           039500      
001178                     NEXT SENTENCE                                039600      
001179                  ELSE                                            039700      
001180                     PERFORM 900000-CHE-STA.                      039800      
001181                                                                  039850      
001182*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001183* COPY "S151/FORMATO/ERROR/DMSII." FROM 68000 TO 77000.           039890      
001184 900000-CHE-STA.                                                  068000      
001185     MOVE DMSTATUS(DMCATEGORY)            TO WKS-ERR-DMSII        069000      
001186     MOVE DMSTATUS(DMERRORTYPE)           TO WKS-ERR-BD           069100      
001187     MOVE DMSTATUS(DMSTRUCTURE)           TO WKS-ESTRUCT-BD       069200      
001188                                                                  069300      
001189     IF WKS-ERR-DMSII > ZEROS                                     070000      
001190        STRING  "BASE DATOS  " WKS-NOM-BDERR-DMSII                071000      
001191                "ERROR EN BD " WKS-LEY-ERR-DMSII(WKS-ERR-DMSII)   072000      
001192                           " " WKS-ERR-DMSII                      073000      
001193                "TIPO        " WKS-ERR-BD                         074000      
001194                "ESTRUCTURA  " WKS-ESTRUCT-BD                     075000      
001195        DELIMITED BY SIZE INTO TEXTO-LJ                           076000      
001196        CALL "LJ IN LIB-DISP" USING  CONTADOR-LJ, MENSAJE-LJ.     077000      
001197*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001198                                                                  039895      
001199                                                                  039900      
001200*INICIA CODIGO DE RENOVACION CRONOS 2000                          039901      
001201*INICIO  COPY PARA CPBAS                                          CPBAS 1.    
001202* COPY "S151/CRONOS2K/CPY/PD".                                    039903      
001203** This Copy Book defines all the additional PARAGRAPHS that   ** 000100      
001204** Unisys has defined for CRONOS2K project                     ** 000200      
001205** Include this CopyBook into the PROCEDURE DIVISION.          ** 000300      
001206***************************************************************** 000400      
001207***************************************************************** 000600      
001208** A2K-ACCEPT-TODAYS-DATE.                                     ** 000700      
001209** This Paragraph accepts the TODAYS-DATE from System in Long  ** 000800      
001210** Format e.g. MM/DD/CCAA. And it converts into a numeric      ** 000900      
001211** date MMDDCCAA, which is returned into the variable          ** 001000      
001212** A2K-FEC-MDCA-001.                                           ** 001100      
001213***************************************************************** 001200      
001214                                                                  001300      
001215 A2K-ACCEPT-TODAYS-DATE.                                          001400      
001216        MOVE ZEROES TO A2K-FEC-MDCA-001.                          001500      
001217*       MOVE "    " TO A2K-SYSTEM-FECHA.                          001600      
001218        ACCEPT A2K-SYSTEM-FECHA FROM TODAYS-DATE.                 001700      
001219        MOVE A2K-SYSTEM-FECHA-MM TO A2K-FEC-MDCA-MM-001.          001800      
001220        MOVE A2K-SYSTEM-FECHA-DD TO A2K-FEC-MDCA-DD-001.          001900      
001221        MOVE A2K-SYSTEM-FECHA-CC TO A2K-FEC-MDCA-CC-001.          002000      
001222        MOVE A2K-SYSTEM-FECHA-AA TO A2K-FEC-MDCA-AA-001.          002100      
001223                                                                  002200      
001224 A2K-ACCEPT-TODAYS-DATE-EXIT.                                     002220      
001225        EXIT.                                                     002240      
001226                                                                  002500      
001227****************************************************************  002600      
001228** A2K-CONV-AMD-TO-CAMD.                                      **  002700      
001229**This Paragraph converts a SIX digit date in AAMMDD format to**  002800      
001230**an EIGHT digit format as CCAAMMDD. It uses a                **  002900      
001231**baseyear to add the century to the year part.               **  003000      
001232**INPUT is A2K-FEC-AMD-001                                    **  003100      
001233**OUTPUT is A2K-FEC-CAMD-001                                  **  003200      
001234****************************************************************  003300      
001235                                                                  003400      
001236 A2K-CONV-AMD-TO-CAMD.                                            003500      
001237         MOVE ZEROES TO A2K-FEC-CAMD-001.                         003600      
001238         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-YEAR-AA.              003700      
001239         IF A2K-FEC-AMD-001 = 0                                   003720      
001240            MOVE ZEROES TO A2K-FEC-CAMD-001                       003740      
001241         ELSE                                                     003741      
001242          IF A2K-FEC-AMD-001 = 999999                             003742      
001243             MOVE 99999999 TO A2K-FEC-CAMD-001                    003743      
001244         ELSE                                                     003760      
001245         PERFORM A2K-OBTAIN-CENTURY THRU                          003800      
001246                 A2K-OBTAIN-CENTURY-EXIT                          003900      
001247         MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAMD-CC-001              004000      
001248         MOVE A2K-FEC-AMD-AA-001 TO A2K-FEC-CAMD-AA-001           004100      
001249         MOVE A2K-FEC-AMD-MM-001 TO A2K-FEC-CAMD-MM-001           004200      
001250         MOVE A2K-FEC-AMD-DD-001 TO A2K-FEC-CAMD-DD-001.          004300      
001251                                                                  004400      
001252 A2K-CONV-AMD-TO-CAMD-EXIT.                                       004500      
001253         EXIT.                                                    004600      
001254                                                                  004700      
001255******************************************************************004800      
001256**A2K-CONV-MDA-TO-MDCA.                                         **004900      
001257**This Paragraph converts a SIX digit date in MMDDAA format to  **005000      
001258** an eight digit format as MMDDCCAA. It use a                  **005100      
001259** baseyear to add century to the yaer.                         **005200      
001260** INPUT is A2K-FEC-MDA-001                                     **005300      
001261** OUTPUT is A2K-FEC-MDCA-001                                   **005400      
001262                                                                  005500      
001263 A2K-CONV-MDA-TO-MDCA.                                            005600      
001264     MOVE ZEROS TO A2K-FEC-MDCA-001.                              005700      
001265     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-YEAR-AA.                  005800      
001266     IF A2K-FEC-MDA-001 = 0                                       005820      
001267        MOVE ZEROES TO A2K-FEC-MDCA-001                           005840      
001268     ELSE                                                         005845      
001269      IF A2K-FEC-MDA-001 = 999999                                 005850      
001270         MOVE 99999999 TO A2K-FEC-MDCA-001                        005855      
001271     ELSE                                                         005860      
001272     PERFORM A2K-OBTAIN-CENTURY THRU                              005900      
001273             A2K-OBTAIN-CENTURY-EXIT                              006000      
001274     MOVE A2K-FEC-YEAR-CC TO A2K-FEC-MDCA-CC-001                  006100      
001275     MOVE A2K-FEC-MDA-AA-001 TO A2K-FEC-MDCA-AA-001               006200      
001276     MOVE A2K-FEC-MDA-MM-001 TO A2K-FEC-MDCA-MM-001               006300      
001277     MOVE A2K-FEC-MDA-DD-001 TO A2K-FEC-MDCA-DD-001.              006400      
001278                                                                  006500      
001279 A2K-CONV-MDA-TO-MDCA-EXIT.                                       006600      
001280     EXIT.                                                        006700      
001281                                                                  006800      
001282***************************************************************** 006900      
001283**A2K-CONV-DMA-TO-DMCA.                                        ** 007000      
001284**This Paragraph converts a SIX digit date in DDMMAA format to ** 007100      
001285**an eight digit format as DDMMCCAA. It uses a                 ** 007200      
001286**baseyear to add century to the year.                         ** 007300      
001287**INPUT is A2K-FEC-DMA-001                                     ** 007400      
001288**OUTPUT IS A2K-FEC-DMCA-001                                   ** 007500      
001289                                                                  007600      
001290 A2K-CONV-DMA-TO-DMCA.                                            007700      
001291       MOVE ZEROS TO A2K-FEC-DMCA-001.                            007800      
001292       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-YEAR-AA.                007900      
001293       IF  A2K-FEC-DMA-001   = 0                                  007920      
001294          MOVE ZEROS TO A2K-FEC-DMCA-001                          007940      
001295       ELSE                                                       007945      
001296        IF A2K-FEC-DMA-001 = 999999                               007950      
001297          MOVE 99999999 TO A2K-FEC-DMCA-001                       007955      
001298       ELSE                                                       007960      
001299       PERFORM A2K-OBTAIN-CENTURY THRU                            008000      
001300               A2K-OBTAIN-CENTURY-EXIT                            008100      
001301       MOVE A2K-FEC-YEAR-CC TO A2K-FEC-DMCA-CC-001                008200      
001302       MOVE A2K-FEC-DMA-AA-001 TO A2K-FEC-DMCA-AA-001             008300      
001303       MOVE A2K-FEC-DMA-MM-001 TO A2K-FEC-DMCA-MM-001             008400      
001304       MOVE A2K-FEC-DMA-DD-001 TO A2K-FEC-DMCA-DD-001.            008500      
001305                                                                  008600      
001306 A2K-CONV-DMA-TO-DMCA-EXIT.                                       008700      
001307       EXIT.                                                      008800      
001308                                                                  008900      
001309***************************************************************** 009000      
001310** A2K-CONV-CAMD-TO-AMD.                                       ** 009100      
001311** This Paragraph converts a 8 Digit date in CCAAMMDD format to** 009200      
001312** a 6 digit format as AAMMDD.                                 ** 009300      
001313** It simply removes the century information in the output     ** 009400      
001314** INPUT is A2K-FEC-CAMD-001                                   ** 009500      
001315** OUTPUT is A2K-FEC-AMD-001                                   ** 009600      
001316                                                                  009700      
001317 A2K-CONV-CAMD-TO-AMD.                                            009800      
001318     MOVE ZEROS TO A2K-FEC-AMD-001.                               009900      
001319     MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-AMD-AA-001.              010000      
001320     MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-AMD-MM-001.              010100      
001321     MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-AMD-DD-001.              010200      
001322                                                                  010300      
001323 A2K-CONV-CAMD-TO-AMD-EXIT.                                       010400      
001324      EXIT.                                                       010500      
001325                                                                  010600      
001326******************************************************************010700      
001327******************************************************************010800      
001328** A2K-CONV-MDCA-TO-MDA.                                        **010900      
001329** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN MMDDCCAA FORMAT TO **011000      
001330** A 6 DIGIT FORMAT AS MMDDAA.                                  **011100      
001331** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT      **011200      
001332** INPUT is A2K-FEC-MDCA-001                                    **011300      
001333** OUTPUT is A2K-FEC-MDA-001                                    **011400      
001334                                                                  011500      
001335 A2K-CONV-MDCA-TO-MDA.                                            011600      
001336     MOVE ZEROS TO A2K-FEC-MDA-001.                               011700      
001337     MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-MDA-AA-001.              011800      
001338     MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-MDA-MM-001.              011900      
001339     MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-MDA-DD-001.              012000      
001340                                                                  012100      
001341 A2K-CONV-MDCA-TO-MDA-EXIT.                                       012200      
001342      EXIT.                                                       012300      
001343                                                                  012400      
001344******************************************************************012500      
001345***************************************************************** 012600      
001346** A2K-CONV-DMCA-TO-DMA.                                        **012700      
001347** THIS PARAGRAPH CONVERTS A 8 DIGIT DATE IN DDMMCCAA FORMAT TO **012800      
001348** A 6 DIGIT FORMAT AS DDMMAA.                                  **012900      
001349** IT SIMPLY REMOVES THE CENTURY INFORMATION IN THE OUTPUT     ** 013000      
001350** INPUT IS A2K-FEC-DMCA-001                                   ** 013100      
001351** OUTPUT IS A2K-FEC-DMA-001                                   ** 013200      
001352                                                                  013300      
001353 A2K-CONV-DMCA-TO-DMA.                                            013400      
001354     MOVE ZEROS TO A2K-FEC-DMA-001.                               013500      
001355     MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-DMA-AA-001.              013600      
001356     MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-DMA-MM-001.              013700      
001357     MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-DMA-DD-001.              013800      
001358                                                                  013900      
001359 A2K-CONV-DMCA-TO-DMA-EXIT.                                       014000      
001360      EXIT.                                                       014100      
001361                                                                  014200      
001362***************************************************************** 014300      
001363 A2K-CONV-MDCA-TO-CAMD.                                           014400      
001364      MOVE ZEROS TO A2K-FEC-CAMD-001.                             014500      
001365      MOVE A2K-FEC-MDCA-MM-001 TO A2K-FEC-CAMD-MM-001.            014600      
001366      MOVE A2K-FEC-MDCA-DD-001 TO A2K-FEC-CAMD-DD-001.            014700      
001367      MOVE A2K-FEC-MDCA-CC-001 TO A2K-FEC-CAMD-CC-001.            014800      
001368      MOVE A2K-FEC-MDCA-AA-001 TO A2K-FEC-CAMD-AA-001.            014900      
001369 A2K-CONV-MDCA-TO-CAMD-EXIT.                                      015000      
001370      EXIT.                                                       015100      
001371***************************************************************** 015200      
001372** This paragraph adds century to an year field which is 9(02) ** 015300      
001373** Input is A2K-FEC-CCAA-AA-001.                               ** 015500      
001374** Output is A2K-FEC-CCAA-001.                                 ** 015600      
001375***************************************************************** 015700      
001376 A2K-CONV-AA-TO-CCAA.                                             015800      
001377      MOVE A2K-FEC-CCAA-AA-001 TO A2K-FEC-YEAR-AA.                015900      
001378      PERFORM A2K-OBTAIN-CENTURY THRU                             016000      
001379              A2K-OBTAIN-CENTURY-EXIT.                            016100      
001380      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CCAA-CC-001.                016200      
001381 A2K-CONV-AA-TO-CCAA-EXIT.                                        016300      
001382      EXIT.                                                       016400      
001383***************************************************************** 016500      
001384** This paragraph converts the date from DDMMCCAA to CCAAMMDD  ** 016600      
001385** format.                                                     ** 016700      
001386** Input is A2K-FEC-DMCA-001.                                  ** 016800      
001387** Output is A2K-FEC-CAMD-001.                                 ** 016900      
001388***************************************************************** 017000      
001389 A2K-CONV-DMCA-TO-CAMD.                                           017100      
001390      MOVE ZEROES TO A2K-FEC-CAMD-001.                            017200      
001391      MOVE A2K-FEC-DMCA-MM-001 TO A2K-FEC-CAMD-MM-001.            017300      
001392      MOVE A2K-FEC-DMCA-DD-001 TO A2K-FEC-CAMD-DD-001.            017400      
001393      MOVE A2K-FEC-DMCA-CC-001 TO A2K-FEC-CAMD-CC-001.            017500      
001394      MOVE A2K-FEC-DMCA-AA-001 TO A2K-FEC-CAMD-AA-001.            017600      
001395 A2K-CONV-DMCA-TO-CAMD-EXIT.                                      017700      
001396      EXIT.                                                       017800      
001397***************************************************************** 017900      
001398** This paragraph desides the Century to be added depending    ** 018000      
001399** on the base year.                                           ** 018100      
001400** Input Is A2K-FEC-YEAR-AA.                                   ** 018200      
001401** Output Is A2K-FEC-YEAR-CC.                                  ** 018300      
001402***************************************************************** 018400      
001403 A2K-OBTAIN-CENTURY.                                              018500      
001404      IF A2K-FEC-YEAR-AA < A2K-BASE-YEAR                          018600      
001405          MOVE 20 TO A2K-FEC-YEAR-CC                              018700      
001406      ELSE                                                        018800      
001407          MOVE 19 TO A2K-FEC-YEAR-CC.                             018900      
001408 A2K-OBTAIN-CENTURY-EXIT.                                         019000      
001409      EXIT.                                                       019100      
001410                                                                  019200      
001411***************************************************************** 019300      
001412** This Paragraph Converts The Date From CCAAMMDD To DDMMCCAA  ** 019400      
001413**  Format                                                     ** 019500      
001414** Input Is A2K-FEC-CAMD-001                                   ** 019600      
001415** Output Is A2K-FEC-DMCA-001                                  ** 019700      
001416***************************************************************** 019800      
001417 A2K-CONV-CAMD-TO-DMCA.                                           019900      
001418      MOVE ZEROES TO A2K-FEC-DMCA-001.                            020000      
001419      MOVE A2K-FEC-CAMD-MM-001 TO A2K-FEC-DMCA-MM-001.            020100      
001420      MOVE A2K-FEC-CAMD-DD-001 TO A2K-FEC-DMCA-DD-001.            020200      
001421      MOVE A2K-FEC-CAMD-CC-001 TO A2K-FEC-DMCA-CC-001.            020300      
001422      MOVE A2K-FEC-CAMD-AA-001 TO A2K-FEC-DMCA-AA-001.            020400      
001423                                                                  020500      
001424 A2K-CONV-CAMD-TO-DMCA-EXIT.                                      020600      
001425      EXIT.                                                       020700      
001426                                                                  020800      
001427******************************************************************020900      
001428******************************************************************021000      
001429 A2K-CONV-AM-TO-CAM.                                              021100      
001430      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-YEAR-AA.                  021150      
001431      MOVE ZEROES TO A2K-FEC-CAM-001.                             021200      
001432      IF A2K-FEC-AM-001 = 0                                       021220      
001433         MOVE ZEROS TO    A2K-FEC-CAM-001                         021240      
001434      ELSE                                                        021245      
001435      IF A2K-FEC-AM-001 = 9999                                    021250      
001436         MOVE 999999 TO A2K-FEC-CAM-001                           021255      
001437      ELSE                                                        021260      
001438      MOVE A2K-FEC-AM-AA-001 TO A2K-FEC-CAM-AA-001                021300      
001439      MOVE A2K-FEC-AM-MM-001 TO A2K-FEC-CAM-MM-001                021400      
001440      PERFORM A2K-OBTAIN-CENTURY THRU                             021500      
001441              A2K-OBTAIN-CENTURY-EXIT                             021600      
001442      MOVE A2K-FEC-YEAR-CC TO A2K-FEC-CAM-CC-001.                 021700      
001443                                                                  021800      
001444 A2K-CONV-AM-TO-CAM-EXIT.                                         021900      
001445      EXIT.                                                       022000      
001446                                                                  022100      
001447******************************************************************022200      
001448******************************************************************022300      
001449 A2K-CONV-CAM-TO-AM.                                              022400      
001450      MOVE ZEROES TO A2K-FEC-AM-001.                              022500      
001451      MOVE A2K-FEC-CAM-AA-001 TO A2K-FEC-AM-AA-001.               022600      
001452      MOVE A2K-FEC-CAM-MM-001 TO A2K-FEC-AM-MM-001.               022700      
001453                                                                  022800      
001454 A2K-CONV-CAM-TO-AM-EXIT.                                         022900      
001455   EXIT.                                                          023000      
001456                                                                  023100      
001457                                                                  023200      
001458                                                                  023500      
001459*TERMINA COPY PARA CPBAS                                          CPBAS 1.    
001460 A2K-CPY-EXIT-PARA.                                               039904      
001461   EXIT.                                                          039905      
001462*TERMINA CODIGO DE RENOVACION CRONOS 2000                         039906      
001463                                                                  040000      
001464**** JCNS INI - ALTA DISPONIBILIDAD * IBM 20-01-15                040100      
001465 08-01000-VERIFICA-B05.                                           040200      
001466***** CONSULTAR SI EXISTE B05 CON LA FECHA DEL DIA                040300      
001467     MOVE 01             TO WKS-B05-FUNCION                       040400      
001468     MOVE 151            TO WKS-B05-SISTEMA                       040500      
001469     MOVE WKS-FECHA-PROC TO WKS-B05-FCHPRO                        040600      
001470     MOVE 195            TO WKS-B05-NUMPRO                        040700      
001471     MOVE ZEROS          TO WKS-B05-FCHINI                        040800      
001472                            WKS-B05-NUMREGINI.                    040900      
001473                                                                  041000      
001474     CALL "B05PROCESOS IN S151-L001" USING WKS-B05PROCESOS        041100      
001475                                     GIVING W77-RESULT-LIBCON.    041200      
001476                                                                  041300      
001477     IF W77-RESULT-LIBCON = 0                                     041400      
001478          IF WKS-B05-STAPGM = 0                                   041500      
001479              NEXT SENTENCE                                       041600      
001480          ELSE                                                    041700      
001481              PERFORM 08-02000-FINALIZA-PROGRAMA                  041800      
001482     ELSE                                                         041900      
001483          PERFORM 08-01100-CREA-B05.                              042000      
001484                                                                  042100      
001485                                                                  042200      
001486 08-02000-FINALIZA-PROGRAMA.                                      042300      
001487     PERFORM 01-00200-CIERRA-ENTRADA.                             042400      
001488                                                                  042500      
001489     MOVE "I"                      TO TIPO-LJ.                    042600      
001490     MOVE 020102                   TO CODIGO-LJ.                  042700      
001491     MOVE "FIN NORMAL DE PROCESO"  TO TEXTO-LJ.                   042800      
001492     CALL "LJ IN LIB-DISP"         USING CONTADOR-LJ              042900      
001493                                         MENSAJE-LJ.              043000      
001494     CANCEL "LIB-DISP".                                           043100      
001495                                                                  043200      
001496     MOVE TIPO-LJ         TO      WLI-TIPO-LJ                     043300      
001497     MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                    043400      
001498     PERFORM 000-030-IMPRIME-MENSAJE                              043500      
001499     CLOSE V00-REPORTE2 WITH SAVE.                                043600      
001500     STOP RUN.                                                    043700      
001501                                                                  043800      
001502                                                                  043900      
001503 08-01100-CREA-B05.                                               044000      
001504     MOVE 19                      TO WKS-B05-FUNCION              044100      
001505     MOVE 151                     TO WKS-B05-SISTEMA              044200      
001506     MOVE WKS-FECHA-PROC          TO WKS-B05-FCHPRO               044300      
001507     MOVE 195                     TO WKS-B05-NUMPRO               044400      
001508     MOVE ZEROS                   TO WKS-B05-FCHINI               044500      
001509                                     WKS-B05-NUMREGINI.           044600      
001510                                                                  044700      
001511     CALL "B05PROCESOS IN S151-L001" USING WKS-B05PROCESOS        044800      
001512                                    GIVING W77-RESULT-LIBCON.     044900      
001513                                                                  045000      
001514     IF W77-RESULT-LIBCON = 0                                     045100      
001515         NEXT SENTENCE                                            045200      
001516     ELSE                                                         045300      
001517         MOVE "I" TO TIPO-LJ                                      045400      
001518         MOVE 051010 TO CODIGO-LJ                                 045500      
001519         MOVE W77-RESULT-LIBCON            TO W77-ERROR           045600      
001520                                                                  045700      
001521         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  045800      
001522         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    045900      
001523                       WKS-B05-NUMPRO " " WKS-FECHA-PROC          046000      
001524         DELIMITED BY SIZE INTO TEXTO-LJ                          046100      
001525         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           046200      
001526                                           MENSAJE-LJ             046300      
001527         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 046400      
001528         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                046500      
001529         PERFORM 000-030-IMPRIME-MENSAJE.                         046600      
001530                                                                  046700      
001531                                                                  046800      
001532 08-01200-ACTUALIZA-B05.                                          046900      
001533     MOVE 37                      TO WKS-B05-FUNCION              047000      
001534     MOVE 151                     TO WKS-B05-SISTEMA              047100      
001535     MOVE WKS-FECHA-PROC          TO WKS-B05-FCHPRO               047200      
001536     MOVE 195                     TO WKS-B05-NUMPRO               047300      
001537     MOVE ZEROS                   TO WKS-B05-FCHINI               047400      
001538                                     WKS-B05-NUMREGINI            047500      
001539****** ESTATUS DE TERMINACION DEL PROCESO                         047600      
001540     MOVE 01                       TO WKS-B05-STAPGM.             047700      
001541                                                                  047800      
001542     CALL "B05PROCESOS IN S151-L001" USING WKS-B05PROCESOS        047900      
001543                                    GIVING W77-RESULT-LIBCON.     048000      
001544     IF W77-RESULT-LIBCON = 0                                     048100      
001545          NEXT SENTENCE                                           048200      
001546     ELSE                                                         048300      
001547         MOVE "I" TO TIPO-LJ                                      048400      
001548         MOVE 051010 TO CODIGO-LJ                                 048500      
001549         MOVE W77-RESULT-LIBCON            TO W77-ERROR           048600      
001550                                                                  048700      
001551         STRING "FUNCION " WKS-B05-FUNCION " ERROR # " W77-ERROR  048800      
001552         "ERROR AL LLAMADO DE B05PROCESOS" WKS-B05-SISTEMA " "    048900      
001553                       WKS-B05-NUMPRO " " WKS-FECHA-PROC          049000      
001554         DELIMITED BY SIZE INTO TEXTO-LJ                          049100      
001555         CALL "LJ IN LIB-DISP"       USING CONTADOR-LJ,           049200      
001556                                           MENSAJE-LJ             049300      
001557         MOVE TIPO-LJ         TO      WLI-TIPO-LJ                 049400      
001558         MOVE TEXTO-LJ        TO      WLI-TEXTO-LJ                049500      
001559         PERFORM 000-030-IMPRIME-MENSAJE.                         049600      
001560                                                                  049700      
001561**** JCNS FIN - ALTA DISPONIBILIDAD * IBM 20-01-15                049800      
