000100$SET LIST MAPINFO XREF LINEINFO ERRORLIMIT = 100                              
000200*$SET TARGET=LEVEL2                                                           
000300$SET LIST                                                                     
000400*$SET TADS                                                                    
000500 IDENTIFICATION DIVISION.                                                     
000600 PROGRAM-ID.             LEE-PROT-DOM-ALER.                                   
000700 AUTHOR.                 CD.                                                  
000800 INSTALLATION.           BANAMEX                                              
000900                         INGENIERIA DE SISTEMAS                               
001000                         CENTRO DE DESARROLLO LEON.                           
001100 DATE-WRITTEN.           DICIEMBRE 2024.                                      
001200 DATE-COMPILED.                                                               
001300 SECURITY.               COPYRIGHT 2020.                                      
001400 ENVIRONMENT DIVISION.                                                        
001500 CONFIGURATION SECTION.                                                       
001600 SOURCE-COMPUTER.        A10.                                                 
001700 OBJECT-COMPUTER.        A10.                                                 
001800 INPUT-OUTPUT SECTION.                                                        
001900 FILE-CONTROL.                                                                
002000                                                                              
002100      SELECT REPORTE           ASSIGN TO DISK                                 
002200                               ACCESS MODE IS SEQUENTIAL.                     
002300 DATA DIVISION.                                                               
002400 FILE SECTION.                                                                
002500*                                                                             
002600 FD REPORTE                                                                   
002700    VALUE OF     SECURITYTYPE IS PUBLIC                                       
002800                 TITLE IS WKS-ARCH-INTELAR                                    
002900                 MAXRECSIZE   IS  400                                         
003000                 BLOCK CONTAINS   100 RECORDS.                                
003100 01 REG-REPORTE                   PIC X(400).                                 
003200*                                                                             
003300 DATA-BASE SECTION .                                                          
003400  DB S151BD13BIFIN.                                                           
003500  01 S151B07PROTCOB.                                                          
003600  01 S151B10DOMI.                                                             
003700                                                                              
003800 WORKING-STORAGE SECTION.                                                     
003900  01 WKS-FECHA-MAQUINA            PIC X(10) TYPE IS NUMERIC-DATE.             
004000  01 WKS-FECHA-MAQUINA-R          REDEFINES WKS-FECHA-MAQUINA.                
004100     03 WKS-FECMAQ-MM             PIC 9(02).                                  
004200     03 WKS-DIAGONAL1             PIC X(01).                                  
004300     03 WKS-FECMAQ-DD             PIC 9(02).                                  
004400     03 WKS-DIAGONAL2             PIC X(01).                                  
004500     03 WKS-FECMAQ-AAAA           PIC 9(04).                                  
004600     03 WKS-FECMAQ-AAAA-R         REDEFINES WKS-FECMAQ-AAAA.                  
004700        05 WKS-FECMAQ-CC          PIC 9(02).                                  
004800        05 WKS-FECMAQ-AA          PIC 9(02).                                  
004900                                                                              
005000  01 WKS-HR-MAQUINA               PIC 9(08) TYPE IS NUMERIC-TIME.             
005100  01 WKS-HR-MAQUINA-R             REDEFINES WKS-HR-MAQUINA.                   
005200     03 WKS-HH-MAQUINA            PIC 9(02).                                  
005300     03 FILLER                    PIC X(01).                                  
005400     03 WKS-MM-MAQUINA            PIC 9(02).                                  
005500     03 FILLER                    PIC X(01).                                  
005600     03 WKS-SS-MAQUINA            PIC 9(02).                                  
005700                                                                              
005800  01 WKS-FECHA-ARCH.                                                          
005900     03 WKS-AAAA-ARCH             PIC 9(04).                                  
006000     03 WKS-MM-ARCH               PIC 9(02).                                  
006100     03 WKS-DD-ARCH               PIC 9(02).                                  
006200                                                                              
006300  01 WKS-HORA-MAQ.                                                            
006400     03 WKS-MAQ-HH                PIC 9(02).                                  
006500     03 WKS-MAQ-MM                PIC 9(02).                                  
006600     03 WKS-MAQ-SS                PIC 9(02).                                  
006700                                                                              
006800  01 WKS-ARCH-INTELAR.                                                        
006900      05 FILLER             PIC X(16) VALUE "(S151)S151/FILE/".               
007000      05 FILLER             PIC X(14) VALUE "INTS/15110S01/".                 
007100      05 WKS-CSI            PIC 9(02).                                        
007200      05 FILLER             PIC X(01) VALUE "/".                              
007300      05 WKS-NOM-ARCH       PIC X(09).                                        
007400      05 FILLER             PIC X(01) VALUE "/".                              
007500      05 WKS-FECHA          PIC 9(08).                                        
007600      05 FILLER             PIC X(01) VALUE "/".                              
007700      05 WKS-HHMMSS         PIC 9(06).                                        
007800      05 FILLER             PIC X(13) VALUE "/CSV ON CMEMP".                  
007900      05 FILLER             PIC X(01) VALUE ".".                              
008000                                                                              
008100 01 WKS-DET-B07.                                                              
008200    03 WKS-DET-NUM-ID       PIC 9(002).                                       
008300    03 FILLER               PIC X(001) VALUE ",".                             
008400    03 WKS-DET-NUM-CTE      PIC 9(012).                                       
008500    03 FILLER               PIC X(001) VALUE ",".                             
008600    03 WKS-DET-CONTRATO     PIC 9(016).                                       
008700    03 FILLER               PIC X(001) VALUE ",".                             
008800    03 WKS-DET-MED-ACCESO   PIC 9(004).                                       
008900    03 FILLER               PIC X(001) VALUE ",".                             
009000    03 WKS-DET-MDA-PREF     PIC 9(004).                                       
009100    03 FILLER               PIC X(001) VALUE ",".                             
009200    03 WKS-DET-MDA-CUENTA   PIC 9(016).                                       
009300    03 FILLER               PIC X(001) VALUE ",".                             
009400    03 WKS-DET-AUT-APLIC    PIC 9(008).                                       
009500    03 FILLER               PIC X(001) VALUE ",".                             
009600    03 WKS-DET-FEC-CARGO    PIC 9(006).                                       
009700    03 FILLER               PIC X(001) VALUE ",".                             
009800    03 WKS-DET-HR-CARGO     PIC 9(006).                                       
009900    03 FILLER               PIC X(001) VALUE ",".                             
010000    03 WKS-DET-AUT-PC       PIC 9(012).                                       
010100    03 FILLER               PIC X(001) VALUE ",".                             
010200    03 WKS-DET-IMPORTE      PIC 9(014).9(02).                                 
010300    03 FILLER               PIC X(001) VALUE ",".                             
010400    03 WKS-DET-AUT-S151     PIC 9(008).                                       
010500    03 FILLER               PIC X(001) VALUE ",".                             
010600    03 WKS-DET-AUT-ANT-S151 PIC 9(008).                                       
010700    03 FILLER               PIC X(001) VALUE ",".                             
010800    03 WKS-DET-CVE-TRANS    PIC 9(004).                                       
010900    03 FILLER               PIC X(001) VALUE ",".                             
011000    03 WKS-DET-NUM-OCURR    PIC 9(002).                                       
011100    03 FILLER               PIC X(001) VALUE ",".                             
011200    03 WKS-DET-NUM-PROC     PIC 9(002).                                       
011300    03 FILLER               PIC X(001) VALUE ",".                             
011400    03 WKS-DET-STATUS       PIC 9(002).                                       
011500    03 FILLER               PIC X(001) VALUE ",".                             
011600    03 WKS-DET-NUM-ENV      PIC 9(004).                                       
011700    03 FILLER               PIC X(001) VALUE ",".                             
011800    03 WKS-DET-TIPO-MOV     PIC 9(004).                                       
011900    03 FILLER               PIC X(001) VALUE ",".                             
012000    03 WKS-DET-NUM-ERROR    PIC 9(004).                                       
012100    03 FILLER               PIC X(001) VALUE ",".                             
012200    03 WKS-DET-DAT-GEN      PIC X(147).                                       
012300    03 FILLER               PIC X(001) VALUE ",".                             
012400    03 WKS-DET-HR-ENVIO     PIC 9(006).                                       
012500                                                                              
012600 01 WKS-ENCABEZADO-B07.                                                       
012700    02 FILLER               PIC X(60) VALUE                                   
012800   "Id,Cte,Contrato,Cve Acceso,Suc mda,Cuenta,Aut Apli,Fec Carg,".            
012900    02 FILLER               PIC X(59) VALUE                                   
013000    "Hr Carg,Aut pc,importe,Aut S151,Aut Ant S151,Cve,Ocurr,Num ".            
013100    02 FILLER               PIC X(55) VALUE                                   
013200    "Pro,Estatus,Num Env,Tipo Mov,Num Error,Dat Gen,Hr Envio".                
013300                                                                              
013400 01 WKS-DET-B10.                                                              
013500    03 WKS-DET2-NUM-ID         PIC 9(002).                                    
013600    03 FILLER                  PIC X(001) VALUE ",".                          
013700    03 WKS-DET2-CUENTA-CLABE   PIC 9(018).                                    
013800    03 FILLER                  PIC X(001) VALUE ",".                          
013900    03 WKS-DET2-NUM-CTE        PIC 9(012).                                    
014000    03 FILLER                  PIC X(001) VALUE ",".                          
014100    03 WKS-DET2-CONTRATO       PIC 9(016).                                    
014200    03 FILLER                  PIC X(001) VALUE ",".                          
014300    03 WKS-DET2-MED-ACCESO     PIC 9(004).                                    
014400    03 FILLER                  PIC X(001) VALUE ",".                          
014500    03 WKS-DET2-MDA-PREF       PIC 9(004).                                    
014600    03 FILLER                  PIC X(001) VALUE ",".                          
014700    03 WKS-DET2-MDA-CUENTA     PIC 9(016).                                    
014800    03 FILLER                  PIC X(001) VALUE ",".                          
014900    03 WKS-DET2-AUT-APLIC      PIC 9(008).                                    
015000    03 FILLER                  PIC X(001) VALUE ",".                          
015100    03 WKS-DET2-FEC-CARGO      PIC 9(006).                                    
015200    03 FILLER                  PIC X(001) VALUE ",".                          
015300    03 WKS-DET2-HR-CARGO       PIC 9(006).                                    
015400    03 FILLER                  PIC X(001) VALUE ",".                          
015500    03 WKS-DET2-AUTD-FECJUL    PIC 9(004).                                    
015600    03 FILLER                  PIC X(001) VALUE ",".                          
015700    03 WKS-DET2-AUTD-AUT702    PIC 9(008).                                    
015800    03 FILLER                  PIC X(001) VALUE ",".                          
015900    03 WKS-DET2-IMPORTE        PIC 9(014).9(02).                              
016000    03 FILLER                  PIC X(001) VALUE ",".                          
016100    03 WKS-DET2-AUT-S151       PIC 9(008).                                    
016200    03 FILLER                  PIC X(001) VALUE ",".                          
016300    03 WKS-DET2-AUT-ANT-S151   PIC 9(008).                                    
016400    03 FILLER                  PIC X(001) VALUE ",".                          
016500    03 WKS-DET2-CVE-TRANS      PIC 9(004).                                    
016600    03 FILLER                  PIC X(001) VALUE ",".                          
016700    03 WKS-DET2-NUM-OCURR      PIC 9(002).                                    
016800    03 FILLER                  PIC X(001) VALUE ",".                          
016900    03 WKS-DET2-NUM-PROC       PIC 9(002).                                    
017000    03 FILLER                  PIC X(001) VALUE ",".                          
017100    03 WKS-DET2-STATUS         PIC 9(002).                                    
017200    03 FILLER                  PIC X(001) VALUE ",".                          
017300    03 WKS-DET2-NUM-ENV        PIC 9(004).                                    
017400    03 FILLER                  PIC X(001) VALUE ",".                          
017500    03 WKS-DET2-TIPO-MOV       PIC 9(004).                                    
017600    03 FILLER                  PIC X(001) VALUE ",".                          
017700    03 WKS-DET2-NUM-ERROR      PIC 9(004).                                    
017800    03 FILLER                  PIC X(001) VALUE ",".                          
017900    03 WKS-DET2-DAT-GEN        PIC X(147).                                    
018000    03 FILLER                  PIC X(001) VALUE ",".                          
018100    03 WKS-DET2-HR-ENVIO       PIC 9(006).                                    
018200    03 FILLER                  PIC X(001) VALUE ",".                          
018300    03 WKS-DET2-SUC-PROM       PIC 9(004).                                    
018400                                                                              
018500 01 WKS-ENCABEZADO-B10.                                                       
018600    02 FILLER               PIC X(59) VALUE                                   
018700    "Id,Cta Clabe,Cte,Contrato,Cve Acceso,Suc Mda,Cuenta,Aut Apl".            
018800    02 FILLER               PIC X(59) VALUE                                   
018900    "i,Fec Carg,Hr Carg,Fec Juliana,Aut 702,Importe,Aut S151,Aut".            
019000    02 FILLER               PIC X(59) VALUE                                   
019100    " Ant S151,Cve,Ocurr,Num Pro,Estatus,Num Env,Tipo Mov,Num Er".            
019200    02 FILLER               PIC X(34) VALUE                                   
019300    "ror,Dat Gen,Hr Envio,Suc Promotora".                                     
019400                                                                              
019500 01 WKS-LINEA-ERROR.                                                          
019600    03 FILLER               PIC X(30) VALUE SPACES.                           
019700    03 FILLER               PIC X(51) VALUE                                   
019800    "PARAMETROS INVALIDOS PARA LA GENERACION DEL ARCHIVO".                    
019900                                                                              
020000*==========================================================                   
020100*         VARIABLES LIBRERIA SOPORTECOMS                  =                   
020200*==========================================================                   
020300                                                                              
020400 01  WKS-SOPCOMS.                                                             
020500     03 WKS-NUMCSI                 PIC 9(02).                                 
020600     03 WKS-NOMEQUIPO              PIC X(10).                                 
020700     03 WKS-NOMCSI                 PIC X(26).                                 
020800     03 WKS-LINEA-BATCH            PIC X(05).                                 
020900                                                                              
021000 01 WKSPARAMETRO.                                                             
021100    02 WKS-PARAM-ID                   PIC 9(02).                              
021200    02 WKS-PARAM-FECHA                PIC 9(08).                              
021201    02 WKS-PARAM-FECHA-R REDEFINES WKS-PARAM-FECHA.                           
021202       03 WKS-PA-FE-CC                PIC 9(02).                              
021203       03 WKS-PA-FE-AAMMDD            PIC 9(06).                              
021300    02 WKS-PARAM-CTO                  PIC 9(16).                              
021400                                                                              
021500 01 W77-INTENTO                    PIC 9(01).                                 
021600 77 W77-NUMMOVS                    PIC 9(06).                                 
021700 01 W77-FIN                        PIC 9(04).                                 
021800 01 WKS-CASO                       PIC 9(01).                                 
021900 01 WKS-OK                         PIC 9(01).                                 
022000                                                                              
022100*=================================================================            
022200*                    LIB LJ                                                   
022300*=================================================================            
022400 77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                               
022500 01 MENSAJE-LJ.                                                               
022600    02 SISTEMA-LJ     PIC X(04).                                              
022700    02 FILLER         PIC X VALUE "/".                                        
022800    02 PASO-LJ        PIC X(04).                                              
022900    02 FILLER         PIC X VALUE "/".                                        
023000    02 MTP-LJ         PIC 9(03).                                              
023100    02 FILLER         PIC X VALUE ":".                                        
023200    02 TIPO-LJ        PIC X.                                                  
023300    02 FILLER         PIC X VALUE ">".                                        
023400    02 CODIGO-LJ      PIC 9(06).                                              
023500    02 FILLER         PIC X VALUE "<".                                        
023600    02 TEXTO-LJ       PIC X(250).                                             
023700                                                                              
023800                                                                              
023900 PROCEDURE DIVISION USING WKSPARAMETRO.                                       
024000                                                                              
024100 000000-INIC-PROGRAMA.                                                        
024200*=================================================================            
024300   PERFORM 100100-LIGA-LJ.                                                    
024400   MOVE "P671"                   TO PASO-LJ   .                               
024500   MOVE "S151"                   TO SISTEMA-LJ.                               
024600   MOVE "002"                    TO MTP-LJ    .                               
024700   MOVE "I"                      TO TIPO-LJ   .                               
024800   MOVE ZERO                     TO W77-NUMMOVS.                              
024900   PERFORM 00050-INICIO.                                                      
025000   MOVE 1                        TO W77-FIN.                                  
025100   MOVE 0                        TO W77-INTENTO.                              
025200   PERFORM 700100-ABRE-BD UNTIL W77-FIN = 0 OR W77-INTENTO > 6.               
025300   IF W77-FIN=0                                                               
025400      PERFORM 00100-PROCESO                                                   
025500   ELSE                                                                       
025600      MOVE "ERROR AL ABRIR LA S151BD13BIFIN" TO TEXTO-LJ                      
025700      PERFORM 700000-LOG                                                      
025800      PERFORM 700020-DS.                                                      
025900   PERFORM 00999-TERMINA.                                                     
026000                                                                              
026100 100100-LIGA-LJ.                                                              
026200*================================================================             
026300   CHANGE ATTRIBUTE TITLE            OF "LIB-DISP"                            
026400                                    TO                                        
026500    "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".                          
026600                                                                              
026700   MOVE "S151"                       TO  SISTEMA-LJ.                          
026800   MOVE "P605"                       TO  PASO-LJ.                             
026900   MOVE "001"                        TO  MTP-LJ.                              
027000   MOVE "I"                          TO  TIPO-LJ.                             
027100   MOVE 151605                       TO  CODIGO-LJ.                           
027200                                                                              
027300 00050-INICIO.                                                                
027400*=================================================================            
027500   ACCEPT  WKS-HR-MAQUINA        FROM TIME.                                   
027600   MOVE WKS-HH-MAQUINA           TO WKS-MAQ-HH.                               
027700   MOVE WKS-MM-MAQUINA           TO WKS-MAQ-MM.                               
027800   MOVE WKS-SS-MAQUINA           TO WKS-MAQ-SS.                               
027900   MOVE WKS-HORA-MAQ             TO WKS-HHMMSS.                               
028000                                                                              
028100   ACCEPT WKS-FECHA-MAQUINA      FROM TODAYS-DATE.                            
028200   MOVE WKS-FECMAQ-MM            TO WKS-MM-ARCH  .                            
028300   MOVE WKS-FECMAQ-DD            TO WKS-DD-ARCH  .                            
028400   MOVE WKS-FECMAQ-AAAA          TO WKS-AAAA-ARCH.                            
028500   MOVE WKS-PARAM-FECHA           TO WKS-FECHA.                               
028600                                                                              
028700   CHANGE ATTRIBUTE LIBACCESS    OF "SOPORTECOMS" TO BYFUNCTION.              
028800   CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS" TO                          
028900                                    "SOPORTECOMS".                            
029000   CHANGE ATTRIBUTE TITLE OF "LIB-DISP" TO                                    
029100          "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK".                     
029200                                                                              
029300   CALL "CSIID IN SOPORTECOMS" USING WKS-SOPCOMS.                             
029400   CANCEL "SOPORTECOMS".                                                      
029500   MOVE WKS-NUMCSI                TO WKS-CSI.                                 
029600                                                                              
029700 700100-ABRE-BD.                                                              
029800*=================================================================            
029900    MOVE ZERO  TO  W77-FIN                                                    
030000    OPEN INQUIRY S151BD13BIFIN                                                
030100    ON EXCEPTION                                                              
030200       MOVE     1                               TO W77-FIN                    
030300       ADD      1                               TO W77-INTENTO                
030400       WAIT(10).                                                              
030500                                                                              
030600 00100-PROCESO.                                                               
030700*=================================================================            
030800   PERFORM 00110-VAL-PARAM.                                                   
030900   IF WKS-CASO > 0                                                            
031000      CHANGE ATTRIBUTE TITLE OF REPORTE  TO WKS-ARCH-INTELAR                  
031100      OPEN OUTPUT REPORTE                                                     
031200      PERFORM 00120-VAL-CASO                                                  
031300      CLOSE REPORTE WITH SAVE                                                 
031400   ELSE                                                                       
031500      MOVE "PARAMETRO INVALIDO" TO TEXTO-LJ                                   
031600      PERFORM 700000-LOG                                                      
031700      PERFORM 700020-DS.                                                      
031800                                                                              
031900 700000-LOG.                                                                  
032000*=================================================================            
032100   CALL "LJ IN LIB-DISP" USING CONTADOR-LJ                                    
032200                               MENSAJE-LJ.                                    
032300                                                                              
032400 700020-DS.                                                                   
032500*=================================================================            
032600   CHANGE ATTRIBUTE STATUS        OF MYSELF                                   
032700                                  TO -1.                                      
032800                                                                              
032900 00110-VAL-PARAM.                                                             
033000*=================================================================            
033100   IF WKS-PA-FE-AAMMDD >0 AND WKS-PARAM-CTO= 0                                
033200      MOVE 1                           TO WKS-CASO                            
033300   ELSE                                                                       
033400      IF WKS-PA-FE-AAMMDD >0 AND WKS-PARAM-CTO > 0                            
033500         MOVE 2                           TO WKS-CASO                         
033600      ELSE                                                                    
033700         MOVE 0                           TO WKS-CASO.                        
033800   IF WKS-CASO >0 AND (WKS-PARAM-ID = 1 OR WKS-PARAM-ID = 2 OR                
033900      WKS-PARAM-ID = 3)                                                       
034000      NEXT SENTENCE                                                           
034100   ELSE                                                                       
034200      MOVE 0                           TO WKS-CASO.                           
034300   IF WKS-PARAM-ID = 1                                                        
034400      MOVE "PROTECCOB"          TO WKS-NOM-ARCH.                              
034500   IF WKS-PARAM-ID = 2                                                        
034600      MOVE "ALERTANOT"          TO WKS-NOM-ARCH.                              
034700   IF WKS-PARAM-ID = 3                                                        
034800      MOVE "DOMICILIA"          TO WKS-NOM-ARCH.                              
034900                                                                              
035000 00120-VAL-CASO.                                                              
035100*=================================================================            
035200   IF WKS-PARAM-ID = 1 OR WKS-PARAM-ID = 2                                    
035300      WRITE REG-REPORTE      FROM WKS-ENCABEZADO-B07                          
035400      PERFORM 00121-BUSCAB07.                                                 
035500                                                                              
035600   IF WKS-PARAM-ID = 3                                                        
035700      WRITE REG-REPORTE      FROM WKS-ENCABEZADO-B10                          
035800      PERFORM 00130-BUSCAB10.                                                 
035900                                                                              
036000 00121-BUSCAB07.                                                              
036100*=================================================================            
036200   IF WKS-CASO = 1                                                            
036300      PERFORM 010-0400-PRIMER-CASO-1                                          
036400      IF WKS-OK = 0                                                           
036500         PERFORM 00122-GRABA-REGISTRO UNTIL WKS-OK = 1.                       
036600                                                                              
036700   IF WKS-CASO = 2                                                            
036800      PERFORM 010-0500-PRIMER-CASO-2                                          
036900      IF WKS-OK = 0                                                           
037000         PERFORM 00122-GRABA-REGISTRO UNTIL WKS-OK = 1.                       
037100                                                                              
037200                                                                              
037300 010-0400-PRIMER-CASO-1.                                                      
037400*=================================================================            
037500     MOVE        ZERO TO WKS-OK                                               
037600     FIND  FIRST B07SXFECHA                                                   
037700       AT B07-NUM-ID    = WKS-PARAM-ID AND                                    
037800          B07-FEC-CARGO = WKS-PA-FE-AAMMDD                                    
037900          ON EXCEPTION                                                        
038000          IF DMSTATUS(NOTFOUND)                                               
038100             MOVE 1 TO WKS-OK.                                                
038200                                                                              
038300 010-0400-SIGUIENTE-CASO-1.                                                   
038400*=================================================================            
038500   FIND NEXT B10SXFECAUT151                                                   
038600      AT B10-NUM-ID    = WKS-PARAM-ID AND                                     
038700         B10-FEC-CARGO = WKS-PA-FE-AAMMDD                                     
038800      ON EXCEPTION                                                            
038900         IF DMSTATUS(NOTFOUND)                                                
039000            MOVE 1 TO WKS-OK.                                                 
039100   IF WKS-OK = 0 AND B10-NUM-ID    = WKS-PARAM-ID AND                         
039200      B10-FEC-CARGO = WKS-PA-FE-AAMMDD                                        
039300      NEXT SENTENCE                                                           
039400   ELSE                                                                       
039500      MOVE 1 TO WKS-OK.                                                       
039600                                                                              
039700 010-0500-PRIMER-CASO-2.                                                      
039800*=================================================================            
039900     MOVE        ZERO TO WKS-OK                                               
040000     FIND  FIRST B07SXFECHA                                                   
040100       AT B07-NUM-ID    = WKS-PARAM-ID AND                                    
040200          B07-FEC-CARGO = WKS-PA-FE-AAMMDD AND                                
040300          B07-CONTRATO  = WKS-PARAM-CTO                                       
040400          ON EXCEPTION                                                        
040500          IF DMSTATUS(NOTFOUND)                                               
040600             MOVE 1 TO WKS-OK.                                                
040700                                                                              
040800 010-0500-SIGUIENTE-CASO-2.                                                   
040900*=================================================================            
041000   FIND NEXT B10SXFECAUT151                                                   
041100      AT B10-NUM-ID    = WKS-PARAM-ID AND                                     
041200          B10-FEC-CARGO = WKS-PA-FE-AAMMDD                                    
041300      ON EXCEPTION                                                            
041400         IF DMSTATUS(NOTFOUND)                                                
041500            MOVE 1 TO WKS-OK.                                                 
041600                                                                              
041700   IF WKS-OK = 0 AND B10-NUM-ID    = WKS-PARAM-ID AND                         
041800      B10-FEC-CARGO = WKS-PA-FE-AAMMDD AND                                    
041900         B10-CONTRATO  = WKS-PARAM-CTO                                        
042000      NEXT SENTENCE                                                           
042100   ELSE                                                                       
042200      MOVE 1 TO WKS-OK.                                                       
042300                                                                              
042400 00130-BUSCAB10.                                                              
042500*=================================================================            
042600   IF WKS-CASO = 1                                                            
042700      PERFORM 010-0600-PRIMER-CASO-1                                          
042800      IF WKS-OK = 0                                                           
042900         PERFORM 00122-GRABA-REGISTRO2 UNTIL WKS-OK = 1.                      
043000                                                                              
043100   IF WKS-CASO = 2                                                            
043200      PERFORM 010-0700-PRIMER-CASO-2                                          
043300      IF WKS-OK = 0                                                           
043400         PERFORM 00122-GRABA-REGISTRO2 UNTIL WKS-OK = 1.                      
043500                                                                              
043600 010-0600-PRIMER-CASO-1.                                                      
043700*=================================================================            
043800     MOVE        ZERO TO WKS-OK                                               
043900     FIND  FIRST B10SXFECAUT151                                               
044000       AT B10-NUM-ID = WKS-PARAM-ID AND                                       
044100          B10-FEC-CARGO = WKS-PA-FE-AAMMDD                                    
044200          ON EXCEPTION                                                        
044300          IF DMSTATUS(NOTFOUND)                                               
044400             MOVE 1 TO WKS-OK.                                                
044500                                                                              
044600 010-0600-SIGUIENTE-CASO-1.                                                   
044700*=================================================================            
044800   FIND NEXT B07SXFECHA                                                       
044900      AT B07-NUM-ID    = WKS-PARAM-ID AND                                     
045000         B07-FEC-CARGO = WKS-PA-FE-AAMMDD                                     
045100      ON EXCEPTION                                                            
045200         IF DMSTATUS(NOTFOUND)                                                
045300            MOVE 1 TO WKS-OK.                                                 
045400   IF WKS-OK = 0 AND B07-NUM-ID    = WKS-PARAM-ID AND                         
045500      B07-FEC-CARGO = WKS-PA-FE-AAMMDD                                        
045600      NEXT SENTENCE                                                           
045700   ELSE                                                                       
045800      MOVE 1 TO WKS-OK.                                                       
045900                                                                              
046000 010-0700-PRIMER-CASO-2.                                                      
046100*=================================================================            
046200     MOVE        ZERO TO WKS-OK                                               
046300     FIND  FIRST B10SXFECAUT151                                               
046400       AT B10-NUM-ID    = WKS-PARAM-ID AND                                    
046500          B10-FEC-CARGO = WKS-PA-FE-AAMMDD                                    
046600          ON EXCEPTION                                                        
046700          IF DMSTATUS(NOTFOUND)                                               
046800             MOVE 1 TO WKS-OK.                                                
046900    IF WKS-OK = 0 AND B10-NUM-ID    = WKS-PARAM-ID AND                        
047000      B10-FEC-CARGO = WKS-PA-FE-AAMMDD AND                                    
047100         B10-CONTRATO  = WKS-PARAM-CTO                                        
047200      NEXT SENTENCE                                                           
047300   ELSE                                                                       
047400      MOVE 1 TO WKS-OK.                                                       
047500 010-0700-SIGUIENTE-CASO-2.                                                   
047600*=================================================================            
047700   FIND NEXT B07SXFECHA                                                       
047800      AT B07-NUM-ID    = WKS-PARAM-ID AND                                     
047900         B07-FEC-CARGO = WKS-PA-FE-AAMMDD AND                                 
048000         B07-CONTRATO  = WKS-PARAM-CTO                                        
048100      ON EXCEPTION                                                            
048200         IF DMSTATUS(NOTFOUND)                                                
048300            MOVE 1 TO WKS-OK.                                                 
048400   IF WKS-OK = 0 AND B07-NUM-ID    = WKS-PARAM-ID AND                         
048500          B07-CONTRATO  = WKS-PARAM-CTO AND                                   
048600          B07-FEC-CARGO = WKS-PA-FE-AAMMDD                                    
048700      NEXT SENTENCE                                                           
048800   ELSE                                                                       
048900      MOVE 1 TO WKS-OK.                                                       
049000                                                                              
049100                                                                              
049200                                                                              
049300 00122-GRABA-REGISTRO.                                                        
049400*=================================================================            
049500   MOVE B07-NUM-ID         TO WKS-DET-NUM-ID      .                           
049600   MOVE B07-NUM-CTE        TO WKS-DET-NUM-CTE     .                           
049700   MOVE B07-CONTRATO       TO WKS-DET-CONTRATO    .                           
049800   MOVE B07-MED-ACCESO     TO WKS-DET-MED-ACCESO  .                           
049900   MOVE B07-MDA-PREF       TO WKS-DET-MDA-PREF    .                           
050000   MOVE B07-MDA-CUENTA     TO WKS-DET-MDA-CUENTA  .                           
050100   MOVE B07-AUT-APLIC      TO WKS-DET-AUT-APLIC   .                           
050200   MOVE B07-FEC-CARGO      TO WKS-DET-FEC-CARGO   .                           
050300   MOVE B07-HR-CARGO       TO WKS-DET-HR-CARGO    .                           
050400   MOVE B07-AUT-PC         TO WKS-DET-AUT-PC      .                           
050500   MOVE B07-IMPORTE        TO WKS-DET-IMPORTE     .                           
050600   MOVE B07-AUT-S151       TO WKS-DET-AUT-S151    .                           
050700   MOVE B07-AUT-ANT-S151   TO WKS-DET-AUT-ANT-S151.                           
050800   MOVE B07-CVE-TRANS      TO WKS-DET-CVE-TRANS   .                           
050900   MOVE B07-NUM-OCURR      TO WKS-DET-NUM-OCURR   .                           
051000   MOVE B07-NUM-PROC       TO WKS-DET-NUM-PROC    .                           
051100   MOVE B07-STATUS         TO WKS-DET-STATUS      .                           
051200   MOVE B07-NUM-ENV        TO WKS-DET-NUM-ENV     .                           
051300   MOVE B07-TIPO-MOV       TO WKS-DET-TIPO-MOV    .                           
051400   MOVE B07-NUM-ERROR      TO WKS-DET-NUM-ERROR   .                           
051500   MOVE B07-DAT-GEN        TO WKS-DET-DAT-GEN     .                           
051600   MOVE B07-HR-ENVIO       TO WKS-DET-HR-ENVIO    .                           
051700   WRITE REG-REPORTE       FROM WKS-DET-B07.                                  
051800   IF WKS-CASO = 1                                                            
051900      PERFORM 010-0600-SIGUIENTE-CASO-1.                                      
052000   IF WKS-CASO = 2                                                            
052100      PERFORM 010-0700-SIGUIENTE-CASO-2.                                      
052200                                                                              
052300 00122-GRABA-REGISTRO2.                                                       
052400*=================================================================            
052500   MOVE B10-NUM-ID         TO WKS-DET2-NUM-ID      .                          
052600   MOVE B10-CUENTA-CLABE   TO WKS-DET2-CUENTA-CLABE.                          
052700   MOVE B10-NUM-CTE        TO WKS-DET2-NUM-CTE     .                          
052800   MOVE B10-CONTRATO       TO WKS-DET2-CONTRATO    .                          
052900   MOVE B10-MED-ACCESO     TO WKS-DET2-MED-ACCESO  .                          
053000   MOVE B10-MDA-PREF       TO WKS-DET2-MDA-PREF    .                          
053100   MOVE B10-MDA-CUENTA     TO WKS-DET2-MDA-CUENTA  .                          
053200   MOVE B10-AUT-APLIC      TO WKS-DET2-AUT-APLIC   .                          
053300   MOVE B10-FEC-CARGO      TO WKS-DET2-FEC-CARGO   .                          
053400   MOVE B10-HR-CARGO       TO WKS-DET2-HR-CARGO    .                          
053500   MOVE B10-AUTD-FECJUL    TO WKS-DET2-AUTD-FECJUL .                          
053600   MOVE B10-AUTD-AUT702    TO WKS-DET2-AUTD-AUT702 .                          
053700   MOVE B10-IMPORTE        TO WKS-DET2-IMPORTE     .                          
053800   MOVE B10-AUT-S151       TO WKS-DET2-AUT-S151    .                          
053900   MOVE B10-AUT-ANT-S151   TO WKS-DET2-AUT-ANT-S151.                          
054000   MOVE B10-CVE-TRANS      TO WKS-DET2-CVE-TRANS   .                          
054100   MOVE B10-NUM-OCURR      TO WKS-DET2-NUM-OCURR   .                          
054200   MOVE B10-NUM-PROC       TO WKS-DET2-NUM-PROC    .                          
054300   MOVE B10-STATUS         TO WKS-DET2-STATUS      .                          
054400   MOVE B10-NUM-ENV        TO WKS-DET2-NUM-ENV     .                          
054500   MOVE B10-TIPO-MOV       TO WKS-DET2-TIPO-MOV    .                          
054600   MOVE B10-NUM-ERROR      TO WKS-DET2-NUM-ERROR   .                          
054700   MOVE B10-DAT-GEN        TO WKS-DET2-DAT-GEN     .                          
054800   MOVE B10-HR-ENVIO       TO WKS-DET2-HR-ENVIO    .                          
054900   MOVE B10-SUC-PROM       TO WKS-DET2-SUC-PROM    .                          
055000   WRITE REG-REPORTE       FROM WKS-DET-B10.                                  
055100   IF WKS-CASO = 1                                                            
055200      PERFORM 010-0400-SIGUIENTE-CASO-1.                                      
055300   IF WKS-CASO = 2                                                            
055400      PERFORM 010-0500-SIGUIENTE-CASO-2.                                      
055500                                                                              
055600                                                                              
055700 00999-TERMINA.                                                               
055800*=================================================================            
055900  STOP RUN.                                                                   
