      *=================================================================
      * PROGRAMA : RPTSIN  (RPG IV fixed-format)
      * PROPOSITO: Reporte de siniestros del anio en curso
      * LLAMADO POR: PROCNOC (CL)
      * LLAMA A    : (ninguno)
      * NOTA      : [ANTIPATRON PLANTADO] flujo controlado por
      *             indicadores *IN50/*IN60 (logica booleana global)
      *=================================================================
     FSINIEST   IF   E           K DISK
     F                                     RENAME(SINIESTR:SINREC)
      *
      * RN-107: solo siniestros del anio en curso. ANIO_CORTE = 26
      *         (anio de 2 digitos -> ventana de siglo)
     D ANIO_CORTE      S              2S 0 INZ(26)
     D wTotal          S             13P 2
      *
     C                   READ      SINIEST                       50
     C     *IN50         DOWEQ     *OFF
      *  *IN60 marca "siniestro del anio en curso"
     C                   MOVE      *OFF          *IN60
     C     SINANIO       IFEQ      ANIO_CORTE
     C                   MOVE      *ON           *IN60
     C                   END
     C     *IN60         IFEQ      *ON
     C     SINESTADO     IFEQ      'PA'
     C                   ADD       SINMONTO      wTotal
     C                   END
     C                   END
     C                   READ      SINIEST                       50
     C                   ENDDO
      *
     C     wTotal        DSPLY
     C                   SETON                                        LR