001000$SET XREF                                                                     
001050$SET LIST      ERRORLIST                                                      
001100$SET STACK  LINEINFO    ERRORLIMIT=100                                        
001150$SET S006LOCSUP                                                               
001151*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
001200$SET S016L428 S016L428R01 S016L428R03 S016L428R04                             
001201*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
001221*P0120414 CHARITY Regulatory Requirement III* 1 LINEA  PCB AG/19*             
001231*SE RESETEA PARA PRUEBAS UNITARIAS TEMPORALMENTE                              
001235*SE ENCIENDE 24/MAR/2020 LIBERACION CHARITY 1 LINEA PCB MAR     *             
001241$SET S016L428R05                                                              
001250$SET S100VERSIONES                                                            
001300$SET SYSTEMLIBCOMS                                                            
001350$SET SYSTEMLIBCOMSXATMI                                                       
001600$SET TITPROGCTLVERS                                                           
001650$SET GENERALSUPPORT                                                           
001700$SET DIALOGO                                                                  
001750$SET SYSTEMLIBCOMSXATMI                                                       
001800$SET HOSTNAME                                                                 
002000************************************************************                  
002100*                                                          *                  
002200* PROGRAMA  :  MPD/SOURCE/P050/06MTPnnn                    *                  
002300*                                                          *                  
002400* FUNCION   : <> ENVIAR AL S016 LOS AVISOS DE APERTURA     *                  
002500*                                                          *                  
002600*                                                          *                  
002700*                                                          *                  
002800*                                                          *                  
002900*                                                          *                  
003000************************************************************                  
005000 IDENTIFICATION DIVISION.                                                     
005100 PROGRAM-ID.              P050LIN.                                            
005200 AUTHOR.                  MPD,JOSE LUIS IBARRA LARA.                          
005300 INSTALLATION.            INGENIERIA DE SISTEMAS  ( BANAMEX )                 
005400                          CENTRO DE DESARROLLO LEON.                          
005500 DATE-WRITTEN.            OCTUBRE DEL 2006.                                   
005600 SECURITY.                COPYRIGHT 2006 BY THE AUTHOR.                       
005700 ENVIRONMENT DIVISION.                                                        
005800 INPUT-OUTPUT SECTION.                                                        
007000 FILE-CONTROL.                                                                
007100          SELECT I01-ACTIVAMED      ASSIGN TO DISK.                           
007170          SELECT I03-ARCH-PROB      ASSIGN TO DISK.                           
007190          SELECT I04-PROCMED        ASSIGN TO DISK.                           
007200          SELECT R01-ACTMEDIOS      ASSIGN TO PRINTER.                        
007400 DATA DIVISION.                                                               
007500 FILE SECTION.                                                                
007600***************************************************************               
007700 FD I01-ACTIVAMED                                                             
007800    BLOCK   CONTAINS     100   RECORDS                                        
007900    RECORD  CONTAINS     180   CHARACTERS                                     
008000    VALUE OF        TITLE IS WKS-TIT-I01-ACTIVAMED.                           
008100                                                                              
008200 01 I01-REG-ACTIVAMED    PIC X(180).                                          
008205                                                                              
008210**************************************************************                
008300**************************************************************                
008305 FD I03-ARCH-PROB                                                             
008310    BLOCK CONTAINS        20  RECORDS                                         
008315    RECORD CONTAINS      132  CHARACTERS                                      
008320    VALUE OF                                                                  
008325            AREAS       IS 1000                                               
008330            AREASIZE    IS  675                                               
008335            PROTECTION  IS PROTECTED                                          
008340            SAVEFACTOR  IS 99.                                                
008345                                                                              
008350 01 I02-REG-ARCH-PROB     PIC X(132).                                         
008355                                                                              
008357**************************************************************                
008359 FD I04-PROCMED                                                               
008361    BLOCK CONTAINS        20  RECORDS                                         
008363    RECORD CONTAINS      132  CHARACTERS                                      
008365    VALUE OF                                                                  
008367            AREAS       IS 1000                                               
008369            AREASIZE    IS  675                                               
008371            PROTECTION  IS PROTECTED                                          
008373            SAVEFACTOR  IS 99.                                                
008375                                                                              
008377 01 I04-REG-PROCMED       PIC X(132).                                         
008379                                                                              
008400**************************************************************                
008500 FD R01-ACTMEDIOS.                                                            
008600                                                                              
008700 01 R01-REG-ACTMEDIOS     PIC  X(132).                                        
008800                                                                              
008900**************************************************************                
009400**************************************************************                
010000                                                                              
030200                                                                              
050000***********************************************************                   
050100*                                                         *                   
050200*  W O R K I N G - S T O R A G E    S E C T I O N         *                   
050300*                                                         *                   
050400***********************************************************                   
050500 WORKING-STORAGE SECTION.                                                     
050600                                                                              
050700***********************************************************                   
050800*                 COPY'S                                  *                   
050900***********************************************************                   
051100     COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".                    
051300  COPY "S500/INC/WOR/25MTP002".                                               
052200                                                                              
060000***********************************************************                   
060100*          VARIABLES QUE USAN LAS LIBRERIAS               *                   
060200***********************************************************                   
070000** DESCRIPCION DE REGISTROS DE ARCHIVOS Y NOMBRE EXTERNO **                   
073100 01 WKS-REG-PROBLEMAS             PIC X(132).                                 
073200 01 WKS-LIN-PROBLEMAS             PIC 9(003) VALUE 65.                        
073300                                                                              
075000* FORMATOS DE ENTRY POINTS DE LA L010 PARA MANEJO DE AVISOS AL                
075100* S016 POR APERTURAS.                                                         
075200                                                                              
075300 77 WS-L010-RESULT                PIC 9(02).                                  
075400                                                                              
075500** ENTRY POINT DE S500L010FECGENMDA                                           
075600 01 WS-OUT-FECGENMDA.                                                         
075700    03 WS-O-FG-FEC-GENMDA         PIC 9(08).                                  
075800    03 WS-O-FG-FEC-LINEA          PIC 9(08).                                  
075900    03 WS-O-FG-CONT-L428          PIC 9(01).                                  
076000                                                                              
076100** ENTRY POINT DE S500L010USAGENMDA                                           
076200 01 WS-IN-USAGENMDA.                                                          
076300    03 WS-I-UG-FUNCION            PIC 9(02).                                  
076400*      1   GRABA EL REGISTRO DE AVISO EN ARCHIVO GENMDA                       
076500*      2   LEE UN REGISTRO DE AVISO DEL ARCHIVO GENMDA                        
076600*      2   REGRABA EL REGISTRO DE AVISO PROCESADO EN ARCH GENMDA              
076700    03 FILLER                     PIC X(28).                                  
076800    03 WS-I-UG-STA-REG            PIC 9(02).                                  
076900    03 FILLER                     PIC X(20).                                  
077000                                                                              
077100 01 WS-OUT-USAGENMDA.                                                         
077150    03 WS-O-UG-FEC-GENMDA         PIC 9(08).                                  
077200    03 WS-O-UG-TIPO-REG           PIC 9(02).                                  
077300    03 WS-O-UG-PRDTO              PIC 9(04).                                  
077400    03 WS-O-UG-INSTR              PIC 9(04).                                  
077500    03 WS-O-UG-MONEDA             PIC 9(02).                                  
077600    03 WS-O-UG-SUC-PROM           PIC 9(04).                                  
077601*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
077700    03 WS-O-UG-CONTRATO           PIC 9(16).                                  
077702    03 WS-O-UG-CONTRATO-R REDEFINES WS-O-UG-CONTRATO.                         
077704       05 WS-O-UG-CTO-NUM-PREF    PIC 9(04).                                  
077706       05 WS-O-UG-CTO-NUM         PIC 9(12).                                  
077707*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
077800    03 WS-O-UG-STA-REG            PIC 9(02).                                  
077900    03 WS-O-UG-STA-CTO            PIC 9(02).                                  
078000    03 WS-O-UG-STA-MDA            PIC 9(02).                                  
078100    03 WS-O-UG-FEC-MAQ            PIC 9(08).                                  
078200    03 WS-O-UG-HRA-MAQ            PIC 9(06).                                  
078300    03 WS-O-UG-PROCESO            PIC 9(02).                                  
078320    03 WS-O-UG-NUMCTE             PIC 9(12).                                  
078340    03 WS-O-UG-NOMBRE             PIC X(36).                                  
078360    03 WS-O-UG-OPCPAGO            PIC 9(02).                                  
078380    03 WS-O-UG-RGOPAGO            PIC 9(02).                                  
078400                                                                              
079000 01 WS-REG-BACKUP-UN-ARCH.                                                    
079050    03 WS-RBU-RES-S016            PIC 9(04).                                  
079100    03 WS-RBU-STA-ENVIO           PIC 9(02).                                  
079150    03 WS-RBU-SUC-PROM            PIC 9(04).                                  
079200    03 WS-RBU-NUM-CTE             PIC 9(12).                                  
079250    03 WS-RBU-PRDTO               PIC 9(04).                                  
079300    03 WS-RBU-INSTR               PIC 9(04).                                  
079350    03 WS-RBU-MONEDA              PIC 9(02).                                  
079351*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
079400    03 WS-RBU-CONTRATO            PIC 9(16).                                  
079401*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
079450    03 WS-RBU-NOMBRE              PIC X(36).                                  
079500    03 WS-RBU-FEC-RECEP           PIC 9(08).                                  
079550    03 WS-RBU-HRA-RECEP           PIC 9(06).                                  
079600    03 WS-RBU-FEC-ENVIO           PIC 9(08).                                  
079650    03 WS-RBU-HRA-ENVIO           PIC 9(06).                                  
079700    03 WS-RBU-OPCPAGO             PIC 9(02).                                  
079850    03 WS-RBU-RGOPAGO             PIC 9(02).                                  
079860*P0120414 CHARITY Regulatory Requirement III* 1 LINEA  PCB AG/19*             
079875    03 WS-RBU-TIPREG              PIC 9(02).                                  
079900                                                                              
080000*****     TABLAS NECESARIAS                    ************                   
080100                                                                              
080200 01 TABLA-DE-MESES.                                                           
080300    02 FILLER                     PIC X(36) VALUE                             
080400             "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".                          
080500 01 TABLA-DE-MESES-R REDEFINES TABLA-DE-MESES.                                
080600    02  T-M       OCCURS 12 TIMES PIC XXX.                                    
080700                                                                              
090000*****     CARATULA PARA LOS BACKUPS            ************                   
090100                                                                              
090200 01 WKS-CARATULA.                                                             
090300    03 FILLER             PIC X(15) VALUE "S500/LIST/P050/".                  
090400    03 CARAT-CSI          PIC 99.                                             
090500    03 CARAT-SUBNODO      PIC 99 VALUE 0.                                     
090700    03 CARAT-CIFRA        PIC X(02) VALUE "/R".                               
090800    03 CARAT-NUMPRO       PIC 9(03) VALUE 000.                                
090850    03 FILLER             PIC X VALUE "/".                                    
090900    03 CARAT-FECHA        PIC 9(6).                                           
091000    03 FILLER             PIC X VALUE "/".                                    
091100    03 CARAT-MIX          PIC 9(07).                                          
091200    03 FILLER             PIC X VALUE "/".                                    
091300    03 CARAT-NOMREPORTE   PIC X(16).                                          
091600    03 FILLER             PIC X VALUE ".".                                    
091700                                                                              
091800*****     CARATULA ARCHIVO I01-ACTIVAMED       ************                   
091900 01 WKS-TIT-I01-ACTIVAMED.                                                    
092000    02 FILLER              PIC X(25) VALUE                                    
092100                           "S500/FILE/S500/ACTIVAMED/".                       
092200    02 WKS-TIT-I01-CSI     PIC 9(02).                                         
092300    02 FILLER              PIC X     VALUE "/".                               
092400    02 WKS-TIT-I01-FECH    PIC 9(06).                                         
092500    02 FILLER              PIC X     VALUE ".".                               
092600                                                                              
093600 01 WKS-TIT-I02-ARCH-PROB.                                                    
093700    02 FILLER              PIC X(25) VALUE                                    
093800                           "S500/FILE/S500/BITAPROBS/".                       
093900    02 WKS-TIT-I03-CSI     PIC 9(02).                                         
094000    02 FILLER              PIC X     VALUE "/".                               
094100    02 WKS-TIT-I03-FECH    PIC 9(06).                                         
094200    02 FILLER              PIC X     VALUE ".".                               
094300                                                                              
094400 01 WKS-TIT-I04-PROCMED.                                                      
094500    02 FILLER              PIC X(25) VALUE                                    
094600                           "S500/FILE/S500/PROCMED/".                         
094700    02 WKS-TIT-I04-CSI     PIC 9(02).                                         
094800    02 FILLER              PIC X     VALUE "/".                               
094900    02 WKS-TIT-I04-FECH    PIC 9(06).                                         
095000    02 FILLER              PIC X     VALUE ".".                               
095100                                                                              
095200                                                                              
100000*****     VARIABLES     .....                  ************                   
100100                                                                              
100200 01 WKS-FEC-LINEA                 PIC 9(08).                                  
100300 01 WKS-FEC-LINEA-R REDEFINES WKS-FEC-LINEA.                                  
100400    02 WKS-FEC-LINEA-AMD-AAAA     PIC 9(04).                                  
100500    02 WKS-FEC-LINEA-AMD-MM       PIC 99.                                     
100600    02 WKS-FEC-LINEA-AMD-DD       PIC 99.                                     
100700 01 WKS-FEC-LINEA-ANT             PIC 9(08).                                  
100800 01 WKS-FEC-LINEA-ANT-R REDEFINES WKS-FEC-LINEA-ANT.                          
100900    02 WKS-FEC-LIN-ANT-AMD-AAAA   PIC 9(04).                                  
101000    02 WKS-FEC-LIN-ANT-AMD-MM     PIC 9(02).                                  
101100    02 WKS-FEC-LIN-ANT-AMD-DD     PIC 9(02).                                  
101200 01 WKS-FEC-LINEA-ANT-RE REDEFINES WKS-FEC-LINEA-ANT.                         
101300    02 WKS-FEC-LIN-ANT-RE-FILLER  PIC 9(02).                                  
101400    02 WKS-FEC-LIN-ANT-AAMMDD     PIC 9(06).                                  
102500 01 WKS-FECHA-PROCESO-R.                                                      
102600    02 WKS-FEC-PROC-DD            PIC 99.                                     
102700    02 FILLER                     PIC X VALUE "/".                            
102800    02 WKS-FEC-PROC-MM            PIC XXX.                                    
102900    02 FILLER                     PIC X VALUE "/".                            
103000    02 WKS-FEC-PROC-AAAA          PIC 9(4).                                   
103002 01 WKS-FECHA-PROCESO REDEFINES WKS-FECHA-PROCESO-R PIC X(11).                
103100 01 WR-BOOLEANOS-MANEJO-PROCESO.                                              
103200    02 WKS-EOJ-VA                 PIC 9(11) BINARY VALUE 0.                   
103300       88 WKS-EOJ                 VALUE 1.                                    
103400    02 WKS-CVE-ERROR-VA           PIC 9(11) BINARY VALUE 0.                   
103500       88 WKS-CVE-SIN-ERROR       VALUE 0.                                    
103600       88 WKS-CVE-CON-ERROR       VALUE 1 THRU 999.                           
103620    02 WKS-CONT-L428-VA           PIC 9(02).                                  
103640       88 WKS-EXISTE-CONT-L428    VALUE 1.                                    
103660    02 WS-HOY-ES-DIAHABIL-VA      PIC 9(01).                                  
103665       88 WS-88-HOY-ES-DIAHABIL   VALUE 1.                                    
103666*P0120414 CHARITY Regulatory Requirement III* 3 LINEAS  PCB AG/19*            
103667    02 WS-HOY-ES-FIN-SEM          PIC 9(01).                                  
103668       88 WS-88-HOY-ES-DOMINGO    VALUE 0.                                    
103669       88 WS-88-HOY-ES-SABADO     VALUE 6.                                    
103670    02 WKS-PRUEBAS-VA             PIC 9(01) VALUE 0.                          
103680       88 WS-88-PRUEBAS           VALUE 1.                                    
103980 01 WS-VARIABLES-AWAKE.                                                       
104080    02 WS-AWAKE-COCIENTE          PIC 9(02).                                  
104180    02 WS-AWAKE-COCIENTE-ANT      PIC 9(02) VALUE 0.                          
104280    02 WS-AWAKE-RESIDUO           PIC 9(02).                                  
104380 01 WS-HORA-MAQ-HM-AWAKE          PIC 9(08).                                  
104480 01 WS-HORA-MAQ-HM-AWAKE-R REDEFINES WS-HORA-MAQ-HM-AWAKE.                    
104580    02 WS-HORA-HMS-AWAKE          PIC 9(06).                                  
104680    02 WS-HORA-HMS-AWAKE-R REDEFINES WS-HORA-HMS-AWAKE.                       
104780       03 WS-HORA-HM-AWAKE        PIC 9(04).                                  
104880       03 WS-HORA-HM-AWAKE-R REDEFINES WS-HORA-HM-AWAKE.                      
104980          04 WS-HORA-HH-AWAKE     PIC 99.                                     
105080          04 WS-HORA-MM-AWAKE     PIC 99.                                     
105180       03 WS-HORA-SS-AWAKE        PIC 99.                                     
105280    02 FILLER                     PIC 99.                                     
105380                                                                              
106000                                                                              
106100 01 WKS-VARS-AVISOS.                                                          
106200    02 WKS-PROCESAR-REG-DE-AVISO-VA       PIC 9(01).                          
106300       88 WKS-88-PROCESAR-REGISTRO        VALUE 0.                            
106400       88 WKS-88-NO-PROCESAR-REGISTRO     VALUE 1.                            
106500    02 WKS-MIX                            PIC 9(06).                          
106600    02 WKS-FEC-GENMDA                     PIC 9(08).                          
106700    02 WKS-FEC-GENMDA-R REDEFINES WKS-FEC-GENMDA.                             
106800       04 WKS-FECGENMDA-AAAA              PIC 9(04).                          
106900       04 WKS-FECGENMDA-MM                PIC 9(02).                          
107000       04 WKS-FECGENMDA-DD                PIC 9(02).                          
107100    02 WKS-FEC-GENMDA-RE REDEFINES WKS-FEC-GENMDA.                            
107200       04 WKS-FECGENMDA-RE-FILLER         PIC 9(02).                          
107300       04 WKS-FECGENMDA-AAMMDD            PIC 9(06).                          
107400    02 WKS-PROCMED-NUM-LINEAS             PIC 9(08).                          
107450    02 WKS-PROCMED-CONT-PAGE              PIC 9(08).                          
107500    02 WKS-ARCH-EN-PROC-EOF-VA            PIC 9(01).                          
107600       88 WKS-ARCH-EN-PROC-EOF            VALUE 1.                            
107700    02 WKS-PROCMED-REGISTROS              PIC 9(08).                          
107800    02 WKS-PROCMED-NOEXISTE               PIC 9(08).                          
107900    02 WKS-PROCMED-ACEPTADOS              PIC 9(08).                          
108000    02 WKS-PROCMED-RECHAZADOS             PIC 9(08).                          
108050    02 WKS-PROCMED-NOENVIADOS             PIC 9(08).                          
108100    02 WS-INDRES-S016                     PIC 9(02).                          
108200    02 WS-RESULT-S016                     PIC 9(08).                          
108600    02 WKS-IMPR-ARCH-PROCMED-VA           PIC 9(01).                          
108700       88 WKS-88-IMPR-ARCH-PROCMED        VALUE 1.                            
109000    02 WKS-88-S016L428-EN-CONT-VA         PIC 9(01).                          
109100       88 WKS-88-S016L428-NO-EN-CONT      VALUE 0.                            
109200       88 WKS-88-S016L428-SI-EN-CONT      VALUE 1.                            
109300                                                                              
110000***********************************************************                   
110100*   VARIABLES PARA MANEJO DE COMS                         *                   
110200***********************************************************                   
110300 77 WS-MENSAJE                        PIC X(10).                              
110400 77 WS-APLINCLUDE-RESULT              PIC S9(11) BINARY.                      
110500 77 WS-ESPERACOMS-TIEMPO              PIC S9(11) BINARY VALUE 60.             
110600 77 WS-ESPERACOMS-TIPO-EVENTO         PIC S9(11) BINARY.                      
110700 77 WS-OUTPUT-DESIGNATOR              REAL.                                   
110800 77 WS-OUTPUT-NOMBRE                  PIC X(30)                               
110900                                      VALUE "OUPUT OF LINEA.".                
111000 77 WS-COMS-RESULT                    PIC S9(11) BINARY.                      
111100 77 WS-COMS-RESULT-DISP               PIC 9(10).                              
111200 77 WS-NO-APL                         PIC X(30).                              
111300 77 WS-NO-APL-DESG                    REAL.                                   
111400 77 WS-MI-PROGRAMA                    PIC X(30).                              
111500 77 WS-MI-PROGRAMA-DESG               REAL.                                   
111600 77 WS-AG-SALIDA                      PIC X(30).                              
111700 77 WS-AG-SALIDA-DESG                 REAL.                                   
111800 77 WS-COMS-DEF-STA-NAME              PIC X(14).                              
111900 77 WS-DEFAULTSTATION-DESG            REAL.                                   
112000 77 WS-COMS-IN-STATUS-KEY-I           PIC 9(20).                              
112100 77 WS-COMS-IN-FUNCTION-STATUS-I      PIC 9(20).                              
112200 77 WS-COMS-IN-TEXT-LENGTH-I          PIC 9(20).                              
112300 77 WS-COMS-OUT-STATUS-KEY-I          PIC 9(20).                              
112400                                                                              
112500 01 WS-COMS-DESIGNATOR-ARRAY            REAL.                                 
112600    02 WS-COMS-DESG                     REAL OCCURS 10 TIMES.                 
112700 01 WS-COMS-INTEGER-ARRAY               USAGE BINARY.                         
112800    02 WS-COMS-INT                     PIC S9(11) OCCURS 20 TIMES.            
112900 01 WS-COMS-REAL-ARRAY                  REAL.                                 
113000    02 WS-COMS-REAL                     REAL OCCURS 30 TIMES.                 
113100                                                                              
113200 01 WS-SOPCOM-COMANDO                   PIC X(30).                            
113300 01 WS-SOPCOM-TRABAJO                   PIC X(132).                           
113400                                                                              
113500 01 WS-APLINCLUDE-ID.                                                         
113600    02 WS-APLINCLUDE-SISTEMA            PIC X(04).                            
113700    02 WS-APLINCLUDE-PASO               PIC X(14).                            
113800 01 WS-APLINCLUDE-PARAMETRO.                                                  
113900    02 WS-APLINCLUDE-PAR-1              PIC X(15).                            
114000    02 WS-APLINCLUDE-PAR-2              PIC X(15).                            
114100 01 WS-APLINCLUDE-SCRATCH               COMP.                                 
114200    02 WS-APLINCLUDE-SCR                PIC S9(11).                           
114300                                                                              
115200 01 WKS-CSI-LOCAL                 PIC 9(002).                                 
115300                                                                              
115400 01 WKS-ESPERACOMS-TIPO-EVENTO     PIC 9(5).                                  
115500 01 WKS-COMS-IN-STATUS-KEY         PIC 9(5).                                  
116200                                                                              
120000***********************************************************                   
120100*   VARIABLES PARA MANEJO DE VERSIONES DEL P014 EN CTLVER *                   
120200***********************************************************                   
120300 01 VERSIONES-PROG.                                                           
120400    02 WKS-ID-P050                PIC X(08) VALUE "S500P050".                 
120500                                                                              
120600    02 WKS-TITULO-PROG            PIC X(72).                                  
120700    02 WKS-TITULO-PROG-R REDEFINES WKS-TITULO-PROG.                           
120800       03 FILLER                  PIC X.                                      
120900       03 WKS-TP-SISTEMA          PIC X(04).                                  
121000       03 FILLER                  PIC X.                                      
121100       03 WKS-TP-SUBDIR           PIC X(12).                                  
121200       03 WKS-TP-PASO             PIC X(04).                                  
121300       03 FILLER                  PIC X.                                      
121400       03 WKS-TP-VERSION          PIC X(08).                                  
121500       03 WKS-TP-VERSION-R REDEFINES WKS-TP-VERSION.                          
121600          04 WKS-TP-RELEASE       PIC X(02).                                  
121700          04 FILLER               PIC X(03).                                  
121800          04 WKS-TP-MTP           PIC X(03).                                  
121900       03 FILLER                  PIC X(04).                                  
122000       03 WKS-TP-PACK             PIC X(12).                                  
122100       03 FILLER                  PIC X(25).                                  
122200                                                                              
122300    02 WKS-VERIFICA-VERSIONES     PIC S9  VALUE 0.                            
122400       88 WKS-88-VERS-SIN-ERROR           VALUE 0.                            
122500       88 WKS-88-VERS-ERR-SI-CONTINUO     VALUE 1 THRU 3.                     
122600       88 WKS-88-VERS-ERR-NO-CONTINUO     VALUE -1 THRU -3.                   
122700                                                                              
122900    02 WKS-ID-L02N.                                                           
123000       03 FILLER                  PIC X(07) VALUE "S500L02".                  
123100       03 WKS-ID-L02N-COPIA       PIC 9(01).                                  
123200       03 FILLER                  PIC X(04) VALUE "SDOS".                     
123300                                                                              
130000***********************************************************                   
130100*   VARIABLES PARA LOS HI'S                               *                   
130200***********************************************************                   
130300 01 WKS-VARIABLES-HIS.                                                        
130600    02 WKS-NUMSEC-MONITOR         PIC 9(02) COMP VALUE 0.                     
130700    02 WKS-NUMSEC-PROBLEMAS       PIC 9(02) COMP VALUE 0.                     
131502                                                                              
150000***********************************************************                   
150050*   TABLA CON LA DESCRIPCION DE ERRORES                   *                   
150100***********************************************************                   
150150 01 ERRORES.                                                                  
150200     02 ERROR-0001        PIC X(58) VALUE                                     
150250     "MASCARA NO PERMITIDA PARA EL CONSULTOR DEL S500       0001".            
150300     02 ERROR-0002        PIC X(58) VALUE                                     
150350     "SE DETECTO NO. DE ERROR MENOR A CERO O MAYOR AL LIMITE0002".            
150400     02 ERROR-0003        PIC X(58) VALUE                                     
150450     "FALTA MEDIO DE ACCESO                                 0003".            
150500     02 ERROR-0004        PIC X(58) VALUE                                     
150550     "MEDIO DE ACCESO INCORRECTO                            0004".            
159890     02 ERROR-NNNN        PIC X(58) VALUE                                     
159895     "                                                      NNNN".            
159900 01  TABLA-ERRORES REDEFINES ERRORES.                                         
159910     02 TBL-ERRORES OCCURS 005.                                               
159920         03  TBL-ERROR-ALFA      PIC X(54).                                   
159930         03  TBL-ERROR-NUME      PIC 9(04).                                   
170000***********************************************************                   
170100* VARIABLES DE USO GENERAL                                *                   
170200***********************************************************                   
194100 01 WKS-CONTADORES.                                                           
194200    02 WKS-CONTADOR-NTRAN         PIC 9(08) COMP VALUE 0.                     
194800    02 WKS-NUM-DE-HI              PIC Z9.                                     
194900    02 WKS-CTR-CVEERROR-FMT       PIC ZZZZZZZZZZ9.                            
195000    02 WS-COMS-RESULT-FMT         PIC ZZZZZZZZZZ9.                            
200000***********************************************************                   
200100* MENSAJES A CONSOLA MEDIANTE LA LIBRERIA DE DISPLAYS     *                   
200200***********************************************************                   
200300 01 WKS-DISPLAYS.                                                             
200400    02 FILLER-01                          PIC X(51) VALUE                     
200500       "INICIO DE PROCESO                           E020101".                 
200600    02 FILLER-02                          PIC X(51) VALUE                     
200700       "FIN DE PROCESO                              E020201".                 
200800    02 FILLER-03                          PIC X(51) VALUE                     
200900       "FIN NORMAL POR OPERADOR                     E020101".                 
201000    02 FILLER-04                          PIC X(51) VALUE                     
201100       "NO ACEPTO DISABLE                           I050110".                 
201200    02 FILLER-05                          PIC X(51) VALUE                     
201300       "                                            E050103".                 
201400    02 FILLER-06                          PIC X(51) VALUE                     
201500       "NO TIENE MONITOR PORQUE NO RECIBE MENSAJES  E050102".                 
201600    02 FILLER-07                          PIC X(51) VALUE                     
201700       "CIERRO Y ABRO ARCHIVO BITAPROBS             E050110".                 
201800    02 FILLER-08                          PIC X(51) VALUE                     
201900       "                                            E050110".                 
202000    02 FILLER-09                          PIC X(51) VALUE                     
202100       "CIERRO Y ABRO ARCHIVO PROCMED UNO           E050110".                 
202200    02 FILLER-10                          PIC X(51) VALUE                     
202300       "                                            E050110".                 
202400    02 FILLER-11                          PIC X(51) VALUE                     
202500       "HI NO IMPLEMENTADO                          O050101".                 
202600    02 FILLER-12                          PIC X(51) VALUE                     
202700       "PROBLEMAS AL DAR DE ALTA EL PROGRAMA EN COMSE050103".                 
202800    02 FILLER-13                          PIC X(51) VALUE                     
202900       "ERROR AL OBTENER FECHAS DE LIBRRIA S500L010 E050102".                 
203000    02 FILLER-14                          PIC X(51) VALUE                     
203100       "PROBLEMAS CON LIBRERIA THECALENDAR          E050012".                 
203200    02 FILLER-15                          PIC X(51) VALUE                     
203300       "RESULT INCORRECTO EN LLAMADO A LA S500L010  E050103".                 
203400    02 FILLER-16                          PIC X(51) VALUE                     
203500       "                                            A999999".                 
203600    02 FILLER-17                          PIC X(51) VALUE                     
203700       "                                            A999999".                 
207200    02 FILLER-NN                          PIC X(51) VALUE                     
207300       "                                            0000000".                 
207400 01 WKS-DISPLAYS-R REDEFINES WKS-DISPLAYS.                                    
207500    02 WKS-TBL-DISPLAYS OCCURS 18 TIMES.                                      
207600       03 WKS-DPLAY-TEXTO                 PIC X(44).                          
207700       03 WKS-DPLAY-TIPO                  PIC X(01).                          
207800       03 WKS-DPLAY-CODIGO                PIC 9(06).                          
207900                                                                              
208000 01 WKS-DISPLAY-NO                        PIC 9(02).                          
208100 01 WKS-DPLAY-TXT-ADICIONAL               PIC X(25).                          
208200 01 WKS-DPLAY-TXT-ERROR                   PIC X(100).                         
208300                                                                              
221600***************************************************************               
221700*   ETIQUETA DEL ARCHIVO DE TASKFILE                          *               
221800***************************************************************               
221900 01 WKS-TASKFILE-NOMBRE.                                                      
222000    02 FILLER             PIC X(60) VALUE "FILE TASKFILE (USERBACK            
222100-                         "UPNAME=TRUE,TITLE=S500/TASKFILE/P050/".            
222200    02 WKS-TASKFILE-FEC   PIC 9(06).                                          
222300    02 FILLER             PIC X(01) VALUE "/".                                
222400    02 WKS-TASKFILE-MIX   PIC 9(07).                                          
222500    02 FILLER             PIC X(02) VALUE ");".                               
222600                                                                              
300000***********************************************************                   
300100*                                                         *                   
300200*         DECLARACION DE FORMATOS PARA   L I S T A D O S  *                   
300300*                                                         *                   
300400***********************************************************                   
300500 01 WKS-BACKUPS.                                                              
304400    02 WKS-BKUP-PROBLEMS.                                                     
304500       03 WKS-PROB-RENGLON1.                                                  
304600          04 WKS-PROB-R1-MIX              PIC BZZZ9B(02).                     
304700          04 WKS-PROB-R1-TIME-HH          PIC Z9.                             
304800          04 FILLER                       PIC X VALUE ":".                    
304900          04 WKS-PROB-R1-TIME-MM          PIC 99.                             
305000          04 FILLER                       PIC X VALUE ":".                    
305100          04 WKS-PROB-R1-TIME-SS          PIC 99B(04).                        
305200          04 FILLER                       PIC X(02) VALUE "# ".               
305300          04 WKS-PROB-R1-NTRAN            PIC ZZZZ,ZZ9B(03).                  
305400          04 WKS-PROB-R1-TEXTO            PIC X(100) VALUE SPACES.            
305500                                                                              
310000 01 WKS-TABLA-RES-S016.                                                       
310010*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
310100    02 WKS-TR-S016-01  PIC X(16) VALUE "SIST/PASO INV000".                    
310200    02 WKS-TR-S016-02  PIC X(16) VALUE "OPCION INVAL 000".                    
310300    02 WKS-TR-S016-03  PIC X(16) VALUE "SALIDA INSUF 000".                    
310400    02 WKS-TR-S016-04  PIC X(16) VALUE "PARAM/INVAL  000".                    
310500    02 WKS-TR-S016-05  PIC X(16) VALUE "RESULT S016  000".                    
310600    02 WKS-TR-S016-06  PIC X(16) VALUE "RESULT S016  000".                    
310700    02 WKS-TR-S016-07  PIC X(16) VALUE "RESULT S016  000".                    
310800    02 WKS-TR-S016-08  PIC X(16) VALUE "RESULT S016  000".                    
310900    02 WKS-TR-S016-09  PIC X(16) VALUE "RESULT S016  000".                    
311000    02 WKS-TR-S016-10  PIC X(16) VALUE "NO EXISTE REG000".                    
311100    02 WKS-TR-S016-11  PIC X(16) VALUE "OPCION INVAL 000".                    
311200    02 WKS-TR-S016-12  PIC X(16) VALUE "RESULT S016  000".                    
311300    02 WKS-TR-S016-13  PIC X(16) VALUE "RESULT S016  000".                    
311400    02 WKS-TR-S016-14  PIC X(16) VALUE "RESULT S016  000".                    
311500    02 WKS-TR-S016-15  PIC X(16) VALUE "CTO SIN/MDA  000".                    
311600    02 WKS-TR-S016-16  PIC X(16) VALUE "SIN CAMB/CTO 000".                    
311700    02 WKS-TR-S016-17  PIC X(16) VALUE "SIN CAMB/MDA 000".                    
311800    02 WKS-TR-S016-18  PIC X(16) VALUE "ERR STAT CTO 000".                    
311900    02 WKS-TR-S016-19  PIC X(16) VALUE "ERR STAT MDA 000".                    
312000    02 WKS-TR-S016-20  PIC X(16) VALUE "ACEPTADO S016000".                    
312100    02 WKS-TR-S016-21  PIC X(16) VALUE "ERR BASE/S016000".                    
312200    02 WKS-TR-S016-22  PIC X(16) VALUE "ERROR S127   000".                    
312300    02 WKS-TR-S016-23  PIC X(16) VALUE "*NO CALIF    000".                    
312350    02 WKS-TR-S016-24  PIC X(16) VALUE "NO ESTA S500 000".                    
312370    02 WKS-TR-S016-25  PIC X(16) VALUE "  NO ENVIADO 000".                    
312380*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
312400                                                                              
312500 01 WKS-TABLA-RES-S016-R REDEFINES WKS-TABLA-RES-S016.                        
312600    02 WKS-TB-RES-S016    OCCURS 25 TIMES.                                    
312700       04 WKS-NOM-RES-S016        PIC X(13).                                  
312800       04 WKS-NUM-RES-S016        PIC Z(03).                                  
312802*P0120414 CHARITY Regulatory Requirement III*           PCB AG/19*            
312803*** LINEA 312804 HASTA 313065 MENSAJES DE EP BENEFICENCIA2 *******            
312804 01 WKS-TABLA-RES2-S016.                                                      
312805**** NUEVOS MENSAJES DEL 11 AL 18 ********************************            
312806*11 SOLO SE PERMITE CAMBIO A ESTATUS 11 POR S500 O S016                       
312808*12 OPCIÓN INVÁLIDA. SOLO SE PERMITEN LO VALORES 1 O 2.                       
312810*13 EL ESTATUS DE LA CUENTA EN LA BASE ES 14,CAMBIO NO PERMITIDO.             
312812*14 EL REGISTRO B04 QUE SE QUIERE MODIFICAR NO EXISTE.                        
312814*15 EL REGISTRO DE LA B04, CTA. INVERSIONES O CTA. EJE NO EXISTE.             
312816*16 NO EXISTE LA CHEQUERA ASOCIADA A LA CUENTA.                               
312818*17 EL CAMPO DE PASO Y CAJA NO VIENE INFORMADO.                               
312820*18 EXISTE UN DMERROR AL MOMENTO DE DAR UN STORE.                             
312822    02 WKS-TR2-S016-01 PIC X(16) VALUE "RESULT S016  000".                    
312823    02 WKS-TR2-S016-02 PIC X(16) VALUE "RESULT S016  000".                    
312825    02 WKS-TR2-S016-03 PIC X(16) VALUE "RESULT S016  000".                    
312830    02 WKS-TR2-S016-04 PIC X(16) VALUE "RESULT S016  000".                    
312835    02 WKS-TR2-S016-05 PIC X(16) VALUE "RESULT S016  000".                    
312840    02 WKS-TR2-S016-06 PIC X(16) VALUE "RESULT S016  000".                    
312845    02 WKS-TR2-S016-07 PIC X(16) VALUE "RESULT S016  000".                    
312850    02 WKS-TR2-S016-08 PIC X(16) VALUE "RESULT S016  000".                    
312855    02 WKS-TR2-S016-09 PIC X(16) VALUE "RESULT S016  000".                    
312860    02 WKS-TR2-S016-10 PIC X(16) VALUE "RESULT S016  000".                    
312865    02 WKS-TR2-S016-11 PIC X(16) VALUE "USER INV.REAC000".                    
312870    02 WKS-TR2-S016-12 PIC X(16) VALUE "OPC INV.REAC 000".                    
312875    02 WKS-TR2-S016-13 PIC X(16) VALUE "STA CTA14.REA000".                    
312880    02 WKS-TR2-S016-14 PIC X(16) VALUE "NO EXISTE.REA000".                    
312885    02 WKS-TR2-S016-15 PIC X(16) VALUE "CTOSIN EJIN.R000".                    
312890    02 WKS-TR2-S016-16 PIC X(16) VALUE "CTOSIN CHQ.RE000".                    
312895    02 WKS-TR2-S016-17 PIC X(16) VALUE "SINPAS CAJ.RE000".                    
312900    02 WKS-TR2-S016-18 PIC X(16) VALUE "DMSII ERR.REA000".                    
312905    02 WKS-TR2-S016-19 PIC X(16) VALUE "RESULT S016  000".                    
312910    02 WKS-TR2-S016-20 PIC X(16) VALUE "RESULT S016  000".                    
312915    02 WKS-TR2-S016-21 PIC X(16) VALUE "RESULT S016  000".                    
312920    02 WKS-TR2-S016-22 PIC X(16) VALUE "RESULT S016  000".                    
312925    02 WKS-TR2-S016-23 PIC X(16) VALUE "RESULT S016  000".                    
312930    02 WKS-TR2-S016-24 PIC X(16) VALUE "RESULT S016  000".                    
312935    02 WKS-TR2-S016-25 PIC X(16) VALUE "RESULT S016  000".                    
312945                                                                              
312950 01 WKS-TABLA-RES2-S016-R REDEFINES WKS-TABLA-RES2-S016.                      
312955    02 WKS-TB2-RES-S016    OCCURS 25 TIMES.                                   
312960       04 WKS-NOM2-RES-S016        PIC X(13).                                 
312965       04 WKS-NUM2-RES-S016        PIC Z(03).                                 
313065*                                                                             
313100 01 WKS-FEC-EDIT-DDMMAAAA.                                                    
313200    02 WKS-FECEDIT-DD             PIC 99/.                                    
313300    02 WKS-FECEDIT-MM             PIC XXX/.                                   
313400    02 WKS-FECEDIT-AAAA           PIC 9999.                                   
313500 01 WKS-FECMAQ-EDIT-DDMMAAAA.                                                 
313600    02 WKS-FECMAQEDIT-DD          PIC 99/.                                    
313700    02 WKS-FECMAQEDIT-MM          PIC XXX/.                                   
313800    02 WKS-FECMAQEDIT-AAAA        PIC 9999.                                   
313900                                                                              
314000 01  WLI-R01-L01-ENCA.                                                        
314100     02 FILLER                   PIC X(19) VALUE                              
314200                                "S500/P050/25MTP002/".                        
314300     02 WLI-R01-L01-QREP         PIC X(35) VALUE                              
314400                                "001DETACTIVAMED".                            
314500     02 FILLER                   PIC X(51) VALUE                              
314600                                "DEPOSITOS A LA VISTA".                       
314700     02 FILLER                   PIC X(14) VALUE                              
314800                                "FECHA MOVTOS: ".                             
314900     02 WLI-R01-L01-FEC-PROC     PIC X(13).                                   
315000                                                                              
315100 01  WLI-R01-L02-ENCA.                                                        
315200     02 FILLER                   PIC X(15) VALUE                              
315300       "FECHA PROCESO: ".                                                     
315400     02 WLI-R01-L02-FEC-MAQ      PIC X(11).                                   
315500     02 FILLER                   PIC X(22) VALUE " ".                         
315600     02 WLI-R01-L02-TITULO       PIC X(57) VALUE                              
315700        "DETALLE DE ACTIVACION DE MEDIOS".                                    
315800     02 FILLER                   PIC X(14) VALUE                              
315900                                "TIPO PROCESO: ".                             
316000     02 WLI-R01-L02-TPO-PORC     PIC X(13) VALUE "DIARIO".                    
316100                                                                              
316200 01  WLI-R01-L03-ENCA.                                                        
316300     02 FILLER                   PIC X(15) VALUE                              
316400                                "HORA  PROCESO: ".                            
316500     02 WLI-R01-L03-HH           PIC 99.                                      
316600     02 FILLER                   PIC X(01) VALUE ":".                         
316700     02 WLI-R01-L03-MM           PIC 99.                                      
316800     02 FILLER                   PIC X(01) VALUE ":".                         
316900     02 WLI-R01-L03-SS           PIC 99.                                      
317000     02 FILLER                   PIC X(31) VALUE " ".                         
317100     02 FILLER                   PIC X(51) VALUE " ".                         
317200     02 FILLER                   PIC X(14) VALUE                              
317300                                "HOJA NUM.   : ".                             
317400     02 WLI-R01-L03-NUM-PAG      PIC ZZZZZ.                                   
317500     02 FILLER                   PIC X(08) VALUE " ".                         
317600                                                                              
317700 01  WLI-R01-L04-ENCA.                                                        
317800     02 WLI-R01-L04-SUC          PIC 9999.                                    
317900     02 FILLER                   PIC X(128) VALUE " ".                        
318000                                                                              
318050 01  WLI-R01-L05-ENCA.                                                        
318100     02 WLI-R01-L05-NOMBSUC      PIC X(54) VALUE " ".                         
318150     02 WLI-R01-L05-NCSI         PIC X(78) VALUE " ".                         
318200                                                                              
318210*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
318250 01 WLI-R01-L06-ENCA.                                                         
318270    02 FILLER PIC X(33) VALUE " SUC      NUMERO   NUM  NUM  NUM ".            
318290    02 FILLER PIC X(33) VALUE "   NUMERO     NOMBRE             ".            
318300    02 FILLER PIC X(33) VALUE "            CAMBIO    ESTATUS    ".            
318320    02 FILLER PIC X(33) VALUE "  APET/ELIM/CAMB  ENVIO AL S016  ".            
318450                                                                              
318500 01 WLI-R01-L07-ENCA.                                                         
318550    02 FILLER PIC X(33) VALUE " PROM     CLIENTE  PROD INST MON ".            
318600    02 FILLER PIC X(33) VALUE "   CONTRATO                      ".            
318650    02 FILLER PIC X(33) VALUE "                                 ".            
318700    02 FILLER PIC X(33) VALUE "  FECHA    HORA   FECHA    HORA  ".            
318710*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
319050                                                                              
319051*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
319150 01  WLI-R01-L08-DETALLE.                                                     
319350     02 WLI-R01-L08-SUCPROM       PIC 9999.                                   
319450     02 FILLER                    PIC X.                                      
319550     02 WLI-R01-L08-NUMCTE        PIC Z(12).                                  
319560     02 WLI-R01-L08-OPCRGO REDEFINES WLI-R01-L08-NUMCTE PIC X(12).            
319650     02 FILLER                    PIC X.                                      
319750     02 WLI-R01-L08-PROD          PIC 9(04).                                  
319760     02 FILLER                    PIC X.                                      
319770     02 WLI-R01-L08-INST          PIC 9(04).                                  
319780     02 FILLER                    PIC X.                                      
319790     02 WLI-R01-L08-MON           PIC Z9.                                     
319810     02 WLI-R01-L08-NUMCTO        PIC Z(15)9.                                 
319811*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
319820     02 FILLER                    PIC X.                                      
319830     02 WLI-R01-L08-NOMBRE        PIC X(30).                                  
319840     02 FILLER                    PIC X.                                      
319841*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
319842     02 WLI-R01-L08-CAMB01        PIC 9(02).                                  
319844     02 WLI-R01-FILL-SEP01        PIC X(01).                                  
319845     02 WLI-R01-L08-CAMB02        PIC 9(02).                                  
319846     02 FILLER                    PIC X.                                      
319850     02 WLI-R01-L08-ESTATUS       PIC X(16).                                  
319860     02 FILLER                    PIC X.                                      
319870     02 WLI-R01-L08-FEC-RCV       PIC 9(08).                                  
319880     02 FILLER                    PIC X.                                      
319890     02 WLI-R01-L08-HRA-RCV       PIC 9(06).                                  
319900     02 FILLER                    PIC X.                                      
319942     02 WLI-R01-L08-FEC-S016      PIC 9(08).                                  
319944     02 FILLER                    PIC X.                                      
319946     02 WLI-R01-L08-HRA-S016      PIC 9(06).                                  
319947*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
319950                                                                              
319960 01  WLI-R02-L06-DETALLE.                                                     
319970     02 FILLER                    PIC X(132).                                 
319980                                                                              
320000***********************************************************                   
320010  01 WKS-FORZALIST.                                                           
320020     03 FILLER  PIC X(32) VALUE                                               
320030               "BEGIN JOB  S500/SYSTEMFORZA; ".                               
320040     03 FILLER  PIC X(40) VALUE                                               
320050               "RUN *SYSTEM/FORZA(""S500/LIST/P050"");".                      
320060     03 FILLER  PIC X(08) VALUE                                               
320070               " END JOB".                                                    
320080                                                                              
320090************************************************************                  
320100*   AREA PARA HEADERS DE COMS                             *                   
320200***********************************************************                   
320300 COMMUNICATION SECTION.                                                       
320400**                                                                            
320500   INPUT HEADER COMS-IN;                                                      
320600     PROGRAMDESG        IS COMS-IN-PROGRAM;                                   
320700     FUNCTIONSTATUS     IS COMS-IN-FUNCTION-STATUS;                           
320800     FUNCTIONINDEX      IS COMS-IN-FUNCTION-INDEX;                            
320900     USERCODE           IS COMS-IN-USERCODE;                                  
321000     SECURITYDESG       IS COMS-IN-SECURITY-DESG;                             
321100     TRANSPARENT        IS COMS-IN-TRANSPARENT;                               
321200     VTFLAG             IS COMS-IN-VT-FLAG;                                   
321300     TIMESTAMP          IS COMS-IN-TIMESTAMP;                                 
321400     STATION            IS COMS-IN-STATION;                                   
321500     TEXTLENGTH         IS COMS-IN-TEXT-LENGTH;                               
321600     STATUSVALUE        IS COMS-IN-STATUS-KEY;                                
321700     MESSAGECOUNT       IS COMS-IN-MSG-COUNT;                                 
321800     RESTART            IS COMS-IN-RST-LOC;                                   
321900     AGENDA             IS COMS-IN-AGENDA.                                    
322000                                                                              
322100   OUTPUT HEADER COMS-OUT;                                                    
322200     DESTCOUNT              IS COMS-OUT-COUNT;                                
322300     TEXTLENGTH             IS COMS-OUT-TEXT-LENGTH;                          
322400     STATUSVALUE            IS COMS-OUT-STATUS-KEY;                           
322500     TRANSPARENT            IS COMS-OUT-TRANSPARENT;                          
322600     VTFLAG                 IS COMS-OUT-VT-FLAG;                              
322700     CONFIRMFLAG            IS COMS-OUT-CONFIRM-FALG;                         
322800     CONFIRMKEY             IS COMS-OUT-CONFIRM-KEY;                          
322900     DESTINATIONDESG        IS COMS-OUT-DESTINATION;                          
323000     NEXTINPUTAGENDA        IS COMS-OUT-NEXT-INPUT-AGENDA;                    
323100     SETNEXTINPUTAGENDA     IS COMS-OUT-SET-NEXT-INPUT-AGENDA;                
323200     RETAINTRANSACTIONMODE  IS COMS-OUT-SAVE-TRANS-MODE;                      
323300     AGENDA                 IS COMS-OUT-AGENDA.                               
323400                                                                              
340000/***************************************************************              
340100*                                                              *              
340200*          P R O C E D U R E     D I V I S I O N               *              
340300*                                                              *              
340400****************************************************************              
340500 PROCEDURE DIVISION.                                                          
340600 DECLARATIVES.                                                                
340700 PGM-INTERRUPT-BY-HI SECTION.                                                 
340800     USE AS INTERRUPT PROCEDURE.                                              
340900 INTERRUPT-BY-HI.                                                             
341000     DISALLOW INTERRUPT.                                                      
341100     IF ATTRIBUTE TASKVALUE OF MYSELF      =  1                               
342500        MOVE 006                  TO WKS-DISPLAY-NO                           
342600        PERFORM 60407200-LLAMA-DISPLAY-1                                      
342700     ELSE IF ATTRIBUTE TASKVALUE OF MYSELF =  4                               
344000        MOVE 003  TO WKS-DISPLAY-NO                                           
344100        PERFORM 60407200-LLAMA-DISPLAY-1                                      
344200        MOVE "DISABLE PROGRAM S500P050"  TO WS-SOPCOM-COMANDO                 
344300        CALL "SMCOMS OF SOPORTECOMS" USING  WS-SOPCOM-COMANDO                 
344400                                            WS-SOPCOM-TRABAJO                 
344500                                     GIVING WS-COMS-RESULT                    
344600        IF WS-COMS-RESULT = 1                                                 
344700           MOVE 004  TO WKS-DISPLAY-NO                                        
344800           STRING WS-SOPCOM-TRABAJO, " EN FORMA NORMAL"                       
344900                  DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ADICIONAL              
345000           PERFORM 60407300-LLAMA-DISPLAY-2                                   
345100        ELSE                                                                  
345200           NEXT SENTENCE                                                      
345300     ELSE IF ATTRIBUTE TASKVALUE OF MYSELF = 11                               
345400        MOVE  007                 TO WKS-DISPLAY-NO                           
345500        PERFORM 60407200-LLAMA-DISPLAY-1                                      
345600        CLOSE I03-ARCH-PROB       WITH SAVE                                   
345700        OPEN EXTEND I03-ARCH-PROB                                             
346300     ELSE IF ATTRIBUTE TASKVALUE OF MYSELF = 13                               
346400        IF WKS-88-IMPR-ARCH-PROCMED                                           
346500           NEXT SENTENCE                                                      
346600        ELSE                                                                  
346700           MOVE  009              TO WKS-DISPLAY-NO                           
346800           PERFORM 60407200-LLAMA-DISPLAY-1                                   
346900           CLOSE I04-PROCMED      WITH SAVE                                   
347000           OPEN EXTEND I04-PROCMED                                            
359100     ELSE IF ATTRIBUTE TASKVALUE OF MYSELF = 20                               
359102             IF WS-88-PRUEBAS                                                 
359103                DISPLAY "APAGO OPCION DE PRUEBAS"                             
359104                MOVE 0           TO WKS-PRUEBAS-VA                            
359106             ELSE                                                             
359107                DISPLAY "PRENDO OPCION DE PRUEBAS"                            
359108                MOVE 1           TO WKS-PRUEBAS-VA                            
359110     ELSE                                                                     
359120        MOVE 012            TO WKS-DISPLAY-NO                                 
359140        PERFORM 60407200-LLAMA-DISPLAY-1                                      
359200        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-NUM-DE-HI                   
359300        STRING "HI # " , WKS-NUM-DE-HI, " NO IMPLEMENTADO "                   
359400               DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                       
359500        PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                
359520                                                                              
359600     ALLOW INTERRUPT.                                                         
359700 END DECLARATIVES.                                                            
359800                                                                              
359900                                                                              
359910                                                                              
360000/***************************************************************              
360100*                                                              *              
360200*          MAIN-PGM    S E C T I O N                           *              
360300*                                                              *              
360400****************************************************************              
360500 MAIN-PGM  SECTION.                                                           
360600 00000000-MAIN-PARAGRAPH.                                                     
360700     PERFORM 10000000-VERIFICA-VERSIONES.                                     
360720                                                                              
360740     IF WKS-88-VERS-SIN-ERROR OR WKS-88-VERS-ERR-SI-CONTINUO                  
360760        PERFORM 20000000-CHANGE-LIBRERIAS                                     
360800        PERFORM 30000000-VALIDA-INICIO                                        
360900        PERFORM 40000000-PREINICIO-PGM.                                       
360950                                                                              
361000     PERFORM 50000000-PROCESO-PGM UNTIL WKS-EOJ.                              
361100     PERFORM 80000000-FIN-PGM.                                                
361200     STOP RUN.                                                                
361300                                                                              
361400**********************************************************                    
361500*         HI`S (PROCEDIMIENTOS)                          *                    
361600**********************************************************                    
361700                                                                              
361800*************************                                                     
361900 00005100-HIS-ENCENDIDOS.                                                     
362000*************************                                                     
380000/*********************************************************                    
380100*         10000000-VERIFICA-VERSIONES                    *                    
380200**********************************************************                    
380300 10000000-VERIFICA-VERSIONES.                                                 
380400*****     ASIGNA NOMBRE EXTERNO AL TASKFILE               *****               
380500     PERFORM 10100000-ASIGNA-TASKFILE.                                        
380600                                                                              
380700     CHANGE ATTRIBUTE TITLE OF "DISP" TO                                      
380800            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".                  
380900                                                                              
381000***** SE REQUIEREN DISPLAYS CON DEFAULT PARA ERRORES AL   *****               
381100***** INICIALIZAR COMS                                    *****               
381200     PERFORM 10700000-ASIGNA-VERSION-DEFLT.                                   
381300                                                                              
381400***** SE REQUIERE INICIALIZAR COMS PARA QUE SI EXISTE UN  *****               
381500***** ERROR EN VERSIONES AL DARLE AX NO, SE DE DISABLE AL *****               
381600***** PROGRAMA EN LUGAR DE TRONAR Y SE LEVANTE NUEVAMENTE *****               
381700     PERFORM 10200000-INICIALIZA-COMS.                                        
381800                                                                              
381900*****     SE ESTABLECE LIGA CON CTLVERS                   *****               
382000     PERFORM 10000100-VERSIONES.                                              
382100                                                                              
382200*****     SE VERIFICA Y ASIGNA VERSION DE P050 EN CTLVERS *****               
382300     IF NOT WS-DH-HOSTNAME-PBA                                                
382400        PERFORM 10300000-P050-EN-CTLVERS.                                     
382500                                                                              
382600***** SE REQUIERE DESLIGAR LA CTLVERS PORQUE EN EL CAMBIO *****               
382700***** DE DIA SE LIGAN Y DESLIGAN TODAS LAS LIBRERIAS      *****               
382800     CANCEL "CTLVERS".                                                        
382900                                                                              
383000**************************                                                    
383100 10100000-ASIGNA-TASKFILE.                                                    
383200**************************                                                    
383300*    CODIGO PARA ASIGNAR UN NOMBRE ESTANDAR AL TASKFILE EN CASO               
383400*    DE QUE TRUENE EL P050 POR CUALQUIER RAZON.                               
383500*    SE MODIFICA EL NOMBRE ESTANDAR DEL TASKFILE CON LA FECHA                 
383600*    EN FORMATO AMD. Y ES LO PRIMERO QUE SE LLAMA (25/MAY/1999)               
383700                                                                              
383800     ACCEPT  WKS-TASKFILE-FEC            FROM DATE.                           
383900     SET  MYSELF(OPTION)                 TO 1926.                             
384000     MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WKS-TASKFILE-MIX.                 
384100     SET  MYSELF(FILECARDS)              TO WKS-TASKFILE-NOMBRE.              
384200                                                                              
384300***************************                                                   
384400 10200000-INICIALIZA-COMS.                                                    
384500***************************                                                   
384600                                                                              
384700*****     SE ESTABLECE LIGA CON COMS                      *****               
384800     PERFORM 0000-CHANGE-SL-DCI-Y-SOPCOMS.                                    
384900                                                                              
385000*****     OBTIENE NOMBRE DEL PROGRAMA <S500P050>          *****               
385100     PERFORM 0000-CALL-COMS-PROGRAM.                                          
385200     IF WS-COMS-RESULT NOT = 0                                                
385300        MOVE WS-COMS-RESULT       TO WS-COMS-RESULT-FMT                       
385400        STRING "ERROR ",WS-COMS-RESULT-FMT," EN EL CALL A COMS ",             
385500               "AL OBTENER EL NOMBRE DE PROGRAMA"                             
385600               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ERROR                     
385700        MOVE 012            TO WKS-DISPLAY-NO                                 
385800        PERFORM 60407400-LLAMA-DISPLAY-3                                      
385900        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
386000                                                                              
386100*****     OBTIENE NOAPL                                   *****               
386200     PERFORM 0000-CALL-COMS-NOAPL.                                            
386300     IF WS-COMS-RESULT NOT = 0                                                
386400        MOVE WS-COMS-RESULT       TO WS-COMS-RESULT-FMT                       
386500        STRING "ERROR ",WS-COMS-RESULT-FMT," EN EL CALL A COMS ",             
386600               "AL OBTENER NOAPL"                                             
386700               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ERROR                     
386800        MOVE 012            TO WKS-DISPLAY-NO                                 
386900        PERFORM 60407400-LLAMA-DISPLAY-3                                      
387000        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
387100                                                                              
387200*****     OBTIENE DESIGNADOR DE AGENDA <OUTPUT OF LINEA>  *****               
387300     PERFORM 0000-CALL-COMS-OUTPUT.                                           
387400     IF WS-COMS-RESULT NOT = 0                                                
387500        MOVE WS-COMS-RESULT       TO WS-COMS-RESULT-FMT                       
387600        STRING "ERROR ",WS-COMS-RESULT-FMT," EN EL CALL A COMS ",             
387700               "AL OBTENER OUTPUT OF LINEA "                                  
387800               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ERROR                     
387900        MOVE 012            TO WKS-DISPLAY-NO                                 
388000        PERFORM 60407400-LLAMA-DISPLAY-3                                      
388100        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
388200                                                                              
388300*****     OBTIENE DESIGNADOR DE ESTACION <DEFAULTSTATION> *****               
388400     PERFORM 0000-CALL-COMS-STATION.                                          
388500     IF WS-COMS-RESULT NOT = 0                                                
388600        MOVE WS-COMS-RESULT       TO WS-COMS-RESULT-FMT                       
388700        STRING "ERROR ",WS-COMS-RESULT-FMT," EN EL CALL A COMS ",             
388800               "AL OBTENER EL DEFAULTSTATION"                                 
388900               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ERROR                     
389000        MOVE 012            TO WKS-DISPLAY-NO                                 
389100        PERFORM 60407400-LLAMA-DISPLAY-3                                      
389200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
389300                                                                              
389400*****     OBTIENE DATOS DEL HOST                          *****               
389500     PERFORM 0000-CALL-CSIID-HOST.                                            
389600                                                                              
389700*****     OBTIENE TP_IDENTIFY AT XATMI                    *****               
389800     PERFORM 0000-CHANGE-XATMI.                                               
389900     MOVE "S500P050"              TO WS-XATMI-PROG-NAME.                      
390000     PERFORM 0000-CALL-TRANSIT.                                               
390100     IF WS-XATMI-RSLT NOT = 0                                                 
390200        MOVE WS-XATMI-RSLT        TO WS-COMS-RESULT-FMT                       
390300        STRING "ERROR = ",WS-COMS-RESULT-FMT,                                 
390400               "AL OBTENER EL TP_IDENTIFY IN XATMI"                           
390500               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ERROR                     
390600        MOVE 012            TO WKS-DISPLAY-NO                                 
390700        PERFORM 60407400-LLAMA-DISPLAY-3                                      
390800        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
390900                                                                              
391000**************************                                                    
391100 10300000-P050-EN-CTLVERS.                                                    
391200**************************                                                    
391300     MOVE WKS-ID-P050             TO W77-S000-MY-ID.                          
391400                                                                              
391500     MOVE "25MTP002"              TO W77-S000-MY-VERSION.                     
391600                                                                              
391700     PERFORM 20000100-CHECAME-VERSION.                                        
391800     MOVE S000-CTR-CVEERROR       TO WKS-VERIFICA-VERSIONES.                  
391900                                                                              
392000     IF WKS-88-VERS-SIN-ERROR                                                 
392100        PERFORM 10500000-OBTIENE-TITPROG                                      
392200        PERFORM 10600000-ASIGNA-VERSION-TITULO                                
392300     ELSE IF WKS-88-VERS-ERR-SI-CONTINUO                                      
392400        IF S000-CTR-CVEERROR = 1                                              
392500           PERFORM 10700000-ASIGNA-VERSION-DEFLT                              
392600        ELSE                                                                  
392700           PERFORM 10500000-OBTIENE-TITPROG                                   
392800           PERFORM 10600000-ASIGNA-VERSION-TITULO                             
392900     ELSE                                                                     
393000        PERFORM 10400000-MANDA-DISABLE.                                       
393100                                                                              
393200************************                                                      
393300 10400000-MANDA-DISABLE.                                                      
393400************************                                                      
393500     MOVE "DISABLE PROGRAM S500P050"  TO WS-SOPCOM-COMANDO.                   
393600     CALL "SMCOMS OF SOPORTECOMS" USING  WS-SOPCOM-COMANDO                    
393700                                         WS-SOPCOM-TRABAJO                    
393800                                  GIVING WS-COMS-RESULT.                      
393900     IF WS-COMS-RESULT = 1                                                    
394000        MOVE 004  TO WKS-DISPLAY-NO                                           
394100        STRING WS-SOPCOM-TRABAJO, " POR ERROR EN CTLVERS "                    
394200               DELIMITED BY SIZE INTO WKS-DPLAY-TXT-ADICIONAL                 
394300        PERFORM 60407300-LLAMA-DISPLAY-2.                                     
394400                                                                              
394500**************************                                                    
394600 10500000-OBTIENE-TITPROG.                                                    
394700**************************                                                    
394800     MOVE WKS-ID-P050     TO S000-CTR-LIBID.                                  
394900     PERFORM 10000500-TITPROGCTLVERS.                                         
395000                                                                              
395100********************************                                              
395200 10600000-ASIGNA-VERSION-TITULO.                                              
395300********************************                                              
395400     MOVE S000-CTR-NOMLIB TO WKS-TITULO-PROG.                                 
395500     MOVE WKS-TP-SISTEMA  TO SISTEMA-LJ.                                      
395600     MOVE WKS-TP-PASO     TO PASO-LJ.                                         
395700     MOVE WKS-TP-MTP      TO MTP-LJ.                                          
395800                                                                              
395900*******************************                                               
396000 10700000-ASIGNA-VERSION-DEFLT.                                               
396100*******************************                                               
396200     MOVE "S500"          TO SISTEMA-LJ.                                      
396300     MOVE "P050"          TO PASO-LJ.                                         
396400      MOVE 002             TO MTP-LJ.                                         
396500                                                                              
400000/*********************************************************                    
400100*         20000000-CHANGE-LIBRERIAS                      *                    
400200**********************************************************                    
400300 20000000-CHANGE-LIBRERIAS.                                                   
400400*****     SE ESTABLECE LIGA CON CTLVERS                   *****               
400500     PERFORM 10000100-VERSIONES.                                              
400600                                                                              
400700*****     OBTIENE TITULO DE LIB S500L010CTRL              *****               
400800     PERFORM 10000500-L010.                                                   
400900                                                                              
401000*****     OBTIENE TITULO DE LIB S006LOCSUP                *****               
401100     PERFORM 10000006-LOCSUP.                                                 
401200                                                                              
401300*****     OBTIENE TITULO DE LIBRERIA GENERALSUPPORT       *****               
401400     PERFORM 10000000-GENERALSUPPORT.                                         
401420                                                                              
401440*****     OBTIENE TITULO DE LIB S016L428                  *****               
401460     PERFORM 10000016-L428.                                                   
401500                                                                              
401600     CANCEL "CTLVERS".                                                        
401700                                                                              
401800 10000500-L010.                                                               
401900     MOVE ZEROS              TO S000-CTR-CVEERROR.                            
402000     MOVE "S500L010CTRL"     TO S000-CTR-LIBID.                               
402100                                                                              
402200     PERFORM 20000100-DAME-TIT-VERS.                                          
402300                                                                              
402400     IF S000-CTR-CVEERROR = 0                                                 
402500          CHANGE ATTRIBUTE TITLE OF "S500L010CTRL"                            
402600                     TO S000-CTR-NOMLIB                                       
402700     ELSE                                                                     
402800        MOVE 020901            TO WS-0101-CODI-MSG                            
402900        MOVE 01                TO WS-0101-TIPO-MSG                            
403000        MOVE S000-CTR-CVEERROR TO WS-MSG-N-02                                 
403100        STRING  "ERROR EN CALL CTLVERS S500L010CTRL "                         
403200                " RESULT=", WS-MSG-N-02                                       
403300                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
403400        PERFORM 70000050-MENSAJE.                                             
403500                                                                              
410000/*********************************************************                    
410100*         30000000-VALIDA-INICIO                         *                    
410200**********************************************************                    
410300 30000000-VALIDA-INICIO.                                                      
410400     IF WS-DH-HOSTNAME-VDM                                                    
410500        MOVE 10            TO WKS-CSI-LOCAL                                   
410600     ELSE IF WS-DH-HOSTNAME-MTY                                               
410700        MOVE 04            TO WKS-CSI-LOCAL                                   
410800     ELSE                                                                     
410900        MOVE WS-DH-NUM-CSI TO WKS-CSI-LOCAL.                                  
411000                                                                              
411100     MOVE ATTRIBUTE STACKNO OF MYSELF     TO WKS-MIX.                         
411200                                                                              
411300*    OBTIENE FECHA Y HORA DE LA MAQUINA EN FORMATO AAMD                       
411400*    LA FECHA DE MAQUINA LA DEJA EN WKS-FEC-MAQ-AAMD                          
411500     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
411600*    MOVE WKS-FEC-MAQ-AAMD        TO                                          
411700*    MOVE WKS-HRA-MAQ-HMS         TO                                          
411800                                                                              
411900*    OBTIENE FECHAS DE LINEA  Y  DE  ARCH  GENMDA,  ASI  COMO  LA             
412000*    CONTINGENCIA CON LA S016L428 PARA LOS AVISOS DE APERTURAS.               
412100     PERFORM 30100000-OBTIENE-FECHAS.                                         
412150     MOVE WKS-FEC-LINEA           TO WKS-FEC-LINEA-ANT.                       
412200                                                                              
412300*    ABRE EL ARCHIVO PROBLEMAS PARA MENSAJES DURANTE LA CORRIDA               
412400     PERFORM 30200000-ABRE-ARCH-PROB.                                         
412500                                                                              
412800                                                                              
412820*    ABRE ARCHIVO PARA GUARDAR ARCHIVO PROCESADO DEL DIA GENMDA               
412840     PERFORM 30400000-ABRE-ARCH-I04-PROCMED.                                  
412860                                                                              
412900*************************                                                     
413000 30100000-OBTIENE-FECHAS.                                                     
413100*************************                                                     
413200     PERFORM 0000-CALL-S500L010FECGENMDA.                                     
413300     IF WS-L010-RESULT > 0                                                    
413400        MOVE WS-L010-RESULT       TO WKS-DPLAY-TXT-ADICIONAL                  
413500        MOVE 013                  TO WKS-DISPLAY-NO                           
413600        PERFORM 60407300-LLAMA-DISPLAY-2                                      
413700        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
413800     MOVE WS-O-FG-FEC-GENMDA      TO WKS-FEC-GENMDA.                          
413900     MOVE WS-O-FG-FEC-LINEA       TO WKS-FEC-LINEA.                           
414000     MOVE WS-O-FG-CONT-L428       TO WKS-CONT-L428-VA.                        
414100                                                                              
414200*************************                                                     
414300 30200000-ABRE-ARCH-PROB.                                                     
414400*************************                                                     
414500     SET  I03-ARCH-PROB(USERBACKUPNAME)   TO VALUE TRUE.                      
414600     MOVE WKS-CSI-LOCAL                   TO WKS-TIT-I03-CSI.                 
414700     MOVE WKS-FEC-LINEA                   TO WKS-TIT-I03-FECH.                
414720     CHANGE ATTRIBUTE TITLE OF I03-ARCH-PROB                                  
414740                            TO WKS-TIT-I02-ARCH-PROB.                         
414800     IF ATTRIBUTE RESIDENT OF I03-ARCH-PROB = VALUE TRUE                      
414900        OPEN EXTEND I03-ARCH-PROB                                             
415000     ELSE                                                                     
415100        OPEN OUTPUT I03-ARCH-PROB.                                            
415200     MOVE "DATOS DE INICIO DEL P050 "     TO WKS-PROB-R1-TEXTO.               
415300     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
415400     STRING " FECHA MAQUINA      : " WKS-FEC-MAQ-AAMD                         
415500            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO.                         
415600     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
415700     STRING " FECHA CONTABLE     : " WKS-FEC-LINEA                            
415800            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO.                         
415900     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
416000     STRING " FECHA ARCH GENMDA  : " WKS-FEC-GENMDA                           
416100            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO.                         
416200     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
416300     STRING " CONTINGENCIA L428  : " WKS-CONT-L428-VA                         
416400            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO.                         
416500     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
416600                                                                              
416700******************************                                                
416900******************************                                                
417700                                                                              
417800********************************                                              
417900 30400000-ABRE-ARCH-I04-PROCMED.                                              
418000********************************                                              
418100     SET  I04-PROCMED(USERBACKUPNAME)     TO VALUE TRUE.                      
418200     MOVE WKS-CSI-LOCAL                   TO WKS-TIT-I04-CSI.                 
418300     MOVE WKS-FEC-GENMDA                  TO WKS-TIT-I04-FECH.                
418400     CHANGE ATTRIBUTE TITLE OF I04-PROCMED                                    
418500                            TO WKS-TIT-I04-PROCMED.                           
418600     IF ATTRIBUTE RESIDENT OF I04-PROCMED = VALUE TRUE                        
418700        OPEN EXTEND I04-PROCMED                                               
418800     ELSE                                                                     
418900        OPEN OUTPUT I04-PROCMED.                                              
419000                                                                              
430000/*********************************************************                    
430100*         40000000-PREINICIO-PGM                         *                    
430200**********************************************************                    
430300 40000000-PREINICIO-PGM.                                                      
430400     MOVE WKS-FEC-LINEA-AMD-AAAA    TO WKS-FEC-PROC-AAAA.                     
430500     MOVE T-M(WKS-FEC-LINEA-AMD-MM) TO WKS-FEC-PROC-MM.                       
430600     MOVE WKS-FEC-LINEA-AMD-DD      TO WKS-FEC-PROC-DD.                       
430700     MOVE WKS-FECHA-PROCESO         TO WKS-DPLAY-TXT-ADICIONAL.               
430800     MOVE 001                       TO WKS-DISPLAY-NO.                        
430900     PERFORM 60407300-LLAMA-DISPLAY-2.                                        
431000                                                                              
431100     ATTACH PGM-INTERRUPT-BY-HI TO ATTRIBUTE EXCEPTIONEVENT                   
431200            OF MYSELF.                                                        
431300     ALLOW INTERRUPT.                                                         
431400                                                                              
450000/**********************************************************                   
450100*                                                         *                   
450200*                                                         *                   
450300*         50000000-PROCESO-PGM                            *                   
450400*                                                         *                   
450500*                                                         *                   
450600***********************************************************                   
450700 50000000-PROCESO-PGM.                                                        
450800     PERFORM 50100000-INICIALIZA-VARS.                                        
450900     PERFORM 50200000-OBTIENE-TRANSACCION.                                    
451400                                                                              
455000***********************************************************                   
455100*                             50100000-INICIALIZA-VARS    *                   
455200***********************************************************                   
455300 50100000-INICIALIZA-VARS.                                                    
455400     MOVE 0               TO WKS-CVE-ERROR-VA                                 
455500                             WS-ESPERACOMS-TIPO-EVENTO.                       
456300     MOVE LOW-VALUES      TO WS-MENSAJE-DIALOGO.                              
457100                                                                              
457200                                                                              
460000***********************************************************                   
460100*                         50200000-OBTIENE-TRANSACCION    *                   
460200***********************************************************                   
460300 50200000-OBTIENE-TRANSACCION.                                                
460400     PERFORM 50201000-OBTEN-MSG-DE-COMS UNTIL                                 
460500             WS-ESPERACOMS-TIPO-EVENTO NOT = 0 .                              
460600                                                                              
465200***********************************************************                   
465300* SIGNIFICADO DE LOS POSIBLES VALORES DE                  *                   
465400* WS-ESPERACOMS-TIPO-EVENTO :                             *                   
465500* 1   CASO EN QUE HAY UN MSG, LO LEEMOS Y ADELANTE        *                   
465600* 2   RECIBE EL ACCEPT Y VE A LECTURA DE NUEVO            *                   
465700* 3   HAY INTERRUPCION DE HI YA EJECUTADA, VE A LECTURA   *                   
465800* 4   EL TIEMPO ESPECIFICADO TRANSCURRIO, VE A LECTURA    *                   
465900* 5                                                       *                   
466000* 1 > X > 5 EVENTO NO CONOCIDO, DESPLIEGA Y VE A LECTURA  *                   
466100***********************************************************                   
466200 50201000-OBTEN-MSG-DE-COMS.                                                  
466300     CALL "ESPERACOMS OF SOPORTECOMS"                                         
466400           USING    WS-ESPERACOMS-TIEMPO                                      
466500           GIVING   WS-ESPERACOMS-TIPO-EVENTO.                                
466600                                                                              
466700     IF WS-ESPERACOMS-TIPO-EVENTO = 1 OR 5                                    
466800        PERFORM 50202000-RECEIVE-MSG                                          
466900        PERFORM 50203000-CHECA-STATUS-COMS-IN                                 
467000        IF WS-ESPERACOMS-TIPO-EVENTO = 5 OR                                   
467010           COMS-IN-STATUS-KEY = 91                                            
467020*          CUANDO COMS-IN-STATUS-KEY = 91 SIGNIFICA QUE COMS  DIJO            
467030*          QUE SI HAY UN MENSAJE, PERO CUANDO LA COPIA  VA  POR EL            
467040*          RESULTA QUE OTRA COPIA YA LO TOMO  Y NO  HAY  OTRO  MSG            
467050*          QUE LA COPIA PUEDA TOMAR ES DECIR ES EL NO  DATA,  Y LA            
467060*          COPIA DEBE DE ESPERAR A QUE LE   AVISEN  QUE  HAY  OTRO            
467070*          MSG EN LA COLA.                                                    
467100           MOVE SPACES      TO WS-MENSAJE-DIALOGO                             
467200           MOVE 0           TO WS-ESPERACOMS-TIPO-EVENTO                      
467300        ELSE                                                                  
467400           NEXT SENTENCE                                                      
467500     ELSE                                                                     
467600     IF WS-ESPERACOMS-TIPO-EVENTO = 2                                         
467700        ACCEPT WS-MENSAJE                                                     
467800        MOVE 0    TO WS-ESPERACOMS-TIPO-EVENTO                                
467900     ELSE                                                                     
468000     IF WS-ESPERACOMS-TIPO-EVENTO = 3                                         
468100        ADD  1    TO WKS-CONTADOR-NTRAN                                       
468200        MOVE 0    TO WS-ESPERACOMS-TIPO-EVENTO                                
468300     ELSE                                                                     
468400     IF WS-ESPERACOMS-TIPO-EVENTO = 4                                         
468500        MOVE 0    TO WS-ESPERACOMS-TIPO-EVENTO                                
468600     ELSE                                                                     
468700        MOVE WS-ESPERACOMS-TIPO-EVENTO   TO                                   
468800                                      WKS-ESPERACOMS-TIPO-EVENTO              
468900        STRING "EVENTO DESCONOCIDO TIPO : ",                                  
469000               WKS-ESPERACOMS-TIPO-EVENTO                                     
469100               DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                       
469200        MOVE 0    TO WS-ESPERACOMS-TIPO-EVENTO                                
469300        PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                
469310                                                                              
469320*    OBTIENE FECHA Y HORA DE LA MAQUINA EN FORMATO AAMD                       
469330*    LA FECHA DE MAQUINA LA DEJA EN WKS-FEC-MAQ-AAMD                          
469340     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
469390                                                                              
469440     MOVE WKS-HRA-MAQ-HMSC        TO WS-HORA-MAQ-HM-AWAKE                     
469490                                                                              
469540     DIVIDE WS-HORA-MM-AWAKE BY 5 GIVING WS-AWAKE-COCIENTE                    
469590            REMAINDER WS-AWAKE-RESIDUO                                        
469640                                                                              
469690     IF WS-AWAKE-RESIDUO = 0 AND                                              
469740        ( WS-AWAKE-COCIENTE NOT = WS-AWAKE-COCIENTE-ANT )                     
469790        MOVE WS-AWAKE-COCIENTE    TO WS-AWAKE-COCIENTE-ANT                    
469840        PERFORM 50204000-P050-DESPIERTO.                                      
470100                                                                              
470200 50202000-RECEIVE-MSG.                                                        
470300     RECEIVE COMS-IN MESSAGE INTO WS-MENSAJE-DIALOGO                          
470400     NO DATA                                                                  
470500        NEXT SENTENCE.                                                        
470600                                                                              
470700 50203000-CHECA-STATUS-COMS-IN.                                               
470800     ADD  1       TO WKS-CONTADOR-NTRAN.                                      
471000     IF COMS-IN-STATUS-KEY = 99                                               
471100        MOVE 1                    TO WKS-EOJ-VA                               
471200     ELSE                                                                     
471300     IF COMS-IN-STATUS-KEY = 0 OR 89 OR 92 OR 93 OR 91                        
471400        NEXT SENTENCE                                                         
471500     ELSE                                                                     
471600        MOVE COMS-IN-STATUS-KEY      TO WS-COMS-IN-STATUS-KEY-I               
471700        STRING "COMS-IN-STATUS-KEY (",WS-COMS-IN-STATUS-KEY-I ,               
471800               ") DESCONOCIDO "                                               
471900               DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                       
472000        PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                
472100                                                                              
480000***********************************************************                   
480100*                                 50204000-P050-DESPIERTO *                   
480200***********************************************************                   
480300 50204000-P050-DESPIERTO.                                                     
480400     PERFORM 50204100-HOY-ES-DIA-HABIL.                                       
480425*P0120414 CHARITY Regulatory Requirement III* 1 LINEA  PCB AG/19*             
480445* SE OBTIENE DIA DE LA SEMANA**                                               
480450     PERFORM 50204150-HOY-ES-FIN-SEM.                                         
480500                                                                              
480600     IF WS-88-HOY-ES-DIAHABIL                                                 
480700        PERFORM 30100000-OBTIENE-FECHAS.                                      
480800                                                                              
480900     IF (WKS-FEC-LINEA NOT = WKS-FEC-LINEA-ANT)                               
481000        PERFORM 50204200-CAMBIO-DIA-CONTABLE                                  
481100        MOVE WKS-FEC-LINEA        TO WKS-FEC-LINEA-ANT.                       
481200                                                                              
481300     IF WS-88-HOY-ES-DIAHABIL               AND                               
481400        WS-HORA-HMS-AWAKE >  70000          AND                               
481500        WS-HORA-HMS-AWAKE < 200000                                            
481502*P0120414 CHARITY Regulatory Requirement III* 8 LINEAS  PCB AG/19*            
481504*SE REQUIERE DESPIERTE TAMBIEN DESDE SABADO 7 AM HASTA DOM. 4 PM              
481505        OR                                                                    
481510        WS-88-HOY-ES-SABADO                 AND                               
481515        WS-HORA-HMS-AWAKE >  70000          AND                               
481520        WS-HORA-HMS-AWAKE < 240000                                            
481525        OR                                                                    
481530        WS-88-HOY-ES-DOMINGO                AND                               
481535        WS-HORA-HMS-AWAKE >  00000          AND                               
481540        WS-HORA-HMS-AWAKE < 160000                                            
481600        PERFORM 50204300-PROCESA-AVISOS.                                      
481700*                                                                             
481800     IF WS-88-HOY-ES-DOMINGO                AND                               
481900        WS-HORA-HMS-AWAKE > 160000          AND                               
482000        WKS-88-S016L428-NO-EN-CONT                                            
482100        MOVE 1              TO WKS-88-S016L428-EN-CONT-VA                     
482200        CANCEL "S016L428".                                                    
482300*                                                                             
485000***************************                                                   
485100 50204100-HOY-ES-DIA-HABIL.                                                   
485200***************************                                                   
485300     MOVE 0                       TO WS-HOY-ES-DIAHABIL-VA                    
485400     MOVE WKS-FEC-MAQ-AAMD        TO WS-S006-FECHA1                           
485500     MOVE 0                       TO WS-S006-FECHA2                           
485600     MOVE 18                      TO WS-S006-FUNCION                          
485700     MOVE 13                      TO WS-S006-FORMATO                          
485800     PERFORM 20000006-LOCSUP                                                  
485900     IF WS-S006-FUNCION > 0                                                   
486000        MOVE 014                  TO WKS-DISPLAY-NO                           
486100        MOVE WS-S006-FUNCION      TO WKS-DPLAY-TXT-ADICIONAL                  
486200        PERFORM 60407300-LLAMA-DISPLAY-2                                      
486300     ELSE                                                                     
486400        IF WS-S006-FECHA1 = 1                                                 
486500           MOVE 1                 TO WS-HOY-ES-DIAHABIL-VA.                   
486600*P0120414 CHARITY Regulatory Requirement III* 15 LINEAS PCB AG/19*            
486625***** SE OBTIENE DIA DE LA SEMANA      ***************************            
486650***************************                                                   
486675 50204150-HOY-ES-FIN-SEM.                                                     
486700***************************                                                   
486725     MOVE 0                       TO WS-HOY-ES-FIN-SEM                        
486750     MOVE WKS-FEC-MAQ-AAMD        TO WS-S006-FECHA1                           
486775     MOVE 0                       TO WS-S006-FECHA2                           
486800     MOVE 06                      TO WS-S006-FUNCION                          
486825     MOVE 13                      TO WS-S006-FORMATO                          
486850     PERFORM 20000006-LOCSUP                                                  
486875     IF WS-S006-FUNCION > 0                                                   
486900        MOVE 014                  TO WKS-DISPLAY-NO                           
486925        MOVE WS-S006-FUNCION      TO WKS-DPLAY-TXT-ADICIONAL                  
486950        PERFORM 60407300-LLAMA-DISPLAY-2                                      
486975     ELSE                                                                     
487000        MOVE WS-S006-FECHA1       TO WS-HOY-ES-FIN-SEM.                       
490000******************************                                                
490100 50204200-CAMBIO-DIA-CONTABLE.                                                
490200******************************                                                
490300     STRING " EL P050 REALIZA CAMBIO DE DIA CONTABLE A LAS "                  
490400            WS-HORA-HH-AWAKE ":"                                              
490500            WS-HORA-MM-AWAKE ":"                                              
490600            WS-HORA-SS-AWAKE                                                  
490700            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                          
490800     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
490900                                                                              
491000     PERFORM 50204200-ARCHS-TODOS-ACTUAL.                                     
491520     PERFORM 50204200-INICIA-DIA-CONTABLE.                                    
491600                                                                              
491700 50204200-ARCHS-TODOS-ACTUAL.                                                 
491900     IF ATTRIBUTE OPEN OF I04-PROCMED = VALUE TRUE                            
492000        CLOSE I04-PROCMED WITH SAVE                                           
492100        OPEN EXTEND I04-PROCMED.                                              
492200                                                                              
493300                                                                              
494900                                                                              
504300                                                                              
504400 50204200-INICIA-DIA-CONTABLE.                                                
504500     CLOSE I03-ARCH-PROB WITH RELEASE.                                        
504600     CANCEL "S016L428".                                                       
504700     MOVE WKS-CSI-LOCAL                   TO WKS-TIT-I03-CSI.                 
504800     MOVE WKS-FEC-LINEA                   TO WKS-TIT-I03-FECH.                
504900     CHANGE ATTRIBUTE TITLE OF I03-ARCH-PROB                                  
505000                            TO WKS-TIT-I02-ARCH-PROB.                         
505100     OPEN OUTPUT I03-ARCH-PROB.                                               
505200                                                                              
530000*************************                                                     
530100 50204300-PROCESA-AVISOS.                                                     
530200*************************                                                     
530300     STRING " EL P050 PROCESA AVISOS A LAS "                                  
530400            WS-HORA-HH-AWAKE ":"                                              
530500            WS-HORA-MM-AWAKE ":"                                              
530600            WS-HORA-SS-AWAKE                                                  
530700            DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                          
530800     PERFORM 70200000-DATOS-AL-BACKUP-PROB.                                   
530900                                                                              
531000     MOVE 0       TO WKS-PROCESAR-REG-DE-AVISO-VA.                            
531100     PERFORM 50204300-PROCESA-REGISTROS                                       
531200             UNTIL WKS-88-NO-PROCESAR-REGISTRO.                               
531300                                                                              
531400 50204300-PROCESA-REGISTROS.                                                  
531500*    REQUIERE SABER LA HORA PARA QUE UNA VEZ QUE SE DESPERTO, NO              
531600*    MANDE AVISOS AL S016 DESPUES DE LAS 20:00 HORAS.                         
531700     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
531800*P0120414 CHARITY Regulatory Requirement III* 1 LINEA   PCB AG/19*            
531850*SE REQUIERE DESPIERTE TAMBIEN DESDE SABADO 7 AM HASTA DOM. 4 PM              
531900     IF NOT(WS-88-HOY-ES-DIAHABIL               AND                           
531905            WS-HORA-HMS-AWAKE >  70000          AND                           
531910            WS-HORA-HMS-AWAKE < 200000                                        
531912*P0120414 CHARITY Regulatory Requirement III* 9 LINEAS  PCB AG/19*            
531915            OR                                                                
531920            WS-88-HOY-ES-SABADO                 AND                           
531925            WS-HORA-HMS-AWAKE >  70000          AND                           
531930            WS-HORA-HMS-AWAKE < 240000                                        
531935            OR                                                                
531940            WS-88-HOY-ES-DOMINGO                AND                           
531945            WS-HORA-HMS-AWAKE >  00000          AND                           
531950            WS-HORA-HMS-AWAKE < 160000                                        
532050           )                                                                  
532100        MOVE 1            TO WKS-PROCESAR-REG-DE-AVISO-VA.                    
532200                                                                              
532300     IF WKS-88-PROCESAR-REGISTRO                                              
532400        PERFORM 50204300-LEE-REG-AVISO                                        
532500        IF WS-L010-RESULT > 0                                                 
532600           IF WS-L010-RESULT = 41                                             
532700              MOVE 1         TO WKS-PROCESAR-REG-DE-AVISO-VA                  
532800              STRING " LA LIBRERIA S016L428 SE ENCUENTRA "                    
532900                     "EN CONTINGENCIA "                                       
533000                     DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                 
533100              PERFORM 70200000-DATOS-AL-BACKUP-PROB                           
533120              IF WKS-88-S016L428-NO-EN-CONT                                   
533140                 MOVE 1   TO WKS-88-S016L428-EN-CONT-VA                       
533150                 CANCEL "S016L428"                                            
533170              ELSE                                                            
533190                 NEXT SENTENCE                                                
533200           ELSE IF WS-L010-RESULT = 42                                        
533300              MOVE 1         TO WKS-PROCESAR-REG-DE-AVISO-VA                  
533400              STRING " SE CONCLUYO LECTURA DE UN ARCHIVO : "                  
533500                     "ACTIVAMED/" WS-O-UG-FEC-GENMDA                          
533600                     DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                 
533700              PERFORM 70200000-DATOS-AL-BACKUP-PROB                           
533710              PERFORM 50204300-CAMBIO-ARCH                                    
533720           ELSE IF WS-L010-RESULT = 43                                        
533730              MOVE 1         TO WKS-PROCESAR-REG-DE-AVISO-VA                  
533740              STRING " POR EL MOMENTO NO HAY MAS REGISTROS "                  
533750                     "DE AVISO PARA ENVIAR AL S016 "                          
533760                     DELIMITED BY SIZE INTO WKS-PROB-R1-TEXTO                 
533770              PERFORM 70200000-DATOS-AL-BACKUP-PROB                           
533800           ELSE                                                               
533900              MOVE WS-L010-RESULT    TO WKS-DPLAY-TXT-ADICIONAL               
534000              MOVE 015               TO WKS-DISPLAY-NO                        
534100              PERFORM 60407300-LLAMA-DISPLAY-2                                
534200              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                        
534300                                                                              
534310     IF WKS-88-PROCESAR-REGISTRO                                              
534320        IF WKS-88-S016L428-SI-EN-CONT                                         
534330           MOVE 0         TO WKS-88-S016L428-EN-CONT-VA.                      
534360                                                                              
534400     IF WKS-88-PROCESAR-REGISTRO                                              
534600        PERFORM 50204300-ENVIA-REG-AL-S016                                    
534700        PERFORM 50204300-GUARDA-REG-EN-ARCHI.                                 
534900                                                                              
535000 50204300-LEE-REG-AVISO.                                                      
535100     MOVE 2               TO WS-I-UG-FUNCION.                                 
535200     PERFORM 0000-CALL-S500L010USAGENMDA.                                     
535300                                                                              
535400 50204300-ENVIA-REG-AL-S016.                                                  
535410     IF WS-O-UG-TIPO-REG = 2                                                  
535420        PERFORM 50204300-ENVIA-AVISO-S016                                     
535421     ELSE                                                                     
535422*P0120414 CHARITY Regulatory Requirement III*           PCB AG/19*            
535423*SE REACTIVA CTO ORIGEN DE CUENTA GLOBAL, CON REG TIPO 4                      
535424     IF WS-O-UG-TIPO-REG = 4                                                  
535426        PERFORM 50204340-REACTIVA-CTA-ORIGEN                                  
535430     ELSE                                                                     
535440        PERFORM 50204300-ENVIA-ACTLZA-S016.                                   
535450                                                                              
535460 50204300-ENVIA-AVISO-S016.                                                   
535461*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
535462     IF WS-O-UG-STA-CTO = 10 OR 11                                            
535464        PERFORM 50204310-ACTIVA-CUENTA                                        
535466     ELSE                                                                     
535468        PERFORM 50204320-BLOQUEA-BENEFICENCIA.                                
535470                                                                              
535472*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
535474     MOVE WS-O-UG-STA-CTO     TO WS-RBU-OPCPAGO                               
535476     MOVE WS-O-UG-STA-MDA     TO WS-RBU-RGOPAGO.                              
535478*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
535479                                                                              
535480 50204310-ACTIVA-CUENTA.                                                      
535500     MOVE WS-O-UG-PRDTO       TO WS-S016-0701-CTA-NUMPROD-E.                  
535600     MOVE WS-O-UG-INSTR       TO WS-S016-0701-CTA-CVEINST-E.                  
535700     MOVE 0                   TO WS-S016-0701-CTA-NUMPREF-E.                  
535800     MOVE WS-O-UG-CONTRATO    TO WS-S016-0701-CTA-NUM-E.                      
535900     MOVE 1                   TO WS-S016-0701-CTR-OPCION-E.                   
536000     MOVE WS-O-UG-STA-CTO     TO WS-S016-0701-CTA-CVESTATUS-E.                
536100     MOVE WS-O-UG-STA-MDA     TO WS-S016-0701-MDA-CVESTATUS-E.                
536120     IF WS-O-UG-PRDTO = 66 AND WS-O-UG-INSTR = 11                             
536140        MOVE 25   TO WS-S016-0701-RESULT                                      
536160     ELSE                                                                     
536200        PERFORM 20000016-L428-B04CTAB08MDA.                                   
536202                                                                              
536300     PERFORM 50204300-ASIGNA-RESULT-S016.                                     
536310                                                                              
536320 50204320-BLOQUEA-BENEFICENCIA.                                               
536322     MOVE WS-O-UG-PRDTO           TO  E428-36-CTA-NUMPROD                     
536324     MOVE WS-O-UG-INSTR           TO  E428-36-CTA-CVEINST                     
536326     MOVE WS-O-UG-CTO-NUM-PREF    TO  E428-36-CTA-NUMPREF                     
536328     MOVE WS-O-UG-CTO-NUM         TO  E428-36-CTA-NUM                         
536330     MOVE 1                       TO  E428-36-CTR-OPCION                      
536332     MOVE WS-O-UG-STA-CTO         TO  E428-36-CTA-CVESTATUS                   
536334     PERFORM                      20000016-L428-STA-BENEFICENCIA              
536336     MOVE R428-36-CTR-ERROR       TO  WS-S016-0701-RESULT                     
536338     PERFORM                      50204300-ASIGNA-RESULT-S016.                
536340                                                                              
536341*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
536342*P0120414 CHARITY Regulatory Requirement III*  13 LINEAS PCB AG/19            
536344*SE REACTIVA CTO ORIGEN DE CUENTA GLOBAL, CON REG TIPO 4                      
536346 50204340-REACTIVA-CTA-ORIGEN.                                                
536348$SET OMIT = NOT S016L428R05                                                   
536351     MOVE WS-O-UG-PRDTO           TO E428-40-CTA-NUMPROD                      
536356     MOVE WS-O-UG-INSTR           TO E428-40-CTA-CVEINST                      
536361     MOVE WS-O-UG-CTO-NUM-PREF    TO E428-40-CTA-NUMPREF                      
536366     MOVE WS-O-UG-CTO-NUM         TO E428-40-CTA-NUM                          
536371     MOVE 1                       TO E428-40-CTR-OPCION                       
536376     MOVE WS-O-UG-STA-CTO         TO E428-40-CTA-CVESTATUS                    
536381     MOVE 50                      TO E428-40-PASO                             
536386     MOVE 51                      TO E428-40-CAJA                             
536391     PERFORM                      20000018-L428-STA-BENEFICENCI2              
536396     MOVE R428-40-CTR-ERROR       TO WS-S016-0701-RESULT                      
536398$POP OMIT                                                                     
536408     IF WS-88-PRUEBAS                                                         
536418        DISPLAY "WS-O-UG-PRDTO        = " WS-O-UG-PRDTO                       
536428        DISPLAY "WS-O-UG-INSTR        = " WS-O-UG-INSTR                       
536438        DISPLAY "WS-O-UG-CTO-NUM-PREF = " WS-O-UG-CTO-NUM-PREF                
536448        DISPLAY "WS-O-UG-CTO-NUM      = " WS-O-UG-CTO-NUM                     
536458        DISPLAY "WS-O-UG-STA-CTO      = " WS-O-UG-STA-CTO                     
536468        DISPLAY "WS-S016-0701-RESULT  = " WS-S016-0701-RESULT.                
536478     PERFORM                      50204300-ASIGNA-RESULT-S016.                
536540 50204300-ASIGNA-RESULT-S016.                                                 
536550     MOVE WS-S016-0701-RESULT     TO WS-RESULT-S016.                          
536600     IF WS-S016-0701-RESULT = 0                                               
536700        MOVE 20                   TO WS-INDRES-S016                           
536800     ELSE IF WS-S016-0701-RESULT >  0 AND < 20                                
536900        MOVE WS-S016-0701-RESULT  TO WS-INDRES-S016                           
536920     ELSE IF WS-S016-0701-RESULT  = 25                                        
536940        MOVE WS-S016-0701-RESULT  TO WS-INDRES-S016                           
537000     ELSE IF WS-S016-0701-RESULT > 79 AND < 99                                
537100        MOVE 21                   TO WS-INDRES-S016                           
537200     ELSE IF WS-S016-0701-RESULT > 99                                         
537300        MOVE 22                   TO WS-INDRES-S016                           
537400     ELSE                                                                     
537500        MOVE 23                   TO WS-INDRES-S016.                          
537502                                                                              
537510 50204300-ENVIA-ACTLZA-S016.                                                  
537512     MOVE LOW-VALUES              TO WS-S016-E428-04-CTR-ENTRADA.             
537514     MOVE 0                       TO WS-S016-E428-04-CTA-NUMPREF.             
537516     MOVE WS-O-UG-CONTRATO        TO WS-S016-E428-04-CTA-NUM.                 
537518     MOVE 1                       TO WS-S016-E428-04-CTA-NUMPROD.             
537520     MOVE 3                       TO WS-S016-E428-04-CTA-CVEINST.             
537522     MOVE 70                      TO WS-S016-E428-04-OPCION.                  
537523*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
537524     MOVE WS-O-UG-OPCPAGO         TO WS-S016-E428-04-CTA-OPCPAGO              
537525                                     WS-RBU-OPCPAGO                           
537526     MOVE WS-O-UG-RGOPAGO         TO WS-S016-E428-04-CTA-RGOPAGO              
537527                                     WS-RBU-RGOPAGO.                          
537528*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
537530     PERFORM 20000016-L428-B04CUENTAS.                                        
537532                                                                              
537534     MOVE WS-S016-R428-04-CTR-ERROR       TO WS-RESULT-S016.                  
537536     IF WS-S016-R428-04-CTR-ERROR = 0                                         
537538        MOVE 20                   TO WS-INDRES-S016                           
537540     ELSE                                                                     
537542        MOVE 23                   TO WS-INDRES-S016.                          
537600                                                                              
537700 50204300-GUARDA-REG-EN-ARCHI.                                                
537725*P0120414 CHARITY Regulatory Requirement III*  1 LINEA PCB AG/19              
537730** SE ADICIONA TIPO DE REGISTRO EN ARCHIVO DE TRABAJO, PARA TOMAR             
537740** DE DIFERENTE TABLA LOS MENSAJES DE ERROR DEL EP BENEFICENCIA2              
537750     MOVE WS-O-UG-TIPO-REG                TO WS-RBU-TIPREG                    
537800     MOVE WS-RESULT-S016                  TO WS-RBU-RES-S016                  
537900     MOVE WS-INDRES-S016                  TO WS-RBU-STA-ENVIO                 
538000     MOVE WS-O-UG-SUC-PROM                TO WS-RBU-SUC-PROM                  
538100     MOVE WS-O-UG-NUMCTE                  TO WS-RBU-NUM-CTE                   
538200     MOVE WS-O-UG-PRDTO                   TO WS-RBU-PRDTO                     
538300     MOVE WS-O-UG-INSTR                   TO WS-RBU-INSTR                     
538400     MOVE WS-O-UG-MONEDA                  TO WS-RBU-MONEDA                    
538500     MOVE WS-O-UG-CONTRATO                TO WS-RBU-CONTRATO                  
538600     MOVE WS-O-UG-NOMBRE                  TO WS-RBU-NOMBRE                    
538700     MOVE WS-O-UG-FEC-MAQ                 TO WS-RBU-FEC-RECEP                 
538800     MOVE WS-O-UG-HRA-MAQ                 TO WS-RBU-HRA-RECEP                 
538900     MOVE WKS-FEC-MAQ-AAMD                TO WS-RBU-FEC-ENVIO                 
539000     MOVE WKS-HRA-MAQ-HMS                 TO WS-RBU-HRA-ENVIO                 
539100     WRITE I04-REG-PROCMED FROM WS-REG-BACKUP-UN-ARCH.                        
539200                                                                              
540400 50204300-CAMBIO-ARCH.                                                        
540580        MOVE 1               TO WKS-IMPR-ARCH-PROCMED-VA.                     
540600        PERFORM 50204300-ARCH-EN-PROC-ACTUAL.                                 
540700        PERFORM 50204300-ARCH-EN-PROC-ABRE-REP.                               
540800        PERFORM 50204300-ARCH-EN-PROC-HDER-REP.                               
540900        PERFORM 50204300-ARCH-EN-PROC-PROCESA                                 
541000                UNTIL WKS-ARCH-EN-PROC-EOF.                                   
541100        PERFORM 50204300-ARCH-EN-PROC-NUEVO.                                  
541150        MOVE 0               TO WKS-IMPR-ARCH-PROCMED-VA.                     
541200                                                                              
541300 50204300-ARCH-EN-PROC-ACTUAL.                                                
541400     CLOSE I04-PROCMED WITH SAVE.                                             
541500                                                                              
541600 50204300-ARCH-EN-PROC-ABRE-REP.                                              
541700     MOVE WKS-CSI-LOCAL                   TO CARAT-CSI.                       
541800     MOVE "/R"                            TO CARAT-CIFRA.                     
541900     MOVE 0                               TO CARAT-NUMPRO.                    
542000     MOVE WKS-FEC-GENMDA                  TO CARAT-FECHA.                     
542100     MOVE WKS-MIX                         TO CARAT-MIX.                       
542200     MOVE "001DETACTIVAMED"               TO CARAT-NOMREPORTE.                
542300     SET R01-ACTMEDIOS (USERBACKUPNAME)   TO VALUE TRUE.                      
542400     SET R01-ACTMEDIOS (TITLE)            TO WKS-CARATULA.                    
542500     OPEN OUTPUT R01-ACTMEDIOS.                                               
542600                                                                              
542700 50204300-ARCH-EN-PROC-HDER-REP.                                              
542800     OPEN INPUT I04-PROCMED.                                                  
542900                                                                              
543000     MOVE 51                         TO WKS-PROCMED-NUM-LINEAS.               
543100     MOVE 0                          TO WKS-PROCMED-CONT-PAGE.                
543200     MOVE WKS-FECGENMDA-AAAA         TO WKS-FECEDIT-AAAA.                     
543300     MOVE T-M(WKS-FECGENMDA-MM)      TO WKS-FECEDIT-MM.                       
543400     MOVE WKS-FECGENMDA-DD           TO WKS-FECEDIT-DD.                       
543500     MOVE WKS-FEC-MAQ-AAMD-AAAA      TO WKS-FECMAQEDIT-AAAA.                  
543600     MOVE T-M(WKS-FEC-MAQ-AAMD-MM)   TO WKS-FECMAQEDIT-MM.                    
543700     MOVE WKS-FEC-MAQ-AAMD-DD        TO WKS-FECMAQEDIT-DD.                    
543800                                                                              
543850     MOVE " "     TO WLI-R01-L08-DETALLE.                                     
543900     STRING  " ARCHIVO APLICADO:   "                                          
544000            ,"S500/FILE/S500/ACTIVAMED/"                                      
544100            ,WKS-CSI-LOCAL                                                    
544200            ,"/"                                                              
544300            ,WKS-FECGENMDA-AAMMDD                                             
544400             DELIMITED BY SIZE INTO WLI-R01-L08-DETALLE.                      
544500                                                                              
544600     PERFORM 50204300-ARCH-EN-PROC-IMPRIME 2 TIMES.                           
544700                                                                              
544800     MOVE 0               TO WKS-PROCMED-REGISTROS                            
544900                             WKS-PROCMED-NOEXISTE                             
545000                             WKS-PROCMED-ACEPTADOS                            
545100                             WKS-PROCMED-RECHAZADOS.                          
545200                                                                              
545300     MOVE 0               TO WKS-ARCH-EN-PROC-EOF-VA.                         
545400                                                                              
545500 50204300-ARCH-EN-PROC-PROCESA.                                               
545600     READ I04-PROCMED INTO WS-REG-BACKUP-UN-ARCH AT END                       
545700          MOVE 1 TO WKS-ARCH-EN-PROC-EOF-VA.                                  
545800                                                                              
545900     IF WKS-ARCH-EN-PROC-EOF                                                  
546000        PERFORM 50204300-ARCH-EN-PROC-TOTAL                                   
546100     ELSE                                                                     
546200        PERFORM 50204300-ARCH-EN-PROC-SUMA                                    
546300        PERFORM 50204300-ARCH-EN-PROC-MUEVE                                   
546400        PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                
546500                                                                              
546600 50204300-ARCH-EN-PROC-TOTAL.                                                 
546700     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
546800     MOVE " LEIDOS EN ARCHIVO    "        TO WLI-R01-L08-DETALLE.             
546900     MOVE WKS-PROCMED-REGISTROS           TO WLI-R01-L08-NUMCTO.              
547000     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
547100                                                                              
547200     MOVE " ACEPTADOS  S016      "        TO WLI-R01-L08-DETALLE.             
547300     MOVE WKS-PROCMED-ACEPTADOS           TO WLI-R01-L08-NUMCTO.              
547400     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
547500                                                                              
547600     MOVE " RECHAZADOS S016      "        TO WLI-R01-L08-DETALLE.             
547700     MOVE WKS-PROCMED-RECHAZADOS          TO WLI-R01-L08-NUMCTO.              
547800     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
547900                                                                              
548000     MOVE " NO EXISTE EN S500    "        TO WLI-R01-L08-DETALLE.             
548100     MOVE WKS-PROCMED-NOEXISTE            TO WLI-R01-L08-NUMCTO.              
548200     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
548220                                                                              
548240     MOVE " NO ENVIADOS AL S016  "        TO WLI-R01-L08-DETALLE.             
548260     MOVE WKS-PROCMED-NOENVIADOS          TO WLI-R01-L08-NUMCTO.              
548280     PERFORM 50204300-ARCH-EN-PROC-IMPRIME 2 TIMES.                           
548300                                                                              
548400     MOVE "          ********** FIN DE REPORTE *******"                       
548500                                          TO WLI-R01-L08-DETALLE.             
548600     PERFORM 50204300-ARCH-EN-PROC-IMPRIME.                                   
548700                                                                              
548800     CLOSE R01-ACTMEDIOS WITH SAVE.                                           
548900     CLOSE I04-PROCMED WITH PURGE.                                            
549000                                                                              
549840     WAIT(5).                                                                 
549850     CALL     SYSTEM WFL    USING WKS-FORZALIST.                              
549900                                                                              
550000 50204300-ARCH-EN-PROC-SUMA.                                                  
550100     ADD 1        TO WKS-PROCMED-REGISTROS.                                   
550200     IF WS-RBU-STA-ENVIO = 24                                                 
550300        ADD 1     TO WKS-PROCMED-NOEXISTE                                     
550320     ELSE IF WS-RBU-RES-S016 = 25                                             
550340        ADD 1     TO WKS-PROCMED-NOENVIADOS                                   
550360*P0120414 CHARITY Regulatory Requirement III*  2 LINEAS PCB AG/19             
550380**PARA NO AFECTAR LOS MENSAJES DEL LOS EP ANTERIORES EN EL REPORT             
550400     ELSE IF (WS-RBU-TIPREG IS NOT EQUAL TO 4                                 
550420                            AND                                               
550440              (WS-RBU-RES-S016 = 0 OR 16)                                     
550460             )                                                                
550500        ADD 1     TO WKS-PROCMED-ACEPTADOS                                    
550550*P0120414 CHARITY Regulatory Requirement III*  5 LINEAS PCB AG/19             
550575**PARA NO AFECTAR LOS MENSAJES DEL LOS EP ANTERIORES EN EL REPORT             
550600     ELSE IF (WS-RBU-TIPREG IS EQUAL TO 4                                     
550610                            AND                                               
550620              WS-RBU-RES-S016 = 0                                             
550630             )                                                                
550640        ADD 1     TO WKS-PROCMED-ACEPTADOS                                    
550650     ELSE                                                                     
550700        ADD 1     TO WKS-PROCMED-RECHAZADOS.                                  
550800                                                                              
550900 50204300-ARCH-EN-PROC-MUEVE.                                                 
550910*INI R3.5-2011-AUTORIZACION                               ABARBOSA            
551000     MOVE WS-RBU-SUC-PROM         TO WLI-R01-L08-SUCPROM                      
551100     MOVE WS-RBU-NUM-CTE          TO WLI-R01-L08-NUMCTE                       
551200     MOVE WS-RBU-PRDTO            TO WLI-R01-L08-PROD                         
551300     MOVE WS-RBU-INSTR            TO WLI-R01-L08-INST                         
551400     MOVE WS-RBU-MONEDA           TO WLI-R01-L08-MON                          
551500     MOVE WS-RBU-CONTRATO         TO WLI-R01-L08-NUMCTO                       
551600     MOVE WS-RBU-NOMBRE           TO WLI-R01-L08-NOMBRE                       
551610     MOVE WS-RBU-OPCPAGO          TO WLI-R01-L08-CAMB01                       
551620     MOVE "/"                     TO WLI-R01-FILL-SEP01                       
551630     MOVE WS-RBU-RGOPAGO          TO WLI-R01-L08-CAMB02                       
551635*P0120414 CHARITY Regulatory Requirement III*  5 LINEAS PCB AG/19             
551640*SE TOMA EL TIPO DE REGISTRO PARA REPORTE DEL EP BENEFICENCIA2                
551650     IF WS-RBU-TIPREG             IS EQUAL TO 4                               
551655        MOVE WS-RBU-RES-S016      TO                                          
551660             WKS-NUM2-RES-S016(WS-RBU-STA-ENVIO)                              
551665        MOVE WKS-TB2-RES-S016 (WS-RBU-STA-ENVIO)                              
551670                                  TO WLI-R01-L08-ESTATUS                      
551690     ELSE                                                                     
551700        MOVE WS-RBU-RES-S016      TO                                          
551800             WKS-NUM-RES-S016 (WS-RBU-STA-ENVIO)                              
551900        MOVE WKS-TB-RES-S016  (WS-RBU-STA-ENVIO)                              
552000                                  TO WLI-R01-L08-ESTATUS.                     
552100     MOVE WS-RBU-FEC-RECEP        TO WLI-R01-L08-FEC-RCV                      
552200     MOVE WS-RBU-HRA-RECEP        TO WLI-R01-L08-HRA-RCV                      
552620     MOVE WS-RBU-FEC-ENVIO        TO WLI-R01-L08-FEC-S016                     
552640     MOVE WS-RBU-HRA-ENVIO        TO WLI-R01-L08-HRA-S016.                    
552650*FIN R3.5-2011-AUTORIZACION                               ABARBOSA            
552700                                                                              
552800 50204300-ARCH-EN-PROC-IMPRIME.                                               
552900     ADD 1        TO WKS-PROCMED-NUM-LINEAS.                                  
553000     IF WKS-PROCMED-NUM-LINEAS > 51                                           
553100        PERFORM 50204300-ARCH-EN-PROC-ENCA.                                   
553200                                                                              
553300     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L08-DETALLE AFTER 1.                
553400     MOVE " "     TO WLI-R01-L08-DETALLE.                                     
553500                                                                              
553600 50204300-ARCH-EN-PROC-ENCA.                                                  
553700     MOVE "001DETACTIVAMED"           TO WLI-R01-L01-QREP.                    
553800     MOVE WKS-FEC-EDIT-DDMMAAAA       TO WLI-R01-L01-FEC-PROC.                
553900                                                                              
554000     MOVE WKS-FECMAQ-EDIT-DDMMAAAA    TO WLI-R01-L02-FEC-MAQ.                 
554100     MOVE "DETALLE DE ACTIVACION DE MEDIOS - CAMBIO OPCION Y RGO"             
554200                                      TO WLI-R01-L02-TITULO.                  
554300                                                                              
554400     MOVE WKS-HRA-MAQ-HH              TO WLI-R01-L03-HH.                      
554500     MOVE WKS-HRA-MAQ-MM              TO WLI-R01-L03-MM.                      
554600     MOVE WKS-HRA-MAQ-SS              TO WLI-R01-L03-SS.                      
554700     ADD  1                           TO WKS-PROCMED-CONT-PAGE.               
554800     MOVE WKS-PROCMED-CONT-PAGE       TO WLI-R01-L03-NUM-PAG.                 
554900                                                                              
555000     IF WKS-CSI-LOCAL = 10                                                    
555100        MOVE 3084                     TO WLI-R01-L04-SUC                      
555200        MOVE "C.C.I.  MEXICO "        TO WLI-R01-L05-NCSI                     
555300        MOVE "PYCP JARDINES"          TO WLI-R01-L05-NOMBSUC                  
555400     ELSE                                                                     
555500        MOVE 3667                     TO WLI-R01-L04-SUC                      
555600        MOVE "C.C.I.  MONTERREY"      TO WLI-R01-L05-NCSI                     
555700        MOVE "CYSAU MTY CTROL PROD"   TO WLI-R01-L05-NOMBSUC.                 
555800                                                                              
555900     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L01-ENCA  AFTER PAGE.               
556000     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L02-ENCA  AFTER 1.                  
556100     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L03-ENCA  AFTER 1.                  
556200     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L04-ENCA  AFTER 1.                  
556300     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L05-ENCA  AFTER 1.                  
556400     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L06-ENCA  AFTER 2.                  
556500     WRITE R01-REG-ACTMEDIOS FROM WLI-R01-L07-ENCA  AFTER 1.                  
556600     MOVE  "  "   TO  R01-REG-ACTMEDIOS                                       
556700     WRITE R01-REG-ACTMEDIOS                        AFTER 1.                  
556800                                                                              
556900     MOVE 10      TO WKS-PROCMED-NUM-LINEAS.                                  
557000                                                                              
557100 50204300-ARCH-EN-PROC-NUEVO.                                                 
557200     MOVE WS-O-UG-FEC-GENMDA      TO WKS-FEC-GENMDA.                          
557300     PERFORM 30400000-ABRE-ARCH-I04-PROCMED.                                  
557400                                                                              
680000***********************************************************                   
680100*                             LLAMADOS A L010             *                   
680200***********************************************************                   
680300 0000-CALL-S500L010FECGENMDA.                                                 
680400     CALL "S500L010FECGENMDA IN S500L010CTRL"                                 
680500          USING  WS-OUT-FECGENMDA                                             
680600          GIVING WS-L010-RESULT.                                              
680700                                                                              
680800 0000-CALL-S500L010USAGENMDA.                                                 
680900     CALL "S500L010USAGENMDA IN S500L010CTRL"                                 
681000          USING  WS-IN-USAGENMDA                                              
681100                 WS-OUT-USAGENMDA                                             
681200          GIVING WS-L010-RESULT.                                              
681300                                                                              
681350*    DISPLAY "<MPD> RESULT     " WS-L010-RESULT.                              
681400*    DISPLAY "<MPD> FEC-GENMDA " WS-O-UG-FEC-GENMDA.                          
681500*    DISPLAY "<MPD> TIPO-REG   " WS-O-UG-TIPO-REG.                            
681600*    DISPLAY "<MPD> PRDTO      " WS-O-UG-PRDTO.                               
681700*    DISPLAY "<MPD> INSTR      " WS-O-UG-INSTR.                               
681800*    DISPLAY "<MPD> MONEDA     " WS-O-UG-MONEDA.                              
681900*    DISPLAY "<MPD> SUC-PROM   " WS-O-UG-SUC-PROM.                            
682000*    DISPLAY "<MPD> CONTRATO   " WS-O-UG-CONTRATO.                            
682100*    DISPLAY "<MPD> STA-REG    " WS-O-UG-STA-REG.                             
682200*    DISPLAY "<MPD> STA-CTO    " WS-O-UG-STA-CTO.                             
682300*    DISPLAY "<MPD> STA-MDA    " WS-O-UG-STA-MDA.                             
682400*    DISPLAY "<MPD> FEC-MAQ    " WS-O-UG-FEC-MAQ.                             
682500*    DISPLAY "<MPD> HRA-MAQ    " WS-O-UG-HRA-MAQ.                             
682600*    DISPLAY "<MPD> PROCESO    " WS-O-UG-PROCESO.                             
682700*    DISPLAY "<MPD> NUMCTE     " WS-O-UG-NUMCTE.                              
682800*    DISPLAY "<MPD> NOMBRE     " WS-O-UG-NOMBRE.                              
682900*    DISPLAY "<MPD> OPCPAGO    " WS-O-UG-OPCPAGO.                             
683000*    DISPLAY "<MPD> RGOPAGO    " WS-O-UG-RGOPAGO.                             
683100                                                                              
700000***********************************************************                   
700100*                             MANEJO DE DISPLAYS CON LJ   *                   
700200***********************************************************                   
700300 60407200-LLAMA-DISPLAY-1.                                                    
700400     MOVE WKS-DPLAY-TEXTO(WKS-DISPLAY-NO)   TO TEXTO-LJ.                      
700500     MOVE WKS-DPLAY-TIPO(WKS-DISPLAY-NO)    TO TIPO-LJ.                       
700600     MOVE WKS-DPLAY-CODIGO(WKS-DISPLAY-NO)  TO CODIGO-LJ.                     
700700     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
700800                                                                              
700900 60407300-LLAMA-DISPLAY-2.                                                    
701000     STRING WKS-DPLAY-TEXTO(WKS-DISPLAY-NO),                                  
701100            WKS-DPLAY-TXT-ADICIONAL                                           
701200            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
701300     MOVE WKS-DPLAY-TIPO(WKS-DISPLAY-NO)    TO TIPO-LJ.                       
701400     MOVE WKS-DPLAY-CODIGO(WKS-DISPLAY-NO)  TO CODIGO-LJ.                     
701500     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
701600                                                                              
701700 60407400-LLAMA-DISPLAY-3.                                                    
701800     STRING WKS-DPLAY-TEXTO(WKS-DISPLAY-NO),                                  
701900            WKS-DPLAY-TXT-ERROR                                               
702000            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
702100     MOVE WKS-DPLAY-TIPO(WKS-DISPLAY-NO)    TO TIPO-LJ.                       
702200     MOVE WKS-DPLAY-CODIGO(WKS-DISPLAY-NO)  TO CODIGO-LJ.                     
702300     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
702400                                                                              
800000***********************************************************                   
800100*         SECCION PARA MANEJO DE ARCHIVO DE PROBLEMAS     *                   
800200***********************************************************                   
800300 70200000-DATOS-AL-BACKUP-PROB.                                               
800400     MOVE WKS-MIX                         TO WKS-PROB-R1-MIX.                 
800500     MOVE WKS-HRA-MAQ-HH                  TO WKS-PROB-R1-TIME-HH.             
800600     MOVE WKS-HRA-MAQ-MM                  TO WKS-PROB-R1-TIME-MM.             
800700     MOVE WKS-HRA-MAQ-SS                  TO WKS-PROB-R1-TIME-SS.             
800800     MOVE WKS-CONTADOR-NTRAN              TO WKS-PROB-R1-NTRAN.               
800900     MOVE WKS-PROB-RENGLON1               TO WKS-REG-PROBLEMAS.               
801000                                                                              
801100     PERFORM 70201000-GRABA-REG-PROBLEMAS.                                    
801200     MOVE SPACES                          TO WKS-PROB-R1-TEXTO.               
801300                                                                              
801400 70201000-GRABA-REG-PROBLEMAS.                                                
801500     IF WKS-LIN-PROBLEMAS > 59                                                
801600        MOVE 0            TO WKS-LIN-PROBLEMAS                                
801700        MOVE SPACES       TO I02-REG-ARCH-PROB                                
801800        WRITE I02-REG-ARCH-PROB.                                              
801900     WRITE I02-REG-ARCH-PROB FROM WKS-REG-PROBLEMAS.                          
802000     ADD 1        TO WKS-LIN-PROBLEMAS.                                       
802100                                                                              
802200                                                                              
900000**********************************************************                    
900100*         80000000-FIN-PGM                               *                    
900200**********************************************************                    
900300 80000000-FIN-PGM.                                                            
900400     IF WKS-88-VERS-SIN-ERROR OR WKS-88-VERS-ERR-SI-CONTINUO                  
900600        CLOSE I04-PROCMED   WITH SAVE                                         
900700        CLOSE I03-ARCH-PROB WITH SAVE.                                        
900800                                                                              
900900     MOVE 002                 TO WKS-DISPLAY-NO                               
901000     PERFORM 60407200-LLAMA-DISPLAY-1.                                        
901100                                                                              
901200                                                                              
910000***********************************************************                   
910100* SECCION DE PROCEDIMIENTOS PARA LIBRERIAS                *                   
910200***********************************************************                   
910300                                                                              
910400 COPY "S500/INC/PRO/25MTP002".                                                
910500                                                                              
910600                                                                              
