001000$SET      LIST ERRORLIMIT = 100 MAP ERRORLIST STACK LINEINFO                  
003000$SET BDB02R01 S000LIBLJ                                                       
004000$SET BDB91                                                                    
004500$SET BD4B01R01                                                                
005000$SET S006LOCSUP                                                               
005010$SET S100VERSIONES                                                            
006000                                                                              
007000*****************************************************************             
008000*                                                                             
009000* SISTEMA:  S500 CAPTACION                                                    
010000* PROGRAMA: P100.                                                             
011000* PROGRAMA PARA OBTENCION DE FECHAS Y VALIDACION DEL REG. DE CTRL.            
012000* ULTIMA ACTUALIZACION: AGO/2018 EPP                                          
013000* CORRE CON EL PARAMETRO WS-VAL-FEC  ("AB")                                   
013002* "AB" (A=Opcion, B=Dias menos)                                               
013004* A = Opcion de 1 a 9  (A > 0 y B = 0)                                        
013006*     ("1" ,"2", "3", "4", "5", "6", "7", "8", "9")                           
013008*     ("10","20","30","40","50","60","70","80","90")                          
013009*                                                                             
013010* B = Dias habiles anteriores a la fecha de linea                             
013012*     opcion del 11 al 19  (A = 0 y B > 0)                                    
013014*     ("01","02","03","04","05","06","07","08","09")                          
013016*      Días habilies menos a la fecha de linea.                               
013018*                                                                             
013020* Cualquier otra combinacion                                                  
013022* (A = 0 y B = 0) o (A > 0 y B > 1)                                           
013024* Regresa fecha de linea y CSI                                                
013026*                                                                             
013050* "0" = Regresa Fecha de Linea menos 2 dias y el CSI                          
013100* "1" = Regresa Fecha de Linea menos 1 dia  y el CSI                          
013150* "2" = Regresa Fecha de Linea menos 2 dias y el CSI                          
013200* "3" = Regresa Fecha B01P-ULT-ARCHAPLI (BD04)                                
013250*                     B01P-NUM-CSI      (BD04)                                
013300* "4" = Regresa Fecha de Linea menos 2 dias y el CSI                          
013350* "5" = Regresa fecha solicitada por ACCEPT y el CSI                          
013400* "6" = Regresa fecha de fin de mes anterior a la linea y CSI                 
013450* "7" = Regresa fecha de inicio mes del mes y CSI                             
013550* "8" = Regresa fecha de linea y CSI                                          
013600* "9" = Regresa Status Teleton   000000000X                                   
013605* "10" = Regresa Fecha de Linea menos 01 dia  y el CSI                        
013610* "01" = Regresa Fecha de Linea menos 01 dia  y el CSI                        
013615* "02" = Regresa Fecha de Linea menos 02 dias y el CSI                        
013620* "03" = Regresa Fecha de Linea menos 03 dias y el CSI                        
013625* "04" = Regresa Fecha de Linea menos 04 dias y el CSI                        
013630* "05" = Regresa Fecha de Linea menos 05 dias y el CSI                        
013632* "06" = Regresa Fecha de Linea menos 06 dias y el CSI                        
013634* "07" = Regresa Fecha de Linea menos 07 dias y el CSI                        
013636* "08" = Regresa Fecha de Linea menos 08 dias y el CSI                        
013638* "09" = Regresa Fecha de Linea menos 09 dias y el CSI                        
013650* "31" = Regresa B02-USO-FUTURO-05                                            
014000******************************************************************            
015000                                                                              
016000*****************************************************************             
017000* I D E N T I F I C A T I O N      D I V I S I O N.                           
018000*****************************************************************             
019000 IDENTIFICATION  DIVISION.                                                    
020000 PROGRAM-ID. FECHA-DE-PROCESO.                                                
021000 AUTHOR.     INGENIERIA DE SISTEMAS BANAMEX.                                  
022000 SECURITY.   OBTIENE LA FECHA DE PROCESO DE LOS DATOS                         
023000             GLOBALES PARA REGRESARLA AL WFL.                                 
024000             Y VALIDA CAMPOS DE LA PRELINEA.                                  
025000 INSTALLATION. CUPS A10.                                                      
026000 DATE-WRITTEN. MAR96 .                                                        
027000 DATE-COMPILED.                                                               
028000                                                                              
029000*************************************                                         
030000* E N V I R O N M E N T     D I V I S I O N.                                  
031000*************************************                                         
032000 ENVIRONMENT DIVISION.                                                        
033000 CONFIGURATION SECTION.                                                       
034000 OBJECT-COMPUTER. A16.                                                        
035000                                                                              
036000*************************************                                         
037000* D A T A      D I V I S I O N.                                               
038000*************************************                                         
039000 DATA DIVISION.                                                               
040000                                                                              
041000******************************************************************            
042000* D A T A - B A S E      S E C T I O N.                                       
043000******************************************************************            
044000 DATA-BASE SECTION.                                                           
045000 DB  S500BD01CAPTACION.                                                       
046000 01  S500B02CONTROL.                                                          
047000 01  S500B91REINICIO.                                                         
048000                                                                              
048100 DB  S500BD04TARJETAS.                                                        
048200 01  S500B01PCONTROL.                                                         
048300                                                                              
049000******************************************************************            
050000* W O R K I N G -  S T O R A G E     S E C T I O N.                           
051000******************************************************************            
052000 WORKING-STORAGE SECTION.                                                     
053000                                                                              
053100 01  WKS-VARIABLES-HOST.                                                      
053105     02 WKS-MY-HOST         PIC X(10).                                        
053110     02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
053115        04 WKS-MY-HOST-03   PIC X(04).                                        
053120        04 WKS-MY-HOST-17   PIC X(06).                                        
053125                                                                              
053130     02 WKS-ES-DES          PIC 9(01)   VALUE 0.                              
053135     02 WKS-ES-SIT          PIC 9(01)   VALUE 0.                              
053140     02 WKS-ES-UAT          PIC 9(01)   VALUE 0.                              
053145     02 WKS-ES-PRD          PIC 9(01)   VALUE 0.                              
053150                                                                              
054000******************************************************************            
055000* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES D/ACCESO            
056000* A LA BASE DE DATOS.                                                         
057000******************************************************************            
058000 COPY "S500/INC/WOR/25MTP004".                                                
059000                                                                              
060000******************************************************************            
061000* CAMPOS UTILIZADOS EN EL PROGRAMA.                                           
062000******************************************************************            
063000 77 WFL-PARAMETRO              PIC X(9)     VALUE SPACES.                     
064000 77 WS-FUNCION                 PIC S9(11)   BINARY.                           
065000 77 WS-FORMATO                 PIC S9(11)   BINARY.                           
065010 77 WS-1VEZ                    PIC 9        VALUE 0.                          
065020 01 WS-VAL-FEC                 PIC 99.                                        
065022 01 WS-VAL-FEC-R               REDEFINES    WS-VAL-FEC.                       
065024    02 WS-VAL-F-O              PIC 9.                                         
065026    02 WS-VAL-F-D              PIC 9.                                         
065030                                                                              
066000*77 WS-VAL-FEC                 PIC XX       RECEIVED BY CONTENT.              
066001                                                                              
066002*****************************************************************             
066003* VARIABLES PARA ACEPTAR LA FECHA POR ACCEPT.                                 
066004******************************************************************            
066010 01  FECHA.                                                                   
066012     02 AANO           PIC 9(04).                                             
066014     88 ANOOK VALUE 1989 THRU 2999.                                           
066016     02 MMES           PIC 99.                                                
066018     88 MESOK VALUE 1 THRU 12.                                                
066020     02 DDIA           PIC 99.                                                
066030     88 DIAOK VALUE 1 THRU 31.                                                
067000                                                                              
068000****************************************************************              
069000* VARIABLES ADICIONALES UTILIZADAS PARA PROYECTAR LA FECHA.                   
070000*****************************************************************             
070100 01  WKS-PARAM100                PIC 9(10).                                   
070200 01  RD-WKS-PARAM100             REDEFINES  WKS-PARAM100.                     
071000     02 WS-FEC-CALCULADA-AMD     PIC 9(08).                                   
072000     02 WS-FEC-CAL-AMD REDEFINES WS-FEC-CALCULADA-AMD.                        
073000        04 WS-CALCULADA-AA       PIC 9(04).                                   
074000        04 WS-CALCULADA-MM       PIC 99.                                      
075000        04 WS-CALCULADA-DD       PIC 99.                                      
075100     02 WS-NODO-S                PIC 99.                                      
076000                                                                              
077000 01 WS-FEC-ANTERIOR-AMD                 PIC 9(08).                            
078000 01 WS-FEC-ANT-AMD REDEFINES WS-FEC-ANTERIOR-AMD.                             
079000    02 WS-ANTERIOR-AA                       PIC 9(4).                         
080000    02 WS-ANTERIOR-MM                       PIC 99.                           
081000    02 WS-ANTERIOR-DD                       PIC 99.                           
082000                                                                              
082050 01 WS-FEC-DIAMES                 PIC 9(08).                                  
082100 01 WS-FEC-DIAMES-R REDEFINES WS-FEC-DIAMES.                                  
082150    04 WS-FDM-AAAA                PIC 9(04).                                  
082200    04 WS-FDM-MM                  PIC 9(02).                                  
082250    04 WS-FDM-DD                  PIC 9(02).                                  
082300                                                                              
082350 01 WS-TABLA-NUM-DIAS.                                                        
082400    02 FILLER                   PIC X(12) VALUE "312831303130".               
082450    02 FILLER                   PIC X(12) VALUE "313130313031".               
082500 01 WS-TABLA-NUM-DIAS-R REDEFINES WS-TABLA-NUM-DIAS.                          
082550    02 WS-T-DIAS-X-MES          PIC 9(02) OCCURS 12.                          
082600                                                                              
082700 01 WS-COCIENTE-BI               PIC 9(08).                                   
082800 01 WS-RESIDUO-BI                PIC 9(08).                                   
082810                                                                              
082820 01 WKS-VAL-FEC-RCV         PIC 99.                                           
082830 01 WKS-VAL-FEC-RCV-RD      REDEFINES  WKS-VAL-FEC-RCV.                       
082840    02 WKS-VAL-DANT         PIC 9.                                            
082850    02 WKS-VAL-OPCI         PIC 9.                                            
082900                                                                              
083000******************************************************************            
084000* P R O C E D U R E      D I V I S I O N.                                     
085000******************************************************************            
086000 PROCEDURE DIVISION USING WS-VAL-FEC.                                         
087000                                                                              
088000****************************************************************              
089000****************************************************************              
090000*             R U T I N A          P R I N C I P A L.                         
091000****************************************************************              
092000****************************************************************              
093000                                                                              
094000 00000000-INICIO SECTION.                                                     
095000 00000000-PRINCIPAL.                                                          
095100***  MANEJO DE LA LIB LJ     -ENE-08-                                         
095200     MOVE 2            TO  W77-USO-LIBLJ                                      
095600     MOVE "P100"       TO  WS-0101-PASO-MSG                                   
095700     MOVE "25MTP007"   TO  WS-0101-MTP-MSG                                    
095800                           W77-S000-MY-VERSION                                
095850     MOVE "S500P100"   TO  W77-S000-MY-ID.                                    
095860                                                                              
095865     MOVE ATTRIBUTE HOSTNAME  OF MYSELF TO WKS-MY-HOST.                       
095870     IF WKS-MY-HOST = "ACYPBETA. "                                            
095875        MOVE 1 TO WKS-ES-DES.                                                 
095900***                                                                           
095950     MOVE WS-VAL-F-O TO WKS-VAL-OPCI.                                         
095952     MOVE WS-VAL-F-D TO WKS-VAL-DANT.                                         
095954                                                                              
095960**   IF WKS-ES-DES = 1                                                        
095965**      DISPLAY "WS-VAL-FEC      =" WS-VAL-FEC                                
095966**      DISPLAY "A=OPCION        =" WS-VAL-F-O                                
095967**      DISPLAY "B=DIAS MENOS    =" WS-VAL-F-D                                
095970**      DISPLAY "WKS-VAL-FEC-RCV =" WKS-VAL-FEC-RCV                           
095975**      DISPLAY "A=OPCION        =" WKS-VAL-OPCI                              
095980**      DISPLAY "B=DIAS MENOS    =" WKS-VAL-DANT.                             
095990                                                                              
096000     PERFORM 10000000-LIBRERIAS          THRU 10000000-EXIT.                  
097000     PERFORM 20000000-OPEN               THRU 20000000-EXIT.                  
098000     PERFORM 70000000-CIERRO             THRU 70000000-EXIT.                  
098100                                                                              
098200**   IF WKS-ES-DES = 1                                                        
098300**      DISPLAY "SALIDA    =" WKS-PARAM100                                    
098310**      DISPLAY "FECH/DATO =" WS-FEC-CALCULADA-AMD                            
098320**      DISPLAY "NODO      =" WS-NODO-S.                                      
098400                                                                              
099000     STOP RUN.                                                                
100000                                                                              
101000                                                                              
102000                                                                              
103000                                                                              
104000                                                                              
105000******************************************************************            
106000******************************************************************            
107000*         R U T I N A S  D E   S E L E C C I O N   D E                        
108000*    L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S              
109000*                  P O R   E L   P R O G R A M A.                             
110000******************************************************************            
111000******************************************************************            
112000                                                                              
113000 10000000-LIBRERIAS.                                                          
114000                                                                              
114010******************************************************************            
114020* CHANGE A LA LIBRERIA DE VERSIONES.                                          
114030******************************************************************            
114040     PERFORM 10000100-VERSIONES.                                              
114050                                                                              
115000******************************************************************            
116000* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
117000******************************************************************            
118000     PERFORM 10000006-LOCSUP.                                                 
119000 10000000-EXIT.                                                               
120000    EXIT.                                                                     
121000                                                                              
122000                                                                              
123000                                                                              
124000                                                                              
125000                                                                              
126000                                                                              
127000******************************************************************            
128000******************************************************************            
129000*                             O P E N.                                        
130000*  R U T I N A S   P A R A   A P E R T U R A   D E   B A S E   Y              
131000*                            A R C H I V O S.                                 
132000******************************************************************            
133000******************************************************************            
134000                                                                              
135000 20000000-OPEN.                                                               
135020     IF WKS-ES-DES = 0                                                        
137030        PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT.                     
137040                                                                              
138000     PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT.                        
139000     PERFORM 20002000-FECHA-PRO    THRU 20002000-EXIT.                        
140000 20000000-EXIT.                                                               
141000     EXIT.                                                                    
142000                                                                              
142010******************************************************************            
142020* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
142030******************************************************************            
142040 20000050-CHECO-VER.                                                          
142050     PERFORM 20000100-CHECAME-VERSION.                                        
142060     IF S000-CTR-CVEERROR < 0                                                 
142090        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
142100        PERFORM 70000050-MENSAJE                                              
142110        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
142120 20000050-EXIT.                                                               
142130    EXIT.                                                                     
142140                                                                              
143000******************************************************************            
144000* ABRO LA BASE DE DATOS DE INQUIRY.                                           
144100* SI WS-VAL-FEC = 3 DA LA FECHA DE LA BASE S500BD04TARJETAS                   
145000******************************************************************            
146000 20001000-ABRO-BASE.                                                          
146100     IF WKS-VAL-OPCI = 3                                                      
146110    AND WKS-VAL-DANT = 0                                                      
146200        PERFORM 20001200-ABRE-BD04 THRU 20001200-EXIT                         
146300     ELSE                                                                     
146350        PERFORM 20001100-ABRE-BD01 THRU 20001100-EXIT.                        
146400                                                                              
146450 20001000-EXIT.                                                               
146500    EXIT.                                                                     
146600                                                                              
146650 20001100-ABRE-BD01.                                                          
147000     OPEN INQUIRY S500BD01CAPTACION                                           
148000     ON EXCEPTION                                                             
151000        MOVE "ERROR AL ABRIR BASE BD01 "    TO WS-0101-TEXT-MSG               
152000        PERFORM 70000050-MENSAJE                                              
153000        CALL SYSTEM DMTERMINATE.                                              
154000                                                                              
155000    SET S500B02CONTROL        TO BEGINNING.                                   
156000 20001100-EXIT.                                                               
157000    EXIT.                                                                     
158000                                                                              
158050 20001200-ABRE-BD04.                                                          
158100     OPEN INQUIRY S500BD04TARJETAS                                            
158150     ON EXCEPTION                                                             
158300        MOVE "ERROR AL ABRIR BASE BD04 "    TO WS-0101-TEXT-MSG               
158350        PERFORM 70000050-MENSAJE                                              
158400        CALL SYSTEM DMTERMINATE.                                              
158450                                                                              
158500    SET S500B01PCONTROL       TO BEGINNING.                                   
158550                                                                              
158600 20001200-EXIT.                                                               
158650    EXIT.                                                                     
158700                                                                              
159000******************************************************************            
160000* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
161000******************************************************************            
162000 20002000-FECHA-PRO.                                                          
162100     IF WKS-VAL-OPCI = 3                                                      
162120        IF WKS-VAL-DANT = 0                                                   
162200           PERFORM 20002500-FECHA-BD04 THRU 20002500-EXIT                     
162210        ELSE                                                                  
162220           PERFORM 20002010-FECHA-BD01 THRU 20002010-EXIT                     
162300     ELSE                                                                     
162400        PERFORM 20002010-FECHA-BD01 THRU 20002010-EXIT.                       
162500                                                                              
162600 20002000-EXIT.                                                               
162700    EXIT.                                                                     
162800                                                                              
162900 20002010-FECHA-BD01.                                                         
163000  PERFORM 90000002-B02CONTROL-FIND                                            
164000  IF WS-STATUS-BASE > 0                                                       
165000    IF WS-STATUS-BASE = 1                                                     
168000       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
169000       PERFORM 70000050-MENSAJE                                               
170000       CALL SYSTEM DMTERMINATE                                                
171000    ELSE                                                                      
174000       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
175000       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
176000       PERFORM 70000050-MENSAJE                                               
176005       CALL SYSTEM DMTERMINATE.                                               
176010                                                                              
176015****  Opcion "31" ***                                                         
176020     IF WKS-VAL-OPCI = 3 AND WKS-VAL-DANT = 1                                 
176025        MOVE ZEROS              TO WKS-PARAM100                               
176030        MOVE B02-USO-FUTURO-05  TO WS-NODO-S                                  
176035        SET MYSELF (TASKVALUE)  TO WKS-PARAM100                               
176040     ELSE                                                                     
177006****   Opcion Invalida regresa fecha de linea ***                             
177010     IF (WKS-VAL-OPCI > 0 AND WKS-VAL-DANT > 0)                               
177012     OR (WKS-VAL-OPCI = 3 AND WKS-VAL-DANT > 1)                               
177020        PERFORM 20002600-FEC-LINEA     THRU  20002600-EXIT                    
177025        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
177026**      IF WKS-ES-DES = 1                                                     
177027**         DISPLAY "OPCION INVALIDA  REGRESA FECHA DE LINEA"                  
177028**      ELSE                                                                  
177029**         NEXT SENTENCE                                                      
177030     ELSE                                                                     
177037****    OPCION DE "01" A "09" ***                                             
177038     IF (WKS-VAL-OPCI = 0 AND WKS-VAL-DANT > 0)                               
177039        PERFORM 20002200-PROY-FEC      THRU  20002200-EXIT                    
177040        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
177041     ELSE                                                                     
177051****  Opcion "9" o "90" ***                                                   
177075     IF WKS-VAL-OPCI = 9                                                      
177080         MOVE ZEROS              TO  WKS-PARAM100                             
177085         MOVE B02-ACT-TELETON    TO  WS-FEC-CALCULADA-AMD                     
177090         MOVE B02-NUM-CSI        TO  WS-NODO-S                                
177095         SET MYSELF (TASKVALUE)  TO WKS-PARAM100                              
178000     ELSE                                                                     
178005****  Opcion "5" o "50" ***                                                   
178010     IF WKS-VAL-OPCI = 5                                                      
179000        PERFORM 20002100-PIDO-FECHA THRU 20002100-EXIT                        
179002                UNTIL WS-1VEZ = 1                                             
179004        PERFORM 20002200-PROY-FEC THRU 20002200-EXIT                          
179006        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
179010     ELSE                                                                     
179012****  Opcion "6" o "60" ***                                                   
179015     IF WKS-VAL-OPCI = 6                                                      
179110        PERFORM 20002300-FEC-ULTDIAMES THRU  20002300-EXIT                    
179210        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
179310     ELSE                                                                     
179312****  Opcion "7" o "70" ***                                                   
179315     IF WKS-VAL-OPCI = 7                                                      
179410        PERFORM 20002400-FEC-1ERDIAMES THRU  20002400-EXIT                    
179510        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
179610     ELSE                                                                     
179612****  Opcion "8" o "80" ***                                                   
179615     IF WKS-VAL-OPCI = 8                                                      
179620        PERFORM 20002600-FEC-LINEA     THRU  20002600-EXIT                    
179630        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
179640     ELSE                                                                     
179650**** Opciones "1","10","2","20","4","40"   ***                                
179660     IF WKS-VAL-OPCI = 1                                                      
179670     OR WKS-VAL-OPCI = 2                                                      
179680     OR WKS-VAL-OPCI = 4                                                      
179685        PERFORM 20002200-PROY-FEC      THRU  20002200-EXIT                    
179690        SET MYSELF (TASKVALUE)         TO WKS-PARAM100                        
179700     ELSE                                                                     
179980**** Opcion "0" "00"                                                          
180000        PERFORM 20002200-PROY-FEC      THRU  20002200-EXIT                    
180010        SET MYSELF (TASKVALUE)         TO WKS-PARAM100.                       
181000 20002010-EXIT.                                                               
182000    EXIT.                                                                     
183000                                                                              
183010******************************************************************            
183020* SOLICITO LA FECHA CON LA QUE DESEAMOS PROCESAR.                             
183030******************************************************************            
183040 20002100-PIDO-FECHA.                                                         
183060    MOVE   "I"    TO  W77-TIPO-DISP                                           
183110    STRING "DAME FECHA DE PROCESO, "                                          
183130           "FORMATO AAAAMMDD "                                                
183140           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                            
183146    PERFORM 70000050-MENSAJE.                                                 
183148    MOVE   "E"    TO  W77-TIPO-DISP                                           
183150    ACCEPT FECHA.                                                             
183155    IF DIAOK AND MESOK AND ANOOK                                              
183160        MOVE 1 TO WS-1VEZ                                                     
183165    ELSE                                                                      
183175        MOVE   "I"    TO  W77-TIPO-DISP                                       
183180        MOVE "LA FECHA ESTA MAL TECLEADA"  TO WS-0101-TEXT-MSG                
183190        PERFORM 70000050-MENSAJE                                              
183192        MOVE   "E"    TO  W77-TIPO-DISP.                                      
183195 20002100-EXIT.                                                               
183200   EXIT.                                                                      
183210                                                                              
184000******************************************************************            
185000* PROYECTO LA FECHA DE LA BASE UN DIA 0 2 DIAS HACIA ATRAS                    
186000* DEPENDIENDO DEL PARAMETRO DE ENTRADA.                                       
186010* EL PARAMETRO1 ES PROYECTAR UN DIA HACIA ATRAS EL PARAMETRO 2                
186020* EL PROYECTAR 2 DIAS HACIA ATRAS Y EL PARAMETRO 5 ES PASAR LA                
186030* FECHA DEL VALUE DIRECTAMENTE.                                               
187000******************************************************************            
188000 20002200-PROY-FEC.                                                           
188010    MOVE B02-NUM-CSI             TO    WS-NODO-S.                             
201000    MOVE B02-FECHA-LINEA         TO    WS-FEC-CALCULADA-AMD.                  
202000    MOVE B02-FECHA-LINEA         TO    WS-S006-FECHA1                         
204000    MOVE 12                      TO    WS-S006-FORMATO                        
205000    MOVE 15                      TO    WS-S006-FUNCION                        
205002                                                                              
205004    IF WKS-VAL-DANT > 0                                                       
205006       MOVE WKS-VAL-DANT        TO WS-S006-FECHA2                             
205008    ELSE                                                                      
205010    IF WKS-VAL-OPCI = 1                                                       
205020       MOVE 1                    TO    WS-S006-FECHA2                         
205030    ELSE                                                                      
205040       MOVE 2                    TO    WS-S006-FECHA2.                        
206000    PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT.                         
206010    IF WKS-VAL-OPCI = 5                                                       
206020       MOVE FECHA                TO    WS-FEC-CALCULADA-AMD                   
206030    ELSE                                                                      
207000       MOVE WS-S006-FECHA1       TO    WS-FEC-CALCULADA-AMD.                  
210000 20002200-EXIT.                                                               
211000    EXIT.                                                                     
211020                                                                              
211050******************************************************************            
211060* SI EL PARAMETRO = 6, SE REGRESA LA FECHA QUE REPRESENTA EL                  
211070* ULTIMO DIA CALENDARIO DEL MES ANTERIOR A LA FECHA DE LINEA                  
211080******************************************************************            
211100 20002300-FEC-ULTDIAMES.                                                      
211150     MOVE B02-NUM-CSI                     TO WS-NODO-S.                       
211200     MOVE B02-FECHA-LINEA                 TO WS-FEC-CALCULADA-AMD.            
211250     MOVE B02-FECHA-LINEA                 TO WS-FEC-DIAMES.                   
211300     IF WS-FDM-MM = 1                                                         
211350        MOVE 12   TO WS-FDM-MM                                                
211400        SUBTRACT 1 FROM WS-FDM-AAAA                                           
211450     ELSE                                                                     
211500        SUBTRACT 1 FROM WS-FDM-MM.                                            
211550     MOVE WS-T-DIAS-X-MES(WS-FDM-MM)      TO WS-FDM-DD.                       
211600     IF WS-FDM-MM = 2                                                         
211650        DIVIDE WS-FDM-AAAA  BY 4 GIVING WS-COCIENTE-BI                        
211700               REMAINDER WS-RESIDUO-BI                                        
211750        IF WS-RESIDUO-BI = 0                                                  
211800           MOVE 29   TO WS-FDM-DD.                                            
211850     MOVE WS-FEC-DIAMES                   TO WS-FEC-CALCULADA-AMD.            
211900 20002300-EXIT.                                                               
211950     EXIT.                                                                    
211952                                                                              
211954******************************************************************            
211956* SI EL PARAMETRO = 7, SE REGRESA LA FECHA QUE REPRESENTA EL                  
211958* PRIMER DIA CALENDARIO DEL MES DE LA FECHA DE LINEA                          
211960******************************************************************            
211962 20002400-FEC-1ERDIAMES.                                                      
211964     MOVE B02-NUM-CSI             TO WS-NODO-S.                               
211966     MOVE B02-FECHA-LINEA         TO WS-FEC-CALCULADA-AMD.                    
211968     MOVE B02-FECHA-LINEA         TO WS-FEC-DIAMES.                           
211970     MOVE 1                       TO WS-FDM-DD.                               
211972     MOVE WS-FEC-DIAMES           TO WS-FEC-CALCULADA-AMD.                    
211982 20002400-EXIT.                                                               
211992     EXIT.                                                                    
212000                                                                              
212010 20002500-FECHA-BD04.                                                         
212015     PERFORM 90400001-B01PCONTROL-FINDF.                                      
212020     IF WS-STATUS-BASE > 0                                                    
212025        IF WS-STATUS-BASE = 1                                                 
212040          MOVE "NO HAY B01PCONTROL EN BD04 " TO WS-0101-TEXT-MSG              
212045          PERFORM 70000050-MENSAJE                                            
212050          CALL SYSTEM DMTERMINATE                                             
212055        ELSE                                                                  
212070          STRING "ERR FINDF A B01P DE BD04 " , WS-STATUS-BASE                 
212075                 DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                      
212080          PERFORM 70000050-MENSAJE                                            
212085          CALL SYSTEM DMTERMINATE.                                            
212090                                                                              
212095     MOVE B01P-ULT-ARCHAPLI         TO WS-FEC-CALCULADA-AMD.                  
212100     MOVE B01P-NUM-CSI              TO WS-NODO-S.                             
212105     SET MYSELF (TASKVALUE)         TO WKS-PARAM100.                          
212110                                                                              
212115 20002500-EXIT.                                                               
212120    EXIT.                                                                     
212122******************************************************************            
212124* SI EL PARAMETRO = 8, SE REGRESA LA FECHA DE LINEA DE LA BD01                
212126******************************************************************            
212128 20002600-FEC-LINEA.                                                          
212130     MOVE B02-NUM-CSI             TO WS-NODO-S.                               
212132     MOVE B02-FECHA-LINEA         TO WS-FEC-CALCULADA-AMD.                    
212134 20002600-EXIT.                                                               
212136     EXIT.                                                                    
212140*                                                                             
212150* R U T I N A S    D E   L L A M A D O S   A   L I B R E R I A S.             
212160*                                                                             
212170******************************************************************            
212180******************************************************************            
212190                                                                              
212200******************************************************************            
212210* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
212220* DE PROCESO RESTANDOLE UN DIA A LA FECHA QUE YA HABIA SIDO PROY.             
212230******************************************************************            
212240 40000000-CALL-FECPRO.                                                        
212250     PERFORM 20000006-LOCSUP.                                                 
212260     IF WS-S006-FUNCION > 0                                                   
212270        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
212300        STRING "ERROR AL ACCESAR LOCSUP",   WS-MSG-RS                         
212310        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
212320        PERFORM 70000050-MENSAJE                                              
212330        CALL SYSTEM DMTERMINATE.                                              
212340 40000000-EXIT.                                                               
212350     EXIT.                                                                    
212360                                                                              
212370******************************************************************            
213000******************************************************************            
213010******************************************************************            
213020* CIERRO LA BASE Y ARCHIVOS.                                                  
213030******************************************************************            
213040 70000000-CIERRO.                                                             
213050     IF WKS-VAL-OPCI = 3                                                      
213055    AND WKS-VAL-DANT = 0                                                      
213060        PERFORM 70000100-CIERRO-BD04 THRU 70000100-EXIT                       
213070     ELSE                                                                     
213080        PERFORM 70000200-CIERRO-BD01 THRU 70000200-EXIT.                      
213090                                                                              
213100 70000000-EXIT.                                                               
213110     EXIT.                                                                    
213120                                                                              
213130 70000100-CIERRO-BD04.                                                        
213140     CLOSE S500BD04TARJETAS                                                   
213150       ON EXCEPTION                                                           
213180          MOVE "ERROR AL CERRAR BASE BD04 " TO WS-0101-TEXT-MSG               
213190          PERFORM 70000050-MENSAJE                                            
213200          CALL SYSTEM DMTERMINATE.                                            
213210                                                                              
213220 70000100-EXIT.                                                               
213230     EXIT.                                                                    
213240                                                                              
213250 70000200-CIERRO-BD01.                                                        
213270       CLOSE  S500BD01CAPTACION                                               
213275        ON EXCEPTION                                                          
213300        MOVE "ERROR AL CERRAR LA BASE"    TO WS-0101-TEXT-MSG                 
213310        PERFORM 70000050-MENSAJE                                              
213320        CALL SYSTEM DMTERMINATE.                                              
213330 70000200-EXIT.                                                               
213340     EXIT.                                                                    
213350                                                                              
213360                                                                              
213370                                                                              
213380                                                                              
213390                                                                              
213400******************************************************************            
213410*    R U T I N A S   D E   D E S P L I E G U E   D E   M S G.                 
213420*        P A R A   L A   P R I M E R A   S E C T I O N.                       
213430******************************************************************            
213440                                                                              
213450                                                                              
213460                                                                              
213470                                                                              
213480                                                                              
213490                                                                              
213500******************************************************************            
213510* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
213520******************************************************************            
213530 COPY "S500/INC/PRO/25MTP005".                                                
