000200$SET LIST$                                                                    
000400$SUPRESS                                                                      
000800$SET ERRORLIST                                                                
001000***$SET TADS                                                                  
001200$SET LIST STACK  LINEINFO FREE                                                
001400$ERRORLIMIT = 4                                                               
001600*****************************************************************             
001800*        PARA INCLUDE DE BASE DE DATOS                          *             
002000*****************************************************************             
002200                                                                              
002400$SET BDB00R21 BDB02R01 BDB05R02 BDB03R12 BDB06R08 BDB00R01                    
002600$SET BDB00R02 BDB03R08 BDB44R08                                               
002800                                                                              
003000*****************************************************************             
003200*        PARA INCLUDE MANEJO DE LIBRERIAS                       *             
003400*****************************************************************             
003600                                                                              
003800$SET S000LIBLJ S100VERSIONES S006LOCSUP    HOSTNAME    S080L700               
003900$SET S080DATOS S080IVA       S080CATALOGOS S080L100                           
004000$SET LIBMAPLI  LIBMAPLIDISP                                                   
004200                                                                              
004400$RESET LIST$                                                                  
004600*****************************************************************             
004800* P109  P109  P109  P109  P109  P109  P109  P109  P109  P109    *             
005000*****************************************************************             
005200* FUNCIONES PRINCIPALES:                                        *             
005400*   LEER Y PROCESAR LOS REGISTROS DE LOS ARCHIVOS ENVIADOS POR  *             
005600*   GBNP CON LAS TASAS PARA PAGOS DE RENDIMIENTOS .             *             
005800*   GENERAR REPORTE CON LAS TASAS DE PAGOS DE RENDIMIENTOS DE   *             
006000*   LOS 3 ARCHIVOS LEIDOS DE GBNP .                             *             
006200*                                                               *             
006400*****************************************************************             
006600 IDENTIFICATION DIVISION.                                                     
006800*****************************************************************             
007000 PROGRAM-ID.    P109      .                                                   
007200 AUTHOR.        IH39699   .                                                   
007400 DATE-WRITTEN.  AGOS/2021 .                                                   
007600 INSTALLATION.                                                                
007800 SECURITY.                                                                    
008000*****************************************************************             
008200 ENVIRONMENT DIVISION.                                                        
008400*****************************************************************             
008600 CONFIGURATION SECTION.                                                       
008800 SOURCE-COMPUTER.   SERIES-A.                                                 
009000 OBJECT-COMPUTER.   SERIES-A.                                                 
009200 INPUT-OUTPUT  SECTION.                                                       
009400 FILE-CONTROL.                                                                
009600                                                                              
009800    SELECT I01-ARCHGBNP   ASSIGN TO DISK   .                                  
010000    SELECT I02-ARCHRSLT   ASSIGN TO DISK   .                                  
010200    SELECT I03-CTRL       ASSIGN TO DISK                                      
010400                             ORGANIZATION IS SEQUENTIAL                       
010600                             ACCESS MODE  IS RANDOM                           
010800                             ACTUAL KEY   IS WS-I03-CTRL-LLAVE .              
011000    SELECT P01-REPOTASA   ASSIGN TO PRINTER .                                 
011200    SELECT P02-REPMENSA   ASSIGN TO PRINTER .                                 
011400    SELECT S01-ARCHRSLT   ASSIGN TO SORT    .                                 
011600                                                                              
011800*****************************************************************             
012000 DATA DIVISION.                                                               
012200*****************************************************************             
012400 FILE SECTION.                                                                
012600                                                                              
012800*****************************************************************             
013000* DISK                                                          *             
013200*****************************************************************             
013400                                                                              
013600*****************************************************************             
013800*  LAYOUT DE GBNP                                               *             
014000*****************************************************************             
014200                                                                              
014400  FD I01-ARCHGBNP                                                             
014600     VALUE OF DEPENDENTSPECS IS TRUE .                                        
014800  01 I01-R-ARCHGBNP .                                                         
015000     02 I01-TASA-IND           PIC X(07)        .                             
015200     02 I01-TASA-CODE          PIC X(04)        .                             
015300     02 I01-TASA-TILDE1        PIC X(01)        .                             
015400     02 I01-TASA-CTA           PIC X(20)        .                             
015600     02 I01-TASA-SUC-CTA REDEFINES I01-TASA-CTA .                             
015800        03 I01-TASA-SPACE      PIC 9(04)        .                             
016000        03 I01-TASA-SUC        PIC 9(04)        .                             
016200        03 I01-TASA-CTO        PIC 9(12)        .                             
016400     02 I01-TASA-ACCPR         PIC X(07)        .                             
016600     02 I01-TASA-PROD          PIC X(04)        .                             
016800     02 I01-TASA-ACCEFF        PIC X(10)        .                             
017000     02 I01-TASA-FEC           PIC 9(08)        .                             
017200     02 I01-TASA-ACCUDE        PIC X(08)        .                             
017400     02 I01-TASA-UDE           PIC X(15)        .                             
017500     02 I01-TASA-TILDE2        PIC X(01)        .                             
017600     02 I01-TASA-TASA          PIC X(24)        .                             
017800     02 I01-TASA-RCODE         PIC X(10)        .                             
018000     02 FILLER                 PIC X(153)       .                             
018200                                                                              
018400*****************************************************************             
018600*  LAYOUT DE GBNPRSLT                                           *             
018800*****************************************************************             
019000                                                                              
019200  FD I02-ARCHRSLT                                                             
019400     BLOCK   CONTAINS   45 RECORDS                                            
019600     RECORD  CONTAINS   120 CHARACTERS                                        
019800     VALUE OF                                                                 
020000            AREASIZE     IS 3000                                              
020200            SECURITYTYPE IS PUBLIC                                            
020400            PROTECTION   IS PROTECTED                                         
020600            SAVEFACTOR   IS 99 .                                              
020800  01 I02-R-ARCHRSLT .                                                         
021000     02 I02-RSLT-REC-TYPE      PIC 9(02)  .                                   
021200     02 I02-RSLT-BRANCH        PIC 9(04)  .                                   
021400     02 I02-RSLT-CTO           PIC 9(12)  .                                   
021600     02 I02-RSLT-SEQ           PIC 9(02)  .                                   
021800        88 I02-88-RSLT-SEC1    VALUE 1    .                                   
022000        88 I02-88-RSLT-SEC2    VALUE 2    .                                   
022200        88 I02-88-RSLT-SEC3    VALUE 3    .                                   
022400     02 I02-RSLT-RATE          PIC 9(10)  .                                   
022600     02 I02-RSLT-INT-T         PIC 9(02)  .                                   
022800        88 I02-88-RSLT-MES        VALUE 0 .                                   
023000        88 I02-88-RSLT-DIA        VALUE 1 .                                   
023200     02 I02-RSLT-ERR-CODE      PIC 9(04)  .                                   
023400     02 I02-RSLT-PROD          PIC 9(04)  .                                   
023600     02 I02-RSLT-INST          PIC 9(04)  .                                   
023800     02 I02-RSLT-CURR          PIC 9(02)  .                                   
024000     02 I02-RSLT-RATE-U        PIC 9(10)  .                                   
024200     02 I02-RSLT-REND-N        PIC 9(16)  .                                   
024400     02 I02-RSLT-PAGO-S        PIC 9(02)  .                                   
024600     02 I02-RSLT-FECH-S        PIC 9(08)  .                                   
024800     02 I02-RSLT-FILLER        PIC X(44)  .                                   
025000                                                                              
025200*****************************************************************             
025400*  LAYOUT DE CONTROL                                            *             
025600*****************************************************************             
025800                                                                              
026000  FD I03-CTRL                                                                 
026200     BLOCK   CONTAINS   50 RECORDS                                            
026400     VALUE OF                                                                 
026600            PROTECTION   IS PROTECTED                                         
026800            SAVEFACTOR   IS 99 .                                              
027000  01 I03-R-CTRL .                                                             
027200     02 I03-CTRL-SEC       PIC 9(02)   .                                      
027400        88 WS-88-PROCE1       VALUE 1  .                                      
027600        88 WS-88-PROCE2       VALUE 2  .                                      
027800        88 WS-88-PROCE3       VALUE 3  .                                      
028000        88 WS-88-PROCE4       VALUE 4  .                                      
028200        88 WS-88-PROCE5       VALUE 5  .                                      
028400     02 I03-CTRL-NUM-REG   PIC 9(10)   .                                      
028600     02 I03-CTRL-CTO       PIC 9(12)   .                                      
028800     02 I03-CTRL-FILLER    PIC X(26)   .                                      
029000                                                                              
029200*****************************************************************             
029400* SORT                                                          *             
029600*****************************************************************             
029800  SD S01-ARCHRSLT .                                                           
030000  01 S01-R-ARCHRSLT .                                                         
030200     02 S01-RSLT-REC-TYPE      PIC 9(02)  .                                   
030400     02 S01-RSLT-BRANCH        PIC 9(04)  .                                   
030600     02 S01-RSLT-CTO           PIC 9(12)  .                                   
030800     02 S01-RSLT-SEQ           PIC 9(02)  .                                   
031000     02 S01-RSLT-RATE          PIC 9(10)  .                                   
031200     02 S01-RSLT-INT-T         PIC 9(02)  .                                   
031400     02 S01-RSLT-ERR-CODE      PIC 9(04)  .                                   
031600     02 S01-RSLT-PROD          PIC 9(04)  .                                   
031800     02 S01-RSLT-INST          PIC 9(04)  .                                   
032000     02 S01-RSLT-CURR          PIC 9(02)  .                                   
032200     02 S01-RSLT-RATE-U        PIC 9(10)  .                                   
032400     02 S01-RSLT-REND-N        PIC 9(16)  .                                   
032600     02 S01-RSLT-PAGO-S        PIC 9(02)  .                                   
032800     02 S01-RSLT-FECH-S        PIC 9(08)  .                                   
033000     02 FILLER                 PIC X(44)  .                                   
033200                                                                              
033400                                                                              
033600*****************************************************************             
033800* PRINTER                                                       *             
034000*****************************************************************             
034200                                                                              
034400 FD P01-REPOTASA                                                              
034600    RECORD CONTAINS 132 CHARACTERS .                                          
034800 01 P01-R-REPOTASA           PIC X(132) .                                     
035000                                                                              
035200 FD P02-REPMENSA                                                              
035400    RECORD CONTAINS 132 CHARACTERS .                                          
035600 01 P02-R-REPMENSA           PIC X(132) .                                     
035800                                                                              
036000*****************************************************************             
036200 DATA-BASE SECTION.                                                           
036400                                                                              
036600 DB S500BD01CAPTACION   .                                                     
036800    01 S500B00CTRLPASO  .                                                     
037000    01 S500B02CONTROL   .                                                     
037200    01 S500B03CONTRATOS .                                                     
037400    01 S500B05INSTRUMEN .                                                     
037600    01 S500B06HISTORICO .                                                     
037800    01 S500B44CTOSEVOL  .                                                     
038000    01 S500B91REINICIO  .                                                     
038200                                                                              
038400*****************************************************************             
038600 WORKING-STORAGE SECTION.                                                     
038800                                                                              
039000*****************************************************************             
039200*                 AREA DE COPY´S                                *             
039400*****************************************************************             
039600                                                                              
039800  COPY "S500/INC/WOR/25MTP002"     .                                          
040000  COPY "S500/INC/WOR/DAS/25MTP003" .                                          
040200  COPY "S500/INC/MAPLI/WOR/15MTP001".                                         
040400                                                                              
040600*****************************************************************             
040800*  PARAMETRO                                                    *             
041000*****************************************************************             
041200                                                                              
041400 01 WS-PARAM-VALUE             PIC X(02)       .                              
041600 01 WS-PARAM-VALUE-R REDEFINES WS-PARAM-VALUE  .                              
041800    02 WS-PARAM-VALUE-N        PIC 9(02)       .                              
042000       88 WS-88-P-VAL-OK       VALUE 01 THRU 03.                              
042200       88 WS-88-P-VAL-ARCH     VALUE 01 THRU 02.                              
042400       88 WS-88-P-VAL-SEC12    VALUE 01        .                              
042600       88 WS-88-P-VAL-SEC3     VALUE 02        .                              
042800       88 WS-88-P-VAL-P168     VALUE 03        .                              
043000                                                                              
043200*****************************************************************             
043400*  VARIABLES BASE DE DATOS                                      *             
043600*****************************************************************             
043800                                                                              
044000 01 WS-ABRE-BD                PIC 9(01) VALUE 0.                              
044200    88 WS-88-OPEN-BD              VALUE 1       .                             
044400                                                                              
044600*****************************************************************             
044800*  VARIABLES MAPLI                                             *              
045000*****************************************************************             
045200                                                                              
045400 01 WS-OPCION-MAPLI            PIC 9(01)        .                             
045600    88 WS-88-MAP-BUSCA            VALUE 1       .                             
045800    88 WS-88-MAP-ACTUA            VALUE 2       .                             
046000    88 WS-88-MAP-GENRE            VALUE 3       .                             
046200                                                                              
046400 77 W77-ERR-L035-MAPLI         PIC 9(02) COMP       .                         
046600 77 W77-ERR-DATO-MAPLI         PIC X(30) VALUE " "  .                         
046800                                                                              
047000*****************************************************************             
047200*  VARIABLES GLOBALES                                           *             
047400*****************************************************************             
047600                                                                              
047800 01 WS-PROCESO                 PIC 9(01)    .                                 
048000    88 WS-88-PROC-FIN             VALUE 1   .                                 
048200 01 WS-RECIBE-BAJA             PIC 9(01)    .                                 
048400    88 WS-88-NO-BAJA              VALUE 0   .                                 
048600    88 WS-88-SI-BAJA              VALUE 1   .                                 
048800 01 WS-ENVIO-RSLT              PIC 9(01)    .                                 
049000    88 WS-88-ENVIO-RSLT           VALUE 1   .                                 
049200 01 WS-1ERAVEZ                 PIC 9(01)    .                                 
049400    88 WS-88-1ERA                 VALUE 0   .                                 
049600 01 WS-ES-PRUEBA               PIC 9(01)    .                                 
049800    88 WS-88-ESPRUEBA             VALUE 1   .                                 
050000                                                                              
050200 01 WS-NUM-P109                PIC X(04)  VALUE "P109"    .                   
050400 01 WS-NUM-MTP                 PIC X(08)  VALUE "25MTP004".                   
050600                                                                              
050800 01 WS-FECHAS-MSG.                                                            
051000    02 WS-MSG-A-1              PIC X(12)    .                                 
051200    02 WS-MSG-A-2              PIC X(12)    .                                 
051400    02 WS-MSG-A-3              PIC X(12)    .                                 
051600                                                                              
051800 01 WS-ERR-CODE                PIC 9(04)    .                                 
052000                                                                              
052200 01 WS-TABLA-LIBS-USED.                                                       
052400    02 WS-NAME-LIB-S080L700    PIC X(72)    .                                 
052600    02 WS-NAME-LIB-S038MAPLI   PIC X(72)    .                                 
052700    02 WS-NAME-LIB-S080IVAS    PIC X(72)    .                                 
052800                                                                              
053000 01 WS-FECHA-PROY              PIC  9(08)   .                                 
053200 01 WS-FECHA                   PIC  9(08)   .                                 
053400 01 WS-FECHA-R1 REDEFINES WS-FECHA          .                                 
053600    02 WS-FECHA1-AA            PIC  9(02)   .                                 
053800    02 WS-FECHA1-AMD           PIC  9(06)   .                                 
054000 01 WS-FECHA-R2 REDEFINES WS-FECHA          .                                 
054200    02 WS-FECHA2-AAAA          PIC  9(04)   .                                 
054400    02 WS-FECHA2-MM            PIC  9(02)   .                                 
054600    02 WS-FECHA2-DD            PIC  9(02)   .                                 
054800 01 WS-FECHA-AAAAMMDD                       .                                 
055000    02 WS-FECHA3-AAAA          PIC  9(04)   .                                 
055200    02 WS-FECHA3-DIA1          PIC  X(01) VALUE "/".                          
055400    02 WS-FECHA3-MM            PIC  9(02)   .                                 
055600    02 WS-FECHA3-DIA2          PIC  X(01) VALUE "/".                          
055800    02 WS-FECHA3-DD            PIC  9(02)   .                                 
056000 01 WS-FECHA-DDMMAAAA                       .                                 
056200    02 WS-FECHA4-DD            PIC  9(02)   .                                 
056400    02 WS-FECHA4-DIA1          PIC  X(01) VALUE "/".                          
056600    02 WS-FECHA4-MM            PIC  X(03)   .                                 
056800    02 WS-FECHA4-DIA2          PIC  X(01) VALUE "/".                          
057000    02 WS-FECHA4-AAAA          PIC  9(04)   .                                 
057200 01 WS-HORA-HHMMSS                          .                                 
057400    02 WS-HORA1-HH             PIC  9(02)   .                                 
057600    02 WS-HORA1-DOS1           PIC  X(01) VALUE ":".                          
057800    02 WS-HORA1-MM             PIC  9(02)   .                                 
058000    02 WS-HORA1-DOS2           PIC  X(01) VALUE ":".                          
058200    02 WS-HORA1-SS             PIC  9(02)   .                                 
058400 01 WS-HORA-HHMMSSCC                        .                                 
058600    02 WS-HORA2-HH             PIC  9(02)   .                                 
058800    02 WS-HORA2-DOS1           PIC  X(01) VALUE ":".                          
059000    02 WS-HORA2-MM             PIC  9(02)   .                                 
059200    02 WS-HORA2-DOS2           PIC  X(01) VALUE ":".                          
059400    02 WS-HORA2-SS             PIC  9(02)   .                                 
059600    02 WS-HORA2-DOS3           PIC  X(01) VALUE ":".                          
059800    02 WS-HORA2-CC             PIC  9(02)   .                                 
060000 01 WS-HORA-MAQ                PIC  9(08)   .                                 
060200 01 WS-HORA-MAQ-R  REDEFINES WS-HORA-MAQ    .                                 
060400    02 WS-HORA-MAQ-HH          PIC  9(02)   .                                 
060600    02 WS-HORA-MAQ-MM          PIC  9(02)   .                                 
060800    02 WS-HORA-MAQ-SS          PIC  9(02)   .                                 
061000    02 WS-HORA-MAQ-CC          PIC  9(02)   .                                 
061200 01 WS-HORA-MAQ-ANT            PIC  9(08)   .                                 
061400 01 WS-HORA-MAQA-R REDEFINES WS-HORA-MAQ-ANT.                                 
061600    02 WS-HORA-MAQA-HH         PIC  9(02)   .                                 
061800    02 WS-HORA-MAQA-MM         PIC  9(02)   .                                 
062000    02 WS-HORA-MAQA-SS         PIC  9(02)   .                                 
062200    02 WS-HORA-MAQA-CC         PIC  9(02)   .                                 
062400 01 WS-HORA-DIF                PIC S9(04)   .                                 
062600 01 WS-HORA-SEG                PIC  9(12)   .                                 
062800 01 WS-HORA-SEG-ANT            PIC  9(12)   .                                 
063000                                                                              
063200 01 WS-N-HOJA-P01              PIC  9(04)         .                           
063400 01 WS-O-PAG-P01               PIC  9(01)         .                           
063600    88 WS-88-N-PAG-P01              VALUE 1       .                           
063800 01 WS-L-PAG-P01               PIC  9(04) VALUE 50.                           
064000 01 WS-L-PAG-TEM-P01           PIC  9(02)         .                           
064200                                                                              
064400 01 WS-N-HOJA-P02              PIC  9(04)         .                           
064600 01 WS-O-PAG-P02               PIC  9(01)         .                           
064800    88 WS-88-N-PAG-P02              VALUE 1       .                           
065000 01 WS-L-PAG-P02               PIC  9(04) VALUE 50.                           
065200 01 WS-L-PAG-TEM-P02           PIC  9(02)         .                           
065400                                                                              
065600 01 WS-FIN-B05                 PIC 9(01)       .                              
065800 01 WS-B05-TB-INDEX            PIC 9(02)       .                              
066000 01 WS-B05-TB-INDP             PIC 9(02)       .                              
066200    88 WS-88-B05-NOP              VALUE 0      .                              
066400    88 WS-88-B05-SIP              VALUE 1      .                              
066600 01 WS-B05-TB-DIME             PIC 9(02)       .                              
066800    88 WS-88-B05-MEN              VALUE 0      .                              
067000    88 WS-88-B05-DIA              VALUE 1      .                              
067200                                                                              
067400 01 WS-I01-VARIABLES.                                                         
067600    02 WS-I01-REG-LEIDO        PIC 9(12)       .                              
067800    02 WS-I01-LASTREC          PIC 9(12)       .                              
068000    02 WS-I01-FIN-ARCH         PIC 9(01)       .                              
068200       88 WS-88-CON-ARCH01        VALUE 0      .                              
068400       88 WS-88-FIN-ARCH01        VALUE 1      .                              
068600                                                                              
068800 01 WS-I02-VARIABLES.                                                         
069000    02 WS-I02-FIN-ARCH         PIC 9(01)      .                               
069200       88 WS-88-CON-ARCH02        VALUE 0     .                               
069400       88 WS-88-FIN-ARCH02        VALUE 1     .                               
069600    02 WS-I02-ERR-CODE         PIC 9(04)      .                               
069800       88 WS-88-ERR-CODE-OK       VALUE 0     .                               
070000       88 WS-88-ERR-CODE-NOK      VALUE 1001 THRU 1012 .                      
070200    02 WS-I02-RSLT-CTO-ANT     PIC 9(12)      .                               
070400    02 WS-I02-RSLT-PROD-ANT    PIC 9(04)      .                               
070600    02 WS-I02-RSLT-INST-ANT    PIC 9(04)      .                               
070800    02 WS-I02-RSLT-CURR-ANT    PIC 9(02)      .                               
071000    02 WS-I02-RATE             PIC 9(10)      .                               
071200    02 WS-I02-RATE-U           PIC 9(10)      .                               
071400    02 WS-I02-RATE-U-R REDEFINES WS-I02-RATE-U.                               
071600       03 WS-I02-RATE-B06      PIC 9(04)V999  .                               
071800       03 WS-I02-RATE-FIL      PIC 9(03)      .                               
072000    02 WS-I02-REND-N           PIC 9(16)      .                               
072200    02 WS-I02-REND-R REDEFINES WS-I02-REND-N  .                               
072400       03 WS-I02-REND-B03      PIC 9(14)V99   .                               
072600    02 WS-I02-PASO-S           PIC 9(02)      .                               
072700    02 WS-I02-FECH-S           PIC 9(08)      .                               
072800    02 WS-I02-REG-ESCRI        PIC 9(12)      .                               
073000    02 WS-I02-LASTREC          PIC S9(12)     .                               
073200                                                                              
073400 01 WS-P01-VARIABLES                          .                               
073600    02 WS-P01-TOT-RENDI        PIC 9(15)V99   .                               
073800                                                                              
074000 01 WS-WAIT-EVENTO             PIC 9(02)      .                               
074200 01 WS-MPD-CALLS-VA            PIC 9(01) COMP .                               
074400    88 WS-88-MPD-CALLS            VALUE 1     .                               
074600                                                                              
074800 01 WS-ARCHGBNP-BUS            PIC 9(01)      .                               
075000    88 WS-88-FINBUS               VALUE 1     .                               
075200 01 WS-ARCHGBNP-RES            PIC 9(01)      .                               
075400    88 WS-88-NOEXI                VALUE 0     .                               
075600    88 WS-88-SIEXI                VALUE 1     .                               
075800                                                                              
076000 01 WS-EVE-REALIZA             PIC 9(01)         .                            
076100    88 WS-88-EVE-TERMI            VALUE 1 THRU 3 .                            
076200    88 WS-88-EVE-CONTI            VALUE 0        .                            
076400    88 WS-88-EVE-FINAL            VALUE 1        .                            
076600    88 WS-88-EVE-GENRE            VALUE 2        .                            
076700    88 WS-88-EVE-EJ130            VALUE 3        .                            
076800                                                                              
077000 01 WS-VARIABLES-HI                           .                               
077200    02 WS-HI-NUMHI             PIC 9(02)      .                               
077400       88 WS-88-ESTADIST          VALUE 1     .                               
077600       88 WS-88-BAJA              VALUE 4     .                               
077800    02 WS-SECS-OPCION          PIC 9(02)      .                               
078000       88 WS-88-LECTURA           VALUE 1     .                               
078200       88 WS-88-ESCRITU           VALUE 2     .                               
078400       88 WS-88-ACTUALI           VALUE 3     .                               
078600       88 WS-88-ERROR             VALUE 4     .                               
078800       88 WS-88-RESIDEN           VALUE 5     .                               
078805       88 WS-88-EXTE              VALUE 6     .                               
079000    02 WS-SEC1-REC             PIC 9(01)      .                               
079200    02 WS-SEC2-REC             PIC 9(01)      .                               
079400    02 WS-SEC3-REC             PIC 9(01)      .                               
079600    02 WS-SEC1-REG-LE          PIC 9(12)      .                               
079800    02 WS-SEC1-REG-ES          PIC 9(12)      .                               
080000    02 WS-SEC1-REG-AC          PIC 9(12)      .                               
080200    02 WS-SEC1-REG-ER          PIC 9(12)      .                               
080205    02 WS-SEC1-REG-EX          PIC 9(12)      .                               
080400    02 WS-SEC2-REG-LE          PIC 9(12)      .                               
080600    02 WS-SEC2-REG-ES          PIC 9(12)      .                               
080800    02 WS-SEC2-REG-AC          PIC 9(12)      .                               
081000    02 WS-SEC2-REG-ER          PIC 9(12)      .                               
081005    02 WS-SEC2-REG-EX          PIC 9(12)      .                               
081200    02 WS-SEC3-REG-LE          PIC 9(12)      .                               
081400    02 WS-SEC3-REG-ES          PIC 9(12)      .                               
081600    02 WS-SEC3-REG-AC          PIC 9(12)      .                               
081800    02 WS-SEC3-REG-ER          PIC 9(12)      .                               
081805    02 WS-SEC3-REG-EX          PIC 9(12)      .                               
082000    02 WS-SEC3-REG-TO          PIC 9(12)      .                               
082200    02 WS-SEC3-REG-TE          PIC 9(12)      .                               
097400                                                                              
097600 01 WS-TASA-ENT                        PIC 9(04)      .                       
097800 01 WS-TASA-DEC                        PIC 9(06)      .                       
098000 01 WS-TASA-CONV                       PIC 9(04)V9(06).                       
098200*01 WS-TASA-CONV-R1 REDEFINES  WS-TASA-CONV           .                       
098400*   02 WS-TASA-CONV-A                  PIC X(10)      .                       
098600 01 WS-TASA-CONV-R2 REDEFINES  WS-TASA-CONV           .                       
098800    02 WS-TASA-CONV-N                  PIC 9(10)      .                       
099000 01 WS-P-POINTER                       PIC 9(10)      .                       
099200 01 WS-C-POINTER                       PIC 9(10)      .                       
099400*01 WS-B-TASASEC                       PIC 9(12)V99   .                       
099600*01 WS-B-TASASEC-R1 REDEFINES WS-B-TASASEC            .                       
099800*   02 WS-B-TASASEC-A                  PIC X(12)      .                       
100000*   02 WS-B-DECIMA                     PIC 9(02)      .                       
100200*01 WS-B-TASASEC-R2 REDEFINES WS-B-TASASEC            .                       
100400*   02 WS-B-TASA                       PIC 9(10)      .                       
100600*   02 WS-B-SEC                        PIC 9(02)      .                       
100800*   02 WS-B-DECIMA2                    PIC 9(02)      .                       
101000                                                                              
101200 77 WS-FRAMESIZE                       PIC 9(02)   COMP .                     
101400 77 WS-LASTRECORD                      PIC 9(12)   COMP .                     
101600 77 WS-MAXRECSIZE                      PIC 9(12)   COMP .                     
101800 77 WS-DISK-SIZE                       PIC 9(18)   COMP .                     
102000 77 WS-MEMORY-SIZE                     PIC 9(18)   COMP .                     
102200 77 WS-MEMORY-65K                      PIC 9(18)   COMP .                     
102400 01 WS-CALC-WORD                       PIC 9(12)V99     .                     
102600 01 WS-CALC-WORD-RED  REDEFINES WS-CALC-WORD            .                     
102800    02 WS-WORD-ENT                     PIC 9(012)       .                     
103000    02 WS-WORD-RES                     PIC 9(002)       .                     
103200 01 WS-I03-CTRL-LLAVE                  PIC 9(01)        .                     
103400 01 WKS-CTO-CLO                        PIC 9(01)        .                     
103600*****************************************************************             
103800*  CARATULAS ARCHIVOS                                           *             
104000*****************************************************************             
104200                                                                              
104400 01 I01-TIT-ARCHGBNP.                                                         
104600    02 FILLER             PIC X(15) VALUE "S500/FILE/INTE/".                  
104800    02 FILLER             PIC X(08) VALUE "50025E01"       .                  
105000    02 FILLER             PIC X(01) VALUE "/"              .                  
105200    02 I02-TIT-ARCT-CSI   PIC 9(02)                        .                  
105400    02 FILLER             PIC X(01) VALUE "/"              .                  
105600    02 I02-TIT-ARCT-FEC   PIC 9(08)                        .                  
105800    02 FILLER             PIC X(09) VALUE "/GBNPTASA"      .                  
106000    02 FILLER             PIC X(01) VALUE "/"              .                  
106200    02 I02-TIT-ARCT-SEC   PIC 9(04)                        .                  
106400    02 FILLER             PIC X(15) VALUE " ON CAPTACION." .                  
106600                                                                              
106800 01 I02-TIT-ARCHRSLT.                                                         
107000    02 FILLER             PIC X(15) VALUE "S500/FILE/INTS/".                  
107200    02 FILLER             PIC X(08) VALUE "50025S02"       .                  
107400    02 FILLER             PIC X(01) VALUE "/"              .                  
107600    02 I02-TIT-TEMT-CSI   PIC 9(02)                        .                  
107800    02 FILLER             PIC X(01) VALUE "/"              .                  
108000    02 I02-TIT-TEMT-FEC   PIC 9(08)                        .                  
108200    02 FILLER             PIC X(09) VALUE "/GBNPRSLT"      .                  
108400    02 FILLER             PIC X(05) VALUE "/0001"          .                  
108600    02 FILLER             PIC X(15) VALUE " ON CAPTACION." .                  
108800                                                                              
109000 01 I03-TIT-CTRL.                                                             
109200    02 FILLER             PIC X(10) VALUE "S500/FILE/"     .                  
109400    02 I03-TIT-CTRL-CSI   PIC 9(02)                        .                  
109600    02 FILLER             PIC X(01) VALUE "/"              .                  
109800    02 I03-TIT-CTRL-FEC   PIC 9(08)                        .                  
110000    02 FILLER             PIC X(09) VALUE "/P109CTRL"      .                  
110200    02 FILLER             PIC X(15) VALUE " ON CAPTACION." .                  
110400                                                                              
110600                                                                              
110800*****************************************************************             
111000*  TITULOS LIST                                                 *             
111200*****************************************************************             
111400                                                                              
111600 01 CARATULA.                                                                 
111800    03 FILLER             PIC X(15) VALUE "S500/LIST/P109/".                  
112000    03 CARAT-CSI          PIC 99                           .                  
112200    03 CARAT-SUBNODO      PIC 99                           .                  
112400    03 FILLER             PIC X     VALUE "/"              .                  
112600    03 CARAT-CIFRA        PIC X                            .                  
112800    03 FILLER             PIC X(4)  VALUE "000/"           .                  
113000    03 CARAT-FECHA        PIC 9(6)                         .                  
113200    03 FILLER             PIC X     VALUE "/"              .                  
113400    03 CARAT-MIX          PIC 9(7)                         .                  
113600    03 FILLER             PIC X     VALUE "/"              .                  
113800    03 CARAT-NOMBRE       PIC X(17)                        .                  
114000    03 CARAT-NOMBRE-R REDEFINES CARAT-NOMBRE               .                  
114200       05 CARAT-NR        PIC X(15)                        .                  
114400       05 CARAT-NN        PIC 9(02)                        .                  
114600    03 FILLER             PIC X     VALUE "."              .                  
114800                                                                              
115000*****************************************************************             
115200*  FETALLES LIST REPOTASA                                       *             
115400*****************************************************************             
115600                                                                              
115800 01 WS-ENC0-REPOTASA.                                                         
116000    03 FILLER             PIC X(56) VALUE SPACES           .                  
116200    03 FILLER             PIC X(24) VALUE                                     
116400                                 "BANCO NACIONAL DE MEXICO".                  
116600    03 FILLER             PIC X(52) VALUE SPACES           .                  
116800                                                                              
117000 01 WS-ENC1-REPOTASA.                                                         
117200    03 FILLER             PIC X(04) VALUE "S500"           .                  
117400    03 FILLER             PIC X(01) VALUE "/"              .                  
117600    03 FILER              PIC X(04) VALUE "P109"           .                  
117800    03 FILLER             PIC X(01) VALUE "/"              .                  
118000    03 WS-EN1-RT-MTP      PIC X(08)                        .                  
118200    03 FILLER             PIC X(01) VALUE "/"              .                  
118400    03 FILLER             PIC X(15) VALUE "001S500GBNPTASA".                  
118600    03 WS-EN1-RT-NN       PIC 9(02)                        .                  
118800    03 FILLER             PIC X(71) VALUE SPACES           .                  
119000    03 FILLER             PIC X(14) VALUE "FECHA MOVTOS: " .                  
119200    03 WS-EN1-RT-FEC      PIC X(11)                        .                  
119400                                                                              
119600 01 WS-ENC2-REPOTASA.                                                         
119800    03 FILLER             PIC X(15) VALUE "FECHA PROCESO: ".                  
120000    03 WS-EN2-RT-FEC      PIC X(12)                        .                  
120200    03 FILLER             PIC X(25) VALUE SPACES           .                  
120400    03 FILLER             PIC X(33) VALUE                                     
120600                        "DETALLE DE RENDIMIENTOS SERV GBNP".                  
120800    03 FILLER             PIC X(22) VALUE SPACES           .                  
121000    03 FILLER             PIC X(25) VALUE                                     
121200                              "TIPO PROCESO:      DIARIO"  .                  
121400                                                                              
121600 01 WS-ENC3-REPOTASA.                                                         
121800    03 FILLER             PIC X(15) VALUE "HORA  PROCESO: "      .            
122000    03 WS-EN3-RT-HOR      PIC X(08)                              .            
122200    03 FILLER             PIC X(28) VALUE SPACES                 .            
122400    03 FILLER             PIC X(08) VALUE "PROD:   "             .            
122600    03 WS-EN3-RT-PROD     PIC ZZZ9                               .            
122800    03 FILLER             PIC X(09) VALUE " INST:   "            .            
123000    03 WS-EN3-RT-INST     PIC ZZZ9                               .            
123200    03 FILLER             PIC X(08) VALUE " MON:   "             .            
123400    03 WS-EN3-RT-MON      PIC Z9                                 .            
123600    03 FILLER             PIC X(21) VALUE SPACE                  .            
123800    03 FILLER             PIC X(21) VALUE "HOJA NUM    :        ".            
124000    03 WS-EN3-RT-HOJA     PIC ZZZ9                               .            
124200                                                                              
124400 01 WS-ENC4-REPOTASA.                                                         
124600    03 FILLER             PIC X(60) VALUE SPACES            .                 
124800    03 FILLER             PIC X(10) VALUE "C.S.I.    "      .                 
125000    03 WS-EN4-RT-NOMCSI   PIC X(09)                         .                 
125200    03 FILLER             PIC X(53) VALUE SPACES            .                 
125400                                                                              
125600 01 WS-VACI-REPOTASA.                                                         
125800    03 FILLER             PIC X(132) VALUE SPACES   .                         
126000                                                                              
126200 01 WS-ENC5-REPOTASA.                                                         
126400    03 FILLER             PIC X(15) VALUE "   CONTRATO    "   .               
126600    03 FILLER             PIC X(06) VALUE "SUC   "            .               
126800    03 FILLER             PIC X(05) VALUE "TP   "             .               
127000    03 FILLER             PIC X(15) VALUE "TASA GBNP      "   .               
127200    03 FILLER             PIC X(10) VALUE "FECHA     "        .               
127400    03 FILLER             PIC X(09) VALUE "SEC      "         .               
127600    03 FILLER             PIC X(17) VALUE "REND NETO        " .               
127800    03 FILLER             PIC X(18) VALUE "TASAS 10:00 P.M.  ".               
128000    03 FILLER             PIC X(18) VALUE "TASAS 11:00 P.M.  ".               
128200    03 FILLER             PIC X(18) VALUE "TASAS 02:00 A.M.  ".               
128400                                                                              
128600 01 WS-DETA-REPOTASA.                                                         
128800    03 FILLER             PIC X(01) VALUE SPACES     .                        
129000    03 WS-DET-RT-CTO      PIC ZZZZZZZZZZZ9           .                        
129200    03 FILLER             PIC X(02) VALUE SPACES     .                        
129400    03 WS-DET-RT-SUC      PIC ZZZ9                   .                        
129600    03 FILLER             PIC X(02) VALUE SPACES     .                        
129800    03 WS-DET-RT-TP       PIC X(03)                  .                        
130000    03 FILLER             PIC X(01) VALUE SPACES     .                        
130200    03 WS-DET-RT-TAS      PIC X(12)                  .                        
130400    03 WS-DET-RT-TAS-R REDEFINES WS-DET-RT-TAS       .                        
130600       05 WS-DET-RT-TAS-N PIC Z,ZZ9.9(06)            .                        
130800    03 FILLER             PIC X(02) VALUE SPACES     .                        
131000    03 WS-DET-RT-FEC      PIC X(11)                  .                        
131200    03 FILLER             PIC X(02) VALUE SPACES     .                        
131400    03 WS-DET-RT-SE       PIC X(02)                  .                        
131600    03 WS-DET-RT-SE-R REDEFINES WS-DET-RT-SE         .                        
131800       05 WS-DET-RT-SE-N  PIC Z9                     .                        
132000    03 FILLER             PIC X(05) VALUE SPACES     .                        
132200    03 WS-DET-RT-RN       PIC Z,ZZZ,ZZZ,ZZ9.99       .                        
132400    03 FILLER             PIC X(02) VALUE SPACES     .                        
132600    03 WS-DET-RT-10       PIC X(16)                  .                        
132800    03 WS-DET-RT-10-R REDEFINES WS-DET-RT-10         .                        
133000       05 WS-DET-RT-10-D  PIC B(04)Z,ZZ9.9(06)       .                        
133200    03 FILLER             PIC X(02) VALUE SPACES     .                        
133400    03 WS-DET-RT-11       PIC X(16)                  .                        
133600    03 WS-DET-RT-11-R REDEFINES WS-DET-RT-11         .                        
133800       05 WS-DET-RT-11-D  PIC B(04)Z,ZZ9.9(06)       .                        
134000    03 FILLER             PIC X(02) VALUE SPACES     .                        
134200    03 WS-DET-RT-04       PIC X(16)                  .                        
134400    03 WS-DET-RT-04-R REDEFINES WS-DET-RT-04         .                        
134600       05 WS-DET-RT-04-D  PIC B(04)Z,ZZ9.9(06)       .                        
134800    03 FILLER             PIC X(04) VALUE SPACES     .                        
135000                                                                              
135200 01 WS-TOTA-REPOTASA.                                                         
135400    02 FILLER             PIC X(15) VALUE "TOTAL PRODUCTO ".                  
135600    02 FILLER             PIC X(38) VALUE SPACES           .                  
135800    02 WS-TOT-RT-TOTAL    PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99       .                  
136000    02 FILLER             PIC X(52) VALUE SPACES           .                  
136200                                                                              
136400 01 WS-NOIN-REPOTASA.                                                         
136600    02 FILLER             PIC X(29) VALUE SPACES                 .            
136800    02 FILLER             PIC X(46) VALUE                                     
137000                 "                           NO HUBO INFORMACION".            
137200    02 FILLER             PIC X(57) VALUE SPACES                 .            
137400                                                                              
137600 01 WS-ENC1-REPMENSA.                                                         
137800    03 FILLER             PIC X(04) VALUE "S500"                .             
138000    03 FILLER             PIC X(01) VALUE "/"                   .             
138200    03 FILER              PIC X(04) VALUE "P109"                .             
138400    03 FILLER             PIC X(01) VALUE "/"                   .             
138600    03 WS-EN1-RM-MTP      PIC X(08)                             .             
138800    03 FILLER             PIC X(01) VALUE "/"                   .             
139000    03 WS-EN1-RM-NAM      PIC X(17)                             .             
139200    03 FILLER             PIC X(22) VALUE SPACES                .             
139400    03 FILLER             PIC X(20) VALUE "DEPOSITOS A LA VISTA".             
139600    03 FILLER             PIC X(29) VALUE SPACES                .             
139800    03 FILLER             PIC X(14) VALUE "FECHA MOVTOS: "      .             
140000    03 WS-EN1-RM-FEC      PIC X(12)                             .             
140200                                                                              
140400                                                                              
140600 01 WS-ENC2-REPMENSA.                                                         
140800    03 FILLER             PIC X(15) VALUE "FECHA PROCESO: ".                  
141000    03 WS-EN2-RM-FEC      PIC X(12)                        .                  
141200    03 FILLER             PIC X(25) VALUE SPACES           .                  
141400    03 FILLER             PIC X(33) VALUE                                     
141600                        " REPORTE DE MENSAJES DEL PROCESO ".                  
141800    03 FILLER             PIC X(22) VALUE SPACES           .                  
142000    03 FILLER             PIC X(25) VALUE                                     
142200                              "TIPO PROCESO:      DIARIO"  .                  
142400                                                                              
142600 01 WS-ENC3-REPMENSA.                                                         
142800    03 FILLER             PIC X(15) VALUE "HORA  PROCESO: " .                 
143000    03 WS-EN3-RM-HOR      PIC X(08)                         .                 
143200    03 FILLER             PIC X(84) VALUE SPACES            .                 
143400    03 FILLER             PIC X(21) VALUE "HOJA NUM   :    ".                 
143600    03 WS-EN3-RM-HOJA     PIC ZZZ9.                                           
143800                                                                              
144000 01 WS-ENC4-REPMENSA.                                                         
144200    03 WS-EN4-RM-SUC      PIC 9(04)                         .                 
144400    03 FILLER             PIC X(128) VALUE SPACES           .                 
144600                                                                              
144800 01 WS-ENC5-REPMENSA.                                                         
145000    03 WS-EN5-RM-NBSUC    PIC X(60)                         .                 
145200    03 WS-EN5-RM-NCSI     PIC X(72)                         .                 
145400                                                                              
145600 01 WS-DETA-REPMENSA.                                                         
145800    03 WS-DET-RM-HOR      PIC X(11)                         .                 
146000    03 FILLER             PIC X(01) VALUE SPACES            .                 
146200    03 WS-DET-RM-MSG      PIC X(120)                        .                 
146400                                                                              
146600 01 WS-VACI-REPMENSA.                                                         
146800    03 FILLER             PIC X(132) VALUE SPACES           .                 
147000                                                                              
147200 01 WS-FIN-REPMENSA.                                                          
147400    03 WS-FIN-RM-HOR      PIC X(11)                         .                 
147600    03 FILLER             PIC X(31) VALUE SPACES            .                 
147800    03 FILLER             PIC X(22) VALUE                                     
148000                                    "*** FIN DE REPORTE ***".                 
148200    03 FILLER             PIC X(68) VALUE SPACES            .                 
148400                                                                              
148600                                                                              
148800*****************************************************************             
149000*  WFL EJECUCION                                                *             
149200*****************************************************************             
149400                                                                              
149600 01 WS-WFL-P168.                                                              
149800    02 FILLER                PIC X(11) VALUE "BEGIN JOB; "   .                
150000    02 FILLER                PIC X(06) VALUE "START "        .                
150200    02 WS-TIT-LOTE-P168      PIC X(41)                       .                
150400    02 FILLER                PIC X(01) VALUE "("             .                
150600    02 FILLER                PIC X(01) VALUE QUOTES          .                
150800    02 FILLER                PIC X(14) VALUE "CORRESOLO P168".                
151000    02 FILLER                PIC X(01) VALUE QUOTES          .                
151200    02 FILLER                PIC X(03) VALUE "); "           .                
151400    02 FILLER                PIC X(08) VALUE "END JOB."      .                
151600                                                                              
151800 01 WS-WFL-GBNPRSLT.                                                          
152000    02 FILLER                PIC X(11) VALUE "BEGIN JOB; "   .                
152200    02 FILLER                PIC X(06) VALUE "START "        .                
152400    02 WS-TIT-LOTE-RSLT      PIC X(41)                       .                
152600    02 FILLER                PIC X(01) VALUE "("             .                
152800    02 FILLER                PIC X(01) VALUE QUOTES          .                
153000    02 WS-TIT-PARA-RSLT      PIC X(13)                       .                
153200    02 FILLER                PIC X(01) VALUE SPACE           .                
153400    02 WS-TIT-FECH-RSLT      PIC 9(08)                       .                
153600    02 FILLER                PIC X(01) VALUE SPACE           .                
153800    02 WS-TIT-SECU-RSLT      PIC X(04)                       .                
154000    02 FILLER                PIC X(01) VALUE QUOTES          .                
154200    02 FILLER                PIC X(03) VALUE "); "           .                
154400    02 FILLER                PIC X(08) VALUE "END JOB."      .                
154600                                                                              
154800 01 WS-EJEC-P168             PIC 9(02)  .                                     
155000    88 WS-88-NOEJE-P168         VALUE 0 .                                     
155200    88 WS-88-YAEJE-P168         VALUE 1 .                                     
155400                                                                              
155600*****************************************************************             
155800*                            TABLAS                             *             
156000*****************************************************************             
156200                                                                              
156400 01 WKS-TABLA-S080                                  .                         
156600    02 WKS-TB-S080-XSUC      OCCURS 9999            .                         
156800       04 WKS-TB-S080-NUMSUC     PIC 9(04)     COMP .                         
157000       04 WKS-TB-S080-CSI        PIC 9(02)     COMP .                         
157200                                                                              
157400 01 WS-B05-TABLA                                    .                         
157600    02 WS-B05-TABLA-OCC          OCCURS 30          .                         
157800       03 WS-B05-TABLA-PROD      PIC 9(04)          .                         
158000       03 WS-B05-TABLA-INTS      PIC 9(04)          .                         
158200       03 WS-B05-TABLA-MONE      PIC 9(02)          .                         
158400       03 WS-B05-TABLA-INDP      PIC 9(02)          .                         
158600       03 WS-B05-TABLA-DIME      PIC 9(02)          .                         
158800                                                                              
159000 01 WS-TABLA-MESES               PIC X(36)                                    
159200                     VALUE "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".            
159400 01 WS-TABLA-MESES-R REDEFINES WS-TABLA-MESES .                               
159600    03 WKS-TB-MES                PIC X(03) OCCURS 12 TIMES .                  
159800                                                                              
160000******************************************************************            
160200*  ERROR                     DESCRIPCION                         *            
160400*  1001      CAMBIO DE PRODUCTO EN CURSO PARA EL CONTRATO        *            
160600*  1002      CONTRATO CON ESTATUS CANCELADO  2 3 4               *            
160800*  1003      PAGO DE RENDIMIENTO EN CURSO, EL P127, P305 O P130  *            
161000*            SE ENCUENTRA EN EJECUCION, YA NO ACTUALIZA LA BASE  *            
161200*            DE DATOS, UNICAMENTE PARA FILE #1 Y FILE #2         *            
161400*  1004      NO SE RECIBIO ARCHIVO DE GBNP #1, #2 O #3           *            
161600*  1005      LA TASA RECIBIDA EN EL ARCHIVO DE GBNP ESTA EN 0 O  *            
161800*            ES NEGATIVO (N/A)                                   *            
162000*  1006      EL CONTRATO DIO UN ERROR DE BASE DE DATOS DE TIPO   *            
162200*            DEADLOCK                                            *            
162400*  1007      EL CONTRATO NO EXISTE EN S500B03CONTRATOS           *            
162600*  1008      EL PRODUCTO NO PAGA RENDIMIENTOS DE ACUERDO A B05   *            
162800*  1009      EL CONTRATO ES FORANEO                              *            
163000*  1010      EL CONTRATO NO TIENE EL SERVICIO DE GBNP ACTIVO     *            
163200*  1011      ERROR DE BASE DE DATOS EN S500B03CONTRATOS          *            
163400*  1012      LA TASA ES MAYOR AL 25%                             *            
163600*  1013      ERROR DE BASE DE DATOS EN S500B06HISTORICO          *            
163800*  1014      ERROR DE BASE DE DATOS EN S500B44CTOSEVOL           *            
163900*  1015      SUCURSAL NO OPERA O INVALIDO EN EL S080             *            
164000******************************************************************            
164200                                                                              
164400 01 WS-TABLA-ERR-LIST.                                                        
164600    02 FILLER  PIC X(16) VALUE "1001CAMB EN CUR "    .                        
164800    02 FILLER  PIC X(16) VALUE "1002CTO CANCELAD"    .                        
165000    02 FILLER  PIC X(16) VALUE "1003PAGO EN PROC"    .                        
165200    02 FILLER  PIC X(16) VALUE "1004NO TASAS    "    .                        
165400    02 FILLER  PIC X(16) VALUE "1005TASA EN 0   "    .                        
165600    02 FILLER  PIC X(16) VALUE "1006CTO OCUPADO "    .                        
165800    02 FILLER  PIC X(16) VALUE "1007CTO NO EXIST"    .                        
166000    02 FILLER  PIC X(16) VALUE "1008PROD NO PAGA"    .                        
166200    02 FILLER  PIC X(16) VALUE "1009CTO FORANEO "    .                        
166400    02 FILLER  PIC X(16) VALUE "1010CTO SIN GBNP"    .                        
166600    02 FILLER  PIC X(16) VALUE "1011PROBL S500  "    .                        
166800    02 FILLER  PIC X(16) VALUE "1012TASA MAYOR  "    .                        
167000    02 FILLER  PIC X(16) VALUE "1013PROBL S500  "    .                        
167200    02 FILLER  PIC X(16) VALUE "1014PROBL S500  "    .                        
167300    02 FILLER  PIC X(16) VALUE "1015PROBL S500  "    .                        
167400                                                                              
167600 01 WS-TABLA-ERR-LIST-R REDEFINES WS-TABLA-ERR-LIST  .                        
167800    02 WS-TB-ERR-LIST     PIC X(16) OCCURS 15 TIMES  .                        
168000                                                                              
168200 01 WS-TABLA-NOM-ACT.                                                         
168400    02 FILLER  PIC X(35) VALUE                                                
168600                         "ARCH. DE RESP. GBNP #1 o #2        "  .             
168800    02 FILLER  PIC X(35) VALUE                                                
169000                         "ACT EN B03 LAS TASAS REC EN ARCH #1"  .             
169200    02 FILLER  PIC X(35) VALUE                                                
169400                         "ARCH. DE RESP. GBNP #2             "  .             
169600    02 FILLER  PIC X(35) VALUE                                                
169800                         "ACT EN B03 LAS TASAS REC EN ARCH #2"  .             
170000    02 FILLER  PIC X(35) VALUE                                                
170200                         "ARCH. DE RESP. GBNP #3             "  .             
170400    02 FILLER  PIC X(35) VALUE                                                
170600                         "ACT EN B03 LAS TASAS REC EN ARCH #3"  .             
170800    02 FILLER  PIC X(35) VALUE                                                
171000                         "GENERA LIST DE ACT DE ARCH.        "  .             
171200                                                                              
171400 01 WS-TABLA-NOM-ACT-R REDEFINES WS-TABLA-NOM-ACT  .                          
171600    02 WS-TB-NOM-ACT     PIC X(35) OCCURS 7 TIMES  .                          
171800                                                                              
172000*****************************************************************             
172200 PROCEDURE DIVISION USING WS-PARAM-VALUE.                                     
172400*****************************************************************             
172600 DECLARATIVES.                                                                
172800*-----------------------------------------------------------------            
173000 000-INTERRUPCIONES-SECCION  SECTION.                                         
173200     USE AS INTERRUPT PROCEDURE.                                              
173400 INTERRUPT-BY-HI.                                                             
173600*-----------------------------------------------------------------            
173800    DISALLOW INTERRUPT.                                                       
174000                                                                              
174200    MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-HI-NUMHI .                       
174400    IF WS-88-ESTADIST                                                         
174600       STRING "SE RECIBE HI 1 ESTADISTICOS "                                  
174800              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
175000       MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                 
175200       PERFORM 20000038-ESC-REPMENSA                                          
175400       PERFORM 70000050-MENSAJE                                               
175600       PERFORM 40000006-HI-ESTADISTICOS                                       
175800    ELSE                                                                      
176000    IF WS-88-BAJA                                                             
176200       STRING "SE RECIBE HI 4 BAJA "                                          
176400              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
176600       MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                 
176800       PERFORM 20000038-ESC-REPMENSA                                          
177000       PERFORM 70000050-MENSAJE                                               
177200       MOVE 1 TO WS-RECIBE-BAJA                                               
177400    ELSE                                                                      
177600    IF WS-HI-NUMHI > 0                                                        
177800       MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-HI-NUMHI                      
178000       STRING "NUM HI ERRONEO ", WS-HI-NUMHI                                  
178200              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
178400       MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                 
178800       PERFORM 20000038-ESC-REPMENSA                                          
179000       PERFORM 70000050-MENSAJE .                                             
179200                                                                              
179400    SET MYSELF (TASKVALUE) TO ZERO .                                          
179600                                                                              
179800 END-INTERRUPT-BY-HI.                                                         
180000    ALLOW INTERRUPT.                                                          
180200 END DECLARATIVES.                                                            
180400                                                                              
180600*****************************************************************             
180800 00000000-CONTROL  SECTION  01.                                               
181000*****************************************************************             
181200 00000000-CONTROL-PROGRAMA.                                                   
181400*****************************************************************             
181600                                                                              
181800    PERFORM 10000000-INICIO     .                                             
181900    IF WS-88-P-VAL-OK                                                         
182000       PERFORM 20000000-PROCESO .                                             
182200    PERFORM 30000000-FIN        .                                             
182300    STOP RUN                    .                                             
182400                                                                              
182600*================                                                             
182800 10000000-INICIO.                                                             
183000*================                                                             
183200                                                                              
183400    MOVE 2                 TO W77-USO-LIBLJ       .                           
183600    MOVE SPACES            TO WS-0101-TEXT-MSG    .                           
183800    MOVE WS-NUM-P109       TO WS-0101-PASO-MSG    .                           
184000    MOVE WS-NUM-MTP        TO WS-0101-MTP-MSG                                 
184200                              W77-S000-MY-VERSION .                           
184400    MOVE "S500P109"        TO W77-S000-MY-ID      .                           
184600                                                                              
184800    IF WS-88-P-VAL-OK                                                         
185000       STRING "RECIBO PARAM VALUE = " WS-PARAM-VALUE                          
185200              DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                        
185500       PERFORM 70000050-MENSAJE                                               
186200                                                                              
186800       PERFORM 10000001-OPEN-BD                                               
186850       PERFORM 10000002-IDENTIFICA-HOST                                       
186900       PERFORM 10000003-VALIDA-VERSIONES                          186400      
187000       PERFORM 10000004-TITLE-LIBRERIAS                                       
187200       PERFORM 10000005-OBTB02-FECHA-CSI                                      
187400       PERFORM 10000006-OPEN-LISTADOS                                         
187600       PERFORM 10000007-OPEN-ARCHCTRL                                         
187800       PERFORM 10000008-VALIDA-PBA                                            
188000       PERFORM 10000009-INI-PGM-MAPLI                                         
188200       PERFORM 10000010-INICIO-PROCESO                                        
188400*       PERFORM 10000011-CARGA-S080                                           
188600       PERFORM 10000012-OBTB05-PRODU-INT                                      
188800       PERFORM 10000013-OPEN-ARCHRSLT                                         
189000       PERFORM 40000001-HORA                                                  
189200       MOVE WS-HORA-MAQ TO WS-HORA-MAQ-ANT                                    
189250    ELSE                                                                      
189300       STRING "ERROR PARAM VALUE = " WS-PARAM-VALUE                           
189320              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
189350       PERFORM 70000050-MENSAJE .                                             
189400                                                                              
189600    ATTACH 000-INTERRUPCIONES-SECCION TO ATTRIBUTE EXCEPTIONEVENT             
189800                                      OF MYSELF .                             
190000    ALLOW INTERRUPT.                                                          
190200                                                                              
190400*****************************************************************             
190600* ABRE/GENERA ARCHIVO CONTROL                                   *             
190800*****************************************************************             
191000                                                                              
191200*================                                                             
191400 10000007-OPEN-ARCHCTRL.                                                      
191600*================                                                             
191800                                                                              
192000   MOVE WS02-NUM-CSI      TO I03-TIT-CTRL-CSI .                               
192200   MOVE WS-FECHA-PROY     TO I03-TIT-CTRL-FEC .                               
192400                                                                              
192600   MOVE 0      TO I03-CTRL-NUM-REG                                            
192800                  I03-CTRL-CTO     .                                          
193000   MOVE 1      TO I03-CTRL-SEC     .                                          
193200   MOVE SPACES TO I03-CTRL-FILLER  .                                          
193400                                                                              
193600   CHANGE ATTRIBUTE NEWFILE   OF I03-CTRL TO VALUE FALSE     .                
193800*  CHANGE ATTRIBUTE EXCLUSIVE OF I03-CTRL TO VALUE TRUE      .                
194000   CHANGE ATTRIBUTE TITLE     OF I03-CTRL TO I03-TIT-CTRL    .                
194200                                                                              
194400   MOVE 1 TO WS-I03-CTRL-LLAVE .                                              
194600   IF ATTRIBUTE AVAILABLE OF I03-CTRL = VALUE TRUE                            
194800      PERFORM 10000012-OBTIENE-CTRL                                           
195000   ELSE                                                                       
195200      OPEN OUTPUT I03-CTRL                                                    
195400      WRITE I03-R-CTRL INVALID KEY                                            
195600            MOVE "ERROR AL ESC ARCH CTRL" TO WS-0101-TEXT-MSG                 
195800            PERFORM 70000050-MENSAJE .                                        
196000                                                                              
196200 10000012-OBTIENE-CTRL.                                                       
196400*======================                                                       
196600                                                                              
196800   MOVE 0 TO WS-EVE-REALIZA .                                                 
197000   READ I03-CTRL INVALID KEY                                                  
197200        MOVE "ERROR AL LEER ARCH CTRL" TO WS-0101-TEXT-MSG                    
197400        PERFORM 70000050-MENSAJE                                              
197600        MOVE 1  TO I03-CTRL-SEC                                               
197800        MOVE 0  TO I03-CTRL-NUM-REG .                                         
198000                                                                              
198200   IF WS-88-PROCE5                                                            
198400      MOVE 1    TO WS-EVE-REALIZA                                             
198600   ELSE                                                                       
198800   IF WS-88-PROCE4                                                            
199000      MOVE 2    TO WS-EVE-REALIZA                                             
199200   ELSE                                                                       
199400   IF WS-88-P-VAL-SEC3                                                        
199600      MOVE 3    TO I03-CTRL-SEC                                               
199800   ELSE                                                                       
200000   IF WS-88-P-VAL-SEC12                                                       
200200      IF WS-88-PROCE3                                                         
200400         MOVE 1 TO WS-EVE-REALIZA .                                           
200600                                                                              
200800   IF WS-88-EVE-FINAL                                                         
201000      MOVE 1 TO WS-PROCESO                                                    
201200      STRING "TERMINO PROCESO X CTRL "     ,                                  
201400                               " - PARAM: ", WS-PARAM-VALUE-N                 
201600                               " - CTSEC: ", I03-CTRL-SEC                     
201800             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
202000      PERFORM 70000050-MENSAJE .                                              
202200                                                                              
202400*****************************************************************             
202600*ABRE LA BASE DE CAPTACION                                      *             
202800*****************************************************************             
203000                                                                              
203200*=================                                                            
203400 10000001-OPEN-BD.                                                            
203600*=================                                                            
203800                                                                              
204200   OPEN UPDATE S500BD01CAPTACION .                                            
206800   MOVE 1 TO WS-ABRE-BD .                                                     
207000                                                                              
207200*****************************************************************             
207400*CALL A SOPORTECOMS PARA OBTENER CSI DE EJECUCION               *             
207600*****************************************************************             
207800                                                                              
208000*=================                                                            
208200 10000002-IDENTIFICA-HOST.                                                    
208400*=================                                                            
208600                                                                              
208800   PERFORM 00000000-CHANGE-SOPCOMS .                                          
209000   PERFORM 0000-CALL-HOSTNAME      .                                          
209200                                                                              
209400*****************************************************************             
209600*SI ES UAT O PROD REVISAMOS VERSION DE P109                     *             
209800*****************************************************************             
210000                                                                              
210200*=================                                                            
210400 10000003-VALIDA-VERSIONES.                                                   
210600*=================                                                            
210800                                                                              
211000   PERFORM 10000100-VERSIONES .                                               
211200                                                                              
211400   IF WS-DH-NOM-EQUIPO = "ACYPBETA. " OR "CACYPBET. "                         
211600      NEXT SENTENCE                                                           
211800   ELSE                                                                       
212000      PERFORM 20000100-CHECAME-VERSION                                        
212200      IF S000-CTR-CVEERROR < 0                                                
212400         STRING "ERROR DE VERSION "                                           
212600                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
212800         PERFORM 70000050-MENSAJE                                             
213000         CHANGE ATTRIBUTE STATUS OF MYSELF TO -1 .                            
213200                                                                              
213220   PERFORM 00002000-MENSAJE-HOSTNAME.                                         
213400*****************************************************************             
213600* OBTIENE FECHA DE LINEA Y CSI DE B02                           *             
213800* PROYECTA T-1 PARA LOS ARCHIVOS DE GBNP                        *             
214000*****************************************************************             
214200                                                                              
214400*=================                                                            
214600 10000005-OBTB02-FECHA-CSI.                                                   
214800*=================                                                            
215000                                                                              
215200   PERFORM 90000002-B02CONTROL-FIND .                                         
215400                                                                              
215600   IF WS-STATUS-BASE > 0                                                      
215800      MOVE DMSTATUS(DMCATEGORY)   TO WS-STATUS-BASE                           
216000      STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                           
216200             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
216400      PERFORM 70000050-MENSAJE                                                
216600      CALL SYSTEM DMTERMINATE .                                               
216800                                                                              
217000   MOVE B02-FECHA-LINEA     TO WS02-FECHA-LINEA .                             
217200   MOVE B02-NUM-CSI         TO WS02-NUM-CSI     .                             
217400                                                                              
217600   MOVE WS02-FECHA-LINEA    TO WS-S006-FECHA1   .                             
217800   MOVE 1                   TO WS-S006-FECHA2   .                             
218000   MOVE 15                  TO WS-S006-FUNCION  .                             
218200   MOVE 13                  TO WS-S006-FORMATO  .                             
218400   MOVE WS-S006-FUNCION     TO WS-MSG-N-04      .                             
218600   PERFORM 20000006-LOCSUP                      .                             
218800                                                                              
219000   IF WS-S006-FUNCION = 0                                                     
219200      MOVE WS-S006-FECHA1   TO WS-FECHA-PROY                                  
219400   ELSE                                                                       
219600      MOVE WS-S006-FUNCION  TO WS-MSG-RS                                      
219800      MOVE WS-S006-FORMATO  TO WS-MSG-N-02                                    
220000      STRING "ERR CALL LOCSUP ",                                              
220200             " FUNC-E ", WS-MSG-N-04                                          
220400             " FMTO-E ", WS-MSG-N-02                                          
220600             " FEC1-E ", WS-S006-FECHA1                                       
220800             " FEC2-E ", WS-S006-FECHA2                                       
221000             " RESULT ", WS-MSG-RS                                            
221200      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                 
221400      PERFORM 70000050-MENSAJE                                                
221600      CALL SYSTEM DMTERMINATE .                                               
221800                                                                              
222000   CANCEL "LOCSUP".                                                           
222200                                                                              
222400*****************************************************************             
222600* GENERA LISTADO DE MENSAJES                                    *             
222800*****************************************************************             
223000                                                                              
223200*=================                                                            
22340010000006-OPEN-LISTADOS.                                                       
223600*=================                                                            
223800                                                                              
224000   MOVE WS-FECHA-PROY                     TO WS-FECHA     .                   
224200   MOVE WS02-NUM-CSI                      TO CARAT-CSI    .                   
224400   MOVE 0                                 TO CARAT-SUBNODO.                   
224600   MOVE "R"                               TO CARAT-CIFRA  .                   
224800   MOVE WS-FECHA1-AMD                     TO CARAT-FECHA  .                   
225000   MOVE ATTRIBUTE MIXNUMBER OF MYSELF     TO CARAT-MIX    .                   
225200                                                                              
225400   IF WS-88-P-VAL-SEC12                                                       
225600      MOVE "002MENSAJES001"               TO CARAT-NOMBRE                     
225800   ELSE                                                                       
225900   IF WS-88-P-VAL-SEC3                                                        
226000      MOVE "003MENSAJES002"               TO CARAT-NOMBRE                     
226050   ELSE                                                                       
226100      MOVE "004MENSAJES003"               TO CARAT-NOMBRE .                   
226200                                                                              
226400   SET P02-REPMENSA(USERBACKUPNAME)       TO VALUE TRUE   .                   
226600   CHANGE ATTRIBUTE TITLE OF P02-REPMENSA TO CARATULA     .                   
226800   OPEN OUTPUT P02-REPMENSA                               .                   
227000                                                                              
227200   MOVE WS-NUM-MTP                TO WS-EN1-RM-MTP     .                      
227400   MOVE CARAT-NOMBRE              TO WS-EN1-RM-NAM     .                      
227600                                                                              
227800   MOVE WS02-FECHA-LINEA          TO WS-FECHA          .                      
228000   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
228200   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
228400   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
228600   MOVE WS-FECHA-DDMMAAAA         TO WS-EN1-RM-FEC     .                      
228800                                                                              
229000   IF WS02-NUM-CSI = 10                                                       
229200      MOVE 3084                     TO WS-EN4-RM-SUC                          
229400      MOVE "PYCP JARDINES"          TO WS-EN5-RM-NBSUC                        
229600   ELSE                                                                       
229800      MOVE 3667                     TO WS-EN4-RM-SUC                          
230000      MOVE "CYSAU MTY CTROL PROD"   TO WS-EN5-RM-NBSUC.                       
230200                                                                              
230400   IF WS02-NUM-CSI = 10                                                       
230600      MOVE "C.S.I. MEXICO   "       TO WS-EN5-RM-NCSI                         
230800   ELSE                                                                       
231000      MOVE "C.S.I. MONTERREY"       TO WS-EN5-RM-NCSI .                       
231200                                                                              
231400   PERFORM 20000039-ENCA-REPMENSA .                                           
231600                                                                              
231800*****************************************************************             
232000* VALIDA AMBIENTE DE PRUEBAS PARA WAIT DE ARCHIVOS GBNP         *             
232200*****************************************************************             
232400                                                                              
232600*=================                                                            
232800 10000008-VALIDA-PBA.                                                         
233000*=================                                                            
233200                                                                              
233400   IF WS-DH-HOSTNAME-PBA OR WS-DH-HOSTNAME-UAT                                
233600      MOVE 1 TO WS-ES-PRUEBA   .                                              
233800                                                                              
234000*****************************************************************             
234200* OBTIENE TITLE DE VERSIONES DE LAS LIBRERIAS                   *             
234400*****************************************************************             
234600                                                                              
234800*=================                                                            
235000 10000004-TITLE-LIBRERIAS.                                                    
235200*=================                                                            
235400                                                                              
235600   PERFORM 10000006-LOCSUP   .                                                
235800                                                                              
236000   PERFORM 1000038-S038L035  .                                                
236200   MOVE S000-CTR-NOMLIB TO WS-NAME-LIB-S038MAPLI           .                  
236400   INSPECT WS-NAME-LIB-S038MAPLI REPLACING ALL @00@ BY " " .                  
236600                                                                              
236800   PERFORM 10000080-S080L700 .                                                
237000   MOVE S000-CTR-NOMLIB TO WS-NAME-LIB-S080L700            .                  
237200   INSPECT WS-NAME-LIB-S080L700 REPLACING ALL @00@ BY " "  .                  
237220                                                                              
237240   PERFORM 10000080-S080IVA  .                                                
237260   MOVE S000-CTR-NOMLIB  TO WS-NAME-LIB-S080IVAS           .                  
237280   INSPECT WS-NAME-LIB-S080IVAS REPLACING ALL @00@ BY " "  .                  
237400                                                                              
237600*****************************************************************             
237800* CALL CATALOGO PARA OBTENER CSI DE LAS SUCURSALES              *             
238000*****************************************************************             
238200                                                                              
238400*=================                                                            
238600 10000011-CARGA-S080.                                                         
238800*=================                                                            
239000                                                                              
239200   STRING "INICIO CARGA S080 (ESTRUCTURA)"                                    
239400          DELIMITED BY SIZE INTO WS-DET-RM-MSG                                
239600   PERFORM 20000038-ESC-REPMENSA .                                            
239800                                                                              
240000   MOVE 109                     TO WKS-S080-NUMPASO  .                        
240200   MOVE 0                       TO WKS-S080-NUMSUC   .                        
240400   MOVE WS02-FECHA-LINEA        TO WKS-S080-FECHA    .                        
240600   PERFORM 40000080-CARGA-DATOS-S080 .                                        
240800                                                                              
241000   STRING "TERMINO CARGA S080 (ESTRUCTURA)"                                   
241200          DELIMITED BY SIZE INTO WS-DET-RM-MSG                                
241400   PERFORM 20000038-ESC-REPMENSA .                                            
241600                                                                              
241800   IF WKS-S080-RS-CARGA = 0 OR 1                                              
242000      MOVE 0                  TO WKS-S080-NUMSUC                  209950      
242200      MOVE W77-IND-S080       TO WS-MSG-N-04                                  
242400      MOVE WKS-S080-RS-CARGA  TO WS-MSG-RS                        210050      
242600      STRING " CARGA S080 OK RS = "    , WS-MSG-RS                            
242800             " TOTAL SUC/OPERATIVAS = ", WS-MSG-N-04                          
243000             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
243200      PERFORM 20000038-ESC-REPMENSA                                           
243400   ELSE                                                           210300      
243600      MOVE WKS-S080-RS-CARGA   TO WS-MSG-RS                       210350      
243800      MOVE WKS-S080-NUMSUC     TO WS-MSG-N-04                     210400      
244000      STRING " ERROR CARGA S080 RS = ", WS-MSG-RS                             
244200             " ULTIMA SUC = "         , WS-MSG-N-04                           
244400             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG              210600      
244600      MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                  
244800      PERFORM 20000038-ESC-REPMENSA                                           
245000      PERFORM 70000050-MENSAJE                                    210750      
245200      CALL SYSTEM DMTERMINATE .                                               
249600                                                                              
249800*=================                                                            
250000 10000012-OBTB05-PRODU-INT.                                                   
250200*=================                                                            
250400                                                                              
250600   STRING "INICIO CARGA DE B05"                                               
250800          DELIMITED BY SIZE INTO WS-DET-RM-MSG                                
251000   PERFORM 20000038-ESC-REPMENSA .                                            
251200                                                                              
251400   MOVE 0 TO WS-FIN-B05                                                       
251600             WS-B05-TB-INDEX .                                                
251800   SET S500B05INSTRUMEN TO BEGINNING  .                                       
252000                                                                              
252200   PERFORM 10000014-CARGA-B05-MEM UNTIL WS-FIN-B05 = 1 .                      
252400                                                                              
252600   STRING "TERMINO CARGA DE B05"                                              
252800          DELIMITED BY SIZE INTO WS-DET-RM-MSG                                
253000   PERFORM 20000038-ESC-REPMENSA .                                            
253200                                                                              
253400 10000014-CARGA-B05-MEM.                                                      
253600*========================                                                     
255600                                                                              
255800   PERFORM 90000005-B05INSTRUMEN-FINDN .                                      
256000                                                                              
256200   IF WS-STATUS-BASE = 0                                                      
256400      ADD 1  TO WS-B05-TB-INDEX                                               
256420      IF WS-B05-TB-INDEX > 30                                                 
256440         STRING "MAS DE 30 REG EN B05 "                                       
256460                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
256480         MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                               
256500         PERFORM 20000038-ESC-REPMENSA                                        
256520         PERFORM 70000050-MENSAJE                                             
256540         MOVE 1                 TO WS-FIN-B05                                 
256560      ELSE                                                                    
256600         MOVE B05-NUM-PRODUCTO  TO                                            
256800              WS-B05-TABLA-PROD(WS-B05-TB-INDEX)                              
257000         MOVE B05-NUM-INSTRUM   TO                                            
257200              WS-B05-TABLA-INTS(WS-B05-TB-INDEX)                              
257400         MOVE B05-MONEDA        TO                                            
257600              WS-B05-TABLA-MONE(WS-B05-TB-INDEX)                              
257800         MOVE B05-IND-PAGOREND  TO                                            
258000              WS-B05-TABLA-INDP(WS-B05-TB-INDEX)                              
258200         MOVE B05-IND-RENDDIA   TO                                            
258400              WS-B05-TABLA-DIME(WS-B05-TB-INDEX)                              
258600   ELSE                                                                       
258800   IF WS-DB-NOTFOUND                                                          
259000      MOVE 1 TO WS-FIN-B05                                                    
259200   ELSE                                                                       
259400      MOVE DMSTATUS(DMCATEGORY)     TO WS-STATUS-BASE                         
259600      STRING "ERR FIND B05INSTRUMEN ", WS-STATUS-BASE                         
259800             DELIMITED BY SIZE INTO    WS-0101-TEXT-MSG                       
260000      MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                  
260200      PERFORM 20000038-ESC-REPMENSA                                           
260400      PERFORM 70000050-MENSAJE                                                
260600      CALL SYSTEM DMTERMINATE .                                               
260800                                                                              
261000*****************************************************************             
261200* ABRE/GENERA ARCHIVO GBNPRSLT                                  *             
261400*****************************************************************             
261600                                                                              
261800*=================                                                            
262000 10000013-OPEN-ARCHRSLT.                                                      
262200*=================                                                            
262400                                                                              
262600   MOVE WS02-NUM-CSI   TO I02-TIT-TEMT-CSI.                                   
262800   MOVE WS-FECHA-PROY  TO I02-TIT-TEMT-FEC.                                   
263000                                                                              
263200   CHANGE ATTRIBUTE NEWFILE   OF I02-ARCHRSLT TO VALUE FALSE     .            
263400*  CHANGE ATTRIBUTE EXCLUSIVE OF I02-ARCHRSLT TO VALUE TRUE      .            
263600   CHANGE ATTRIBUTE TITLE     OF I02-ARCHRSLT TO I02-TIT-ARCHRSLT.            
263800                                                                              
264000   IF ATTRIBUTE RESIDENT OF I02-ARCHRSLT = VALUE TRUE                         
264200      OPEN EXTEND I02-ARCHRSLT                                                
264400   ELSE                                                                       
264600      OPEN OUTPUT I02-ARCHRSLT.                                               
264800                                                                              
265000*=================                                                            
265200 10000010-INICIO-PROCESO.                                                     
265400*=================                                                            
265600                                                                              
265800   MOVE 0  TO  WS-1ERAVEZ                                                     
266000               WS-I01-REG-LEIDO                                               
266200               WS-VARIABLES-HI                                                
266400               WS-RECIBE-BAJA                                                 
266600               WS-SEC1-REC                                                    
266800               WS-SEC2-REC                                                    
267000               WS-SEC3-REC                                                    
267200               WS-SEC1-REG-LE                                                 
267400               WS-SEC1-REG-ES                                                 
267600               WS-SEC1-REG-AC                                                 
267800               WS-SEC1-REG-ER                                                 
268000               WS-SEC2-REG-LE                                                 
268200               WS-SEC2-REG-ES                                                 
268400               WS-SEC2-REG-AC                                                 
268600               WS-SEC2-REG-ER                                                 
268800               WS-SEC3-REG-LE                                                 
269000               WS-SEC3-REG-ES                                                 
269200               WS-SEC3-REG-AC                                                 
269400               WS-SEC3-REG-ER                                                 
269600               WS-SEC3-REG-TO                                                 
269800               WS-SEC3-REG-TE   .                                             
270000   MOVE " " TO WS-DET-RM-MSG    .                                             
270200                                                                              
270400   MOVE 1   TO WKS-NUMACT-LIB (110)        .                                  
270600   MOVE 2   TO WKS-NUMACT-LIB (111)        .                                  
270800   MOVE 3   TO WKS-NUMACT-LIB (112)        .                                  
271000   MOVE 4   TO WKS-NUMACT-LIB (113)        .                                  
271200   MOVE 5   TO WKS-NUMACT-LIB (114)        .                                  
271400   MOVE 6   TO WKS-NUMACT-LIB (115)        .                                  
271600   MOVE 7   TO WKS-NUMACT-LIB (116)        .                                  
271800                                                                              
272000   PERFORM 40000005-FECHA                  .                                  
272200   MOVE WS-FECHA2-AAAA   TO WS-FECHA3-AAAA .                                  
272400   MOVE WS-FECHA2-MM     TO WS-FECHA3-MM   .                                  
272600   MOVE WS-FECHA2-DD     TO WS-FECHA3-DD   .                                  
272800   PERFORM 40000001-HORA                   .                                  
273000   MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH    .                                  
273200   MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM    .                                  
273400   MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS    .                                  
273600   MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC    .                                  
273800                                                                              
274000   STRING "INICIO PROCESO",                                                   
274200          " FECHA: ", WS-FECHA-AAAAMMDD,                                      
274400          " HORA: ",  WS-HORA-HHMMSSCC                                        
274600          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
274800   PERFORM 20000038-ESC-REPMENSA .                                            
275000                                                                              
275200   IF WS-88-ESPRUEBA                                                          
275400      STRING "MIXNUMBER ="    , CARAT-MIX          ,                          
275600             " VALUE ="       , WS-PARAM-VALUE-N   ,                          
275800             " PRUEBA EN "    , WS-DH-NOM-EQUIPO                              
276000             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
276200   ELSE                                                                       
276400      STRING "MIXNUMBER="     , CARAT-MIX          ,                          
276600             " VALUE="        , WS-PARAM-VALUE-N   ,                          
276800             " PRODUCCION EN ", WS-DH-NOM-EQUIPO                              
277000             DELIMITED BY SIZE INTO WS-DET-RM-MSG .                           
277200   PERFORM 20000038-ESC-REPMENSA .                                            
277400                                                                              
277600   IF WS-88-EVE-FINAL                                                         
277800      STRING "TERMINO PROCESO X CTRL "     ,                                  
278000             " - CTSEC: ", I03-CTRL-SEC                                       
278200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
278400   ELSE                                                                       
278600      STRING "CONTINUO EN "                ,                                  
278800             " - CTSEC: ", I03-CTRL-SEC    ,                                  
279000             " - CTREG: ", I03-CTRL-NUM-REG                                   
279200             DELIMITED BY SIZE INTO WS-DET-RM-MSG .                           
279400   PERFORM 20000038-ESC-REPMENSA .                                            
279600                                                                              
279800   PERFORM 40000001-HORA                   .                                  
280000   MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH    .                                  
280200   MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM    .                                  
280400   MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS    .                                  
280600   MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC    .                                  
280800   STRING "*** ABRO BASE DEL S500 ", WS-HORA-HHMMSSCC                         
281000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
281200   PERFORM 20000038-ESC-REPMENSA .                                            
281400                                                                              
281600                                                                              
281800   MOVE WS02-FECHA-LINEA          TO WS-FECHA          .                      
282000   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
282200   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
282400   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
282600   MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-1        .                      
282800                                                                              
283000   MOVE WS-FECHA-PROY             TO WS-FECHA          .                      
283200   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
283400   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
283600   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
283800   MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-2        .                      
284000                                                                              
284200   PERFORM 40000005-FECHA                              .                      
284400   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
284600   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
284800   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
285000   MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-3        .                      
285200                                                                              
285400   STRING "FECHA PROCESO : " , WS-MSG-A-1                                     
285600          "FECHA ARCHIVO : " , WS-MSG-A-2                                     
285800          "FECHA MAQUINA : " , WS-MSG-A-3                                     
286000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
286200   PERFORM 20000038-ESC-REPMENSA .                                            
286400                                                                              
286600   STRING "LB S080BD01CON    " , WS-NAME-LIB-S080L700                         
286800          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
287000   PERFORM 20000038-ESC-REPMENSA .                                            
287020                                                                              
287040   STRING "LB S080TARIFAS    " , WS-NAME-LIB-S080IVAS                         
287060          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
287080   PERFORM 20000038-ESC-REPMENSA .                                            
287200                                                                              
287400   STRING "LB S500L035       " , WS-NAME-LIB-S038MAPLI                        
287600          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
287800   PERFORM 20000038-ESC-REPMENSA .                                            
288000                                                                              
288200*=================                                                            
288400 10000009-INI-PGM-MAPLI.                                                      
288600*=================                                                            
288800                                                                              
289000   MOVE " "                  TO W77-ID-NOMB-LIB          .                    
289200   MOVE WS-PARAM-VALUE-N     TO W77-ID-NUM-COPIA-MAPLI   .                    
289400   MOVE 02                   TO W77-ID-TPODSP-INFO-MAPLI .                    
289600   MOVE 00                   TO W77-ID-ESINI-GRUPO-MAPLI .                    
289800   MOVE 03                   TO W77-ID-NUM-GRUPO-MAPLI   .                    
290000   MOVE "SERVICIO GBNP, CARGA DE TASAS POR CUENTA."                           
290200                             TO W77-ID-NOMB-LIB          .                    
290400   PERFORM 70000950-INI-PGM-MAPLI                        .                    
290600   IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                       
290800      STRING "INICIO PGM MAPLI = "                                            
291000              DELIMITED BY SIZE INTO W77-ERR-DATO-MAPLI                       
291200      PERFORM 50000900-ERROR-MAPLI .                                          
291400                                                                              
291600*****************************************************************             
291800* PROCESO DE ARCHIVOS GBNP SECUENCIAL 1,2 Y 3                   *             
292000* CORRESOLO P168                                                *             
292200*****************************************************************             
292400                                                                              
292600*=================                                                            
292800 20000000-PROCESO.                                                            
293000*=================                                                            
293200                                                                              
293400   IF WS-88-P-VAL-ARCH                                                        
293600      PERFORM 20000001-PROCESO-ARCHGBNP UNTIL WS-88-PROC-FIN                  
293800   ELSE                                                                       
294000   IF WS-88-P-VAL-P168                                                        
294200      PERFORM 20000002-CORRE-P168 .                                           
294400                                                                              
294600 20000001-PROCESO-ARCHGBNP.                                                   
294800*===========================                                                  
295000                                                                              
295200   STRING "INICIA PROCESO DE ARCHIVO GBNP "                                   
295400          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
295600   PERFORM 20000038-ESC-REPMENSA .                                            
295800                                                                              
296000   MOVE 0 TO WS-I02-REG-ESCRI                                                 
296200             WS-I01-FIN-ARCH                                                  
296400             WS-ARCHGBNP-RES                                                  
296600             WS-ARCHGBNP-BUS .                                                
296800                                                                              
297000   IF WS-88-EVE-CONTI OR WS-88-EVE-EJ130                                      
297200                                                                              
297400      STRING "INICIA BUSCA GBNP "  ,                                          
297500             " -SECUENCIAL: "      , I03-CTRL-SEC                             
297600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
297800      PERFORM 20000038-ESC-REPMENSA                                           
298000                                                                              
298200      MOVE 1 TO WS-OPCION-MAPLI                                               
298400      PERFORM 50000000-INI-ACTIVIDAD                                          
298600                                                                              
298800      PERFORM 20000003-ASIGNA-SEC                                             
299000      PERFORM 20000004-ABRE-ARCHGBNP UNTIL WS-88-FINBUS                       
299200                                                                              
299400      PERFORM 50000002-FIN-ACTIVIDAD                                          
299600                                                                              
299800      STRING "TERMINA BUSCA GBNP " ,                                          
300000             " -ACTIVIDAD : "      , WS-EVE-REALIZA                           
300400             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
300600             PERFORM 20000038-ESC-REPMENSA                                    
300650                                                                              
300700      PERFORM 20000021-FIN-BUSCAGBNP                                          
300800                                                                              
301000      IF WS-88-EVE-CONTI                                                      
301200         PERFORM 20000005-REC-ARCHGBNP                                        
301400                                                                              
301600         STRING "INICIA LECTURA ARCHIVO GBNP " ,                              
301700                " -SECUENCIAL: "               , I03-CTRL-SEC                 
301800                DELIMITED BY SIZE INTO WS-DET-RM-MSG                          
302000         PERFORM 20000038-ESC-REPMENSA                                        
302200                                                                              
302400         MOVE 2 TO WS-OPCION-MAPLI                                            
302600         PERFORM 50000000-INI-ACTIVIDAD                                       
302800                                                                              
303000         PERFORM 20000006-VER-B00-SEC12                                       
303100                                                                              
303200         PERFORM 20000006-LEE-ARCHGBNP                                        
303400                                                                              
303600         PERFORM 20000007-LEE-VAL-ACT-GBNP UNTIL WS-88-FIN-ARCH01             
303800                                                                              
304000         PERFORM 50000002-FIN-ACTIVIDAD                                       
304200         PERFORM 20000008-MUEVO-ACT-FIN                                       
304400                                                                              
304500         STRING "TERMINA LECTURA ARCHIVO GBNP " ,                             
304600                " -ACTIVIDAD : "                , WS-EVE-REALIZA              
304700                DELIMITED BY SIZE INTO WS-DET-RM-MSG                          
304800                PERFORM 20000038-ESC-REPMENSA .                               
305200                                                                              
305400   PERFORM 20000009-REW-ARCHCTRL .                                            
305600                                                                              
305800   IF WS-88-EVE-GENRE                                                         
306000      PERFORM 20000021-GENE-REPOTASA .                                        
306200                                                                              
306400   STRING "TERMINA PROCESO DE ARCHIVO GBNP "                                  
306600          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
306800   PERFORM 20000038-ESC-REPMENSA .                                            
307000                                                                              
307200 20000003-ASIGNA-SEC.                                                         
307400*=====================                                                        
307600                                                                              
307800   MOVE WS02-NUM-CSI  TO I02-TIT-ARCT-CSI.                                    
308000   MOVE WS-FECHA-PROY TO I02-TIT-ARCT-FEC.                                    
308200                                                                              
308400   STRING "BUSCA SECUENCIAL ", I03-CTRL-SEC                                   
308600                DELIMITED BY SIZE INTO WS-DET-RM-MSG .                        
308800                                                                              
309000   PERFORM 20000038-ESC-REPMENSA .                                            
309200                                                                              
309400   MOVE I03-CTRL-SEC TO I02-TIT-ARCT-SEC .                                    
309600                                                                              
309800   PERFORM 20000010-TIT-ARCHGBNP .                                            
310000                                                                              
310200 20000010-TIT-ARCHGBNP.                                                       
310400*========================                                                     
310600                                                                              
310800   CHANGE ATTRIBUTE TITLE OF I01-ARCHGBNP TO I01-TIT-ARCHGBNP .               
311000                                                                              
311200 20000004-ABRE-ARCHGBNP.                                                      
311400*========================                                                     
311600                                                                              
311800   PERFORM 20000011-BUSCA-ARCHGBNP .                                          
312000                                                                              
312200   IF WS-88-SIEXI                                                             
312400      MOVE 1 TO WS-ARCHGBNP-BUS                                               
312500      MOVE 0 TO WS-EVE-REALIZA                                                
312600      MOVE 5 TO WS-SECS-OPCION                                                
312800      PERFORM 20000043-SUMA-ESTADISTICOS                                      
313000                                                                              
313200      OPEN INPUT I01-ARCHGBNP                                                 
313400      MOVE ATTRIBUTE LASTRECORD OF I01-ARCHGBNP TO WS-I01-LASTREC             
313600      ADD  1 TO WS-I01-LASTREC                                                
313800                                                                              
314000      STRING "ABRO SECUENCIAL "   , I03-CTRL-SEC      ,                       
314200             " -NUM REG CTRL : "  , I03-CTRL-NUM-REG  ,                       
314400             " -NUM REG GBNP : "  , WS-I01-LASTREC                            
314600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
314800      PERFORM 20000038-ESC-REPMENSA                                           
315000   ELSE                                                                       
315200   IF WS-88-SI-BAJA                                                           
315400      MOVE 1 TO WS-EVE-REALIZA                                                
315600   ELSE                                                                       
315800   IF WS-88-PROCE3                                                            
316000      PERFORM 40000001-HORA                                                   
316200      PERFORM 40000002-VALIDA-9AM                                             
316300      PERFORM 40000005-FECHA                                                  
316400      PERFORM 40000003-VALIDA-21PM                                            
316600   ELSE                                                                       
316700   IF WS-88-OPEN-BD                                                           
316800      PERFORM 40000000-VERIF-B00 .                                            
317000                                                                              
317200   IF WS-88-EVE-TERMI                                                         
317400      MOVE 1 TO WS-ARCHGBNP-BUS                                               
317500                WS-PROCESO      .                                             
317600                                                                              
317800 20000011-BUSCA-ARCHGBNP.                                                     
318000*========================                                                     
318200                                                                              
318400   IF ATTRIBUTE RESIDENT OF I01-ARCHGBNP = VALUE TRUE                         
318600      MOVE 1 TO WS-ARCHGBNP-RES                                               
318800   ELSE                                                                       
320000      WAIT AND RESET 30                                                       
320200                     ATTRIBUTE EXCEPTIONEVENT OF MYSELF                       
320400                     GIVING    WS-WAIT-EVENTO                                 
320600      IF WS-88-PROCE1                                                         
320800         PERFORM 20000012-BUSCA2-ARCHGBNP .                                   
321000                                                                              
321200 20000012-BUSCA2-ARCHGBNP.                                                    
321400*=========================                                                    
321600                                                                              
321800   MOVE 2 TO I02-TIT-ARCT-SEC                                                 
322000             I03-CTRL-SEC        .                                            
322200   PERFORM 20000010-TIT-ARCHGBNP .                                            
322400                                                                              
322600   IF ATTRIBUTE RESIDENT OF I01-ARCHGBNP = VALUE TRUE                         
322800      MOVE 1 TO WS-ARCHGBNP-RES                                               
323000   ELSE                                                                       
324200      WAIT AND RESET 30                                                       
324400                     ATTRIBUTE EXCEPTIONEVENT OF MYSELF                       
324600                     GIVING    WS-WAIT-EVENTO                                 
324800      MOVE 1 TO I02-TIT-ARCT-SEC                                              
325000                I03-CTRL-SEC                                                  
325200                                                                              
325400      PERFORM 20000010-TIT-ARCHGBNP .                                         
325600                                                                              
325800 20000007-LEE-VAL-ACT-GBNP.                                                   
326000*=========================                                                    
326200                                                                              
326400   IF I01-TASA-IND = "#ICACC#"                                                
326600      PERFORM 20000013-GUA-ARCHRSLT                                           
326800   ELSE                                                                       
327000      PERFORM 20000009-REW-ARCHCTRL .                                         
327200                                                                              
327400   IF WS-88-SI-BAJA                                                           
327600      MOVE 1 TO WS-I01-FIN-ARCH                                               
327800   ELSE                                                                       
328000      PERFORM 20000006-LEE-ARCHGBNP .                                         
328200                                                                              
328400 20000013-GUA-ARCHRSLT.                                                       
328600*=======================                                                      
328800                                                                              
329000   PERFORM 20000014-INICIALIZA-VARIABLES.                                     
329200                                                                              
329400   IF WS-88-EVE-CONTI                                                         
329420*      MOVE WS03-SUC-PROMOTORA TO WKS-S080-NUMSUC                             
329440*      PERFORM 42000080-DATOS-S080                                            
329460*      IF W88-S080-DATO-OK                                                    
329480*         IF WKS-S080-NUMCSI = WS02-NUM-CSI                                   
329500            PERFORM 20000015-VALIDA-GENERAL                                   
329520*         ELSE                                                                
329540*            MOVE 1009 TO WS-I02-ERR-CODE                                     
329560*      ELSE                                                                   
329600*         MOVE 1015 TO WS-I02-ERR-CODE                                        
329800   ELSE                                                                       
330000      MOVE 1003 TO WS-I02-ERR-CODE  .                                         
330200                                                                              
330400   IF WS-88-ERR-CODE-NOK                                                      
330600      PERFORM 20000042-ERR-REPMENSA .                                         
330800   IF WKS-CTO-CLO = 1                                                         
330900      EXIT PERFORM.                                                           
331000   PERFORM 20000018-MUEVE-ARCHRSLT  .                                         
331200   PERFORM 20000019-ESC-ARCHRSLT    .                                         
331400   IF (WS-88-EVE-CONTI   AND (WS-88-PROCE1 OR WS-88-PROCE2)) OR               
331500       WS-88-NOEJE-P168  AND  WS-88-PROCE3                                    
331600       PERFORM 40000004-VALIDA-30S  .                                         
331800                                                                              
332000 20000021-FIN-BUSCAGBNP.                                                      
332200*========================                                                     
333000                                                                              
333200   IF WS-88-NOEXI                                                             
333400      STRING "1004 NO SE RECIBIO ARCHIVO GBNP ", I03-CTRL-SEC                 
333600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
333800      PERFORM 20000038-ESC-REPMENSA .                                         
334000                                                                              
334200   IF WS-88-NO-BAJA AND WS-88-PROC-FIN                                        
334400      IF WS-88-PROCE3                                                         
334600         MOVE 4 TO I03-CTRL-SEC                                               
334800      ELSE                                                                    
335000         MOVE 3 TO I03-CTRL-SEC .                                             
335200                                                                              
335400 20000014-INICIALIZA-VARIABLES.                                               
335600*==============================                                               
335800                                                                              
336000   MOVE 0             TO WS-I02-ERR-CODE                                      
336200                         WS-S500B03CONTRATOS                                  
336400*                        WS-B-TASASEC                                         
336600                         WS-B05-TB-INDP                                       
336800                         WS-B05-TB-DIME                                       
337000                         WS06-TASA-BRUTA                                      
337200                         WS-I02-RATE-B06                                      
337400                         WS-I02-REND-B03                                      
337500                         WS-I02-FECH-S                                        
337550                         WS-I02-RATE-U                                        
337600                         WS-I02-PASO-S                                        
337700                         WKS-CTO-CLO     .                                    
337800*  MOVE I01-TASA-SUC  TO WS03-SUC-PROMOTORA  .                                
338000   MOVE I01-TASA-CTO  TO WS03-NUM-CONTRATO                                    
338200                         WS-NUM-CONTRATO     .                                
338400   MOVE LOW-VALUES    TO I02-R-ARCHRSLT      .                                
338600                                                                              
338800 20000015-VALIDA-TASA.                                                        
339000*======================                                                       
339200                                                                              
339400   MOVE 0 TO WS-TASA-CONV                                                     
339450             WS-TASA-ENT                                                      
339500             WS-TASA-DEC  .                                                   
339550                                                                              
339600   UNSTRING I01-TASA-TASA DELIMITED BY  "-"                                   
339800                                    INTO     WS-TASA-ENT                      
340000                                    COUNT IN WS-C-POINTER .                   
340200   IF WS-C-POINTER > 0                                                        
340250      UNSTRING I01-TASA-TASA DELIMITED BY "." OR "~"                          
340300                                       INTO     WS-TASA-ENT                   
340350                                       COUNT IN WS-C-POINTER                  
340400      MOVE WS-C-POINTER TO WS-P-POINTER                                       
340600      ADD 2 TO WS-P-POINTER                                                   
340800      UNSTRING I01-TASA-TASA DELIMITED BY "~"                                 
341000                                       INTO          WS-TASA-DEC              
341200                                       COUNT IN      WS-C-POINTER             
341400                                       WITH POINTER  WS-P-POINTER             
341600      COMPUTE WS-TASA-CONV =                                                  
341800              WS-TASA-ENT + (WS-TASA-DEC/(10**WS-C-POINTER) ).                
342000                                                                              
342200   MOVE WS-TASA-CONV-N TO WS-I02-RATE .                                       
342400*  IF WS-I02-RATE = 0                                                         
342600*     MOVE 1005 TO WS-I02-ERR-CODE .                                          
342800*  ELSE                                                                       
343000*  IF WS-TASA-CONV > 24                                                       
343200*     MOVE 1012 TO WS-I02-ERR-CODE .                                          
343400                                                                              
343600 20000015-VALIDA-GENERAL.                                                     
343800*========================                                                     
344000                                                                              
344200   PERFORM 90000003-B03SXCTO-LOCK .                                           
344400                                                                              
344600   IF WS-STATUS-BASE > 0                                                      
344800      IF WS-DB-NOTFOUND                                                       
345000         MOVE 1007 TO WS-I02-ERR-CODE                                         
345200      ELSE                                                                    
345400      IF WS-DB-DEADLOCK                                                       
345600         MOVE 1006 TO WS-I02-ERR-CODE                                         
345800      ELSE                                                                    
346000         MOVE 1011 TO WS-I02-ERR-CODE                                         
346200                                                                              
346400         MOVE DMSTATUS(DMCATEGORY) TO  WS-STATUS-BASE                         
346600         STRING "ERR FIND B03CONTRATOS ", WS-STATUS-BASE                      
346800                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
347000         MOVE WS-0101-TEXT-MSG     TO  WS-DET-RM-MSG                          
347200                                                                              
347400         PERFORM 20000038-ESC-REPMENSA                                        
347600         PERFORM 70000050-MENSAJE                                             
347800   ELSE                                                                       
347850   IF B03-MARCA-CLON = 2                                                      
347900      MOVE 1            TO WKS-CTO-CLO                                        
347950   ELSE                                                                       
347955   IF B03-MARCA-CLON = 3                                                      
347960      MOVE 1            TO WKS-CTO-CLO                                        
347965      MOVE 6            TO WS-SECS-OPCION                                     
347970      PERFORM 20000043-SUMA-ESTADISTICOS                                      
347975   ELSE                                                                       
348000      PERFORM 20000035-VAL-INSTRUME                                           
348200              VARYING  WS-B05-TB-INDEX FROM 1 BY 1                            
348400              UNTIL    WS-B05-TB-INDEX > 30                                   
348600                                                                              
348800      IF WS-88-ERR-CODE-OK                                                    
349000         PERFORM 20000044-MUEVE-B03                                           
349200         PERFORM 20000015-VALIDA-TASA                                         
349400*        IF WS-88-ERR-CODE-OK                                                 
349800         PERFORM 20000016-VALIDA-CTO  .                                       
350400*        ELSE                                                                 
350600*        IF WS-88-PROCE3                                                      
350800*           PERFORM 20000036-OBT-TASAPAGA .                                   
351000                                                                              
351200   IF WS-88-ERR-CODE-NOK OR WKS-CTO-CLO = 1                                   
351400      FREE S500B03CONTRATOS .                                                 
351600                                                                              
351800 20000016-VALIDA-CTO.                                                         
352000*=====================                                                        
352200                                                                              
352400   IF WS03-88-S-CANCELADA                                                     
352600      MOVE 1002 TO WS-I02-ERR-CODE                                            
352800   ELSE                                                                       
353000   IF WS03-GBNP-SERV-IND = 0                                                  
353200      MOVE 1010 TO WS-I02-ERR-CODE                                            
353400   ELSE                                                                       
353600   IF WS-88-B05-NOP                                                           
353800      MOVE 1008 TO WS-I02-ERR-CODE .                                          
354000                                                                              
354200   IF WS-88-PROCE3                                                            
354400      PERFORM 20000036-OBT-TASAPAGA .                                         
354600                                                                              
354700   IF WS-88-ERR-CODE-OK                                                       
354800      PERFORM 20000041-CAM-PRODUCTO .                                         
355000                                                                              
355200 20000017-ACTUALIZA-B03.                                                      
355400*========================                                                     
355600                                                                              
355800*  STRING WS-TASA-CONV-N ,I03-CTRL-SEC DELIMITED BY SIZE                      
356000*                                      INTO WS-B-TASASEC-A .                  
356200   MOVE 0                TO B03-DIAC-GBNP.                                    
356400   MOVE WS-FECHA-PROY    TO B03-GBNP-TASA-FEC .                               
356600   MOVE WS-TASA-CONV     TO B03-GBNP-TASA-BRUTA  .                            
356700   MOVE I03-CTRL-SEC     TO B03-GBNP-TASA-SEC    .                            
356800                                                                              
357000   PERFORM 90000000-BEGIN-TRANSACTION  .                                      
357020   IF WS-STATUS-BASE > 0                                                      
357040      IF WS-STATUS-BASE = 15                                      243700      
357060         NEXT SENTENCE                                            243750      
357080      ELSE                                                        243800      
357100         CALL SYSTEM DMTERMINATE .                                            
357200                                                                              
357400   PERFORM 90000003-B03CONTRATOS-STORE .                                      
357600                                                                              
357800   IF WS-STATUS-BASE = 0                                                      
358000      MOVE 3 TO WS-SECS-OPCION                                                
358200      PERFORM 20000043-SUMA-ESTADISTICOS                                      
358400   ELSE                                                                       
358600      MOVE 1011 TO WS-I02-ERR-CODE                                            
358800      MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE                             
359000      STRING "ERR STORE B03CONTRATOS ", WS-STATUS-BASE                        
359200             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
359400      PERFORM 70000050-MENSAJE .                                              
359600                                                                              
359800   PERFORM 90000000-END-TRANSACTION .                                         
359820   IF WS-STATUS-BASE > 0                                                      
359840      IF WS-STATUS-BASE = 15                                      243700      
359860         NEXT SENTENCE                                            243750      
359880      ELSE                                                        243800      
359900         CALL SYSTEM DMTERMINATE .                                            
360000                                                                              
360200 20000008-MUEVO-ACT-FIN.                                                      
360400*=======================                                                      
360600                                                                              
360800   MOVE 0 TO WS-I02-REG-ESCRI                                                 
361000             WS03-NUM-CONTRATO     .                                          
361200   PERFORM 20000020-CIER-ARCHGBNP  .                                          
361400                                                                              
361600   IF WS-88-SI-BAJA                                                           
361800      MOVE 1 TO WS-PROCESO                                                    
362200   ELSE                                                                       
362400   IF WS-88-PROCE1                                                            
362600      MOVE 2 TO I03-CTRL-SEC                                                  
363000   ELSE                                                                       
363200   IF WS-88-PROCE2                                                            
363400      MOVE 3 TO I03-CTRL-SEC                                                  
363600      MOVE 1 TO WS-PROCESO                                                    
364000   ELSE                                                                       
364200   IF WS-88-PROCE3                                                            
364400      MOVE 4 TO I03-CTRL-SEC                                                  
364600      MOVE 2 TO WS-EVE-REALIZA                                                
364800      IF WS-88-NOEJE-P168                                                     
365000         PERFORM 20000002-CORRE-P168 .                                        
365300                                                                              
365400 20000035-VAL-INSTRUME.                                                       
365600*=======================                                                      
365800                                                                              
365820   IF B03-NUM-PRODUCTO > 10000 OR B03-NUM-INSTRUM > 10000 OR                  
365840      B03-MONEDA > 100                                                        
365860      MOVE 1011 TO WS-I02-ERR-CODE                                            
365880      MOVE 31   TO WS-B05-TB-INDEX                                            
365900   ELSE                                                                       
366000   IF WS-B05-TABLA-PROD (WS-B05-TB-INDEX) = B03-NUM-PRODUCTO AND              
366200      WS-B05-TABLA-INTS (WS-B05-TB-INDEX) = B03-NUM-INSTRUM  AND              
366400      WS-B05-TABLA-MONE (WS-B05-TB-INDEX) = B03-MONEDA                        
366600      MOVE WS-B05-TABLA-INDP(WS-B05-TB-INDEX) TO WS-B05-TB-INDP               
366800      MOVE WS-B05-TABLA-DIME(WS-B05-TB-INDEX) TO WS-B05-TB-DIME               
367000      MOVE 31 TO WS-B05-TB-INDEX                                              
367200   ELSE                                                                       
367400   IF WS-B05-TB-INDEX = 30                                                    
367600      MOVE 1011 TO WS-I02-ERR-CODE                                            
367800      MOVE 31   TO WS-B05-TB-INDEX                                            
368000      STRING "NO EXISTE PROD/INTS/MON "     ,                                 
368200             " - CTO : " , I02-RSLT-CTO     ,                                 
368400             " - SEC : " , I03-CTRL-SEC     ,                                 
368600             " - PRO : " , I02-RSLT-PROD    ,                                 
368800             " - INS : " , I02-RSLT-INST    ,                                 
369000             " - MON : " , I02-RSLT-CURR    ,                                 
369200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
369400      PERFORM 20000038-ESC-REPMENSA .                                         
369600                                                                              
369800 20000036-OBT-TASAPAGA.                                                       
370000*=======================                                                      
370200                                                                              
370400   IF WS03-GBNP-SERV-IND = 1                                                  
370600      IF WS-88-B05-DIA                                                        
370800         MOVE WS03-RENDIA-IPAB TO WS-I02-REND-B03                             
371000      ELSE                                                                    
371200      IF WS-FECHA-PROY = B06-FECREAL-CORTE                                    
371400         MOVE WS03-INTS-CAPIT  TO WS-I02-REND-B03                             
371600      ELSE                                                                    
371800         MOVE 0                TO WS-I02-REND-B03                             
372000   ELSE                                                                       
372100   IF WS03-GBNP-SERV-IND = 2                                                  
372200      PERFORM 90000006-B06SXCTO-FIND                                          
372400                                                                              
372600      IF WS-STATUS-BASE > 0                                                   
372800         MOVE 1013 TO WS-I02-ERR-CODE                                         
373000                                                                              
373200         MOVE DMSTATUS(DMCATEGORY) TO  WS-STATUS-BASE                         
373400         STRING "ERR FIND B06HISTORICO ", WS-STATUS-BASE                      
373600                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
373800         MOVE WS-0101-TEXT-MSG     TO  WS-DET-RM-MSG                          
374000                                                                              
374200         PERFORM 20000038-ESC-REPMENSA                                        
374400         PERFORM 70000050-MENSAJE                                             
374600      ELSE                                                                    
374800*        MOVE B06-TASA-BRUTA      TO WS06-TASA-BRUTA                          
375000         IF WS-88-B05-DIA                                                     
375200*           MOVE WS06-TASA-BRUTA    TO WS-I02-RATE-B06                        
375400*           MOVE WS03-USO-FUTURO-08 TO WS-B-TASASEC                           
375500            MOVE WS03-GBNP-TASA-FEC   TO WS-I02-FECH-S                        
375600            MOVE WS03-GBNP-TASA-SEC   TO WS-I02-PASO-S                        
375700            COMPUTE WS-I02-RATE-U = WS03-GBNP-TASA-BRUTA * 1000000            
375800            MOVE WS03-RENDIA-IPAB     TO WS-I02-REND-B03                      
376000         ELSE                                                                 
376200         IF WS-FECHA-PROY = B06-FECREAL-CORTE                                 
376400*           MOVE WS06-TASA-BRUTA    TO WS-I02-RATE-B06                        
376600*           MOVE WS03-USO-FUTURO-08 TO WS-B-TASASEC                           
376700            MOVE WS03-GBNP-TASA-FEC    TO WS-I02-FECH-S                       
376800            MOVE WS03-GBNP-TASA-SEC    TO WS-I02-PASO-S                       
376900            COMPUTE WS-I02-RATE-U = WS03-GBNP-TASA-BRUTA * 1000000            
377000            MOVE WS03-INTS-CAPIT       TO WS-I02-REND-B03 .                   
377200                                                                              
377400*  IF WS-88-ERR-CODE-OK                                                       
377600*     PERFORM 20000041-CAM-PRODUCTO .                                         
377800                                                                              
378000 20000044-MUEVE-B03.                                                          
378200*===================                                                          
378400                                                                              
378600   MOVE B03-NUM-PRODUCTO   TO WS03-NUM-PRODUCTO   .                           
378800   MOVE B03-NUM-INSTRUM    TO WS03-NUM-INSTRUM    .                           
379000   MOVE B03-MONEDA         TO WS03-MONEDA         .                           
379100   MOVE B03-SUC-PROMOTORA  TO WS03-SUC-PROMOTORA  .                           
379200   MOVE B03-STATUS         TO WS03-STATUS         .                           
379400   MOVE B03-GBNP-SERV-IND  TO WS03-GBNP-SERV-IND  .                           
379600   MOVE B03-PRODUCTO-NVO   TO WS03-PRODUCTO-NVO   .                           
379800   MOVE B03-INSTRUM-NVO    TO WS03-INSTRUM-NVO    .                           
380000   MOVE B03-RENDIA-IPAB    TO WS03-RENDIA-IPAB    .                           
380200   MOVE B03-INTS-CAPIT     TO WS03-INTS-CAPIT     .                           
380400   MOVE B03-GBNP-TASA-FEC  TO WS03-GBNP-TASA-FEC  .                           
380500   MOVE B03-GBNP-TASA-BRUTA TO WS03-GBNP-TASA-BRUTA .                         
380600   MOVE B03-GBNP-TASA-SEC   TO WS03-GBNP-TASA-SEC   .                         
380800                                                                              
381000 20000041-CAM-PRODUCTO.                                                       
381200*=======================                                                      
381400                                                                              
381600   IF WS03-PRODUCTO-NVO > 0 AND WS03-INSTRUM-NVO > 0                          
381800                            AND WS-88-B05-MEN                                 
382000      IF WS03-88-PIM-PREPAGADA                                                
382200         PERFORM 90000044-B44SXCTOSEVOL-FIND                                  
382400         IF WS-STATUS-BASE = 0                                                
382600            MOVE 1001 TO WS-I02-ERR-CODE                                      
382800         ELSE                                                                 
383000         IF WS-DB-NOTFOUND                                                    
383200            PERFORM 20000017-ACTUALIZA-B03                                    
383400         ELSE                                                                 
383600            MOVE 1014 TO WS-I02-ERR-CODE                                      
383800                                                                              
384000            MOVE DMSTATUS(DMCATEGORY) TO  WS-STATUS-BASE                      
384200            STRING "ERR FIND B44CTOSEVOL ", WS-STATUS-BASE                    
384400                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
384600            MOVE WS-0101-TEXT-MSG     TO  WS-DET-RM-MSG                       
384800                                                                              
385000            PERFORM 20000038-ESC-REPMENSA                                     
385200            PERFORM 70000050-MENSAJE                                          
385400      ELSE                                                                    
385600         MOVE 1001 TO WS-I02-ERR-CODE                                         
385800   ELSE                                                                       
386000      PERFORM 20000017-ACTUALIZA-B03.                                         
386200                                                                              
386400*****************************************************************             
386600* REPORTE TASA RUTINAS                                          *             
386800*****************************************************************             
387000                                                                              
387200 20000021-GENE-REPOTASA.                                                      
387400*=======================                                                      
387600                                                                              
387800   STRING "INICIO PROCESO DE GENERACION DE REPORTE"                           
388000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
388200   PERFORM 20000038-ESC-REPMENSA   .                                          
388400                                                                              
388600   MOVE 3 TO WS-OPCION-MAPLI                                                  
388700             I03-CTRL-SEC   .                                                 
388800   PERFORM 50000000-INI-ACTIVIDAD  .                                          
389000                                                                              
389200   PERFORM 20000022-CIES-ARCHRSLT  .                                          
389400   OPEN INPUT I02-ARCHRSLT         .                                          
389600   MOVE ATTRIBUTE LASTRECORD OF I02-ARCHRSLT TO WS-I02-LASTREC .              
389800   MOVE WS-I02-LASTREC TO WS-SEC3-REG-TO .                                    
390000   ADD 1               TO WS-SEC3-REG-TO .                                    
390200   PERFORM 20000023-ABRE-REPOTASA  .                                          
390400   PERFORM 20000031-MUEVE-REPOTASA .                                          
390600                                                                              
390800   IF WS-I02-LASTREC < 0                                                      
391000      PERFORM 20000024-ESC-ENC-REPOTASA                                       
391200      WRITE P01-R-REPOTASA FROM WS-NOIN-REPOTASA BEFORE 1 LINE                
391400   ELSE                                                                       
391600      PERFORM 20000025-ATRI-ARCHRSLT                                          
391800      PERFORM 70000000-CALCULA-ESPACIO                                        
392000      PERFORM 20000026-SORT-ARCHRSLT                                          
392200      PERFORM 20000027-LEE-ARCHRSLT                                           
392400      PERFORM 20000029-PRO-DET-REPOTASA UNTIL WS-88-FIN-ARCH02 .              
392600                                                                              
392800   CLOSE P01-REPOTASA WITH SAVE    .                                          
393000   MOVE 0 TO WS-I02-REG-ESCRI      .                                          
393200   MOVE 0 TO WS03-NUM-CONTRATO     .                                          
393400   MOVE 5 TO I03-CTRL-SEC          .                                          
393600   PERFORM 20000009-REW-ARCHCTRL   .                                          
393800   MOVE 1 TO WS-PROCESO                                                       
394000             WS-ENVIO-RSLT         .                                          
394200                                                                              
394400   PERFORM 50000002-FIN-ACTIVIDAD  .                                          
394600                                                                              
394800   STRING "TERMINA PROCESO DE GENERACION DE REPORTE"                          
395000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
395200   PERFORM 20000038-ESC-REPMENSA   .                                          
395400                                                                              
395600 20000023-ABRE-REPOTASA.                                                      
395800*=======================                                                      
396000                                                                              
396200   MOVE WS-FECHA-PROY                     TO WS-FECHA     .                   
396400   MOVE WS02-NUM-CSI                      TO CARAT-CSI                        
396600                                             CARAT-NN     .                   
396800   MOVE 0                                 TO CARAT-SUBNODO.                   
397000   MOVE "R"                               TO CARAT-CIFRA  .                   
397200   MOVE WS-FECHA1-AMD                     TO CARAT-FECHA  .                   
397400   MOVE ATTRIBUTE MIXNUMBER OF MYSELF     TO CARAT-MIX    .                   
397600   MOVE "001S500GBNPTASA"                 TO CARAT-NR     .                   
397800   SET P01-REPOTASA(USERBACKUPNAME)       TO VALUE TRUE   .                   
398000   CHANGE ATTRIBUTE TITLE OF P01-REPOTASA TO CARATULA     .                   
398200   OPEN OUTPUT P01-REPOTASA                               .                   
398400                                                                              
398600 20000031-MUEVE-REPOTASA.                                                     
398800*========================                                                     
399000                                                                              
399200   MOVE WS-NUM-MTP                TO WS-EN1-RT-MTP     .                      
399400   MOVE WS02-NUM-CSI              TO WS-EN1-RT-NN      .                      
399600   MOVE WS02-FECHA-LINEA          TO WS-FECHA          .                      
399800   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
400000   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
400200   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
400400   MOVE WS-FECHA-DDMMAAAA         TO WS-EN1-RT-FEC     .                      
400600                                                                              
400800   PERFORM 40000005-FECHA                              .                      
401000   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
401200   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
401400   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
401600   MOVE WS-FECHA-DDMMAAAA         TO WS-EN2-RT-FEC     .                      
401800                                                                              
402000                                                                              
402200   IF WS02-NUM-CSI = 10                                                       
402400      MOVE " MEXICO  "            TO WS-EN4-RT-NOMCSI                         
402600   ELSE                                                                       
402800      MOVE "MONTERREY"            TO WS-EN4-RT-NOMCSI  .                      
403000                                                                              
403200 20000029-PRO-DET-REPOTASA.                                                   
403400*==========================                                                   
403600                                                                              
403800   MOVE I02-RSLT-CTO   TO WS-I02-RSLT-CTO-ANT.                                
404000                                                                              
404200   IF WS-88-1ERA                                                              
404400      MOVE 1 TO WS-1ERAVEZ                                                    
404600      MOVE I02-RSLT-PROD  TO WS-I02-RSLT-PROD-ANT                             
404800      MOVE I02-RSLT-INST  TO WS-I02-RSLT-INST-ANT                             
405000      MOVE I02-RSLT-CURR  TO WS-I02-RSLT-CURR-ANT                             
405200      PERFORM 20000024-ESC-ENC-REPOTASA     .                                 
405400                                                                              
405600   MOVE I02-RSLT-CTO      TO WS-DET-RT-CTO                                    
405800                             WS03-NUM-CONTRATO .                              
406000   MOVE I02-RSLT-BRANCH   TO WS-DET-RT-SUC     .                              
406200   IF I02-88-RSLT-MES                                                         
406400      MOVE "MES"          TO WS-DET-RT-TP                                     
406600   ELSE                                                                       
406800      MOVE "DIA"          TO WS-DET-RT-TP   .                                 
407000                                                                              
407200   MOVE SPACES            TO WS-DET-RT-TAS                                    
407400                             WS-DET-RT-FEC                                    
407600                             WS-DET-RT-SE   .                                 
407800                                                                              
408000   MOVE 0.00              TO WS-DET-RT-RN   .                                 
408200                                                                              
408400   IF I02-88-RSLT-SEC1                                                        
408600      PERFORM 20000028-1SEC-REPOTASA                                          
408800   ELSE                                                                       
409000      MOVE WS-TB-ERR-LIST (04)  TO WS-DET-RT-10                               
409200      MOVE 1004                 TO WS-I02-ERR-CODE .                          
409400                                                                              
409600   IF I02-88-RSLT-SEC2 AND I02-RSLT-CTO = WS-I02-RSLT-CTO-ANT                 
409800      PERFORM 20000032-2SEC-REPOTASA                                          
410000   ELSE                                                                       
410200      MOVE WS-TB-ERR-LIST (04)  TO WS-DET-RT-11                               
410400      MOVE 1004                 TO WS-I02-ERR-CODE .                          
410600                                                                              
410800   IF I02-88-RSLT-SEC3 AND I02-RSLT-CTO = WS-I02-RSLT-CTO-ANT                 
411000      PERFORM 20000037-3SEC-REPOTASA                                          
411200   ELSE                                                                       
411400      MOVE WS-TB-ERR-LIST (04)  TO WS-DET-RT-04                               
411600      MOVE 1004                 TO WS-I02-ERR-CODE .                          
411800                                                                              
412000   IF WS-88-ERR-CODE-NOK                                                      
412200      PERFORM 20000042-ERR-REPMENSA .                                         
412400                                                                              
412600   WRITE P01-R-REPOTASA FROM WS-DETA-REPOTASA BEFORE 1 LINE .                 
412800   ADD 01 TO WS-L-PAG-TEM-P01 .                                               
413000                                                                              
413200   IF I02-RSLT-PROD  NOT = WS-I02-RSLT-PROD-ANT OR                            
413400      I02-RSLT-INST  NOT = WS-I02-RSLT-INST-ANT OR                            
413600      I02-RSLT-CURR  NOT = WS-I02-RSLT-CURR-ANT                               
413800      MOVE 1 TO WS-O-PAG-P01                                                  
414000      MOVE 0 TO WS-L-PAG-TEM-P01                                              
414200                WS-1ERAVEZ                                                    
414400      PERFORM 20000030-ESC-TOT-REPOTASA                                       
414600   ELSE                                                                       
414800   IF WS-L-PAG-TEM-P01 = WS-L-PAG-P01                                         
415000      MOVE 1 TO WS-O-PAG-P01                                                  
415200      MOVE 0 TO WS-L-PAG-TEM-P01                                              
415400                WS-1ERAVEZ              .                                     
415600                                                                              
415800 20000024-ESC-ENC-REPOTASA.                                                   
416000*===========================                                                  
416200                                                                              
416400   ADD 1               TO WS-N-HOJA-P01  .                                    
416600   PERFORM 40000001-HORA                 .                                    
416800   MOVE WS-HORA-MAQ-HH TO WS-HORA1-HH    .                                    
417000   MOVE WS-HORA-MAQ-MM TO WS-HORA1-MM    .                                    
417200   MOVE WS-HORA-MAQ-SS TO WS-HORA1-SS    .                                    
417400   MOVE WS-HORA-HHMMSS TO WS-EN3-RT-HOR  .                                    
417600   MOVE I02-RSLT-PROD  TO WS-EN3-RT-PROD .                                    
417800   MOVE I02-RSLT-INST  TO WS-EN3-RT-INST .                                    
418000   MOVE I02-RSLT-CURR  TO WS-EN3-RT-MON  .                                    
418200   MOVE WS-N-HOJA-P01  TO WS-EN3-RT-HOJA .                                    
418400                                                                              
418600   IF WS-88-N-PAG-P01                                                         
418800      MOVE 0 TO WS-O-PAG-P01                                                  
419000      WRITE P01-R-REPOTASA FROM WS-ENC0-REPOTASA  AFTER   PAGE                
419200   ELSE                                                                       
419400      WRITE P01-R-REPOTASA FROM WS-ENC0-REPOTASA BEFORE 1 LINE.               
419600                                                                              
419800   WRITE P01-R-REPOTASA FROM WS-ENC1-REPOTASA BEFORE 1 LINE   .               
420000   WRITE P01-R-REPOTASA FROM WS-ENC2-REPOTASA BEFORE 1 LINE   .               
420200   WRITE P01-R-REPOTASA FROM WS-ENC3-REPOTASA BEFORE 1 LINE   .               
420400   WRITE P01-R-REPOTASA FROM WS-VACI-REPOTASA BEFORE 1 LINE   .               
420600   WRITE P01-R-REPOTASA FROM WS-ENC4-REPOTASA BEFORE 1 LINE   .               
420800   WRITE P01-R-REPOTASA FROM WS-VACI-REPOTASA BEFORE 1 LINE   .               
421000   WRITE P01-R-REPOTASA FROM WS-ENC5-REPOTASA BEFORE 1 LINE   .               
421200   MOVE 08 TO WS-L-PAG-TEM-P01                                .               
421400                                                                              
421600 20000030-ESC-TOT-REPOTASA.                                                   
421800*==========================                                                   
422000                                                                              
422200   MOVE WS-P01-TOT-RENDI TO  WS-TOT-RT-TOTAL               .                  
422400   WRITE P01-R-REPOTASA FROM WS-VACI-REPOTASA BEFORE 1 LINE.                  
422600   WRITE P01-R-REPOTASA FROM WS-TOTA-REPOTASA BEFORE 1 LINE.                  
422800   MOVE 0                TO  WS-P01-TOT-RENDI                                 
423000                             WS-TOT-RT-TOTAL               .                  
423200                                                                              
423400 20000028-1SEC-REPOTASA.                                                      
423600*========================                                                     
423800                                                                              
424000   MOVE I02-RSLT-ERR-CODE TO WS-I02-ERR-CODE.                                 
424200                                                                              
424400   IF WS-I02-ERR-CODE = 0                                                     
424600      DIVIDE I02-RSLT-RATE BY 1000000 GIVING WS-DET-RT-10-D                   
424800   ELSE                                                                       
425000     SUBTRACT 1000 FROM WS-I02-ERR-CODE                                       
425200     MOVE WS-TB-ERR-LIST (WS-I02-ERR-CODE) TO WS-DET-RT-10 .                  
425400   PERFORM 20000027-LEE-ARCHRSLT .                                            
425600                                                                              
425800 20000032-2SEC-REPOTASA.                                                      
426000*========================                                                     
426200                                                                              
426400   MOVE I02-RSLT-ERR-CODE TO WS-I02-ERR-CODE.                                 
426600                                                                              
426800   IF WS-I02-ERR-CODE = 0                                                     
427000      DIVIDE I02-RSLT-RATE BY 1000000 GIVING WS-DET-RT-11-D                   
427200   ELSE                                                                       
427400      SUBTRACT 1000 FROM WS-I02-ERR-CODE                                      
427600      MOVE WS-TB-ERR-LIST (WS-I02-ERR-CODE) TO WS-DET-RT-11 .                 
427800   PERFORM 20000027-LEE-ARCHRSLT .                                            
428000                                                                              
428200 20000037-3SEC-REPOTASA.                                                      
428400*========================                                                     
428600                                                                              
428800   MOVE I02-RSLT-ERR-CODE TO WS-I02-ERR-CODE.                                 
429000                                                                              
429200   DIVIDE I02-RSLT-REND-N BY 100 GIVING WS-I02-REND-B03.                      
429400   MOVE WS-I02-REND-B03 TO WS-DET-RT-RN                .                      
429600   ADD WS-I02-REND-B03  TO WS-P01-TOT-RENDI            .                      
429800                                                                              
430000   IF I02-RSLT-RATE-U > 0                                                     
430200      DIVIDE I02-RSLT-RATE-U BY 1000000 GIVING WS-DET-RT-TAS-N .              
430250                                                                              
430300   IF I02-RSLT-FECH-S > 0                                                     
430400      MOVE I02-RSLT-FECH-S          TO WS-FECHA                               
430600      MOVE WS-FECHA2-DD             TO WS-FECHA4-DD                           
430800      MOVE WKS-TB-MES(WS-FECHA2-MM) TO WS-FECHA4-MM                           
431000      MOVE WS-FECHA2-AAAA           TO WS-FECHA4-AAAA                         
431200      MOVE WS-FECHA-DDMMAAAA        TO WS-DET-RT-FEC                          
431400      MOVE I02-RSLT-PAGO-S          TO WS-DET-RT-SE   .                       
431600                                                                              
431800   IF WS-I02-ERR-CODE = 0                                                     
432000      DIVIDE I02-RSLT-RATE BY 1000000 GIVING WS-DET-RT-04-D                   
432200   ELSE                                                                       
432400      SUBTRACT 1000 FROM WS-I02-ERR-CODE                                      
432600      MOVE WS-TB-ERR-LIST (WS-I02-ERR-CODE) TO WS-DET-RT-04 .                 
432800   PERFORM 20000027-LEE-ARCHRSLT .                                            
433000                                                                              
433200 20000038-ESC-REPMENSA.                                                       
433400*========================                                                     
433600                                                                              
433800   PERFORM 40000001-HORA                  .                                   
434000   MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH   .                                   
434200   MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM   .                                   
434400   MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS   .                                   
434600   MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC   .                                   
434800   MOVE WS-HORA-HHMMSSCC TO WS-DET-RM-HOR .                                   
435000   ADD 1 TO WS-L-PAG-TEM-P02              .                                   
435200   IF WS-L-PAG-TEM-P02 > WS-L-PAG-P02                                         
435400      PERFORM 20000039-ENCA-REPMENSA .                                        
435600                                                                              
435800   WRITE P02-R-REPMENSA FROM WS-DETA-REPMENSA BEFORE 1 .                      
436000   MOVE " " TO WS-DET-RM-MSG .                                                
436200                                                                              
436400 20000039-ENCA-REPMENSA.                                                      
436600*=======================                                                      
436800                                                                              
437000   PERFORM 40000005-FECHA                              .                      
437200   MOVE WS-FECHA2-DD              TO WS-FECHA4-DD      .                      
437400   MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM      .                      
437600   MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA    .                      
437800   MOVE WS-FECHA-DDMMAAAA         TO WS-EN2-RM-FEC     .                      
438000                                                                              
438200   PERFORM 40000001-HORA                               .                      
438400   MOVE WS-HORA-MAQ-HH            TO  WS-HORA1-HH      .                      
438600   MOVE WS-HORA-MAQ-MM            TO  WS-HORA1-MM      .                      
438800   MOVE WS-HORA-MAQ-SS            TO  WS-HORA1-SS      .                      
439000   MOVE WS-HORA-HHMMSS            TO  WS-EN3-RM-HOR    .                      
439200                                                                              
439400   ADD 1                          TO WS-N-HOJA-P02     .                      
439600   MOVE WS-N-HOJA-P02             TO WS-EN3-RM-HOJA    .                      
439800                                                                              
440000   WRITE P02-R-REPMENSA    FROM WS-ENC1-REPMENSA AFTER PAGE.                  
440200   WRITE P02-R-REPMENSA    FROM WS-ENC2-REPMENSA BEFORE 1  .                  
440400   WRITE P02-R-REPMENSA    FROM WS-ENC3-REPMENSA BEFORE 1  .                  
440600   WRITE P02-R-REPMENSA    FROM WS-ENC4-REPMENSA BEFORE 1  .                  
440800   WRITE P02-R-REPMENSA    FROM WS-ENC5-REPMENSA BEFORE 1  .                  
441000   WRITE P02-R-REPMENSA    FROM WS-VACI-REPMENSA BEFORE 1  .                  
441200                                                                              
441400   MOVE  6                      TO WS-L-PAG-TEM-P02        .                  
441600                                                                              
441800 20000040-CIES-REPMENSA.                                                      
442000*=======================                                                      
442200                                                                              
442400   PERFORM 40000001-HORA                   .                                  
442600   MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH    .                                  
442800   MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM    .                                  
443000   MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS    .                                  
443200   MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC    .                                  
443400   MOVE WS-HORA-HHMMSSCC TO WS-FIN-RM-HOR  .                                  
443600                                                                              
443800   WRITE P02-R-REPMENSA FROM WS-FIN-REPMENSA BEFORE 1.                        
444000   CLOSE P02-REPMENSA   WITH SAVE.                                            
444200                                                                              
444400 20000042-ERR-REPMENSA.                                                       
444600*=======================                                                      
444800                                                                              
445000   MOVE WS-I02-ERR-CODE TO WS-ERR-CODE .                                      
445200   SUBTRACT 1000 FROM WS-ERR-CODE      .                                      
445400   STRING "ERROR "            ,                                               
445600          " - CONTRATO    : " , WS03-NUM-CONTRATO             ,               
445800          " - SECUENCIAL  : " , I03-CTRL-SEC                  ,               
446000          " - DESCRIPCION : " , WS-TB-ERR-LIST(WS-ERR-CODE)                   
446200          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
446400   PERFORM 20000038-ESC-REPMENSA      .                                       
446600                                                                              
446800   MOVE 4 TO WS-SECS-OPCION           .                                       
447000   PERFORM 20000043-SUMA-ESTADISTICOS .                                       
447200                                                                              
447400 20000043-SUMA-ESTADISTICOS.                                                  
447600*===========================                                                  
447800                                                                              
448000   IF WS-88-LECTURA                                                           
448200      IF WS-88-PROCE1                                                         
448400         ADD 1  TO WS-SEC1-REG-LE                                             
448600      ELSE                                                                    
448800      IF WS-88-PROCE2                                                         
449000         ADD 1  TO WS-SEC2-REG-LE                                             
449200      ELSE                                                                    
449400         ADD 1  TO WS-SEC3-REG-LE                                             
449600   ELSE                                                                       
449800   IF WS-88-ESCRITU                                                           
450000      IF WS-88-PROCE1                                                         
450200         ADD 1  TO WS-SEC1-REG-ES                                             
450400      ELSE                                                                    
450600      IF WS-88-PROCE2                                                         
450800         ADD 1  TO WS-SEC2-REG-ES                                             
451000      ELSE                                                                    
451200         ADD 1  TO WS-SEC3-REG-ES                                             
451400   ELSE                                                                       
451600   IF WS-88-ACTUALI                                                           
451800      IF WS-88-PROCE1                                                         
452000         ADD 1  TO WS-SEC1-REG-AC                                             
452200      ELSE                                                                    
452400      IF WS-88-PROCE2                                                         
452600         ADD 1  TO WS-SEC2-REG-AC                                             
452800      ELSE                                                                    
453000         ADD 1  TO WS-SEC3-REG-AC                                             
453200   ELSE                                                                       
453400   IF WS-88-ERROR                                                             
453600      IF WS-88-PROCE1                                                         
453800         ADD 1  TO WS-SEC1-REG-ER                                             
454000      ELSE                                                                    
454200      IF WS-88-PROCE2                                                         
454400         ADD 1  TO WS-SEC2-REG-ER                                             
454600      ELSE                                                                    
454800         ADD 1  TO WS-SEC3-REG-ER                                             
455000   ELSE                                                                       
455200   IF WS-88-RESIDEN                                                           
455400      IF WS-88-PROCE1                                                         
455600         MOVE 1 TO WS-SEC1-REC                                                
455800      ELSE                                                                    
456000      IF WS-88-PROCE2                                                         
456200         MOVE 1 TO WS-SEC2-REC                                                
456400      ELSE                                                                    
456600         MOVE 1 TO WS-SEC3-REC                                                
456605   ELSE                                                                       
456610   IF WS-88-EXTE                                                              
456615      IF WS-88-PROCE1                                                         
456620         ADD 1  TO WS-SEC1-REG-EX                                             
456625      ELSE                                                                    
456630      IF WS-88-PROCE2                                                         
456635         ADD 1  TO WS-SEC2-REG-EX                                             
456640      ELSE                                                                    
456645         ADD 1  TO WS-SEC3-REG-EX  .                                          
456800                                                                              
457000*****************************************************************             
457200* ARCHIVO RSLT RUTINAS                                          *             
457400*****************************************************************             
457600                                                                              
457800 20000026-SORT-ARCHRSLT.                                                      
458000*========================                                                     
458200                                                                              
458400   SORT S01-ARCHRSLT ON ASCENDING KEY S01-RSLT-REC-TYPE                       
458600                                      S01-RSLT-PROD                           
458800                                      S01-RSLT-INST                           
459000                                      S01-RSLT-CURR                           
459200                                      S01-RSLT-BRANCH                         
459400                                      S01-RSLT-INT-T                          
459600                                      S01-RSLT-CTO                            
459800                                      S01-RSLT-SEQ                            
460000        USING  I02-ARCHRSLT  RELEASE                                          
460200        GIVING I02-ARCHRSLT  SAVE                                             
460400        MEMORY SIZE IS WS-MEMORY-SIZE WORDS                                   
460600        DISK   SIZE IS WS-DISK-SIZE   WORDS .                                 
460800   OPEN INPUT I02-ARCHRSLT   .                                                
461000   MOVE 0 TO WS-I02-FIN-ARCH .                                                
461200                                                                              
461400 20000027-LEE-ARCHRSLT.                                                       
461600*======================                                                       
461800                                                                              
462000   READ I02-ARCHRSLT AT END MOVE 1 TO WS-I02-FIN-ARCH                         
462200                            MOVE 0 TO I02-RSLT-PROD .                         
462400   IF WS-88-CON-ARCH02                                                        
462600      ADD 1 TO WS-SEC3-REG-TE .                                               
462800                                                                              
463000 20000019-ESC-ARCHRSLT.                                                       
463200*======================                                                       
463400                                                                              
463600   WRITE I02-R-ARCHRSLT         .                                             
463800   MOVE 2 TO WS-SECS-OPCION     .                                             
464000   ADD  1 TO WS-I02-REG-ESCRI   .                                             
464200   PERFORM 20000043-SUMA-ESTADISTICOS .                                       
464400   PERFORM 20000009-REW-ARCHCTRL      .                                       
464600                                                                              
464800 20000018-MUEVE-ARCHRSLT.                                                     
465000*========================                                                     
465200                                                                              
465400   MOVE 1                  TO I02-RSLT-REC-TYPE.                              
465600   MOVE WS03-SUC-PROMOTORA TO I02-RSLT-BRANCH  .                              
465800   MOVE WS03-NUM-CONTRATO  TO I02-RSLT-CTO     .                              
466000   MOVE I03-CTRL-SEC       TO I02-RSLT-SEQ     .                              
466200   MOVE WS-I02-RATE        TO I02-RSLT-RATE    .                              
466400   MOVE WS-B05-TB-DIME     TO I02-RSLT-INT-T   .                              
466600   MOVE WS-I02-ERR-CODE    TO I02-RSLT-ERR-CODE.                              
466800   MOVE WS03-NUM-PRODUCTO  TO I02-RSLT-PROD    .                              
467000   MOVE WS03-NUM-INSTRUM   TO I02-RSLT-INST    .                              
467200   MOVE WS03-MONEDA        TO I02-RSLT-CURR    .                              
467400   MOVE WS-I02-RATE-U      TO I02-RSLT-RATE-U  .                              
467600   MOVE WS-I02-REND-N      TO I02-RSLT-REND-N  .                              
467800   MOVE WS-I02-PASO-S      TO I02-RSLT-PAGO-S  .                              
468000   MOVE WS-I02-FECH-S      TO I02-RSLT-FECH-S  .                              
468200   MOVE SPACES             TO I02-RSLT-FILLER  .                              
468400                                                                              
468600 20000025-ATRI-ARCHRSLT.                                                      
468800*========================                                                     
469000                                                                              
469200   MOVE 0  TO WS-FRAMESIZE                                                    
469400              WS-LASTRECORD                                                   
469600              WS-MAXRECSIZE                                                   
469800              WS-DISK-SIZE                                                    
470000              WS-MEMORY-SIZE                                                  
470200              WS-MEMORY-65K                                                   
470400              WS-CALC-WORD                                                    
470600              WS-CALC-WORD-RED .                                              
470800                                                                              
471000   COMPUTE WS-FRAMESIZE  = ATTRIBUTE FRAMESIZE  OF I02-ARCHRSLT .             
471200   COMPUTE WS-MAXRECSIZE = ATTRIBUTE MAXRECSIZE OF I02-ARCHRSLT .             
471400   COMPUTE WS-LASTRECORD = ATTRIBUTE LASTRECORD OF I02-ARCHRSLT .             
471600   COMPUTE WS-LASTRECORD = WS-LASTRECORD + 1                    .             
471800   CLOSE I02-ARCHRSLT WITH RELEASE                              .             
472000                                                                              
472200 20000022-CIES-ARCHRSLT.                                                      
472400*========================                                                     
472600                                                                              
472800   IF ATTRIBUTE OPEN OF I02-ARCHRSLT = VALUE TRUE                             
473000      CLOSE I02-ARCHRSLT WITH SAVE .                                          
473200                                                                              
473400*****************************************************************             
473600* ARCHIVO DE GBNP RUTINAS                                       *             
473800*****************************************************************             
474000                                                                              
474200 20000005-REC-ARCHGBNP.                                                       
474400*======================                                                       
474600                                                                              
474800   IF I03-CTRL-NUM-REG > 0                                                    
475000      STRING "INICIA RECUPERACION GBNP " ,                                    
475200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
475400      PERFORM 20000038-ESC-REPMENSA                                           
475600                                                                              
475800      PERFORM 20000006-LEE-ARCHGBNP UNTIL WS-I01-REG-LEIDO =                  
476000                                          I03-CTRL-NUM-REG                    
476200                                                                              
476400      STRING "TERMINA RECUPERACION GBNP " ,                                   
476600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
476800      PERFORM 20000038-ESC-REPMENSA .                                         
477000                                                                              
477200 20000006-VER-B00-SEC12.                                                      
477400*=======================                                                      
477600                                                                              
477800   IF WS-88-PROCE1 OR WS-88-PROCE2                                            
477900      IF WS-88-OPEN-BD                                                        
478000         PERFORM 40000000-VERIF-B00                                           
478050      ELSE                                                                    
478100         MOVE 3 TO WS-EVE-REALIZA .                                           
478200                                                                              
478400 20000006-LEE-ARCHGBNP.                                                       
478600*======================                                                       
478800                                                                              
479000   READ I01-ARCHGBNP AT END MOVE 1 TO WS-I01-FIN-ARCH .                       
479200   IF WS-88-CON-ARCH01                                                        
479400      MOVE 1 TO WS-SECS-OPCION                                                
479600      PERFORM 20000043-SUMA-ESTADISTICOS                                      
479800      IF I01-TASA-IND = "#ICACC#"                                             
480000         ADD 1 TO WS-I01-REG-LEIDO .                                          
480200                                                                              
480400 20000020-CIER-ARCHGBNP.                                                      
480600*=======================                                                      
480800                                                                              
481000   IF ATTRIBUTE OPEN OF I01-ARCHGBNP = VALUE TRUE                             
481200      CLOSE I01-ARCHGBNP  WITH RELEASE .                                      
481400                                                                              
481600*****************************************************************             
481800* ARCHIVO DE CTRL RUTINAS                                       *             
482000*****************************************************************             
482200                                                                              
482400 20000009-REW-ARCHCTRL.                                                       
482600*=======================                                                      
482800                                                                              
483000   MOVE WS-I02-REG-ESCRI  TO I03-CTRL-NUM-REG .                               
483200   MOVE WS03-NUM-CONTRATO TO I03-CTRL-CTO     .                               
483400   MOVE 1                 TO WS-I03-CTRL-LLAVE.                               
483600   REWRITE I03-R-CTRL INVALID KEY                                             
483800           MOVE "ERROR AL ESC ARCH CTRL" TO WS-0101-TEXT-MSG                  
484000           PERFORM 70000050-MENSAJE .                                         
484200                                                                              
484400*****************************************************************             
484600* RUTINAS GENERALES                                             *             
484800*****************************************************************             
485000                                                                              
485200 40000000-VERIF-B00.                                                          
485400*===================                                                          
485600                                                                              
485800   PERFORM 90000000-B00CTRLPASO-FIND .                                        
486000                                                                              
486200   IF WS-STATUS-BASE > 0                                                      
486400      MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE                             
486600      STRING "ERR FIND B00CTRLPASO ", WS-STATUS-BASE                          
486800             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
487000      MOVE WS-0101-TEXT-MSG     TO WS-DET-RM-MSG                              
487200      PERFORM 20000038-ESC-REPMENSA                                           
487400      PERFORM 70000050-MENSAJE                                                
487600   ELSE                                                                       
487800      MOVE B00-NUM-PASO-01 TO WS00-NUM-PASO-01                                
488000      MOVE B00-NUM-PASO-01 TO WS00-NUM-PASO-01                                
488200      MOVE B00-NUM-PASO-01 TO WS00-NUM-PASO-01                                
488400                                                                              
488600      IF  WS00-NUM-PASO-01 = 130 OR 305 OR 127 OR                             
488800          WS00-NUM-PASO-02 = 130 OR 305 OR 127 OR                             
489000          WS00-NUM-PASO-03 = 130 OR 305 OR 127                                
489200          MOVE 3 TO WS-EVE-REALIZA                                            
489400                                                                              
489600          PERFORM 30000001-CIERRA-BD                                          
489800                                                                              
490000          STRING "TERMINA POR EJECUCION DE P130/305/127"                      
490200          DELIMITED BY SIZE INTO WS-DET-RM-MSG                                
490400          PERFORM 20000038-ESC-REPMENSA .                                     
491200                                                                              
491400 70000000-CALCULA-ESPACIO.                                                    
491600*========================                                                     
491800                                                                              
492000   IF WS-FRAMESIZE = 8                                                        
492200      COMPUTE WS-CALC-WORD = WS-MAXRECSIZE / 6                                
492400      IF WS-WORD-RES > ZEROS                                                  
492600          COMPUTE WS-MAXRECSIZE = WS-WORD-ENT + 1                             
492800      ELSE                                                                    
493000          COMPUTE WS-MAXRECSIZE = WS-WORD-ENT .                               
493200                                                                              
493400   COMPUTE WS-MEMORY-65K = 66000 * WS-MAXRECSIZE .                            
493600                                                                              
493800   COMPUTE WS-MEMORY-SIZE ROUNDED                                             
494000           = (WS-MAXRECSIZE + 3) * (WS-LASTRECORD / 16) + 1500 .              
494200                                                                              
494400   IF WS-MEMORY-SIZE > 258435000                                              
494600      MOVE 258435000    TO WS-MEMORY-SIZE                                     
494800   ELSE                                                                       
495000   IF WS-MEMORY-SIZE < 400000                                                 
495200      MOVE WS-MEMORY-65K TO WS-MEMORY-SIZE .                                  
495400                                                                              
495600   COMPUTE WS-DISK-SIZE ROUNDED                                               
495800           =  (WS-MAXRECSIZE + 3) * WS-LASTRECORD * 3.5 .                     
496000                                                                              
496200 40000002-VALIDA-9AM.                                                         
496400*=====================                                                        
496600                                                                              
496800   IF WS-HORA-MAQ > 090000 - 1 AND WS-88-NOEJE-P168                           
497000      STRING "EJECUTA P168 POR HORARIO " ,  WS-HORA-MAQ                       
497200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
497400      PERFORM 20000038-ESC-REPMENSA                                           
497600      PERFORM 20000002-CORRE-P168 .                                           
497800                                                                              
498000 40000003-VALIDA-21PM.                                                        
498200*=====================                                                        
498400                                                                              
498600   IF ((WS-HORA-MAQ > 21000000 - 1 AND WS-DH-HOSTNAME-PROD)  OR               
498800       (WS-HORA-MAQ > 19000000 - 1 AND WS-DH-HOSTNAME-UAT )) AND              
498900        WS-FECHA = WS02-FECHA-LINEA                                           
499000       MOVE 2 TO WS-EVE-REALIZA                                               
499200       STRING "TERMINA BUSQUEDA SEC 3 POR HORARIO ", WS-HORA-MAQ              
499400              DELIMITED BY SIZE INTO WS-DET-RM-MSG                            
499600       PERFORM 20000038-ESC-REPMENSA .                                        
499800                                                                              
500000 40000004-VALIDA-30S.                                                         
500200*=====================                                                        
500400                                                                              
500600   PERFORM 40000001-HORA  .                                                   
500800   COMPUTE WS-HORA-SEG     = (WS-HORA-MAQ-HH  * 3600) +                       
501000                             (WS-HORA-MAQ-MM  *   60) +                       
501200                              WS-HORA-MAQ-SS    .                             
501400   COMPUTE WS-HORA-SEG-ANT = (WS-HORA-MAQA-HH * 3600) +                       
501600                             (WS-HORA-MAQA-MM *   60) +                       
501800                              WS-HORA-MAQA-SS   .                             
502000                                                                              
502200   COMPUTE WS-HORA-DIF = WS-HORA-SEG - WS-HORA-SEG-ANT .                      
502400                                                                              
502600   IF WS-HORA-DIF < 0 OR > 29                                                 
502800      MOVE WS-HORA-MAQ TO WS-HORA-MAQ-ANT                                     
503000      IF WS-88-PROCE3                                                         
503200         PERFORM 40000002-VALIDA-9AM                                          
503400      ELSE                                                                    
503600         PERFORM 40000000-VERIF-B00 .                                         
503800                                                                              
504000 40000005-FECHA.                                                              
504200*===============                                                              
504400                                                                              
504600   ACCEPT WS-FECHA FROM DATE YYYYMMDD .                                       
504800                                                                              
505000 40000001-HORA.                                                               
505200*==============                                                               
505400                                                                              
505600   ACCEPT WS-HORA-MAQ FROM TIME .                                             
505800                                                                              
506000 40000006-HI-ESTADISTICOS.                                                    
506200*===========================                                                  
506400                                                                              
506600   STRING " -PARAMETRO : " , WS-PARAM-VALUE-N          ,                      
506800          " -SECUENCIAL: " , I03-CTRL-SEC              ,                      
507000          " -ACTIVIDAD : " , WS-EVE-REALIZA                                   
507200          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG .                           
507400   PERFORM 70000050-MENSAJE                       .                           
507600                                                                              
507800   STRING " ARCHIVO GBNP 0 = NO RECIBIDO 1 = RECIBIDO" ,                      
508000          " -SECUENCIAL 1 : " , WS-SEC1-REC            ,                      
508200          " -SECUENCIAL 2 : " , WS-SEC2-REC            ,                      
508400          " -SECUENCIAL 3 : " , WS-SEC3-REC                                   
508600          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG .                           
508800   PERFORM 70000050-MENSAJE                       .                           
509000                                                                              
509200   STRING " ESTATUS SECUENCIAL 1",                                            
509400          " -REG LEIDO : "       , WS-SEC1-REG-LE      ,                      
509600          " -REG ESCRI : "       , WS-SEC1-REG-ES      ,                      
509800          " -REG ACTUA : "       , WS-SEC1-REG-AC      ,                      
510000          " -ERRORES   : "       , WS-SEC1-REG-ER      ,                      
510005          " -EXTENDED  : "       , WS-SEC1-REG-EX                             
510200          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG .                           
510400   PERFORM 70000050-MENSAJE                       .                           
510600                                                                              
510800   STRING " ESTATUS SECUENCIAL 2",                                            
511000          " -REG LEIDO : "       , WS-SEC2-REG-LE      ,                      
511200          " -REG ESCRI : "       , WS-SEC2-REG-ES      ,                      
511400          " -REG ACTUA : "       , WS-SEC2-REG-AC      ,                      
511600          " -ERRORES   : "       , WS-SEC2-REG-ER      ,                      
511605          " -EXTENDED  : "       , WS-SEC2-REG-EX                             
511800          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG .                           
512000   PERFORM 70000050-MENSAJE                       .                           
512200                                                                              
512400   STRING " ESTATUS SECUENCIAL 3",                                            
512600          " -REG LEIDO : "       , WS-SEC3-REG-LE      ,                      
512800          " -REG ESCRI : "       , WS-SEC3-REG-ES      ,                      
513000          " -REG ACTUA : "       , WS-SEC3-REG-AC      ,                      
513200          " -ERRORES   : "       , WS-SEC3-REG-ER      ,                      
513205          " -EXTENDED  : "       , WS-SEC3-REG-EX      ,                      
513400          " -REG RSLT TOTAL : "  , WS-SEC3-REG-TO      ,                      
513600          " -REG RSLT LEIDO : "  , WS-SEC3-REG-TE                             
513800          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG .                           
514000   PERFORM 70000050-MENSAJE                       .                           
514200                                                                              
514400 20000002-CORRE-P168.                                                         
514600*=======================                                                      
514800                                                                              
515000   MOVE ZEROS         TO S000-CTR-CVEERROR .                                  
515200   MOVE "S500JBATCH"  TO S000-CTR-LIBID    .                                  
515400   PERFORM 20000100-DAME-TIT-VERS          .                                  
515600                                                                              
515800   IF S000-CTR-CVEERROR = 0                                                   
516000      STRING "SE EJECUTA P168" DELIMITED BY SIZE                              
516200                                         INTO WS-DET-RM-MSG                   
516400      MOVE 1 TO WS-EJEC-P168                                                  
516600      MOVE S000-CTR-NOMLIB TO WS-TIT-LOTE-P168                                
516800      CALL SYSTEM WFL USING WS-WFL-P168                                       
517000   ELSE                                                                       
517200      STRING "ERR AL OBTENER TITLE S500JBATCH DE VERS"                        
517400             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
517600      STRING "ERR AL OBTENER TITLE S500JBATCH DE VERS"                        
517800             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
518000      PERFORM 70000050-MENSAJE    .                                           
518200   PERFORM 20000038-ESC-REPMENSA  .                                           
518400                                                                              
518600******************************************************************            
518800* ACTIVIDADES MAPLI                                              *            
519000******************************************************************            
519200                                                                              
519400 50000000-INI-ACTIVIDAD.                                                      
519600*=======================                                                      
519800                                                                              
520000   MOVE 0    TO W77-ID-NUMREG-PROC                                            
520200                W77-ID-ACTXX-MAPLI  .                                         
520400   MOVE " "  TO W77-ID-NOMB-LIB                                               
520600                W77-ID-TXTA-LIB     .                                         
520800                                                                              
521000   IF WS-88-MAP-BUSCA                                                         
521200      IF WS-88-PROCE1                                                         
521400         MOVE WKS-NUMACT-LIB(110) TO W77-ID-ACTXX-MAPLI                       
521600      ELSE                                                                    
521800      IF WS-88-PROCE2                                                         
522000         MOVE WKS-NUMACT-LIB(112) TO W77-ID-ACTXX-MAPLI                       
522200      ELSE                                                                    
522400         MOVE WKS-NUMACT-LIB(114) TO W77-ID-ACTXX-MAPLI                       
522600   ELSE                                                                       
522800   IF WS-88-MAP-ACTUA                                                         
523000      IF WS-88-PROCE1                                                         
523200         MOVE WKS-NUMACT-LIB(111) TO W77-ID-ACTXX-MAPLI                       
523400      ELSE                                                                    
523600      IF WS-88-PROCE2                                                         
523800         MOVE WKS-NUMACT-LIB(113) TO W77-ID-ACTXX-MAPLI                       
524000      ELSE                                                                    
524200         MOVE WKS-NUMACT-LIB(115) TO W77-ID-ACTXX-MAPLI                       
524400   ELSE                                                                       
524600   IF WS-88-MAP-GENRE                                                         
524800      MOVE WKS-NUMACT-LIB(116)  TO W77-ID-ACTXX-MAPLI .                       
525000                                                                              
525200   MOVE WS-TB-NOM-ACT(W77-ID-ACTXX-MAPLI) TO W77-ID-NOMB-LIB .                
525400   PERFORM 70000910-INIACT-MAPLI   .                                          
525600   IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                       
525800      STRING "INICIO ACT/NUM = " , W77-ID-ACTXX-MAPLI , "TIPO 1 "             
526000             DELIMITED BY SIZE INTO W77-ERR-DATO-MAPLI                        
526200      PERFORM 50000900-ERROR-MAPLI .                                          
526400                                                                              
526600 50000002-FIN-ACTIVIDAD.                                                      
526800*=======================                                                      
527000                                                                              
527200   IF WS-88-MAP-BUSCA                                                         
527400      IF WS-88-PROCE1                                                         
527600         MOVE WKS-NUMACT-LIB(110) TO W77-ID-ACTXX-MAPLI                       
527800      ELSE                                                                    
528000      IF WS-88-PROCE2                                                         
528200         MOVE WKS-NUMACT-LIB(112) TO W77-ID-ACTXX-MAPLI                       
528400      ELSE                                                                    
528600         MOVE WKS-NUMACT-LIB(114) TO W77-ID-ACTXX-MAPLI                       
528800   ELSE                                                                       
529000   IF WS-88-MAP-ACTUA                                                         
529200      IF WS-88-PROCE1                                                         
529400         MOVE WKS-NUMACT-LIB(111) TO W77-ID-ACTXX-MAPLI                       
529600      ELSE                                                                    
529800      IF WS-88-PROCE2                                                         
530000         MOVE WKS-NUMACT-LIB(113) TO W77-ID-ACTXX-MAPLI                       
530200      ELSE                                                                    
530400         MOVE WKS-NUMACT-LIB(115) TO W77-ID-ACTXX-MAPLI                       
530600   ELSE                                                                       
530800   IF WS-88-MAP-GENRE                                                         
531000      MOVE WKS-NUMACT-LIB(116)  TO W77-ID-ACTXX-MAPLI   .                     
531200                                                                              
531400   PERFORM 70000910-FIN-ACTI-MAPLI .                                          
531600   IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                       
531800      STRING "FIN ACT/NUM = " , W77-ID-ACTXX-MAPLI                            
532000              DELIMITED BY SIZE INTO W77-ERR-DATO-MAPLI                       
532200      PERFORM 50000900-ERROR-MAPLI .                                          
532400                                                                              
532600 50000900-ERROR-MAPLI.                                                        
532800*======================                                                       
533000                                                                              
533200   MOVE 1                   TO W77-ERR-L035-MAPLI                             
533400   MOVE WS-S038L035-RESULT  TO WS-MSG-RS                                      
533600   STRING "ERROR LIB/MAPLI RS = "  , WS-MSG-RS ,                              
533800          " SUSPENDO MONITOREO  "                                             
534000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
534200   PERFORM 20000038-ESC-REPMENSA.                                             
534400   STRING "CALL S038L035 " , W77-ERR-DATO-MAPLI                               
534600          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
534800   PERFORM 20000038-ESC-REPMENSA .                                            
535000                                                                              
535200*=================                                                            
535400 30000000-FIN.                                                                
535600*=================                                                            
535800                                                                              
536000   PERFORM 30000001-CIERRA-BD     .                                           
536200   PERFORM 20000022-CIES-ARCHRSLT .                                           
536400   PERFORM 30000002-CIES-ARCHCTRL .                                           
536600                                                                              
536800   IF WS-88-ENVIO-RSLT                                                        
537000      PERFORM 30000003-ENVI-ARCHRSLT .                                        
537200                                                                              
537400   PERFORM 30000004-FIN-PGM-MAPLI .                                           
537600   PERFORM 30000005-FIN-PROCESO   .                                           
537800                                                                              
538000   PERFORM 20000040-CIES-REPMENSA .                                           
538400                                                                              
538600*=================                                                            
538800 30000001-CIERRA-BD.                                                          
539000*=================                                                            
539200                                                                              
539400   IF WS-88-OPEN-BD                                                           
539600      CLOSE S500BD01CAPTACION                                                 
541600      MOVE 0 TO WS-ABRE-BD   .                                                
541800                                                                              
542000 30000002-CIES-ARCHCTRL.                                                      
542200*=======================                                                      
542400                                                                              
542600   IF ATTRIBUTE OPEN OF I03-CTRL = VALUE TRUE                                 
542800      CLOSE I03-CTRL  WITH SAVE .                                             
543000                                                                              
543200*=================                                                            
543400 30000003-ENVI-ARCHRSLT.                                                      
543600*=================                                                            
543800                                                                              
544000   MOVE ZEROS         TO S000-CTR-CVEERROR .                                  
544200   MOVE "S500JBATCH"  TO S000-CTR-LIBID    .                                  
544400   PERFORM 20000100-DAME-TIT-VERS          .                                  
544600                                                                              
544800   IF S000-CTR-CVEERROR = 0                                                   
545000      STRING "SE ENVIA ARCHIVO GBNPRSLT" DELIMITED BY SIZE                    
545200                                         INTO WS-DET-RM-MSG                   
545400      MOVE S000-CTR-NOMLIB TO WS-TIT-LOTE-RSLT                                
545600      MOVE "ENVIAGBNPRSLT" TO WS-TIT-PARA-RSLT                                
545800      MOVE  WS-FECHA-PROY  TO WS-TIT-FECH-RSLT                                
546000      MOVE "0001"          TO WS-TIT-SECU-RSLT                                
546200      CALL SYSTEM WFL USING WS-WFL-GBNPRSLT                                   
546400   ELSE                                                                       
546600      STRING "ERR AL OBTENER TITLE S500JBATCH DE VERS"                        
546800             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
547000      MOVE WS-0101-TEXT-MSG TO WS-DET-RM-MSG                                  
547200      PERFORM 70000050-MENSAJE    .                                           
547400   PERFORM 20000038-ESC-REPMENSA  .                                           
547600                                                                              
547800*=================                                                            
548000 30000004-FIN-PGM-MAPLI.                                                      
548200*=================                                                            
548400                                                                              
548600   PERFORM 70000950-FIN-PGM-MAPLI .                                           
548800                                                                              
549000   IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                       
549200      STRING "FIN PGM MAPLI = "                                               
549400              DELIMITED BY SIZE INTO W77-ERR-DATO-MAPLI                       
549600      PERFORM 50000900-ERROR-MAPLI .                                          
549800                                                                              
550000*=================                                                            
550200 30000005-FIN-PROCESO.                                                        
550400*=================                                                            
550600                                                                              
550800   STRING "CIERRA BASE DE DATOS"                                              
551000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
551200   PERFORM 20000038-ESC-REPMENSA .                                            
551400                                                                              
551600   IF WS-88-P-VAL-SEC12                                                       
551800      IF WS-SEC1-REC = 0                                                      
552000         STRING "NO SE RECIBIO ARCHIVO GBNP 1 "                               
552200                DELIMITED BY SIZE INTO WS-DET-RM-MSG                          
552400      ELSE                                                                    
552600         STRING "SE RECIBIO ARCHIVO GBNP 1 "                                  
552800                DELIMITED BY SIZE INTO WS-DET-RM-MSG .                        
553000   PERFORM 20000038-ESC-REPMENSA .                                            
553200                                                                              
553400   IF WS-88-P-VAL-SEC12                                                       
553600      IF WS-SEC2-REC = 0                                                      
553800         STRING "NO SE RECIBIO ARCHIVO GBNP 2 "                               
554000                DELIMITED BY SIZE INTO WS-DET-RM-MSG                          
554200      ELSE                                                                    
554400         STRING "SE RECIBIO ARCHIVO GBNP 2 "                                  
554600                DELIMITED BY SIZE INTO WS-DET-RM-MSG .                        
554800   PERFORM 20000038-ESC-REPMENSA .                                            
555000                                                                              
555200   IF WS-88-P-VAL-SEC3                                                        
555400      IF WS-SEC3-REC = 0                                                      
555600         STRING "NO SE RECIBIO ARCHIVO GBNP 3 "                               
555800                DELIMITED BY SIZE INTO WS-DET-RM-MSG                          
556000      ELSE                                                                    
556200         STRING "SE RECIBIO ARCHIVO GBNP 3 "                                  
556400                DELIMITED BY SIZE INTO WS-DET-RM-MSG .                        
556600   PERFORM 20000038-ESC-REPMENSA .                                            
556800                                                                              
557000   IF WS-88-P-VAL-SEC12                                                       
557200      STRING "SECUENCIAL 1 "                                                  
557400             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
557600      PERFORM 20000038-ESC-REPMENSA                                           
557800      STRING "TOTAL DE REGISTROS LEIDOS       : " , WS-SEC1-REG-LE            
558000             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
558200      PERFORM 20000038-ESC-REPMENSA                                           
558400      STRING "TOTAL DE REGISTROS ESCRITOS     : " , WS-SEC1-REG-ES            
558600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
558800      PERFORM 20000038-ESC-REPMENSA                                           
559000      STRING "TOTAL DE REGISTROS ACTUALIZADOS : " , WS-SEC1-REG-AC            
559200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
559400      PERFORM 20000038-ESC-REPMENSA                                           
559600      STRING "TOTAL DE REGISTROS CON ERROR    : " , WS-SEC1-REG-ER            
559800             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
560000      PERFORM 20000038-ESC-REPMENSA                                           
560005      STRING "TOTAL DE REGISTROS CON EXTEN    : " , WS-SEC1-REG-EX            
560010             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
560015      PERFORM 20000038-ESC-REPMENSA                                           
560200                                                                              
560400      STRING "SECUENCIAL 2 "                                                  
560600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
560800      PERFORM 20000038-ESC-REPMENSA                                           
561000      STRING "TOTAL DE REGISTROS LEIDOS       : " , WS-SEC2-REG-LE            
561200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
561400      PERFORM 20000038-ESC-REPMENSA                                           
561600      STRING "TOTAL DE REGISTROS ESCRITOS     : " , WS-SEC2-REG-ES            
561800             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
562000      PERFORM 20000038-ESC-REPMENSA                                           
562200      STRING "TOTAL DE REGISTROS ACTUALIZADOS : " , WS-SEC2-REG-AC            
562400             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
562600      PERFORM 20000038-ESC-REPMENSA                                           
562800      STRING "TOTAL DE REGISTROS CON ERROR    : " , WS-SEC2-REG-ER            
563000             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
563200      PERFORM 20000038-ESC-REPMENSA                                           
563205      STRING "TOTAL DE REGISTROS CON EXTEN    : " , WS-SEC2-REG-EX            
563210             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
563215      PERFORM 20000038-ESC-REPMENSA                                           
563400                                                                              
563600   ELSE                                                                       
563800   IF WS-88-P-VAL-SEC3                                                        
564000      STRING "SECUENCIAL 3 "                                                  
564200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
564400      PERFORM 20000038-ESC-REPMENSA                                           
564600      STRING "TOTAL DE REGISTROS LEIDOS       : " , WS-SEC3-REG-LE            
564800             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
565000      PERFORM 20000038-ESC-REPMENSA                                           
565200      STRING "TOTAL DE REGISTROS ESCRITOS     : " , WS-SEC3-REG-ES            
565400             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
565600      PERFORM 20000038-ESC-REPMENSA                                           
565800      STRING "TOTAL DE REGISTROS ACTUALIZADOS : " , WS-SEC3-REG-AC            
566000             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
566200      PERFORM 20000038-ESC-REPMENSA                                           
566400      STRING "TOTAL DE REGISTROS CON ERROR    : " , WS-SEC3-REG-ER            
566600             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
566800      PERFORM 20000038-ESC-REPMENSA                                           
566805      STRING "TOTAL DE REGISTROS CON EXTEN    : " , WS-SEC3-REG-EX            
566810             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
566815      PERFORM 20000038-ESC-REPMENSA                                           
567000      STRING "TOTAL DE REGISTROS EN RSLT      : " , WS-SEC3-REG-TO            
567200             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
567400      PERFORM 20000038-ESC-REPMENSA                                           
567600      STRING "TOTAL DE REGISTROS LEIDOS RSLT  : " , WS-SEC3-REG-TE            
567800             DELIMITED BY SIZE INTO WS-DET-RM-MSG                             
568000      PERFORM 20000038-ESC-REPMENSA .                                         
568200                                                                              
568400   PERFORM 40000005-FECHA                  .                                  
568600   MOVE WS-FECHA2-AAAA   TO WS-FECHA3-AAAA .                                  
568800   MOVE WS-FECHA2-MM     TO WS-FECHA3-MM   .                                  
569000   MOVE WS-FECHA2-DD     TO WS-FECHA3-DD   .                                  
569200   PERFORM 40000001-HORA                   .                                  
569400   MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH    .                                  
569600   MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM    .                                  
569800   MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS    .                                  
570000   MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC    .                                  
570200                                                                              
570400   STRING "FIN PROCESO",                                                      
570600          " FECHA: ", WS-FECHA-AAAAMMDD,                                      
570800          " HORA: ",  WS-HORA-HHMMSSCC                                        
571000          DELIMITED BY SIZE INTO WS-DET-RM-MSG .                              
571200   PERFORM 20000038-ESC-REPMENSA .                                            
571400                                                                              
571600   PERFORM 20000038-ESC-REPMENSA .                                            
571800                                                                              
571802 00002000-MENSAJE-HOSTNAME.                                       776012      
571804*=================================                                776014      
571806   IF WS-DH-HOSTNAME-PBA                                          776016      
571808      STRING "HOSTNAME DE EJECUCION = " WS-DH-NOM-EQUIPO          776020      
571810          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                 776022      
571812      PERFORM 70000050-MENSAJE.                                   776024      
571814                                                                              
572000*****************************************************************             
572200*                 AREA DE COPY´S                                *             
572400*****************************************************************             
572600                                                                              
572800   COPY "S500/INC/PRO/25MTP002"      .                                        
573000   COPY "S500/INC/MAPLI/PRO/15MTP001".                                        
573200                                                                              
