000100$SET LIST                                                                     
000110$SET LINEINFO                                                                 
000400$SET ERRORLIST                                                                
000700$SET ERRORLIMIT = 100                                                         
001300$SET BDB00R01 S000LIBLJ                                                       
001305$SET BDB00R02                                                                 
001310$SET BDB00R03                                                                 
001315$SET BDB00R04                                                                 
001317$SET BDB17R02 BDB17R06                                                        
001320                                                                              
001330$SET BDB00R22                                                                 
001340$SET BDB00R23                                                                 
001350                                                                              
001600$SET BDB02R01                                                                 
001605$SET BDB02R02                                                                 
001610$SET BDB02R03                                                                 
001615                                                                              
001900$SET BDB05R02                                                                 
001905$SET BDB05R07                                                                 
001910                                                                              
002200$SET BDB09R03                                                                 
002205$SET BDB09R06                                                                 
002210                                                                              
002500$SET BDB14R08                                                                 
002510                                                                              
002800$SET BDB91                                                                    
003100$SET S408LINCRED                                                              
003400$SET S151TOTCVE                                                               
003700$SET S151REGISTRA                                                             
003705$SET S151REGISTRA2                                                            
003710$SET SYSTEMLIBCOMSXATMI                                                       
004300$SET S100VERSIONES                                                            
004600$SET FECHA2000                                                                
004900****************************************************************              
005200*                                                                             
005500* SISTEMA: S500 CAPTACION                                                     
005800* CODIGO DE BATCH P170.                                                       
006100* VERSION  JUN/2006 CUENTA UNO Y ERROR-S408.                                  
006400*                                                                             
006700****************************************************************              
007000* I D E N T I F I C A T I O         D I V I S I O N.                          
007300****************************************************************              
007600 IDENTIFICATION DIVISION.                                                     
007900 PROGRAM-ID. S500P170.                                                        
008200                                                                              
008500****************************************************************              
008800* E N V I R O N M E N T             D I V I S I O N.                          
009100****************************************************************              
009400 ENVIRONMENT DIVISION.                                                        
009700 CONFIGURATION SECTION.                                                       
010000 INPUT-OUTPUT SECTION.                                                        
010300                                                                              
010600****************************************************************              
010900* F I L E   C O N T R O L.                                                    
011200****************************************************************              
011500 FILE-CONTROL.                                                                
011800****************************************************************              
012100* DECLARACION DEL ARCHIVO DE IMPRESION DEL TOTAL DE MOV.                      
012400* TRANSMITIDOS EN BATCH CONTRA EL S151 Y S408.                                
012700****************************************************************              
013000     SELECT FILE-CIFRAS                                                       
013300            ASSIGN TO PRINTER.                                                
013600                                                                              
013900****************************************************************              
014200* DECLARACION DE IMPRESION DEL ARCHIVO DE POSICION DE TODOS LOS               
014500* PRODUCTOS.                                                                  
014800****************************************************************              
015100     SELECT FILE-POSICION                                                     
015400            ASSIGN TO PRINTER.                                                
015700                                                                              
016000****************************************************************              
016300* DECLARACION DEL ARCHIVO DE IMPRESION DEL TOTAL DE CLAVES QUE                
016600* FUERON TRANSMITIDAS EN BATCH.                                               
016900****************************************************************              
017200     SELECT FILE-CLAVES                                                       
017500            ASSIGN TO PRINTER.                                                
017800                                                                              
018100****************************************************************              
018400* DECLARACION DEL ARCHIVO DE IMPRESION DE LAS ESTADISTICAS DE LOS             
018700* MOVIMIENTOS PARA CREAR UNA ESTADISTICA DE TODOS LOS PRODUCTOS.              
019000****************************************************************              
019300     SELECT ESTADISTICAS                                                      
019600            ASSIGN TO PRINTER.                                                
019900                                                                              
020200*****************************************************************             
020500* DECLARACION DEL ARCHIVO SORT PARA EL SORT DE LOS TOTALES P/CVE.             
020800*****************************************************************             
021100     SELECT TOTCVE-SORT          ASSIGN TO SORT DISK.                         
021400                                                                              
021700*****************************************************************             
022000* DECLARACION DEL ARCHIVO DONDE SERAN GRABADOS LOS TOTALES P/CVE              
022300* TANTO DEL S500 COMO DEL S151. QUE SERAN SORTEADOS POSTERIORMENTE            
022600*****************************************************************             
022900     SELECT TOTCVE               ASSIGN TO DISK.                              
023200*****************************************************************             
023250* DECLARACION DEL ARCHIVO DE INCIDENTES PARA REPORTAR FALLAS.                 
023300*****************************************************************             
023350     SELECT ARCH-INCIDENTE       ASSIGN TO DISK.                              
023500****************************************************************              
023800* D A T A              D I V I S I O N.                                       
024100****************************************************************              
024400 DATA DIVISION.                                                               
024700                                                                              
025000****************************************************************              
025300* F I L E              S E C T I O N.                                         
025600****************************************************************              
025900 FILE SECTION.                                                                
026200                                                                              
026500****************************************************************              
026800* FDÀS DE LOS ARCHIVOS DE IMPRESION.                                          
027100****************************************************************              
027400 FD  FILE-CIFRAS                                                              
027700     VALUE OF TITLE IS WS-ETIQ-CIF    .                                       
028000 01  REG-CIFRAS        PIC X(132).                                            
028300                                                                              
028600 FD  FILE-POSICION                                                            
028900     VALUE OF TITLE IS WS-ETIQ-POS.                                           
029200 01  REG-POSICION      PIC X(132).                                            
029500                                                                              
029800 FD  FILE-CLAVES                                                              
030100     VALUE OF TITLE IS WS-ETIQ-CVE   .                                        
030400 01  REG-CLAVES        PIC X(132).                                            
030700                                                                              
031000 FD  ESTADISTICAS                                                             
031300     VALUE OF TITLE IS WS-ETIQ-ESTA.                                          
031600 01  REG-ESTA          PIC X(132).                                            
031900                                                                              
031920 FD  ARCH-INCIDENTE                                                           
031940     RECORD   CONTAINS 180 CHARACTERS                                         
031960     BLOCK    CONTAINS 180 RECORDS                                            
031980     VALUE OF                                                                 
032000           SECURITYTYPE IS PUBLIC                                             
032020           TITLE        IS WS-ETIQ-INCIDENTE                                  
032040           AREAS        IS 15000                                              
032060           AREASIZE     IS 360.                                               
032080                                                                              
032100 01  REG-INCIDENTE       PIC X(180).                                          
032200****************************************************************              
032500* DECLARACION DE LOS CAMPOS REQUERIDOS EN EL SORT DE TOT P/CVE.               
032800****************************************************************              
033100 FD TOTCVE                                                                    
033400   BLOCK CONTAINS 180 RECORDS                                                 
033700   VALUE OF TITLE IS WS-ETIQ-TOTCVE.                                          
034000                                                                              
034300 01 REG-TOTCVE.                                                               
034600   02 TCVE-PRD                 PIC 9(04).                                     
034900   02 TCVE-INS                 PIC 9(04).                                     
035200   02 TCVE-MON                 PIC 9(03).                                     
035500   02 TCVE-CVE                 PIC 9(04).                                     
035800   02 TCVE-IDEN                PIC 9(03).                                     
036100   02 TCVE-NUM                 PIC 9(06).                                     
036400   02 TCVE-IMP                 PIC 9(14)V99.                                  
036700                                                                              
037000****************************************************************              
037300* DECLARACION DE LOS CAMPOS UTILIZADOS EN EL SORT. DE TOT P/CVES.             
037600*****************************************************************             
037900 SD TOTCVE-SORT                                                               
037910    BLOCK  CONTAINS 180 RECORDS                                               
037915    RECORD CONTAINS  41 CHARACTERS.                                           
038200 01 CVE-SORT.                                                                 
038500   02 CVEPRD-SORT              PIC 9(04).                                     
038800   02 CVEINS-SORT              PIC 9(04).                                     
039100   02 CVEMON-SORT              PIC 9(03).                                     
039400   02 CVECVE-SORT              PIC 9(04).                                     
039700   02 CVEIDE-SORT              PIC 9(03).                                     
040000   02 FILLER                   PIC X(22).                                     
040300                                                                              
040600*****************************************************************             
040900                                                                              
041200****************************************************************              
041500* D A T A     B A S E     S E C T I O N.                                      
041800****************************************************************              
042100 DATA-BASE SECTION.                                                           
042400 DB S500BD01CAPTACION.                                                        
042420 01 S500B00CTRLPASO.                                                          
042700 01 S500B02CONTROL.                                                           
043000 01 S500B05INSTRUMEN.                                                         
043300 01 S500B09CIFRAS.                                                            
043600 01 S500B14TOTCVES.                                                           
043650 01 S500B17CVESXFUN.                                                          
043900 01 S500B91REINICIO.                                                          
044200                                                                              
044500****************************************************************              
044800*           W O R K I N G           S T O R A G E.                            
045100****************************************************************              
045400 WORKING-STORAGE SECTION.                                                     
045450 77  W77-CALL-S408-FAL                  PIC 9 VALUE 0.                        
045700 77  WS-CAMBIO                          PIC 9 VALUE 0.                        
046000 77  WS-CAMBIO-PRD                      PIC 9(04).                            
046300 77  WS-CAMBIO-INS                      PIC 9(04).                            
046600 77  WS-CAMBIO-MON                      PIC 9(03).                            
046610 77  WS-CAMBIO-ORI                      PIC 9(03).                            
046620 77  WS-CAMBIO-DES                      PIC 9(03).                            
046900 77  WS-LASTRECORD                      PIC 9(10).                            
047200 77  WS-SORT-ESPACIO                    PIC 9(12).                            
047210 77  WS-SORT-MEMORY                     PIC 9(12).                            
047500 77  WS-TCVE-NDIF                       PIC 9(8).                             
047800 77  WS-TCVE-IDIF                       PIC 9(12)V99.                         
047810 77  WS-RSLT-TRANSIT                    PIC S9(11).                           
048100 77  WS-1                               PIC 9(03).                            
048400 77  WS-2                               PIC 9(03).                            
048700 77  WS-3                               PIC 9(03).                            
049000 77  WS-4                               PIC 9(03).                            
049010 77  WS-CSI                             PIC 9(02).                            
049300 77  WS-VALE2                           PIC 9 VALUE 0.                        
049600 77  WS-VARIANTE                        PIC S9(11) BINARY.                    
049900 77  WS-ACCION                          PIC S9(11) BINARY.                    
050200 77  WS-NUMACT                          PIC 9(10).                            
050500 77  WS-NUMANT                          PIC 9(10).                            
050780 77  WS-B17-FIN                         PIC 9 VALUE 0.                        
050790 77  WS-CVE-B17                         PIC 9(04).                            
050800 77  WS-1VEZ                            PIC 9.                                
051100 77  WS-2VEZ                            PIC 9.                                
051400 77  WS-3VEZ                            PIC 9.                                
051700 77  WS-4VEZ                            PIC 9.                                
052000 77  WS-5VEZ                            PIC 9.                                
052300 77  WS-6VEZ                            PIC 9.                                
052600 77  WS-7VEZ                            PIC 9.                                
052900 77  WS-8VEZ                            PIC 9.                                
053200 77  WS-9VEZ                            PIC 9.                                
053500 77  WS-10VEZ                           PIC 9.                                
053800 77  WS-11VEZ                           PIC 9.                                
054100 77  WS-12VEZ                           PIC 9.                                
054400 77  WS-13VEZ                           PIC 9.                                
054700 77  WS-14VEZ                           PIC 9.                                
055000 77  WS-15VEZ                           PIC 9.                                
055300 77  WS-HOJA                            PIC 9(3).                             
055600 77  WS-HOJA1                           PIC 9(3).                             
055900 77  WS-HOJA2                           PIC 9(3).                             
056200 77  WS-HOJA3                           PIC 9(3).                             
056500 77  WS-HOJA4                           PIC 9(3).                             
056800 77  WS-HOJA5                           PIC 9(3).                             
057100 77  WS-LINEA                           PIC 9(3).                             
057400 77  WS-LINEA1                          PIC 9(3).                             
057700 77  WS-LINEA2                          PIC 9(3).                             
058000 77  WS-LINEA3                          PIC 9(3).                             
058300 77  WS-LINEA4                          PIC 9(3).                             
058600 77  WS-CICLO1                          PIC 9 VALUE 0.                        
058900 77  WS-CICLO2                          PIC 9 VALUE 0.                        
059200 77  WS-CICLO3                          PIC 9 VALUE 0.                        
059500 77  WS-CICLO4                          PIC 9 VALUE 0.                        
059800 77  WS-CICLO5                          PIC 9 VALUE 0.                        
060100 77  WS-CICLO6                          PIC 9 VALUE 0.                        
060400 77  WS-CICLO7                          PIC 9 VALUE 0.                        
060700 77  WS-CICLO8                          PIC 9 VALUE 0.                        
061000 77  WS-CICLO9                          PIC 9 VALUE 0.                        
061300 77  WS-CICLO10                         PIC 9 VALUE 0.                        
061600 77  WS-DECIDE                          PIC X VALUE SPACES.                   
061900 77  WS-DECIDE1                         PIC X VALUE SPACES.                   
062200 77  WS-DECIDE2                         PIC X VALUE SPACES.                   
062500 77  WS-DECIDE3                         PIC X VALUE SPACES.                   
062800 77  WS-PRD-ANT                         PIC 9(04).                            
063100 77  WS-INS-ANT                         PIC 9(04).                            
063400 77  WS-MON-ANT                         PIC 9(03).                            
063700 77  WS-NOMBRE                          PIC X(40).                            
064000 77  WS-PRD                             PIC 9(04).                            
064300 77  WS-INS                             PIC 9(04).                            
064600 77  WS-MON                             PIC 9(04).                            
064900 77  WS-CVEPASO1                        PIC 9(04).                            
065200 77  WS-CVEPASO2                        PIC 9(04).                            
065500 77  WS-IDEPASO1                        PIC 9(03).                            
065800 77  WS-IDEPASO2                        PIC 9(03).                            
066100 77  WS-NUMPASO1                        PIC 9(06).                            
066400 77  WS-NUMPASO2                        PIC 9(06).                            
066700 77  WS-IMPPASO1                        PIC 9(14)V99.                         
067000 77  WS-IMPPASO2                        PIC 9(14)V99.                         
067300 77  WS-151                             PIC 9(03).                            
067600 77  WS-100                             PIC 9(03).                            
067900 77  WS-I                               PIC 9(02).                            
068200 77  WS-J                               PIC 9(02).                            
068500 77  WS-IMP-SBCCC                       PIC 9(14)V99.                         
068510 77  WS-IMP-SBC6E                       PIC 9(14)V99.                         
068515 77  WS-IMP-SBC6EA                      PIC 9(14)V99.                         
068520 77  WS-IMP-SBC6S                      PIC 9(14)V99.                          
068525 77  WS-IMP-SBC6SA                     PIC 9(14)V99.                          
068800 77  WS-IMP-AUTAB                       PIC 9(14)V99.                         
069100 77  WS-NUM-AUTAB                       PIC 9(10).                            
069400 77  WS-IMP-AUTCA                       PIC 9(14)V99.                         
069700 77  WS-NUM-AUTCA                       PIC 9(10).                            
070000 77  WS-NCON                            PIC 9(1).                             
070300 77  WS-NCON1                           PIC 9(1).                             
070600 77  WS-ABONO1                          PIC 9(1).                             
070900 77  WS-ABONO2                          PIC 9(1).                             
071200 77  WS-CARGO1                          PIC 9(1).                             
071500 77  WS-CARGO2                          PIC 9(1).                             
071800 77  WS-IMPT-CAR-S028                   PIC 9(16)V99.                         
072100 77  WS-NUMT-CAR-S028                   PIC 9(08).                            
072400 77  WS-IMPT-ABO-S028                   PIC 9(16)V99.                         
072700 77  WS-NUMT-ABO-S028                   PIC 9(08).                            
073000 77  WS-IMPA-CAR-S028                   PIC 9(16)V99.                         
073300 77  WS-NUMA-CAR-S028                   PIC 9(08).                            
073600 77  WS-IMPA-ABO-S028                   PIC 9(16)V99.                         
073900 77  WS-NUMA-ABO-S028                   PIC 9(08).                            
074200 77  WS-IMPE-NUMERO                     PIC 9(06).                            
074500 77  WS-COMS-NUMERO                     PIC 9(06).                            
074800 77  WS-IMPS-NUMERO                     PIC 9(06).                            
075100 77  WS-INTS-NUMERO                     PIC 9(06).                            
075400 77  WS-IMPE-IMPORTE                    PIC 9(12)V99.                         
075700 77  WS-COMS-IMPORTE-C                  PIC 9(12)V99.                         
075710 77  WS-COMS-IMPORTE-A                  PIC 9(12)V99.                         
076000 77  WS-IMPS-IMPORTE                    PIC 9(12)V99.                         
076300 77  WS-INTS-IMPORTE                    PIC 9(12)V99.                         
076600 77  WS-BLO-IMPENT                      PIC 9(12)V99.                         
076900 77  WS-BLO-IMPSAL                      PIC 9(12)V99.                         
076950 77  WS-CGO-CTAGLOB                     PIC 9(12)V99.                         
077000 77  WS-ABO-CTAGLOB                     PIC 9(12)V99.                         
077050 77  WS-CGO-CTABENEF                    PIC 9(12)V99.                         
077100 77  WS-ABO-CTABENEF                    PIC 9(12)V99.                         
077200 77  WS-NUMTEM1                         PIC 9(06).                            
077500 77  WS-NUMTEM2                         PIC 9(06).                            
077800 77  WS-IMPTEM1                         PIC 9(12)V99.                         
078100 77  WS-IMPTEM2                         PIC 9(12)V99.                         
078400 77  WS-A                               PIC 9.                                
078700 77  WS-C                               PIC 9.                                
079000 77  WS-AA                              PIC 9.                                
079300 77  WS-CA                              PIC 9.                                
079310 77  WS-IND                             PIC 99.                               
079600 77  W77-PAR-RESULT                     PIC 99 VALUE 0.                       
079900***************************************************************               
080200* BANDERAS UTILIZADAS PARA EL GRABADO DE ESTRUCTURAS.                         
080500***************************************************************               
080510 77 WS-BAN-B00      PIC 9 VALUE 0.                                            
080800 77 WS-BAN-B02      PIC 9 VALUE 0.                                            
081100 77 WS-BAN-B05      PIC 9 VALUE 0.                                            
081400 77 WS-BAN-B09      PIC 9 VALUE 0.                                            
081700 77 WS-BAN-B14      PIC 9 VALUE 0.                                            
082000                                                                              
082100****  VARIABLES DE B17 ******************************************             
082110  01 WS-TAB-B17-BAN.                                                          
082112     02 WS-TB-B17-DATO           OCCURS 9999.                                 
082114        04 WS-B17-IND-ACUM-VAL   PIC 9.                                       
082170                                                                              
082190**************************************************************                
082300***************************************************************               
082600* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                  
082900* ACCESO A LA BASE DE DATOS, ASI COMO CAMPOS COMUNES.                         
083200***************************************************************               
083500  COPY "S500/INC/WOR/25MTP002".                                               
083800  COPY "S500/INC/WOR/DAS/25MTP003".                                           
083900                                                                              
084100                                                                              
084110***************************************************************               
084120* REDEFINICION  DE BANCO ORIGEN Y BANCO DESTINO.                              
084130***************************************************************               
084140 01 WS-BANORIDES              PIC 9(06).                                      
084150 01 WS-BANOD REDEFINES WS-BANORIDES.                                          
084160   02 WS-BAN-ORI              PIC 9(03).                                      
084170   02 WS-BAN-DES              PIC 9(03).                                      
084180                                                                              
084400***************************************************************               
084700* VARIABLES UTILIZADAS PARA ACUMULAR LOS TOTALES DEL  S500 U                  
085000* OTRO SISTEMA.                                                               
085300*****************************************************************             
085600 01 WS-DIF.                                                                   
085900    02 WS-NUM-NCON-500                   PIC 9(08).                           
086200    02 WS-IMP-NCON-500                   PIC 9(16)V99.                        
086500    02 WS-NUM-NCON-OTRO                  PIC 9(08).                           
086800    02 WS-IMP-NCON-OTRO                  PIC 9(16)V99.                        
087100    02 WS-IMP-SCAR-500A                  PIC 9(16)V99.                        
087400    02 WS-IMP-SCAR-500                   PIC 9(16)V99.                        
087700    02 WS-NUM-SCAR-500A                  PIC 9(08).                           
088000    02 WS-NUM-SCAR-500                   PIC 9(08).                           
088300    02 WS-IMP-SABO-500A                  PIC 9(16)V99.                        
088600    02 WS-IMP-SABO-500                   PIC 9(16)V99.                        
088900    02 WS-NUM-SABO-500A                  PIC 9(08).                           
089200    02 WS-NUM-SABO-500                   PIC 9(08).                           
089500    02 WS-IMP-SCAR-OTROA                 PIC 9(16)V99.                        
089800    02 WS-IMP-SCAR-OTRO                  PIC 9(16)V99.                        
090100    02 WS-NUM-SCAR-OTROA                 PIC 9(08).                           
090400    02 WS-NUM-SCAR-OTRO                  PIC 9(08).                           
090700    02 WS-IMP-SABO-OTROA                 PIC 9(16)V99.                        
091000    02 WS-IMP-SABO-OTRO                  PIC 9(16)V99.                        
091300    02 WS-NUM-SABO-OTROA                 PIC 9(08).                           
091600    02 WS-NUM-SABO-OTRO                  PIC 9(08).                           
091900    02 WS-IMP-TCAR-DIF                   PIC 9(16)V99.                        
092200    02 WS-NUM-TCAR-DIF                   PIC 9(08).                           
092500    02 WS-IMP-TABO-DIF                   PIC 9(16)V99.                        
092800    02 WS-NUM-TABO-DIF                   PIC 9(08).                           
093100    02 WS-IMP-SCAR-DIF                   PIC 9(16)V99.                        
093400    02 WS-NUM-NCON-DIF                   PIC 9(08).                           
093700    02 WS-IMP-NCON-DIF                   PIC 9(16)V99.                        
094000    02 WS-NUM-SCAR-DIF                   PIC 9(08).                           
094300    02 WS-IMP-SABO-DIF                   PIC 9(16)V99.                        
094600    02 WS-NUM-SABO-DIF                   PIC 9(08).                           
094900    02 WS-IMP-POS-LSAL                   PIC 9(16)V99.                        
095200    02 WS-NUM-POS-LSAL                   PIC 9(08).                           
095500    02 WS-IMP-POS-LENT                   PIC 9(16)V99.                        
095800    02 WS-NUM-POS-LENT                   PIC 9(08).                           
096100    02 WS-IMP-AUT-LSAL                   PIC 9(16)V99.                        
096400    02 WS-NUM-AUT-LSAL                   PIC 9(08).                           
096700    02 WS-IMP-AUT-LENT                   PIC 9(16)V99.                        
097000    02 WS-NUM-AUT-LENT                   PIC 9(08).                           
097010    02 WS-IMP-6DI-LENT                   PIC 9(16)V99.                        
097020    02 WS-IMP-6DI-LSAL                   PIC 9(16)V99.                        
097300                                                                              
097320***************************************************************               
097340* VARIABLES PARA EL ARCHIVO DE INCIDENTES                                     
097360***************************************************************               
097380 01 WKS-CLAVE                   PIC 9(04) VALUE 0.                            
097400 01 WKS-IMPORTE                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99 VA 0.                  
097420 01 WKS-HAY-INC                 PIC 9(01) VALUE 0.                            
097520 01 WKS-TOT-INC                 PIC 9(03) VALUE 0.                            
097600****************************************************************              
097900* VARIABLES UTILIZADAS POR EL S500 PARA INDICARLE AL S151 QUE YA              
098200* HA FINALIZADO EL PROCESO BATCH.                                             
098500****************************************************************              
098800 01 WS-S151-FIN          WITH LOWER-BOUNDS.                                   
099100   02 WS-S151-FINFUN        PIC  9(02).                                       
099400   02 WS-S151-FINSIS        PIC  9(04)     COMP.                              
099700   02 WS-S151-FINREF        PIC  9(02)     COMP.                              
100000   02 WS-S151-FINSTA        PIC  9(02).                                       
100300                                                                              
100600***************************************************************               
100900* ETIQUETA DEL NOMBRE DEL ARCHIVO DE TOTALES P/CVE QUE SERA                   
101200* SORTEADO PARA IMPRIMIR LOS TOTALES P/CVE Y LOS TOTALES DE CIF.              
101500***************************************************************               
101800 01 WS-ETIQ-TOTCVE.                                                           
102100   02 WS-CVE-SIS            PIC X(15) VALUE "S500/FILE/S500/".                
102400   02 WS-CVE-CSIO           PIC 99.                                           
102700   02 FILLER                PIC X     VALUE "/".                              
103000   02 WS-CVE-CSID           PIC 99.                                           
103300   02 FILLER                PIC X     VALUE "/".                              
103600   02 WS-CVE-TIT            PIC X(08) VALUE "TOTCVEB/".                       
103900   02 WS-CVE-FEC            PIC 9(06).                                        
104200   02 FILLER                PIC X     VALUE ".".                              
104500                                                                              
104800****************************************************************              
105100* ETIQUETA DEL REPORTE DE CIFRAS DEL S500 V.S. S151.                          
105400****************************************************************              
105700 01 WS-ETIQ-CIF.                                                              
106000    03  FILLER         PIC X(15) VALUE "S500/LIST/P170/".                     
106300    03  WS-CIF-CI      PIC 99.                                                
106600    03  WS-CIF-SUBNODO PIC 99.                                                
106900    03  FILLER         PIC X     VALUE "/".                                   
107200    03  WS-CIF-CIFRA   PIC X     VALUE "C".                                   
107500    03  FILLER         PIC X(4)  VALUE "000/".                                
107800    03  WS-CIF-FECHA   PIC 9(6).                                              
108100    03  FILLER         PIC X     VALUE "/".                                   
108400    03  WS-CIF-MIX     PIC 9(7).                                              
108700    03  FILLER         PIC X(4)  VALUE "/001".                                
109000    03  WS-CIF-NOMBRE  PIC X(14)  VALUE "TOTALESBATCH .".                     
109300                                                                              
109600****************************************************************              
109900* ETIQUETA DEL REPORTE DE POSICION.                                           
110200****************************************************************              
110500 01 WS-ETIQ-POS.                                                              
110800    02  FILLER          PIC X(15) VALUE "S500/LIST/P170/".                    
111100    02  WS-POS-CI       PIC 99.                                               
111400    02  WS-POS-SUBNODO  PIC 99.                                               
111700    02  FILLER          PIC X(06) VALUE "/C000/".                             
112000    02  WS-POS-FECHA    PIC 9(06).                                            
112300    02  FILLER          PIC X     VALUE "/".                                  
112600    02  WS-POS-MIX      PIC 9(07).                                            
112900    02  FILLER          PIC X(18)  VALUE "/003POSICION     .".                
113200                                                                              
113500****************************************************************              
113800* ETIQUETA DEL REPORTE DE TOTALES P/CVE TRANSMITIDOS EN BATCH.                
114100****************************************************************              
114400 01 WS-ETIQ-CVE.                                                              
114700    02  FILLER         PIC X(15) VALUE "S500/LIST/P170/".                     
115000    02  WS-CVE-CI      PIC 99.                                                
115300    02  WS-CVE-SUBNODO PIC 99.                                                
115600    02  FILLER         PIC X(06) VALUE "/C000/".                              
115900    02  WS-CVE-FECHA   PIC 9(06).                                             
116200    02  FILLER         PIC X     VALUE "/".                                   
116500    02  WS-CVE-MIX     PIC 9(07).                                             
116800    02  FILLER         PIC X(18)  VALUE "/002TOTALCVEBATCH.".                 
117100****************************************************************              
117110*                  ETIQUETA DEL ARCHIVO DE INCIDENTES.                        
117120****************************************************************              
117130 01  WS-ETIQ-INCIDENTE.                                                       
117140     02 FILLER                 PIC X(24) VALUE                                
117150                               "S500/FILE/INTS/50004S01/".                    
117160     02 W-ETIQ-INCIDEN-CSI     PIC 9(02).                                     
117170     02 FILLER                 PIC X(01) VALUE "/".                           
117180     02 W-ETIQ-INCIDEN-FEC     PIC 9(08).                                     
117190     02 FILLER                 PIC X(11) VALUE                                
117200                               "/INCIDENTE/".                                 
117210     02 W-ETIQ-INCIDEN-CPY     PIC 9(02) VALUE 01.                            
117220     02 FILLER                 PIC X(02) VALUE " .".                          
117230                                                                              
117240 01  WKS-INCID-HEADER.                                                        
117250     02 WKS-I06-01-TPOREG    PIC 9(02)      VALUE 01.                         
117260     02 WKS-I06-01-CSI       PIC 9(02).                                       
117270     02 WKS-I06-01-FECHA     PIC 9(08).                                       
117280     02 WKS-I06-01-COPIA     PIC 9(02)      VALUE 01.                         
117290     02 WKS-I06-01-ULTPASO   PIC 9(04)      VALUE 0170.                       
117300     02 FILLER               PIC X(162)     VALUE " ".                        
117302                                                                              
117304 01  WKS-INCID-DATOS.                                                         
117306     02 WKS-I06-05-TPOREG    PIC 9(02)      VALUE 05.                         
117308     02 WKS-I06-05-QUEPASO   PIC X(05)      VALUE " P170".                    
117310     02 WKS-I06-05-DATINCID  PIC X(173).                                      
117312                                                                              
117314 01  WKS-INCID-TRAILER.                                                       
117316     02 WKS-I06-05-TPOREG    PIC 9(02)      VALUE 99.                         
117318     02 WKS-I06-05-TOTREG    PIC 9(06)      VALUE 0.                          
117320     02 WKS-I06-05-FILLER    PIC X(172)     VALUE " ".                        
117322                                                                              
117324                                                                              
117400****************************************************************              
117700* ETIQUETA DE IMPRESION DEL REPORTE DE ESTADISTICAS.                          
118000****************************************************************              
118300 01 WS-ETIQ-ESTA.                                                             
118600   02 FILLER          PIC X(15) VALUE "S500/LIST/P170/".                      
118900   02 WS-ESTA-CI      PIC 99.                                                 
119200   02 WS-ESTA-SUBNODO PIC 99.                                                 
119500   02 FILLER          PIC X(06) VALUE "/R000/".                               
119800   02 WS-ESTA-FECHA   PIC 9(6).                                               
120100   02 FILLER          PIC X     VALUE "/".                                    
120400   02 WS-ESTA-MIX     PIC 9(7).                                               
120700   02 FILLER          PIC X(18)  VALUE "/004ESTADISTICAS .".                  
121000                                                                              
121300****************************************************************              
121600*  VARIABLES UTILIZADOS EN LA CAPTURA DE HORA Y FECHAS.                       
121900****************************************************************              
130000 01 WS-FECHA-MDA                        PIC 9(08).                            
130300 01 WS-FECHA-MDA-R REDEFINES WS-FECHA-MDA.                                    
130600    02 WS-DIA-MM1                       PIC 99.                               
130900    02 WS-DIA-DD1                       PIC 99.                               
131200    02 WS-DIA-AA1                       PIC 9(04).                            
131500                                                                              
131800 01 WS-FECHA-PASO                       PIC 9(08).                            
132100 01 WS-PASO-AMD REDEFINES WS-FECHA-PASO.                                      
132400    02 WS-PASO-AA                       PIC 9(04).                            
132700    02 WS-PASO-MM                       PIC 99.                               
133000    02 WS-PASO-DD                       PIC 99.                               
133300                                                                              
133600 01 WS-FECHA-MEN                        PIC 9(08).                            
133900 01 WS-MEN-AMD REDEFINES WS-FECHA-MEN.                                        
134200    02 WS-MEN-AA                        PIC 9(04).                            
134500    02 WS-MEN-MM                        PIC 99.                               
134800    02 WS-MEN-DD                        PIC 99.                               
135100                                                                              
135400 01 WS-FECHA-DIA                        PIC 9(08).                            
135700 01 WS-FECHA-DIA-DMA REDEFINES WS-FECHA-DIA.                                  
136000    02 WS-DIA-AA                        PIC 9(04).                            
136300    02 WS-DIA-MM                        PIC 99.                               
136600    02 WS-DIA-DD                        PIC 99.                               
136900                                                                              
137200 01 WS-FECHA-PRO                        PIC 9(08).                            
137500 01 WS-FECHA-PRO-DMA REDEFINES WS-FECHA-PRO.                                  
137800    02 WS-PRO-AA                        PIC 9(04).                            
138100    02 WS-PRO-MM                        PIC 99.                               
138400    02 WS-PRO-DD                        PIC 99.                               
138700                                                                              
139000 01 WS-HORA-HMSC-01.                                                          
139300    03 WS-HORA-HMSC-N                   PIC 9(8).                             
139600    03 WS-HORA-HMSC REDEFINES                                                 
139900       WS-HORA-HMSC-N.                                                        
140200       05 WS-HORA-HMS-N                 PIC 9(6).                             
140500       05 WS-HORA-HMS REDEFINES                                               
140800          WS-HORA-HMS-N.                                                      
141100          07 WS-HORA-HH-N               PIC 9(2).                             
141400          07 WS-HORA-MM-N               PIC 9(2).                             
141700          07 WS-HORA-SS-N               PIC 9(2).                             
142000       05 FILLER                           PIC 9(2).                          
142300                                                                              
142600****************************************************************              
142900****************************************************************              
143200*          A R E A       D E       E N C A B E Z A D O S.                     
143500****************************************************************              
143800****************************************************************              
144100                                                                              
144400****************************************************************              
144700* PRIMER ENCABEZADO GENERAL DE LOS REPORTES GENERADOS.                        
145000****************************************************************              
145300 01  WS-ENCABEZADO.                                                           
145600     05 FILLER                             PIC X(51)                          
145900        VALUE SPACES.                                                         
146200     05 FILLER                             PIC X(29)                          
146500        VALUE "BANCO NACIONAL DE MEXICO S.A.".                                
146800                                                                              
147100****************************************************************              
147400* SEGUNDO ENCABEZADO GENERAL DE LOS REPORTE GENERADOS.                        
147700****************************************************************              
148000 01  WS-ENCABEZADO1.                                                          
148300     05 FILLER                             PIC X(56)                          
148600        VALUE SPACES.                                                         
148900     05 FILLER                             PIC X(20)                          
149200        VALUE "DEPOSITOS A LA VISTA".                                         
149500                                                                              
149800****************************************************************              
150100* TERCER ENCABEZADO PARA EL REPORTE DE DIFERENCIAS EN BATCH.                  
150400****************************************************************              
150700 01  WS-03-DIF.                                                               
151000     05 FILLER                        PIC X(18)                               
151300        VALUE "  S500-P170-DIFBAT".                                           
151600     05 FILLER                        PIC X(36) VALUE SPACES.                 
151900     05 WS-DIF-NOMBRE                 PIC X(40).                              
152200     05 WS-DIF-PRD                    PIC ZZZ9.                               
152500     05 FILLER                        PIC X     VALUE SPACES.                 
152800     05 WS-DIF-INS                    PIC ZZZ9.                               
153100     05 FILLER                        PIC X     VALUE SPACES.                 
153400     05 WS-DIF-MON                    PIC ZZ9.                                
153700     05 FILLER                        PIC X     VALUE SPACES.                 
154000     05 FILLER                        PIC X(6)                                
154300        VALUE "FECHA ".                                                       
154600     05 WS-DIF-DIA                    PIC Z9.                                 
154900     05 FILLER                        PIC X VALUE "/".                        
155200     05 WS-DIF-MES                    PIC 9(02).                              
155500     05 FILLER                        PIC X VALUE "/".                        
155800     05 WS-DIF-ANO                    PIC 9(04).                              
156100                                                                              
156400****************************************************************              
156700* TERCER ENCABEZADO  DEL LISTADO DE IMPRESION DE TOTALES P/CVE.               
157000****************************************************************              
157300 01  WS-03-CVE.                                                               
157600     05 FILLER                        PIC X(18)                               
157900        VALUE "  S500-P170-TOTCVE".                                           
158200     05 FILLER                        PIC X(36) VALUE SPACES.                 
158500     05 WS-CVE-NOMBRE                 PIC X(40) VALUE SPACES.                 
158800     05 WS-CVE-PRD                    PIC ZZZ9.                               
159100     05 FILLER                        PIC X     VALUE SPACES.                 
159400     05 WS-CVE-INS                    PIC ZZZ9.                               
159700     05 FILLER                        PIC X     VALUE SPACES.                 
160000     05 WS-CVE-MON                    PIC ZZ9.                                
160300     05 FILLER                        PIC X     VALUE SPACES.                 
160600     05 FILLER                        PIC X(06)                               
160900        VALUE "FECHA ".                                                       
161200     05 WS-CVE-DIA                    PIC Z9.                                 
161500     05 FILLER                        PIC X VALUE "/".                        
161800     05 WS-CVE-MES                    PIC 9(02).                              
162100     05 FILLER                        PIC X VALUE "/".                        
162400     05 WS-CVE-ANO                    PIC 9(04).                              
162700                                                                              
163000****************************************************************              
163300* TERCER ENCABEZADO PARA EL LISTADO ESTADISTICO.                              
163600****************************************************************              
163900 01  WS-03-ESTA.                                                              
164200     05 FILLER                        PIC X(18)                               
164500        VALUE "S500-P170-ESTADIS ".                                           
164800     05 FILLER                        PIC X(36) VALUE SPACES.                 
165100     05 WS-ESTA-NOMBRE                PIC X(40) VALUE SPACES.                 
165400     05 WS-ESTA-PRD                   PIC ZZZ9.                               
165700     05 FILLER                        PIC X     VALUE SPACES.                 
166000     05 WS-ESTA-INS                   PIC ZZZ9.                               
166300     05 FILLER                        PIC X     VALUE SPACES.                 
166600     05 WS-ESTA-MON                   PIC ZZ9.                                
166900     05 FILLER                        PIC X     VALUE SPACES.                 
167200     05 FILLER                        PIC X(06)                               
167500        VALUE "FECHA ".                                                       
167800     05 WS-ESTA-DIA                   PIC 99.                                 
168100     05 FILLER                        PIC X VALUE "/".                        
168400     05 WS-ESTA-MES                   PIC 9(02).                              
168700     05 FILLER                        PIC X VALUE "/".                        
169000     05 WS-ESTA-ANO                   PIC 9(04).                              
169300                                                                              
169600****************************************************************              
169900* TERCER ENCABEZADO PARA EL LISTADO DE LA POSICION.                           
170200****************************************************************              
170500 01 WS-03-POSI.                                                               
170800     05 FILLER                        PIC X(18)                               
171100        VALUE "  S500-P170-POSCIF".                                           
171400     05 FILLER                        PIC X(36) VALUE SPACES.                 
171700     05 WS-POS-NOMBRE                 PIC X(40).                              
172000     05 WS-POS-PRD                    PIC ZZZ9.                               
172300     05 FILLER                        PIC X     VALUE SPACES.                 
172600     05 WS-POS-INS                    PIC ZZZ9.                               
172900     05 FILLER                        PIC X     VALUE SPACES.                 
173200     05 WS-POS-MON                    PIC ZZZ9.                               
173500     05 FILLER                        PIC X     VALUE SPACES.                 
173800     05 FILLER                        PIC X(6)                                
174100        VALUE "FECHA ".                                                       
174400     05 WS-POS-DIA                    PIC Z9.                                 
174700     05 FILLER                        PIC X VALUE "/".                        
175000     05 WS-POS-MES                    PIC 9(02).                              
175300     05 FILLER                        PIC X VALUE "/".                        
175600     05 WS-POS-ANO                    PIC 9(04).                              
175900                                                                              
176200*****************************************************************             
176500* CUARTO ENCABEZADO PARA EL REPORTE DE DIFERENCIAS EN BATCH.                  
176800****************************************************************              
177100 01  WS-04-DIF.                                                               
177400     05 FILLER                             PIC X(10)                          
177700        VALUE "  PROCESO ".                                                   
178000     05 WS-DIF-DIA1                        PIC Z9.                            
178300     05 FILLER                             PIC X VALUE "/".                   
178600     05 WS-DIF-MES1                        PIC 9(02).                         
178900     05 FILLER                             PIC X VALUE "/".                   
179200     05 WS-DIF-ANO1                        PIC 9(04).                         
179500     05 FILLER                             PIC X(31)                          
179800           VALUE SPACES.                                                      
180100     05 FILLER                             PIC X(29)                          
180400           VALUE "CIFRAS DE CONTROL:  B A T C H".                             
180700     05 FILLE                              PIC X(37)                          
181000           VALUE SPACES.                                                      
181300     05 FILLER                             PIC X(05)                          
181600        VALUE "HOJA ".                                                        
181900     05 WS-DIF-HOJA                        PIC ZZ9.                           
182200                                                                              
182500*****************************************************************             
182800* CUARTO ENCABEZADO PARA EL LISTADO DE TOTALES P/CVES DE BATCH.               
183100****************************************************************              
183400 01  WS-04-CVE.                                                               
183700     05 FILLER                             PIC X(10)                          
184000        VALUE "  PROCESO ".                                                   
184300     05 WS-CVE-DIA1                        PIC Z9.                            
184600     05 FILLER                             PIC X VALUE "/".                   
184900     05 WS-CVE-MES1                        PIC 9(02).                         
185200     05 FILLER                             PIC X VALUE "/".                   
185500     05 WS-CVE-ANO1                        PIC 9(04).                         
185800     05 FILLER                             PIC X(31)                          
186100           VALUE SPACES.                                                      
186400     05 FILLER                             PIC X(29)                          
186700           VALUE "TOTALES POR CLAVE MOVS. BATCH".                             
187000     05 FILLE                              PIC X(37)                          
187300           VALUE SPACES.                                                      
187600     05 FILLER                             PIC X(05)                          
187900        VALUE "HOJA ".                                                        
188200     05 WS-CVE-HOJA                        PIC ZZ9.                           
188500                                                                              
188800****************************************************************              
189100* CUARTO ENCABEZADO PARA EL REPORTE DE ESTADISTICAS                           
189400****************************************************************              
189700 01  WS-04-ESTA.                                                              
190000     05 FILLER                           PIC X(10) VALUE                      
190300        "PROCESO   ".                                                         
190600     05 WS-ESTA-DIA1                     PIC 9(02).                           
190900     05 FILLER                           PIC X VALUE "/".                     
191200     05 WS-ESTA-MES1                     PIC 9(02).                           
191500     05 FILLER                           PIC X VALUE "/".                     
191800     05 WS-ESTA-ANO1                     PIC 9(04).                           
192100     05 FILLER                           PIC X(30) VALUE SPACES.              
192400     05 FILLER                           PIC X(31) VALUE                      
192700           "ESTADISTICAS DE LOS MOV DEL DIA".                                 
193000     05 FILLER                           PIC X(36) VALUE SPACES.              
193300     05 FILLER                           PIC X(05) VALUE "HOJA ".             
193600     05 WS-ESTA-HOJA                     PIC ZZ9.                             
193900                                                                              
194200*****************************************************************             
194500* CUARTO ENCABEZADO PARA EL LISTADO DE POSICION.                              
194800****************************************************************              
195100 01  WS-04-POSI.                                                              
195400     05 FILLER                          PIC X(10)                             
195700        VALUE "  PROCESO ".                                                   
196000     05 WS-POS-DIA1                     PIC Z9.                               
196300     05 FILLER                          PIC X VALUE "/".                      
196600     05 WS-POS-MES1                     PIC 9(02).                            
196900     05 FILLER                          PIC X VALUE "/".                      
197200     05 WS-POS-ANO1                     PIC 9(04).                            
197500     05 FILLER                          PIC X(31)                             
197800           VALUE SPACES.                                                      
198100     05 FILLER                          PIC X(29)                             
198400           VALUE "  CIFRAS DE POSICION P/PRD   ".                             
198700     05 FILLER                          PIC X(37)                             
199000           VALUE SPACES.                                                      
199300     05 FILLER                          PIC X(05)                             
199600        VALUE "HOJA ".                                                        
199900     05 WS-POS-HOJA                     PIC ZZ9.                              
200200                                                                              
200205*****************************************************************             
200210* ENCABEZADO PARA EL LISTADO DE POSICION 2311 DE SBC.                         
200215****************************************************************              
200220 01  WS-04-SBC6.                                                              
200225     05 FILLER                          PIC X(44) VALUE SPACES.               
200230     05 FILLER                          PIC X(44)                             
200235     VALUE "  CIFRAS DE POSICION P/PRD DE SBC T+6 2311  ".                    
200240                                                                              
200500****************************************************************              
200800* ENCABEZADO PARA LA HORA.                                                    
201100****************************************************************              
201400 01 WS-IMP-HORA.                                                              
201700    05 FILLER                          PIC X(06) VALUE                        
202000       "HORA: ".                                                              
202300    05 WS-IMP-HH                       PIC Z9.                                
202600    05 FILLER                          PIC X VALUE ":".                       
202900    05 WS-IMP-MM                       PIC 9(002).                            
203200    05 FILLER                          PIC X VALUE ":".                       
203500    05 WS-IMP-SS                       PIC 9(002).                            
203510    05 FILLER                          PIC X(06) VALUE SPACES.                
203520    05 FILLER                          PIC X(05) VALUE                        
203530      "CSI: ".                                                                
203540    05 WS-IMP-CSI                      PIC 99.                                
203800                                                                              
204100****************************************************************              
204400* ENCABEZADO PARA LOS TITULOS PARA EL LISTADO DE POSICION.                    
204700****************************************************************              
205000 01  WS-TIT-POSI.                                                             
205300     02 FILLER                            PIC X(44)                           
205600        VALUE SPACES.                                                         
205900     02 FILLER                            PIC X(06)                           
206200        VALUE "NUMERO".                                                       
206500     02 FILLER                            PIC X(13)                           
206800        VALUE   SPACES.                                                       
207100     02 FILLER                            PIC X(7)                            
207400        VALUE    "CARGOS ".                                                   
207700     02 FILLER                            PIC X(15)                           
208000        VALUE   SPACES.                                                       
208300     02 FILLER                            PIC X(06)                           
208600        VALUE "NUMERO".                                                       
208900     02 FILLER                            PIC X(11)                           
209200        VALUE   SPACES.                                                       
209500     02 FILLER                            PIC X(08)                           
209800        VALUE "ABONOS  ".                                                     
210100                                                                              
210105****************************************************************              
210110* ENCABEZADO PARA LOS TITULOS PARA EL LISTADO DE POSICION. T+6.               
210115****************************************************************              
210120 01  WS-POSI-T6.                                                              
210125     02 FILLER                    PIC X(63) VALUE SPACES.                     
210130     02 FILLER                    PIC X(7)  VALUE "CARGOS ".                  
210135     02 FILLER                    PIC X(32) VALUE SPACES.                     
210140     02 FILLER                    PIC X(08) VALUE "ABONOS  ".                 
210150                                                                              
210400****************************************************************              
210700*  ENCABEZADO PARA LOS TITULOS DE  TOTALES P/CVE.                             
211000****************************************************************              
211300 01  WS-TIT-CVES.                                                             
211600     02 FILLER PIC X(09) VALUE "  CLAVE  ".                                   
211900     02 FILLER PIC X(31) VALUE "                   IMPORTE     ".             
212200     02 FILLER PIC X(15) VALUE "    NUMERO    ".                              
212500     02 FILLER PIC X(20) VALUE "        IMPORTE    ".                         
212800     02 FILLER PIC X(12) VALUE "    NUMERO  ".                                
213100     02 FILLER PIC X(20) VALUE "        IMPORTE     ".                        
213400     02 FILLER PIC X(10) VALUE "    NUMERO".                                  
213700                                                                              
214000                                                                              
214300****************************************************************              
214600* ENCABEZADO PARA CARGOS Y ABONOS DE CIFRAS DE CONTROL.                       
214900****************************************************************              
215200 01 WS-TIT-CARABO.                                                            
215500     02 FILLER           PIC X(26) VALUE SPACES.                              
215800     02 FILLER           PIC X(13) VALUE  "  C A R G O S".                    
216100     02 FILLER           PIC X(24) VALUE SPACES.                              
216400     02 FILLER           PIC X(13) VALUE  "  A B O N O S".                    
216700                                                                              
217000****************************************************************              
217300* ENCABEZADO PARA LOS TOTALES DEL S028.                                       
217600****************************************************************              
217900 01 WS-TIT-S028.                                                              
218200     02 FILLER           PIC X(10) VALUE "  S 0 2 8".                         
218500                                                                              
218800****************************************************************              
219100* ENCABEZADO PARA LOS TOTALES DEL S052.                                       
219400****************************************************************              
219700 01 WS-TIT-S052.                                                              
220000     02 FILLER           PIC X(17) VALUE "  P O S I C I O N".                 
220300                                                                              
220600****************************************************************              
220900* ENCABEZADO PARA EL IMPUESTO DE ENTRADA.                                     
221200****************************************************************              
221500 01 WS-TIT-IMPE.                                                              
221800   02 FILLER PIC X(23) VALUE "  I M P U E S T O      ".                       
222100                                                                              
222400****************************************************************              
222700* ENCABEZADO PARA LAS COMISIONES.                                             
223000****************************************************************              
223300 01 WS-TIT-COM.                                                               
223600   02 FILLER PIC X(23) VALUE "  C O M I S I O N E S  ".                       
223900                                                                              
224200****************************************************************              
224500* ENCABEZADO PARA LOS INTERESES.                                              
224800****************************************************************              
225100 01 WS-TIT-INT.                                                               
225400   02 FILLER PIC X(23) VALUE "  I N T E R E S E S    ".                       
225700                                                                              
226000****************************************************************              
226300* ENCABEZADO PARA EL SBC. CON CAMBIO DE PRODUCTO.                             
226600****************************************************************              
226900 01 WS-TIT-SBCCC.                                                             
227200   02 FILLER PIC X(46) VALUE                                                  
227500   "  S . B . C.  C O N  C A M B I O  D E   P R D.".                          
227800                                                                              
227810****************************************************************              
227815* ENCABEZADO PARA EL SBC T+6 . CON CAMBIO DE PRODUCTO. DEL DIA.               
227820****************************************************************              
227825 01 WS-TIT-SBC6D.                                                             
227830   02 FILLER PIC X(48) VALUE                                                  
227835   "  S . B . C.  T+6 CON CAMBIO DE PRODUCTO DEL DIA".                        
227840                                                                              
227850****************************************************************              
227860* ENCABEZADO PARA EL SBC T+6 . CON CAMBIO DE PRODUCTO. DIAS ANT.              
227870****************************************************************              
227880 01 WS-TIT-SBC6DA.                                                            
227890   02 FILLER PIC X(56) VALUE                                                  
227900   "  S . B . C.  T+6 CON CAMBIO DE PRODUCTO DIAS ANTERIORES".                
227910                                                                              
228100****************************************************************              
228400* ENCABEZADO PARA EL ACUMULADO DE TRASPASOS A BENEFICENCIA                    
228700****************************************************************              
229000 01 WS-TIT-BENEF.                                                             
229300   02 FILLER PIC X(46) VALUE                                                  
229600   "  PASIVO TRANSITORIO BENEF   ".                                           
229900                                                                              
230200****************************************************************              
230500* ENCABEZADO PARA LOS TOTALES DEL S408.                                       
230800****************************************************************              
231100 01 WS-TIT-S408.                                                              
231400     02 FILLER           PIC X(10) VALUE "  S 4 0 8".                         
231700                                                                              
232000****************************************************************              
232300* ENCABEZADO PARA LOS TOTALES DEL S151.                                       
232600****************************************************************              
232900 01 WS-TIT-S151.                                                              
233200     02 FILLER           PIC X(10) VALUE "  S 1 5 1".                         
233500                                                                              
233800****************************************************************              
234100*  ENCABEZADO PARA LOS TOTALES DE S500 VS S408.                               
234400****************************************************************              
234700 01  WS-TIT-500408.                                                           
235000     02 FILLER                            PIC X(26)                           
235300        VALUE SPACES.                                                         
235600     02 FILLER                            PIC X(13)                           
235900        VALUE "      S 5 0 0".                                                
236200     02 FILLER                            PIC X(24)                           
236500        VALUE   SPACES.                                                       
236800     02 FILLER                            PIC X(13)                           
237100        VALUE "      S 4 0 8".                                                
237400     02 FILLER                            PIC X(30)                           
237700        VALUE   SPACES.                                                       
238000     02 FILLER                            PIC X(11)                           
238300        VALUE "DIFERENCIAS".                                                  
238600                                                                              
238900****************************************************************              
239200*  ENCABEZADO PARA LOS TOTALES DE S500 VS S151.                               
239500****************************************************************              
239800 01  WS-TIT-500151.                                                           
240100     02 FILLER                            PIC X(26)                           
240400        VALUE SPACES.                                                         
240700     02 FILLER                            PIC X(13)                           
241000        VALUE "      S 5 0 0".                                                
241300     02 FILLER                            PIC X(24)                           
241600        VALUE   SPACES.                                                       
241900     02 FILLER                            PIC X(13)                           
242200        VALUE "      S 1 5 1".                                                
242500     02 FILLER                            PIC X(30)                           
242800        VALUE   SPACES.                                                       
243100     02 FILLER                            PIC X(11)                           
243400        VALUE "DIFERENCIAS".                                                  
243700                                                                              
244000****************************************************************              
244300* ENCABEZADOS DEL TITULO  DEL NUMERO DE CTOS PARA EL LISTADO                  
244600* ESTADISTICO.                                                                
244900****************************************************************              
245200 01 WS-TIT-CANT.                                                              
245500    02 FILLER                        PIC X(31) VALUE                          
245800       "NUM. DE CTOS. ANTERIORES     :".                                      
246100    02 WS-NUM-CANT                   PIC Z,ZZZ,ZZZ,ZZ9.                       
246400                                                                              
246700****************************************************************              
247000* ENCABEZADO DEL TITULO  DEL NUMERO DE APERTURAS DEL DIA PARA                 
247300* EL LISTADO ESTADISTICO.                                                     
247600****************************************************************              
247900 01 WS-TIT-CAPE .                                                             
248200    02 FILLER                        PIC X(31) VALUE                          
248500       "NUM. DE APERTURAS DEL DIA    :".                                      
248800    02 WS-NUM-CAPE                   PIC Z,ZZZ,ZZZ,ZZ9.                       
249100                                                                              
249400****************************************************************              
249700* ENCABEZADO DEL TITULO  DEL NUMERO DE CANCELACIONES DEL DIA PARA             
250000* EL LISTADO ESTADISTICO.                                                     
250300****************************************************************              
250600 01 WS-TIT-CCAN.                                                              
250900    02 FILLER                        PIC X(31) VALUE                          
251200       "NUM. DE CANCELACIONES DEL DIA :".                                     
251500    02 WS-NUM-CCAN                   PIC Z,ZZZ,ZZZ,ZZ9.                       
251800                                                                              
252100****************************************************************              
252400* ENCABEZADO DEL TITULO  DEL NUMERO DE DEPURACIONES AUTOMATICAS               
252700* PARA EL LISTADO ESTADISTICO.                                                
253000****************************************************************              
253300 01 WS-TIT-DEPU.                                                              
253600    02 FILLER                        PIC X(31) VALUE                          
253900       "DEPURACIONES AUTOMATICAS      :".                                     
254200    02 WS-NUM-DEPU                   PIC Z,ZZZ,ZZZ,ZZ9.                       
254230                                                                              
254240****************************************************************              
254242 01 WS-TIT-DEP-PREALTAS.                                                      
254244    02 FILLER                        PIC X(31) VALUE                          
254246       "DEPURACIONES PREALTAS BD04    :".                                     
254248    02 WS-NUM-PREALTAS               PIC Z,ZZZ,ZZZ,ZZ9.                       
254250                                                                              
254260****************************************************************              
254500                                                                              
254800****************************************************************              
255100* ENCABEZADO DEL TITULO  DEL NUMERO DE CANCELACIONES AUTOMATICAS              
255400* PARA EL LISTADO ESTADISTICO (BAJAS POR NO MOV. EN 3 MESES).                 
255700****************************************************************              
256000 01 WS-TIT-BAAU.                                                              
256300    02 FILLER                        PIC X(31) VALUE                          
256600       "BAJAS AUTOMATICAS             :".                                     
256900    02 WS-NUM-BAAU                   PIC Z,ZZZ,ZZZ,ZZ9.                       
257200                                                                              
257500****************************************************************              
257800* ENCABEZADO PARA EL TITULO  DEL NUMERO DE CONTRATOS ACTUALES                 
258100* PARA EL LISTADO ESTADISTICO.                                                
258400****************************************************************              
258700 01 WS-TIT-CACT.                                                              
259000    02 FILLER                        PIC X(31) VALUE                          
259300       "NUM. DE CONTRATOS ACTUALES    :".                                     
259600    02 WS-NUM-CACT                   PIC Z,ZZZ,ZZZ,ZZ9.                       
259900                                                                              
260200****************************************************************              
260500* TITULO  DEL NUMERO DE CONTRATOS QUE POSEEN SALDO PARA EL                    
260800* LISTADO ESTADISTICO.                                                        
261100****************************************************************              
261400 01 WS-TIT-CSAL.                                                              
261700    02 FILLER                        PIC X(31) VALUE                          
262000       "NUM. DE CONTRATOS C/SALDO > 0 :".                                     
262300    02 WS-NUM-CSAL                   PIC Z,ZZZ,ZZZ,ZZ9.                       
262600                                                                              
262900****************************************************************              
263200* TITULO PARA EL LISTADO DE CONTRATOS CON UN SALDO MAYOR DE                   
263500* 0 PARA EL LISTADO ESTADISTICO.                                              
263800****************************************************************              
264100 01 WS-TIT-SSAL.                                                              
264400    02 FILLER                        PIC X(31) VALUE                          
264700       "NUM. DE CONTRATOS C/SALDO = 0 :".                                     
265000    02 WS-NUM-SSAL                   PIC Z,ZZZ,ZZZ,ZZ9.                       
265300                                                                              
265600****************************************************************              
265900* TITULO PARA EL NUMERO DE CAMBIOS DE PRODUCTO QUE ENTRARON.                  
266200****************************************************************              
266500 01 WS-TIT-EPRD.                                                              
266800    02 FILLER                        PIC X(31) VALUE                          
267100       "NUM. CAMBIOS DE PRD(ENTRADA)  :".                                     
267400    02 WS-NUM-EPRD                   PIC Z,ZZZ,ZZZ,ZZ9.                       
267700                                                                              
268000****************************************************************              
268300* TITULO PARA EL NUMERO DE CAMBIOS DE PRODUCTO QUE SALIERON.                  
268600****************************************************************              
268900 01 WS-TIT-SPRD.                                                              
269200    02 FILLER                        PIC X(31) VALUE                          
269500       "NUM. CAMBIOS DE PRD(SALIDA)   :".                                     
269800    02 WS-NUM-SPRD                   PIC Z,ZZZ,ZZZ,ZZ9.                       
270100                                                                              
270400****************************************************************              
270700* TITULO PARA EL IMPORTE DE APERTURAS DEL DIA.                                
271000****************************************************************              
271300 01 WS-TIT-IAPE.                                                              
271600    02 FILLER                        PIC X(31) VALUE                          
271900       "IMP. DE APERTURAS DEL DIA     :".                                     
272200    02 WS-IMP-IAPE                   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                  
272500                                                                              
272800****************************************************************              
273100* DETALLE PARA LOS MOV TRANSMITIDOS DEL S028.                                 
273400****************************************************************              
273700 01 WS-S028LOC.                                                               
274000     05 FILLER      PIC X(16) VALUE "    LOCAL       ".                       
274300     05 FILLER      PIC X(11) VALUE SPACES.                                   
274600     05 WS-S028LC   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
274900     05 FILLER      PIC X(12) VALUE SPACES.                                   
275200     05 WS-S028LA   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
275500                                                                              
275800****************************************************************              
276100* DETALLE PARA LOS MOV FORANEOS     DEL S028.                                 
276400****************************************************************              
276700 01 WS-S028FOR.                                                               
277000     05 FILLER      PIC X(16) VALUE "    FORANEO     ".                       
277300     05 FILLER      PIC X(11) VALUE SPACES.                                   
277600     05 WS-S028FC   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
277900     05 FILLER      PIC X(12) VALUE SPACES.                                   
278200     05 WS-S028FA   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
278500                                                                              
278800****************************************************************              
279100* DETALLE PARA LOS MOV TRANSMITIDOS DEL S052.                                 
279400****************************************************************              
279700 01 WS-S052LOC.                                                               
280000     05 FILLER      PIC X(16) VALUE "    2101 LOCAL  ".                       
280300     05 FILLER      PIC X(11) VALUE SPACES.                                   
280600     05 WS-S052LC   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
280900     05 FILLER      PIC X(12) VALUE SPACES.                                   
281200     05 WS-S052LA   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
281500                                                                              
281800****************************************************************              
282100* DETALLE PARA LOS MOV FORANEOS     DEL S052.                                 
282400****************************************************************              
282700 01 WS-S052FOR.                                                               
283000     05 FILLER      PIC X(16) VALUE "    2101 FORANEO".                       
283300     05 FILLER      PIC X(11) VALUE SPACES.                                   
283600     05 WS-S052FC   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
283900     05 FILLER      PIC X(12) VALUE SPACES.                                   
284200     05 WS-S052FA   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
284500                                                                              
284800****************************************************************              
285100* DETALLE DE EL LISTADO DE TOTALES POR CLAVE.                                 
285400****************************************************************              
285700 01  WS-DET-CVE.                                                              
286000     05 FILLER                         PIC X(02) VALUE SPACES.                
286010     05 WS-CVE-IDDLS                   PIC X.                                 
286300     05 WS-CVE-CVE                     PIC 9(4).                              
286600     05 FILLER                         PIC X(15) VALUE SPACES.                
286900     05 WS-CVE-IMP1                    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
287200     05 FILLER                         PIC X(02) VALUE SPACES.                
287500     05 WS-CVE-NUM1                    PIC ZZ,ZZZ,ZZ9.                        
287800     05 FILLER                         PIC X(02) VALUE SPACES.                
288100     05 WS-CVE-IMP2                    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
288400     05 FILLER                         PIC X(02) VALUE SPACES.                
288700     05 WS-CVE-NUM2                    PIC ZZ,ZZZ,ZZ9.                        
289000     05 FILLER                         PIC X(02) VALUE SPACES.                
289300     05 WS-CVE-IMP3                    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
289600     05 FILLER                         PIC X(02) VALUE SPACES.                
289900     05 WS-CVE-NUM3                    PIC ZZ,ZZZ,ZZ9.                        
290200                                                                              
290500****************************************************************              
290800* DETALLE PARA LOS CARGOS DE  CIFRAS DE CONTROL.                              
291100****************************************************************              
291400 01  WS-C500-151       .                                                      
291700     05 FILLER                         PIC X(15)                              
292000        VALUE    "    CARGOS     ".                                           
292300     05 FILLER                         PIC X(2)                               
292600        VALUE SPACES.                                                         
292900     05 WS-C500-NUM1                   PIC ZZZ,ZZ9.                           
293200     05 FILLER                         PIC X(3)                               
293500        VALUE SPACES.                                                         
293800     05 WS-C500-IMP1                   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
294100     05 FILLER                         PIC X(2)                               
294400        VALUE SPACES.                                                         
294700     05 WS-COTRO-NUM1                  PIC ZZZ,ZZ9.                           
295000     05 FILLER                         PIC X(3)                               
295300        VALUE SPACES.                                                         
295600     05 WS-COTRO-IMP1                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
295900     05 FILLER                         PIC X(30)                              
296200        VALUE SPACES.                                                         
296500     05 WS-CDIF-NUM1                   PIC ZZZ,ZZ9.                           
296800     05 FILLER                         PIC X(2)                               
297100        VALUE SPACES.                                                         
297400     05 WS-CDIF-IMP1                   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
297700                                                                              
298000****************************************************************              
298300* DETALLE PARA LOS CARGOS AUTOMATICOS DE  CIFRAS DE CONTROL.                  
298600****************************************************************              
298900 01  WS-C500-151A      .                                                      
299200     05 FILLER                         PIC X(15)                              
299500        VALUE    "    CARGOS AUT.".                                           
299800     05 FILLER                         PIC X(2)                               
300100        VALUE SPACES.                                                         
300400     05 WS-C500-NUM1A                  PIC ZZZ,ZZ9.                           
300700     05 FILLER                         PIC X(3)                               
301000        VALUE SPACES.                                                         
301300     05 WS-C500-IMP1A                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
301600     05 FILLER                         PIC X(2)                               
301900        VALUE SPACES.                                                         
302200     05 WS-COTRO-NUM1A                 PIC ZZZ,ZZ9.                           
302500     05 FILLER                         PIC X(3)                               
302800        VALUE SPACES.                                                         
303100     05 WS-COTRO-IMP1A                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
303400     05 FILLER                         PIC X(30)                              
303700        VALUE SPACES.                                                         
304000     05 WS-CDIF-NUM1A                  PIC ZZZ,ZZ9.                           
304300     05 FILLER                         PIC X(2)                               
304600        VALUE SPACES.                                                         
304900     05 WS-CDIF-IMP1A                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
305200                                                                              
305500****************************************************************              
305800* ENCABEZADO PARA EL DETALLE DE TOTAL DE ABONOS DE CIFRAS DE CTRL.            
306100****************************************************************              
306400 01  WS-A500-151.                                                             
306700     05 FILLER                         PIC X(15)                              
307000        VALUE    "    ABONOS     ".                                           
307300     05 FILLER                         PIC X(2)                               
307600        VALUE SPACES.                                                         
307900     05 WS-A500-NUM1                   PIC ZZZ,ZZ9.                           
308200     05 FILLER                         PIC X(3)                               
308500        VALUE SPACES.                                                         
308800     05 WS-A500-IMP1                   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
309100     05 FILLER                         PIC X(2)                               
309400        VALUE SPACES.                                                         
309700     05 WS-AOTRO-NUM1                  PIC ZZZ,ZZ9.                           
310000     05 FILLER                         PIC X(3)                               
310300        VALUE SPACES.                                                         
310600     05 WS-AOTRO-IMP1                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
310900     05 FILLER                         PIC X(30)                              
311200        VALUE SPACES.                                                         
311500     05 WS-ADIF-NUM1                   PIC ZZZ,ZZ9.                           
311800     05 FILLER                         PIC X(2)                               
312100        VALUE SPACES.                                                         
312400     05 WS-ADIF-IMP1                   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
312700                                                                              
313000****************************************************************              
313300* ENCABEZADO PARA EL DETALLE DE TOTAL DE ABONOS AUT. CIF.DE CTRL.             
313600****************************************************************              
313900 01  WS-A500-151A.                                                            
314200     05 FILLER                         PIC X(15)                              
314500        VALUE    "    ABONOS AUT.".                                           
314800     05 FILLER                         PIC X(2)                               
315100        VALUE SPACES.                                                         
315400     05 WS-A500-NUM1A                  PIC ZZZ,ZZ9.                           
315700     05 FILLER                         PIC X(3)                               
316000        VALUE SPACES.                                                         
316300     05 WS-A500-IMP1A                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
316600     05 FILLER                         PIC X(2)                               
316900        VALUE SPACES.                                                         
317200     05 WS-AOTRO-NUM1A                 PIC ZZZ,ZZ9.                           
317500     05 FILLER                         PIC X(3)                               
317800        VALUE SPACES.                                                         
318100     05 WS-AOTRO-IMP1A                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
318400     05 FILLER                         PIC X(30)                              
318700        VALUE SPACES.                                                         
319000     05 WS-ADIF-NUM1A                  PIC ZZZ,ZZ9.                           
319300     05 FILLER                         PIC X(2)                               
319600        VALUE SPACES.                                                         
319900     05 WS-ADIF-IMP1A                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
320200                                                                              
320500****************************************************************              
320800* ENCABEZADOS PARA EL TOTAL DE CVES NO CONTABLES DE TOTALES/CVE.              
321100****************************************************************              
321400 01 WS-DET-NCOCVE.                                                            
321700    02 FILLER          PIC X(20) VALUE "TOTAL DE NO CONTABLE".                
322000    02 FILLER          PIC X(02) VALUE SPACES.                                
322300    02 WS-TOTINC-500   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
322600    02 FILLER          PIC X(02) VALUE SPACES.                                
322900    02 WS-TOTNNC-500   PIC ZZ,ZZZ,ZZ9.                                        
323200    02 FILLER          PIC X(02) VALUE SPACES.                                
323500    02 WS-TOTINC-OTRO  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
323800    02 FILLER          PIC X(02) VALUE SPACES.                                
324100    02 WS-TOTNNC-OTRO  PIC ZZ,ZZZ,ZZ9.                                        
324400    02 FILLER          PIC X(02) VALUE SPACES.                                
324700    02 WS-TOTINC-DIF   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
325000    02 FILLER          PIC X(02) VALUE SPACES.                                
325300    02 WS-TOTNNC-DIF   PIC ZZ,ZZZ,ZZ9.                                        
325600                                                                              
325900******************************************************************            
326200* CAMPOS UTILIZADOS PARA EL DETALLE DEL IMPUESTO DE ENTRADA                   
326500******************************************************************            
326800 01  WS-IMP-ENT.                                                              
327100     05 FILLER                PIC X(15)                                       
327400                              VALUE    "    IMP.ENTRADA".                     
327700     05 FILLER                PIC X(02) VALUE SPACES.                         
328000     05 WS-IMP-ENTNUM         PIC ZZZ,ZZ9.                                    
328300     05 FILLER                PIC X(03) VALUE SPACES.                         
328600     05 WS-IMP-ENTIMP         PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
328900                                                                              
329200******************************************************************            
329500* CAMPOS UTILIZADOS PARA EL DETALLE DE LAS COMISIONES.                        
329800******************************************************************            
330100 01 WS-COMISIONES.                                                            
330400     05 FILLER                PIC X(15) VALUE "    COMISIONES ".              
330700     05 FILLER                PIC X(12) VALUE SPACES.                         
331000     05 WS-COMS1-IMPC         PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
331010     05 FILLER                PIC X(12) VALUE SPACES.                         
331020     05 WS-COMS1-IMPA         PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
331300                                                                              
331600******************************************************************            
331900* CAMPOS UTILIZADOS PARA EL DETALLE DE LOS INTERESES.                         
332200******************************************************************            
332500 01 WS-INTERESES.                                                             
332800     05 FILLER                PIC X(15) VALUE "    INTERESES  ".              
333100     05 FILLER                PIC X(12) VALUE SPACES.                         
333400     05 WS-INTS1-IMP          PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
333700                                                                              
334000******************************************************************            
334300* CAMPOS UTILIZADOS PARA EL DETALLE DEL IMPUESTO DE SALIDA                    
334600******************************************************************            
334900 01  WS-IMP-SAL.                                                              
335200     05 FILLER                         PIC X(15)                              
335500        VALUE    "    IMP.SALIDA ".                                           
335800     05 FILLER                         PIC X(02) VALUE SPACES.                
336100     05 WS-IMP-SALNUM                  PIC ZZZ,ZZ9.                           
336400     05 FILLER                         PIC X(03) VALUE SPACES.                
336700     05 WS-IMP-SALIMP                  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
337000                                                                              
337300******************************************************************            
337600* CAMPOS UTILIZADOS PARA EL DETALLE DEL S.B.C. CON CAMBIO DE PRD.             
337900******************************************************************            
338200 01  WS-DET-SBCCC.                                                            
338500     05 FILLER                PIC X(15)                                       
338800                              VALUE    "    SBC. C/CPRD".                     
339100     05 FILLER                PIC X(12) VALUE SPACES.                         
339400     05 WS-IMP-SBCCC1         PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
339700                                                                              
339705******************************************************************            
339710* CAMPOS UTILIZADOS PARA EL DET. DEL SBC.T+6 EN LAS ENTRADAS.                 
339715******************************************************************            
339720 01  WS-DET-SBC6E.                                                            
339725     05 FILLER                PIC X(13)                                       
339730         VALUE                "    ENTRADAS ".                                
339735     05 FILLER                PIC X(14) VALUE SPACES.                         
339740     05 WS-IMP-SBC6E1         PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
339745                                                                              
339750******************************************************************            
339755* CAMPOS UTILIZADOS PARA EL DET. DEL SBC. T+6 EN LAS SALIDAS.                 
339760******************************************************************            
339765 01  WS-DET-SBC6S.                                                            
339770     05 FILLER                PIC X(13)                                       
339775                VALUE    "    SALIDAS  ".                                     
339780     05 FILLER                PIC X(14) VALUE SPACES.                         
339785     05 WS-IMP-SBC6S1        PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                          
339790                                                                              
340000******************************************************************            
340300* CAMPOS UTILIZADOS PARA EL DETALLE DE TRASPASOS A CUENTA GLOBAL.             
340600******************************************************************            
340900  01 WS-TRAS-CTAGLOBAL.                                                       
340950      05 FILLER                PIC X(26) VALUE                                
341000                               "    TRSP CTA GLOBAL 231577".                  
341050      05 FILLER                PIC X(01) VALUE SPACES.                        
341200      05 WLI-CGO-CTAGLOB       PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                        
341250      05 FILLER                PIC X(12) VALUE SPACES.                        
341300      05 WLI-ABO-CTAGLOB       PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                        
341350                                                                              
341500*****************************************************************             
341600* CAMPOS UTILIZADOS PARA EL DETALLE DE TRASPASOS A CUENTA BENEF.              
341700*****************************************************************             
341800 01 WS-TRAS-CTABENEF.                                                         
341820     05 FILLER                PIC X(26) VALUE                                 
341840                              "    TRSP CTA BENEF  150312".                   
341860     05 FILLER                PIC X(01) VALUE SPACES.                         
341880     05 WLI-CGO-CTABENEF      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
341900     05 FILLER                PIC X(12) VALUE SPACES.                         
341920     05 WLI-ABO-CTABENEF      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
342100                                                                              
342400******************************************************************            
342700* CAMPOS UTILIZADOS PARA EL DETALLE DE FIDEICOMISO DE SALIDA.                 
343000******************************************************************            
343300 01 WS-FIDE-SALIDA.                                                           
343600     05 FILLER                PIC X(15) VALUE "    SALIDA     ".              
343900     05 FILLER                PIC X(12) VALUE SPACES.                         
344200     05 WS-FIDE-IMPSAL        PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                         
344500                                                                              
344800****************************************************************              
345100* ENCABEZADOS PARA EL TOTAL DE ABONOS DE TOTALES/CVE.                         
345400****************************************************************              
345700 01 WS-DET-ABOCVE.                                                            
346000    02 FILLER          PIC X(20) VALUE "TOTAL DE ABONOS     ".                
346300    02 FILLER          PIC X(02) VALUE SPACES.                                
346600    02 WS-TOTIA-500    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
346900    02 FILLER          PIC X(02) VALUE SPACES.                                
347200    02 WS-TOTNA-500    PIC ZZ,ZZZ,ZZ9.                                        
347500    02 FILLER          PIC X(02) VALUE SPACES.                                
347800    02 WS-TOTIA-OTRO   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
348100    02 FILLER          PIC X(02) VALUE SPACES.                                
348400    02 WS-TOTNA-OTRO   PIC ZZ,ZZZ,ZZ9.                                        
348700    02 FILLER          PIC X(02) VALUE SPACES.                                
349000    02 WS-TOTIA-DIF    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
349300    02 FILLER          PIC X(02) VALUE SPACES.                                
349600    02 WS-TOTNA-DIF    PIC ZZ,ZZZ,ZZ9.                                        
349900                                                                              
350200****************************************************************              
350500* ENCABEZADOS PARA EL TOTAL DE ABONOS DE TOTALES/CVE.                         
350800****************************************************************              
351100 01 WS-DET-CARCVE.                                                            
351400    02 FILLER          PIC X(20) VALUE "TOTAL DE CARGOS     ".                
351700    02 FILLER          PIC X(02) VALUE SPACES.                                
352000    02 WS-TOTIC-500    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
352300    02 FILLER          PIC X(02) VALUE SPACES.                                
352600    02 WS-TOTNC-500    PIC ZZ,ZZZ,ZZ9.                                        
352900    02 FILLER          PIC X(02) VALUE SPACES.                                
353200    02 WS-TOTIC-OTRO   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
353500    02 FILLER          PIC X(02) VALUE SPACES.                                
353800    02 WS-TOTNC-OTRO   PIC ZZ,ZZZ,ZZ9.                                        
354100    02 FILLER          PIC X(02) VALUE SPACES.                                
354400    02 WS-TOTIC-DIF    PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
354700    02 FILLER          PIC X(02) VALUE SPACES.                                
355000    02 WS-TOTNC-DIF    PIC ZZ,ZZZ,ZZ9.                                        
355300                                                                              
355600****************************************************************              
355900* ENCABEZADOS PARA EL TOTAL DE ABONOS AUT. DE TOTALES/CVE.                    
356200****************************************************************              
356500 01 WS-DET-ABOCVEA.                                                           
356800    02 FILLER          PIC X(20) VALUE "TOTAL DE ABONOS AUT.".                
357100    02 FILLER          PIC X(02) VALUE SPACES.                                
357400    02 WS-TOTIAA-500   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
357700    02 FILLER          PIC X(02) VALUE SPACES.                                
358000    02 WS-TOTNAA-500   PIC ZZ,ZZZ,ZZ9.                                        
358300    02 FILLER          PIC X(02) VALUE SPACES.                                
358600    02 WS-TOTIAA-OTRO  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
358900    02 FILLER          PIC X(02) VALUE SPACES.                                
359200    02 WS-TOTNAA-OTRO  PIC ZZ,ZZZ,ZZ9.                                        
359500    02 FILLER          PIC X(02) VALUE SPACES.                                
359800    02 WS-TOTIAA-DIF   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
360100    02 FILLER          PIC X(02) VALUE SPACES.                                
360400    02 WS-TOTNAA-DIF   PIC ZZ,ZZZ,ZZ9.                                        
360700                                                                              
361000****************************************************************              
361300* ENCABEZADOS PARA EL TOTAL DE ABONOS AUT. DE TOTALES/CVE.                    
361600****************************************************************              
361900 01 WS-DET-CARCVEA.                                                           
362200    02 FILLER          PIC X(20) VALUE "TOTAL DE CARGOS AUT.".                
362500    02 FILLER          PIC X(02) VALUE SPACES.                                
362800    02 WS-TOTICA-500   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
363100    02 FILLER          PIC X(02) VALUE SPACES.                                
363400    02 WS-TOTNCA-500   PIC ZZ,ZZZ,ZZ9.                                        
363700    02 FILLER          PIC X(02) VALUE SPACES.                                
364000    02 WS-TOTICA-OTRO  PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
364300    02 FILLER          PIC X(02) VALUE SPACES.                                
364600    02 WS-TOTNCA-OTRO  PIC ZZ,ZZZ,ZZ9.                                        
364900    02 FILLER          PIC X(02) VALUE SPACES.                                
365200    02 WS-TOTICA-DIF   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                                
365500    02 FILLER          PIC X(02) VALUE SPACES.                                
365800    02 WS-TOTNCA-DIF   PIC ZZ,ZZZ,ZZ9.                                        
366100                                                                              
366400****************************************************************              
366700* TITULO PARA IMPRIMIR EL SALDO ACT. DEL LISTADO DE POSICION.                 
367000****************************************************************              
367300 01  WS-POS-SDOACT.                                                           
367600   02 FILLER     PIC X(16)  VALUE "  SALDO ACTUAL  ".                         
367900   02 FILLER     PIC X(04) VALUE SPACES.                                      
368200   02 WS-SDO-ACT PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
368500                                                                              
368800****************************************************************              
369100* TITULO PARA IMPRIMIR EL SALDO ANT. DEL LISTADO DE POSICION.                 
369400****************************************************************              
369700 01  WS-POS-SDOANT.                                                           
370000   02 FILLER     PIC X(16)  VALUE "  SALDO ANTERIOR".                         
370300   02 FILLER     PIC X(04) VALUE SPACES.                                      
370600   02 WS-SDO-ANT PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
370900                                                                              
370905****************************************************************              
370910* TITULO PARA IMPRIMIR EL SALDO ACT. DEL LISTADO DE POSICION.T+6              
370915****************************************************************              
370920 01  WS-T6-SDOACT.                                                            
370925   02 FILLER     PIC X(16)  VALUE "  SALDO ACTUAL  ".                         
370930   02 FILLER     PIC X(04) VALUE SPACES.                                      
370935   02 WS-SACT-T6 PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
370940                                                                              
370945****************************************************************              
370950* TITULO PARA IMPRIMIR EL SALDO ANT. DEL LISTADO DE POSICION.T+6              
370955****************************************************************              
370960 01  WS-T6-SDOANT.                                                            
370965   02 FILLER     PIC X(16)  VALUE "  SALDO ANTERIOR".                         
370970   02 FILLER     PIC X(04) VALUE SPACES.                                      
370975   02 WS-SANT-T6 PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                                   
370980                                                                              
371200****************************************************************              
371500* TITULO PARA IMPRIMIR LA POSICION.                                           
371800****************************************************************              
372100 01 WS-POS-LIN.                                                               
372400   02 FILLER                           PIC X(39) VALUE SPACES.                
372700   02 WS-POS-LNSAL                     PIC ZZ,ZZZ,ZZ9.                        
373000   02 FILLER                           PIC X(10)                              
373300        VALUE SPACES.                                                         
373600   02 WS-POS-LISAL                     PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.               
373900   02 FILLER                           PIC X(2)                               
374200        VALUE SPACES.                                                         
374500   02 WS-POS-LNENT                     PIC ZZ,ZZZ,ZZ9.                        
374800   02 FILLER                           PIC X(9)                               
375100        VALUE SPACES.                                                         
375400   02 WS-POS-LIENT                     PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.               
375700                                                                              
375705****************************************************************              
375710* TITULO PARA IMPRIMIR LA POSICION DE 2311 DEL SBC.                           
375715****************************************************************              
375717 01 WS-CAAB-T6.                                                               
375720   02 FILLER                          PIC X(59) VALUE SPACES.                 
375730   02 WS-T6-SAL                       PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                
375735   02 FILLER                          PIC X(21) VALUE SPACES.                 
375745   02 WS-T6-ENT                       PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                
375750                                                                              
376000****************************************************************              
376300*           P R O C E D U R E          D I V I S I O N.                       
376600****************************************************************              
376900 PROCEDURE DIVISION.                                                          
377200********************                                                          
377500                                                                              
377800****************************************************************              
378100****************************************************************              
378400*                                                                             
378700*           R U T I N A    P R I N C I P A L.                                 
379000*                                                                             
379300****************************************************************              
379600****************************************************************              
379900                                                                              
380200 00000000-INICIO SECTION.                                                     
380500 00000000-PRINCIPAL.                                                          
380520     MOVE 2           TO W77-USO-LIBLJ                                        
380540     MOVE "S500P170"  TO W77-S000-MY-ID.                                      
380560     MOVE "25MTP004"  TO W77-S000-MY-VERSION.                                 
380580     MOVE "P170"      TO WS-0101-PASO-MSG B91-IDPROG.                         
380600     MOVE "25MTP004"  TO WS-0101-MTP-MSG.                                     
380620                                                                              
380800   PERFORM 10000000-LIBRERIAS          THRU 10000000-EXIT.                    
381100   PERFORM 20000000-OPEN               THRU 20000000-EXIT.                    
381400   PERFORM 50000000-PROCESOS           THRU 50000000-EXIT.                    
381700   PERFORM 70000000-CIERRO             THRU 70000000-EXIT.                    
382000   STOP RUN.                                                                  
382300                                                                              
382600                                                                              
382900                                                                              
383200                                                                              
383500****************************************************************              
383800****************************************************************              
384100*                                                                             
384400*     R U T I N A   D E    L L A M A D O   A   L A S                          
384700*  L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S                
385000*               P O R   E L   P R O G R A M A.                                
385300*                                                                             
385600****************************************************************              
385900****************************************************************              
386200                                                                              
386500 10000000-LIBRERIAS.                                                          
386800                                                                              
387100****************************************************************              
387400* CHANGE A LA LIBRARIA DE VERSIONES.                                          
387700****************************************************************              
388000    PERFORM 10000100-VERSIONES.                                               
388300****************************************************************              
388600* CHANGE A LA LIBRERIA DEL S151 "CONSULTOT" PARA OBTENER LA                   
388900* CONSULTA DE TOTALES DE LOS MOV. OPERADOS EN BATCH.                          
389200****************************************************************              
389500    PERFORM 10000151-TOTXCVE.                                                 
389800                                                                              
390100****************************************************************              
390400* CHANGE A LA LIBRERIA DEL S151 "FINBATCH" PARA INDICARLE A                   
390700* ESTE QUE EL PROCESO BATCH DEL S500 HA FINALIZADO.                           
391000****************************************************************              
391300    PERFORM 10000151-REGISTRA.                                                
393400                                                                              
393700****************************************************************              
394000* CHANGE A LA LIBRERIA DEL S408 "LINCRED" PARA OBTENER LA                     
394300* CONSULTA DE TOTALES QUE EL S500 ENVIO AL S408.                              
394600****************************************************************              
394900     PERFORM 10000408-LINCRED.                                                
395200 10000000-EXIT.                                                               
395500    EXIT.                                                                     
395800                                                                              
396100                                                                              
396400                                                                              
396700                                                                              
397000*****************************************************************             
397300*****************************************************************             
397600*                                                                             
397900*                         O P E N.                                            
398200*      R U T I N A S    P A R A   A P E R T U R A   D E                       
398500*                B A S E   Y   A R C H I V O S.                               
398800                                                                              
399100*                                                                             
399400*****************************************************************             
399700                                                                              
400000 20000000-OPEN.                                                               
401200                                                                              
401500     PERFORM 20000010-CHECO-VER    THRU 20000010-EXIT.                        
401510     PERFORM 20000015-TRANSIT      THRU 20000015-EXIT.                        
401800     PERFORM 20000050-CALL151-0    THRU 20000050-EXIT.                        
402100     PERFORM 20000100-ABRO-BASE    THRU 20000100-EXIT.                        
402110     PERFORM 20000150-VAL-PASO     THRU 20000150-EXIT.                        
402400     PERFORM 20000200-FECHA-PRO    THRU 20000200-EXIT.                        
403000     PERFORM 20000400-HORA         THRU 20000400-EXIT.                        
403300     PERFORM 20000500-FECHA-DIA    THRU 20000500-EXIT.                        
403400     PERFORM 20000600-CARGO-B17    THRU 20000600-EXIT.                        
403900     PERFORM 20000700-OPEN-ARC     THRU 20000700-EXIT.                        
404200 20000000-EXIT.                                                               
404500    EXIT.                                                                     
404800                                                                              
405100******************************************************************            
405400* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
405700******************************************************************            
406000 20000010-CHECO-VER.                                                          
406300     PERFORM 20000100-CHECAME-VERSION.                                        
406600     IF S000-CTR-CVEERROR < 0                                                 
407500        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
407800        PERFORM 70000050-MENSAJE                                              
408100        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
408400 20000010-EXIT.                                                               
408700    EXIT.                                                                     
409000                                                                              
409010******************************************************************            
409015* LLAMADOS NECESARIOS PARA EL MANEJO DE TRANSIT POR PARTE DEL 408.            
409020******************************************************************            
409025 20000015-TRANSIT.                                                            
409030     PERFORM 0000-CHANGE-XATMI.                                               
409033     MOVE "S500P170"                TO WS-XATMI-PROG-NAME                     
409035     PERFORM 0000-CALL-TRANSIT.                                               
409040     IF WS-XATMI-RSLT = 0                                                     
409045        NEXT SENTENCE                                                         
409050     ELSE                                                                     
409055        MOVE WS-XATMI-RSLT           TO WS-RSLT-TRANSIT                       
409070        STRING "ERROR EN TP_IDENTIFY ", WS-RSLT-TRANSIT                       
409075        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
409080        PERFORM 70000050-MENSAJE                                              
409085        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
409090 20000015-EXIT.                                                               
409095    EXIT.                                                                     
409100                                                                              
409300******************************************************************            
409600* REALIZO EL PRIMER CALL AL S151 CON FUNCION 0.                               
409900******************************************************************            
410200 20000050-CALL151-0.                                                          
410500      MOVE 0            TO WS-CICLO1.                                         
410800      PERFORM 20000054-CON-0  THRU 20000054-EXIT UNTIL                        
411100      WS-CICLO1 = 1.                                                          
411400 20000050-EXIT.                                                               
411700    EXIT.                                                                     
412000******************************************************************            
412300* REALIZO EL LLAMADO CON FUNCION 0 HASTA QUE SEA CORRECTO.                    
412600******************************************************************            
412900 20000054-CON-0.                                                              
413200      MOVE 0            TO WS-CICLO2.                                         
413500      MOVE 0            TO WS-S151-0301-RESULT                                
413800      MOVE 0            TO WS-S151-0301-FUNCION.                              
414100      PERFORM 40000100-CALL-S151 THRU 40000100-EXIT.                          
414400 20000054-EXIT.                                                               
414700    EXIT.                                                                     
415000                                                                              
415300******************************************************************            
415600* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
415900******************************************************************            
416200 20000100-ABRO-BASE.                                                          
416500     OPEN UPDATE S500BD01CAPTACION                                            
416800     ON EXCEPTION                                                             
417700        MOVE "ERROR AL ABRIR LA BASE " TO WS-0101-TEXT-MSG                    
418000        PERFORM 70000050-MENSAJE                                              
418300        CALL SYSTEM DMTERMINATE.                                              
418600                                                                              
418620    SET S500B00CTRLPASO       TO BEGINNING.                                   
418900    SET S500B02CONTROL        TO BEGINNING.                                   
419200    SET S500B05INSTRUMEN      TO BEGINNING.                                   
419500    SET S500B09CIFRAS         TO BEGINNING.                                   
419800    SET S500B14TOTCVES        TO BEGINNING.                                   
419850    SET S500B17CVESXFUN       TO BEGINNING.                                   
420100 20000100-EXIT.                                                               
420400    EXIT.                                                                     
420700                                                                              
420705******************************************************************            
420710* VALIDO EL PASO DE B00 PARA VERIFICAR LA SECUENCIA DE LOS PROC.              
420715* LA BASE DEBE SER SALIDA DEL PASO 160.                                       
420720******************************************************************            
420725 20000150-VAL-PASO.                                                           
420730   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
420735   IF WS-STATUS-BASE > 0                                                      
420740     IF WS-STATUS-BASE = 1                                                    
420755       STRING "ERROR B00CTRLPASO VACIO " WS-STATUS-BASE                       
420757       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
420760       PERFORM 70000050-MENSAJE                                               
420765       CALL SYSTEM DMTERMINATE                                                
420770     ELSE                                                                     
420785       STRING "ERROR AL HACER LOCK A B00CTRLPASO " ,WS-STATUS-BASE            
420790       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
420795       PERFORM 70000050-MENSAJE                                               
420800       CALL SYSTEM DMTERMINATE.                                               
420805                                                                              
420810   IF B00-NUM-PASO-01 = 160 AND B00-NUM-PASO-02 = 160                         
420812      AND B00-NUM-PASO-03 = 160                                               
420815      MOVE 0  TO                B00-NUM-PASO-01 B00-NUM-PASO-02               
420818                                B00-NUM-PASO-03                               
420820   ELSE                                                                       
420835      MOVE "ERROR BASE NO ES SALIDA DEL P160" TO WS-0101-TEXT-MSG             
420840      PERFORM 70000050-MENSAJE                                                
420845      CALL SYSTEM DMTERMINATE.                                                
420850                                                                              
420855   PERFORM 90000000-BEGIN-TRANSACTION.                                        
420860   PERFORM 90000000-B00CTRLPASO-STORE.                                        
420865   PERFORM 90000000-END-TRANSACTIONSYNC.                                      
420870 20000150-EXIT.                                                               
420875    EXIT.                                                                     
420880                                                                              
421000******************************************************************            
421300* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
421600******************************************************************            
421900 20000200-FECHA-PRO.                                                          
422200     PERFORM 90000002-B02CONTROL-FIND                                         
422500   IF WS-STATUS-BASE > 0                                                      
422800    IF WS-STATUS-BASE = 1                                                     
423700       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
424000       PERFORM 70000050-MENSAJE                                               
424300       CALL SYSTEM DMTERMINATE                                                
424600    ELSE                                                                      
425500       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
425800       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
426100       PERFORM 70000050-MENSAJE                                               
426400       CALL SYSTEM DMTERMINATE.                                               
426700                                                                              
427000     MOVE 0              TO WS-CVE-SUBNODO  WS-CIF-SUBNODO                    
427300                            WS-POS-SUBNODO  WS-ESTA-SUBNODO.                  
428800                                                                              
429100     MOVE B02-FECHA-LOTE TO WS-FECHA-PRO    WS-CIF-FECHA                      
429400                            WS-CVE-FECHA    WS-POS-FECHA                      
429700                            WS-ESTA-FECHA   WS-CVE-FEC                        
429800                            W-ETIQ-INCIDEN-FEC WKS-I06-01-FECHA.              
430000     MOVE B02-NUM-CSI    TO WS-CVE-CI       WS-CIF-CI  WS-CSI                 
430300                            WS-CVE-CSIO     WS-CVE-CSID                       
430600                            WS-POS-CI       WS-ESTA-CI                        
430700                            W-ETIQ-INCIDEN-CSI WKS-I06-01-CSI.                
430900     MOVE WS-PRO-DD      TO WS-ESTA-DIA1    WS-CVE-DIA1                       
431200                            WS-DIF-DIA1     WS-POS-DIA1.                      
431500     MOVE WS-PRO-MM      TO WS-ESTA-MES1    WS-CVE-MES1                       
431800                            WS-DIF-MES1     WS-POS-MES1.                      
432100     MOVE WS-PRO-AA      TO WS-ESTA-ANO1    WS-CVE-ANO1                       
432400                            WS-DIF-ANO1     WS-POS-ANO1.                      
432700 20000200-EXIT.                                                               
433000    EXIT.                                                                     
433300                                                                              
437800******************************************************************            
438100* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
438400******************************************************************            
438700 20000400-HORA.                                                               
439000        ACCEPT  WS-HORA-HMSC-N    FROM TIME.                                  
439300        MOVE WS-HORA-HH-N     TO  WS-IMP-HH                                   
439600        MOVE WS-HORA-MM-N     TO  WS-IMP-MM                                   
439900        MOVE WS-HORA-SS-N     TO  WS-IMP-SS.                                  
439910        MOVE WS-CSI           TO  WS-IMP-CSI.                                 
440200 20000400-EXIT.                                                               
440500    EXIT.                                                                     
440800                                                                              
441100******************************************************************            
441400* OBTENGO LA FECHA DEL LA MAQUINA PARA LA GENERACION DE REPORTES.             
441700******************************************************************            
442000 20000500-FECHA-DIA.                                                          
442300        PERFORM 90000000-DAME-FEC-MAQUINA.                                    
442600        MOVE WKS-DD-MAQ           TO    WS-DIA-DD.                            
442900        MOVE WKS-MM-MAQ           TO    WS-DIA-MM.                            
443200        MOVE WKS-AAAA-MAQ         TO    WS-DIA-AA.                            
443210                                                                              
445000        MOVE WS-DIA-DD            TO    WS-ESTA-DIA   WS-CVE-DIA              
445300                                        WS-DIF-DIA    WS-POS-DIA.             
445600        MOVE WS-DIA-MM            TO    WS-ESTA-MES   WS-CVE-MES              
445900                                        WS-DIF-MES    WS-POS-MES.             
446200        MOVE WS-DIA-AA            TO    WS-ESTA-ANO   WS-CVE-ANO              
446500                                        WS-DIF-ANO    WS-POS-ANO.             
446800 20000500-EXIT.                                                               
447100    EXIT.                                                                     
447200*****************************************************************             
447210 20000600-CARGO-B17.                                                          
447220     PERFORM 20000605-LEO-B17 THRU 20000605-EXIT                              
447230             UNTIL WS-B17-FIN = 1.                                            
447240                                                                              
447250     SET S500B17CVESXFUN       TO BEGINNING.                                  
447260 20000600-EXIT.                                                               
447270     EXIT.                                                                    
447300*****************************************************************             
447400  20000605-LEO-B17.                                                           
447450      PERFORM 90000017-B17CVESXFUN-FINDN.                                     
447500      IF WS-STATUS-BASE > 0                                                   
447550         IF WS-STATUS-BASE = 1                                                
447600            MOVE 1 TO WS-B17-FIN                                              
447650         ELSE                                                                 
447700            STRING "ERROR FINDN A B17 ",WS-STATUS-BASE                        
447750                    DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                   
447800         PERFORM 70000050-MENSAJE                                             
447850         CALL SYSTEM DMTERMINATE.                                             
447900                                                                              
447950      IF WS-B17-FIN = 0                                                       
448000         MOVE B17-CLAVE-TRANS  TO WS-CVE-B17                                  
448050         IF WS-CVE-B17 > 0 AND < 9999                                         
448100            MOVE B17-IND-ACUM-VAL                                             
448150              TO WS-B17-IND-ACUM-VAL(WS-CVE-B17).                             
448200                                                                              
448250  20000605-EXIT.                                                              
448300      EXIT.                                                                   
448350*****************************************************************             
454300******************************************************************            
454600* ABRO LOS ARCHIVOS DE IMPRESION.                                             
454900******************************************************************            
455200 20000700-OPEN-ARC.                                                           
455500       OPEN OUTPUT TOTCVE.                                                    
455800                                                                              
456100       MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WS-CIF-MIX.                     
456400       SET FILE-CIFRAS(USERBACKUPNAME)    TO VALUE TRUE                       
456700       CHANGE ATTRIBUTE TITLE OF FILE-CIFRAS TO WS-ETIQ-CIF.                  
457000       OPEN OUTPUT FILE-CIFRAS.                                               
457300                                                                              
457600       MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-CVE-MIX.                      
457900       SET FILE-CLAVES(USERBACKUPNAME)    TO VALUE TRUE                       
458200       CHANGE ATTRIBUTE TITLE OF FILE-CLAVES TO WS-ETIQ-CVE.                  
458500       OPEN OUTPUT FILE-CLAVES.                                               
458800                                                                              
459100       MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-POS-MIX.                      
459400       SET FILE-POSICION(USERBACKUPNAME) TO VALUE TRUE                        
459700       CHANGE ATTRIBUTE TITLE OF FILE-POSICION TO WS-ETIQ-POS.                
460000       OPEN OUTPUT FILE-POSICION.                                             
460300                                                                              
460600       MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-ESTA-MIX.                     
460900       SET ESTADISTICAS(USERBACKUPNAME) TO VALUE TRUE                         
461200       CHANGE ATTRIBUTE TITLE OF ESTADISTICAS TO WS-ETIQ-ESTA.                
461500       OPEN OUTPUT ESTADISTICAS.                                              
461520                                                                              
461540       SET ARCH-INCIDENTE (TITLE)   TO WS-ETIQ-INCIDENTE.                     
461560       IF ATTRIBUTE RESIDENT OF ARCH-INCIDENTE IS = VALUE TRUE                
461580          OPEN EXTEND ARCH-INCIDENTE                                          
461600       ELSE                                                                   
461620          OPEN OUTPUT ARCH-INCIDENTE.                                         
461640       WRITE REG-INCIDENTE FROM WKS-INCID-HEADER.                             
461660                                                                              
461740                                                                              
461800 20000700-EXIT.                                                               
462100    EXIT.                                                                     
463000                                                                              
463300                                                                              
463600******************************************************************            
463900******************************************************************            
464200*                                                                             
464500* R U T I N A S    D E   L L A M A D O S   A   L I B R E R I A S.             
464800*                                                                             
465100******************************************************************            
465110                                                                              
465400******************************************************************            
470200* LLAMADO A LA LIBRERIA "CONSULTA" PARA LA CONSULTA DE TOTALES DEL            
470500* S151 EFECTUADOS DURANTE EL BATCH.                                           
470800******************************************************************            
471100 40000100-CALL-S151.                                                          
471400     PERFORM 20000151-TOTXCVES.                                               
471700     IF  WS-S151-0301-RESULT = 0 OR 3 OR 4 OR 5 OR 99                         
472000          MOVE 1 TO WS-CICLO1                                                 
472300     ELSE                                                                     
472900          PERFORM 80001000-DIS-CONS151 THRU 80001000-EXIT                     
473200          PERFORM 50005302-DECIDE      THRU 50005302-EXIT UNTIL               
473500          WS-CICLO2 = 1.                                                      
473800 40000100-EXIT.                                                               
474100     EXIT.                                                                    
474400                                                                              
474700******************************************************************            
475000* LLAMADO A LA LIBRERIA "LINCRED" PARA LA CONSULTA DE TOTALES DEL             
475300* S408.                                                                       
475600******************************************************************            
475900 40000200-CALL-S408.                                                          
476200     PERFORM 20000408-LINCRED.                                                
476500     IF WS-S408-STATUS = 0                                                    
476800        MOVE 1                   TO WS-CICLO3                                 
477100     ELSE                                                                     
477110     IF WS-S408-STATUS = 96                                                   
477120        ADD 1 TO W77-CALL-S408-FAL                                            
477130        IF W77-CALL-S408-FAL > 4                                              
477140           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
477150           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
477160           STRING "ERR CALL S408 RS=", WS-MSG-RS                              
477170                  " INTENTOS=", WS-MSG-N-04                                   
477180                  " (OK CUANDO ESTE DISPONIBLE S408L011LCRD)"                 
477190                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
477200           PERFORM  70000055-STOP-PGM                                         
477210           MOVE " "  TO WS-0101-TEXT-MSG                                      
477220           MOVE ZERO TO WS-S408-STATUS W77-CALL-S408-FAL                      
477230        ELSE                                                                  
477240           MOVE ZERO TO WS-S408-STATUS                                        
477250           WAIT(30)                                                           
477260     ELSE                                                                     
477300***************************************************************               
477310***  SI EL PRODUCTO ES TARJETAS PREPAGADAS 66-11-01          **               
477312***  (ESTE PRODUCTO NO MANEJA LINEAS DE CREDITO)             **               
477314***  MUEVE CERO A WS-S408-STATUS Y TOTALES                   **               
477316***  PARA SIMULAR QUE EL PRODUCTO NO TIENE MOVTOS EN S408    **               
477318***************************************************************               
477320     IF WS03-88-PIM-PROD-A-SOR OR WS03-88-PIM-PREPAGADA                       
477322        MOVE 0 TO WS-S408-NUMCAR WS-S408-IMPCAR WS-S408-STATUS                
477324                  WS-S408-NUMABO WS-S408-IMPABO                               
477326        MOVE 1 TO WS-CICLO3                                                   
477328     ELSE                                                                     
477700        PERFORM 80002000-DIS-CONS408  THRU 80002000-EXIT                      
478000        PERFORM 50005254-DECIDO       THRU 50005254-EXIT                      
478300                UNTIL WS-CICLO4  = 1.                                         
478600 40000200-EXIT.                                                               
478900     EXIT.                                                                    
479200                                                                              
479500******************************************************************            
479800* LLAMADO A LA LIBRERIA DEL S151 "FINBATCH" PARA INDICARLE A ESTE             
480100* QUE EL S500 YA HA FINALIZADO SU BATCH.                                      
480400******************************************************************            
480700 40000300-CALL-FIN151.                                                        
481000     PERFORM 20000151-CARGAMOV1.                                              
481300     IF WS-S151-0101-STATUS = 0                                               
481600         MOVE 1 TO WS-CICLO1                                                  
481900      ELSE                                                                    
482500         PERFORM 80003000-DIS-FINS151   THRU 80003000-EXIT                    
482800         PERFORM 51001600-DECIDE        THRU 51001600-EXIT UNTIL              
483100         WS-CICLO2 = 1.                                                       
483400 40000300-EXIT.                                                               
483700      EXIT.                                                                   
484000                                                                              
484300                                                                              
484600                                                                              
484900                                                                              
485200******************************************************************            
485500******************************************************************            
485800*                                                                             
486100*                    P R O C E S O S.                                         
486400*   E J E C U C I O N   D E   T O D O S   L O S   P R O C E S O S             
486700*                  D E L   P R O G R A M A.                                   
487000*                                                                             
487300******************************************************************            
487600******************************************************************            
487900                                                                              
488200 50000000-PROCESOS.                                                           
488500     PERFORM 50005000-IMP-CIFRAS    THRU 50005000-EXIT.                       
488800     PERFORM 50006000-SORT-CVES     THRU 50006000-EXIT.                       
489100     PERFORM 50007000-LEO-TOTCVE    THRU 50007000-EXIT UNTIL                  
489400     WS-10VEZ = 1.                                                            
489700 50000000-EXIT.                                                               
490000    EXIT.                                                                     
490300                                                                              
490600******************************************************************            
490900* REALIZO LA LECTURA DE CIFRAS PARA GENERAR EL LISTADO DE POSICION            
491200* DIF. EN BATCH Y ESTADISTICO.                                                
491500******************************************************************            
491800 50005000-IMP-CIFRAS.                                                         
492100    PERFORM 50005100-LEO-CIF THRU 50005100-EXIT UNTIL WS-3VEZ = 1.            
492400 50005000-EXIT.                                                               
492700    EXIT.                                                                     
493000                                                                              
493300******************************************************************            
493600* LEO EL DATASET DE CIFRAS PARA PODER GENERAR LOS 3 REPORTES.                 
493900******************************************************************            
494200 50005100-LEO-CIF.                                                            
494500    PERFORM 90000009-B09CIFRAS-LOCKN                                          
494800    IF WS-STATUS-BASE > 0                                                     
495100      IF WS-STATUS-BASE = 1                                                   
495400        MOVE 1 TO WS-3VEZ                                                     
495700      ELSE                                                                    
496600        STRING "ERROR AL HACER LOCK A B09 " ,  WS-STATUS-BASE                 
496900        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
497200        PERFORM 70000050-MENSAJE                                              
497500        CALL SYSTEM DMTERMINATE.                                              
497800                                                                              
498100    IF WS-3VEZ = 0                                                            
498400         PERFORM 50005200-GENLIST      THRU  50005200-EXIT.                   
498700 50005100-EXIT.                                                               
499000    EXIT.                                                                     
499300                                                                              
499600****************************************************************              
499900* OPERO CADA UNO DE LOS REGISTROS DE CIFRAS.                                  
500200****************************************************************              
500500 50005200-GENLIST.                                                            
500800     PERFORM 50005210-INICIO      THRU 50005210-EXIT.                         
501100     PERFORM 50005220-INI-CAMPOS  THRU 50005220-EXIT.                         
501400     PERFORM 50005230-TOT-S028    THRU 50005230-EXIT.                         
501700     PERFORM 50005240-TOT-S052    THRU 50005240-EXIT.                         
502000     PERFORM 50005270-CON-S151    THRU 50005270-EXIT.                         
502300     PERFORM 50005400-CON-B14     THRU 50005400-EXIT.                         
502600     PERFORM 50005500-TOT-CIF     THRU 50005500-EXIT.                         
502900     PERFORM 50005250-CON-S408    THRU 50005250-EXIT.                         
503200     PERFORM 50005260-TOT-S408    THRU 50005260-EXIT.                         
503500     PERFORM 50005700-ACT-CIF     THRU 50005700-EXIT.                         
503800 50005200-EXIT.                                                               
504100    EXIT.                                                                     
504400                                                                              
504700****************************************************************              
505000* MUEVO LOS VALORES LA PRIMERA VEZ PARA OBTENER EL NOMBRE DEL                 
505300* PRODUCTO.                                                                   
505600****************************************************************              
505900 50005210-INICIO.                                                             
506200   MOVE B09-NUM-PRODUCTO             TO WS-NUM-PRODUCTO                       
506500   MOVE B09-NUM-INSTRUM              TO WS-NUM-INSTRUM                        
506800   MOVE B09-MONEDA                   TO WS-MONEDA                             
507100   PERFORM 51000000-BUSCO-PRD        THRU 51000000-EXIT                       
507400   MOVE WS-NOMBRE TO WS-DIF-NOMBRE   WS-ESTA-NOMBRE WS-POS-NOMBRE.            
507700   MOVE WS-PRD    TO WS-DIF-PRD      WS-ESTA-PRD    WS-POS-PRD.               
508000   MOVE WS-INS    TO WS-DIF-INS      WS-ESTA-INS    WS-POS-INS.               
508300   MOVE WS-MON    TO WS-DIF-MON      WS-ESTA-MON    WS-POS-MON.               
508600   PERFORM 50005212-ENCABEZADO       THRU 50005212-EXIT.                      
508900 50005210-EXIT.                                                               
509200    EXIT.                                                                     
509500                                                                              
509800*****************************************************************             
510100* GENERA LOS ENCABEZADOS DEL LISTADO DE DIF. EN BATCH.                        
510400*****************************************************************             
510700 50005212-ENCABEZADO.                                                         
511000     MOVE SPACES             TO REG-CIFRAS                                    
511300     MOVE SPACES             TO REG-POSICION                                  
511600     MOVE SPACES             TO REG-ESTA.                                     
511900                                                                              
512200     WRITE REG-CIFRAS        AFTER CHANNEL 1.                                 
512500     WRITE REG-POSICION      AFTER CHANNEL 1.                                 
512800     WRITE REG-ESTA          AFTER CHANNEL 1.                                 
513100                                                                              
513400     WRITE REG-CIFRAS        FROM WS-ENCABEZADO   BEFORE 1.                   
513700     WRITE REG-POSICION      FROM WS-ENCABEZADO   BEFORE 1.                   
514000     WRITE REG-ESTA          FROM WS-ENCABEZADO   BEFORE 1.                   
514300                                                                              
514600     WRITE REG-CIFRAS        FROM WS-ENCABEZADO1  BEFORE 1.                   
514900     WRITE REG-POSICION      FROM WS-ENCABEZADO1  BEFORE 1.                   
515200     WRITE REG-ESTA          FROM WS-ENCABEZADO1  BEFORE 1.                   
515500                                                                              
515800     WRITE REG-CIFRAS        FROM WS-03-DIF       BEFORE 1.                   
516100     WRITE REG-POSICION      FROM WS-03-POSI      BEFORE 1.                   
516400     WRITE REG-ESTA          FROM WS-03-ESTA      BEFORE 1.                   
516700                                                                              
517000     MOVE  1                 TO   WS-HOJA1.                                   
517300     MOVE  WS-HOJA1          TO   WS-DIF-HOJA                                 
517600     MOVE  WS-HOJA1          TO   WS-POS-HOJA                                 
517900     MOVE  WS-HOJA1          TO   WS-ESTA-HOJA                                
518200                                                                              
518500     WRITE REG-CIFRAS        FROM WS-04-DIF       BEFORE 1.                   
518800     WRITE REG-POSICION      FROM WS-04-POSI      BEFORE 1.                   
519100     WRITE REG-ESTA          FROM WS-04-ESTA      BEFORE 1.                   
519400                                                                              
519700     WRITE REG-CIFRAS        FROM WS-IMP-HORA     BEFORE 2.                   
520000     WRITE REG-POSICION      FROM WS-IMP-HORA     BEFORE 2.                   
520300     WRITE REG-ESTA          FROM WS-IMP-HORA     BEFORE 2.                   
520600                                                                              
520900     WRITE REG-CIFRAS        FROM WS-TIT-CARABO   BEFORE 2.                   
521200 50005212-EXIT.                                                               
521500    EXIT.                                                                     
521800                                                                              
522100******************************************************************            
522400* INICIALIZO LOS CAMPOS DONDE SE ACUMULAN LOS TOTALES OBTENIDOS               
522700* DEL S151,Y S408 ASI COMO LOS CAMPOS DEL S151 DONDE SE OBTIENEN              
523000* LOS TOTALES Y VARIABLE UTILIZADAS DURANTE EL PROCESO.                       
523300****************************************************************              
523600 50005220-INI-CAMPOS.                                                         
523900     MOVE 0     TO WS-I WS-J WS-1 WS-2 WS-3 WS-4.                             
524200     MOVE SPACES TO WS-DECIDE1,   WS-DECIDE2,  WS-DECIDE3.                    
524500     MOVE 0 TO  WS-IMP-SCAR-500        WS-NUM-SCAR-500                        
524800                WS-IMP-SCAR-500A       WS-NUM-SCAR-500A                       
525100                WS-IMP-NCON-500        WS-NUM-NCON-500                        
525400                WS-CICLO1 WS-CICLO3 WS-CICLO5                                 
525700                WS-CICLO2 WS-CICLO4 WS-CICLO6                                 
526000                WS-NUM-SABO-500        WS-IMP-SABO-500                        
526300                WS-IMP-NCON-OTRO       WS-NUM-NCON-OTRO                       
526600                WS-NUM-SABO-500A       WS-IMP-SABO-500A                       
526900                WS-NUM-SABO-OTRO       WS-IMP-SABO-OTRO                       
527200                WS-NUM-SCAR-OTRO       WS-IMP-SCAR-OTRO                       
527500                WS-NUM-SABO-OTROA      WS-IMP-SABO-OTROA                      
527800                WS-NUM-SCAR-OTROA      WS-IMP-SCAR-OTROA                      
528100                WS-IMP-TABO-DIF WS-NUM-TABO-DIF                               
528400                WS-IMP-TCAR-DIF WS-NUM-TCAR-DIF                               
528700                WS-IMP-NCON-DIF WS-NUM-NCON-DIF                               
529000                WS-IMP-POS-LSAL WS-NUM-POS-LSAL                               
529300                WS-IMP-POS-LENT WS-NUM-POS-LENT                               
529600                WS-A WS-C       WS-AA WS-CA WS-12VEZ                          
529900                WS-ABONO1       WS-ABONO2   WS-151                            
530200                WS-CARGO1       WS-CARGO2                                     
530500                WS-TCVE-NDIF    WS-TCVE-IDIF                                  
530800                WS-S408-NUMABO  WS-S408-IMPABO                                
531100                WS-S408-NUMCAR  WS-S408-IMPCAR                                
531400                WS-CVEPASO1       WS-CVEPASO2                                 
531700                WS-NUMPASO1       WS-NUMPASO2                                 
532000                WS-IMPPASO1       WS-IMPPASO2                                 
532300                WS-IDEPASO1       WS-IDEPASO2                                 
532600                WS-IMPE-NUMERO    WS-IMPE-IMPORTE                             
532900                WS-IMPS-NUMERO    WS-IMPS-IMPORTE                             
533200                WS-COMS-IMPORTE-C WS-INTS-IMPORTE                             
533500                WS-COMS-IMPORTE-A WS-IMP-SBCCC                                
533510                WS-IMP-SBC6E      WS-IMP-SBC6S                                
533520                WS-IMP-SBC6EA     WS-IMP-SBC6SA                               
533530                WS-IMP-6DI-LENT   WS-IMP-6DI-LSAL                             
533800                WS-NCON           WS-NCON1                                    
534100                WS-CAMBIO         WS-CAMBIO-PRD                               
534400                WS-CAMBIO-INS     WS-CAMBIO-MON                               
534700                WS-BLO-IMPENT     WS-BLO-IMPSAL                               
534800                WS-CGO-CTAGLOB    WS-ABO-CTAGLOB                              
534900                WS-CGO-CTABENEF   WS-ABO-CTABENEF.                            
535000 50005220-EXIT.                                                               
535300   EXIT.                                                                      
535600                                                                              
535900****************************************************************              
536200* IMPRIMO EL DETALLE DEL MOVIMIENTO DEL S028.                                 
536500****************************************************************              
536800 50005230-TOT-S028.                                                           
537100     WRITE REG-CIFRAS  FROM WS-TIT-S028           BEFORE 1.                   
537400     MOVE   B09-S028B-CARGOS  TO   WS-S028LC.                                 
537700     MOVE   B09-S028B-ABONOS  TO   WS-S028LA.                                 
538000     MOVE   0                 TO   WS-S028FC.                                 
538300     MOVE   0                 TO   WS-S028FA.                                 
538600                                                                              
538900     WRITE REG-CIFRAS FROM WS-S028LOC             BEFORE 1.                   
539200     WRITE REG-CIFRAS FROM WS-S028FOR             BEFORE 2.                   
539500 50005230-EXIT.                                                               
539800     EXIT.                                                                    
540100                                                                              
540400******************************************************************            
540700* IMPRIMO EL DETALLE DE LOS MOVIMIENTOS DEL S052.                             
541000******************************************************************            
541300 50005240-TOT-S052.                                                           
541600     WRITE REG-CIFRAS FROM WS-TIT-S052            BEFORE 1.                   
541900     MOVE   B09-POSIB-CARGOS     TO   WS-S052LC.                              
542200     MOVE   B09-POSIB-ABONOS     TO   WS-S052LA.                              
542500     MOVE   0                    TO   WS-S052FC.                              
542800     MOVE   0                    TO   WS-S052FA.                              
543100                                                                              
543400     WRITE REG-CIFRAS FROM WS-S052LOC             BEFORE 1.                   
543700     WRITE REG-CIFRAS FROM WS-S052FOR             BEFORE 2.                   
544000 50005240-EXIT.                                                               
544300     EXIT.                                                                    
544600                                                                              
544900******************************************************************            
545200* CONSULTO LOS TOTALES DE LOS MOV. QUE FUERON RECIBIDOS POR EL 408            
545500******************************************************************            
545800 50005250-CON-S408.                                                           
545900     MOVE ZERO TO W77-CALL-S408-FAL.                                          
546100     PERFORM 50005252-CONSULTO THRU 50005252-EXIT                             
546400             UNTIL WS-CICLO3 = 1.                                             
546700 50005250-EXIT.                                                               
547000    EXIT.                                                                     
547300                                                                              
547600******************************************************************            
547900* MUEVO LOS CAMPOS PARA HACER EL LLAMADO AL S408.                             
548200******************************************************************            
548500 50005252-CONSULTO.                                                           
548510        MOVE ALL @00@            TO WS-S408-FTO                               
549700        MOVE 0                   TO WS-S408-STATUS                            
550000        MOVE 0                   TO WS-CICLO4                                 
550300        MOVE 13                  TO WS-S408-FUNCION                           
550600        MOVE 170                 TO WS-S408-PASO                              
550900        MOVE 30                  TO WS-S408-TIPOPROCESO                       
551200        MOVE WS-FECHA-PRO        TO WS-S408-FECPRO                            
551500        MOVE B09-NUM-PRODUCTO    TO WS03-NUM-PRODUCTO                         
551800        MOVE B09-NUM-INSTRUM     TO WS03-NUM-INSTRUM                          
552100        MOVE B09-MONEDA          TO WS03-MONEDA                               
552400        PERFORM 40000200-CALL-S408  THRU 40000200-EXIT.                       
552700 50005252-EXIT.                                                               
553000    EXIT.                                                                     
553300                                                                              
553600******************************************************************            
553900* EL OPERADOR DECIDE LA ACCION A SEGUIR EN CASO DE QUE FALLE EL               
554200* LA CONSULTA A LOS TOTALES DEL S408.                                         
554500******************************************************************            
554800 50005254-DECIDO.                                                             
555100      ACCEPT WS-DECIDE1    .                                                  
555400      IF WS-DECIDE1     = "C"                                                 
555700         MOVE 1      TO WS-CICLO4                                             
556000         MOVE 1      TO WS-CICLO3                                             
556300      ELSE                                                                    
556600      IF WS-DECIDE1     = "R"                                                 
556610         CANCEL "LINCRED"                                                     
556615         WAIT(2)                                                              
556650         PERFORM 10000408-LINCRED                                             
556900         MOVE 1    TO WS-CICLO4                                               
557200      ELSE                                                                    
557300         MOVE "I"  TO W77-TIPO-DISP                                           
558100         STRING "DECISION INVALIDA "   WS-DECIDE1                             
558200                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
558400         PERFORM 70000050-MENSAJE                                             
558500         MOVE "E"  TO W77-TIPO-DISP.                                          
558700 50005254-EXIT.                                                               
559000     EXIT.                                                                    
559300                                                                              
559600******************************************************************            
559900* IMPRIMO EL EL DETALLE DE LOS MOVIMIENTOS DEL S408.                          
560200******************************************************************            
560500 50005260-TOT-S408.                                                           
560800     WRITE REG-CIFRAS FROM WS-TIT-S408            BEFORE 1.                   
561100     WRITE REG-CIFRAS FROM WS-TIT-500408          BEFORE 1.                   
561400     MOVE   B09-S408B-CARGOS      TO   WS-C500-IMP1.                          
561700     MOVE   B09-S408B-ABONOS      TO   WS-A500-IMP1.                          
562000     MOVE   B09-S408B-NUMCAR      TO   WS-C500-NUM1.                          
562300     MOVE   B09-S408B-NUMABO      TO   WS-A500-NUM1.                          
562600     MOVE   WS-S408-IMPCAR        TO   WS-COTRO-IMP1.                         
562900     MOVE   WS-S408-NUMCAR        TO   WS-COTRO-NUM1.                         
563200     MOVE   WS-S408-IMPABO        TO   WS-AOTRO-IMP1.                         
563500     MOVE   WS-S408-NUMABO        TO   WS-AOTRO-NUM1.                         
563800                                                                              
564100     SUBTRACT WS-S408-IMPCAR    FROM B09-S408B-CARGOS GIVING                  
564400              WS-IMP-TCAR-DIF.                                                
564700     SUBTRACT WS-S408-IMPABO    FROM B09-S408B-ABONOS GIVING                  
565000              WS-IMP-TABO-DIF.                                                
565300     SUBTRACT WS-S408-NUMCAR    FROM B09-S408B-NUMCAR GIVING                  
565600              WS-NUM-TCAR-DIF.                                                
565900     SUBTRACT WS-S408-NUMABO    FROM B09-S408B-NUMABO GIVING                  
566200              WS-NUM-TABO-DIF.                                                
566500                                                                              
566800     MOVE     WS-IMP-TCAR-DIF      TO WS-CDIF-IMP1.                           
567100     MOVE     WS-NUM-TCAR-DIF      TO WS-CDIF-NUM1.                           
567400     MOVE     WS-IMP-TABO-DIF      TO WS-ADIF-IMP1.                           
567700     MOVE     WS-NUM-TABO-DIF      TO WS-ADIF-NUM1.                           
568000                                                                              
568300     WRITE REG-CIFRAS FROM WS-C500-151               BEFORE 1.                
568600     WRITE REG-CIFRAS FROM WS-A500-151               BEFORE 3.                
568900 50005260-EXIT.                                                               
569200     EXIT.                                                                    
569500                                                                              
569800*****************************************************************             
570100* CONSULTO LOS TOTALES DEL S151 POR PRODUCTO,INSTRUMENTO Y MONEDA.            
570400*****************************************************************             
570700 50005270-CON-S151.                                                           
571000     MOVE 0 TO WS-S151-0301-PASO WS-S151-0301-CLAVE.                          
571300     MOVE 0 TO WS-S151-0301-ESQCONT.                                          
571600     PERFORM 50005272-LLAMO-151 THRU 50005272-EXIT UNTIL WS-1 = 1.            
571900                                                                              
572200      IF (B09-NUM-PRODUCTO = 66)                                              
572210     AND (B09-NUM-INSTRUM  = 15)                                              
572215     AND (B09-MONEDA = 5)                                                     
572500          MOVE 0 TO WS-1                                                      
572800          MOVE 0 TO WS-S151-0301-CLAVE WS-S151-0301-ESQCONT                   
573100          MOVE 0 TO WS-S151-0301-PASO                                         
573400          MOVE B09-LLAVE-BANCOS    TO WS-BANORIDES                            
573410          MOVE B09-NUM-PRODUCTO    TO WS-CAMBIO-PRD                           
573420          MOVE B09-NUM-INSTRUM     TO WS-CAMBIO-INS                           
573430          MOVE 1                   TO WS-CAMBIO-MON                           
573700          MOVE WS-BAN-ORI          TO WS-CAMBIO-ORI                           
574000          MOVE WS-BAN-DES          TO WS-CAMBIO-DES                           
574300          MOVE 1                   TO WS-CAMBIO                               
574600          PERFORM 50005272-LLAMO-151  THRU 50005272-EXIT                      
574900                  UNTIL WS-1 = 1.                                             
575200 50005270-EXIT.                                                               
575500    EXIT.                                                                     
575800                                                                              
576100******************************************************************            
576400* CONSULTO AL 151 CUANTAS VECES SEA NECESARIO HASTA QUE ME INDICA             
576700* QUE YA NO HAY CLAVES O EL PRD, INS, MON Y CVE = 0.                          
577000******************************************************************            
577300 50005272-LLAMO-151.                                                          
577600     MOVE 0 TO WS-CICLO1.                                                     
577900     PERFORM 50005290-CONSULTO   THRU 50005290-EXIT UNTIL                     
578200             WS-CICLO1 = 1.                                                   
578500     PERFORM 50005310-CHECO-CVES151 THRU 50005310-EXIT.                       
578800 50005272-EXIT.                                                               
579100   EXIT.                                                                      
579400                                                                              
579700****************************************************************              
580000* LLAMA AL SISTEMA S151 PARA OBTENER LOS TOTALES DE CARGOS Y                  
580300*       ABONOS EN M.N. QUE SE ENVIARON AL S151.                               
580600****************************************************************              
580900 50005290-CONSULTO.                                                           
581200     MOVE 0                TO WS-CICLO2.                                      
581500     MOVE 0                TO WS-S151-0301-RESULT.                            
581800     MOVE 06               TO WS-S151-0301-FUNCION.                           
582100     MOVE WS-FECHA-PRO     TO WS-S151-0301-FECHA.                             
582400     IF WS-CAMBIO = 1                                                         
582700        MOVE WS-CAMBIO-PRD TO WS-S151-0301-PRODUCTO                           
583000        MOVE WS-CAMBIO-INS TO WS-S151-0301-INSTRUMENTO                        
583300        MOVE WS-CAMBIO-MON TO WS-S151-0301-MONEDA                             
583310        MOVE WS-CAMBIO-ORI TO WS-S151-0301-BCOORIG                            
583320        MOVE WS-CAMBIO-DES TO WS-S151-0301-BCODEST                            
583600     ELSE                                                                     
583900        MOVE B09-NUM-PRODUCTO TO WS-S151-0301-PRODUCTO                        
584200        MOVE B09-NUM-INSTRUM  TO WS-S151-0301-INSTRUMENTO                     
584500        MOVE B09-MONEDA       TO WS-S151-0301-MONEDA                          
584510        MOVE B09-LLAVE-BANCOS TO WS-BANORIDES                                 
584520        MOVE WS-BAN-ORI       TO WS-S151-0301-BCOORIG                         
584530        MOVE WS-BAN-DES       TO WS-S151-0301-BCODEST.                        
584800     PERFORM 40000100-CALL-S151 THRU 40000100-EXIT.                           
585100 50005290-EXIT.                                                               
585400   EXIT.                                                                      
585700                                                                              
586000******************************************************************            
586300* SI EL STATUS DEL S151 FUE UN ERROR SE EVALUA LA RESPUESTA DEL               
586600* OPERADOR PARA VER SI CONTINUA EL PROCESO O SE REINTENTA EL                  
586900* LLAMADO AL S151.                                                            
587200******************************************************************            
587500 50005302-DECIDE.                                                             
587800      ACCEPT WS-DECIDE.                                                       
588100      IF WS-DECIDE = "C"                                                      
588400           MOVE 1 TO WS-CICLO1                                                
588700           MOVE 1 TO WS-CICLO2                                                
589000      ELSE                                                                    
589300      IF WS-DECIDE = "R"                                                      
589310         CANCEL "TOTXCVETRAS500"                                              
589315         WAIT (2)                                                             
589400         PERFORM 10000151-TOTXCVE                                             
589600         MOVE 1 TO WS-CICLO2                                                  
589900      ELSE                                                                    
590000         MOVE "I"  TO W77-TIPO-DISP                                           
590800         STRING "DECISION INVALIDA " WS-DECIDE                                
590900                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
591100         PERFORM 70000050-MENSAJE                                             
591200         MOVE "E"  TO W77-TIPO-DISP.                                          
591400 50005302-EXIT.                                                               
591700     EXIT.                                                                    
592000                                                                              
592300****************************************************************              
592600*  ANALIZO LA CONSULTA DE TOTALES POR CLAVES HECHA AL S151.                   
592900****************************************************************              
593200 50005310-CHECO-CVES151.                                                      
593500   IF WS-S151-0301-RESULT = 0 OR 99                                           
593800      PERFORM 50005320-LEO100 THRU 50005320-EXIT UNTIL WS-2 = 1               
594100      MOVE 0 TO WS-2                                                          
594400      MOVE 0 TO WS-151                                                        
594700   ELSE                                                                       
595000      MOVE 1 TO WS-1.                                                         
595300 50005310-EXIT.                                                               
595600   EXIT.                                                                      
595900                                                                              
596200****************************************************************              
596500* LEO LAS CLAVES DE UNA CONSULTA CORRECTA AL S151.                            
596800****************************************************************              
597100 50005320-LEO100.                                                             
597400     ADD 1 TO WS-151.                                                         
597700     IF WS-151 > 100                                                          
598000        MOVE 1 TO WS-2                                                        
598300     ELSE                                                                     
598600        IF WS-S151-0301-CLAVE-S(WS-151) = 0                                   
598900           MOVE 1 TO WS-1                                                     
599200           MOVE 1 TO WS-2                                                     
599500        ELSE                                                                  
599800           IF (WS-S151-0301-PASO-S(WS-151) > 10) AND                          
600100              (WS-S151-0301-PASO-S(WS-151) < 90)                              
600400              PERFORM 50005330-ACUM-151  THRU 50005330-EXIT                   
600700              IF WS-CAMBIO = 1                                                
601000                 MOVE 66                           TO TCVE-PRD                
601300                 MOVE 15                           TO TCVE-INS                
601600                 MOVE 5                            TO TCVE-MON                
601900                 MOVE WS-S151-0301-CLAVE-S(WS-151) TO TCVE-CVE                
602200                 MOVE WS-S151-0301-IMPMOVS-S(WS-151)  TO TCVE-IMP             
602500                 MOVE WS-S151-0301-NUMMOVS-S(WS-151)  TO TCVE-NUM             
602800                 MOVE 151                             TO TCVE-IDEN            
603100                 WRITE REG-TOTCVE                                             
603400              ELSE                                                            
603700                 MOVE B09-NUM-PRODUCTO             TO TCVE-PRD                
604000                 MOVE B09-NUM-INSTRUM              TO TCVE-INS                
604300                 MOVE B09-MONEDA                   TO TCVE-MON                
604600                 MOVE WS-S151-0301-CLAVE-S(WS-151) TO TCVE-CVE                
604900                 MOVE WS-S151-0301-IMPMOVS-S(WS-151)  TO TCVE-IMP             
605200                 MOVE WS-S151-0301-NUMMOVS-S(WS-151)  TO TCVE-NUM             
605500                 MOVE 151                             TO TCVE-IDEN            
605800                 WRITE REG-TOTCVE                                             
606100            ELSE                                                              
606400              NEXT SENTENCE.                                                  
606700 50005320-EXIT.                                                               
607000   EXIT.                                                                      
607300                                                                              
607600******************************************************************            
607900* ACUMULO LAS CLAVES DEL S151 PARA LOS TOTALES DEL LISTADO DE CIF.            
608200******************************************************************            
608500 50005330-ACUM-151.                                                           
608800    IF (WS-S151-0301-CLAVE-S(WS-151) > 999 ) AND                              
609100       (WS-S151-0301-CLAVE-S(WS-151) < 2000)                                  
609400       ADD WS-S151-0301-NUMMOVS-S(WS-151)     TO WS-NUM-SABO-OTRO             
609700       ADD WS-S151-0301-IMPMOVS-S(WS-151)     TO WS-IMP-SABO-OTRO.            
610000                                                                              
610300    IF (WS-S151-0301-CLAVE-S(WS-151) > 1999) AND                              
610600       (WS-S151-0301-CLAVE-S(WS-151) < 3000)                                  
610900       ADD WS-S151-0301-NUMMOVS-S(WS-151)     TO WS-NUM-SCAR-OTRO             
611200       ADD WS-S151-0301-IMPMOVS-S(WS-151)     TO WS-IMP-SCAR-OTRO.            
611500                                                                              
611800    IF (WS-S151-0301-CLAVE-S(WS-151) > 2999) AND                              
612100       (WS-S151-0301-CLAVE-S(WS-151) < 4000)                                  
612400       ADD WS-S151-0301-NUMMOVS-S(WS-151)    TO WS-NUM-SABO-OTROA             
612700       ADD WS-S151-0301-IMPMOVS-S(WS-151)    TO WS-IMP-SABO-OTROA.            
613000                                                                              
613300    IF (WS-S151-0301-CLAVE-S(WS-151) > 3999) AND                              
613600       (WS-S151-0301-CLAVE-S(WS-151) < 5000)                                  
613900       ADD WS-S151-0301-NUMMOVS-S(WS-151)    TO WS-NUM-SCAR-OTROA             
614200       ADD WS-S151-0301-IMPMOVS-S(WS-151)    TO WS-IMP-SCAR-OTROA.            
614500 50005330-EXIT.                                                               
614800    EXIT.                                                                     
615100                                                                              
615400******************************************************************            
615700* ACUMULO Y GRABO LOS TOTALES POR CLAVE DE LA BASE P/PRD,INS,MON.             
616000******************************************************************            
616300  50005400-CON-B14.                                                           
616600     SET B14SXPRDPASOCVE             TO BEGINNING                             
616900     MOVE B09-NUM-PRODUCTO           TO WS-NUM-PRODUCTO                       
617200     MOVE B09-NUM-INSTRUM            TO WS-NUM-INSTRUM                        
617500     MOVE B09-MONEDA                 TO WS-MONEDA                             
617510     MOVE B09-LLAVE-BANCOS           TO WS-LLAVE-BANCOS                       
617800     PERFORM 50005410-LEO-B14        THRU 50005410-EXIT UNTIL                 
618100     WS-3 = 1.                                                                
618400 50005400-EXIT.                                                               
618700    EXIT.                                                                     
619000                                                                              
619300******************************************************************            
619600* LEO EL DATA SET DE TOT P/CVE DE ACUERDO AL PRD/INS/MON DE CIFRAS            
619900******************************************************************            
620200 50005410-LEO-B14.                                                            
620500     PERFORM 90000014-B14SXPRDPASOCVE-FINDN                                   
620800     IF WS-STATUS-BASE > 0                                                    
621100        IF WS-STATUS-BASE = 1                                                 
621400           MOVE 1 TO WS-3                                                     
621700        ELSE                                                                  
622600         STRING "ERROR AL HACER FIND A B14", WS-STATUS-BASE                   
622900         DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                 
623200         PERFORM 70000050-MENSAJE                                             
623500         CALL SYSTEM DMTERMINATE.                                             
623800                                                                              
624100     IF WS-3 = 0                                                              
624400        IF (B14-NUM-PASO = 120) OR (B14-NUM-PASO = 130)                       
624405           MOVE B14-CLAVE-TRANS             TO WS-CLAVE-TRANS                 
624410           MOVE B14-CLAVE-TRANS             TO WS-MSG-CVE                     
624415           PERFORM 50005415-LEO-B17  THRU  50005415-EXIT                      
624420           MOVE 0                           TO WS-CLAVE-TRANS                 
624700           PERFORM 50005420-ACUM-500 THRU 50005420-EXIT                       
625000           MOVE B14-NUM-PRODUCTO            TO TCVE-PRD                       
625300           MOVE B14-NUM-INSTRUM             TO TCVE-INS                       
625600           MOVE B14-MONEDA                  TO TCVE-MON                       
625900           MOVE B14-CLAVE-TRANS             TO TCVE-CVE                       
626200           MOVE B14-NUM-TRANS               TO TCVE-NUM                       
626500           MOVE B14-IMPORTE                 TO TCVE-IMP                       
626800           MOVE 500                         TO TCVE-IDEN                      
626850           IF B17-IND-ACUM-VAL = 2                                            
626950              WRITE REG-TOTCVE                                                
627000           ELSE                                                               
627100              WRITE REG-TOTCVE.                                               
627400 50005410-EXIT.                                                               
627700   EXIT.                                                                      
628000                                                                              
628002 50005415-LEO-B17.                                                            
628004*==================                                                           
628006   PERFORM 90000017-B17AXCLAVE-FIND                                           
628008   IF WS-STATUS-BASE > 0                                                      
628010     IF WS-STATUS-BASE = 1                                                    
628012         STRING "CLAVE INEXISTENTE EN B17 ",WS-MSG-CVE                        
628014         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
628016         PERFORM 70000050-MENSAJE                                             
628018         CALL SYSTEM DMTERMINATE                                              
628020      ELSE                                                                    
628022         STRING "ERROR AL HACER FIND  A B17 ",WS-STATUS-BASE                  
628024         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
628026         PERFORM 70000050-MENSAJE                                             
628028         CALL SYSTEM DMTERMINATE.                                             
628030                                                                              
628032   PERFORM 50005417-ACUMULO         THRU 50005417-EXIT.                       
628034 50005415-EXIT.                                                               
628036     EXIT.                                                                    
628038                                                                              
628040 50005417-ACUMULO.                                                            
628042*=================                                                            
628044   IF B17-IND-RES-XSIRH  > 0 AND                                              
628046      B17-TIPO-MOV       = 2                                                  
628048      ADD B14-IMPORTE       TO WS-COMS-IMPORTE-A                              
628050      ADD B14-IMP-FOR-RCV   TO WS-COMS-IMPORTE-A.                             
628052 50005417-EXIT.                                                               
628054     EXIT.                                                                    
628056                                                                              
628300******************************************************************            
628600* ACUMULO LAS CLAVES DEL S151 PARA LOS TOTALES DEL LISTADO DE CIF.            
628900******************************************************************            
629200 50005420-ACUM-500.                                                           
629500    IF (B14-CLAVE-TRANS > 999)  AND (B14-CLAVE-TRANS < 2000)                  
629800       ADD B14-NUM-TRANS         TO WS-NUM-SABO-500                           
630100       ADD B14-IMPORTE           TO WS-IMP-SABO-500.                          
630400                                                                              
630700    IF (B14-CLAVE-TRANS > 1999) AND (B14-CLAVE-TRANS < 3000)                  
631000       ADD B14-NUM-TRANS         TO WS-NUM-SCAR-500                           
631300       ADD B14-IMPORTE           TO WS-IMP-SCAR-500.                          
631600                                                                              
631900    IF (B14-CLAVE-TRANS > 2999) AND (B14-CLAVE-TRANS < 4000)                  
632200       ADD B14-NUM-TRANS         TO WS-NUM-SABO-500A                          
632500       ADD B14-IMPORTE           TO WS-IMP-SABO-500A                          
632800       IF B14-CLAVE-TRANS = 3000  OR 3019                                     
633100          ADD B14-IMPORTE        TO WS-INTS-IMPORTE                           
633400       ELSE                                                                   
633700***       IF B14-CLAVE-TRANS = 3004                                           
634000***          ADD B14-IMPORTE        TO WS-BLO-IMPSAL                          
634300***       ELSE                                                                
634600             IF B14-CLAVE-TRANS = 3028                                        
634610                ADD B14-IMPORTE     TO WS-IMP-SBC6E                           
634620             ELSE                                                             
634630                IF B14-CLAVE-TRANS = 3029                                     
634640                   ADD B14-IMPORTE  TO WS-IMP-SBC6EA                          
634650                ELSE                                                          
634652                   IF B14-CLAVE-TRANS = 3020 OR 3041 OR 3042                  
634654                      ADD B14-IMPORTE TO WS-COMS-IMPORTE-A                    
634656                   ELSE                                                       
634660                      NEXT SENTENCE.                                          
634900                                                                              
635200    IF (B14-CLAVE-TRANS > 3999) AND (B14-CLAVE-TRANS < 5000)                  
635500       ADD B14-NUM-TRANS         TO WS-NUM-SCAR-500A                          
635800       ADD B14-IMPORTE           TO WS-IMP-SCAR-500A                          
636100       IF B14-CLAVE-TRANS = 4003                                              
636400          ADD B14-NUM-TRANS      TO WS-IMPS-NUMERO                            
636700          ADD B14-IMPORTE        TO WS-IMPS-IMPORTE                           
637000       ELSE                                                                   
637300       IF B14-CLAVE-TRANS = 4380                                              
637600          ADD B14-IMPORTE        TO WS-ABO-CTAGLOB                            
637650       ELSE                                                                   
637700       IF B14-CLAVE-TRANS = 4381                                              
637750          ADD B14-IMPORTE        TO WS-ABO-CTABENEF                           
637900       ELSE                                                                   
638200          IF B14-CLAVE-TRANS = 4009                                           
638500             ADD B14-NUM-TRANS      TO WS-IMPE-NUMERO                         
638800             ADD B14-IMPORTE        TO WS-IMPE-IMPORTE                        
639100          ELSE                                                                
639400             IF B14-CLAVE-TRANS = 4014                                        
639700                ADD B14-IMPORTE     TO WS-IMP-SBCCC                           
640000             ELSE                                                             
640010                IF B14-CLAVE-TRANS = 4020                                     
640020                   ADD B14-IMPORTE  TO WS-IMP-SBC6S                           
640030                ELSE                                                          
640032                   IF B14-CLAVE-TRANS = 4021                                  
640040                      ADD B14-IMPORTE  TO WS-IMP-SBC6SA                       
640060                   ELSE                                                       
640300                      IF B14-CLAVE-TRANS > 4049                               
640600                         PERFORM 50005440-SCOM THRU 50005440-EXIT             
640900                      ELSE                                                    
641200                         NEXT SENTENCE                                        
641500    ELSE                                                                      
641800       NEXT SENTENCE.                                                         
642100 50005420-EXIT.                                                               
642400    EXIT.                                                                     
642700                                                                              
643000******************************************************************            
643300* ACUMULO EN EL RUBRO DE LAS COMISIONES DEPENDIENDO DE LA CLAVE.              
643600******************************************************************            
643900 50005440-SCOM.                                                               
644200    IF (B14-CLAVE-TRANS > 4150) AND (B14-CLAVE-TRANS < 4159)                  
644500        NEXT SENTENCE                                                         
644800    ELSE                                                                      
645100        ADD B14-IMPORTE  TO WS-COMS-IMPORTE-C.                                
645400 50005440-EXIT.                                                               
645700  EXIT.                                                                       
646000                                                                              
646300******************************************************************            
646600* IMPRIMO LAS CIFRAS ESTADISTICAS, LA POSICION Y EL LISTADO DE                
646900* TOTALES REANSMITIDOS EN BATCH.                                              
647200******************************************************************            
647500 50005500-TOT-CIF.                                                            
647800     PERFORM  50005510-IMP-ESTA     THRU 50005510-EXIT.                       
648100     PERFORM  50005520-IMP-TOTB     THRU 50005520-EXIT.                       
648400     PERFORM  50005530-IMP-POSB     THRU 50005530-EXIT.                       
648700 50005500-EXIT.                                                               
649000    EXIT.                                                                     
649300                                                                              
649600******************************************************************            
649900* IMPRIMO LAS ESTADISTICAS DE CADA PRODUCTO.                                  
650200******************************************************************            
650500 50005510-IMP-ESTA.                                                           
650800      COMPUTE WS-NUMANT = ( B09-NUM-CTOS-CSDO +                               
651100                            B09-NUM-CTOS-SSDO +                               
651400                            B09-NUM-DEPURA    +                               
651700                            B09-SAL-XCAMBPROD) -                              
652000                           (B09-NUM-APERTURAS).                               
652300      COMPUTE WS-NUMANT =   WS-NUMANT - B09-ENT-XCAMBPROD.                    
652600                                                                              
652900      MOVE WS-NUMANT           TO   WS-NUM-CANT                               
653200      WRITE REG-ESTA           FROM WS-TIT-CANT    BEFORE 2.                  
653500                                                                              
653800      MOVE B09-NUM-APERTURAS   TO   WS-NUM-CAPE                               
654100      WRITE REG-ESTA           FROM WS-TIT-CAPE    BEFORE 2.                  
654400                                                                              
654700      MOVE B09-IMP-APERTURAS   TO   WS-IMP-IAPE                               
655000      WRITE REG-ESTA           FROM WS-TIT-IAPE    BEFORE 2.                  
655300                                                                              
655600      MOVE B09-NUM-CANCELAC    TO   WS-NUM-CCAN                               
655900      WRITE REG-ESTA           FROM WS-TIT-CCAN    BEFORE 2.                  
656200                                                                              
656500      MOVE B09-NUM-CANCAUTO    TO   WS-NUM-BAAU                               
656800      WRITE REG-ESTA           FROM WS-TIT-BAAU    BEFORE 2.                  
657100                                                                              
657400      MOVE B09-NUM-DEPURA      TO   WS-NUM-DEPU                               
657700      WRITE REG-ESTA           FROM WS-TIT-DEPU    BEFORE 2.                  
657710                                                                              
657724      MOVE B09-USO-FUT-01      TO WS-NUM-PREALTAS.                            
657732      WRITE REG-ESTA FROM WS-TIT-DEP-PREALTAS BEFORE 2.                       
658000                                                                              
658300      MOVE B09-ENT-XCAMBPROD   TO   WS-NUM-EPRD                               
658600      WRITE REG-ESTA           FROM WS-TIT-EPRD    BEFORE 2.                  
658900                                                                              
659200      MOVE B09-SAL-XCAMBPROD   TO   WS-NUM-SPRD                               
659500      WRITE REG-ESTA           FROM WS-TIT-SPRD    BEFORE 2.                  
659800                                                                              
660100      COMPUTE WS-NUMACT = (B09-NUM-CTOS-CSDO +                                
660400                           B09-NUM-CTOS-SSDO).                                
660700      MOVE WS-NUMACT           TO   WS-NUM-CACT                               
661000      WRITE REG-ESTA           FROM WS-TIT-CACT    BEFORE 4.                  
661300                                                                              
661600      MOVE B09-NUM-CTOS-CSDO   TO   WS-NUM-CSAL                               
661900      WRITE REG-ESTA           FROM WS-TIT-CSAL    BEFORE 2.                  
662200                                                                              
662500      MOVE B09-NUM-CTOS-SSDO   TO   WS-NUM-SSAL                               
662800      WRITE REG-ESTA           FROM WS-TIT-SSAL    BEFORE 2.                  
663100 50005510-EXIT.                                                               
663400    EXIT.                                                                     
663700                                                                              
664000******************************************************************            
664300* IMPRIMO LOS TOTALES DEL 500 Y 151 PARA FINALIZAR EL REP. DE CIF.            
664600******************************************************************            
664900 50005520-IMP-TOTB.                                                           
665200     MOVE SPACES TO REG-CIFRAS.                                               
665500     WRITE REG-CIFRAS FROM WS-TIT-COM          BEFORE 1.                      
665800     MOVE WS-COMS-IMPORTE-C      TO            WS-COMS1-IMPC                  
665810     MOVE WS-COMS-IMPORTE-A      TO            WS-COMS1-IMPA                  
666100     WRITE REG-CIFRAS FROM WS-COMISIONES       BEFORE 2.                      
666400                                                                              
666700     MOVE SPACES TO REG-CIFRAS.                                               
667000     WRITE REG-CIFRAS FROM WS-TIT-INT          BEFORE 1.                      
667300     MOVE WS-INTS-IMPORTE      TO              WS-INTS1-IMP                   
667600     WRITE REG-CIFRAS FROM WS-INTERESES        BEFORE 2.                      
667900                                                                              
668200     MOVE SPACES TO REG-CIFRAS.                                               
668500     WRITE REG-CIFRAS FROM WS-TIT-BENEF         BEFORE 1.                     
668800     MOVE WS-CGO-CTAGLOB       TO          WLI-CGO-CTAGLOB.                   
669100     MOVE WS-ABO-CTAGLOB       TO          WLI-ABO-CTAGLOB.                   
669400     WRITE REG-CIFRAS FROM WS-TRAS-CTAGLOBAL   BEFORE 1.                      
669500     MOVE WS-CGO-CTABENEF      TO          WLI-CGO-CTABENEF                   
669600     MOVE WS-ABO-CTABENEF      TO          WLI-ABO-CTABENEF                   
669700     WRITE REG-CIFRAS FROM WS-TRAS-CTABENEF    BEFORE 2.                      
670000                                                                              
670300     MOVE SPACES TO REG-CIFRAS.                                               
670600     WRITE REG-CIFRAS FROM WS-TIT-SBCCC        BEFORE 1.                      
670900     MOVE WS-IMP-SBCCC         TO              WS-IMP-SBCCC1.                 
671200     WRITE REG-CIFRAS FROM WS-DET-SBCCC        BEFORE 2.                      
671500                                                                              
671505     MOVE SPACES TO REG-CIFRAS.                                               
671510     WRITE REG-CIFRAS FROM WS-TIT-SBC6D        BEFORE 1.                      
671515     MOVE WS-IMP-SBC6E         TO              WS-IMP-SBC6E1.                 
671520     WRITE REG-CIFRAS FROM WS-DET-SBC6E        BEFORE 1.                      
671521     MOVE WS-IMP-SBC6S        TO               WS-IMP-SBC6S1.                 
671522     WRITE REG-CIFRAS FROM WS-DET-SBC6S        BEFORE 2.                      
671525                                                                              
671530     MOVE SPACES TO REG-CIFRAS.                                               
671535     WRITE REG-CIFRAS FROM WS-TIT-SBC6DA       BEFORE 1.                      
671540     MOVE WS-IMP-SBC6EA       TO               WS-IMP-SBC6E1.                 
671545     WRITE REG-CIFRAS FROM WS-DET-SBC6E        BEFORE 1.                      
671546     MOVE WS-IMP-SBC6SA       TO               WS-IMP-SBC6S1.                 
671547     WRITE REG-CIFRAS FROM WS-DET-SBC6S        BEFORE 2.                      
671550                                                                              
671800     MOVE SPACES TO REG-CIFRAS.                                               
672100     WRITE REG-CIFRAS FROM WS-TIT-IMPE         BEFORE 1.                      
672400     MOVE WS-IMPE-NUMERO       TO              WS-IMP-ENTNUM                  
672700     MOVE WS-IMPE-IMPORTE      TO              WS-IMP-ENTIMP                  
673000     WRITE REG-CIFRAS FROM WS-IMP-ENT          BEFORE 1.                      
673300     MOVE WS-IMPS-NUMERO       TO              WS-IMP-SALNUM                  
673600     MOVE WS-IMPS-IMPORTE      TO              WS-IMP-SALIMP                  
673900     WRITE REG-CIFRAS FROM WS-IMP-SAL          BEFORE 2.                      
674200                                                                              
674500     MOVE SPACES TO REG-CIFRAS.                                               
674800     WRITE REG-CIFRAS FROM WS-TIT-S151            BEFORE 1.                   
675100     WRITE REG-CIFRAS FROM WS-TIT-500151          BEFORE 1.                   
675400     MOVE     WS-IMP-SCAR-500    TO               WS-C500-IMP1.               
675700     MOVE     WS-IMP-SCAR-OTRO   TO               WS-COTRO-IMP1.              
676000     MOVE     WS-IMP-SCAR-500A   TO               WS-C500-IMP1A.              
676300     MOVE     WS-IMP-SCAR-OTROA  TO               WS-COTRO-IMP1A.             
676600     MOVE     WS-IMP-SABO-500    TO               WS-A500-IMP1.               
676900     MOVE     WS-IMP-SABO-OTRO   TO               WS-AOTRO-IMP1.              
677200     MOVE     WS-IMP-SABO-500A   TO               WS-A500-IMP1A.              
677500     MOVE     WS-IMP-SABO-OTROA  TO               WS-AOTRO-IMP1A.             
677800     MOVE     WS-NUM-SCAR-500    TO               WS-C500-NUM1.               
678100     MOVE     WS-NUM-SCAR-OTRO   TO               WS-COTRO-NUM1.              
678400     MOVE     WS-NUM-SCAR-500A   TO               WS-C500-NUM1A.              
678700     MOVE     WS-NUM-SCAR-OTROA  TO               WS-COTRO-NUM1A.             
679000     MOVE     WS-NUM-SABO-500    TO               WS-A500-NUM1.               
679300     MOVE     WS-NUM-SABO-OTRO   TO               WS-AOTRO-NUM1.              
679600     MOVE     WS-NUM-SABO-500A   TO               WS-A500-NUM1A.              
679900     MOVE     WS-NUM-SABO-OTROA  TO               WS-AOTRO-NUM1A.             
680200                                                                              
680500     SUBTRACT WS-IMP-SCAR-OTRO  FROM WS-IMP-SCAR-500   GIVING                 
680800              WS-IMP-TCAR-DIF.                                                
681100     SUBTRACT WS-IMP-SABO-OTRO  FROM WS-IMP-SABO-500   GIVING                 
681400              WS-IMP-TABO-DIF.                                                
681700     SUBTRACT WS-NUM-SCAR-OTRO  FROM WS-NUM-SCAR-500   GIVING                 
682000              WS-NUM-TCAR-DIF.                                                
682300     SUBTRACT WS-NUM-SABO-OTRO  FROM WS-NUM-SABO-500   GIVING                 
682600              WS-NUM-TABO-DIF.                                                
682900                                                                              
683200     MOVE     WS-IMP-TCAR-DIF  TO              WS-CDIF-IMP1.                  
683500     MOVE     WS-IMP-TABO-DIF  TO              WS-ADIF-IMP1.                  
683800     MOVE     WS-NUM-TCAR-DIF  TO              WS-CDIF-NUM1.                  
684100     MOVE     WS-NUM-TABO-DIF  TO              WS-ADIF-NUM1.                  
684400     WRITE REG-CIFRAS FROM WS-C500-151           BEFORE 1.                    
684700     WRITE REG-CIFRAS FROM WS-A500-151           BEFORE 1.                    
685000                                                                              
685300     SUBTRACT WS-IMP-SCAR-OTROA FROM WS-IMP-SCAR-500A  GIVING                 
685600              WS-IMP-TCAR-DIF.                                                
685900     SUBTRACT WS-IMP-SABO-OTROA FROM WS-IMP-SABO-500A  GIVING                 
686200              WS-IMP-TABO-DIF.                                                
686500     SUBTRACT WS-NUM-SCAR-OTROA FROM WS-NUM-SCAR-500A  GIVING                 
686800              WS-NUM-TCAR-DIF.                                                
687100     SUBTRACT WS-NUM-SABO-OTROA FROM WS-NUM-SABO-500A  GIVING                 
687400              WS-NUM-TABO-DIF.                                                
687700                                                                              
688000     MOVE     WS-IMP-TCAR-DIF  TO              WS-CDIF-IMP1A.                 
688300     MOVE     WS-IMP-TABO-DIF  TO              WS-ADIF-IMP1A.                 
688600     MOVE     WS-NUM-TCAR-DIF  TO              WS-CDIF-NUM1A.                 
688900     MOVE     WS-NUM-TABO-DIF  TO              WS-ADIF-NUM1A.                 
689200     WRITE REG-CIFRAS FROM WS-C500-151A        BEFORE 1.                      
689500     WRITE REG-CIFRAS FROM WS-A500-151A        BEFORE 2.                      
689800                                                                              
690100 50005520-EXIT.                                                               
690400     EXIT.                                                                    
690410                                                                              
690420******************************************************************            
690430* GENERO EL LISTADO DE LA POSICION.                                           
690450******************************************************************            
690460 50005530-IMP-POSB.                                                           
690470    MOVE B09-SDO-ANTERIOR         TO WS-SDO-ANT.                              
690480    WRITE REG-POSICION            FROM WS-POS-SDOANT BEFORE 2.                
690490                                                                              
690500    WRITE REG-POSICION            FROM WS-TIT-POSI  BEFORE 2.                 
690510    MOVE B09-POSI-NUMCAR          TO WS-POS-LNSAL.                            
690520    ADD  B09-POSIL-CARLOC         TO WS-IMP-POS-LSAL.                         
690530    ADD  B09-POSIL-CARFOR         TO WS-IMP-POS-LSAL.                         
690540    ADD  B09-POSIB-CARGOS         TO WS-IMP-POS-LSAL.                         
690550    MOVE WS-IMP-POS-LSAL          TO WS-POS-LISAL.                            
690555                                                                              
690560    MOVE B09-POSI-NUMABO          TO WS-POS-LNENT.                            
690565    ADD  B09-POSIL-ABOLOC         TO WS-IMP-POS-LENT.                         
690575    ADD  B09-POSIL-ABOFOR         TO WS-IMP-POS-LENT.                         
690580    ADD  B09-POSIB-ABONOS         TO WS-IMP-POS-LENT.                         
690590    MOVE WS-IMP-POS-LENT          TO WS-POS-LIENT.                            
690595    WRITE REG-POSICION            FROM WS-POS-LIN   BEFORE 2.                 
690600                                                                              
690605    MOVE  B09-SDO-ACTUAL          TO WS-SDO-ACT.                              
690610    WRITE REG-POSICION            FROM WS-POS-SDOACT BEFORE 15.               
690615                                                                              
690620    MOVE  SPACES                  TO      REG-POSICION.                       
690630    WRITE REG-POSICION    FROM    WS-04-SBC6 BEFORE 2.                        
690635    MOVE  B09-SBC6D-SDOANT        TO WS-SANT-T6.                              
690640    WRITE REG-POSICION    FROM    WS-T6-SDOANT BEFORE 2.                      
690643                                                                              
690645    ADD  B09-SBC6D-ENT-L          TO WS-IMP-6DI-LENT.                         
690650    ADD  B09-SBC6D-ENT-FR         TO WS-IMP-6DI-LENT.                         
690660    ADD  B09-SBC6D-ENT-XCP        TO WS-IMP-6DI-LENT.                         
690665    MOVE WS-IMP-6DI-LENT          TO WS-T6-ENT.                               
690670    ADD  B09-SBC6D-SAL-L          TO WS-IMP-6DI-LSAL.                         
690675    ADD  B09-SBC6D-SAL-FR         TO WS-IMP-6DI-LSAL.                         
690680    ADD  B09-SBC6D-SAL-XCP        TO WS-IMP-6DI-LSAL.                         
690685    MOVE WS-IMP-6DI-LSAL          TO WS-T6-SAL.                               
690690    WRITE REG-POSICION            FROM  WS-POSI-T6   BEFORE 2.                
690700    WRITE REG-POSICION            FROM  WS-CAAB-T6   BEFORE 2.                
690705                                                                              
690710    MOVE  B09-SBC6D-SDOACT        TO WS-SACT-T6.                              
690720    WRITE REG-POSICION            FROM  WS-T6-SDOACT BEFORE 2.                
690730 50005530-EXIT.                                                               
690740   EXIT.                                                                      
690760                                                                              
698800******************************************************************            
699100* INICIALIZO LOS CAMPOS DE CIFRAS.                                            
699400******************************************************************            
699700 50005700-ACT-CIF.                                                            
700000     MOVE 0            TO B09-S028L-CARLOC                                    
700300                          B09-S028L-ABOLOC                                    
700600                          B09-S028L-CARFOR                                    
700900                          B09-S028L-ABOFOR                                    
701200                          B09-S028B-CARGOS                                    
701500                          B09-S028B-ABONOS                                    
703600                          B09-POSI-NUMCAR                                     
703900                          B09-POSI-NUMABO                                     
704200                          B09-S408L-CARGOS                                    
704500                          B09-S408L-ABONOS                                    
704800                          B09-S408L-NUMCAR                                    
705100                          B09-S408L-NUMABO                                    
705400                          B09-S408B-CARGOS                                    
705700                          B09-S408B-ABONOS                                    
706000                          B09-S408B-NUMCAR                                    
706300                          B09-S408B-NUMABO                                    
706600                          B09-NUM-DEPURA                                      
706900                          B09-IMP-APERTURAS                                   
707200                          B09-ENT-XCAMBPROD                                   
707500                          B09-SAL-XCAMBPROD                                   
707800                          B09-NUM-CANCAUTO                                    
707810                          B09-SBC6D-ENT-XCP                                   
707820                          B09-SBC6D-SAL-XCP                                   
708700                          B09-NUM-APERTURAS                                   
709000                          B09-NUM-CANCELAC                                    
709010                          B09-ABO-FORSPOS                                     
709020                          B09-CGO-FORSPOS.                                    
709025                                                                              
709340                                                                              
709600     MOVE 1               TO WS-BAN-B09.                                      
709900     PERFORM 51001100-ACTUALIZO THRU 51001100-EXIT.                           
710200     MOVE 0               TO WS-BAN-B09.                                      
710500 50005700-EXIT.                                                               
710800    EXIT.                                                                     
710810                                                                              
711400******************************************************************            
711700* SORTEO EL ARCHIVO DE TOTALES POR CLAVE.                                     
712000******************************************************************            
712300 50006000-SORT-CVES.                                                          
712600   MOVE ATTRIBUTE LASTRECORD OF TOTCVE TO WS-LASTRECORD.                      
712610   ADD 10 TO WS-LASTRECORD.                                                   
712900   CLOSE TOTCVE WITH SAVE.                                                    
713100                                                                              
713200   COMPUTE WS-SORT-ESPACIO = WS-LASTRECORD * 07 * 3.5.                        
713210   COMPUTE WS-SORT-MEMORY = ((WS-LASTRECORD / 16) * 10) + 1500.               
713230   IF WS-SORT-MEMORY  < 400000                                                
713240      MOVE 400000 TO WS-SORT-MEMORY                                           
713250   ELSE                                                                       
713260   IF WS-SORT-MEMORY  > 258435000                                             
713270      MOVE 258435000 TO WS-SORT-MEMORY.                                       
713300                                                                              
713310   MOVE WS-SORT-ESPACIO   TO WS-MSG-N-14.                                     
713320   MOVE WS-SORT-MEMORY    TO WS-MSG-N-12.                                     
713330   STRING "DISK-SIZE =" WS-MSG-N-14                                           
713340          ", MEMORY-SIZE =" WS-MSG-N-12                                       
713350          ", PARA SORT TOTCVE "                                               
713360                 DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                      
713370   PERFORM 70000050-MENSAJE.                                                  
713390                                                                              
713500   SORT TOTCVE-SORT ON ASCENDING KEY CVEPRD-SORT                              
713600                                     CVEINS-SORT                              
713800                                     CVEMON-SORT                              
713850                                     CVECVE-SORT                              
713900                                     CVEIDE-SORT                              
713950        USING TOTCVE                                                          
714100       GIVING TOTCVE                                                          
714110       MEMORY SIZE WS-SORT-MEMORY  WORDS                                      
714400       DISK   SIZE WS-SORT-ESPACIO WORDS.                                     
714500                                                                              
714700   OPEN INPUT TOTCVE.                                                         
715000 50006000-EXIT.                                                               
715300    EXIT.                                                                     
715600                                                                              
715900******************************************************************            
716200* LEO EL ARCHIVO DE TOTCVES SORTEADO PARA GENERAR LOS REPORTES.               
716500******************************************************************            
716800 50007000-LEO-TOTCVE.                                                         
717100    READ TOTCVE AT END                                                        
717400    IF (WS-VALE2 = 1)  AND (WS-12VEZ = 2  OR WS-12VEZ = 0)                    
717700       PERFORM 50007500-TOTCA   THRU 50007500-EXIT                            
718000       MOVE 1 TO WS-10VEZ                                                     
718300    ELSE                                                                      
718600       PERFORM 50007420-LIMPIO-CVE THRU 50007420-EXIT                         
718900       PERFORM 50007430-IMP-CVE THRU 50007430-EXIT                            
719200       PERFORM 50007500-TOTCA   THRU 50007500-EXIT                            
719500       MOVE 1 TO WS-10VEZ.                                                    
719800                                                                              
720100   IF WS-10VEZ = 0                                                            
720400     PERFORM 50007100-IMP-CVES  THRU 50007100-EXIT.                           
720700 50007000-EXIT.                                                               
721000    EXIT.                                                                     
721300                                                                              
721600******************************************************************            
721900* IMPRIMO LOS TOTALES POR CLAVE.                                              
722200******************************************************************            
722500 50007100-IMP-CVES.                                                           
722800    PERFORM 50007200-INICIO THRU 50007200-EXIT.                               
723100    PERFORM 50007300-DETCVE THRU 50007300-EXIT.                               
723400 50007100-EXIT.                                                               
723700    EXIT.                                                                     
724000                                                                              
724300******************************************************************            
724600* GENERO LOS ENCABEZADOS DEL PRIMER PRD/INS/MON DE TOT P/CVE.                 
724900******************************************************************            
725200 50007200-INICIO.                                                             
725500    IF WS-11VEZ = 0                                                           
725800       PERFORM 50005220-INI-CAMPOS THRU 50005220-EXIT                         
726100       MOVE TCVE-PRD        TO WS-PRD-ANT WS-NUM-PRODUCTO                     
726400       MOVE TCVE-INS        TO WS-INS-ANT WS-NUM-INSTRUM                      
726700       MOVE TCVE-MON        TO WS-MON-ANT WS-MONEDA                           
727000       PERFORM 51000000-BUSCO-PRD THRU 51000000-EXIT                          
727300       MOVE WS-NOMBRE      TO WS-CVE-NOMBRE                                   
727600       MOVE WS-PRD         TO WS-CVE-PRD                                      
727900       MOVE WS-INS         TO WS-CVE-INS                                      
728200       MOVE WS-MON         TO WS-CVE-MON                                      
728500       PERFORM 50007210-ENC-CVES  THRU 50007210-EXIT                          
728800       MOVE 1 TO WS-11VEZ.                                                    
729100 50007200-EXIT.                                                               
729400   EXIT.                                                                      
729700                                                                              
730000******************************************************************            
730300* IMPRIME LOS ENCABEZADOS DEL LISTADO DE TOTALES P/CVES.                      
730600******************************************************************            
730900 50007210-ENC-CVES.                                                           
731200     MOVE SPACES               TO REG-CLAVES.                                 
731500     WRITE REG-CLAVES          AFTER CHANNEL 1.                               
731800     WRITE REG-CLAVES          FROM WS-ENCABEZADO   BEFORE 1.                 
732100     WRITE REG-CLAVES          FROM WS-ENCABEZADO1  BEFORE 1.                 
732400     WRITE REG-CLAVES          FROM WS-03-CVE       BEFORE 1.                 
732700     ADD   1                   TO   WS-HOJA2                                  
733000     MOVE  WS-HOJA2            TO   WS-CVE-HOJA.                              
733300     WRITE REG-CLAVES          FROM WS-04-CVE       BEFORE 1.                 
733600     WRITE REG-CLAVES          FROM WS-IMP-HORA     BEFORE 2.                 
733900     WRITE REG-CLAVES          FROM WS-TIT-500151   BEFORE 2.                 
734200     WRITE REG-CLAVES          FROM WS-TIT-CVES     BEFORE 2.                 
734500     MOVE  15                  TO   WS-LINEA2.                                
734800 50007210-EXIT.                                                               
735100    EXIT.                                                                     
735400                                                                              
735700******************************************************************            
736000* IMPRIMO EL DETALLE DEL LISTADO DE TOT P/CVE.                                
736300******************************************************************            
736600 50007300-DETCVE.                                                             
736900   IF TCVE-PRD = WS-PRD-ANT   AND                                             
737200      TCVE-INS = WS-INS-ANT   AND                                             
737500      TCVE-MON = WS-MON-ANT                                                   
737800      PERFORM 50007400-VAL-CVE    THRU 50007400-EXIT                          
738100   ELSE                                                                       
738400   IF WS-12VEZ = 1                                                            
738700      PERFORM 50007350-VAL-CON    THRU 50007350-EXIT                          
739000      PERFORM 50007360-OTROPRD    THRU 50007360-EXIT                          
739300      PERFORM 50007370-MUEVO1     THRU 50007370-EXIT                          
739600   ELSE                                                                       
739900      PERFORM 50007500-TOTCA      THRU 50007500-EXIT                          
740200      PERFORM 50007360-OTROPRD    THRU 50007360-EXIT                          
740500      PERFORM 50007370-MUEVO1     THRU 50007370-EXIT.                         
740800 50007300-EXIT.                                                               
741100   EXIT.                                                                      
741400                                                                              
741700******************************************************************            
742000* VALIDO SI EL MOV FINAL ANTES DEL CORTE NO FUE UNA CVE NON.                  
742300******************************************************************            
742600 50007350-VAL-CON.                                                            
742900    IF WS-12VEZ = 1                                                           
743200       PERFORM 50007420-LIMPIO-CVE THRU 50007420-EXIT                         
743500       PERFORM 50007430-IMP-CVE    THRU 50007430-EXIT                         
743800       PERFORM 50007500-TOTCA      THRU 50007500-EXIT                         
744100       MOVE 0                      TO   WS-12VEZ.                             
744400 50007350-EXIT.                                                               
744700    EXIT.                                                                     
745000                                                                              
745300*****************************************************************             
745600* PROCESOS A REALIZAR DESPUES DEL CAMBIO DE PRD.                              
745900******************************************************************            
746200 50007360-OTROPRD.                                                            
746500      PERFORM 50005220-INI-CAMPOS THRU 50005220-EXIT                          
746800      MOVE TCVE-PRD    TO WS-PRD-ANT    WS-NUM-PRODUCTO                       
747100      MOVE TCVE-INS    TO WS-INS-ANT    WS-NUM-INSTRUM                        
747400      MOVE TCVE-MON    TO WS-MON-ANT    WS-MONEDA                             
747700      PERFORM 51000000-BUSCO-PRD  THRU 51000000-EXIT                          
748000      MOVE WS-NOMBRE  TO WS-CVE-NOMBRE                                        
748300      MOVE WS-PRD     TO WS-CVE-PRD                                           
748600      MOVE WS-INS     TO WS-CVE-INS                                           
748900      MOVE WS-MON     TO WS-CVE-MON                                           
749200      PERFORM 50007210-ENC-CVES   THRU 50007210-EXIT.                         
749500 50007360-EXIT.                                                               
749800    EXIT.                                                                     
750100                                                                              
750400******************************************************************            
750700* ACTUALIZA LOS PRIMEROS CAMPOS.                                              
751000******************************************************************            
751300 50007370-MUEVO1.                                                             
751600          MOVE 1 TO WS-12VEZ                                                  
751900          MOVE TCVE-IDEN              TO   WS-IDEPASO1                        
752200          MOVE TCVE-CVE               TO   WS-CVEPASO1                        
752500          MOVE TCVE-IMP               TO   WS-IMPPASO1                        
752800          MOVE TCVE-NUM               TO   WS-NUMPASO1.                       
753100 50007370-EXIT.                                                               
753400   EXIT.                                                                      
753700                                                                              
754000******************************************************************            
754300* IMPRIME EL DETALLE DEPENDIENDO DEL IDENTIFICADOR DE SISTEMA.                
754600******************************************************************            
754900 50007400-VAL-CVE.                                                            
755200     IF WS-12VEZ = 0                                                          
755500        ADD 1             TO WS-12VEZ                                         
755800        MOVE TCVE-CVE     TO WS-CVEPASO1                                      
756100        MOVE TCVE-NUM     TO WS-NUMPASO1                                      
756400        MOVE TCVE-IMP     TO WS-IMPPASO1                                      
756700        MOVE TCVE-IDEN    TO WS-IDEPASO1                                      
757000     ELSE                                                                     
757300     IF WS-12VEZ = 1                                                          
757600        ADD 1             TO WS-12VEZ                                         
757900        MOVE TCVE-CVE     TO WS-CVEPASO2                                      
758200        MOVE TCVE-NUM     TO WS-NUMPASO2                                      
758500        MOVE TCVE-IMP     TO WS-IMPPASO2                                      
758800        MOVE TCVE-IDEN    TO WS-IDEPASO2.                                     
759100                                                                              
759400     IF WS-12VEZ = 2                                                          
759700       IF WS-CVEPASO1 = WS-CVEPASO2                                           
759710         IF WS-IDEPASO1 = WS-IDEPASO2                                         
759720            MOVE 0                      TO   WS-VALE2                         
759730            PERFORM 50007420-LIMPIO-CVE THRU 50007420-EXIT                    
759740            PERFORM 50007430-IMP-CVE    THRU 50007430-EXIT                    
759750            MOVE 1 TO WS-12VEZ                                                
759760            MOVE WS-IDEPASO2            TO   WS-IDEPASO1                      
759770            MOVE WS-CVEPASO2            TO   WS-CVEPASO1                      
759780            MOVE WS-IMPPASO2            TO   WS-IMPPASO1                      
759790            MOVE WS-NUMPASO2            TO   WS-NUMPASO1                      
759800         ELSE                                                                 
760000            MOVE 1                     TO   WS-VALE2                          
760300            MOVE WS-CVEPASO1           TO   WS-CVE-CVE                        
760600            MOVE WS-NUMPASO1           TO   WS-CVE-NUM2 WS-NUMTEM2            
760900            MOVE WS-IMPPASO1           TO   WS-CVE-IMP2 WS-IMPTEM2            
761200            MOVE WS-NUMPASO2           TO   WS-CVE-NUM1 WS-NUMTEM1            
761500            MOVE WS-IMPPASO2           TO   WS-CVE-IMP1 WS-IMPTEM1            
761800            COMPUTE WS-TCVE-NDIF = WS-NUMTEM1 - WS-NUMTEM2                    
762100            COMPUTE WS-TCVE-IDIF = WS-IMPTEM1 - WS-IMPTEM2                    
762400            MOVE WS-TCVE-NDIF           TO   WS-CVE-NUM3                      
762700            MOVE WS-TCVE-IDIF           TO   WS-CVE-IMP3                      
762800            PERFORM 50007435-GENERA-DET-INC                                   
763000            PERFORM 50007430-IMP-CVE    THRU 50007430-EXIT                    
763300            MOVE 0                      TO   WS-12VEZ                         
763600       ELSE                                                                   
763900          MOVE 0                      TO   WS-VALE2                           
764200          PERFORM 50007420-LIMPIO-CVE THRU 50007420-EXIT                      
764500          PERFORM 50007430-IMP-CVE    THRU 50007430-EXIT                      
764800          MOVE 1 TO WS-12VEZ                                                  
765100          MOVE WS-IDEPASO2            TO   WS-IDEPASO1                        
765400          MOVE WS-CVEPASO2            TO   WS-CVEPASO1                        
765700          MOVE WS-IMPPASO2            TO   WS-IMPPASO1                        
766000          MOVE WS-NUMPASO2            TO   WS-NUMPASO1.                       
766020                                                                              
766120                                                                              
766300 50007400-EXIT.                                                               
766600   EXIT.                                                                      
766900                                                                              
767200******************************************************************            
767500* CUANDO HAYA ALGUNA CLAVE FALTANTE EN CUALQUIERA DE LOS DOS                  
767800* SISTEMAS LA CVE. FALTANTE SE INICIALIZA CON CEROS.                          
768100******************************************************************            
768400 50007420-LIMPIO-CVE.                                                         
768700       MOVE WS-CVEPASO1               TO  WS-CVE-CVE.                         
769000       IF WS-IDEPASO1 = 500                                                   
769300          MOVE WS-NUMPASO1            TO  WS-CVE-NUM1 WS-NUMTEM1              
769600          MOVE WS-IMPPASO1            TO  WS-CVE-IMP1 WS-IMPTEM1              
769900          MOVE 0                      TO  WS-CVE-NUM2 WS-NUMTEM2              
770200          MOVE 0                      TO  WS-CVE-IMP2 WS-IMPTEM2              
770500       ELSE                                                                   
770800          MOVE WS-NUMPASO1            TO  WS-CVE-NUM2 WS-NUMTEM2              
771100          MOVE WS-IMPPASO1            TO  WS-CVE-IMP2 WS-IMPTEM2              
771400          MOVE 0                      TO  WS-CVE-NUM1 WS-NUMTEM1              
771700          MOVE 0                      TO  WS-CVE-IMP1 WS-IMPTEM1.             
772000       COMPUTE WS-TCVE-NDIF = WS-NUMTEM1 - WS-NUMTEM2                         
772300       COMPUTE WS-TCVE-IDIF = WS-IMPTEM1 - WS-IMPTEM2                         
772600       MOVE WS-TCVE-NDIF              TO   WS-CVE-NUM3                        
772900       MOVE WS-TCVE-IDIF              TO   WS-CVE-IMP3.                       
773200 50007420-EXIT.                                                               
773500    EXIT.                                                                     
773800                                                                              
774100******************************************************************            
774400* IMPRIMO Y ACUMULO LOS TOTALES POR CLAVE.                                    
774700******************************************************************            
775000 50007430-IMP-CVE.                                                            
775300     IF (WS-CVEPASO1 > 0) AND (WS-CVEPASO1 < 1000)                            
775600         ADD WS-NUMTEM2          TO WS-NUM-NCON-OTRO                          
775900         ADD WS-IMPTEM2          TO WS-IMP-NCON-OTRO                          
776200         ADD WS-NUMTEM1          TO WS-NUM-NCON-500                           
776500         ADD WS-IMPTEM1          TO WS-IMP-NCON-500.                          
776800                                                                              
777100     IF (WS-CVEPASO1 > 999) AND (WS-CVEPASO1 < 2000)                          
777400        ADD WS-NUMTEM2             TO WS-NUM-SABO-OTRO                        
777700        ADD WS-IMPTEM2             TO WS-IMP-SABO-OTRO                        
778000        ADD WS-NUMTEM1             TO WS-NUM-SABO-500                         
778300        ADD WS-IMPTEM1             TO WS-IMP-SABO-500                         
778600        IF WS-NCON = 0                                                        
778900           PERFORM 50007435-TOTNCON THRU 50007435-EXIT                        
779200           MOVE 1               TO WS-NCON WS-NCON1.                          
779500                                                                              
779800     IF (WS-CVEPASO1 > 1999) AND (WS-CVEPASO1 < 3000)                         
780100        ADD WS-NUMTEM2             TO WS-NUM-SCAR-OTRO                        
780400        ADD WS-IMPTEM2             TO WS-IMP-SCAR-OTRO                        
780700        ADD WS-NUMTEM1             TO WS-NUM-SCAR-500                         
781000        ADD WS-IMPTEM1             TO WS-IMP-SCAR-500                         
781300        IF WS-ABONO1 = 0                                                      
781600           IF WS-NCON = 0                                                     
781900              PERFORM 50007435-TOTNCON THRU 50007435-EXIT                     
782200              PERFORM 50007440-TOTA    THRU 50007440-EXIT                     
782500              MOVE 1  TO   WS-ABONO1 WS-A WS-NCON WS-NCON1                    
782800           ELSE                                                               
783100              PERFORM 50007440-TOTA    THRU 50007440-EXIT                     
783400              MOVE 1                   TO WS-ABONO1 WS-A.                     
783700                                                                              
784000     IF (WS-CVEPASO1 > 2999) AND (WS-CVEPASO1 < 4000)                         
784300        ADD WS-NUMTEM2             TO WS-NUM-SABO-OTROA                       
784600        ADD WS-IMPTEM2             TO WS-IMP-SABO-OTROA                       
784900        ADD WS-NUMTEM1             TO WS-NUM-SABO-500A                        
785200        ADD WS-IMPTEM1             TO WS-IMP-SABO-500A                        
785500        IF WS-CARGO1 = 0                                                      
785800           IF WS-ABONO1 = 0                                                   
786100              IF WS-NCON   = 0                                                
786400                 MOVE 1 TO WS-ABONO1 WS-A WS-CARGO1 WS-C                      
786700                 MOVE 1 TO WS-NCON  WS-NCON1                                  
787000                 PERFORM 50007435-TOTNCON THRU 50007435-EXIT                  
787300                 PERFORM 50007440-TOTA    THRU 50007440-EXIT                  
787600                 PERFORM 50007450-TOTC    THRU 50007450-EXIT                  
787900              ELSE                                                            
788200                 MOVE 1 TO WS-ABONO1 WS-A WS-CARGO1 WS-C                      
788500                 PERFORM 50007440-TOTA THRU 50007440-EXIT                     
788800                 PERFORM 50007450-TOTC THRU 50007450-EXIT                     
789100           ELSE                                                               
789400              PERFORM 50007450-TOTC THRU 50007450-EXIT                        
789700              MOVE 1 TO WS-CARGO1 WS-C.                                       
790000                                                                              
790300     IF (WS-CVEPASO1 > 3999) AND (WS-CVEPASO1 < 5000)                         
790600        ADD WS-NUMTEM2             TO WS-NUM-SCAR-OTROA                       
790900        ADD WS-IMPTEM2             TO WS-IMP-SCAR-OTROA                       
791200        ADD WS-NUMTEM1             TO WS-NUM-SCAR-500A                        
791500        ADD WS-IMPTEM1             TO WS-IMP-SCAR-500A                        
791800        IF WS-ABONO2 = 0                                                      
792100          IF WS-CARGO1 = 0                                                    
792400            IF WS-ABONO1 = 0                                                  
792700               IF WS-NCON   = 0                                               
793000                    MOVE 1 TO WS-ABONO1 WS-CARGO1 WS-A WS-C                   
793300                    MOVE 1 TO WS-ABONO2 WS-AA  WS-NCON WS-NCON1               
793600                    PERFORM 50007435-TOTNCON THRU 50007435-EXIT               
793900                    PERFORM 50007440-TOTA   THRU 50007440-EXIT                
794200                    PERFORM 50007450-TOTC   THRU 50007450-EXIT                
794500                    PERFORM 50007460-TOTAA  THRU 50007460-EXIT                
794800                 ELSE                                                         
795100                    MOVE 1 TO WS-ABONO1 WS-CARGO1 WS-A WS-C                   
795400                    MOVE 1 TO WS-ABONO2 WS-AA                                 
795700                    PERFORM 50007440-TOTA THRU 50007440-EXIT                  
796000                    PERFORM 50007450-TOTC THRU 50007450-EXIT                  
796300                    PERFORM 50007460-TOTAA THRU 50007460-EXIT                 
796600            ELSE                                                              
796900               PERFORM 50007450-TOTC THRU 50007450-EXIT                       
797200               PERFORM 50007460-TOTAA THRU 50007460-EXIT                      
797500               MOVE 1 TO WS-CARGO1 WS-ABONO2 WS-C WS-AA                       
797800          ELSE                                                                
798100            PERFORM 50007460-TOTAA THRU 50007460-EXIT                         
798400            MOVE 1 TO WS-ABONO2 WS-AA.                                        
798700                                                                              
799000     IF WS-LINEA2 > 50                                                        
799300         MOVE 0 TO WS-LINEA2                                                  
799600         PERFORM 50007210-ENC-CVES THRU 50007210-EXIT.                        
799900                                                                              
800110     MOVE " "  TO WS-CVE-IDDLS.                                               
800120     IF WS-CVE-CVE > 0 AND < 9999                                             
800122        IF WS-B17-IND-ACUM-VAL(WS-CVE-CVE) = 1                                
800124           MOVE "*" TO WS-CVE-IDDLS.                                          
800130                                                                              
800200      WRITE REG-CLAVES          FROM WS-DET-CVE  BEFORE 1                     
800500      ADD   1                   TO   WS-LINEA2.                               
800800 50007430-EXIT.                                                               
801100    EXIT.                                                                     
801400                                                                              
801700******************************************************************            
802000* IMPRIMO LOS TOTALES DE CVES NO CONTABLES  P /CVE.                           
802300******************************************************************            
802600 50007435-TOTNCON.                                                            
802900   MOVE WS-NUM-NCON-500          TO WS-TOTNNC-500.                            
803200   MOVE WS-IMP-NCON-500          TO WS-TOTINC-500.                            
803500   MOVE WS-NUM-NCON-OTRO         TO WS-TOTNNC-OTRO.                           
803800   MOVE WS-IMP-NCON-OTRO         TO WS-TOTINC-OTRO.                           
804100   COMPUTE WS-NUM-NCON-500 = WS-NUM-NCON-500 - WS-NUM-NCON-OTRO               
804400   COMPUTE WS-IMP-NCON-500 = WS-IMP-NCON-500 - WS-IMP-NCON-OTRO               
804700   MOVE WS-NUM-NCON-500          TO WS-TOTNNC-DIF.                            
805000   MOVE WS-IMP-NCON-500          TO WS-TOTINC-DIF.                            
805300   WRITE REG-CLAVES              FROM WS-DET-NCOCVE BEFORE 4.                 
805600   ADD 5                         TO WS-LINEA2.                                
805900 50007435-EXIT.                                                               
806200    EXIT.                                                                     
806500                                                                              
806800******************************************************************            
807100* IMPRIMO LOS TOTALES DE ABONOS P /CVE.                                       
807400******************************************************************            
807700 50007440-TOTA.                                                               
808000   MOVE WS-NUM-SABO-500          TO WS-TOTNA-500.                             
808300   MOVE WS-IMP-SABO-500          TO WS-TOTIA-500.                             
808600   MOVE WS-NUM-SABO-OTRO         TO WS-TOTNA-OTRO.                            
808900   MOVE WS-IMP-SABO-OTRO         TO WS-TOTIA-OTRO.                            
809200   COMPUTE WS-NUM-SABO-500 = WS-NUM-SABO-500 - WS-NUM-SABO-OTRO               
809500   COMPUTE WS-IMP-SABO-500 = WS-IMP-SABO-500 - WS-IMP-SABO-OTRO               
809800   MOVE WS-NUM-SABO-500          TO WS-TOTNA-DIF.                             
810100   MOVE WS-IMP-SABO-500          TO WS-TOTIA-DIF.                             
810400   WRITE REG-CLAVES              FROM WS-DET-ABOCVE BEFORE 4.                 
810700   ADD 5                         TO WS-LINEA2.                                
811000 50007440-EXIT.                                                               
811300    EXIT.                                                                     
811600                                                                              
811900******************************************************************            
812200* IMPRIMO LOS TOTALES DE CARGOS P /CVE.                                       
812500******************************************************************            
812800 50007450-TOTC.                                                               
813100   MOVE WS-NUM-SCAR-500          TO WS-TOTNC-500.                             
813400   MOVE WS-IMP-SCAR-500          TO WS-TOTIC-500.                             
813700   MOVE WS-NUM-SCAR-OTRO         TO WS-TOTNC-OTRO.                            
814000   MOVE WS-IMP-SCAR-OTRO         TO WS-TOTIC-OTRO.                            
814300   COMPUTE WS-NUM-SCAR-500 = WS-NUM-SCAR-500 - WS-NUM-SCAR-OTRO               
814600   COMPUTE WS-IMP-SCAR-500 = WS-IMP-SCAR-500 - WS-IMP-SCAR-OTRO               
814900   MOVE WS-NUM-SCAR-500          TO WS-TOTNC-DIF.                             
815200   MOVE WS-IMP-SCAR-500          TO WS-TOTIC-DIF.                             
815500   WRITE REG-CLAVES              FROM WS-DET-CARCVE BEFORE 4.                 
815800   ADD 5                         TO WS-LINEA2.                                
816100 50007450-EXIT.                                                               
816400    EXIT.                                                                     
816700                                                                              
817000******************************************************************            
817300* IMPRIMO LOS TOTALES DE ABONOS AUTOMATICOS P /CVE.                           
817600******************************************************************            
817900 50007460-TOTAA.                                                              
818200   MOVE WS-NUM-SABO-500A         TO WS-TOTNAA-500.                            
818500   MOVE WS-IMP-SABO-500A         TO WS-TOTIAA-500.                            
818800   MOVE WS-NUM-SABO-OTROA        TO WS-TOTNAA-OTRO.                           
819100   MOVE WS-IMP-SABO-OTROA        TO WS-TOTIAA-OTRO.                           
819400   COMPUTE WS-NUM-SABO-500A = WS-NUM-SABO-500A - WS-NUM-SABO-OTROA            
819700   COMPUTE WS-IMP-SABO-500A = WS-IMP-SABO-500A - WS-IMP-SABO-OTROA            
820000   MOVE WS-NUM-SABO-500A          TO WS-TOTNAA-DIF.                           
820300   MOVE WS-IMP-SABO-500A          TO WS-TOTIAA-DIF.                           
820600   WRITE REG-CLAVES               FROM WS-DET-ABOCVEA BEFORE 4.               
820900   ADD 5                          TO WS-LINEA2.                               
821200 50007460-EXIT.                                                               
821500    EXIT.                                                                     
821800                                                                              
822100******************************************************************            
822400* IMPRIMO LOS TOTALES DE CARGOS AUTOMATICOS P /CVE.                           
822700******************************************************************            
823000 50007500-TOTCA.                                                              
823300   IF WS-NCON =   0                                                           
823600      PERFORM 50007435-TOTNCON THRU 50007435-EXIT.                            
823900   IF WS-ABONO1 = 0                                                           
824200      PERFORM 50007440-TOTA THRU 50007440-EXIT.                               
824500   IF WS-CARGO1 = 0                                                           
824800      PERFORM 50007450-TOTC THRU 50007450-EXIT.                               
825100   IF WS-ABONO2 = 0                                                           
825400      PERFORM 50007460-TOTAA THRU 50007460-EXIT.                              
825700   MOVE WS-NUM-SCAR-500A         TO WS-TOTNCA-500.                            
826000   MOVE WS-IMP-SCAR-500A         TO WS-TOTICA-500.                            
826300   MOVE WS-NUM-SCAR-OTROA        TO WS-TOTNCA-OTRO.                           
826600   MOVE WS-IMP-SCAR-OTROA        TO WS-TOTICA-OTRO.                           
826900   COMPUTE WS-NUM-SCAR-500A = WS-NUM-SCAR-500A - WS-NUM-SCAR-OTROA            
827200   COMPUTE WS-IMP-SCAR-500A = WS-IMP-SCAR-500A - WS-IMP-SCAR-OTROA            
827500   MOVE WS-NUM-SCAR-500A          TO WS-TOTNCA-DIF.                           
827800   MOVE WS-IMP-SCAR-500A          TO WS-TOTICA-DIF.                           
828100   WRITE REG-CLAVES               FROM WS-DET-CARCVEA BEFORE 4.               
828400   ADD 5                          TO WS-LINEA2.                               
828700 50007500-EXIT.                                                               
829000    EXIT.                                                                     
829300                                                                              
829600                                                                              
829900                                                                              
830200                                                                              
830500                                                                              
830800                                                                              
831100                                                                              
831400***************************************************************               
831700***************************************************************               
832000*                                                                             
832300*        R U T I N A S      C O M U N E S.                                    
832600*                                                                             
832900***************************************************************               
833200***************************************************************               
833500                                                                              
833800                                                                              
834100                                                                              
834400                                                                              
834700***************************************************************               
835000* ACCESO EL DATASET DE PRODUCTOS EN BASE AL PRD, INST Y MON.                  
835300* PARA OBTENER EL NOMBRE DEL PRODUCTO PARA LOS REPORTES.                      
835600***************************************************************               
835900 51000000-BUSCO-PRD.                                                          
836200  PERFORM 90000005-B05SXPRDINSTMON-FIND                                       
836500  IF WS-STATUS-BASE > 0                                                       
836800    IF WS-STATUS-BASE = 1                                                     
838300      MOVE WS-NUM-PRODUCTO                   TO WS-MSG-PRD                    
838600      MOVE WS-NUM-INSTRUM                    TO WS-MSG-INST                   
838900      MOVE WS-MONEDA                         TO WS-MSG-MDA                    
839200      PERFORM 51000100-DIS-PIM THRU          51000100-EXIT                    
839500      CALL SYSTEM DMTERMINATE                                                 
839800    ELSE                                                                      
840700      STRING "ERROR AL HACER FIND A B05 " ,  WS-STATUS-BASE                   
841000      DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                 
841300      PERFORM 70000050-MENSAJE                                                
841600      CALL SYSTEM DMTERMINATE.                                                
841900                                                                              
842200     MOVE B05-NOMBRE-PROD                         TO WS-NOMBRE                
842500     MOVE B05-NUM-PRODUCTO                        TO WS-PRD                   
842800     MOVE B05-NUM-INSTRUM                         TO WS-INS                   
843100     MOVE B05-MONEDA                              TO WS-MON.                  
843400 51000000-EXIT.                                                               
843700     EXIT.                                                                    
844000                                                                              
844300******************************************************************            
844600* DESPLIEGA EL PRODUCTO, INSTRUMENTO Y MONEDA DESEADO, YA SEA COMO            
844900* UN MSG. INFORMATIVO O COMO UN MSG. DE ERROR.                                
845200******************************************************************            
845500 51000100-DIS-PIM.                                                            
845600     STRING "ERROR PRD NO EXISTE EN INSTRUME"                                 
846400            " PROD-INST-MONEDA ", WS-MSG-PRD                                  
846700                             "-", WS-MSG-INST                                 
847000                             "-", WS-MSG-MDA                                  
847300            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
847600     PERFORM 70000050-MENSAJE.                                                
849400                                                                              
849700                                                                              
850000                                                                              
850300 51000100-EXIT.                                                               
850600     EXIT.                                                                    
850900                                                                              
851200*****************************************************************             
851500* GRABO EL DATASET DEPENDIENDO DE SU BANDERA.                                 
851800*****************************************************************             
852100 51001100-ACTUALIZO.                                                          
852400    PERFORM 90000000-BEGIN-TRANSACTION.                                       
852405    IF WS-BAN-B00 = 1                                                         
852410      PERFORM 90000000-B00CTRLPASO-STORE.                                     
852415      IF WS-STATUS-BASE > 0                                                   
852430         STRING "ERROR AL GRABAR B00 " ,WS-STATUS-BASE                        
852435         DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG               
852440         PERFORM 70000050-MENSAJE                                             
852445         CALL SYSTEM DMTERMINATE                                              
852450      ELSE                                                                    
852455         MOVE 0                                TO WS-BAN-B00.                 
852460                                                                              
852700    IF WS-BAN-B02 = 1                                                         
853000      PERFORM 90000002-B02CONTROL-STORE                                       
853300      IF WS-STATUS-BASE > 0                                                   
854200         STRING "ERROR AL GRABAR B02 " ,WS-STATUS-BASE                        
854500         DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG               
854800         PERFORM 70000050-MENSAJE                                             
855100         CALL SYSTEM DMTERMINATE                                              
855400      ELSE                                                                    
855700         MOVE 0                                TO WS-BAN-B02.                 
856000                                                                              
856300    IF WS-BAN-B09 = 1                                                         
856600      PERFORM 90000009-B09CIFRAS-STORE                                        
856900      IF WS-STATUS-BASE > 0                                                   
857800        STRING "ERROR AL GRABAR B09 " ,WS-STATUS-BASE                         
858100        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
858400        PERFORM 70000050-MENSAJE                                              
858700        CALL SYSTEM DMTERMINATE                                               
859000      ELSE                                                                    
859300        MOVE 0                                 TO WS-BAN-B09.                 
859600                                                                              
859900       PERFORM 90000000-END-TRANSACTIONNOAU.                                  
860200 51001100-EXIT.                                                               
860500    EXIT.                                                                     
860800                                                                              
861100****************************************************************              
861400* EL OPERADOR DECIDE QUE HACER EN CASO DE FALLAR EL LLAMADO                   
861700* QUE LE INDICA AL S151 QUE YA HA FINALIZADO EL BATCH.                        
862000****************************************************************              
862300 51001600-DECIDE.                                                             
862600    ACCEPT WS-DECIDE1                                                         
862900    IF WS-DECIDE1 = "C"                                                       
863200       MOVE 1 TO WS-CICLO1                                                    
863500       MOVE 1 TO WS-CICLO2                                                    
863800    ELSE                                                                      
864100    IF WS-DECIDE1 = "R"                                                       
864110       CANCEL "REGISTRAS500"                                                  
864115       WAIT(2)                                                                
864120       PERFORM 10000151-REGISTRA                                              
864400       MOVE 1 TO WS-CICLO2                                                    
864700    ELSE                                                                      
865600       STRING "DECISION INVALIDA " WS-DECIDE1                                 
865700              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
865900       PERFORM 70000050-MENSAJE.                                              
866200 51001600-EXIT.                                                               
866500    EXIT.                                                                     
866800                                                                              
867100                                                                              
867400                                                                              
867700                                                                              
868000****************************************************************              
868300****************************************************************              
868600*                                                                             
868900*      R U T I N A S    F I N A L E S    D E L    P R O C E S O.              
869200*                                                                             
869500****************************************************************              
869800****************************************************************              
870100                                                                              
870400                                                                              
870700                                                                              
871000                                                                              
871300****************************************************************              
871600* EJECUTA LAS RUTINAS NECESARIAS ANTES DE FINALIZAR EL PROCESO.*              
871900****************************************************************              
872200 70000000-CIERRO.                                                             
872500      PERFORM 70000050-FIN-151        THRU   70000050-EXIT.                   
872800      PERFORM 70000100-ACT-B02        THRU   70000100-EXIT.                   
872810      PERFORM 70000150-ACT-B00        THRU   70000150-EXIT.                   
872910      PERFORM 70000175-ARCH-INC       THRU   70000175-EXIT.                   
873100      PERFORM 70000200-CLOSE          THRU   70000200-EXIT.                   
873400 70000000-EXIT.                                                               
873700      EXIT.                                                                   
874000                                                                              
874300******************************************************************            
874600* ENVIA EL MENSAJE DE FIN DE BATCH AL S151.                                   
874900******************************************************************            
875200 70000050-FIN-151.                                                            
875500     MOVE 0      TO WS-CICLO1                                                 
875800     MOVE 0      TO WS-CICLO2                                                 
876100     MOVE SPACES TO WS-DECIDE1                                                
876400     PERFORM 70000060-FIN151    THRU 70000060-EXIT UNTIL                      
876700                    WS-CICLO1 = 1.                                            
877000 70000050-EXIT.                                                               
877300     EXIT.                                                                    
877600                                                                              
877900******************************************************************            
878200* ENVIA EL MENSAJE DE FIN DE BATCH AL S151.                                   
878500******************************************************************            
878800 70000060-FIN151.                                                             
879100      MOVE 0                     TO WS-CICLO2.                                
879400      MOVE 98                    TO WS-S151-0101-FUNCION-I                    
879700      MOVE WS-HORA-HMS-N         TO WS-S151-0101-HORAMOV-I                    
880000      MOVE WS-FECHA-DIA          TO WS-S151-0101-FECMOV-I                     
880300      MOVE WS-FECHA-PRO          TO WS-S151-0101-FECCONT-I                    
880600      PERFORM 40000300-CALL-FIN151  THRU 40000300-EXIT.                       
880900 70000060-EXIT.                                                               
881200     EXIT.                                                                    
881500                                                                              
881800*****************************************************************             
882100* GRABO EN B02 UN INDICADOR QUE TOMARA EN CUENTA LA PRELINEA.                 
882700*****************************************************************             
883000 70000100-ACT-B02.                                                            
883300   SET S500B02CONTROL TO BEGINNING.                                           
883600   PERFORM 90000002-B02CONTROL-LOCK                                           
883900   IF WS-STATUS-BASE > 0                                                      
884200     IF WS-STATUS-BASE = 1                                                    
885100       MOVE "ERROR REG- CONTROL VACIO "      TO WS-0101-TEXT-MSG              
885400       PERFORM 70000050-MENSAJE                                               
885700       CALL SYSTEM DMTERMINATE                                                
886000     ELSE                                                                     
886900       STRING "ERROR AL HACER LOCK A B02",   WS-STATUS-BASE                   
887200       DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG                 
887500       PERFORM 70000050-MENSAJE                                               
887800       CALL SYSTEM DMTERMINATE.                                               
888100                                                                              
888700      MOVE 7                  TO B02-STA-DISP                                 
889000      MOVE 1                  TO WS-BAN-B02                                   
889300      PERFORM 51001100-ACTUALIZO THRU  51001100-EXIT.                         
889600 70000100-EXIT.                                                               
889900    EXIT.                                                                     
890200                                                                              
890205*****************************************************************             
890210* GRABO EL PASO QUE FINALIZO EN EL REG. DE CONTROL SI TODO FUE                
890215* CORRECTO.                                                                   
890220*****************************************************************             
890225 70000150-ACT-B00.                                                            
890230   SET S500B00CTRLPASO TO BEGINNING.                                          
890235   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
890240   IF WS-STATUS-BASE > 0                                                      
890245     IF WS-STATUS-BASE = 1                                                    
890260       MOVE "ERROR REG. B00CTRLPASO VACIO "  TO WS-0101-TEXT-MSG              
890265       PERFORM 70000050-MENSAJE                                               
890270       CALL SYSTEM DMTERMINATE                                                
890275     ELSE                                                                     
890290       STRING "ERROR AL HACER LOCK A B00",   WS-STATUS-BASE                   
890295       DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG                 
890300       PERFORM 70000050-MENSAJE                                               
890305       CALL SYSTEM DMTERMINATE.                                               
890310                                                                              
890315   MOVE  170                  TO B00-NUM-PASO-01 B00-NUM-PASO-02              
890317                                 B00-NUM-PASO-03.                             
890320   MOVE  1                    TO WS-BAN-B00                                   
890325   PERFORM 51001100-ACTUALIZO THRU  51001100-EXIT.                            
890330 70000150-EXIT.                                                               
890335    EXIT.                                                                     
890340******************************************************************            
890350 50007435-GENERA-DET-INC.                                                     
890355*======================                                                       
890360 IF WS-CVE-CVE > 999 AND WS-CVE-IMP3 > 0                                      
890370    MOVE WS-CVE-CVE   TO WKS-CLAVE                                            
890380    MOVE WS-TCVE-IDIF TO WKS-IMPORTE                                          
890390    ADD  1            TO WKS-TOT-INC                                          
890400    MOVE 1            TO WKS-HAY-INC.                                         
890410                                                                              
890420*****************************************************************             
890500* ESCRIBE EN EL ARCHIVO DE INCIDENTES.                                        
890510******************************************************************            
890520 70000175-ARCH-INC.                                                           
890530*==================                                                           
890540 IF WKS-HAY-INC = 1                                                           
890550    STRING " DIFERENCIA ENCONTRADA EN LA CLAVE ", WKS-CLAVE,                  
890560           " POR UN IMPORTE ", WKS-IMPORTE                                    
890570           DELIMITED BY SIZE INTO WKS-I06-05-DATINCID                         
890575    MOVE  WKS-TOT-INC    TO   WKS-I06-05-TOTREG                               
890580    MOVE  99             TO   W77-PAR-RESULT                                  
890590    WRITE REG-INCIDENTE FROM WKS-INCID-DATOS.                                 
890600    WRITE REG-INCIDENTE FROM WKS-INCID-TRAILER.                               
890610                                                                              
890620 70000175-EXIT.                                                               
890630    EXIT.                                                                     
890800****************************************************************              
891100* CIERRO ARCHIVO Y BASE.                                                      
891400****************************************************************              
891700 70000200-CLOSE.                                                              
891800     CLOSE ARCH-INCIDENTE WITH SAVE.                                          
891900     SET MYSELF (TASKVALUE)     TO W77-PAR-RESULT.                            
892000     CLOSE FILE-CIFRAS.                                                       
892300     CLOSE FILE-CLAVES.                                                       
892600     CLOSE FILE-POSICION.                                                     
892900     CLOSE ESTADISTICAS.                                                      
893200     CLOSE TOTCVE              WITH PURGE.                                    
893500     CLOSE S500BD01CAPTACION                                                  
893800     ON EXCEPTION                                                             
894700      MOVE "ERROR AL CERRAR LA BASE "  TO WS-0101-TEXT-MSG                    
895000      PERFORM 70000050-MENSAJE                                                
895300      CALL SYSTEM DMTERMINATE.                                                
895600 70000200-EXIT.                                                               
895900    EXIT.                                                                     
896200                                                                              
896500                                                                              
896800                                                                              
897100                                                                              
897400****************************************************************              
897700****************************************************************              
898000* R U T I N A S    P A R A    E L   D E S P L I E G U E   D E                 
898300*                        M S G.                                               
898600****************************************************************              
898900****************************************************************              
899200                                                                              
899500                                                                              
899800                                                                              
900100                                                                              
900400****************************************************************              
900700* DISPLAY PARA EL LLAMADO AL S151 CUANDO HAY UN ERROR EN SU                   
901000* LIBRERIA.                                                                   
901300****************************************************************              
901600 80001000-DIS-CONS151.                                                        
902500     MOVE WS-S151-0301-RESULT        TO WS-MSG-RS                             
902800     MOVE B09-NUM-PRODUCTO           TO WS-MSG-PRD                            
903100     MOVE B09-NUM-INSTRUM            TO WS-MSG-INST                           
903400     MOVE B09-MONEDA                 TO WS-MSG-MDA                            
903700     STRING "ERROR CALL S151 TOTALES RS=" WS-MSG-RS                           
904000            " PROD=" WS-MSG-PRD "-" WS-MSG-INST "-" WS-MSG-MDA                
905800            "; TECLEE C=PARA CONTINUAR SIN CALL LIB",                         
906100            " R=PARA REINTENTAR CALL A LIB"                                   
906400            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
906700     PERFORM 70000050-MENSAJE.                                                
913600                                                                              
913900 80001000-EXIT.                                                               
914200    EXIT.                                                                     
914500                                                                              
914800****************************************************************              
915100* DISPLAY PARA EL LLAMADO AL S408 CUANDO HAY UN ERROR EN SU                   
915400* LIBRERIA.                                                                   
915700****************************************************************              
916000 80002000-DIS-CONS408.                                                        
916610     MOVE WS-S408-STATUS              TO WS-MSG-RS                            
916660     MOVE B09-NUM-PRODUCTO            TO WS-MSG-PRD                           
916710     MOVE B09-NUM-INSTRUM             TO WS-MSG-INST                          
916760     MOVE B09-MONEDA                  TO WS-MSG-MDA                           
916900     STRING "ERROR CALL S408 TOTALES RS=" WS-MSG-RS                           
917000            " PROD=" WS-MSG-PRD "-" WS-MSG-INST "-" WS-MSG-MDA                
920500            ";TECLEE C=PARA CONTINUAR SIN CALL LIB",                          
920800            " R=PARA REINTENTAR CALL A LIB"                                   
921100            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
922000     PERFORM 70000050-MENSAJE.                                                
928000                                                                              
928300 80002000-EXIT.                                                               
928600    EXIT.                                                                     
928900                                                                              
929200****************************************************************              
929500* DISPLAY PARA INDICARLE AL S151 QUE HAY UN ERROR EN SU                       
929800* LIBRERIA AL TERMINAR EL BATCH.                                              
930100****************************************************************              
930400 80003000-DIS-FINS151.                                                        
931300     MOVE WS-S151-0101-STATUS         TO WS-MSG-RS                            
931600     STRING "ERROR CALL (98) FIN AL S151 RS=" WS-MSG-RS                       
933400            "; TECLEE C=PARA CONTINUAR SIN CALL LIB",                         
933700            " R=PARA REINTENTAR CALL A LIB"                                   
934000            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
934300     PERFORM 70000050-MENSAJE.                                                
940600                                                                              
940900 80003000-EXIT.                                                               
941200    EXIT.                                                                     
941500                                                                              
941800****************************************************************              
942100* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE DE DATOS.                 
942400****************************************************************              
942700  COPY "S500/INC/PRO/25MTP002".                                               
943000                                                                              
943300****************************************************************              
