000010$SET LIST                                                                     
000310$SET LINEINFO                                                                 
000610$SET ERRORLIMIT = 1000                                                        
001210$SET BDB02R01                                                                 
001510$SET BDB03R02                                                                 
001810$SET BDB05R02                                                                 
002110$SET BDB05R07                                                                 
002410$SET BDB06R08                                                                 
002420$SET BDB36R01                                                                 
002490                                                                              
002510$SET BDB50R16                                                                 
002610                                                                              
002710$SET BDB91                                                                    
002720                                                                              
002730$SET LIBMAPLI                                                                 
002740$SET MAPLIACTLIB015                                                           
002755$SET MAPLIACTLIB020                                                           
002760$SET MAPLIACTLIB033                                                           
002765$SET MAPLIACTLIB035                                                           
002770$SET MAPLIACTLIB036                                                           
002775$SET MAPLIACTLIB041                                                           
002780$SET MAPLIACTLIB050                                                           
002785$SET MAPLIACTLIB053                                                           
002790$SET MAPLIACTLIB086                                                           
002900                                                                              
003010$SET S408LINCRED                                                              
003310$SET S006LOCSUP                                                               
003320$SET S000LIBLJ                                                                
003610$SET S080L700 S080IVA                                                         
003612$SET S080CATALOGOS S080L100                                                   
003614$SET S080DATOS                                                                
003620$SET SYSTEMLIBCOMSXATMI                                                       
003910$SET S100VERSIONES                                                            
003920$SET S016L422 S016L422R10                                                     
004210$SET S151SALDOS                                                               
004510$SET FECHA2000                                                                
004520$SET S500L040 S500L040R05                                                     
004810                                                                              
005110****************************************************************              
005410*                                                                             
005710* SISTEMA: S500 CAPTACION                                                     
006010* ARCHIVO: S500P180                                                           
006310* REPORTEADOR.                                                                
006610* VERSION: ABR/2019                                                           
006615*   SE ELIMINA LA GENERACION DE ARCHIVOS                                      
006620*   PARA DATOTECA Y GENESIS                                                   
006625*   SE PASAN SU GENERACION AL PASO P181                                       
006630*   EL ARCHIVO INVE SE GENERA EN EL P181 CLASIFICADO                          
006635*   ESTE PASO LO TOMA PARA GENERAR LOS ARCHIVOS Y LISTADOS                    
006640*                                                                             
006910*                                                                             
007210****************************************************************              
007510*       I D E N T I F I C A T I O N      D I V I S I O N.                     
007810****************************************************************              
008110 IDENTIFICATION DIVISION.                                                     
008410 PROGRAM-ID. REPORTEADOR.                                                     
008710                                                                              
009010****************************************************************              
009310*       E N V I R O N M E N T           D I V I S I O N.                      
009610****************************************************************              
009910 ENVIRONMENT DIVISION.                                                        
010210 CONFIGURATION SECTION.                                                       
010510 INPUT-OUTPUT SECTION.                                                        
010810 FILE-CONTROL.                                                                
011110                                                                              
011410****************************************************************              
011710* ARCHIVO QUE SERVIRA COMO PUENTE PARA QUE EL S151 DETECTE                    
012010* CUANDO SE LE TERMINARON DE ENVIAR LOS SALDOS.                               
012310****************************************************************              
012610     SELECT  S151FIN  ASSIGN TO DISK.                                         
012910                                                                              
012912****************************************************************              
012913* ARCHIVO QUE SERVIRA COMO PUENTE PARA QUE EL S151 DETECTE                    
012914* CUANDO SE LE TERMINARON DE ENVIAR LOS CONTRATOS DE CBII.                    
012915****************************************************************              
012916     SELECT  CBIIFIN  ASSIGN TO DISK.                                         
012917                                                                              
012920****************************************************************              
012930* ARCHIVO QUE CONTIENE LOS BLO/DESBLO DE LOS SALDOS PENDIENTES.               
012935* DE VDM.                                                                     
012940****************************************************************              
012950     SELECT BLO-PEND                                                          
012960     ASSIGN TO DISK.                                                          
012970                                                                              
012980****************************************************************              
012990* ARCHIVO QUE CONTIENE LOS BLO/DESBLO DE LOS SALDOS PENDIENTES.               
013000* DE MTY.                                                                     
013010****************************************************************              
013020     SELECT BLO-PEND1                                                         
013030     ASSIGN TO DISK.                                                          
013040                                                                              
013041*R4-COPIAS-2011 SE AGREGA MANEJO DEL 3er ARCHIVO BPEND (P105) -YCY            
013042****************************************************************              
013043* ARCHIVO QUE CONTIENE LOS BLO/DESBLO DE LOS SALDOS PENDIENTES.               
013044* DE LA TERCERA COPIA.                                                        
013045****************************************************************              
013046     SELECT BLO-PEND3                                                         
013047     ASSIGN TO DISK.                                                          
013048                                                                              
013050****************************************************************              
013055* ARCHIVO QUE CONTIENE LOS BLO/DESBLO DE LOS SALDOS PENDIENTES.               
013060* DE LOS ARCHIVOS DE LA COPIA01 Y LA COPIA02.                                 
013065****************************************************************              
013070     SELECT BLO-PEND2                                                         
013075     ASSIGN TO DISK.                                                          
013080                                                                              
013210****************************************************************              
013510* ARCHIVO DE SALDOS ENVIADO AL S151 CON MOVS DE CTAMAE Y CHEQUES.             
013810****************************************************************              
014110     SELECT S151SALDOS                                                        
014410           ASSIGN  TO DISK.                                                   
014710                                                                              
015010****************************************************************              
015310* ARCHIVO DE SALDOS P/SUCURSAL PARA TARJETAS DE CTAM.                         
015610****************************************************************              
015910     SELECT  SALDOSTB  ASSIGN TO DISK.                                        
016210                                                                              
016510****************************************************************              
016810* ARCHIVO DE SALDOS P/SUCURSAL PARA TARJETAS DE CHEQUES.                      
017110****************************************************************              
017410     SELECT  SALDOSTBT ASSIGN TO DISK.                                        
017710                                                                              
017720****************************************************************              
017730*  ARCHIVO DE IMPRESION DE BLOQUEOS DE SALDOS PENDIENTES.                     
017740****************************************************************              
017750     SELECT FILE-BPENDIENTE                                                   
017760            ASSIGN TO PRINTER.                                                
017770                                                                              
018010****************************************************************              
018310*  ARCHIVO DE IMPRESION DE SDO. DISPONIBLE P/CONTRATO.                        
018610****************************************************************              
018910     SELECT FILE-DISPONIBLE                                                   
019210            ASSIGN TO PRINTER.                                                
019510                                                                              
019810****************************************************************              
020110*       ARCHIVO DE IMPRESION DE INVERSIONES DE AHORROS.                       
020410****************************************************************              
020710     SELECT FILE-INVEN                                                        
021010            ASSIGN TO PRINTER.                                                
021310                                                                              
021320****************************************************************              
021330*       ARCHIVO DE IMPRESION DEL LISTADO DE COMISIONES POR TEF.               
021340****************************************************************              
021350     SELECT FILE-TEF                                                          
021360            ASSIGN TO PRINTER.                                                
021370                                                                              
021610****************************************************************              
021910* ARCHIVO DE INVERSIONES CLASIFICADO NODO,SUC,PRD,INS,MON,CTO                 
022210****************************************************************              
022510     SELECT INVE-PTE                                                          
022810           ASSIGN  TO      DISK.                                              
023110                                                                              
023120****************************************************************              
023125* DECLARACION DEL ARCHIVO QUE SE VA A UTILIZAR PARA SORTEAR LOS               
023130* BLOQUEOS DE SALDOS PENDIENTES.                                              
023135****************************************************************              
023140     SELECT BPE-SORT                                                          
023145     ASSIGN TO SORT DISK.                                                     
023150                                                                              
023410****************************************************************              
023710*                D A T A          D I V I S I O N.                            
024010****************************************************************              
024310 DATA DIVISION.                                                               
024610                                                                              
024910****************************************************************              
025210* F I L E   S E C T I O N.                                                    
025510****************************************************************              
025810 FILE SECTION.                                                                
026110                                                                              
026120****************************************************************              
026125* DECLARACION DEL ARCHIVO QUE CONTIENE LOS BLO. DE SDOS/PEND. COP1            
026130****************************************************************              
026135 FD  BLO-PEND                                                                 
026140     BLOCK     CONTAINS 30  RECORDS                                           
026145     RECORD    CONTAINS 78  CHARACTERS                                        
026150     VALUE OF TITLE IS WS-ETIQ-BLOPEND.                                       
026155                                                                              
026160 01  REG-BLOPEND           PIC X(78).                                         
026170                                                                              
026180****************************************************************              
026185* DECLARACION DEL ARCHIVO QUE CONTIENE LOS BLO. DE SDOS/PEND. COP2            
026190****************************************************************              
026195 FD  BLO-PEND1                                                                
026200     BLOCK     CONTAINS 30  RECORDS                                           
026205     RECORD    CONTAINS 78  CHARACTERS                                        
026210     VALUE OF TITLE IS WS-ETIQ-BLOPEND1.                                      
026215                                                                              
026220 01  REG-BLOPEND1          PIC X(78).                                         
026225                                                                              
026226****************************************************************              
026227* DECLARACION DEL ARCHIVO QUE CONTIENE LOS BLO. DE SDOS/PEND. COP3            
026228****************************************************************              
026229 FD  BLO-PEND3                                                                
026230     BLOCK     CONTAINS 30  RECORDS                                           
026231     RECORD    CONTAINS 78  CHARACTERS                                        
026232     VALUE OF TITLE IS WS-ETIQ-BLOPEND3.                                      
026233                                                                              
026234 01  REG-BLOPEND4          PIC X(78).                                         
026235                                                                              
026236****************************************************************              
026237* DECLARACION DEL ARCHIVO QUE CONTIENE LOS ARC.DE SDOPEND UNIDOS.             
026240****************************************************************              
026245 FD  BLO-PEND2                                                                
026250     BLOCK     CONTAINS 180 RECORDS                                           
026255     RECORD    CONTAINS 78  CHARACTERS                                        
026260     VALUE OF TITLE IS WS-ETIQ-BLOPEND2.                                      
026265                                                                              
026270 01  REG-BLOPEND2.                                                            
026275    02 BPE2-SUCPRO         PIC 9(04).                                         
026280    02 BPE2-CVE            PIC 9(04).                                         
026285    02 BPE2-CTO            PIC 9(12).                                         
026290    02 BPE2-IMP            PIC 9(14)V99.                                      
026295    02 BPE2-PRD            PIC 9(04).                                         
026300    02 BPE2-INS            PIC 9(04).                                         
026305    02 BPE2-MON            PIC 9(03).                                         
026310    02 BPE2-SUCTRA         PIC 9(04).                                         
026315    02 BPE2-CAJA           PIC 9(02).                                         
026320    02 BPE2-AUT            PIC 9(08).                                         
026325    02 BPE2-NOM            PIC 9(08).                                         
026330    02 BPE2-HORA           PIC 9(06).                                         
026335    02 FILLER              PIC X(03).                                         
026410****************************************************************              
026710* DECLARACION DEL ARCHIVO PUENTE QUE SERVIRA PARA INDICAR AL S151             
027010* YA TA TERMINAMOS DE ENVIARLES LOS SALDOS.                                   
027310****************************************************************              
027610 FD S151FIN                                                                   
027910      VALUE OF TITLE IS WS-ETIQ-S151FIN.                                      
028210                                                                              
028510 01 REG-S151FIN.                                                              
028810    02  S151FIN-SISTEMA         PIC X(04).                                    
029110    02  S151FIN-FECPRO          PIC 9(08).                                    
029410    02  S151FIN-FECDIA          PIC 9(08).                                    
029710                                                                              
029720****************************************************************              
029730* DECLARACION DEL ARCHIVO PUENTE QUE SERVIRA PARA INDICAR AL S151             
029740* QUE YA TERMINAMOS DE ENVIARLES LOS CONTRATOS DE CBII.                       
029750****************************************************************              
029760 FD CBIIFIN                                                                   
029770      VALUE OF TITLE IS WS-ETIQ-CBIIFIN.                                      
029780                                                                              
029790 01 REG-CBIIFIN.                                                              
029800    02  CBIIFIN-SISTEMA         PIC X(04).                                    
029810    02  CBIIFIN-FECPRO          PIC 9(08).                                    
029820    02  CBIIFIN-FECDIA          PIC 9(08).                                    
029830                                                                              
030010****************************************************************              
030310* DESCRIPCION DEL ARCHIVO DE SALDOS QUE SE ENVIA AL S151 DE CTAMAE            
030610* Y CHEQUES.                                                                  
030910****************************************************************              
031210 FD S151SALDOS                                                                
031510     RECORD CONTAINS 90 CHARACTERS                                            
031810     VALUE OF TITLE IS WS-ETIQ-SDO151.                                        
032110                                                                              
032410 01 REG-S151SALDOS         PIC X(90).                                         
032710                                                                              
033010****************************************************************              
033310* ARCHIVO DE SALDOS P/SUCURSAL PARA TANDEM.                                   
033610****************************************************************              
033910 FD SALDOSTB                                                                  
034210     RECORD CONTAINS 90 CHARACTERS                                            
034510     BLOCK  CONTAINS 180 RECORDS                                              
034810     VALUE OF                                                                 
034815            AREAS 15000                                                       
034820            AREASIZE 3600                                                     
034822            SECURITYTYPE IS PUBLIC                                            
034825            TITLE IS WS-ETIQ-SDOTB.                                           
035110                                                                              
035410 01 REG-SALDOSTB            PIC X(90).                                        
035710                                                                              
036010****************************************************************              
036310* ARCHIVO TEMPORAL DE SALDOS P/SUCURSAL PARA TANDEM.                          
036610****************************************************************              
036910 FD SALDOSTBT                                                                 
037210     RECORD CONTAINS 90 CHARACTERS                                            
037510     BLOCK  CONTAINS 180 RECORDS                                              
037810     VALUE OF                                                                 
037815           AREAS 15000                                                        
037820           AREASIZE 3600                                                      
037825           SECURITYTYPE IS PUBLIC                                             
037830           TITLE IS WS-ETIQ-SDOTBT.                                           
038110                                                                              
038410 01 REG-SALDOSTBT           PIC X(90).                                        
038412                                                                              
038500****************************************************************              
038685                                                                              
038800****************************************************************              
038950                                                                              
039010****************************************************************              
039310*  ARCHIVO DE IMPRESION DE SDO. DISPONIBLE P/CONTRATO.                        
039610****************************************************************              
039910 FD FILE-DISPONIBLE                                                           
040210    VALUE OF TITLE IS WS-ETIQ-DISPO.                                          
040510                                                                              
040810 01 REG-DISPONIBLE    PIC X(132).                                             
041110                                                                              
041115****************************************************************              
041120*  ARCHIVO DE IMPRESION DE SALDOS PENDIENTES BLOQUEADOS.                      
041125****************************************************************              
041130 FD FILE-BPENDIENTE                                                           
041135    VALUE OF TITLE IS WS-ETIQ-BPENDIENTE.                                     
041140                                                                              
041145 01 REG-BPENDIENTE    PIC X(132).                                             
041150                                                                              
041410****************************************************************              
041710* ARCHIVO DE IMPRESION DEL INVENTARIO DE LAS INVER. DE AHORROS.               
042010****************************************************************              
042310 FD FILE-INVEN                                                                
042610    VALUE OF TITLE IS WS-ETIQ-INVEN.                                          
042910                                                                              
043210 01 REG-INVEN         PIC X(132).                                             
043510                                                                              
043520****************************************************************              
043530* ARCHIVO DE IMPRESION DE LAS COMISIONES POR GRUPO DE TEF.                    
043540****************************************************************              
043550 FD FILE-TEF                                                                  
043560    VALUE OF TITLE IS WS-ETIQ-TEF.                                            
043570                                                                              
043580 01 REG-TEF           PIC X(132).                                             
043590                                                                              
043810****************************************************************              
044110* ARCHIVO DONDE SERA SORTEADO EL DATASET DE INVERSIONES                       
044410* PARA ORDENARLO POR NODO,SUCURSAL,PRD,INS Y MONEDA.                          
044710****************************************************************              
045010 FD INVE-PTE                                                                  
045012    RECORD    CONTAINS 360 CHARACTERS                                         
045014    BLOCK     CONTAINS 180 RECORDS                                            
045110    VALUE OF                                                                  
045115              AREAS    15000                                                  
045120              AREASIZE 3600                                                   
045125              SECURITYTYPE IS PUBLIC                                          
045130              TITLE IS WS-ETIQ-INVEPTE.                                       
045210                                                                              
045310 01 INVERSION-REG.                                                            
045312    03 INV-NODO-S            PIC  9(02)              COMP.                    
045314    03 INV-SUCURSAL-S        PIC  9(04)              COMP.                    
045610    03 INV-PRODUCTO-S        PIC  9(04)              COMP.                    
045910    03 INV-INSTRUMENTO-S     PIC  9(04)              COMP.                    
046210    03 INV-MONEDA-S          PIC  9(02)              COMP.                    
046810    03 INV-CONTRATO-S        PIC  9(12)              COMP.                    
047110    03 INV-NUMCTE-S          PIC  9(12)              COMP.                    
047410    03 INV-SDOANT-S          PIC S9(13)V99           COMP.                    
047710    03 INV-SDOACT-S          PIC S9(13)V99           COMP.                    
047712    03 INV-SDOBLO-S          PIC  9(12)V99           COMP.                    
048010    03 INV-SDOPEN-S          PIC  9(12)V99           COMP.                    
048020    03 INV-SDOPROMMES-S      PIC  9(12)V99           COMP.                    
048030    03 INV-SDOPROMANO-S      PIC  9(12)V99           COMP.                    
048035    03 INV-SDOFINCORCIC-S    PIC  9(12)V99           COMP.                    
048040    03 INV-IMPUESRET-S       PIC  9(12)V99           COMP.                    
048050    03 INV-INTANO-S          PIC  9(12)V99           COMP.                    
048060    03 INV-INTMES-S          PIC  9(12)V99           COMP.                    
048310    03 INV-AUTPEN-S          PIC  9(12)V99           COMP.                    
048610    03 INV-TIPOPER-S         PIC  9(02)              COMP.                    
048910    03 INV-FECULACT-S        PIC  9(08)              COMP.                    
048920    03 INV-FECCAN-S          PIC  9(08)              COMP.                    
048930    03 INV-FECAPE-S          PIC  9(08)              COMP.                    
048940    03 INV-FECCORANT-S       PIC  9(08)              COMP.                    
048950    03 INV-FECCORTE-S        PIC  9(08)              COMP.                    
049210    03 INV-STATUS-S          PIC  9(01)              COMP.                    
049215    88 INV-88-STA-VIG        VALUE 0, 1, 5.                                   
049217    88 INV-88-STA-CANC       VALUE 2, 3, 4.                                   
049810    03 INV-COMPEN-S          PIC  9(01)              COMP.                    
050110    03 INV-TASAANT-S         PIC  9(04)V9(03)        COMP.                    
050130    03 INV-TASABRUT-S        PIC  9(04)V9(03)        COMP.                    
050150    03 INV-DIASCIC-S         PIC  9(02)              COMP.                    
050410    03 INV-NOMBRE-S          PIC  X(30).                                      
051310    03 INV-BANTAR-S          PIC  9(01)              COMP.                    
051320    03 INV-INDHOY-CORTO-S    PIC  9(01)              COMP.                    
051322    03 INV-SDO-PROT-S        PIC  9(12)V99           COMP.                    
051324    03 INV-IND-TIPOBLO-S     PIC  9(02)              COMP.                    
051326    03 INV-SDOPROMFINAN-S    PIC  9(12)V99           COMP.                    
051328    03 INV-INTERCOMPANY-S    PIC  9(05)              COMP.                    
051340    03 INV-IND-IMPEDOCTA     PIC  9(01)              COMP.                    
051342    03 INV-LINEACRE-S        PIC  9(01)              COMP.                    
051344    03 INV-STA-BENEF-S       PIC 9(01)               COMP.                    
051346    03 INV-FEC-BENEF-S       PIC 9(08)               COMP.                    
051348    03 INV-FEC-XCTE-S        PIC 9(08)               COMP.                    
051350    03 INV-FECULMOV-S        PIC 9(08)               COMP.                    
051352    03 INV-SECTOR-S          PIC 9(02)               COMP.                    
051452    03 INV-PCOBP-PEND-S      PIC 9(12)V99            COMP.                    
051502    03 INV-NIVEL-S           PIC 9(03)               COMP.                    
051512    03 INV-NUM-GPOSOC-S      PIC 9(04)               COMP.                    
051522    03 INV-SDOMES-SM-S       PIC 9(01)               COMP.                    
051532    03 INV-ESQ-TARIFA-S      PIC 9(01)               COMP.                    
051552                                                                              
051560    03 INV-ESQREND-S         PIC 9(01)               COMP.                    
051562    03 INV-SEGREND-S         PIC 9(02)               COMP.                    
051564    03 INV-FECREND-S         PIC 9(08)               COMP.                    
051566                                                                              
051568    03 INV-IMPSOLBLOQ-S      PIC 9(12)V99            COMP.                    
051569                                                                              
051570    03 INV-CTACONCENT-S      PIC 9(02)               COMP.                    
051571    88 INV-88-SBCTA-TES      VALUE 62,63.                                     
051572    03 INV-DIACORTE-S        PIC 9(02)               COMP.                    
051574    03 INV-SDOAOANT-S        PIC 9(14)V99            COMP.                    
051576    03 INV-SDOARANT-S        PIC 9(14)V99            COMP.                    
051578    03 INV-SDODAANT-S        PIC 9(14)V99            COMP.                    
051580    03 INV-SDOFINCORTES-S      PIC 9(14)V99            COMP.                  
051582    03 INV-SDOTRANT-S        PIC 9(14)V99            COMP.                    
051584    03 INV-SDOTAANT-S        PIC 9(14)V99            COMP.                    
051586    03 INV-SDOAOACT-S        PIC 9(14)V99            COMP.                    
051588    03 INV-SDOARACT-S        PIC 9(14)V99            COMP.                    
051590    03 INV-SDODAACT-S        PIC 9(14)V99            COMP.                    
051592    03 INV-SDOTRACT-S        PIC 9(14)V99            COMP.                    
051594    03 INV-SDOTAACT-S        PIC 9(14)V99            COMP.                    
051596    03 INV-IMPSOLBLO-S       PIC 9(14)V99            COMP.                    
051598    03 INV-INDRESET-S        PIC 9(02)               COMP.                    
051599    03 INV-CONTCTRLB03-S     PIC 9(12)               COMP.                    
051600    03 INV-CONTCTRLB50-S     PIC 9(12)               COMP.                    
051602    03 INV-SUBNODO-S         PIC 9(02)               COMP.                    
051604    03 INV-INDB05-S          PIC 9(02)               COMP.                    
051605    03 INV-FECH-DEPNOM-S     PIC 9(08)               COMP.                    
051606    03 INV-MODVALI-S         PIC 9(03)               COMP.                    
051607    03 INV-REF-NUM-MIN-S     PIC 9(02)               COMP.                    
051608    03 INV-REF-NUM-MAX-S     PIC 9(02)               COMP.                    
051609    03 INV-IND-2DAREF-S      PIC 9(03)               COMP.                    
051610    03 INV-REF-ALF-MAX-S     PIC 9(02)               COMP.                    
051611    03 INV-REF-ALF-MIN-S     PIC 9(02)               COMP.                    
051612    03 INV-VALREF-INTB-S     PIC 9(02)               COMP.                    
051613    03 FILLER                PIC X(19).                                       
051620****************************************************************              
051630* CAMPOS DEL ARCHIVO QUE SORTEARA LOS SDOS.PEND. BLOQUEADOS.                  
051635****************************************************************              
051640 SD BPE-SORT                                                                  
051642    BLOCK     CONTAINS 180 RECORDS                                            
051643    RECORD    CONTAINS 78  CHARACTERS.                                        
051645  01 REG-BPESORT.                                                             
051650    02 BPESUC-SORT         PIC 9(04).                                         
051655    02 BPECVE-SORT         PIC 9(04).                                         
051660    02 BPECTO-SORT         PIC 9(12).                                         
051670    02 FILLER              PIC X(58).                                         
051680                                                                              
051910****************************************************************              
052210*           D A T A       B A S E      S E C T I O N.                         
052510****************************************************************              
052810 DATA-BASE SECTION.                                                           
053110 DB S500BD01CAPTACION.                                                        
053410 01 S500B02CONTROL.                                                           
053710 01 S500B03CONTRATOS.                                                         
054010 01 S500B05INSTRUMEN.                                                         
054310 01 S500B06HISTORICO.                                                         
054320 01 S500B36GRUPOCOM.                                                          
054400 01 S500B50LIGASTESO.                                                         
054610 01 S500B91REINICIO.                                                          
054910                                                                              
055210****************************************************************              
055510*           W O R K I N G           S T O R A G E.                            
055810****************************************************************              
056110 WORKING-STORAGE SECTION.                                                     
056120 77  WS-PRD-ANT             PIC  9(04).                                       
056130 77  WS-INS-ANT             PIC  9(04).                                       
056140 77  WS-MON-ANT             PIC  9(04).                                       
056150 77  WS-GPO-ANT             PIC  9(04).                                       
056160 77  WS-I                   PIC  9(02).                                       
056170 77  WS-I1                  PIC  9(02).                                       
056180 77  WS-I2                  PIC  9(02).                                       
056190 77  WS-I3                  PIC  9(02).                                       
056200 77  WS-I4                  PIC  9(02).                                       
056210 77  WS-I5                  PIC  9(02).                                       
056220 77  WS-R                   PIC  9     VALUE 0.                               
056230 77  WS-T                   PIC  9     VALUE 0.                               
056240 77  WS-36                  PIC  9     VALUE 0.                               
056250 77  WS-CHER                PIC  9(04) VALUE 0.                               
056260 77  WS-CHET                PIC  9(04) VALUE 0.                               
056270 77  WS-TARR                PIC  9(04) VALUE 0.                               
056280 77  WS-TART                PIC  9(04) VALUE 0.                               
056290 77  WS-AMBR                PIC  9(04) VALUE 0.                               
056300 77  WS-AMBT                PIC  9(04) VALUE 0.                               
056410 77  WS-CONTS151            PIC  9(10).                                       
056710 77  WS-DIAS-ANO            PIC  9(06).                                       
056720 77  WS-B06-FECREAL-CORTE   PIC  9(08).                                       
056730 77  WS-B06-SDOPROM-FINAN   PIC  9(14)V99.                                    
057010 77  WS-SDO-PROMANUAL       PIC  S9(14)V99.                                   
057310 77  WS-TASA-RENDANUAL      PIC  9(04)V9(03).                                 
057320 77  WS-SDODIS-151          PIC  S9(14)V99.                                   
057330 77  WS-RSLT-TRANSIT        PIC S9(11).                                       
057610 77  WS-DIAS-CICLO          PIC  9(08).                                       
057910 77  WS-FECHA-INICIO        PIC  9(08).                                       
058210 77  WS-REG-TANDEMCM        PIC  9(08) COMP.                                  
058510 77  WS-REG-TANDEMCMDL      PIC  9(08) COMP.                                  
058810 77  WS-REG-TANDEMCH        PIC  9(08) COMP.                                  
059110 77  WS-REG-TANDEMCHDL      PIC  9(08) COMP.                                  
059410 77  WS-CSIMON              PIC  9(02) COMP.                                  
059710 77  WS-IMP-TANDEMCM        PIC S9(12)V99.                                    
060010 77  WS-IMP-TANDEMCMDL      PIC S9(12)V99.                                    
060310 77  WS-IMP-TANDEMCH        PIC S9(12)V99.                                    
060610 77  WS-IMP-TANDEMCHDL      PIC S9(12)V99.                                    
060910 77  WS-IMP-CALSDO          PIC S9(12)V99.                                    
061210 77  WS-IMP-CALAUT          PIC S9(12)V99.                                    
061510 77  WS-SORT-ESPACIO        PIC 9(11).                                        
061810 77  WS-SORT-ESPACIO1       PIC 9(11).                                        
062110 77  WS-TIPCAM              PIC 9(04)V9(04).                                  
062120 77  W77-MEMSIZE         PIC 9(08)   COMP.                                    
062130 77  W77-MEMSIZE1        PIC 9(08)   COMP.                                    
062410 77  WS-NODO                PIC 9(02).                                        
062710 77  WS-NODO1               PIC 9(02).                                        
063010 77  WS-NODO2               PIC 9(02).                                        
063310 77  WS-NODO3               PIC 9(02).                                        
063610 77  WS-SDO-TOTAL           PIC 9(12)V99 COMP.                                
063910*77  WS-VAL-FEC             PIC 9(08).                                        
063920 77  W77-QUE-AMBIENTE       PIC 9.                                            
063930 88  W88-ES-PRODUCCION      VALUE 1.                                          
063940 88  W88-ES-UAT             VALUE 2.                                          
063950 88  W88-ES-DESARROLLO      VALUE 3.                                          
064210 77  WS-1VEZ                PIC 9.                                            
064510 77  WS-2VEZ                PIC 9.                                            
064810 77  WS-3VEZ                PIC 9.                                            
065110 77  WS-4VEZ                PIC 9.                                            
065410 77  WS-5VEZ                PIC 9.                                            
065710 77  WS-6VEZ                PIC 9.                                            
066010 77  WS-7VEZ                PIC 9.                                            
066310 77  WS-8VEZ                PIC 9.                                            
066610 77  WS-9VEZ                PIC 9.                                            
066910 77  WS-10VEZ               PIC 9.                                            
067210 77  WS-11VEZ               PIC 9.                                            
067510 77  WS-12VEZ               PIC 9.                                            
067810 77  WS-13VEZ               PIC 9.                                            
068110 77  WS-14VEZ               PIC 9.                                            
068410 77  WS-15VEZ               PIC 9.                                            
068710 77  WS-16VEZ               PIC 9.                                            
069010 77  WS-17VEZ               PIC 9.                                            
069310 77  WS-18VEZ               PIC 9.                                            
069610 77  WS-19VEZ               PIC 9.                                            
069910 77  WS-20VEZ               PIC 9.                                            
070210 77  WS-CONTA               PIC 9(02) VALUE 0.                                
070510 77  WS-HOJA                PIC 9(05).                                        
070810 77  WS-HOJA1               PIC 9(05).                                        
071110 77  WS-HOJA2               PIC 9(05).                                        
071410 77  WS-HOJA3               PIC 9(05).                                        
071710 77  WS-HOJA4               PIC 9(05).                                        
071720 77  WS-HOJA5               PIC 9(05).                                        
071730 77  WS-HOJA6               PIC 9(05).                                        
072010 77  WS-LINEA               PIC 9(02).                                        
072310 77  WS-LINEA1              PIC 9(02).                                        
072610 77  WS-LINEA2              PIC 9(02).                                        
072910 77  WS-LINEA3              PIC 9(02).                                        
073210 77  WS-LINEA4              PIC 9(02).                                        
073220 77  WS-LINEA5              PIC 9(02).                                        
073230 77  WS-LINEA6              PIC 9(02).                                        
073510 77  WS-TIPOPER             PIC 9(02).                                        
073810 77  WS-NOM-CTE             PIC X(30).                                        
074110 77  WS-CONTADOR            PIC 9 VALUE 0.                                    
074410 77  WS-CONTADOR1           PIC 9 VALUE 0.                                    
074710 77  WS-CNODO               PIC 9(04) VALUE 0.                                
075010 77  WS-CNODO1              PIC 9(04) VALUE 0.                                
075310 77  WS-CNODO2              PIC 9(04) VALUE 0.                                
075320 77  WS-NOMSUC1             PIC X(20) VALUE SPACES.                           
075610 77  WS-SEMANAL             PIC 9.                                            
075910 77  WS-DIARIO              PIC 9.                                            
076210 77  WS-MENSUAL             PIC 9.                                            
076510 77  WS-QUINCENAL           PIC 9.                                            
076810 77  WS-AHORROS             PIC 9.                                            
077110 77  WS-LLAVE-SDOTB         PIC 9(08) VALUE 1.                                
077410 77  WS-LLAVE-SDOTBT        PIC 9(08) VALUE 1.                                
077710 77  WS-SUCANT              PIC 9(04).                                        
077720 77  WS-SUCANT1             PIC 9(04).                                        
078010 77  WS-AHO-SUCANT          PIC 9(04).                                        
078310 77  WS-151-SUCANT          PIC 9(04).                                        
078610 77  WS-AHO-PRDANT          PIC 9(04).                                        
078910 77  WS-151-PRDANT          PIC 9(04).                                        
079210 77  WS-AHO-INSANT          PIC 9(04).                                        
079510 77  WS-151-INSANT          PIC 9(04).                                        
079810 77  WS-AHO-MONANT          PIC 9(03).                                        
080110 77  WS-151-MONANT          PIC 9(03).                                        
080410 77  WS-AHO-NODOANT         PIC 9(02).                                        
080710 77  WS-NODOANT             PIC 9(02).                                        
081010 77  WS-PRDANT              PIC 9(04).                                        
081310 77  WS-INSANT              PIC 9(04).                                        
081610 77  WS-MONANT              PIC 9(03).                                        
081910 77  WS-FIN                 PIC 9 VALUE 0.                                    
082210 77  WS-FIN1                PIC 9 VALUE 0.                                    
082510 77  WS-FIN2                PIC 9 VALUE 0.                                    
082810 77  WS-FIN3                PIC 9 VALUE 0.                                    
083110 77  WS-FIN4                PIC 9 VALUE 0.                                    
083410 77  WS-FIN5                PIC 9 VALUE 0.                                    
083710 77  WS-LEOMAE              PIC 9 VALUE 0.                                    
084010 77  WS-LEOAHO              PIC 9 VALUE 0.                                    
084310 77  WS-UNNODO              PIC 9 VALUE 0.                                    
084610 77  WS-CONT-S151           PIC 9(06)     COMP VALUE 0.                       
084910 77  WS-CONT-CTES           PIC 9(06)     COMP VALUE 0.                       
085210 77  WS-CONT-CTES1          PIC 9(06)     COMP VALUE 0.                       
085510 77  WS-SUM-SDOACT          PIC S9(14)V99 COMP VALUE 0.                       
085810 77  WS-CAL-SDOACT          PIC 9(14)V99  COMP VALUE 0.                       
086110 77  WS-SUM-SDODIS          PIC S9(14)V99 COMP VALUE 0.                       
086410 77  WS-SDODISP-408         PIC S9(14)V99 COMP VALUE 0.                       
086710 77  WS-SALDO-S151          PIC 9(14)V99  COMP VALUE 0.                       
087010 77  WS-SUC-SDOACT-S151CM   PIC 9(14)V99  COMP VALUE 0.                       
087310 77  WS-SUC-SDOACT-S151CMD  PIC 9(14)V99  COMP VALUE 0.                       
087610 77  WS-SUC-SDOACT-S151MN   PIC 9(14)V99  COMP VALUE 0.                       
087910 77  WS-SUC-SDOACT-S151DL   PIC 9(14)V99  COMP VALUE 0.                       
088210 77  WS-SUC-SDOANT-S151CM   PIC 9(14)V99  COMP VALUE 0.                       
088510 77  WS-SUC-SDOANT-S151CMD  PIC 9(14)V99  COMP VALUE 0.                       
088810 77  WS-SUC-SDOANT-S151MN   PIC 9(14)V99  COMP VALUE 0.                       
089110 77  WS-SUC-SDOANT-S151DL   PIC 9(14)V99  COMP VALUE 0.                       
089410 77  WS-TOT-SDOACT-S151CM   PIC 9(14)V99  COMP VALUE 0.                       
089710 77  WS-TOT-SDOACT-S151CMD  PIC 9(14)V99  COMP VALUE 0.                       
090010 77  WS-TOT-SDOACT-S151MN   PIC 9(14)V99  COMP VALUE 0.                       
090310 77  WS-TOT-SDOACT-S151DL   PIC 9(14)V99  COMP VALUE 0.                       
090610 77  WS-TOT-SDOANT-S151CM   PIC 9(14)V99  COMP VALUE 0.                       
090910 77  WS-TOT-SDOANT-S151CMD  PIC 9(14)V99  COMP VALUE 0.                       
091210 77  WS-TOT-SDOANT-S151MN   PIC 9(14)V99  COMP VALUE 0.                       
091510 77  WS-TOT-SDOANT-S151DL   PIC 9(14)V99  COMP VALUE 0.                       
091810 77  WS-COM                 PIC 9(02).                                        
092110 77  WS-COM1                PIC 9(02).                                        
092410 77  WS-COM2                PIC 9(02).                                        
092710 77  WS-C1                  PIC 9(02).                                        
093010 77  WS-C2                  PIC 9(02).                                        
093310 77  WS-C3                  PIC 9(02).                                        
093610 77  WS-C4                  PIC 9(02).                                        
093910 77  WS-C5                  PIC 9(02).                                        
094210 77  WS-C6                  PIC 9(02).                                        
094510 77  WS-C7                  PIC 9(02).                                        
094810 77  WS-C8                  PIC 9(02).                                        
095110 77  WS-C9                  PIC 9(02).                                        
095120 77  WS-BAN-VACIO           PIC 9.                                            
095410 77  WS-TABLA               PIC 9.                                            
095415 77  WS-INSTRUMENTOS-CBII   PIC 9.                                            
095420 77  WS-NUMREG-CHE          PIC 9(10).                                        
095425 77  W77-NUMREG-CHQ-AD      PIC 9(10).                                        
095430 77  WS-NUMREG-CMA          PIC 9(10).                                        
095431 77  W77-NUMREG-CMA-AD      PIC 9(10).                                        
095432 77  WS-FALLA-S151          PIC 9(10).                                        
095435*****************************************************************             
095440* CAMPOS UTILIZADOS PARA LA MAPLI.                                            
095445*****************************************************************             
095450 77 WS-NUM-DSET              PIC 9(04)    COMP.                               
095455 77 WS-NUM-ACT01             PIC 9(04)    COMP.                               
095460 77 WS-NUM-ACT02             PIC 9(04)    COMP.                               
095465 77 WS-NUM-ACT03             PIC 9(04)    COMP.                               
095470 77 WS-NUM-ACT04             PIC 9(04)    COMP.                               
095475 77 WS-NUM-ACT05             PIC 9(04)    COMP.                               
095480 77 WS-NUM-ACT06             PIC 9(04)    COMP.                               
095485 77 WS-NUM-ACT07             PIC 9(04)    COMP.                               
095490 77 WS-NUM-ACT08             PIC 9(04)    COMP.                               
095495 77 WS-NUM-ACT09             PIC 9(04)    COMP.                               
095500 77 WS-NUM-ACT10             PIC 9(04)    COMP.                               
095501 77 WS-NUM-ACT11             PIC 9(04)    COMP.                               
095505                                                                              
095510 77 WS-LASTRECORDM              PIC 9(10).                                    
095515 77 WS-LASTRECORDM1             PIC 9(10).                                    
095520 77 WS-LASTRECORDM2             PIC 9(10).                                    
095525 77 WS-LASTRECORDM3             PIC 9(10).                                    
095530 77 WS-LASTRECORDM4             PIC 9(10).                                    
095535 77 WS-LASTRECORDM5             PIC 9(10).                                    
095540 77 WS-LASTRECORDM6             PIC 9(10).                                    
095545 77 WS-LASTRECORDM8             PIC 9(10).                                    
095610                                                                              
095620 01 WS-TASKVALUE       PIC 9(09).                                             
095640 01 WS-TASKVALUE-RD    REDEFINES WS-TASKVALUE.                                
095660    02 WS-VAL-FEC      PIC 9(08).                                             
095680    02 WS-SIN-S408     PIC 9(01).                                             
095710                                                                              
095720******************************************************************            
095730* DECLARACION DEL FORMATO PARA EL ARCHIVO DE SALDO PENDIENTE.                 
095740******************************************************************            
095750 01 REG-BLOPEND3.                                                             
095760  02 BPE-TREG              PIC 9(02).                                         
095765  02 BPE-HEADER.                                                              
095770    03 BPE-FECHA           PIC 9(08).                                         
095775    03 FILLER              PIC X(68).                                         
095780  02 BPE-DETALLE REDEFINES BPE-HEADER.                                        
095785    03 BPE-SUCPRO          PIC 9(04).                                         
095790    03 BPE-CVE             PIC 9(04).                                         
095795    03 BPE-CTO             PIC 9(12).                                         
095800    03 BPE-IMP             PIC 9(14)V99.                                      
095805    03 BPE-PRD             PIC 9(04).                                         
095810    03 BPE-INS             PIC 9(04).                                         
095815    03 BPE-MON             PIC 9(03).                                         
095820    03 BPE-SUCTRA          PIC 9(04).                                         
095825    03 BPE-CAJA            PIC 9(02).                                         
095830    03 BPE-AUT             PIC 9(08).                                         
095835    03 BPE-NOM             PIC 9(08).                                         
095840    03 BPE-HORA            PIC 9(06).                                         
095845    03 FILLER              PIC X(01).                                         
095850                                                                              
096010 01 CONTRATO-S151.                                                            
096310  02 CONTRATO-151           PIC 9(20) COMP.                                   
096610  02 CTO-151 REDEFINES CONTRATO-151.                                          
096910     03 151-SUCURSAL        PIC 9(04) COMP.                                   
097210     03 151-CONTRATO        PIC 9(16) COMP.                                   
097220                                                                              
097230 01 HORA-BPEN.                                                                
097240  02 HORA-BPEN1             PIC 9(06).                                        
097250  02 HORA-BPEN2 REDEFINES HORA-BPEN1.                                         
097260     03 WS-HORA-HH          PIC 9(02).                                        
097270     03 WS-HORA-MM          PIC 9(02).                                        
097280     03 WS-HORA-SS          PIC 9(02).                                        
097510                                                                              
097810****************************************************************              
100210* TABLA PARA CARGAR LOS MEDIOS DE ACCESO DE LOS PRODUCTOS.                    
100510****************************************************************              
100810 01 WS-CARGA-MEDAC.                                                           
101110  02 WS-MEDIOAC-PRD OCCURS 31 TIMES.                                          
101410    04 WS-MEDAC-PRD PIC 9(04).                                                
101710    04 WS-MEDAC-INS PIC 9(04).                                                
102010    04 WS-MEDAC-MON PIC 9(03).                                                
102310    04 WS-MEDAC-MAC PIC 9(01).                                                
102610                                                                              
102620****************************************************************              
102630* TABLA PARA CARGAREL NUM. DE CTOS P/PRD CTOS > < O = 0. P/CHE.               
102640****************************************************************              
102650 01 WS-CARGA-CHECTO.                                                          
102660  02 WS-SDOCHE-PRD OCCURS 31 TIMES.                                           
102670    04 WS-NUMCHE-PRD  PIC 9(04).                                              
102680    04 WS-NUMCHE-INS  PIC 9(04).                                              
102690    04 WS-NUMCHE-MON  PIC 9(03).                                              
102700    04 WS-NUMCHE-MACE PIC 9(08).                                              
102710    04 WS-NUMCHE-MECE PIC 9(08).                                              
102720    04 WS-NUMCHE-IGCE PIC 9(08).                                              
102730    04 WS-NUMCHE-SDOA PIC S9(14)V99.                                          
102740                                                                              
102750****************************************************************              
102760* TABLA PARA CARGAREL NUM. DE CTOS P/PRD CTOS > < O = 0. P/CMA.               
102770****************************************************************              
102780 01 WS-CARGA-CMACTO.                                                          
102790  02 WS-SDOCMA-PRD OCCURS 31 TIMES.                                           
102800    04 WS-NUMCMA-PRD  PIC 9(04).                                              
102810    04 WS-NUMCMA-INS  PIC 9(04).                                              
102820    04 WS-NUMCMA-MON  PIC 9(03).                                              
102830    04 WS-NUMCMA-MACE PIC 9(08).                                              
102840    04 WS-NUMCMA-MECE PIC 9(08).                                              
102850    04 WS-NUMCMA-IGCE PIC 9(08).                                              
102860    04 WS-NUMCMA-SDOA PIC S9(14)V99.                                          
102870                                                                              
102910****************************************************************              
103210*  VARIABLES PARA ACUMULAR TOTALES                                            
103510****************************************************************              
103810                                                                              
104110**************        TOTALES DE AHORROS          **************              
104410                                                                              
104710 77 WS-TOT-BLO-SUC          PIC 9(14)V99 COMP VALUE 0.                        
105010 77 WS-NUM-BLO-SUC          PIC 9(6)     COMP VALUE 0.                        
105310 77 WS-TOT-VIG-SUC          PIC 9(14)V99 COMP VALUE 0.                        
105610 77 WS-NUM-VIG-SUC          PIC 9(06)    COMP VALUE 0.                        
105910 77 WS-TOT-BLO-NODO         PIC 9(14)V99 COMP VALUE 0.                        
106210 77 WS-NUM-BLO-NODO         PIC 9(06)    COMP VALUE 0.                        
106510 77 WS-TOT-VIG-NODO         PIC 9(14)V99 COMP VALUE 0.                        
106810 77 WS-NUM-VIG-NODO         PIC 9(06)    COMP VALUE 0.                        
107110 77 WS-TOT-BLO-CSI          PIC 9(14)V99 COMP VALUE 0.                        
107410 77 WS-NUM-BLO-CSI          PIC 9(6)     COMP VALUE 0.                        
107710 77 WS-TOT-VIG-CSI          PIC 9(14)V99 COMP VALUE 0.                        
108010 77 WS-NUM-VIG-CSI          PIC 9(06)    COMP VALUE 0.                        
108310 77 WS-TOT-TOT-SUC          PIC 9(14)V99 COMP VALUE 0.                        
108610 77 WS-NUM-TOT-SUC          PIC 9(06)    COMP VALUE 0.                        
108910 77 WS-TOT-TOT-NODO         PIC 9(14)V99 COMP VALUE 0.                        
109210 77 WS-NUM-TOT-NODO         PIC 9(06)    COMP VALUE 0.                        
109510 77 WS-TOT-TOT-CSI          PIC 9(14)V99 COMP VALUE 0.                        
109810 77 WS-NUM-TOT-CSI          PIC 9(06)    COMP VALUE 0.                        
110110 77 WS-FIN-MES              PIC 9        COMP VALUE 0.                        
110410                                                                              
110710**************    TOTALES DE CTAMAE SDO DISPO.    **************              
111010                                                                              
111310 77 WS-DIS-SDOACT-PRD           PIC S9(14)V99 COMP VALUE 0.                   
111610 77 WS-DIS-SDODIS-PRD           PIC S9(14)V99 COMP VALUE 0.                   
111910 77 WS-DIS-NUMERO-PRD           PIC 9(07)    COMP VALUE 0.                    
112210 77 WS-DIS-SDOACT-INS           PIC S9(14)V99 COMP VALUE 0.                   
112510 77 WS-DIS-SDODIS-INS           PIC S9(14)V99 COMP VALUE 0.                   
112810 77 WS-DIS-NUMERO-INS           PIC 9(07)    COMP VALUE 0.                    
113110 77 WS-DIS-SDOACT-MON           PIC S9(14)V99 COMP VALUE 0.                   
113410 77 WS-DIS-SDODIS-MON           PIC S9(14)V99 COMP VALUE 0.                   
113710 77 WS-DIS-NUMERO-MON           PIC 9(07)    COMP VALUE 0.                    
114010 77 WS-DIS-SDOACT-SUC           PIC S9(14)V99 COMP VALUE 0.                   
114310 77 WS-DIS-SDODIS-SUC           PIC S9(14)V99 COMP VALUE 0.                   
114610 77 WS-DIS-NUMERO-SUC           PIC 9(07)    COMP VALUE 0.                    
114910 77 WS-DIS-SDOACT-NODO          PIC S9(14)V99 COMP VALUE 0.                   
115210 77 WS-DIS-SDODIS-NODO          PIC S9(14)V99 COMP VALUE 0.                   
115510 77 WS-DIS-NUMERO-NODO          PIC 9(07)    COMP VALUE 0.                    
115810 77 WS-DIS-SDOACT-CSI           PIC S9(14)V99 COMP VALUE 0.                   
116110 77 WS-DIS-SDODIS-CSI           PIC S9(14)V99 COMP VALUE 0.                   
116410 77 WS-DIS-NUMERO-CSI           PIC 9(07)    COMP VALUE 0.                    
116710 77 WS-DIS-SDOACT-TOTAL         PIC S9(14)V99 COMP VALUE 0.                   
117010 77 WS-DIS-SDODIS-TOTAL         PIC S9(14)V99 COMP VALUE 0.                   
117310                                                                              
117610                                                                              
117910***************************************************************               
118210* BANDERAS UTILIZADAS PARA EL GRABADO DE ESTRUCTURAS.                         
118510***************************************************************               
118810 77 WS-BAN-B02      PIC 9 VALUE 0.                                            
119110 77 WS-BAN-B03      PIC 9 VALUE 0.                                            
119410 77 WS-BAN-B05      PIC 9 VALUE 0.                                            
119710 77 WS-BAN-B06      PIC 9 VALUE 0.                                            
120010                                                                              
120310***************************************************************               
120610* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                  
120910* ACCESO A LA BASE DE DATOS.                                                  
121210***************************************************************               
121510 COPY "S500/INC/WOR/25MTP002".                                                
121810 COPY "S500/INC/WOR/DAS/25MTP006".                                            
121812                                                                              
121820 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
122110                                                                              
122410****************************************************************              
122710*      REGISTRO DE CAMPOS QUE GRABAREMOS EN ARCHIVO P/EL S151                 
123010****************************************************************              
123310 01 WS-REG-SALDOS151.                                                         
123610    02 WS-S151-HEADER.                                                        
123910      03 WS-H151-CVE           PIC 9(02)       COMP VALUE 01.                 
124210      03 WS-H151-CSIO          PIC 9(04)       COMP.                          
124510      03 FILLER                PIC X.                                         
124810      03 WS-H151-SIST          PIC 9(04)       COMP VALUE 500.                
125110      03 WS-H151-FPRO-AA       PIC 99.                                        
125410      03 WS-H151-FPRO-MM       PIC 99.                                        
125710      03 WS-H151-FPRO-DD       PIC 99.                                        
126010      03 WS-H151-CREA-AA       PIC 99.                                        
126310      03 WS-H151-CREA-MM       PIC 99.                                        
126610      03 WS-H151-CREA-DD       PIC 99.                                        
126910      03 WS-H151-CREA-HH       PIC 99.                                        
127210      03 WS-H151-CREA-MIN      PIC 99.                                        
127510      03 WS-H151-CREA-SS       PIC 99.                                        
127810      03 WS-H151-FOR           PIC 9.                                         
128110      03 FILLER                PIC X(65).                                     
128410    02 WS-S151-DETALLE.                                                       
128710      03 WS-D151-CVE           PIC 9(02)       COMP VALUE 10.                 
129010      03 WS-D151-SIST          PIC 9(04)       COMP.                          
129310      03 WS-D151-SUC           PIC 9(04)       COMP.                          
129610      03 WS-D151-MON           PIC 9(02)       COMP.                          
129910      03 WS-D151-CTAS          PIC 9(19)       COMP.                          
130210      03 WS-D151-DIG           PIC 9           COMP.                          
130510      03 WS-D151-INST          PIC 9(04)       COMP.                          
130810      03 WS-D151-NOMB          PIC X(30).                                     
131110      03 WS-D151-SANT          PIC 9(18)V99    COMP.                          
131410      03 WS-D151-SACT          PIC 9(18)V99    COMP.                          
131710      03 WS-D151-FECH-AA       PIC 99          COMP.                          
132010      03 WS-D151-FECH-MM       PIC 99          COMP.                          
132310      03 WS-D151-FECH-DD       PIC 99          COMP.                          
132610      03 FILLER                PIC X(19).                                     
132910    02 WS-S151-DETALLE1.                                                      
133210      03 WS-SUC151-CVE           PIC 9(02)       COMP VALUE 20.               
133510      03 WS-SUC151-SIST          PIC 9(04)       COMP.                        
133810      03 WS-SUC151-SUC           PIC 9(04)       COMP.                        
134110      03 WS-SUC151-MON           PIC 9(02)       COMP.                        
134410      03 WS-SUC151-SANT          PIC 9(18)V99    COMP.                        
134710      03 WS-SUC151-SACT          PIC 9(18)V99    COMP.                        
135010      03 WS-SUC151-FECH-AA       PIC 99          COMP.                        
135310      03 WS-SUC151-FECH-MM       PIC 99          COMP.                        
135610      03 WS-SUC151-FECH-DD       PIC 99          COMP.                        
135910      03 FILLER                  PIC X(61).                                   
136210    02 WS-S151-DETALLE2.                                                      
136510      03 WS-GLO151-CVE           PIC 9(02)       COMP VALUE 30.               
136810      03 WS-GLO151-SIST          PIC 9(4)        COMP.                        
137110      03 WS-GLO151-MON           PIC 9(02)       COMP.                        
137410      03 WS-GLO151-SANT          PIC 9(18)V99    COMP.                        
137710      03 WS-GLO151-SACT          PIC 9(18)V99    COMP.                        
138010      03 WS-GLO151-FECH-AA       PIC 99          COMP.                        
138310      03 WS-GLO151-FECH-MM       PIC 99          COMP.                        
138610      03 WS-GLO151-FECH-DD       PIC 99          COMP.                        
138910      03 FILLER                  PIC X(63).                                   
139210    02 WS-S151-TRAILER.                                                       
139510      03 WS-T151-CVE             PIC 9(02)       COMP VALUE 90.               
139810      03 WS-T151-SIST            PIC 9(04)       COMP VALUE 500.              
140110      03 FILLER                  PIC XX.                                      
140410      03 WS-T151-REG             PIC 9(06)       COMP.                        
140710      03 FILLER                  PIC X(82).                                   
141010                                                                              
141310****************************************************************              
141610* REGISTROS DE LOS CAMPOS QUE SE MOVERAN AL ARCHIVO P/TANDEM.                 
141910* DEL SISTEMA S253(TARJETAS),ARCHIVO SALDOSTB.                                
142210****************************************************************              
142510 01 WS-REGTB-HEADER.                                                          
142810       03 WS-TBHE-TREG           PIC X VALUE "0".                             
143110       03 WS-TBHE-SISO           PIC X(4) VALUE "S500".                       
143410       03 WS-TBHE-SISD           PIC X(4) VALUE "S253".                       
143710       03 WS-TBHE-FECPRO         PIC 9(08).                                   
144010       03 WS-TBHE-FECBASE        PIC 9(08).                                   
144310       03 WS-TBHE-TIPCAM         PIC 9(04)V9(04).                             
144610       03 FILLER                 PIC X(57).                                   
144910                                                                              
145210 01 WS-REGTB-DETALLE.                                                         
145510       03 WS-TBDE-TREG          PIC X VALUE "1".                              
145810       03 WS-TBDE-NUMCTO        PIC 9(12).                                    
146110       03 WS-TBDE-NUMPRD        PIC 9(04).                                    
146410       03 WS-TBDE-NUMINS        PIC 9(04).                                    
146710       03 WS-TBDE-NUMMON        PIC 9(03).                                    
147010       03 WS-TBDE-SIGSDO        PIC X.                                        
147310       03 WS-TBDE-SDOMN         PIC 9(12)V99.                                 
147610       03 WS-TBDE-LIMCRE        PIC 9(3).                                     
147910       03 WS-TBDE-CSI           PIC 99.                                       
148210       03 WS-TBDE-SUCPRO        PIC 9(04).                                    
148510       03 WS-TBDE-AUTPENMN      PIC 9(08)V99.                                 
148810       03 WS-TBDE-STATUS        PIC 9.                                        
149110       03 WS-TBDE-SDODL         PIC 9(12)V99.                                 
149410       03 WS-TBDE-AUTPENDL      PIC 9(08)V99.                                 
149710       03 FILLER                PIC X(07).                                    
150010                                                                              
150310 01 WS-REGTB-TRAILER.                                                         
150610       03 WS-TBTR-TREG          PIC X VALUE "9".                              
150910       03 WS-TBTR-NUMREG        PIC 9(08).                                    
151210       03 WS-TBTR-TOTSDOMN      PIC 9(16)V99.                                 
151510       03 WS-TBTR-TOTSDODL      PIC 9(16)V99.                                 
151810       03 FILLER                PIC X(45).                                    
152110                                                                              
152115****************************************************************              
152540                                                                              
152710****************************************************************              
153010* CAMPOS PARA ARMAR LA LLAVE DEL CONTRATO DE INVENTARIO.                      
153310****************************************************************              
153610 01 WS-CTE-01.                                                                
153910    03  WS-CTO                  PIC 9(12).                                    
154210    03  WS-CTO-R REDEFINES WS-CTO.                                            
154510       05  WS-CTE               PIC 9(09).                                    
154810       05  WS-DIG               PIC 9(03).                                    
155110                                                                              
155410****************************************************************              
155710* CAMPOS PARA SEPARAR EL DIGITO VERIFICADOR DEL CONTRATO.                     
156010****************************************************************              
156310 01 WS-CTODIG1.                                                               
156610    03  WS-CTODIG                  PIC 9(12) COMP.                            
156910    03  WS-CTODIG-R REDEFINES WS-CTODIG.                                      
157210       05  WS-CONTRATO             PIC 9(11) COMP.                            
157510       05  WS-DIGITO               PIC 9(01) COMP.                            
157810                                                                              
158110****************************************************************              
158410*    ETIQUETA DEL NOMBRE CON QUE SERA LEIDO  EL ARCHIVO DE CHEQUES            
158710*    PARA TARJETAS.                                                           
159010****************************************************************              
159310 01 WS-ETIQ-SDOTBT.                                                           
159610      02 WS-TB-TITT             PIC X(15) VALUE                               
159910                                "S001/FILE/S500/".                            
160210      02 WS-TB-CSIOT            PIC 99.                                       
160510      02 FILLER                 PIC X(1) VALUE "/".                           
160810      02 WS-TB-CSIDT            PIC 99.                                       
161110      02 FILLER                 PIC X(1) VALUE "/".                           
161410      02 WS-TB-TIT1T            PIC X(09) VALUE "SALDOSTB/".                  
161710      02 WS-TB-FECHAT           PIC 9(6).                                     
162010      02 FILLER                 PIC X VALUE ".".                              
162310                                                                              
162315****************************************************************              
162320*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE BLOQUEO DE SDOS. PEND. COP1            
162325****************************************************************              
162330 01 WS-ETIQ-BLOPEND.                                                          
162335   02 FILLER             PIC X(21) VALUE "S500/FILE/S500/BPEND/".             
162340   02 WS-BPEND-CSIO      PIC 99.                                              
162345   02 FILLER             PIC X     VALUE "/".                                 
162350   02 WS-BPEND-CSID      PIC 99.                                              
162355   02 FILLER             PIC X     VALUE "/".                                 
162360   02 WS-BPEND-FEC       PIC 9(06).                                           
162362   02 FILLER             PIC X(03) VALUE "/01".                               
162365   02 FILLER             PIC X     VALUE ".".                                 
162370                                                                              
162380****************************************************************              
162385*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE BLOQUEO DE SDOS. PEND. COP2            
162390****************************************************************              
162395 01 WS-ETIQ-BLOPEND1.                                                         
162400   02 FILLER             PIC X(21) VALUE "S500/FILE/S500/BPEND/".             
162405   02 WS-BPEND-CSIO1     PIC 99.                                              
162410   02 FILLER             PIC X     VALUE "/".                                 
162415   02 WS-BPEND-CSID1     PIC 99.                                              
162420   02 FILLER             PIC X     VALUE "/".                                 
162425   02 WS-BPEND-FEC1      PIC 9(06).                                           
162430   02 FILLER             PIC X(03) VALUE "/02".                               
162435   02 FILLER             PIC X     VALUE ".".                                 
162440                                                                              
162441****************************************************************              
162442*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE BLOQUEO DE SDOS. PEND. COP3            
162443****************************************************************              
162444 01 WS-ETIQ-BLOPEND3.                                                         
162445   02 FILLER             PIC X(21) VALUE "S500/FILE/S500/BPEND/".             
162446   02 WS-BPEND-CSIO3     PIC 99.                                              
162447   02 FILLER             PIC X     VALUE "/".                                 
162448   02 WS-BPEND-CSID3     PIC 99.                                              
162449   02 FILLER             PIC X     VALUE "/".                                 
162450   02 WS-BPEND-FEC3      PIC 9(06).                                           
162451   02 FILLER             PIC X(03) VALUE "/03".                               
162452   02 FILLER             PIC X     VALUE ".".                                 
162453                                                                              
162454****************************************************************              
162455* ETIQUETA DEL NOMBRE DEL ARCHIVO DE BLOQUEO DE SDOS. UNIFICADO.              
162456****************************************************************              
162460 01 WS-ETIQ-BLOPEND2.                                                         
162465   02 FILLER             PIC X(21) VALUE "S500/FILE/S500/BPEND/".             
162470   02 WS-BPEND-CSIO2     PIC 99.                                              
162475   02 FILLER             PIC X     VALUE "/".                                 
162480   02 WS-BPEND-CSID2     PIC 99.                                              
162485   02 FILLER             PIC X     VALUE "/".                                 
162490   02 WS-BPEND-FEC2      PIC 9(06).                                           
162500   02 FILLER             PIC X     VALUE ".".                                 
162510                                                                              
162520******************************************************                        
162525 01 WS-ETIQ-INVEPTE.                                                          
162530      02 FILLER                 PIC X(18) VALUE                               
162535                                "S500/FILE/INVEPTE/".                         
162540      02 WS-INVE-CSIO-T         PIC 99.                                       
162545      02 FILLER                 PIC X(01) VALUE "/".                          
162550      02 WS-INVE-FECHA-T        PIC 9(08).                                    
162555      02 FILLER                 PIC XX VALUE " .".                            
162560                                                                              
162610****************************************************************              
162910*    ETIQUETA DEL NOMBRE CON QUE SERA LEIDO  EL ARCHIVO DE S151               
163210*    PARA INDICARLE EL FIN DE ENVIO DE MOVS.                                  
163510****************************************************************              
163810 01 WS-ETIQ-S151FIN.                                                          
164110      02 FILLER                 PIC X(23) VALUE                               
164410                                "S500/FILE/S500/FINS151/".                    
164710      02 WS-FIN-FECHA           PIC 9(6).                                     
165010      02 FILLER                 PIC X VALUE ".".                              
165310                                                                              
165420****************************************************************              
165430*    ETIQUETA DEL NOMBRE CON QUE SERA LEIDO  EL ARCHIVO DE S151               
165440*    PARA INDICARLE EL FIN DE ENVIO DE MOVS. DE CBII                          
165450****************************************************************              
165460 01 WS-ETIQ-CBIIFIN.                                                          
165470      02 FILLER                 PIC X(23) VALUE                               
165480                                "S500/FILE/S500/FINCBII/".                    
165490      02 WS-FIN-FECHA-CBII      PIC 9(6).                                     
165500      02 FILLER                 PIC X VALUE ".".                              
165510                                                                              
165610****************************************************************              
165910*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO EL ARCHIVO DE CM.                
166210*    PARA TARJETAS.                                                           
166510****************************************************************              
166810 01 WS-ETIQ-SDOTB.                                                            
167110      02 WS-TB-TIT              PIC X(15) VALUE                               
167410                                "S500/FILE/S500/".                            
167710      02 WS-TB-CSIO             PIC 99.                                       
168010      02 FILLER                 PIC X(1) VALUE "/".                           
168310      02 WS-TB-CSID             PIC 99.                                       
168610      02 FILLER                 PIC X(1) VALUE "/".                           
168910      02 WS-TB-TIT1             PIC X(09) VALUE "SALDOSTB/".                  
169210      02 WS-TB-FECHA            PIC 9(6).                                     
169510      02 FILLER                 PIC X VALUE ".".                              
169810                                                                              
169994*                                                                             
170110****************************************************************              
170410*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO EL ARCHIVO PARA                  
170710*     EL S151.                                                                
171010****************************************************************              
171310 01 WS-ETIQ-SDO151.                                                           
171610      02 WS-151-TIT              PIC X(22) VALUE                              
171910                                 "S500/FILE/S151/SALDOS/".                    
172210      02 WS-151-CSI              PIC XXX.                                     
172510      02 FILLER                  PIC X(1) VALUE "/".                          
172810      02 WS-151-FECHA            PIC 9(6).                                    
173110      02 FILLER                  PIC X VALUE ".".                             
173410                                                                              
173710****************************************************************              
174010* TABLA DE CSI`S NECESARIOS PARA FORMAR LA ETIQUETA DEL ARCHIVO.              
174310****************************************************************              
174610 01 WS-TABLACSI-01.                                                           
174910   02 WS-TABLACSI.                                                            
175210      03 FILLER                 PIC X(3) VALUE "HER".                         
175510      03 FILLER                 PIC X(3) VALUE "   ".                         
175810      03 FILLER                 PIC X(3) VALUE "MON".                         
176110      03 FILLER                 PIC X(3) VALUE "MTY".                         
176410      03 FILLER                 PIC X(3) VALUE "   ".                         
176710      03 FILLER                 PIC X(3) VALUE "LEO".                         
177010      03 FILLER                 PIC X(3) VALUE "VER".                         
177310      03 FILLER                 PIC X(3) VALUE "   ".                         
177610      03 FILLER                 PIC X(3) VALUE "MOR".                         
177910      03 FILLER                 PIC X(3) VALUE "VDM".                         
178210   02 WS-TAB-CSI REDEFINES WS-TABLACSI OCCURS 10 TIMES PIC X(3).              
178510                                                                              
178810****************************************************************              
179110*   CARATULA DE IMPRESION DEL REPORTE DE INVENTARIO DE AHORROS.               
179410****************************************************************              
179710 01 WS-ETIQ-INVEN.                                                            
180010   02 FILLER             PIC X(15) VALUE "S500/LIST/P180/".                   
180310   02 WS-INVEN-CI        PIC 9(02).                                           
180610   02 WS-INVEN-SUBNODO   PIC 99.                                              
180910   02 FILLER             PIC X     VALUE "/".                                 
181210   02 WS-INVEN-CIFRA     PIC X     VALUE "R".                                 
181510   02 WS-INVEN-NUM       PIC 999.                                             
181810   02 FILLER             PIC X  VALUE "/".                                    
182110   02 WS-INVEN-FECHA     PIC 9(6).                                            
182410   02 FILLER             PIC X     VALUE "/".                                 
182710   02 WS-INVEN-MIX       PIC 9(7).                                            
183010   02 FILLER             PIC X(18)  VALUE "/001INVENTARIO   .".               
183310                                                                              
183315****************************************************************              
183320*   CARATULA DE IMPRESION DEL REPORTE DE BLOQUEO DE SDOS. PEND.               
183325****************************************************************              
183330 01 WS-ETIQ-BPENDIENTE.                                                       
183335   02 FILLER             PIC X(15) VALUE "S500/LIST/P180/".                   
183340   02 WS-BPEND-CI        PIC 9(02).                                           
183345   02 WS-BPEND-SUBNODO   PIC 99.                                              
183350   02 FILLER             PIC X     VALUE "/".                                 
183355   02 WS-BPEND-CIFRA     PIC X     VALUE "R".                                 
183360   02 WS-BPEND-NUM       PIC 999.                                             
183365   02 FILLER             PIC X  VALUE "/".                                    
183370   02 WS-BPEND-FECHA     PIC 9(6).                                            
183375   02 FILLER             PIC X     VALUE "/".                                 
183380   02 WS-BPEND-MIX       PIC 9(7).                                            
183385   02 FILLER             PIC X(18)  VALUE "/003BLOSDOPEND   .".               
183390                                                                              
183610******************************************************************            
183910*      CARATULA DE IMPRESION DE SALDOS DISPONIBLES P/CONTRATO.                
184210******************************************************************            
184510 01 WS-ETIQ-DISPO.                                                            
184810   02 FILLER              PIC X(15) VALUE "S500/LIST/P180/".                  
185110   02 WS-DISPO-CI         PIC 99.                                             
185410   02 WS-DISPO-SUBNODO    PIC 99.                                             
185710   02 FILLER              PIC X     VALUE "/".                                
186010   02 WS-DISPO-CIFRA      PIC X     VALUE "R".                                
186310   02 WS-DISPO-NUM        PIC 999.                                            
186610   02 FILLER              PIC X  VALUE "/".                                   
186910   02 WS-DISPO-FECHA      PIC 9(6).                                           
187210   02 FILLER              PIC X     VALUE "/".                                
187510   02 WS-DISPO-MIX        PIC 9(7).                                           
187810   02 FILLER              PIC X(18)  VALUE "/002SDODISPONIBLE.".              
188110                                                                              
188120******************************************************************            
188130*      CARATULA DE IMPRESION DEL LISTADO DE COMISIONES POR TEF.               
188140******************************************************************            
188150 01 WS-ETIQ-TEF.                                                              
188160   02 FILLER              PIC X(15) VALUE "S500/LIST/P180/".                  
188170   02 WS-TEF-CI           PIC 99.                                             
188180   02 WS-TEF-SUBNODO      PIC 99.                                             
188190   02 FILLER              PIC X     VALUE "/".                                
188200   02 WS-TEF-CIFRA        PIC X     VALUE "R".                                
188210   02 WS-TEF-NUM          PIC 999.                                            
188220   02 FILLER              PIC X  VALUE "/".                                   
188230   02 WS-TEF-FECHA        PIC 9(6).                                           
188240   02 FILLER              PIC X     VALUE "/".                                
188250   02 WS-TEF-MIX          PIC 9(7).                                           
188260   02 FILLER              PIC X(18)  VALUE "/004COMISGRUPOTEF.".              
188270                                                                              
188410******************************************************************            
188710*  REGISTROS UTILIZADOS EN LA CAPTURA DE HORA Y FECHAS.                       
189010****************************************************************              
189310 01 WS-FEC-BLOQUEO                   PIC 9(08).                               
189610 01 WS-FEC-TEMPORAL                  PIC 9(08).                               
189910 01 WS-FECVAL-AMD                    PIC 9(08).                               
190210 01 WS-FECVAL-AMD-R REDEFINES WS-FECVAL-AMD.                                  
190510    02 WS-FEC-VAL-AA                 PIC 9(04).                               
190810    02 WS-FEC-VAL-MM                 PIC 99.                                  
191110    02 WS-FEC-VAL-DD                 PIC 99.                                  
191410                                                                              
191710 01 WS-FECHA-DIA-DMA                 PIC 9(08).                               
192010 01 WS-FECHA-DIA-DMA-R REDEFINES WS-FECHA-DIA-DMA.                            
192310    02 WS-DIA-DD                     PIC 99.                                  
192610    02 WS-DIA-MM                     PIC 99.                                  
192910    02 WS-DIA-AA                     PIC 9(04).                               
193210                                                                              
193510 01 WS-FECHA-DIA-MDA                 PIC 9(08).                               
193810 01 WS-FECHA-DIA-MDA-R REDEFINES WS-FECHA-DIA-MDA.                            
194110    02 WS-DIA-MM1                    PIC 99.                                  
194410    02 WS-DIA-DD1                    PIC 99.                                  
194710    02 WS-DIA-AA1                    PIC 9(04).                               
195010                                                                              
195310 01 WS-FECHA-DIA-AMD                 PIC 9(08).                               
195610 01 WS-FECHA-DIA-AMD-R REDEFINES WS-FECHA-DIA-AMD.                            
195910    02 WS-DIA-AA2                    PIC 9(04).                               
196210    02 WS-DIA-MM2                    PIC 99.                                  
196510    02 WS-DIA-DD2                    PIC 99.                                  
196810                                                                              
197110 01 WS-FECHA-PRO                     PIC 9(08).                               
197410 01 WS-FECHA-PRO-R REDEFINES WS-FECHA-PRO.                                    
197710    02 WS-PRO-AA                     PIC 9(04).                               
198010    02 WS-PRO-MM                     PIC 99.                                  
198310    02 WS-PRO-DD                     PIC 99.                                  
198610                                                                              
198910 01 WS-INVEN-PRO-AMD                  PIC 9(08).                              
199210 01 WS-INVEN-PRO-AMD-R REDEFINES WS-INVEN-PRO-AMD.                            
199510    02 WS-INV-PRO-AA                  PIC 9(04).                              
199810    02 WS-INV-PRO-MM                  PIC 99.                                 
200110    02 WS-INV-PRO-DD                  PIC 99.                                 
200410                                                                              
200710 01 WS-FEC-CALCULADA-AMD             PIC 9(08).                               
201010 01 WS-FEC-CAL-AMD REDEFINES WS-FEC-CALCULADA-AMD.                            
201310    02 WS-CALCULADA-AA                PIC 9(04).                              
201610    02 WS-CALCULADA-MM                PIC 99.                                 
201910    02 WS-CALCULADA-DD                PIC 99.                                 
202210                                                                              
202510 01 WS-FEC-CALCULADA-AMD1            PIC 9(08).                               
202810 01 WS-FEC-CAL-AMD1 REDEFINES WS-FEC-CALCULADA-AMD1.                          
203110    02 WS-CALCULADA-AA1               PIC 9(04).                              
203410    02 WS-CALCULADA-MM1               PIC 99.                                 
203710    02 WS-CALCULADA-DD1               PIC 99.                                 
204010                                                                              
204310 01 WS-FECHA-PRO-DMA                 PIC 9(08).                               
204610 01 WS-FECHA-PRO-DMA-R REDEFINES WS-FECHA-PRO-DMA.                            
204910    02 WS-PRO-DD1                    PIC 99.                                  
205210    02 WS-PRO-MM1                    PIC 99.                                  
205510    02 WS-PRO-AA1                    PIC 9(04).                               
205810                                                                              
206110 01 WS-FEC-PUENTE-AMD              PIC 9(08).                                 
206410 01 WS-FEC-PUEN-AMD REDEFINES WS-FEC-PUENTE-AMD.                              
206710    02 WS-PUENTE-AA                PIC 9(04).                                 
207010    02 WS-PUENTE-MM                PIC 99.                                    
207310    02 WS-PUENTE-DD                PIC 99.                                    
207610                                                                              
207910 01 WS-HORA-HMSC-01.                                                          
208210    03 WS-HORA-HMSC-N           PIC 9(8).                                     
208510    03 WS-HORA-HMSC REDEFINES   WS-HORA-HMSC-N.                               
208810       05 WS-HORA-HMS-N         PIC 9(6).                                     
209110       05 WS-HORA-HMS REDEFINES WS-HORA-HMS-N.                                
209410          07 WS-HORA-HH-N       PIC 9(2).                                     
209710          07 WS-HORA-MM-N       PIC 9(2).                                     
210010          07 WS-HORA-SS-N       PIC 9(2).                                     
210310       05 FILLER                   PIC X(2).                                  
210610                                                                              
210910****************************************************************              
211210*          A R E A       D E       E N C A B E Z A D O S.                     
211510****************************************************************              
211810                                                                              
212110****************************************************************              
212410*              ENCABEZADO INICIAL DE LOS REPORTES.                            
212710****************************************************************              
213010 01  WS-ENCABEZADO.                                                           
213310   02 FILLER       PIC X(51)  VALUE SPACES.                                   
213610   02 FILLER       PIC X(29)  VALUE                                           
213910        "BANCO NACIONAL DE MEXICO S.A.".                                      
214210                                                                              
214510****************************************************************              
214810*            SEGUNDO ENCABEZADO INICIAL DE LOS REPORTES.                      
215110****************************************************************              
215410 01  WS-ENCABEZADO1.                                                          
215710     05 FILLER                             PIC X(56)                          
216010        VALUE SPACES.                                                         
216310     05 FILLER                             PIC X(20)                          
216610        VALUE "DEPOSITOS A LA VISTA".                                         
216910                                                                              
217210****************************************************************              
217510*   TERCER  ENCABEZADO PARA EL REPORTE DE SALDOS DISPONIBLES.                 
217810****************************************************************              
218110 01  WS-03-DISPO.                                                             
218410     05 FILLER                        PIC X(18)                               
218710        VALUE "S500-P180-SDODIS  ".                                           
219010     05 FILLER                        PIC X(36) VALUE SPACES.                 
219310     05 WS-DISPO-NOMBRE               PIC X(40) VALUE SPACES.                 
219610     05 WS-DISPO-PRD                  PIC ZZZ9.                               
219910     05 FILLER                        PIC X        VALUE SPACES.              
220210     05 WS-DISPO-INS                  PIC ZZZ9.                               
220510     05 FILLER                        PIC X        VALUE SPACES.              
220810     05 WS-DISPO-MON                  PIC ZZ9.                                
221110     05 FILLER                        PIC X(08)                               
221410        VALUE "  FECHA ".                                                     
221710     05 WS-DISPO-DIA                  PIC 99.                                 
222010     05 FILLER                        PIC X VALUE "/".                        
222310     05 WS-DISPO-MES                  PIC 9(02).                              
222610     05 FILLER                        PIC X VALUE "/".                        
222910     05 WS-DISPO-ANO                  PIC 9(04).                              
223210                                                                              
223220****************************************************************              
223230*   TERCER  ENCABEZADO PARA EL REPORTE DE BLOQUEO DE SDOS. PEND.              
223235****************************************************************              
223240 01  WS-03-BDISP.                                                             
223250     05 FILLER                        PIC X(18)                               
223255        VALUE "S500-P180-BPENDS  ".                                           
223257     05 FILLER                        PIC X(89) VALUE SPACES.                 
223260     05 FILLER                        PIC X(08)                               
223270        VALUE "  FECHA ".                                                     
223280     05 WS-BPEND-DIA                  PIC 99.                                 
223285     05 FILLER                        PIC X VALUE "/".                        
223290     05 WS-BPEND-MES                  PIC 9(02).                              
223295     05 FILLER                        PIC X VALUE "/".                        
223300     05 WS-BPEND-ANO                  PIC 9(04).                              
223305                                                                              
223510****************************************************************              
223810* TERCER ENCABEZADO PARA EL REP. DE INVENTARIO.                               
224110****************************************************************              
224410 01  WS-03-INVEN.                                                             
224710     05 FILLER                        PIC X(18)                               
225010        VALUE "S500-P180-INVENT  ".                                           
225310     05 FILLER                        PIC X(36) VALUE SPACES.                 
225610     05 WS-INVEN-NOMBRE               PIC X(40).                              
225910     05 WS-INVEN-PRD                  PIC ZZZ9.                               
226210     05 FILLER                        PIC X     VALUE SPACES.                 
226510     05 WS-INVEN-INS                  PIC ZZZ9.                               
226810     05 FILLER                        PIC X     VALUE SPACES.                 
227110     05 WS-INVEN-MON                  PIC ZZ9.                                
227410     05 FILLER                        PIC X(08)                               
227710        VALUE "  FECHA ".                                                     
228010     05 WS-INVEN-DIA                  PIC 99.                                 
228310     05 FILLER                        PIC X VALUE "/".                        
228610     05 WS-INVEN-MES                  PIC 9(02).                              
228910     05 FILLER                        PIC X VALUE "/".                        
229210     05 WS-INVEN-ANO                  PIC 9(04).                              
229215                                                                              
229220****************************************************************              
229225*   TERCER  ENCABEZADO PARA EL REPORTE DE COMISIONES POR TEF.                 
229230****************************************************************              
229235 01  WS-03-TEF.                                                               
229240     05 FILLER                        PIC X(18)                               
229245        VALUE "S500-P180-ESQXGPOS".                                           
229250     05 FILLER                        PIC X(89) VALUE SPACES.                 
229285     05 FILLER                        PIC X(08)                               
229290        VALUE "  FECHA ".                                                     
229295     05 WS-TEF-DIA                    PIC 99.                                 
229300     05 FILLER                        PIC X VALUE "/".                        
229305     05 WS-TEF-MES                    PIC 9(02).                              
229310     05 FILLER                        PIC X VALUE "/".                        
229315     05 WS-TEF-ANO                    PIC 9(04).                              
229320                                                                              
229510                                                                              
229515****************************************************************              
229520* CUARTO ENCABEZADO PARA EL REPORTE DE SDO.PEND. BLOQUEADOS.                  
229525****************************************************************              
229530 01  WS-04-BPEND.                                                             
229535     05 FILLER                          PIC X(10)                             
229540        VALUE "PROCESO   ".                                                   
229545     05 WS-BPEND-DIA1                   PIC 99.                               
229550     05 FILLER                          PIC X VALUE "/".                      
229555     05 WS-BPEND-MES1                   PIC 9(02).                            
229560     05 FILLER                          PIC X VALUE "/".                      
229565     05 WS-BPEND-ANO1                   PIC 9(04).                            
229570     05 FILLER                          PIC X(30) VALUE SPACES.               
229575     05 FILLER                          PIC X(31) VALUE                       
229580           " SALDOS PENDIENTES BLOQUEADOS  ".                                 
229585    05 FILLER                           PIC X(36) VALUE SPACES.               
229590    05 FILLER                           PIC X(05) VALUE "HOJA ".              
229595    05 WS-BPEND-HOJA                    PIC ZZZZ9.                            
229600                                                                              
229605****************************************************************              
229610* ENCABEZADO IMPRESO CUANDO EL LISTADO DE B.PEND. ESTA VACIO.                 
229615****************************************************************              
229620 01  WS-04-BPEND-VAC.                                                         
229625     05 FILLER                          PIC X(48) VALUE SPACES.               
229630     05 FILLER                          PIC X(35) VALUE                       
229635           " LISTADO DE BLO. DE SDOPEND VACIO ".                              
229640                                                                              
229810****************************************************************              
230110* CUARTO ENCABEZADO PARA EL REPORTE DE SALDOS DISPONIBLES.                    
230410****************************************************************              
230710 01  WS-04-DISPO.                                                             
231010     05 FILLER                          PIC X(10)                             
231310        VALUE "PROCESO   ".                                                   
231610     05 WS-DISPO-DIA1                   PIC 99.                               
231910     05 FILLER                          PIC X VALUE "/".                      
232210     05 WS-DISPO-MES1                   PIC 9(02).                            
232510     05 FILLER                          PIC X VALUE "/".                      
232810     05 WS-DISPO-ANO1                   PIC 9(04).                            
233110     05 FILLER                          PIC X(30) VALUE SPACES.               
233410     05 FILLER                          PIC X(31) VALUE                       
233710           "SALDOS DISPONIBLES POR CONTRATO".                                 
234010    05 FILLER                           PIC X(36) VALUE SPACES.               
234310    05 FILLER                           PIC X(05) VALUE "HOJA ".              
234610    05 WS-DISPO-HOJA                    PIC ZZZZ9.                            
234910                                                                              
235210****************************************************************              
235510* CUARTO ENCABEZADO PARA EL REPORTE DE INVENTARIO.                            
235810****************************************************************              
236110 01  WS-04-INVEN.                                                             
236410     05 FILLER                          PIC X(10) VALUE                       
236710        "PROCESO   ".                                                         
237010     05 WS-INVEN-DIA1                   PIC 99.                               
237310     05 FILLER                          PIC X VALUE "/".                      
237610     05 WS-INVEN-MES1                   PIC 9(02).                            
237910     05 FILLER                          PIC X VALUE "/".                      
238210     05 WS-INVEN-ANO1                   PIC 9(04).                            
238510     05 FILLER                          PIC X(30) VALUE SPACES.               
238810     05 FILLER                          PIC X(31) VALUE                       
239110           "     REPORTE DE INVERSIONES    ".                                 
239410    05 FILLER                           PIC X(36) VALUE SPACES.               
239710    05 FILLER                           PIC X(05) VALUE "HOJA ".              
240010    05 WS-INVEN-HOJA                    PIC ZZZZ9.                            
240015                                                                              
240020****************************************************************              
240025* CUARTO ENCABEZADO PARA EL REPORTE DE COMISIONES POR TEF.                    
240030****************************************************************              
240035 01  WS-04-TEF.                                                               
240040     05 FILLER                          PIC X(10)                             
240045        VALUE "PROCESO   ".                                                   
240050     05 WS-TEF-DIA1                     PIC 99.                               
240055     05 FILLER                          PIC X VALUE "/".                      
240060     05 WS-TEF-MES1                     PIC 9(02).                            
240065     05 FILLER                          PIC X VALUE "/".                      
240070     05 WS-TEF-ANO1                     PIC 9(04).                            
240075     05 FILLER                          PIC X(30) VALUE SPACES.               
240080     05 FILLER                          PIC X(31) VALUE                       
240085           " ESQUEMA PARA COMISIONES X/TEF ".                                 
240090    05 FILLER                           PIC X(36) VALUE SPACES.               
240095    05 FILLER                           PIC X(05) VALUE "HOJA ".              
240100    05 WS-TEF-HOJA                      PIC ZZZZ9.                            
240310                                                                              
240610****************************************************************              
240910* ENCABEZADO PARA LA HORA DE TODOS LOS REPORTES.                              
241210****************************************************************              
241510 01 WS-ENCA-HORA .                                                            
241810    05 FILLER                          PIC X(8) VALUE                         
242110        "HORA :  ".                                                           
242410    05 WS-H-HORA                       PIC Z9.                                
242710    05 FILLER                          PIC X VALUE ":".                       
243010    05 WS-H-MINUTO                     PIC 9(02).                             
243310    05 FILLER                          PIC X VALUE ":".                       
243610    05 WS-H-SEGUNDO                    PIC 9(02).                             
243910                                                                              
243915****************************************************************              
243920* ENCABEZADO PARA EL CSI Y TIPO DE PROCESO.                                   
243925****************************************************************              
243930 01 WS-CSIPRO.                                                                
243935    05 FILLER            PIC X(10) VALUE  "PROCESO:  ".                       
243940    05 WS-TIPPRO         PIC X(08) VALUE SPACES.                              
243945    05 FILLER            PIC X(10) VALUE  "    CSI:  ".                       
243950    05 WS-NUMCSI         PIC 99.                                              
243955                                                                              
243960****************************************************************              
243965* ENCABEZADO PARA EL PRD/INS/MON Y GRUPO DEL TEF.                             
243970****************************************************************              
243975 01 WS-PRDINSMON-GRU.                                                         
243980    05 FILLER            PIC X(16) VALUE  "PROD-INST-MON:  ".                 
243985    05 WS-TEF-PRD        PIC ZZZ9.                                            
243990    05 FILLER            PIC X     VALUE  SPACES.                             
243995    05 WS-TEF-INS        PIC ZZZ9.                                            
244000    05 FILLER            PIC X     VALUE  SPACES.                             
244005    05 WS-TEF-MON        PIC ZZZ9.                                            
244010    05 FILLER            PIC X     VALUE  SPACES.                             
244020    05 FILLER            PIC X(13) VALUE  "     GRUPO:  ".                    
244030    05 WS-TEF-GRUPO      PIC 9999.                                            
244040                                                                              
244210****************************************************************              
244510* ENCABEZADO PARA EL NUMERO Y NOMBRE DE SUCURSAL.                             
244810****************************************************************              
245110 01 WS-SUCURSAL.                                                              
245410    05 FILLER            PIC X(12) VALUE  "SUCURSAL:   ".                     
245710    05 WS-NUMSUC         PIC ZZZ9.                                            
246010    05 FILLER            PIC X(04) VALUE SPACES.                              
246310    05 WS-NOMSUC         PIC X(20) VALUE SPACES.                              
246610                                                                              
246620****************************************************************              
246630* ENCABEZADO PARA EL NUMERO DE SUCURSAL.                                      
246640****************************************************************              
246650 01 WS-SUCURSAL1.                                                             
246660    05 FILLER            PIC X(12) VALUE  "SUCURSAL:   ".                     
246670    05 WS-NUMSUC1        PIC ZZZ9.                                            
246680                                                                              
246700****************************************************************              
246705* ENCABEZADO PARA EL LISTADO DE COMISIONES POR TEF TITULO 1.                  
246710****************************************************************              
246715 01 WS-TIT-TEF1.                                                              
246720    05 FILLER            PIC X(06) VALUE  "NUMERO".                           
246725    05 FILLER            PIC X(50) VALUE                                      
246730    "                 P O R    R E N T A               ".                     
246735    05 FILLER            PIC X(50) VALUE                                      
246740    "               P O R   T R A N S A C C I O N      ".                     
246745                                                                              
246800****************************************************************              
246805* ENCABEZADO PARA EL LISTADO DE COMISIONES POR TEF TITULO 2.                  
246810****************************************************************              
246815 01 WS-TIT-TEF2.                                                              
246820    05 FILLER            PIC X(06) VALUE  "TARIFA".                           
246825    05 FILLER            PIC X(50) VALUE                                      
246830    "            CHEQUERA    TARJETA    AMBOS          ".                     
246835    05 FILLER            PIC X(50) VALUE                                      
246840    "               CHEQUERA    TARJETA    AMBOS       ".                     
246845                                                                              
246910****************************************************************              
247210* ENCABEZADO PARA EL SALDO DISPONIBLE.                                        
247510****************************************************************              
247810 01  WS-TIT-DISP.                                                             
248110     02 FILLER                            PIC X(16) VALUE                     
248410        "   NUM. CONTRATO".                                                   
248710     02 FILLER                            PIC X(18) VALUE                     
249010        "       SDO. ACTUAL".                                                 
249310     02 FILLER                            PIC X(21) VALUE                     
249610        "           DISPONIBLE".                                              
249910     02 FILLER                            PIC X(26) VALUE                     
250210        "             NUM. CONTRATO".                                         
250510     02 FILLER                            PIC X(18) VALUE                     
250810        "       SDO. ACTUAL".                                                 
251110     02 FILLER                            PIC X(21) VALUE                     
251410        "           DISPONIBLE".                                              
251710                                                                              
251715****************************************************************              
251720* ENCABEZADO PARA EL BLOQUEO DE SDOS. PENDIENTES.                             
251725****************************************************************              
251730 01  WS-TIT-BPEN.                                                             
251735     02 FILLER                            PIC X(09) VALUE                     
251740        " CLAVE   ".                                                          
251745     02 FILLER                            PIC X(14) VALUE                     
251750        "   CONTRATO   ".                                                     
251755     02 FILLER                            PIC X(23) VALUE                     
251760        "       IMPORTE         ".                                            
251765     02 FILLER                            PIC X(15) VALUE                     
251770        "  PRD/INS/MON  ".                                                    
251775     02 FILLER                            PIC X(10) VALUE                     
251780        " SUC.TRAN ".                                                         
251785     02 FILLER                            PIC X(06) VALUE                     
251790        " CAJA ".                                                             
251795     02 FILLER                            PIC X(14) VALUE                     
251800        " AUTORIZACION ".                                                     
251805     02 FILLER                            PIC X(08) VALUE                     
251810        " NOMINA ".                                                           
251815     02 FILLER                            PIC X(10) VALUE                     
251820        "   HORA   ".                                                         
252010****************************************************************              
252310* ENCABEZADO PARA EL INVENTARIO DE AHORROS.                                   
252610****************************************************************              
252910 01  WS-TIT-INVEN  .                                                          
253210     02 FILLER                           PIC X(26) VALUE                      
253510        "                    CUENTA".                                         
253810     02 FILLER                           PIC X(13) VALUE SPACES.              
254110     02 FILLER                           PIC X(12) VALUE                      
254410        "SALDO ACTUAL".                                                       
254710     02 FILLER                           PIC X(18) VALUE                      
255010        "  FECHA ULMOV.   ".                                                  
255310     02 FILLER                           PIC X(10) VALUE SPACES.              
255610     02 FILLER                           PIC X(08) VALUE                      
255910        "  NOMBRE".                                                           
256210     02 FILLER                           PIC X(23) VALUE SPACES.              
256510     02 FILLER                           PIC X(09) VALUE                      
256810        "  PERSONA".                                                          
257110     02 FILLER                           PIC X(08) VALUE                      
257410        "  STATUS".                                                           
257710                                                                              
258010****************************************************************              
258310* DETALLE DE EL REPORTE DE SALDO DISPONIBLE.                                  
258610****************************************************************              
258910 01  WS-DET-SDODISP.                                                          
259210     05 FILLER                         PIC X(02) VALUE SPACES.                
259510     05 WS-SDODIS-CTO                  PIC 9(11).                             
259810     05 FILLER                         PIC X VALUE "-".                       
260110     05 WS-SDODIS-DIG                  PIC 9.                                 
260410     05 FILLER                         PIC X(3) VALUE SPACES.                 
260710     05 WS-SDODIS-SALDO                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
261010     05 FILLER                         PIC X(3) VALUE SPACES.                 
261310     05 WS-SDODIS-DISPO                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
261610     05 FILLER                         PIC X(9) VALUE SPACES.                 
261910     05 WS-SDODIS-CTO1                 PIC 9(11).                             
262210     05 FILLER                         PIC X VALUE "-".                       
262510     05 WS-SDODIS-DIG1                 PIC 9.                                 
262810     05 FILLER                         PIC X(3) VALUE SPACES.                 
263110     05 WS-SDODIS-SALDO1               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
263410     05 FILLER                         PIC X(3) VALUE SPACES.                 
263710     05 WS-SDODIS-DISPO1               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
264010                                                                              
264015****************************************************************              
264020* DETALLE DE EL REPORTE DE BLOQUEO DE SALDOS PENDIENTES.                      
264025****************************************************************              
264030 01  WS-DET-BLOPEND.                                                          
264035     05 FILLER                         PIC X(02) VALUE SPACES.                
264040     05 WS-BPEND-CVE                   PIC 9(04).                             
264045     05 FILLER                         PIC X(04) VALUE SPACES.                
264050     05 WS-BPEND-CTO                   PIC 9(12).                             
264055     05 FILLER                         PIC X     VALUE SPACES.                
264060     05 WS-BPEND-IMP                   PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.             
264065     05 FILLER                         PIC X(03) VALUE SPACES.                
264070     05 WS-BPEND-PRD                   PIC 9(04).                             
264075     05 FILLER                         PIC X     VALUE "/".                   
264080     05 WS-BPEND-INS                   PIC 9(04).                             
264085     05 FILLER                         PIC X     VALUE "/".                   
264090     05 WS-BPEND-MON                   PIC 9(03).                             
264100     05 FILLER                         PIC X(04) VALUE SPACES.                
264105     05 WS-BPEND-STRAN                 PIC 9(04).                             
264110     05 FILLER                         PIC X(04) VALUE SPACES.                
264115     05 WS-BPEND-CAJA                  PIC 9(02).                             
264120     05 FILLER                         PIC X(06) VALUE SPACES.                
264125     05 WS-BPEND-AUT                   PIC 9(08).                             
264130     05 FILLER                         PIC X(03) VALUE SPACES.                
264150     05 WS-BPEND-NOMINA                PIC 9(08).                             
264155     05 FILLER                         PIC X     VALUE SPACES.                
264160     05 WS-BPEND-HH                    PIC 9(02).                             
264165     05 FILLER                         PIC X     VALUE ":".                   
264170     05 WS-BPEND-MM                    PIC 9(02).                             
264175     05 FILLER                         PIC X     VALUE ":".                   
264180     05 WS-BPEND-SS                    PIC 9(02).                             
264190                                                                              
264310****************************************************************              
264610* DETALLE DE EL REPORTE DE INVENTARIO.                                        
264910****************************************************************              
265210 01  WS-DET-INVEN.                                                            
265510     05 FILLER                  PIC X(14) VALUE SPACES.                       
265810     05 WS-INVE-CTO             PIC ZZZZZZZZZZZ9.                             
266110     05 FILLER                  PIC X(02) VALUE SPACES.                       
266410     05 WS-INVE-SDOACT          PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                    
266710     05 FILLER                  PIC X(03) VALUE SPACES.                       
267010     05 WS-INVE-DIA             PIC 99.                                       
267310     05 FILLER                  PIC X VALUE "/".                              
267610     05 WS-INVE-MES             PIC 99.                                       
267910     05 FILLER                  PIC X VALUE "/".                              
268210     05 WS-INVE-ANO             PIC 9(04).                                    
268510     05 FILLER                  PIC X(14) VALUE SPACES.                       
268810     05 WS-INVE-NOMBRE          PIC X(36).                                    
269110     05 FILLER                  PIC X(04) VALUE SPACES.                       
269410     05 WS-INVE-PERSONA         PIC 99.                                       
269710     05 FILLER                  PIC X(05) VALUE SPACES.                       
270010     05 WS-INVE-STATUS          PIC X(09).                                    
270310                                                                              
270315****************************************************************              
270320* DETALLE DE EL REPORTE DE COMISIONES POR TEF.                                
270325****************************************************************              
270330 01  WS-DET-TEF.                                                              
270335     05 WS-TEF-COR1             PIC X .                                       
270340     05 WS-TEF-OCC              PIC 99.                                       
270345     05 WS-TEF-COR2             PIC X .                                       
270350     05 WS-TEF-TARI             PIC 9999.                                     
270355     05 FILLER                  PIC X(13) VALUE SPACES.                       
270360     05 WS-TEF-CHER             PIC 9999.                                     
270365     05 FILLER                  PIC X(07) VALUE SPACES.                       
270370     05 WS-TEF-TARR             PIC 9999.                                     
270375     05 FILLER                  PIC X(06) VALUE SPACES.                       
270380     05 WS-TEF-AMBR             PIC 9999.                                     
270385     05 FILLER                  PIC X(28) VALUE SPACES.                       
270390     05 WS-TEF-CHET             PIC 9999.                                     
270395     05 FILLER                  PIC X(07) VALUE SPACES.                       
270400     05 WS-TEF-TART             PIC 9999.                                     
270405     05 FILLER                  PIC X(06) VALUE SPACES.                       
270410     05 WS-TEF-AMBT             PIC 9999.                                     
270415                                                                              
270610****************************************************************              
270910*    LETREROS PARA IMPRESION DE TOT DE SDOACT DISP P/SUC.                     
271210****************************************************************              
271510 01 WS-TOT-SDOACT-SUC.                                                        
271810    05 FILLER                          PIC X(32) VALUE                        
272110       "  TOTAL SDO. ACTUAL P/SUC       ".                                    
272410    05 FILLER                          PIC X(18) VALUE SPACES.                
272710    05 WS-SDODIS-SDOSUC                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
273010                                                                              
273310****************************************************************              
273610*    LETREROS PARA IMPRESION DE TOT DE SDOACT DISP P/MON.                     
273910****************************************************************              
274210 01 WS-TOT-SDOACT-MON.                                                        
274510    05 FILLER                          PIC X(32) VALUE                        
274810       "  TOTAL SDO. ACTUAL P/MON.      ".                                    
275110    05 FILLER                          PIC X(18) VALUE SPACES.                
275410    05 WS-SDODIS-SDOMON                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
275710                                                                              
276010****************************************************************              
276310*    LETREROS PARA IMPRESION DE TOT DE SDOACT DISP P/INS.                     
276610****************************************************************              
276910 01 WS-TOT-SDOACT-INS.                                                        
277210    05 FILLER                          PIC X(32) VALUE                        
277510       "  TOTAL SDO. ACTUAL POR INSTRUM.".                                    
277810    05 FILLER                          PIC X(18) VALUE SPACES.                
278110    05 WS-SDODIS-SDOINS                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
278410                                                                              
278710****************************************************************              
279010*    LETREROS PARA IMPRESION DE TOT DE SDOACT DISP P/PRD.                     
279310****************************************************************              
279610 01 WS-TOT-SDOACT-PRD.                                                        
279910    05 FILLER                          PIC X(32) VALUE                        
280210       "  TOTAL SDO. ACTUAL P/PRD       ".                                    
280510    05 FILLER                          PIC X(18) VALUE SPACES.                
280810    05 WS-SDODIS-SDOPRD                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
281110                                                                              
281410****************************************************************              
281710*    LETREROS PARA IMPRESION DE TOT DE SDOACT  DISP P/NODO.                   
282010****************************************************************              
282310 01 WS-TOT-SDONODO  .                                                         
282610    05 FILLER                         PIC X(32) VALUE                         
282910       "  TOTAL SDO. ACTUAL P/NODO      ".                                    
283210    05 FILLER                         PIC X(18) VALUE SPACES.                 
283510    05 WS-SDODIS-SDONODO              PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                
283810                                                                              
284110****************************************************************              
284410*    LETREROS PARA IMPRESION DE TOT DE SDOACT  DISP POR CSI.                  
284710****************************************************************              
285010 01 WS-TOT-SDOCSI.                                                            
285310    05 FILLER                          PIC X(32) VALUE                        
285610       "  TOTAL SDO. ACTUAL P/CSI       ".                                    
285910    05 FILLER                          PIC X(18) VALUE SPACES.                
286210    05 WS-SDODIS-SDOCSI                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
286510                                                                              
286810****************************************************************              
287110*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE P/SUC.                     
287410****************************************************************              
287710 01 WS-TOT-DISP-SUC .                                                         
288010    05 FILLER                          PIC X(32) VALUE                        
288310       "  TOTAL SDO. DISPONIBLE P/SUC   ".                                    
288610    05 FILLER                          PIC X(5) VALUE SPACES.                 
288910    05 WS-SDODIS-NUMSUC                PIC Z,ZZZ,ZZ9.                         
289210    05 FILLER                          PIC X(4) VALUE SPACES.                 
289510    05 WS-SDODIS-DISSUC                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
289810                                                                              
290110****************************************************************              
290410*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE P/MON.                     
290710****************************************************************              
291010 01 WS-TOT-DISP-MON .                                                         
291310    05 FILLER                          PIC X(32) VALUE                        
291610       "  TOTAL SDO. DISPONIBLE P/MON   ".                                    
291910    05 FILLER                          PIC X(5) VALUE SPACES.                 
292210    05 WS-SDODIS-NUMMON                PIC Z,ZZZ,ZZ9.                         
292510    05 FILLER                          PIC X(4) VALUE SPACES.                 
292810    05 WS-SDODIS-DISMON                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
293110                                                                              
293410****************************************************************              
293710*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE P/INS.                     
294010****************************************************************              
294310 01 WS-TOT-DISP-INS .                                                         
294610    05 FILLER                          PIC X(32) VALUE                        
294910       "  TOTAL DISPONIBLE  POR INSTRUM.".                                    
295210    05 FILLER                          PIC X(5) VALUE SPACES.                 
295510    05 WS-SDODIS-NUMINS                PIC Z,ZZZ,ZZ9.                         
295810    05 FILLER                          PIC X(4) VALUE SPACES.                 
296110    05 WS-SDODIS-DISINS                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
296410                                                                              
296710****************************************************************              
297010*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE P/PRD.                     
297310****************************************************************              
297610 01 WS-TOT-DISP-PRD .                                                         
297910    05 FILLER                          PIC X(32) VALUE                        
298210       "  TOTAL SDO. DISPONIBLE P/PRD   ".                                    
298510    05 FILLER                          PIC X(5) VALUE SPACES.                 
298810    05 WS-SDODIS-NUMPRD                PIC Z,ZZZ,ZZ9.                         
299110    05 FILLER                          PIC X(4) VALUE SPACES.                 
299410    05 WS-SDODIS-DISPRD                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
299710                                                                              
300010****************************************************************              
300310*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE POR NODO                   
300610****************************************************************              
300910 01 WS-TOT-DISNODO.                                                           
301210    05 FILLER                          PIC X(32) VALUE                        
301510       "  TOTAL SDO. DISPONIBLE P/NODO  ".                                    
301810    05 FILLER                          PIC X(5) VALUE SPACES.                 
302110    05 WS-SDODIS-NUMNODO               PIC Z,ZZZ,ZZ9.                         
302410    05 FILLER                          PIC X(4) VALUE SPACES.                 
302710    05 WS-SDODIS-DISNODO               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
303010                                                                              
303310****************************************************************              
303610*    LETREROS PARA IMPRESION DE TOT. DE DISPONIBLE POR CSI.                   
303910****************************************************************              
304210 01 WS-TOT-DISCSI.                                                            
304510    05 FILLER                          PIC X(32) VALUE                        
304810       "  TOTAL SDO. DISPONIBLE P/CSI   ".                                    
305110    05 FILLER                          PIC X(5) VALUE SPACES.                 
305410    05 WS-SDODIS-NUMCSI                PIC Z,ZZZ,ZZ9.                         
305710    05 FILLER                          PIC X(4) VALUE SPACES.                 
306010    05 WS-SDODIS-DISCSI                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.               
306310                                                                              
306610****************************************************************              
306910*    LETREROS PARA IMPRESION DE TOT. DEL INVENTARIO DE AHO.                   
307210****************************************************************              
307510 01 WS-TOT-AHORROS.                                                           
307810    05 WS-TIT-AHO                      PIC X(32) VALUE SPACES.                
308110    05 WS-NUM-AHO                      PIC ZZ,ZZZ,ZZ9.                        
308410    05 WS-IMP-AHO                      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                
308710                                                                              
309010****************************************************************              
309310*           P R O C E D U R E          D I V I S I O N.                       
309610****************************************************************              
309910 PROCEDURE DIVISION.                                                          
310210********************                                                          
310510                                                                              
310810****************************************************************              
311110****************************************************************              
311410*             R U T I N A          P R I N C I P A L.                         
311710****************************************************************              
312010****************************************************************              
312310                                                                              
312610 00000000-INICIO SECTION.                                                     
312910 00000000-PRINCIPAL.                                                          
312930                                                                              
312950     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-TASKVALUE.                      
312955**   STOP "VALUE RECIBIDO FECHA <" WS-VAL-FEC  ">"                            
312956**                  "SIN-LIS408 <" WS-SIN-S408 ">".                           
312970     MOVE "P180"              TO WS-0101-PASO-MSG.                            
312990     MOVE "25MTP005"          TO WS-0101-MTP-MSG B91-IDPROG.                  
313010     MOVE "S500P180"          TO W77-S000-MY-ID.                              
313030     MOVE "25MTP005"          TO W77-S000-MY-VERSION.                         
313050     MOVE 2                   TO W77-USO-LIBLJ.                               
313070                                                                              
313110     PERFORM 10000010-NAME-HOST          THRU 10000010-EXIT.                  
313210     PERFORM 10000000-LIBRERIAS          THRU 10000000-EXIT.                  
313510     PERFORM 20000000-OPEN               THRU 20000000-EXIT.                  
313810     PERFORM 50000000-PROCESOS           THRU 50000000-EXIT.                  
314110     PERFORM 70000000-CIERRO             THRU 70000000-EXIT.                  
314410     STOP RUN.                                                                
314710                                                                              
315010                                                                              
315310                                                                              
315610                                                                              
315910                                                                              
316210******************************************************************            
316510******************************************************************            
316810*         R U T I N A S  D E   S E L E C C I O N   D E                        
317110*    L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S              
317410*                  P O R   E L   P R O G R A M A.                             
317710******************************************************************            
318010******************************************************************            
318110 10000010-NAME-HOST.                                                          
318120     MOVE ATTRIBUTE HOSTNAME  OF MYSELF TO WKS-NAME-HOST.                     
318130     IF WKS-MY-HOST = "VDMALFA.            "                                  
318140     OR WKS-MY-HOST = "MONBETA.            "                                  
318150        MOVE 1 TO W77-QUE-AMBIENTE                                            
318160     ELSE                                                                     
318170     IF WKS-MY-HOST = "ACYPBETA.           "                                  
318180     OR WKS-MY-HOST = "VDMBETA.            "                                  
318190        MOVE 3 TO W77-QUE-AMBIENTE                                            
318200     ELSE                                                                     
318210        MOVE 2 TO W77-QUE-AMBIENTE.                                           
318220                                                                              
318230     IF W88-ES-PRODUCCION                                                     
318240        IF WS-SIN-S408 = 0                                                    
318250           NEXT SENTENCE                                                      
318260        ELSE                                                                  
318270           STRING "VALUE ERRONEO PARA PRODUCCION, " WS-TASKVALUE              
318280                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
318290           PERFORM 70000050-MENSAJE                                           
318300           CALL SYSTEM DMTERMINATE.                                           
318310                                                                              
318320 10000010-EXIT.                                                               
318330     EXIT.                                                                    
318410                                                                              
318610 10000000-LIBRERIAS.                                                          
318910                                                                              
319210******************************************************************            
319510* CHANGE A LA LIBRARIA DE VERSIONES.                                          
319810******************************************************************            
320110     PERFORM 10000100-VERSIONES.                                              
320410                                                                              
320710******************************************************************            
321010* ACCESO LA LIBRERIA DE ESTRUCTURA POR MEDIO DEL CONTROL DE                   
321310* VERSIONES Y CATALOGOS PARA OBTENER NODOS,CSI Y NOMBRE DE SUCS.              
321610******************************************************************            
321910     PERFORM 10000080-S080IVA.                                                
321920     PERFORM 10000080-S080L700.                                               
322210                                                                              
322510******************************************************************            
322810* CHANGE A LA LIBRERIA DE CONSULTA DEL S408 PARA CHECAR LA LINEA              
323110* DE CREDITO.                                                                 
323410******************************************************************            
323710     PERFORM 10000408-LINCRED.                                                
324010                                                                              
324310******************************************************************            
324610* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
324910******************************************************************            
325210     PERFORM 10000006-LOCSUP.                                                 
325510                                                                              
325810                                                                              
326110******************************************************************            
326410* CHANGE A LA LIBRERIA DE SALDOS DEL S151.                                    
326710******************************************************************            
327010     PERFORM 10000151-REGISTRA.                                               
327020                                                                              
327030******************************************************************            
327040* CHANGE A LA LIBRERIA DEL S016-L422 PARA EL NUM. DE INTERCOMPANY.            
327050******************************************************************            
327060     PERFORM 10000016-L422.                                                   
327070                                                                              
327080******************************************************************            
327090* CHANGE A LA LIBRARIA MAPLI PARA MONITOREO DE APLICACIONES.                  
327100******************************************************************            
327110   PERFORM 1000038-S038L035.                                                  
327120                                                                              
327130******************************************************************            
327140* CHANGE A LA LIBRERIA S500 L040 LIGAS CUENTA GLOBAL.                         
327150******************************************************************            
327160   PERFORM 10000500-L040LIGAS.                                                
327170                                                                              
327310 10000000-EXIT.                                                               
327610    EXIT.                                                                     
327910                                                                              
328210                                                                              
328510                                                                              
328810                                                                              
329110                                                                              
329410******************************************************************            
329710******************************************************************            
330010*                             O P E N.                                        
330310*  R U T I N A S   P A R A   A P E R T U R A   D E   B A S E   Y              
330610*                            A R C H I V O S.                                 
330910******************************************************************            
331210******************************************************************            
331510                                                                              
331810 20000000-OPEN.                                                               
331820     PERFORM 20000010-INI-MAPLI    THRU 20000010-EXIT.                        
333310                                                                              
333320     MOVE ZEROS                    TO WKS-TB-NUMACT-LIBS.                     
333330     MOVE 20                       TO WKS-NUMACT-LIB(15).                     
333340     MOVE 21                       TO WKS-NUMACT-LIB(20).                     
333350     MOVE 22                       TO WKS-NUMACT-LIB(33).                     
333360     MOVE 23                       TO WKS-NUMACT-LIB(35).                     
333370     MOVE 24                       TO WKS-NUMACT-LIB(36).                     
333380     MOVE 25                       TO WKS-NUMACT-LIB(41).                     
333390     MOVE 26                       TO WKS-NUMACT-LIB(50).                     
333400     MOVE 27                       TO WKS-NUMACT-LIB(53).                     
333410     MOVE 28                       TO WKS-NUMACT-LIB(86).                     
333510     MOVE 29                       TO WKS-NUMACT-LIB(99).                     
333610     PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT.                        
333620     PERFORM 20000055-TRANSIT      THRU 20000055-EXIT.                        
333640     PERFORM 20000070-ACT01-BD     THRU 20000070-EXIT.                        
333910     PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT.                        
334210     PERFORM 20002000-FECHA-PRO    THRU 20002000-EXIT.                        
334510     PERFORM 20004000-HORA         THRU 20004000-EXIT.                        
334810     PERFORM 20005000-FECHA-DIA    THRU 20005000-EXIT.                        
335110     PERFORM 20007000-OPEN-ARC     THRU 20007000-EXIT.                        
335410     PERFORM 20008000-HEADERS      THRU 20008000-EXIT.                        
335710     PERFORM 20009000-CALL-151INI  THRU 20009000-EXIT.                        
335720     PERFORM 20009100-FIN-ACT01    THRU 20009100-EXIT.                        
336010 20000000-EXIT.                                                               
336310     EXIT.                                                                    
336320                                                                              
336330******************************************************************            
336340* LIBRERIA MAPLI ENTRY POINT S038L035_01_PROG_INI .                           
336350* FUNCION : PARA INDICAR EL INICIO DE CORRIDA DE UN PROGRAMA                  
336360* Y DARSE DE ALTA EN LA LIBRERIA MAPLI.                                       
336370******************************************************************            
336380 20000010-INI-MAPLI.                                                          
336390     MOVE 1                      TO W77-ID-NUM-COPIA-MAPLI                    
336400     MOVE 1                      TO W77-ID-TPODSP-INFO-MAPLI                  
336410     MOVE 0                      TO W77-ID-ESINI-GRUPO-MAPLI                  
336420     MOVE 06                     TO W77-ID-NUM-GRUPO-MAPLI                    
336430     MOVE "BATCH DIARIO"         TO W77-ID-NOMB-LIB                           
336440     PERFORM 70000950-INI-PGM-MAPLI.                                          
336450 20000010-EXIT.                                                               
336460    EXIT.                                                                     
336610                                                                              
336910******************************************************************            
337210* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
337510******************************************************************            
337810 20000050-CHECO-VER.                                                          
337910     IF W88-ES-DESARROLLO                                                     
337920        NEXT SENTENCE                                                         
337930     ELSE                                                                     
338110        PERFORM 20000100-CHECAME-VERSION                                      
338410        IF S000-CTR-CVEERROR < 0                                              
339310           MOVE "VER. EJECUTADA DIF. A VERSIONES"                             
339320             TO WS-0101-TEXT-MSG                                              
339610           PERFORM 70000050-MENSAJE                                           
339910           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
340210 20000050-EXIT.                                                               
340510    EXIT.                                                                     
340810                                                                              
340815******************************************************************            
340820* LLAMADOS NECESARIOS PARA EL MANEJO DE TRANSIT POR PARTE DEL 408.            
340825******************************************************************            
340830 20000055-TRANSIT.                                                            
340835     PERFORM 0000-CHANGE-XATMI.                                               
340837     MOVE "S500P180"                TO  WS-XATMI-PROG-NAME.                   
340840     PERFORM 0000-CALL-TRANSIT.                                               
340845     IF WS-XATMI-RSLT = 0                                                     
340850        NEXT SENTENCE                                                         
340855     ELSE                                                                     
340860        MOVE WS-XATMI-RSLT           TO WS-RSLT-TRANSIT                       
340875        STRING "ERROR EN TP_IDENTIFY ", WS-RSLT-TRANSIT                       
340880        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
340885        PERFORM 70000050-MENSAJE                                              
340886        IF W88-ES-DESARROLLO                                                  
340888           NEXT SENTENCE                                                      
340889        ELSE                                                                  
340890           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
340895 20000055-EXIT.                                                               
340900    EXIT.                                                                     
340905                                                                              
340982******************************************************************            
340984* PRIMERA ACT. TIPO PROC. PARA INDICAR APERTURA DE BASE.                      
340986******************************************************************            
340988 20000070-ACT01-BD.                                                           
340990   MOVE 1                                   TO W77-ID-NUMREG-PROC.            
340992   MOVE 01                                  TO W77-ID-ACTXX-MAPLI             
340994                                                  WS-NUM-ACT01.               
340996   MOVE "ABRO BASE,ARCHIVOS Y OBTENGO DAT.INI" TO W77-ID-NOMB-LIB.            
340998   MOVE "PROC. EJECUTADO DE UNICA VEZ "        TO W77-ID-TXTA-LIB.            
341000   PERFORM 70000910-INIACT-MAPLI.                                             
341005  20000070-EXIT.                                                              
341010   EXIT.                                                                      
341020                                                                              
341110******************************************************************            
341410* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
341710******************************************************************            
342010 20001000-ABRO-BASE.                                                          
342310     OPEN INQUIRY S500BD01CAPTACION                                           
342610     ON EXCEPTION                                                             
343510        MOVE "ERROR AL ABRIR LA BASE      " TO WS-0101-TEXT-MSG               
343810        PERFORM 70000050-MENSAJE                                              
344110        CALL SYSTEM DMTERMINATE.                                              
344410                                                                              
344710    SET S500B02CONTROL        TO BEGINNING.                                   
345010    SET S500B03CONTRATOS      TO BEGINNING.                                   
345310    SET S500B05INSTRUMEN      TO BEGINNING.                                   
345610    SET S500B06HISTORICO      TO BEGINNING.                                   
345620    SET S500B36GRUPOCOM       TO BEGINNING.                                   
345910 20001000-EXIT.                                                               
346210    EXIT.                                                                     
346510                                                                              
346810******************************************************************            
347110* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
347410******************************************************************            
347710 20002000-FECHA-PRO.                                                          
348010  PERFORM 90000002-B02CONTROL-FIND                                            
348310  IF WS-STATUS-BASE > 0                                                       
348610    IF WS-STATUS-BASE = 1                                                     
349510       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
349810       PERFORM 70000050-MENSAJE                                               
350110       CALL SYSTEM DMTERMINATE                                                
350410    ELSE                                                                      
351310       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
351610       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
351910       PERFORM 70000050-MENSAJE                                               
352210       CALL SYSTEM DMTERMINATE.                                               
352510                                                                              
352810     PERFORM 20002100-PROY-FEC        THRU  20002100-EXIT.                    
353110     MOVE WS-FECHA-PRO   TO WS-FEC-BLOQUEO    WS-BPEND-FEC                    
353410                            WS-INVEN-FECHA    WS-FIN-FECHA                    
353710                            WS-DISPO-FECHA                                    
353720                            WS-BPEND-FECHA    WS-BPEND-FEC1                   
353730                            WS-TEF-FECHA      WS-FIN-FECHA-CBII               
354010                            WS-151-FECHA                                      
354310                            WS-TB-FECHA       WS-TB-FECHAT                    
354610                            S151FIN-FECPRO    WS-TBHE-FECBASE                 
354612          WS-INVE-FECHA-T   CBIIFIN-FECPRO    WS-BPEND-FEC3                   
354620                            WS-INVE-FECHA-T   WS-BPEND-FEC2.                  
354910                                                                              
354920     MOVE 0              TO WS-BPEND-SUBNODO  WS-TEF-SUBNODO.                 
355210     MOVE B02-TC-TCAMBIO TO WS-TIPCAM                                         
355510                            WS-TBHE-TIPCAM.                                   
355810                                                                              
356110     IF B02-NUM-CSI  = 4                                                      
356410        COMPUTE   WS-CSIMON = B02-NUM-CSI  - 1                                
356710     ELSE                                                                     
357010        MOVE B02-NUM-CSI  TO WS-CSIMON.                                       
357310     MOVE WS-TAB-CSI(WS-CSIMON)               TO WS-151-CSI.                  
357610     MOVE 10             TO WS-TB-CSID        WS-TB-CSIDT.                    
357910     MOVE B02-NUM-CSI    TO WS-H151-CSIO      WS-TBDE-CSI                     
358210                            WS-TB-CSIO        WS-TB-CSIOT                     
358212* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS Y DATOTECA-DDG             
358235                            WS-BPEND-CSIO     WS-BPEND-CSID                   
358236                            WS-BPEND-CSIO1    WS-BPEND-CSID1                  
358237                            WS-BPEND-CSIO2    WS-BPEND-CSID2                  
358238                            WS-BPEND-CI       WS-TEF-CI                       
358239            WS-INVE-CSIO-T  WS-BPEND-CSIO3    WS-BPEND-CSID3                  
358240                                              WS-NUMCSI.                      
358510                                                                              
358810     MOVE WS-PRO-DD   TO WS-INVEN-DIA1        WS-TEF-DIA1                     
359110                         WS-DISPO-DIA1                                        
359410                         WS-D151-FECH-DD      WS-SUC151-FECH-DD               
359420                         WS-BPEND-DIA1                                        
359710                         WS-GLO151-FECH-DD    WS-H151-FPRO-DD.                
360010                                                                              
360310     MOVE WS-PRO-MM   TO WS-INVEN-MES1        WS-BPEND-MES1                   
360610                         WS-DISPO-MES1        WS-TEF-MES1                     
360910                         WS-D151-FECH-MM      WS-SUC151-FECH-MM               
361210                         WS-GLO151-FECH-MM    WS-H151-FPRO-MM.                
361510                                                                              
361810     MOVE WS-PRO-AA   TO WS-INVEN-ANO1        WS-BPEND-ANO1                   
362110                         WS-DISPO-ANO1        WS-TEF-ANO1                     
362410                         WS-D151-FECH-AA      WS-SUC151-FECH-AA               
362710                         WS-GLO151-FECH-AA    WS-H151-FPRO-AA.                
363010                                                                              
363310     MOVE 1           TO WS-H151-FOR.                                         
363610     MOVE "S500"      TO S151FIN-SISTEMA CBIIFIN-SISTEMA.                     
363630                                                                              
363640                                                                              
363910 20002000-EXIT.                                                               
364210    EXIT.                                                                     
364510                                                                              
364810******************************************************************            
365110* PROYECTO LA FECHA DE LA BASE UN DIA PARA SABER SI ES FIN DE MES             
365410* Y TOMARLO EN CUENTA PARA LA VALIDACION DEL PASO.                            
365710******************************************************************            
366010 20002100-PROY-FEC.                                                           
366310    IF WS-VAL-FEC > 0                                                         
366610       MOVE WS-VAL-FEC              TO    WS-S006-FECHA1                      
366910       MOVE 1                       TO    WS-S006-FECHA2                      
367210       MOVE 13                      TO    WS-S006-FORMATO                     
367510       MOVE 13                      TO    WS-S006-FUNCION                     
367810       PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT                       
368110       MOVE WS-S006-FECHA1          TO    WS-FEC-CALCULADA-AMD1               
368410    ELSE                                                                      
368710       MOVE B02-FECHA-LINEA         TO    WS-FEC-CALCULADA-AMD.               
369010    PERFORM 20002110-DIAPRO     THRU 20002110-EXIT.                           
369310    PERFORM 20002120-SEMANA     THRU 20002120-EXIT.                           
369610 20002100-EXIT.                                                               
369910    EXIT.                                                                     
370210                                                                              
370510******************************************************************            
370810* PROYECTO LA FECHA LINEA UN DIA HACIA ATRAS PARA OBTENER LA                  
371110* FECHA DE PROCESO, PUES AL CORRER ESTE PASO LAS FECHAS YA FUERON             
371410* PROYECTADAS AL SIGUIENTE DIA.                                               
371710******************************************************************            
372010 20002110-DIAPRO.                                                             
372310       MOVE B02-FECHA-LINEA      TO    WS-S006-FECHA1                         
372610       MOVE 1                    TO    WS-S006-FECHA2                         
372910       MOVE 12                   TO    WS-S006-FORMATO                        
373210       MOVE 15                   TO    WS-S006-FUNCION                        
373510       PERFORM 40000000-CALL-FECPRO    THRU  40000000-EXIT.                   
373810                                                                              
374110       IF WS-VAL-FEC > 0                                                      
374410          MOVE WS-VAL-FEC        TO    WS-FECHA-PRO                           
374710          IF WS-PRO-MM NOT = WS-CALCULADA-MM1                                 
375010             MOVE 1                 TO    WS-MENSUAL.                         
375310                                                                              
375610       IF WS-VAL-FEC = 0                                                      
375910          MOVE WS-S006-FECHA1    TO    WS-FECHA-PRO                           
376210          IF WS-PRO-MM NOT = WS-CALCULADA-MM                                  
376510             MOVE 1                 TO    WS-MENSUAL.                         
376810 20002110-EXIT.                                                               
377110    EXIT.                                                                     
377410                                                                              
377710******************************************************************            
378010* VERIFICO SI LA FECHA DE PROCESO ES FIN DE SEMANA O NO.                      
378310******************************************************************            
378610 20002120-SEMANA.                                                             
378910    MOVE WS-FECHA-PRO            TO    WS-S006-FECHA1                         
379210    MOVE 12                      TO    WS-S006-FORMATO                        
379510    MOVE 6                       TO    WS-S006-FUNCION                        
379810    PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT.                         
380110    IF WS-S006-FECHA1     = 00000005                                          
380410       MOVE 1                    TO    WS-SEMANAL                             
380710    ELSE                                                                      
381010       PERFORM 20002121-INFEC    THRU  20002121-EXIT                          
381310       IF WS-S006-FECHA1 = 00000001                                           
381610          MOVE 1                 TO    WS-SEMANAL.                            
381910 20002120-EXIT.                                                               
382210    EXIT.                                                                     
382510                                                                              
382810******************************************************************            
383110* VERIFICO SI LA FECHA INTRODUCIDA POR PARAMETRO ES SEMANAL.                  
383410******************************************************************            
383710 20002121-INFEC.                                                              
384010    IF WS-VAL-FEC > 0                                                         
384310       MOVE WS-FEC-CALCULADA-AMD1   TO    WS-S006-FECHA1                      
384610       MOVE 12                      TO    WS-S006-FORMATO                     
384910       MOVE 6                       TO    WS-S006-FUNCION                     
385210       PERFORM 40000000-CALL-FECPRO THRU 40000000-EXIT                        
385510    ELSE                                                                      
385810       MOVE B02-FECHA-LINEA      TO    WS-S006-FECHA1                         
386110       MOVE 12                   TO    WS-S006-FORMATO                        
386410       MOVE 6                    TO    WS-S006-FUNCION                        
386710       PERFORM 40000000-CALL-FECPRO    THRU 40000000-EXIT.                    
387010 20002121-EXIT.                                                               
387310   EXIT.                                                                      
387610                                                                              
387910******************************************************************            
388210* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
388510******************************************************************            
388810 20004000-HORA.                                                               
389110        ACCEPT  WS-HORA-HMSC-N    FROM TIME.                                  
389410        MOVE WS-HORA-HH-N     TO  WS-H-HORA    WS-H151-CREA-HH.               
389710        MOVE WS-HORA-MM-N     TO  WS-H-MINUTO  WS-H151-CREA-MIN.              
390010        MOVE WS-HORA-SS-N     TO  WS-H-SEGUNDO WS-H151-CREA-SS.               
390310 20004000-EXIT.                                                               
390610    EXIT.                                                                     
390910                                                                              
391210******************************************************************            
391510* OBTENGO LA FECHA DEL LA MAQUINA PARA LA GENERACION DE REPORTES.             
391810******************************************************************            
392110 20005000-FECHA-DIA.                                                          
392410        PERFORM 90000000-DAME-FEC-MAQUINA.                                    
392710        MOVE WKS-DD-MAQ           TO    WS-DIA-DD2.                           
393010        MOVE WKS-MM-MAQ           TO    WS-DIA-MM2.                           
393310        MOVE WKS-AAAA-MAQ         TO    WS-DIA-AA2.                           
393610                                                                              
393910        MOVE WS-FECHA-DIA-AMD     TO    WS-TBHE-FECPRO                        
394010                                        CBIIFIN-FECDIA                        
394210                                        S151FIN-FECDIA.                       
394510                                                                              
394810        MOVE WS-DIA-DD2           TO    WS-INVEN-DIA  WS-DISPO-DIA            
394820                                        WS-BPEND-DIA  WS-TEF-DIA              
395110                                        WS-H151-CREA-DD.                      
395410                                                                              
395710        MOVE WS-DIA-MM2           TO    WS-INVEN-MES  WS-DISPO-MES            
395720                                        WS-BPEND-MES  WS-TEF-MES              
396010                                        WS-H151-CREA-MM.                      
396310                                                                              
396610        MOVE WS-DIA-AA2           TO    WS-INVEN-ANO  WS-DISPO-ANO            
396620                                        WS-BPEND-ANO  WS-TEF-ANO              
396910                                        WS-H151-CREA-AA.                      
397210 20005000-EXIT.                                                               
397510    EXIT.                                                                     
397810                                                                              
398110******************************************************************            
398410* ABRO LOS ARCHIVOS DE DATOS E IMPRESION.                                     
398710* SI ES FIN DE SEMANA SE GENERA EL LISTADO DE INVENTARIO.                     
399010* DIARIAMENTE SE GENERA EL LISTADO DE SALDOS DISPONIBLES Y BLOQUEO            
399310* DE SALDOS Y LOS ARCHIVOS ENVIADOS AL S151, CTES Y TARJETAS.                 
399610******************************************************************            
399910 20007000-OPEN-ARC.                                                           
400410   OPEN INPUT  INVE-PTE.                                                      
400510   OPEN OUTPUT SALDOSTB.                                                      
400810   OPEN OUTPUT SALDOSTBT.                                                     
401110   OPEN OUTPUT S151SALDOS.                                                    
401410   OPEN OUTPUT S151FIN.                                                       
401415   OPEN OUTPUT CBIIFIN.                                                       
401435   OPEN OUTPUT BLO-PEND2.                                                     
401440                                                                              
401450   OPEN INPUT  BLO-PEND BLO-PEND1 BLO-PEND3.                                  
401460   MOVE ATTRIBUTE LASTRECORD OF BLO-PEND   TO WS-LASTRECORDM.                 
401470   MOVE ATTRIBUTE LASTRECORD OF BLO-PEND1  TO WS-LASTRECORDM2.                
401480   MOVE ATTRIBUTE LASTRECORD OF BLO-PEND3  TO WS-LASTRECORDM4.                
401710                                                                              
402010   MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WS-INVEN-MIX                        
402020                                          WS-BPEND-MIX                        
402030                                          WS-TEF-MIX                          
402310                                          WS-DISPO-MIX.                       
402610                                                                              
402910   MOVE 0                              TO WS-INVEN-NUM                        
402920                                          WS-BPEND-NUM                        
402930                                          WS-TEF-NUM                          
403210                                          WS-DISPO-NUM.                       
403215                                                                              
403220   SET FILE-BPENDIENTE(USERBACKUPNAME) TO VALUE TRUE                          
403230   CHANGE ATTRIBUTE TITLE OF FILE-BPENDIENTE TO WS-ETIQ-BPENDIENTE            
403240   OPEN OUTPUT FILE-BPENDIENTE.                                               
403250                                                                              
403260   IF WS-SEMANAL = 1                                                          
403270      SET FILE-TEF(USERBACKUPNAME) TO VALUE TRUE                              
403280      CHANGE ATTRIBUTE TITLE OF FILE-TEF TO WS-ETIQ-TEF                       
403290      OPEN OUTPUT FILE-TEF.                                                   
403510 20007000-EXIT.                                                               
403810    EXIT.                                                                     
404110                                                                              
404410******************************************************************            
404710* GRABO LOS HEADERS DE LOS ARCHIVOS QUE SE VAN A GENERAR DURANTE              
405010* EL DIA.                                                                     
405310******************************************************************            
405610 20008000-HEADERS.                                                            
405910   WRITE REG-S151SALDOS  FROM WS-S151-HEADER INVALID KEY                      
406810   MOVE "ERROR AL GRABAR HEAD S151 "    TO WS-0101-TEXT-MSG                   
407110   PERFORM 70000050-MENSAJE                                                   
407410   CALL SYSTEM DMTERMINATE.                                                   
407710   ADD  1                               TO WS-CONT-S151.                      
408010                                                                              
408310   WRITE REG-SALDOSTB                FROM WS-REGTB-HEADER.                    
408610   WRITE REG-SALDOSTBT               FROM WS-REGTB-HEADER.                    
408910                                                                              
409110   WRITE REG-CBIIFIN                   INVALID KEY                            
409120   MOVE  "ERROR AL GRABAR CBIIFIN."    TO WS-0101-TEXT-MSG                    
409130   PERFORM 70000050-MENSAJE                                                   
409140   CALL SYSTEM DMTERMINATE.                                                   
409150                                                                              
409210   WRITE REG-S151FIN                   INVALID KEY                            
410110   MOVE  "ERROR AL GRABAR S151FIN."    TO WS-0101-TEXT-MSG                    
410410   PERFORM 70000050-MENSAJE                                                   
410710   CALL SYSTEM DMTERMINATE.                                                   
410745                                                                              
410780                                                                              
410798                                                                              
411010 20008000-EXIT.                                                               
411310    EXIT.                                                                     
411610                                                                              
411910******************************************************************            
412210* REALIZO EL LLAMADO DE INICIO DE ENVIO DE SALDOS P/S151.                     
412510******************************************************************            
412810 20009000-CALL-151INI.                                                        
413110       MOVE 80                      TO WS-S151-0103-FUNCION.                  
413410       MOVE WS-FECHA-PRO            TO WS-S151-0103-FECHA-SDO.                
413710       PERFORM 40000500-CALL-151SDO THRU 40000500-EXIT.                       
414010 20009000-EXIT.                                                               
414310    EXIT.                                                                     
414315                                                                              
414320******************************************************************            
414330* MANDO LLAMAR A LA RUTINA DE SUMA Y FIN DE LA MAPLI EN LA ACT.01.            
414340******************************************************************            
414350 20009100-FIN-ACT01.                                                          
414360   MOVE WS-NUM-ACT01       TO W77-ID-ACTXX-MAPLI.                             
414370   MOVE " "                TO W77-ID-TXTA-LIB.                                
414380   PERFORM 70000950-ACT-REGPROC.                                              
414390                                                                              
414400   MOVE WS-NUM-ACT01       TO W77-ID-ACTXX-MAPLI.                             
414410   PERFORM 70000910-FIN-ACTI-MAPLI.                                           
414420 20009100-EXIT.                                                               
414430   EXIT.                                                                      
414440                                                                              
414610                                                                              
414910                                                                              
415210                                                                              
415510                                                                              
415810                                                                              
416110                                                                              
416410                                                                              
416710******************************************************************            
417010******************************************************************            
417310*                                                                             
417610* R U T I N A S    D E   L L A M A D O S   A   L I B R E R I A S.             
417910*                                                                             
418210******************************************************************            
418510******************************************************************            
418810                                                                              
419110******************************************************************            
419410* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
419710* DE PROCESO RESTANDOLE UN DIA A LA FECHA QUE YA HABIA SIDO PROY.             
420010******************************************************************            
420310 40000000-CALL-FECPRO.                                                        
420610     PERFORM 20000006-LOCSUP.                                                 
420910     IF WS-S006-FUNCION > 0                                                   
421210        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
422110        STRING "ERROR AL ACCESAR LOCSUP",   WS-MSG-RS                         
422410        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
422710        PERFORM 70000050-MENSAJE                                              
423010        CALL SYSTEM DMTERMINATE.                                              
423310 40000000-EXIT.                                                               
423610     EXIT.                                                                    
423910                                                                              
424210******************************************************************            
424510* EJECUCION DEL LLAMADO A LA LIBRERIA DEL S408 "ACTS408 "PARA                 
424810* OBTENER EL LIMCRED Y CALCULAR EL SDO. DISPONIBLE.                           
425110******************************************************************            
425410 40000200-CALL-S408.                                                          
425510     IF WS-SIN-S408 = 1                                                       
425520        MOVE 0 TO WS-S408-STATUS                                              
425530     ELSE                                                                     
425710        PERFORM 20000408-LINCRED.                                             
425750                                                                              
426010 40000200-EXIT.                                                               
426310     EXIT.                                                                    
426610                                                                              
426910******************************************************************            
427210* EJECUCION DEL LLAMADO A LA LIBRERIA "LIBEST" PARA OBTENER EL NOM            
427510* DE LA SUCURSAL NECESARIA PARA LOS LISTADOS.                                 
427810******************************************************************            
428110 40000300-CARGO-TABLA.                                                        
428410     PERFORM 40000080-CARGA-DATOS-S080                                        
428710     IF WKS-S080-RS-CARGA = 0 OR 1                                            
429010        NEXT SENTENCE                                                         
429310     ELSE                                                                     
429320        MOVE WKS-S080-RS-CARGA              TO WS-MSG-RS                      
429350        STRING "ERROR AL EFECTUAR LA CARGA",   WS-MSG-RS                      
429360        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
429370        PERFORM 70000050-MENSAJE                                              
429380        CALL SYSTEM DMTERMINATE.                                              
429910 40000300-EXIT.                                                               
430210     EXIT.                                                                    
430510                                                                              
430810******************************************************************            
431110* OBTENGO EL NODO DE LA TABLA LLENADA EN LA CARGA.                            
431710******************************************************************            
432010 40000400-CALL-NODO.                                                          
432310     PERFORM 42000080-DATOS-S080.                                             
432610     IF (WKS-S080-STA-DATO = 0) AND (WKS-S080-NODO-IMP > 0)                   
432910        MOVE WKS-S080-NODO-IMP    TO WS-CNODO                                 
433210     ELSE                                                                     
433510        MOVE WS-TB-CSIO           TO WS-CNODO.                                
433810 40000400-EXIT.                                                               
434110     EXIT.                                                                    
434410                                                                              
434420******************************************************************            
434430* OBTENGO EL NOMSUC DE LA TABLA LLENADA EN LA CARGA.                          
434440******************************************************************            
434450 40000450-NOM-SUC.                                                            
434460     PERFORM 42000080-DATOS-S080.                                             
434470     IF WKS-S080-STA-DATO = 0                                                 
434480        MOVE WKS-S080-NOMCORTO        TO WS-NOMSUC1                           
434490     ELSE                                                                     
434500        MOVE "SUCURSAL SIN NOMBRE"    TO WS-NOMSUC1.                          
434510 40000450-EXIT.                                                               
434560     EXIT.                                                                    
434710                                                                              
435010******************************************************************            
435310* LLAMADO A LA LIBRERIA "S151REGISTRA" PARA ENVIAR LOS TOTALES                
435610* QUE SERAN UTILIZADOS POR EL S151 PARA GENERAR LOS ARC. DE CTES.             
435910******************************************************************            
436210 40000500-CALL-151SDO.                                                        
436230**  Para Eliminar el Envio de Saldos de Ahorros al S151 **                    
436250**                                                      **                    
436270     IF WS-S151-0103-FUNCION = 81                                             
436290    AND WS-S151-0103-PRODUCTO = 0500                                          
436310    AND WS-S151-0103-INSTRUM  = 0006                                          
436330    AND WS-S151-0103-MONEDA   = 001                                           
436350        NEXT SENTENCE                                                         
436370     ELSE                                                                     
436510        PERFORM 20000151-SALDOS                                               
436560        MOVE WS-S151-0103-RESULT  TO WS-MSG-RS                                
436610        MOVE B03-NUM-CONTRATO     TO WS-MSG-CTO                               
436660        MOVE WS-S151-0103-FUNCION TO WS-MSG-N-02                              
436810        IF WS-S151-0103-RESULT > 0                                            
436830           ADD 1 TO WS-FALLA-S151                                             
436850           IF W88-ES-DESARROLLO                                               
436870              PERFORM 40000510-MAL-S151-DES                                   
436890           ELSE                                                               
436910              PERFORM 40000505-MAL-S151.                                      
436920                                                                              
436930 40000500-EXIT.                                                               
436940     EXIT.                                                                    
436945                                                                              
436950 40000505-MAL-S151.                                                           
438010     STRING "ERROR CALL 151REGISTRA RS=", WS-MSG-RS                           
438012            " FUNCION=", WS-MSG-N-02                                          
438014            " CONTRATO=", WS-MSG-CTO                                          
438310            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
438610     PERFORM 70000050-MENSAJE                                                 
438910     CALL SYSTEM DMTERMINATE.                                                 
439210                                                                              
439510 40000510-MAL-S151-DES.                                                       
439512     IF WS-FALLA-S151 < 11                                                    
439530        MOVE "I" TO W77-TIPO-DISP.                                            
439550                                                                              
439570     STRING "ERROR CALL 151REGISTRA RS=", WS-MSG-RS                           
439590            " FUNCION=", WS-MSG-N-02                                          
439610            " CONTRATO=", WS-MSG-CTO                                          
439630               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG.                       
439650     IF WS-FALLA-S151 < 21                                                    
439670        PERFORM 70000050-MENSAJE.                                             
439690                                                                              
439710     MOVE "E" TO W77-TIPO-DISP.                                               
439810                                                                              
439825******************************************************************            
439830* LLAMADO A LA LIBRERIA "S016P422" PARA OBTENER EL NUMERO DE                  
439835* INTERCOMPANY. ENTRYPOINT S016_L422_B48INTERC_CTE.                           
439840******************************************************************            
439845 40000600-CALL-INTER.                                                         
439850    PERFORM 20000016-L422-B48INTERCCTE.                                       
439855    IF R422-10-CTR-ERROR   > 0                                                
439860        MOVE 0                              TO INV-INTERCOMPANY-S             
439895    ELSE                                                                      
439900        MOVE S422-10-CVE-INTERC             TO INV-INTERCOMPANY-S.            
439925 40000600-EXIT.                                                               
439930    EXIT.                                                                     
440110                                                                              
440410                                                                              
440710                                                                              
441010******************************************************************            
441310******************************************************************            
441610*                                                                             
441910*                        P R O C E S O S.                                     
442210*          E J E C U C I O N   D E   L A S   R U T I N A S                    
442510*           P R I N C I P A L E S   D E L   P R O C E S O.                    
442810*                                                                             
442820******************************************************************            
442830 50000000-PROCESOS.                                                           
442840     MOVE WS-LASTRECORDM                  TO W77-ID-NUMREG-PROC.              
442850     MOVE 02                              TO W77-ID-ACTXX-MAPLI               
442860     MOVE 02                              TO WS-NUM-ACT02.                    
442870     MOVE "LEO/GRABO ARC.BLO. SDOPEND. COP01"  TO W77-ID-NOMB-LIB.            
442880     MOVE "S500/FILE/S500/BPEND/CS/CS/AAMMDD"  TO W77-ID-TXTA-LIB.            
442890     PERFORM 70000910-INIACT-MAPLI.                                           
442900     PERFORM 50000100-ARC-BPENDC01 THRU 50000100-EXIT.                        
442910     MOVE WS-NUM-ACT02                    TO W77-ID-ACTXX-MAPLI.              
442920     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
442930                                                                              
442950     MOVE WS-LASTRECORDM2                 TO W77-ID-NUMREG-PROC.              
442960     MOVE 03                              TO W77-ID-ACTXX-MAPLI               
442970     MOVE 03                              TO WS-NUM-ACT03.                    
442980     MOVE "LEO/GRABO ARC.BLO. SDOPEND. COP02"  TO W77-ID-NOMB-LIB.            
442990     MOVE "S500/FILE/S500/BPEND/CS/CS/AAMMDD"  TO W77-ID-TXTA-LIB.            
443000     PERFORM 70000910-INIACT-MAPLI.                                           
443010     PERFORM 50000200-ARC-BPENDC02 THRU 50000200-EXIT.                        
443020     MOVE WS-NUM-ACT03                    TO W77-ID-ACTXX-MAPLI.              
443030     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
443040                                                                              
443041*R4-COPIAS-2011 SE AGREGA MANEJO DEL 3er ARCHIVO BPEND (P105) -YCY            
443042     MOVE WS-LASTRECORDM4                 TO W77-ID-NUMREG-PROC.              
443043     MOVE 10                              TO W77-ID-ACTXX-MAPLI               
443044     MOVE 10                              TO WS-NUM-ACT10.                    
443046     MOVE "LEO/GRABO ARC.BLO. SDOPEND. COP03"  TO W77-ID-NOMB-LIB.            
443048     MOVE "S500/FILE/S500/BPEND/CS/CS/AAMMDD"  TO W77-ID-TXTA-LIB.            
443050     PERFORM 70000910-INIACT-MAPLI.                                           
443052     PERFORM 50000260-ARC-BPENDC03 THRU 50000260-EXIT.                        
443054     MOVE WS-NUM-ACT10                    TO W77-ID-ACTXX-MAPLI.              
443056     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
443058                                                                              
443060     OPEN INPUT BLO-PEND2                                                     
443070     MOVE WS-LASTRECORDM3                 TO W77-ID-NUMREG-PROC.              
443080     MOVE 04                              TO W77-ID-ACTXX-MAPLI               
443090     MOVE 04                              TO WS-NUM-ACT04.                    
443100     MOVE "LEO BLOPEND SORT Y GENERO LISTADO"  TO W77-ID-NOMB-LIB.            
443110     MOVE "S500/LIST/P180/....003BLOSDOPEND "  TO W77-ID-TXTA-LIB.            
443120     PERFORM 70000910-INIACT-MAPLI.                                           
443130     PERFORM 50000400-LEO-BLOSPEND        THRU 50000400-EXIT.                 
443140     MOVE WS-NUM-ACT04                    TO W77-ID-ACTXX-MAPLI.              
443150     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
443160                                                                              
443760     MOVE 05                            TO W77-ID-NUMDSET-MAPLI               
443770     MOVE 01                            TO W77-ID-NUMBASE-MAPLI               
443780     PERFORM 70000600-REGS-EN-BASE.                                           
443790     MOVE 05                            TO W77-ID-ACTXX-MAPLI                 
443800     MOVE 05                            TO WS-NUM-ACT05.                      
443810     MOVE "LEO B05,CARGO A MEM. Y VALIDO NODO" TO W77-ID-NOMB-LIB             
443820     MOVE "LOS NODOS VALIDOS SE CARGAN A MEM." TO W77-ID-TXTA-LIB             
443830     PERFORM 70000910-INIACT-MAPLI.                                           
444010     SET S500B05INSTRUMEN TO BEGINNING.                                       
444310     PERFORM 50001500-CARGO-MEAC THRU 50001500-EXIT UNTIL                     
444610     WS-13VEZ = 1.                                                            
444910     PERFORM 50002000-CARGO-NODO THRU 50002000-EXIT.                          
444920     MOVE WS-NUM-ACT05       TO W77-ID-ACTXX-MAPLI.                           
444930     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
444940                                                                              
445510     PERFORM 51000000-ORDENO-INV THRU 51000000-EXIT.                          
445520                                                                              
445525     IF WS-SEMANAL = 1                                                        
445550       MOVE 36                            TO W77-ID-NUMDSET-MAPLI             
445555       MOVE 01                            TO W77-ID-NUMBASE-MAPLI             
445560       PERFORM 70000600-REGS-EN-BASE                                          
445565       MOVE 08                            TO W77-ID-ACTXX-MAPLI               
445570       MOVE 08                            TO WS-NUM-ACT08                     
445575       MOVE "LEO B36 Y GEN. REP. DE COM.X/TEF" TO W77-ID-NOMB-LIB             
445580       MOVE "POR CADA REG.DE B36 SE CONS.B05." TO W77-ID-TXTA-LIB             
445585       PERFORM 70000910-INIACT-MAPLI                                          
445590       SET S500B05INSTRUMEN TO BEGINNING                                      
445595       SET S500B36GRUPOCOM  TO BEGINNING                                      
445730       PERFORM 60000000-REP-TEF    THRU 60000000-EXIT UNTIL                   
445735       WS-16VEZ = 1                                                           
445740       MOVE WS-NUM-ACT08       TO W77-ID-ACTXX-MAPLI                          
445745       PERFORM 70000910-FIN-ACTI-MAPLI.                                       
445810 50000000-EXIT.                                                               
446110     EXIT.                                                                    
446115                                                                              
446120******************************************************************            
446125* LEO EL ARCHIVO DE BLOQUEOS DE SALDOS PENDIENTES DE LA COPIA 01.             
446130******************************************************************            
446140 50000100-ARC-BPENDC01.                                                       
446150     PERFORM 50000110-VAL-HEAD   THRU 50000110-EXIT.                          
446160     PERFORM 50000150-DET-BPEN   THRU 50000150-EXIT UNTIL                     
446170             WS-9VEZ = 1.                                                     
446180 50000100-EXIT.                                                               
446190    EXIT.                                                                     
446200                                                                              
446410******************************************************************            
446420* VALIDO EL HEADER DEL ARCHIVO DE COMPEND COPIA 01.                           
446430******************************************************************            
446440 50000110-VAL-HEAD.                                                           
446445     READ BLO-PEND INTO REG-BLOPEND3 AT END                                   
446460        MOVE  "ERR.ARC.DE BPEN COP01.VACIO" TO WS-0101-TEXT-MSG               
446465        PERFORM 70000050-MENSAJE                                              
446470        CALL SYSTEM DMTERMINATE.                                              
446475                                                                              
446480     IF BPE-FECHA = WS-FECHA-PRO                                              
446485        MOVE WS-NUM-ACT02       TO W77-ID-ACTXX-MAPLI                         
446486        MOVE " "                TO W77-ID-TXTA-LIB                            
446487        PERFORM 70000950-ACT-REGPROC                                          
446490     ELSE                                                                     
446505        MOVE  "FECEXT.E INT ARC.BPEN C1 DIF" TO WS-0101-TEXT-MSG              
446510        PERFORM 70000050-MENSAJE                                              
446515        CALL SYSTEM DMTERMINATE.                                              
446520 50000110-EXIT.                                                               
446525    EXIT.                                                                     
446530                                                                              
446535******************************************************************            
446540* LEO EL DETALLE DEL ARCHIVO DE BPENDIENTES.                                  
446545******************************************************************            
446550 50000150-DET-BPEN.                                                           
446555   READ BLO-PEND INTO REG-BLOPEND3 AT END                                     
446560   MOVE 1                                   TO WS-9VEZ.                       
446565                                                                              
446570   IF WS-9VEZ = 0                                                             
446572     MOVE WS-NUM-ACT02          TO W77-ID-ACTXX-MAPLI                         
446574     MOVE " "                   TO W77-ID-TXTA-LIB                            
446576     PERFORM 70000950-ACT-REGPROC                                             
446578     MOVE BPE-SUCPRO            TO BPE2-SUCPRO                                
446580     MOVE BPE-CVE               TO BPE2-CVE                                   
446582     MOVE BPE-CTO               TO BPE2-CTO                                   
446584     MOVE BPE-IMP               TO BPE2-IMP                                   
446586     MOVE BPE-PRD               TO BPE2-PRD                                   
446588     MOVE BPE-INS               TO BPE2-INS                                   
446590     MOVE BPE-MON               TO BPE2-MON                                   
446592     MOVE BPE-SUCTRA            TO BPE2-SUCTRA                                
446594     MOVE BPE-CAJA              TO BPE2-CAJA                                  
446596     MOVE BPE-AUT               TO BPE2-AUT                                   
446598     MOVE BPE-NOM               TO BPE2-NOM                                   
446600     MOVE BPE-HORA              TO BPE2-HORA                                  
446602     WRITE REG-BLOPEND2 INVALID KEY                                           
446608       MOVE "ERROR AL GRABAR ARC.DE BPEND." TO WS-0101-TEXT-MSG               
446610       PERFORM 70000050-MENSAJE                                               
446612       CALL SYSTEM DMTERMINATE.                                               
446614 50000150-EXIT.                                                               
446616    EXIT.                                                                     
446618                                                                              
447980******************************************************************            
447990* LEO EL ARCHIVO DE BLOQUEOS DE SALDOS PENDIENTES DE LA COPIA 02.             
448000******************************************************************            
448010 50000200-ARC-BPENDC02.                                                       
448020     PERFORM 50000210-VAL-HEAD   THRU 50000210-EXIT.                          
448030     PERFORM 50000250-DET-BPEN   THRU 50000250-EXIT UNTIL                     
448040             WS-14VEZ = 1.                                                    
448050 50000200-EXIT.                                                               
448060    EXIT.                                                                     
448070                                                                              
448080******************************************************************            
448090* VALIDO EL HEADER DEL ARCHIVO DE COMPEND COPIA 02.                           
448100******************************************************************            
448110 50000210-VAL-HEAD.                                                           
448120     READ BLO-PEND1 INTO REG-BLOPEND3 AT END                                  
448150        MOVE  "ERR.ARC.DE BPEN COP02.VACIO" TO WS-0101-TEXT-MSG               
448160        PERFORM 70000050-MENSAJE                                              
448170        CALL SYSTEM DMTERMINATE.                                              
448180                                                                              
448190     IF BPE-FECHA = WS-FECHA-PRO                                              
448200        MOVE WS-NUM-ACT03       TO W77-ID-ACTXX-MAPLI                         
448210        MOVE " "                TO W77-ID-TXTA-LIB                            
448220        PERFORM 70000950-ACT-REGPROC                                          
448230     ELSE                                                                     
448260        MOVE  "FECEXT.E INT ARC.BPEN C1 DIF" TO WS-0101-TEXT-MSG              
448270        PERFORM 70000050-MENSAJE                                              
448280        CALL SYSTEM DMTERMINATE.                                              
448290 50000210-EXIT.                                                               
448300    EXIT.                                                                     
448310                                                                              
448320******************************************************************            
448330* LEO EL DETALLE DEL ARCHIVO DE BPENDIENTES DE LA COPIA 2.                    
448340******************************************************************            
448350 50000250-DET-BPEN.                                                           
448360   READ BLO-PEND1 INTO REG-BLOPEND3 AT END                                    
448362*       CLOSE BLO-PEND2 WITH SAVE                                             
448364*       PERFORM 50000300-SORT-BPEND  THRU 50000300-EXIT                       
448370        MOVE 1                              TO WS-14VEZ.                      
448380                                                                              
448390   IF WS-14VEZ = 0                                                            
448400     MOVE WS-NUM-ACT03          TO W77-ID-ACTXX-MAPLI                         
448410     MOVE " "                   TO W77-ID-TXTA-LIB                            
448420     PERFORM 70000950-ACT-REGPROC                                             
448430     MOVE BPE-SUCPRO            TO BPE2-SUCPRO                                
448440     MOVE BPE-CVE               TO BPE2-CVE                                   
448450     MOVE BPE-CTO               TO BPE2-CTO                                   
448460     MOVE BPE-IMP               TO BPE2-IMP                                   
448470     MOVE BPE-PRD               TO BPE2-PRD                                   
448480     MOVE BPE-INS               TO BPE2-INS                                   
448490     MOVE BPE-MON               TO BPE2-MON                                   
448500     MOVE BPE-SUCTRA            TO BPE2-SUCTRA                                
448510     MOVE BPE-CAJA              TO BPE2-CAJA                                  
448520     MOVE BPE-AUT               TO BPE2-AUT                                   
448530     MOVE BPE-NOM               TO BPE2-NOM                                   
448540     MOVE BPE-HORA              TO BPE2-HORA                                  
448550     WRITE REG-BLOPEND2 INVALID KEY                                           
448580       MOVE "ERROR AL GRABAR ARC.DE BPEND." TO WS-0101-TEXT-MSG               
448590       PERFORM 70000050-MENSAJE                                               
448600       CALL SYSTEM DMTERMINATE.                                               
448610 50000250-EXIT.                                                               
448620    EXIT.                                                                     
448621*R4-COPIAS-2011 SE AGREGA MANEJO DEL 3er ARCHIVO BPEND (P105) -YCY            
448622******************************************************************            
448623* LEO EL ARCHIVO DE BLOQUEOS DE SALDOS PENDIENTES DE LA COPIA 03.             
448624******************************************************************            
448625 50000260-ARC-BPENDC03.                                                       
448626     PERFORM 50000270-VAL-HEAD   THRU 50000270-EXIT.                          
448627     PERFORM 50000280-DET-BPEN   THRU 50000280-EXIT UNTIL                     
448628             WS-18VEZ = 1.                                                    
448629 50000260-EXIT.                                                               
448630    EXIT.                                                                     
448631                                                                              
448632******************************************************************            
448633* VALIDO EL HEADER DEL ARCHIVO DE COMPEND COPIA 03.                           
448634******************************************************************            
448635 50000270-VAL-HEAD.                                                           
448636     READ BLO-PEND3 INTO REG-BLOPEND3 AT END                                  
448637        MOVE  "ERR.ARC.DE BPEN COP03.VACIO" TO WS-0101-TEXT-MSG               
448638        PERFORM 70000050-MENSAJE                                              
448639        CALL SYSTEM DMTERMINATE.                                              
448640                                                                              
448641     IF BPE-FECHA = WS-FECHA-PRO                                              
448642        MOVE WS-NUM-ACT10       TO W77-ID-ACTXX-MAPLI                         
448643        MOVE " "                TO W77-ID-TXTA-LIB                            
448644        PERFORM 70000950-ACT-REGPROC                                          
448645     ELSE                                                                     
448646        MOVE  "FECEXT.E INT ARC.BPEN C3 DIF" TO WS-0101-TEXT-MSG              
448647        PERFORM 70000050-MENSAJE                                              
448648        CALL SYSTEM DMTERMINATE.                                              
448649 50000270-EXIT.                                                               
448650    EXIT.                                                                     
448651                                                                              
448652******************************************************************            
448653* LEO EL DETALLE DEL ARCHIVO DE BPENDIENTES DE LA COPIA 3.                    
448654******************************************************************            
448655 50000280-DET-BPEN.                                                           
448656   READ BLO-PEND3 INTO REG-BLOPEND3 AT END                                    
448657        CLOSE BLO-PEND2 WITH SAVE                                             
448658        PERFORM 50000300-SORT-BPEND  THRU 50000300-EXIT                       
448659        MOVE 1                              TO WS-18VEZ.                      
448660                                                                              
448661   IF WS-18VEZ = 0                                                            
448662     MOVE WS-NUM-ACT10          TO W77-ID-ACTXX-MAPLI                         
448663     MOVE " "                   TO W77-ID-TXTA-LIB                            
448664     PERFORM 70000950-ACT-REGPROC                                             
448665     MOVE BPE-SUCPRO            TO BPE2-SUCPRO                                
448666     MOVE BPE-CVE               TO BPE2-CVE                                   
448667     MOVE BPE-CTO               TO BPE2-CTO                                   
448668     MOVE BPE-IMP               TO BPE2-IMP                                   
448669     MOVE BPE-PRD               TO BPE2-PRD                                   
448670     MOVE BPE-INS               TO BPE2-INS                                   
448671     MOVE BPE-MON               TO BPE2-MON                                   
448672     MOVE BPE-SUCTRA            TO BPE2-SUCTRA                                
448673     MOVE BPE-CAJA              TO BPE2-CAJA                                  
448674     MOVE BPE-AUT               TO BPE2-AUT                                   
448675     MOVE BPE-NOM               TO BPE2-NOM                                   
448676     MOVE BPE-HORA              TO BPE2-HORA                                  
448677     WRITE REG-BLOPEND2 INVALID KEY                                           
448678       MOVE "ERROR AL GRABAR ARC.DE BPEND." TO WS-0101-TEXT-MSG               
448679       PERFORM 70000050-MENSAJE                                               
448680       CALL SYSTEM DMTERMINATE.                                               
448681 50000280-EXIT.                                                               
448682    EXIT.                                                                     
448683******************************************************************            
448684* SORTEO EL ARCHIVO DE COMISIONES PENDIENTES PARA GENERAR EL REP.             
448685******************************************************************            
449000 50000300-SORT-BPEND.                                                         
449010    OPEN INPUT BLO-PEND2.                                                     
449020    MOVE ATTRIBUTE LASTRECORD OF BLO-PEND2 TO WS-LASTRECORDM3                 
449030    CLOSE BLO-PEND2 WITH SAVE.                                                
449032    COMPUTE WS-SORT-ESPACIO1 = (WS-LASTRECORDM3 + 1) * 13 * 3.5               
449034**  COMPUTE W77-MEMSIZE1  = ((13 + 3) * 2000) + 1500                          
449035                                                                              
449036    COMPUTE W77-MEMSIZE1 = ((WS-LASTRECORDM3 / 16) * 16) + 1500.              
449037                                                                              
449038    IF W77-MEMSIZE1 < 400000                                                  
449039       MOVE 400000 TO W77-MEMSIZE1                                            
449040    ELSE                                                                      
449041    IF W77-MEMSIZE1 > 258435000                                               
449042       MOVE 258435000 TO W77-MEMSIZE1.                                        
449043                                                                              
449044    MOVE  WS-SORT-ESPACIO1 TO WS-MSG-N-14.                                    
449045    MOVE  W77-MEMSIZE1     TO WS-MSG-N-12.                                    
449046    STRING "DISK-SIZE =" WS-MSG-N-14                                          
449047           ", MEMORY-SIZE =" WS-MSG-N-12                                      
449048           ", PARA SORT BLO-PEND2 "                                           
449049                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
449050    PERFORM 70000050-MENSAJE.                                                 
449051                                                                              
449060    SORT BPE-SORT ON ASCENDING KEY BPESUC-SORT                                
449062    BPECTO-SORT BPECVE-SORT USING BLO-PEND2 GIVING BLO-PEND2                  
449065    MEMORY SIZE W77-MEMSIZE1  WORDS                                           
449070    DISK   SIZE WS-SORT-ESPACIO1 WORDS.                                       
449080 50000300-EXIT.                                                               
449090    EXIT.                                                                     
449100                                                                              
449110******************************************************************            
449120* LEO EL ARCHIVO DE BLOSDOPEND SORTEADO Y GENERO EL LISTADO.                  
449130******************************************************************            
449140 50000400-LEO-BLOSPEND.                                                       
449150   PERFORM 50000410-LEO-BSPEND THRU 50000410-EXIT UNTIL                       
449160   WS-15VEZ = 1.                                                              
449300 50000400-EXIT.                                                               
449310   EXIT.                                                                      
449320                                                                              
449330******************************************************************            
449340* LEO EL DETALLE DEL ARCHIVO DE BPENDIENTES.PARA GENERAR LISTADO.             
449350******************************************************************            
449360 50000410-LEO-BSPEND.                                                         
449370     READ BLO-PEND2  AT END                                                   
449380        MOVE 1                              TO WS-15VEZ                       
449390        IF WS-BAN-VACIO = 0                                                   
449400           PERFORM 50000650-ENC-VACIO       THRU 50000650-EXIT.               
449410                                                                              
449420     IF WS-15VEZ = 0                                                          
449430        MOVE WS-NUM-ACT04       TO W77-ID-ACTXX-MAPLI                         
449440        MOVE " "                TO W77-ID-TXTA-LIB                            
449450        PERFORM 70000950-ACT-REGPROC                                          
449460        MOVE 1                         TO   WS-BAN-VACIO                      
449470        PERFORM 50000450-LIS-BPEN      THRU 50000450-EXIT.                    
449480 50000410-EXIT.                                                               
449490    EXIT.                                                                     
449500                                                                              
451710******************************************************************            
451720* GENERO EL LISTADO DE BLOQUEO DE SDOS. PENDIENTES.                           
451730******************************************************************            
451740 50000450-LIS-BPEN.                                                           
451750   IF WS-10VEZ = 0                                                            
451760      MOVE  BPE2-SUCPRO            TO   WS-NUMSUC1 WS-SUCANT1                 
451770      PERFORM 50000600-ENC-BPEN    THRU 50000600-EXIT                         
451780      MOVE 1                       TO   WS-10VEZ.                             
451790                                                                              
451800   IF WS-LINEA3 > 60                                                          
451810      MOVE 0         TO WS-LINEA3                                             
451820      IF BPE2-SUCPRO = WS-SUCANT1                                             
451830         PERFORM 50000600-ENC-BPEN    THRU 50000600-EXIT                      
451840         PERFORM 50000700-DET-BPEN    THRU 50000700-EXIT                      
451850      ELSE                                                                    
451860         MOVE  BPE2-SUCPRO      TO    WS-NUMSUC1 WS-SUCANT1                   
451870         PERFORM 50000600-ENC-BPEN    THRU 50000600-EXIT                      
451880         PERFORM 50000700-DET-BPEN    THRU 50000700-EXIT                      
451890   ELSE                                                                       
451900      IF BPE2-SUCPRO = WS-SUCANT1                                             
451910         PERFORM 50000700-DET-BPEN    THRU 50000700-EXIT                      
451920      ELSE                                                                    
451930         MOVE  BPE2-SUCPRO      TO    WS-NUMSUC1 WS-SUCANT1                   
451940         PERFORM 50000600-ENC-BPEN    THRU 50000600-EXIT                      
451950         PERFORM 50000700-DET-BPEN    THRU 50000700-EXIT.                     
451960 50000450-EXIT.                                                               
451970    EXIT.                                                                     
451980                                                                              
451990******************************************************************            
452000* GENERO EL ENCABEZADO DEL LISTADO DE BLOQUEO DE SALDOS PENDIENTES            
452010******************************************************************            
452020 50000600-ENC-BPEN.                                                           
452030   MOVE  SPACES            TO    REG-BPENDIENTE.                              
452040   WRITE REG-BPENDIENTE    AFTER CHANNEL 1.                                   
452050   WRITE REG-BPENDIENTE    FROM  WS-ENCABEZADO    BEFORE 1.                   
452060   WRITE REG-BPENDIENTE    FROM  WS-ENCABEZADO1   BEFORE 1.                   
452070   WRITE REG-BPENDIENTE    FROM  WS-03-BDISP      BEFORE 1.                   
452080   ADD 1                   TO    WS-HOJA4.                                    
452090   MOVE WS-HOJA4           TO    WS-BPEND-HOJA.                               
452100   WRITE REG-BPENDIENTE    FROM  WS-04-BPEND       BEFORE 1.                  
452110   WRITE REG-BPENDIENTE    FROM  WS-ENCA-HORA      BEFORE 2.                  
452120   WRITE REG-BPENDIENTE    FROM  WS-SUCURSAL1      BEFORE 2.                  
452130   WRITE REG-BPENDIENTE    FROM  WS-TIT-BPEN       BEFORE 2.                  
452140   ADD 20                  TO    WS-LINEA3.                                   
452150 50000600-EXIT.                                                               
452160    EXIT.                                                                     
452170                                                                              
452180******************************************************************            
452190* CUANDO NO HAY MOV.DE BLO. DE SDOPEND SE GENERA EL LISTADO VACIO.            
452200******************************************************************            
452210 50000650-ENC-VACIO.                                                          
452220   MOVE  SPACES            TO    REG-BPENDIENTE.                              
452230   WRITE REG-BPENDIENTE    FROM  WS-04-BPEND-VAC  BEFORE 20.                  
452240 50000650-EXIT.                                                               
452250    EXIT.                                                                     
452260                                                                              
452270******************************************************************            
452280* IMPRIMO EL DETALLE DEL LISTADO DE BLOQUEO DE SALDOS PENDIENTES.             
452290******************************************************************            
452300 50000700-DET-BPEN.                                                           
452310   MOVE BPE2-CVE           TO WS-BPEND-CVE                                    
452320   MOVE BPE2-CTO           TO WS-BPEND-CTO                                    
452330   MOVE BPE2-IMP           TO WS-BPEND-IMP                                    
452340   MOVE BPE2-PRD           TO WS-BPEND-PRD                                    
452350   MOVE BPE2-INS           TO WS-BPEND-INS                                    
452360   MOVE BPE2-MON           TO WS-BPEND-MON                                    
452365   MOVE BPE2-SUCTRA        TO WS-BPEND-STRAN                                  
452370   MOVE BPE2-CAJA          TO WS-BPEND-CAJA                                   
452375   MOVE BPE2-AUT           TO WS-BPEND-AUT                                    
452380   MOVE BPE2-NOM           TO WS-BPEND-NOMINA                                 
452390   MOVE BPE2-HORA          TO HORA-BPEN1                                      
452400   MOVE WS-HORA-HH         TO WS-BPEND-HH                                     
452410   MOVE WS-HORA-MM         TO WS-BPEND-MM                                     
452420   MOVE WS-HORA-SS         TO WS-BPEND-SS                                     
452430   WRITE REG-BPENDIENTE    FROM  WS-DET-BLOPEND    BEFORE 1.                  
452440   ADD  1                  TO WS-LINEA3.                                      
452450 50000700-EXIT.                                                               
452460   EXIT.                                                                      
452470                                                                              
452480******************************************************************            
452490* CARGO EL INDICADOR DE MEDIO DE ACCESO DE TODOS LOS PRODUCTOS.               
452500******************************************************************            
452510 50001500-CARGO-MEAC.                                                         
452520   PERFORM 90000005-B05INSTRUMEN-FINDN                                        
452530   IF WS-STATUS-BASE > 0                                                      
452540      IF WS-STATUS-BASE = 1                                                   
452550         MOVE 1 TO WS-13VEZ                                                   
452560      ELSE                                                                    
452590        STRING "ERROR AL HACER FIND A B05 " ,  WS-STATUS-BASE                 
452600        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
452610        PERFORM 70000050-MENSAJE                                              
452620        CALL SYSTEM DMTERMINATE.                                              
452630                                                                              
452640   IF WS-13VEZ = 0                                                            
452650        MOVE WS-NUM-ACT05       TO W77-ID-ACTXX-MAPLI                         
452660        MOVE " "                TO W77-ID-TXTA-LIB                            
452670        PERFORM 70000950-ACT-REGPROC                                          
452680        PERFORM 50001600-CARGO THRU 50001600-EXIT.                            
452690 50001500-EXIT.                                                               
452700    EXIT.                                                                     
452710                                                                              
453010******************************************************************            
453310* CARGO LA BANDERA DE MEDIO DE ACCESO DE LOS 30 PRODUCTOS.                    
453610******************************************************************            
453910 50001600-CARGO.                                                              
454210    ADD 1 TO WS-C4.                                                           
454510    IF WS-C4 > 30                                                             
455410       MOVE "INST. TIENE MAS DE 30 PRDS "     TO WS-0101-TEXT-MSG             
455710       PERFORM 70000050-MENSAJE                                               
456010       CALL SYSTEM DMTERMINATE.                                               
456310                                                                              
456610    MOVE B05-MA-TARJETA                TO WS-MEDAC-MAC(WS-C4)                 
456910    MOVE B05-NUM-PRODUCTO              TO WS-MEDAC-PRD(WS-C4)                 
457210    MOVE B05-NUM-INSTRUM               TO WS-MEDAC-INS(WS-C4)                 
457510    MOVE B05-MONEDA                    TO WS-MEDAC-MON(WS-C4)                 
457570    IF B05-NUM-PRODUCTO = 1                                                   
457580       MOVE B05-NUM-PRODUCTO           TO WS-NUMCHE-PRD(WS-C4)                
457590       MOVE B05-NUM-INSTRUM            TO WS-NUMCHE-INS(WS-C4)                
457600       MOVE B05-MONEDA                 TO WS-NUMCHE-MON(WS-C4)                
457610       MOVE 0                          TO WS-NUMCHE-MACE(WS-C4)               
457615                                          WS-NUMCHE-MECE(WS-C4)               
457620                                          WS-NUMCHE-IGCE(WS-C4)               
457625                                          WS-NUMCHE-SDOA(WS-C4)               
457630    ELSE                                                                      
457632       IF B05-NUM-PRODUCTO = 66 OR ((B05-NUM-PRODUCTO = 500) AND              
457633          (B05-NUM-INSTRUM  = 1))                                             
457635          MOVE B05-NUM-PRODUCTO        TO WS-NUMCMA-PRD(WS-C4)                
457640          MOVE B05-NUM-INSTRUM         TO WS-NUMCMA-INS(WS-C4)                
457645          MOVE B05-MONEDA              TO WS-NUMCMA-MON(WS-C4)                
457650          MOVE 0                       TO WS-NUMCMA-MACE(WS-C4)               
457655                                          WS-NUMCMA-MECE(WS-C4)               
457660                                          WS-NUMCMA-IGCE(WS-C4)               
457665                                          WS-NUMCMA-SDOA(WS-C4)               
457670       ELSE                                                                   
457680          NEXT SENTENCE.                                                      
457810 50001600-EXIT.                                                               
458110   EXIT.                                                                      
458410                                                                              
458710******************************************************************            
459010* CARGO LOS NODOS DE LAS POSIBLES 10,000 SUCURSALES.                          
459310******************************************************************            
459610 50002000-CARGO-NODO.                                                         
459910   PERFORM 40000300-CARGO-TABLA   THRU 40000300-EXIT.                         
460210   CANCEL "CTLVERS".                                                          
460510   CANCEL "S080TARIFAS".                                                      
460810   CANCEL "S080BD01CON".                                                      
461110 50002000-EXIT.                                                               
461410   EXIT.                                                                      
466510                                                                              
466810******************************************************************            
467110* ORDENA EL DATA SET POR NODO, PRD, INS, MON, SUC Y CTO PARA PODER            
467410* GENERAR LOS ARCHIVOS Y LISTADOS.                                            
467710****************************************************************              
468010 51000000-ORDENO-INV.                                                         
468910                                                                              
469210     PERFORM  52000000-ORDENO-ARCHIVO THRU 52000000-EXIT.                     
469510     PERFORM  53000000-LEO-ARCHIVO    THRU 53000000-EXIT.                     
469515                                                                              
469820                                                                              
470110 51000000-EXIT.                                                               
470410     EXIT.                                                                    
470450                                                                              
470490**********************************************************                    
470870*******************************************************                       
471150                                                                              
471170*******************************************************                       
471230                                                                              
471250*******************************************************                       
471610                                                                              
471910                                                                              
472210****************************************************************              
472510*     S E C C I O N        D E      O R D E N A M I E N T O.                  
472810*             A R M A D O   D E L   A R C H I V O .                           
473110****************************************************************              
473410                                                                              
473710****************************************************************              
474010* ORDENO EL ARCHIVO POR NODO,PRD,INS,MON,SUCURSAL Y CONTRATO.                 
474310****************************************************************              
474610** 52000000-ORDARCH SECTION.                                                  
474910 52000000-ORDENO-ARCHIVO.                                                     
474930*    Proceso los contratos correspondientes a CBII (Actividad 11)             
474950     MOVE 1                               TO W77-ID-NUMREG-PROC               
474970     MOVE 11                              TO W77-ID-ACTXX-MAPLI               
474990                                             WS-NUM-ACT11.                    
475010     MOVE "LEOB03,ENV SDOS151,GEN.AR.CTES CBII" TO W77-ID-NOMB-LIB            
475030     MOVE "1ER BARRIDO B03 (CBII)-> SORT INPUT" TO W77-ID-TXTA-LIB            
475050     PERFORM 70000910-INIACT-MAPLI.                                           
475070     MOVE 0 TO WS-2VEZ.                                                       
475110     MOVE 1 TO WS-INSTRUMENTOS-CBII.                                          
475210     PERFORM 52200000-SEL THRU 52200000-EXIT UNTIL WS-2VEZ= 1.                
475230                                                                              
475250*    Proceso todos los demas contratos (Actividad 6)                          
475270     MOVE 03                              TO W77-ID-NUMDSET-MAPLI             
475290     MOVE 01                              TO W77-ID-NUMBASE-MAPLI             
475310     PERFORM 70000600-REGS-EN-BASE.                                           
475330     MOVE 06                              TO W77-ID-ACTXX-MAPLI               
475350                                             WS-NUM-ACT06.                    
475370     MOVE "LEOB03,ENVIO SDOS151 Y GEN.ARCHCTES" TO W77-ID-NOMB-LIB            
475390     MOVE "2DO BARRIDO B03-> SORT INPUT/OUTPUT" TO W77-ID-TXTA-LIB            
475410     PERFORM 70000910-INIACT-MAPLI.                                           
475430     SET S500B03CONTRATOS      TO BEGINNING.                                  
475450     MOVE 0 TO WS-2VEZ.                                                       
475470     MOVE 0 TO WS-INSTRUMENTOS-CBII.                                          
475490     PERFORM 52200000-SEL THRU 52200000-EXIT UNTIL WS-2VEZ= 1.                
475510                                                                              
475810 52000000-EXIT.                                                               
476110    EXIT.                                                                     
476410                                                                              
476710****************************************************************              
477010* LEO LOS CONTRATOS PARA ARMAR EL ARCHIVO SORT.                               
477310****************************************************************              
477610 52200000-SEL.                                                                
477910  PERFORM 90000003-B03CONTRATOS-FINDN                                         
478210  IF WS-STATUS-BASE > 0                                                       
478510     IF WS-STATUS-BASE = 1                                                    
478530       IF WS-INSTRUMENTOS-CBII = 1                                            
478550         CLOSE CBIIFIN WITH LOCK                                              
478560         MOVE 83                      TO WS-S151-0103-FUNCION                 
478570         MOVE WS-FECHA-PRO            TO WS-S151-0103-FECHA-SDO               
478590         PERFORM 40000500-CALL-151SDO THRU 40000500-EXIT                      
478610         MOVE 1 TO WS-2VEZ                                                    
478650         MOVE WS-NUM-ACT11            TO W77-ID-ACTXX-MAPLI                   
478690         MOVE " "                     TO W77-ID-TXTA-LIB                      
478710         PERFORM 70000950-ACT-REGPROC                                         
478730         PERFORM 70000910-FIN-ACTI-MAPLI                                      
478750       ELSE                                                                   
478810         CLOSE S151FIN WITH LOCK                                              
479110         MOVE 82                      TO WS-S151-0103-FUNCION                 
479410         MOVE WS-FECHA-PRO            TO WS-S151-0103-FECHA-SDO               
479710         PERFORM 40000500-CALL-151SDO THRU 40000500-EXIT                      
480010         MOVE 1 TO WS-2VEZ                                                    
480020         MOVE WS-NUM-ACT06            TO W77-ID-ACTXX-MAPLI                   
480030         PERFORM 70000910-FIN-ACTI-MAPLI                                      
480310     ELSE                                                                     
481210         STRING "ERROR AL HACER FIND A B03",WS-STATUS-BASE                    
481510         DELIMITED BY SIZE INTO             WS-0101-TEXT-MSG                  
481810         PERFORM 70000050-MENSAJE                                             
482110         CALL SYSTEM DMTERMINATE.                                             
482130                                                                              
482150     IF WS-2VEZ = 0                                                           
482170        MOVE B03-NUM-PRODUCTO  TO WS03-NUM-PRODUCTO                           
482190        MOVE B03-NUM-INSTRUM   TO WS03-NUM-INSTRUM                            
482210        MOVE B03-MONEDA        TO WS03-MONEDA                                 
482220        MOVE B03-NUM-CONTRATO  TO WS03-NUM-CONTRATO                           
482230        IF WS03-88-PIM-PROD-A-SOR                                             
482250           MOVE ZERO TO B03-FEC-CAMBPROD.                                     
482410                                                                              
482710  IF WS-2VEZ = 0                                                              
482715    IF WS-INSTRUMENTOS-CBII = 0                                               
482720       MOVE WS-NUM-ACT06     TO W77-ID-ACTXX-MAPLI                            
482730       MOVE " "              TO W77-ID-TXTA-LIB                               
482740       PERFORM 70000950-ACT-REGPROC                                           
482750    ELSE                                                                      
482760       MOVE WKS-NUMACT-LIB(99) TO W77-ID-ACTXX-MAPLI                          
482770       PERFORM 70000900-INICALL-LIB                                           
482780       PERFORM 70000900-FINCALL-LIB.                                          
482810                                                                              
482830  IF WS-2VEZ = 0                                                              
483010     IF (B03-FEC-APERTURA > WS-FECHA-PRO)                                     
483020     OR (B03-MIGR-S111 = 1)                                                   
483310        NEXT SENTENCE                                                         
483330     ELSE                                                                     
483350        IF WS-INSTRUMENTOS-CBII = 1                                           
483370           IF WS03-88-PIM-CBII OR B03-SERVCITIDIREC > 0                       
483390              PERFORM 52220000-GRABO-CTES THRU 52220000-EXIT                  
483450           ELSE                                                               
483510              NEXT SENTENCE                                                   
483610        ELSE                                                                  
483660*          WS-INSTRUMENTOS-CBII = 0                                           
483710           IF WS03-88-PIM-CBII OR B03-SERVCITIDIREC > 0                       
483760              NEXT SENTENCE                                                   
483810           ELSE                                                               
483910              PERFORM 52220000-GRABO-CTES THRU 52220000-EXIT.                 
485110                                                                              
485410 52200000-EXIT.                                                               
485710      EXIT.                                                                   
486010                                                                              
486310****************************************************************              
486610* GRABO LOS SALDOS PARA EL ARCHIVO DE CLIENTES DE CTAMAE.                     
486910****************************************************************              
487210 52220000-GRABO-CTES.                                                         
487510    PERFORM 52240000-CONHIS         THRU 52240000-EXIT.                       
487520*                                                                             
487525     IF WS-B06-FECREAL-CORTE  = WS-FECHA-PRO                                  
487530    AND WS03-88-PIM-CTAGLOB                                                   
487535           PERFORM 52220095-LIGA-ORIG                                         
487540     ELSE                                                                     
487545        MOVE ZEROS  TO WS-S500-L040-05-PROD-S                                 
487550                       WS-S500-L040-05-INST-S                                 
487555                       WS-S500-L040-05-MONE-S                                 
487560                       WS-S500-L040-05-IOPE-S                                 
487565                       WS-S500-L040-05-NINV-S                                 
487570                       WS-S500-L040-05-CTO-S                                  
487575                       WS-S500-L040-05-CTO-S016.                              
487580*                                                                             
487810    PERFORM 52220100-ENVIO-COMUN    THRU 52220100-EXIT.                       
488110    IF WS-B06-FECREAL-CORTE  = WS-FECHA-PRO                                   
488410       MOVE 0  TO WS-CONTA                                                    
488710       PERFORM 52220050-CAL-CAMPOS  THRU 52220050-EXIT                        
489010       PERFORM 52220200-SDOS-COMP   THRU 52220200-EXIT                        
489310    ELSE                                                                      
489610       MOVE 0  TO WS-CONTA                                                    
489910       PERFORM 52220300-SDOS-UNICOS THRU 52220300-EXIT.                       
490210    PERFORM 40000500-CALL-151SDO    THRU 40000500-EXIT.                       
490510    MOVE ALL @00@ TO WS-S151-0103-DATOS                                       
490810                     WS-S151-0103-CORTES.                                     
490812    MOVE ZEROS    TO WS-S151-0103-PROD-CTO-ORI                                
490814                     WS-S151-0103-INST-CTO-ORI                                
490816                     WS-S151-0103-MONE-CTO-ORI                                
490818                     WS-S151-0103-CTO-CTO-ORI.                                
490900                                                                              
491110    IF B03-FEC-CAMBPROD   = WS-FECHA-PRO                                      
491410       MOVE 0  TO WS-CONTA B03-FEC-CAMBPROD                                   
491710       PERFORM 52220100-ENVIO-COMUN THRU 52220100-EXIT                        
492010       PERFORM 52220300-SDOS-UNICOS THRU 52220300-EXIT                        
492310       PERFORM 40000500-CALL-151SDO THRU 40000500-EXIT                        
492610       MOVE ALL @00@ TO WS-S151-0103-DATOS                                    
492910                        WS-S151-0103-CORTES.                                  
492912       MOVE ZEROS    TO WS-S151-0103-PROD-CTO-ORI                             
492914                        WS-S151-0103-INST-CTO-ORI                             
492916                        WS-S151-0103-MONE-CTO-ORI                             
492918                        WS-S151-0103-CTO-CTO-ORI.                             
493210 52220000-EXIT.                                                               
493510    EXIT.                                                                     
493810                                                                              
494110****************************************************************              
494410* REALIZO EL CALCULO DE LOS CAMPOS QUE ME FALTA ENVIAR AL S151.               
494710****************************************************************              
495010 52220050-CAL-CAMPOS.                                                         
495310     PERFORM 52220060-CAL-DIASCICLO  THRU 52220060-EXIT.                      
495610     PERFORM 52220070-CAL-SDOPROMAN  THRU 52220070-EXIT.                      
495910     PERFORM 52220080-CAL-TASRENDAN  THRU 52220080-EXIT.                      
496210     PERFORM 52220090-CAL-DIAINICIO  THRU 52220090-EXIT.                      
496510 52220050-EXIT.                                                               
496810    EXIT.                                                                     
497110                                                                              
497410****************************************************************              
497710* REALIZO EL CALCULO DE LOS DIAS DEL CICLO.                                   
498010****************************************************************              
498310 52220060-CAL-DIASCICLO.                                                      
498610     MOVE WS-FECHA-PRO            TO WS-FEC-PUENTE-AMD.                       
498910        MOVE 01                      TO WS-PUENTE-MM.                         
499210        MOVE 01                      TO WS-PUENTE-DD.                         
499510     IF B03-FEC-APERTURA < WS-FEC-PUENTE-AMD                                  
499810        MOVE  WS-FEC-PUENTE-AMD   TO WS-S006-FECHA2                           
500110     ELSE                                                                     
500410        MOVE B03-FEC-APERTURA     TO WS-S006-FECHA2.                          
500710     MOVE B06-FEC-CICLOANT        TO WS-S006-FECHA1.                          
501010     MOVE 12                      TO WS-S006-FORMATO                          
501310     MOVE 02                      TO WS-S006-FUNCION.                         
501610     PERFORM 40000000-CALL-FECPRO THRU 40000000-EXIT.                         
501910     MOVE WS-S006-FECHA1          TO WS-DIAS-ANO.                             
502100                                                                              
502210     IF B03-FEC-CAMBPROD = WS-B06-FECREAL-CORTE                               
502510        NEXT SENTENCE                                                         
502810     ELSE                                                                     
503110        ADD  1                    TO WS-DIAS-ANO.                             
503410 52220060-EXIT.                                                               
503710    EXIT.                                                                     
504010                                                                              
504310****************************************************************              
504610* REALIZO EL CALCULO DEL SALDO PROMEDIO ANUAL.                                
504910****************************************************************              
505210 52220070-CAL-SDOPROMAN.                                                      
505510     IF WS-DIAS-ANO > 0                                                       
505810        COMPUTE WS-SDO-PROMANUAL = B06-ACUM-PROMANU / WS-DIAS-ANO             
506110     ELSE                                                                     
506410        MOVE 0                   TO  WS-SDO-PROMANUAL.                        
506710 52220070-EXIT.                                                               
507010    EXIT.                                                                     
507310                                                                              
507610****************************************************************              
507910* CALCULO LA TASA DE RENDIMIENTO ANUAL.                                       
508210****************************************************************              
508510 52220080-CAL-TASRENDAN.                                                      
508810     IF WS-SDO-PROMANUAL > 0                                                  
509110        COMPUTE WS-TASA-RENDANUAL =( B06-ACUM-INTSANU /                       
509410                WS-SDO-PROMANUAL) * 100                                       
509710     ELSE                                                                     
510010        MOVE ZEROS  TO WS-TASA-RENDANUAL.                                     
510310                                                                              
510610 52220080-EXIT.                                                               
510910     EXIT.                                                                    
511210                                                                              
511510*****************************************************************             
511810* CALCULO LA FECHA DE INICIO DEL  MOVIMIENTO.                                 
511815* SI B03-GEN-EDOCTA = 4 GENERA EDO DE CUENTA PERO NO SE IMPRIME.              
511820* SI B03-GEN-EDOCTA = 3 SIGNIFICA QUE GENERA EDO DE CUENTA BIMES.             
511830* SI B03-GEN-EDOCTA = 2 NO GENERA EDO DE CUENTA A PAPEL.                      
511840* SI B03-GEN-EDOCTA = 1 GENERA EDO. DE CTA. A PAPEL MENSUAL.                  
512110*****************************************************************             
512410 52220090-CAL-DIAINICIO.                                                      
512420     IF B03-GEN-EDOCTA = 3                                                    
512430        MOVE B03-FEC-CORTE(3)        TO WS-FEC-TEMPORAL                       
512440     ELSE                                                                     
512450        MOVE B03-FEC-CORTE(2)        TO WS-FEC-TEMPORAL.                      
512460                                                                              
512710     IF WS-FEC-TEMPORAL    = 0                                                
513010        MOVE B03-FEC-APERTURA        TO WS-FECHA-INICIO                       
513310     ELSE                                                                     
513610        IF WS-FEC-TEMPORAL  = B03-FEC-CAMBPROD                                
513910           MOVE B03-FEC-CAMBPROD     TO WS-FECHA-INICIO                       
514210        ELSE                                                                  
514510           MOVE WS-FEC-TEMPORAL      TO WS-S006-FECHA1                        
514810           MOVE 1                    TO WS-S006-FECHA2                        
515110           MOVE 13                   TO WS-S006-FORMATO                       
515410           MOVE 8                    TO WS-S006-FUNCION                       
515710           PERFORM 40000000-CALL-FECPRO THRU 40000000-EXIT                    
516010           MOVE WS-S006-FECHA1       TO WS-FECHA-INICIO.                      
516310 52220090-EXIT.                                                               
516610    EXIT.                                                                     
516910                                                                              
517010****************************************************************              
517020 52220095-LIGA-ORIG.                                                          
517030     MOVE B03-NUM-PRODUCTO   TO WS-S500-L040-05-PROD-I.                       
517040     MOVE B03-NUM-INSTRUM    TO WS-S500-L040-05-INST-I.                       
517050     MOVE B03-MONEDA         TO WS-S500-L040-05-MONE-I.                       
517060     MOVE B03-NUM-CONTRATO   TO WS-S500-L040-05-CTO-I.                        
517070                                                                              
517080     PERFORM 20000500-S500L040-DA-CTORIG.                                     
517090     IF WS-S500-L040-RESULT > 0                                               
517100        MOVE ZEROS        TO WS-S500-L040-05-PROD-S                           
517110                             WS-S500-L040-05-INST-S                           
517120                             WS-S500-L040-05-MONE-S                           
517130                             WS-S500-L040-05-IOPE-S                           
517140                             WS-S500-L040-05-NINV-S                           
517150                             WS-S500-L040-05-CTO-S                            
517160                             WS-S500-L040-05-CTO-S016.                        
517165**   ELSE                                                                     
517170**      DISPLAY "PROD "  WS-S500-L040-05-PROD-S                               
517175**      DISPLAY "INTR "  WS-S500-L040-05-INST-S                               
517180**      DISPLAY "MONE "  WS-S500-L040-05-MONE-S                               
517185**      DISPLAY "IOPE "  WS-S500-L040-05-IOPE-S                               
517190**      DISPLAY "NINV "  WS-S500-L040-05-NINV-S                               
517195**      DISPLAY "CTO  "  WS-S500-L040-05-CTO-S                                
517200**      DISPLAY "C-16 "  WS-S500-L040-05-CTO-S016.                            
517205                                                                              
517210****************************************************************              
517510* MUEVO LOS CAMPOS NECESARIOS PARA ENVIAR LOS SALDOS AL S151.                 
517520* ESTOS CAMPOS SE ENVIAN SIEMPRE.                                             
517810****************************************************************              
518110 52220100-ENVIO-COMUN.                                                        
518410     MOVE 81                      TO WS-S151-0103-FUNCION.                    
518710     MOVE WS-FECHA-PRO            TO WS-S151-0103-FECHA-SDO.                  
519010     IF B03-FEC-CAMBPROD = WS-FECHA-PRO                                       
519310        MOVE B03-PRODUCTO-ANT     TO   WS-S151-0103-PRODUCTO                  
519610        MOVE B03-INSTRUM-ANT      TO   WS-S151-0103-INSTRUM                   
519910     ELSE                                                                     
520210        MOVE B03-NUM-PRODUCTO     TO WS-S151-0103-PRODUCTO                    
520510        MOVE B03-NUM-INSTRUM      TO WS-S151-0103-INSTRUM.                    
520810     MOVE B03-SUC-PROMOTORA       TO 151-SUCURSAL                             
520820     MOVE B03-GEN-EDOCTA          TO WS-S151-0103-GENEDOCTA                   
520900**     IF B03-MARCA-CLON = 3                                                  
521000**        MOVE 0                    TO WS-S151-0103-GENEDOCTA.                
521110     MOVE B03-NUM-CONTRATO        TO 151-CONTRATO                             
521410     MOVE CONTRATO-151            TO WS-S151-0103-CONTRATO                    
521710     IF B03-CTA-CONCENT = 11 OR 61 OR 63                                      
522010        MOVE 1                    TO WS-S151-0103-ESCTACONC                   
522310     ELSE                                                                     
522610        MOVE 0                    TO WS-S151-0103-ESCTACONC.                  
522910     MOVE B03-ESTACION-LB         TO WS-S151-0103-TERM-LB                     
522920     IF B03-FEC-ULTACT > WS-FECHA-PRO                                         
522930        MOVE WS-FECHA-PRO         TO WS-S151-0103-FECULTMOV                   
522940     ELSE                                                                     
523210        MOVE B03-FEC-ULTACT       TO WS-S151-0103-FECULTMOV.                  
523510     MOVE WS-FECHA-PRO            TO WS-S151-0103-FECHA-SDO.                  
523810     MOVE B03-MONEDA              TO WS-S151-0103-MONEDA.                     
524110     MOVE 0                       TO WS-S151-0103-ID-REG.                     
524120     MOVE B03-SERVCITIDIREC       TO WS-S151-0103-SERVCITIDIREC.              
524125*INI INDICADOR BNE FA91943                                                    
524130     MOVE B03-IND-BNE-DIV         TO WS-S151-0103-IND-BNE.                    
524135*FIN INDICADOR BNE FA91943                                                    
524170     IF B03-SERVCITIDIREC = 4                                                 
524220        MOVE 2   TO WS-S151-0103-SERVCITIDIREC                                
524270     ELSE                                                                     
524320     IF B03-SERVCITIDIREC = 5                                                 
524370        MOVE 3   TO WS-S151-0103-SERVCITIDIREC.                               
524410 52220100-EXIT.                                                               
524710   EXIT.                                                                      
525010                                                                              
525310****************************************************************              
525610* CUANDO EL CONTRATO TUVO FECHA DE CORTE SE ENVIAN TODOS LOS                  
525910* CAMPOS DEL LLAMADO INCLUYENDO TODOS LOS SALDOS, TASAS Y FECHAS.             
526210* LOS INDICADORES DEL EDO. DE CTA SE MANEJAN DE LA SIG. MANERA:               
526510* 1 CTO. ACTIVO Y SE GENERA EDO. DE CTA.                                      
526810* 2 CTO. CANCELADO Y GENERA EDO. DE CTA. POR ULTIMA VEZ.                      
527110* 3 CTO. BLOQUEADO Y GENERA EDO. DE CTA.                                      
527410* 4 CTO. INACTIVO Y NO SE GENERA EDO. DE CTA.                                 
527710* 5 CTO. ACTIVO O BLOQUEADO QUE TIENE UN MES SIN MOVERSE.                     
528010* 6 CTO. ACTIVO O BLOQUEADO QUE TIENE 2 MESES SIN MOVERSE.                    
528310* 7 CTO. CANCELADO CON STATUS = 4 Y 3 MESES SIN MOVERSE.                      
528320* 8 VALOR  ESPECIAL MANEJADO PARA QUE INDEPENDIENTEMENTE DEL                  
528340*   VALOR QUE TENGA B03-STATUS, SI SE TRATA DE PRODUCTO 1-30-1                
528350*   INDICARLE AL S050 QUE NO SE GENERE EDO. DE CTA.                           
528360*13 CTO. ACTIVO O BLOQUEADO QUE TIENE 3 MESES SIN MOVERSE.                    
528370*14 CTO. ACTIVO O BLOQUEADO QUE TIENE 4 MESES SIN MOVERSE.                    
528380*15 CTO. ACTIVO O BLOQUEADO QUE TIENE 5 MESES SIN MOVERSE.                    
528390*16 CTO. CANCELADO CON STATUS = 4 Y 6 MESES SIN MOVERSE(AUT.).                
528610****************************************************************              
528910 52220200-SDOS-COMP.                                                          
529210   IF (B06-FEC-CANCEL > 0)   AND (B03-STATUS > 1)  AND                        
529310      (B03-STATUS NOT = 5)                                                    
529510     MOVE B06-FEC-CANCEL           TO WS-S151-0103-FINCICLO                   
529810   ELSE                                                                       
530110     MOVE B06-FEC-CICLOANT         TO WS-S151-0103-FINCICLO.                  
530410     MOVE WS-FECHA-INICIO          TO WS-S151-0103-INICICLO.                  
530710     MOVE WS-DIAS-ANO              TO WS-S151-0103-DIAS-ANUAL.                
531010     MOVE B06-DIAS-CICLO           TO WS-S151-0103-DIAS-CICLO.                
531310     MOVE B03-TASA-ANTERIOR        TO WS-S151-0103-TASA-NETA.                 
531610     MOVE B06-TASA-BRUTA           TO WS-S151-0103-TASA-BRUTA.                
531910     MOVE WS-TASA-RENDANUAL        TO WS-S151-0103-TASA-ANUAL.                
532210                                                                              
532510     IF B03-STATUS = 0 OR 1 OR 5                                              
532810        IF B03-STA-CANCEL = 1 OR 2 OR 3 OR 4 OR 5                             
533110           PERFORM 52220210-CANAUT THRU 52220210-EXIT                         
533410        ELSE                                                                  
533710           IF B03-STATUS = 0                                                  
534010              MOVE 1               TO WS-S151-0103-ID-EDOCTA                  
534310           ELSE                                                               
534610              MOVE 3               TO WS-S151-0103-ID-EDOCTA.                 
534910                                                                              
535210     IF B03-STATUS = 2  OR 3 OR 4                                             
535220        IF B03-STATUS = 2 OR 3                                                
535230           MOVE 2                  TO WS-S151-0103-ID-EDOCTA                  
535240        ELSE                                                                  
535510           IF B03-STA-CANCEL = 3 OR 6                                         
535520              IF B03-STA-CANCEL = 3                                           
535810                 MOVE 7            TO WS-S151-0103-ID-EDOCTA                  
535820              ELSE                                                            
535830                 MOVE 16           TO WS-S151-0103-ID-EDOCTA.                 
536710                                                                              
536720     IF (B03-NUM-PRODUCTO = 1) AND (B03-NUM-INSTRUM = 30) AND                 
536730        (B03-MONEDA = 1)                                                      
536740         MOVE 8                    TO WS-S151-0103-ID-EDOCTA.                 
536742*-------------------------------------------------------*                     
536744* APAGA LA MARCA CLON SI SU VALOR ACTUAL ES IGUAL A 3   *                     
536746*-------------------------------------------------------*                     
536748     IF B03-MARCA-CLON = 3                                                    
536750        MOVE 0                     TO WS-S151-0103-ID-EDOCTA.                 
536752                                                                              
536760***********************************************************                   
536765     IF WS03-88-PIM-CTAGLOB                                                   
536766***     IF WS03-NUM-CTO-PREF = 9998                                           
536767***        NEXT SENTENCE                                                      
536768***     ELSE                                                                  
536775           MOVE WS-S500-L040-05-PROD-S                                        
536776             TO WS-S151-0103-PROD-CTO-ORI                                     
536780           MOVE WS-S500-L040-05-INST-S                                        
536781             TO WS-S151-0103-INST-CTO-ORI                                     
536790           MOVE WS-S500-L040-05-MONE-S                                        
536791             TO WS-S151-0103-MONE-CTO-ORI                                     
536792                                                                              
536795           IF WS-S500-L040-05-CTO-S016 > 0                                    
536800              MOVE WS-S500-L040-05-CTO-S016                                   
536805                TO WS-S151-0103-CTO-CTO-ORI                                   
536810           ELSE                                                               
536820              MOVE WS-S500-L040-05-CTO-S                                      
536825                TO WS-S151-0103-CTO-CTO-ORI.                                  
536830                                                                              
536840************************************************************                  
536850                                                                              
537010      ADD 1 TO WS-CONTA                                                       
537310      MOVE 2                 TO WS-S151-0103-CVE-DTO(WS-CONTA)                
537610      IF B03-FEC-CAMBPROD = WS-FECHA-PRO                                      
537910         MOVE 0              TO WS-S151-0103-IMP-DTO(WS-CONTA)                
538210      ELSE                                                                    
538510         COMPUTE WS-S151-0103-IMP-DTO(WS-CONTA) =                             
538520                 B03-SDO-ANTERIOR +  B03-SDOPROT-ANT.                         
538810                                                                              
539110      ADD 1 TO WS-CONTA                                                       
539410      MOVE B03-SDO-PENDIENTE TO WS-S151-0103-IMP-DTO(WS-CONTA)                
539710      MOVE 3                 TO WS-S151-0103-CVE-DTO(WS-CONTA).               
540010                                                                              
540310      ADD 1 TO WS-CONTA                                                       
540610      MOVE B03-AUT-PENDIENTE TO WS-S151-0103-IMP-DTO(WS-CONTA)                
540910      MOVE 11                TO WS-S151-0103-CVE-DTO(WS-CONTA).               
541210                                                                              
541220      ADD 1                  TO WS-CONTA                                      
541230      MOVE 354               TO WS-S151-0103-CVE-DTO(WS-CONTA).               
541235                                                                              
541240      COMPUTE WS-SDODIS-151  = INV-SDOACT-S -                                 
541250         (B03-AUT-PENDIENTE + B03-SDO-PROTEGIDO +                             
541255          INV-SDOBLO-S + B03-PCOBP-PENDTE + B03-SDO-DAANT-TES).               
541256                                                                              
541260      IF (WS-SDODIS-151 < 0) OR (B03-FEC-CAMBPROD = WS-FECHA-PRO)             
541270         MOVE 0              TO WS-S151-0103-IMP-DTO(WS-CONTA)                
541280      ELSE                                                                    
541290         MOVE WS-SDODIS-151  TO WS-S151-0103-IMP-DTO(WS-CONTA).               
541300                                                                              
541510      IF WS-MENSUAL = 1                                                       
541810        ADD 1 TO WS-CONTA                                                     
542110        MOVE B06-SDOPROM-FINAN TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542410        MOVE 12                TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542420                                                                              
542430      ADD 1 TO WS-CONTA                                                       
542432      MOVE B03-SDO-AOANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542434      MOVE 362                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542436                                                                              
542438      ADD 1 TO WS-CONTA                                                       
542440      MOVE B03-SDO-ARANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542442      MOVE 363                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542444                                                                              
542446      ADD 1                    TO WS-CONTA                                    
542448      MOVE B03-SDO-DAANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542450      MOVE 364                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542452                                                                              
542454      ADD 1 TO WS-CONTA                                                       
542456      MOVE B03-SDO-TRANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542458      MOVE 365                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542460                                                                              
542462      ADD 1                    TO WS-CONTA                                    
542464      MOVE B03-SDO-TAANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
542466      MOVE 366                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
542710                                                                              
543010      ADD 1 TO WS-CONTA                                                       
543310      MOVE B06-PROM-CICLO(12)  TO WS-S151-0103-IMP-DTO(WS-CONTA)              
543610      MOVE 13                  TO WS-S151-0103-CVE-DTO(WS-CONTA).             
543910                                                                              
544210      ADD 1 TO WS-CONTA                                                       
544510      MOVE WS-SDO-PROMANUAL  TO WS-S151-0103-IMP-DTO(WS-CONTA)                
544810      MOVE 14                TO WS-S151-0103-CVE-DTO(WS-CONTA).               
545110                                                                              
545410      ADD 1                  TO WS-CONTA                                      
545710      MOVE B03-INTS-CAPIT    TO WS-S151-0103-IMP-DTO(WS-CONTA)                
546010      MOVE 15                TO WS-S151-0103-CVE-DTO(WS-CONTA).               
546310                                                                              
546610      ADD 1 TO WS-CONTA                                                       
546910      MOVE B06-ACUM-INTSANU  TO WS-S151-0103-IMP-DTO(WS-CONTA)                
547210      MOVE 16                TO WS-S151-0103-CVE-DTO(WS-CONTA).               
547510                                                                              
547810      ADD 1                  TO WS-CONTA                                      
548110      MOVE B03-IMPUESTO-RET  TO WS-S151-0103-IMP-DTO(WS-CONTA)                
548410      MOVE 30                TO WS-S151-0103-CVE-DTO(WS-CONTA).               
548710 52220200-EXIT.                                                               
549010    EXIT.                                                                     
549310                                                                              
549610******************************************************************            
549910* VALORES MANEJADOS PARA IDENTIFICAR EL NUMERO DE MESES SIN MOVS.             
550210* DE UN CONTRATO, LOS VALORES UTILIZADOS SON 5,6,13,14 Y 15.                  
550510******************************************************************            
550810 52220210-CANAUT.                                                             
551110     IF B03-STA-CANCEL = 1                                                    
551410        MOVE 5               TO WS-S151-0103-ID-EDOCTA.                       
551420                                                                              
551430     IF B03-STA-CANCEL = 2                                                    
552010        MOVE 6               TO WS-S151-0103-ID-EDOCTA.                       
552020                                                                              
552030     IF B03-STA-CANCEL = 3                                                    
552040        MOVE 13              TO WS-S151-0103-ID-EDOCTA.                       
552050                                                                              
552060     IF B03-STA-CANCEL = 4                                                    
552070        MOVE 14              TO WS-S151-0103-ID-EDOCTA.                       
552080                                                                              
552090     IF B03-STA-CANCEL = 5                                                    
552100        MOVE 15              TO WS-S151-0103-ID-EDOCTA.                       
552310 52220210-EXIT.                                                               
552610   EXIT.                                                                      
552910                                                                              
553210******************************************************************            
553510* CUANDO EL CONTRATO NO TUVO NINGUN CORTE SOLOS SE ENVIAS CIERTOS             
553810* SALDOS.                                                                     
554110******************************************************************            
554410 52220300-SDOS-UNICOS.                                                        
554710     MOVE 0                         TO WS-S151-0103-ID-EDOCTA.                
555010     MOVE 0                         TO WS-S151-0103-FINCICLO.                 
555310     MOVE 0                         TO WS-S151-0103-INICICLO.                 
555610                                                                              
555910     ADD 1                  TO WS-CONTA                                       
556210     MOVE 2                 TO WS-S151-0103-CVE-DTO(WS-CONTA)                 
556510     COMPUTE WS-S151-0103-IMP-DTO(WS-CONTA) =                                 
556520             B03-SDO-ANTERIOR +  B03-SDOPROT-ANT.                             
556810                                                                              
557110     ADD 1                  TO WS-CONTA                                       
557410     MOVE B03-SDO-PENDIENTE TO WS-S151-0103-IMP-DTO(WS-CONTA)                 
557710     MOVE 3                 TO WS-S151-0103-CVE-DTO(WS-CONTA).                
558010                                                                              
558310     ADD 1                  TO WS-CONTA                                       
558610     MOVE B03-AUT-PENDIENTE TO WS-S151-0103-IMP-DTO(WS-CONTA)                 
558910     MOVE 11                TO WS-S151-0103-CVE-DTO(WS-CONTA).                
559210                                                                              
559220     ADD 1                  TO WS-CONTA                                       
559230     MOVE 354               TO WS-S151-0103-CVE-DTO(WS-CONTA).                
559235                                                                              
559240     COMPUTE WS-SDODIS-151  = INV-SDOACT-S -                                  
559250      (B03-AUT-PENDIENTE + B03-SDO-PROTEGIDO + B03-SDOPROT-ANT +              
559255       B03-PCOBP-PENDTE  + B03-SDO-DAANT-TES).                                
559256                                                                              
559260     IF WS-SDODIS-151 < 0                                                     
559270        MOVE 0              TO WS-S151-0103-IMP-DTO(WS-CONTA)                 
559280     ELSE                                                                     
559290        MOVE WS-SDODIS-151  TO WS-S151-0103-IMP-DTO(WS-CONTA).                
559300                                                                              
559510     IF WS-MENSUAL = 1                                                        
559810        ADD 1                  TO WS-CONTA                                    
560110        MOVE WS-B06-SDOPROM-FINAN                                             
560115          TO WS-S151-0103-IMP-DTO(WS-CONTA)                                   
560410        MOVE 12                TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560415                                                                              
560420      ADD 1 TO WS-CONTA                                                       
560422      MOVE B03-SDO-AOANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
560424      MOVE 362                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560426                                                                              
560428      ADD 1 TO WS-CONTA                                                       
560430      MOVE B03-SDO-ARANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
560432      MOVE 363                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560434                                                                              
560436      ADD 1                    TO WS-CONTA                                    
560438      MOVE B03-SDO-DAANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
560440      MOVE 364                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560442                                                                              
560444      ADD 1 TO WS-CONTA                                                       
560446      MOVE B03-SDO-TRANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
560448      MOVE 365                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560450                                                                              
560452      ADD 1                    TO WS-CONTA                                    
560454      MOVE B03-SDO-TAANT-TES   TO WS-S151-0103-IMP-DTO(WS-CONTA)              
560456      MOVE 366                 TO WS-S151-0103-CVE-DTO(WS-CONTA).             
560458                                                                              
560710 52220300-EXIT.                                                               
561010     EXIT.                                                                    
561310                                                                              
561610******************************************************************            
569110                                                                              
569410****************************************************************              
569710* BUSCO EL CONTRATO LEIDO EN EL DATASET HISTORICO Y SI SE CUMPLE              
570010* LA CONDICION BUSCADA, SU SALDO AA SERA PASADO AL ARCH. SORT.                
570310****************************************************************              
570610 52240000-CONHIS.                                                             
570910    MOVE B03-NUM-CONTRATO TO WS-NUM-CONTRATO WS-MSG-CTO                       
571210    PERFORM 90000006-B06SXCTO-FIND                                            
571510    IF WS-STATUS-BASE > 0                                                     
571810     IF WS-STATUS-BASE = 1                                                    
572710        STRING  "CTO INEXISTENTE EN HIS. ",WS-MSG-CTO                         
573010                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
573310        PERFORM 70000050-MENSAJE                                              
573610        MOVE 1                                TO WS-3VEZ                      
573910     ELSE                                                                     
574810        STRING "ERROR AL HACER FIND  A B06 ",WS-STATUS-BASE                   
575110        DELIMITED BY SIZE INTO               WS-0101-TEXT-MSG                 
575410        PERFORM 70000050-MENSAJE                                              
575710        CALL SYSTEM DMTERMINATE.                                              
576010                                                                              
576310    IF WS-3VEZ = 0                                                            
577265          MOVE B06-FECREAL-CORTE    TO WS-B06-FECREAL-CORTE                   
577270          MOVE B06-SDOPROM-FINAN    TO WS-B06-SDOPROM-FINAN                   
577510    ELSE                                                                      
578710          MOVE 0                    TO WS-3VEZ                                
578720          MOVE 0                    TO WS-B06-FECREAL-CORTE                   
578725          MOVE 0                    TO WS-B06-SDOPROM-FINAN.                  
578730                                                                              
579010 52240000-EXIT.                                                               
579310    EXIT.                                                                     
579610                                                                              
579910****************************************************************              
580210* ACCESO EL DATASET DE PRODUCTOS PARA OBTENER EL MEDIO DE ACCESO              
580510* DEL CONTRATO Y SABER SI EL CONTRATO SERA ENVIADO O NO A                     
580810* TARJETAS.                                                                   
581110****************************************************************              
581410 52250000-CONMEDAC.                                                           
581710    MOVE 0 TO WS-C5.                                                          
582010    PERFORM 52250100-PASO  VARYING WS-C5 FROM 1 BY 1                          
582310            UNTIL (WS-MEDAC-PRD(WS-C5)  = B03-NUM-PRODUCTO) AND               
582610                  (WS-MEDAC-INS(WS-C5)  = B03-NUM-INSTRUM ) AND               
582910                  (WS-MEDAC-MON(WS-C5)  = B03-MONEDA      )  OR               
583210                  (WS-C5 > 30).                                               
583510    IF (WS-C5 < 31) AND (WS-C5 > 0)                                           
583810       MOVE WS-MEDAC-MAC(WS-C5)               TO INV-BANTAR-S                 
584110    ELSE                                                                      
584410       MOVE B03-NUM-PRODUCTO                  TO WS-MSG-PRD                   
584710       MOVE B03-NUM-INSTRUM                   TO WS-MSG-INST                  
585010       MOVE B03-MONEDA                        TO WS-MSG-MDA                   
585910       MOVE "PRD/MEDAC INEX. EN LA TABLA "    TO WS-0101-TEXT-MSG             
586210       PERFORM 70000050-MENSAJE                                               
586510       PERFORM 52250200-DIS-PIM               THRU 52250200-EXIT              
586810       CALL SYSTEM DMTERMINATE.                                               
587110 52250000-EXIT.                                                               
587410    EXIT.                                                                     
587710                                                                              
588010******************************************************************            
588310* ESTA RUTINA NO EJECUTA NUNGUN PROCESO DENTRO DEL PROGRAMA.                  
588610* SOLO ES UTILIZADA COMO SALIDA PARA EL MOMENTO EN QUE HA SIDO                
588910* PERMINADA LA LECTURA DE LA TABLA, E IDENTIFICAR SI HUBO O NO UN             
589210* ERROR EN LA BUSQUEDA DE UN ELEMENTO DE DICHA TABLA.                         
589510******************************************************************            
589810 52250100-PASO.                                                               
590110                                                                              
590410******************************************************************            
590710* DESPLIEGA EL PRODUCTO, INSTRUMENTO Y MONEDA DESEADO, YA SEA COMO            
591010* UN MSG. INFORMATIVO O COMO UN MSG. DE ERROR.                                
591310******************************************************************            
591610 52250200-DIS-PIM.                                                            
592510     STRING "PROD-INST-MONEDA ", WS-MSG-PRD                                   
592810                            "-", WS-MSG-INST                                  
593110                            "-", WS-MSG-MDA                                   
593410            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
593710     PERFORM 70000050-MENSAJE.                                                
594010                                                                              
594310                                                                              
594610                                                                              
594910                                                                              
595210                                                                              
595510                                                                              
595810                                                                              
596110                                                                              
596410 52250200-EXIT.                                                               
596710     EXIT.                                                                    
597010                                                                              
597015****************************************************************              
597020* OBTENCION DEL NUMERO DE INTERCOMPANY DE LA LIB. S016L422.                   
597025****************************************************************              
597030 52255000-OBTENGO-INTER.                                                      
597031      MOVE B03-TIPO-PERSONA             TO WS03-TIPO-PERSONA                  
597032      IF ((B03-NUM-PRODUCTO = 500) AND (B03-NUM-INSTRUM =  6))                
597038      OR ((B03-NUM-PRODUCTO =  66) AND (B03-NUM-INSTRUM = 90))                
597040      OR (WS03-88-TP-GFISICA)                                                 
597048         MOVE 0                         TO INV-INTERCOMPANY-S                 
597050      ELSE                                                                    
597052          MOVE B03-NUM-CLIENTE          TO WS03-NUM-CLIENTE                   
597054          PERFORM 40000600-CALL-INTER   THRU 40000600-EXIT.                   
597056 52255000-EXIT.                                                               
597058     EXIT.                                                                    
597060                                                                              
597310****************************************************************              
597610*       OBTENCION DEL NODO POR MEDIO DE LA SUCURSAL DE INV.                   
597910****************************************************************              
598210 52260000-OBTENGO-NODO.                                                       
598510      MOVE B03-SUC-PROMOTORA            TO WKS-S080-NUMSUC                    
598810      MOVE WS-FECHA-PRO                 TO WKS-S080-FECHA                     
599110      MOVE 180                          TO WKS-S080-NUMPASO.                  
599410      PERFORM 40000400-CALL-NODO        THRU 40000400-EXIT.                   
601510 52260000-EXIT.                                                               
601810     EXIT.                                                                    
601820***********************************************************                   
601850 52265000-OBTENGO-CCB50.                                                      
601852     MOVE ZERO TO  INV-CONTCTRLB50-S.                                         
601854     IF INV-88-SBCTA-TES                                                      
601856        MOVE B03-NUM-CONTRATO TO WS-NUM-CONTRATO-SUBCT                        
601858        PERFORM 90000050-B50SXCCSC-FIND-SC                                    
601860        IF WS-STATUS-BASE = 0                                                 
601862           MOVE B50-NUM-CTOCC-TES  TO  INV-CONTCTRLB50-S.                     
601870                                                                              
601880 52265000-EXIT.                                                               
601882     EXIT.                                                                    
602110                                                                              
602410****************************************************************              
602710* ME SALGO DE LA SECCION DEL SORT DE GRABADO.                                 
603010****************************************************************              
603310** 52000000-EXIT.                                                             
603610**    EXIT.                                                                   
603910                                                                              
604210                                                                              
604510                                                                              
604810                                                                              
605110                                                                              
605410                                                                              
605710****************************************************************              
606010*  S E C C I O N   D E   L E C T U R A   D E L   A R C H I V O                
606310*                       O R D E N A D O.                                      
606610****************************************************************              
606910                                                                              
607210****************************************************************              
607510*               LEO EL ARCHIVO DE INVERSIONES ORDENADO.                       
607810****************************************************************              
608110** 53100000-LEO  SECTION.                                                     
608410 53000000-LEO-ARCHIVO.                                                        
608414    MOVE ATTRIBUTE LASTRECORD OF INVE-PTE TO WS-LASTRECORDM1.                 
608420    MOVE WS-LASTRECORDM1                 TO W77-ID-NUMREG-PROC.               
608430    MOVE 07                              TO W77-ID-ACTXX-MAPLI                
608440    MOVE 07                              TO WS-NUM-ACT07.                     
608450    MOVE "PROC. ARCH.SORT                  "  TO W77-ID-NOMB-LIB.             
608460    MOVE "GEN. REPORTE Y ARCH. LEYENDO SORT " TO W77-ID-TXTA-LIB.             
608470    PERFORM 70000910-INIACT-MAPLI.                                            
608710    PERFORM 53200000-LEO-INV THRU 53200000-EXIT UNTIL WS-4VEZ = 1.            
609010                                                                              
609310 53000000-EXIT.                                                               
609610    EXIT.                                                                     
609910                                                                              
610210****************************************************************              
610510* LEO EL ARCHIVO SORTEADO PARA GENERAR ARCHIVOS PARA EL S151, PA              
610810* RA TARJETAS Y PARA GENERAR LOS REPORTE DE IMPRESION.                        
611110****************************************************************              
611410 53200000-LEO-INV.                                                            
611710     READ INVE-PTE  AT END                                                    
611720        MOVE WS-NUM-ACT07       TO W77-ID-ACTXX-MAPLI                         
611730        PERFORM 70000910-FIN-ACTI-MAPLI                                       
612010        PERFORM  53380000-TOTALES-AHO                                         
612310        PERFORM  53442000-TRAILERTB                                           
612610        PERFORM  53451140-TOT151-CTAMAE                                       
612910        PERFORM  53462000-DISPUNI                                             
613210        PERFORM  53463005-TOT-PRD                                             
613510        PERFORM  53463010-TOT-MON                                             
613810        PERFORM  53463000-TOT-SUC                                             
614110        PERFORM  53467000-TOT-NODO                                            
614410        PERFORM  53468000-TOT-CSI                                             
614710        MOVE 1 TO WS-4VEZ.                                                    
615010                                                                              
615310   IF WS-4VEZ = 0                                                             
615320      MOVE WS-NUM-ACT07       TO W77-ID-ACTXX-MAPLI                           
615330      MOVE " "                TO W77-ID-TXTA-LIB                              
615340      PERFORM 70000950-ACT-REGPROC                                            
615610      IF (INV-PRODUCTO-S = 500) AND (INV-INSTRUMENTO-S = 6)                   
615910          PERFORM 53300000-OPERO-AHORROS                                      
616210      ELSE                                                                    
616510          MOVE 1 TO WS-LEOMAE                                                 
616810          PERFORM 53400000-OPERO-RESTO.                                       
617110 53200000-EXIT.                                                               
617410     EXIT.                                                                    
617710                                                                              
618010                                                                              
618310                                                                              
618610****************************************************************              
618910* CON LOS MOVIMIENTOS DE AHORROS(PRD = 500, INS = 6) GENERO EL                
619210* ARCHIVO PARA EL CIG. Y EL LISTADO DE INVENTARIO.                            
619510****************************************************************              
619810 53300000-OPERO-AHORROS.                                                      
619820   IF ( INV-STATUS-S > 1) AND ( INV-SDOACT-S = 0)                             
619830      NEXT SENTENCE                                                           
619840   ELSE                                                                       
620110      IF WS-SEMANAL = 1                                                       
620410         IF WS-MENSUAL = 1                                                    
620710            NEXT SENTENCE                                                     
621010         ELSE                                                                 
621310            MOVE 1 TO WS-LEOAHO                                               
621610            PERFORM 53310000-AHORROS THRU 53310000-EXIT                       
621620      ELSE                                                                    
621630         NEXT SENTENCE.                                                       
621910 53300000-EXIT.                                                               
622210     EXIT.                                                                    
622510                                                                              
622810                                                                              
623110                                                                              
623410                                                                              
623710                                                                              
624010                                                                              
624310****************************************************************              
624610*     R U T I N A S    P A R A   I N V E R S I O N E S    D E                 
624910*                            A H O R R O S.                                   
625210****************************************************************              
625510                                                                              
625810****************************************************************              
626110* CUANDO SEA FIN DE SEMANA GENERO EL LISTADO DE INVENTARIO, SI                
626410* EL FIN DE SEMANA  COINCIDE CON EL FIN DE MES NO SE GENERA ESTE.             
626710****************************************************************              
627010 53310000-AHORROS.                                                            
627310        PERFORM 53320000-INICIO-AHO      THRU 53320000-EXIT                   
627610        PERFORM 53340000-DETALLE-LISTADO THRU 53340000-EXIT.                  
627910 53310000-EXIT.                                                               
628210     EXIT.                                                                    
628510                                                                              
628810******************************************************************            
629110* RUTINAS EJECUTADAS LA PRIMERA VEZ QUE SE LEE UN MOV. DE AHORROS             
629410******************************************************************            
629710 53320000-INICIO-AHO.                                                         
630010    IF WS-5VEZ = 0                                                            
630310       MOVE INV-PRODUCTO-S     TO    WS-AHO-PRDANT WS-NUM-PRODUCTO            
630610       MOVE INV-INSTRUMENTO-S  TO    WS-AHO-INSANT WS-NUM-INSTRUM             
630910       MOVE INV-MONEDA-S       TO    WS-AHO-MONANT WS-MONEDA                  
631210       MOVE INV-SUCURSAL-S     TO    WS-AHO-SUCANT WS-NUMSUC                  
631510       MOVE INV-NODO-S         TO    WS-AHO-NODOANT                           
631810       PERFORM 53321000-BUSCO-PRD    THRU 53321000-EXIT                       
632110       MOVE B05-NOMBRE-PROD    TO    WS-INVEN-NOMBRE                          
632410       MOVE B05-NUM-PRODUCTO   TO    WS-INVEN-PRD                             
632710       MOVE B05-NUM-INSTRUM    TO    WS-INVEN-INS                             
633010       MOVE B05-MONEDA         TO    WS-INVEN-MON                             
633310       PERFORM 53322000-NOM-SUC      THRU 53322000-EXIT                       
633610       MOVE WS-NOMSUC1         TO    WS-NOMSUC                                
633910       PERFORM 53323000-VALNODO      THRU 53323000-EXIT                       
634210       PERFORM 53324000-ENC-INVEN    THRU 53324000-EXIT                       
634510       MOVE 1 TO WS-5VEZ.                                                     
634810 53320000-EXIT.                                                               
635110     EXIT.                                                                    
635410                                                                              
635710******************************************************************            
636010* OBTENGO EL NOMBRE DEL PRODUCTO PARA LOS REPORTES.                           
636310******************************************************************            
636610 53321000-BUSCO-PRD.                                                          
636910  PERFORM 90000005-B05SXPRDINSTMON-FIND                                       
637210  IF WS-STATUS-BASE > 0                                                       
637510   IF WS-STATUS-BASE = 1                                                      
638410     MOVE "ERROR REG. INEX. EN B05        " TO WS-0101-TEXT-MSG               
638710     PERFORM 70000050-MENSAJE                                                 
639010     MOVE WS-NUM-PRODUCTO                   TO WS-MSG-PRD                     
639310     MOVE WS-NUM-INSTRUM                    TO WS-MSG-INST                    
639610     MOVE WS-MONEDA                         TO WS-MSG-MDA                     
639910     PERFORM 53321100-DIS-PIM THRU          53321100-EXIT                     
640210     CALL SYSTEM DMTERMINATE                                                  
640510   ELSE                                                                       
641410     STRING "ERROR AL HACER FIND A B05 " ,  WS-STATUS-BASE                    
641710     DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                  
642010     PERFORM 70000050-MENSAJE                                                 
642310     CALL SYSTEM DMTERMINATE.                                                 
642610 53321000-EXIT.                                                               
642910     EXIT.                                                                    
643210                                                                              
643510******************************************************************            
643810* DESPLIEGA EL PRODUCTO, INSTRUMENTO Y MONEDA DESEADO, YA SEA COMO            
644110* UN MSG. INFORMATIVO O COMO UN MSG. DE ERROR.                                
644410******************************************************************            
644710 53321100-DIS-PIM.                                                            
645610     STRING "PROD-INST-MONEDA ", WS-MSG-PRD                                   
645910                            "-", WS-MSG-INST                                  
646210                            "-", WS-MSG-MDA                                   
646510            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
646810     PERFORM 70000050-MENSAJE.                                                
647110                                                                              
647410                                                                              
647710                                                                              
648010                                                                              
648310                                                                              
648610                                                                              
648910                                                                              
649210                                                                              
649510 53321100-EXIT.                                                               
649810     EXIT.                                                                    
650110                                                                              
650410****************************************************************              
650710*    OBTENGO EL NOMBRE DE LA SUCURSAL EN LA TABLA CARGADA.                    
651010****************************************************************              
651310 53322000-NOM-SUC.                                                            
651610     MOVE 180               TO WKS-S080-NUMPASO                               
651620     MOVE WS-FECHA-PRO      TO WKS-S080-FECHA                                 
651910     MOVE INV-SUCURSAL-S    TO WKS-S080-NUMSUC.                               
652210     PERFORM 40000450-NOM-SUC      THRU 40000450-EXIT.                        
652510 53322000-EXIT.                                                               
652810      EXIT.                                                                   
653110                                                                              
653410*****************************************************************             
653710*  RUTINA DONDE SE GENERA LA SEPARACION DE BACKUPS DE AHORROS.                
654010*****************************************************************             
654310 53323000-VALNODO.                                                            
654610  IF WS-6VEZ = 0                                                              
654910     MOVE INV-NODO-S                TO WS-INVEN-CI                            
655210     MOVE INV-SUBNODO-S             TO WS-INVEN-SUBNODO                       
655510     SET FILE-INVEN(USERBACKUPNAME) TO VALUE TRUE                             
655810     CHANGE ATTRIBUTE TITLE OF FILE-INVEN TO WS-ETIQ-INVEN                    
656110     OPEN OUTPUT FILE-INVEN                                                   
656410     MOVE 1 TO WS-6VEZ.                                                       
656710                                                                              
657010  IF INV-NODO-S NOT = WS-AHO-NODOANT                                          
657310     MOVE 0                         TO WS-HOJA1                               
657610     PERFORM 53360000-TOT-NODO                                                
657910     CLOSE FILE-INVEN                                                         
658210     MOVE INV-NODO-S                TO WS-AHO-NODOANT                         
658510     MOVE INV-NODO-S                TO WS-INVEN-CI                            
658810     MOVE INV-SUBNODO-S             TO WS-INVEN-SUBNODO                       
659110     SET FILE-INVEN(USERBACKUPNAME) TO VALUE TRUE                             
659410     CHANGE ATTRIBUTE TITLE OF FILE-INVEN TO WS-ETIQ-INVEN                    
659710     OPEN OUTPUT FILE-INVEN.                                                  
660010 53323000-EXIT.                                                               
660310     EXIT.                                                                    
660610                                                                              
660910****************************************************************              
661210* IPRESION DE TITULOS PARA EL LISTADO DE INVENTARIO DE AHORROS.               
661510****************************************************************              
661810 53324000-ENC-INVEN.                                                          
662110   MOVE 0                  TO    WS-LINEA1.                                   
662410   MOVE  SPACES            TO    REG-INVEN.                                   
662710   WRITE REG-INVEN         AFTER CHANNEL 1.                                   
663010   WRITE REG-INVEN         FROM  WS-ENCABEZADO    BEFORE 1.                   
663310   WRITE REG-INVEN         FROM  WS-ENCABEZADO1   BEFORE 1.                   
663610   WRITE REG-INVEN         FROM  WS-03-INVEN      BEFORE 1.                   
663910   ADD 1                   TO    WS-HOJA1.                                    
664210   MOVE WS-HOJA1           TO    WS-INVEN-HOJA.                               
664510   WRITE REG-INVEN         FROM  WS-04-INVEN       BEFORE 1.                  
664810   WRITE REG-INVEN         FROM  WS-ENCA-HORA      BEFORE 2.                  
665110   WRITE REG-INVEN         FROM  WS-SUCURSAL       BEFORE 2.                  
665410   WRITE REG-INVEN         FROM  WS-TIT-INVEN      BEFORE 2.                  
665710   ADD 20                  TO    WS-LINEA1.                                   
666010 53324000-EXIT.                                                               
666310     EXIT.                                                                    
666610                                                                              
666910****************************************************************              
667210*  RUTINA QUE IMPRIME EL DETALLE DEL REPORTE DE INVENTARIO.                   
667510****************************************************************              
667810 53340000-DETALLE-LISTADO.                                                    
668110   IF WS-LINEA1 > 60                                                          
668410      MOVE 0  TO WS-LINEA1                                                    
668710      IF INV-SUCURSAL-S = WS-AHO-SUCANT                                       
669010            PERFORM 53324000-ENC-INVEN                                        
669310            PERFORM 53341000-IMP-DETLIS                                       
669610      ELSE                                                                    
669910            PERFORM 53350000-TOT-SUC                                          
670210            PERFORM 53323000-VALNODO                                          
670510            MOVE INV-SUCURSAL-S    TO WS-AHO-SUCANT                           
670810            MOVE INV-SUCURSAL-S    TO WS-NUMSUC                               
671110            PERFORM 53322000-NOM-SUC                                          
671410            MOVE WS-NOMSUC1        TO WS-NOMSUC                               
671710            PERFORM 53324000-ENC-INVEN                                        
672010            PERFORM 53341000-IMP-DETLIS                                       
672310   ELSE                                                                       
672610      IF INV-SUCURSAL-S = WS-AHO-SUCANT                                       
672910            PERFORM 53341000-IMP-DETLIS                                       
673210      ELSE                                                                    
673510            PERFORM 53350000-TOT-SUC                                          
673810            PERFORM 53323000-VALNODO                                          
674110            MOVE INV-SUCURSAL-S    TO WS-AHO-SUCANT                           
674410            MOVE INV-SUCURSAL-S    TO WS-NUMSUC                               
674710            PERFORM 53322000-NOM-SUC                                          
675010            MOVE WS-NOMSUC1        TO WS-NOMSUC                               
675310            PERFORM 53324000-ENC-INVEN                                        
675610            PERFORM 53341000-IMP-DETLIS.                                      
675910 53340000-EXIT.                                                               
676210     EXIT.                                                                    
676510                                                                              
676810****************************************************************              
677110*              IMPRIMO EL DETALLE DE LAS INVERSIONES.                         
677410****************************************************************              
677710 53341000-IMP-DETLIS.                                                         
678010    MOVE INV-CONTRATO-S                 TO WS-INVE-CTO.                       
678310    MOVE INV-SDOACT-S                   TO WS-INVE-SDOACT.                    
678610    MOVE INV-FECULACT-S                 TO WS-INVEN-PRO-AMD.                  
678910    MOVE WS-INV-PRO-DD                  TO WS-INVE-DIA.                       
679210    MOVE WS-INV-PRO-MM                  TO WS-INVE-MES.                       
679510    MOVE WS-INV-PRO-AA                  TO WS-INVE-ANO.                       
679810    MOVE INV-NOMBRE-S                   TO WS-INVE-NOMBRE.                    
680110    MOVE INV-TIPOPER-S                  TO WS-INVE-PERSONA.                   
680410    IF INV-STATUS-S  = 0                                                      
680710       MOVE "VIGENTE"                   TO WS-INVE-STATUS                     
681010       ADD  INV-SDOACT-S                TO WS-TOT-VIG-SUC                     
681310       ADD  1                           TO WS-NUM-VIG-SUC                     
681610    ELSE                                                                      
681910       MOVE "BLOQUEADO"                 TO WS-INVE-STATUS                     
682210       ADD  INV-SDOACT-S                TO WS-TOT-BLO-SUC                     
682510       ADD  1                           TO WS-NUM-BLO-SUC.                    
682810                                                                              
683110    ADD  INV-SDOACT-S                   TO WS-TOT-TOT-SUC                     
683410    ADD  1                              TO WS-NUM-TOT-SUC                     
683710    WRITE REG-INVEN FROM                WS-DET-INVEN BEFORE 1.                
684010    ADD 1                               TO WS-LINEA1.                         
684310 53341000-EXIT.                                                               
684610     EXIT.                                                                    
684910                                                                              
685210****************************************************************              
685510*       IMPRIMO LOS TOTALES DE INVENTARIO POR SUCURSAL.                       
685810*         Y LOS SUMO A LOS TOTALES POR NODO Y POR CSI.                        
686110****************************************************************              
686410 53350000-TOT-SUC.                                                            
686710    MOVE SPACES                              TO REG-INVEN                     
687010    WRITE REG-INVEN                          BEFORE 3                         
687310    MOVE "  TOTAL VIGENTES POR SUCURSAL   "  TO WS-TIT-AHO                    
687610    MOVE WS-NUM-VIG-SUC                      TO WS-NUM-AHO                    
687910    MOVE WS-TOT-VIG-SUC                      TO WS-IMP-AHO                    
688210    WRITE REG-INVEN FROM  WS-TOT-AHORROS     BEFORE 1                         
688510    MOVE "  TOTAL BLOQUEADAS POR SUCURSAL "  TO WS-TIT-AHO                    
688810    MOVE WS-NUM-BLO-SUC                      TO WS-NUM-AHO                    
689110    MOVE WS-TOT-BLO-SUC                      TO WS-IMP-AHO                    
689410    WRITE REG-INVEN FROM  WS-TOT-AHORROS     BEFORE 1                         
689710    MOVE "  TOTAL GENERAL POR SUCURSAL    "  TO WS-TIT-AHO                    
690010    MOVE WS-NUM-TOT-SUC                      TO WS-NUM-AHO                    
690310    MOVE WS-TOT-TOT-SUC                      TO WS-IMP-AHO                    
690610    WRITE REG-INVEN FROM WS-TOT-AHORROS      BEFORE 1.                        
690910                                                                              
691210    ADD WS-NUM-VIG-SUC TO WS-NUM-VIG-NODO                                     
691510    ADD WS-TOT-VIG-SUC TO WS-TOT-VIG-NODO                                     
691810    ADD WS-NUM-BLO-SUC TO WS-NUM-BLO-NODO                                     
692110    ADD WS-TOT-BLO-SUC TO WS-TOT-BLO-NODO                                     
692410    ADD WS-NUM-TOT-SUC TO WS-NUM-TOT-NODO                                     
692710    ADD WS-TOT-TOT-SUC TO WS-TOT-TOT-NODO                                     
693010                                                                              
693310    MOVE 0             TO WS-TOT-BLO-SUC                                      
693610                          WS-NUM-BLO-SUC                                      
693910                          WS-TOT-VIG-SUC                                      
694210                          WS-NUM-VIG-SUC                                      
694510                          WS-TOT-TOT-SUC                                      
694810                          WS-NUM-TOT-SUC.                                     
695110 53350000-EXIT.                                                               
695410     EXIT.                                                                    
695710                                                                              
696010****************************************************************              
696310*       IMPRIMO LOS TOTALES DE INVENTARIO POR NODO                            
696610*            Y LOS SUMO A LOS TOTALES POR CSI.                                
696910****************************************************************              
697210 53360000-TOT-NODO.                                                           
697510   MOVE SPACES                              TO REG-INVEN                      
697810   WRITE REG-INVEN                          BEFORE 3                          
698110   MOVE "  TOTAL VIGENTES POR NODO       "  TO WS-TIT-AHO                     
698410   MOVE WS-NUM-VIG-NODO                     TO WS-NUM-AHO                     
698710   MOVE WS-TOT-VIG-NODO                     TO WS-IMP-AHO                     
699010   WRITE REG-INVEN FROM WS-TOT-AHORROS      BEFORE 1.                         
699310   MOVE "  TOTLA BLOQUEADAS POR NODO     "  TO WS-TIT-AHO.                    
699610   MOVE WS-NUM-BLO-NODO                     TO WS-NUM-AHO                     
699910   MOVE WS-TOT-BLO-NODO                     TO WS-IMP-AHO                     
700210   WRITE REG-INVEN FROM WS-TOT-AHORROS      BEFORE 1                          
700510   MOVE "  TOTAL GENERAL POR NODO        "  TO WS-TIT-AHO                     
700810   MOVE WS-NUM-TOT-NODO                     TO WS-NUM-AHO                     
701110   MOVE WS-TOT-TOT-NODO                     TO WS-IMP-AHO.                    
701410   WRITE REG-INVEN FROM WS-TOT-AHORROS      BEFORE 1.                         
701710                                                                              
702010   ADD WS-NUM-VIG-NODO                      TO WS-NUM-VIG-CSI                 
702310   ADD WS-TOT-VIG-NODO                      TO WS-TOT-VIG-CSI                 
702610   ADD WS-NUM-BLO-NODO                      TO WS-NUM-BLO-CSI                 
702910   ADD WS-TOT-BLO-NODO                      TO WS-TOT-BLO-CSI                 
703210   ADD WS-NUM-TOT-NODO                      TO WS-NUM-TOT-CSI                 
703510   ADD WS-TOT-TOT-NODO                      TO WS-TOT-TOT-CSI                 
703810                                                                              
704110   MOVE 0                                   TO WS-TOT-BLO-NODO                
704410                                               WS-NUM-BLO-NODO                
704710                                               WS-TOT-VIG-NODO                
705010                                               WS-NUM-VIG-NODO                
705310                                               WS-TOT-TOT-NODO                
705610                                               WS-NUM-TOT-NODO.               
705910 53360000-EXIT.                                                               
706210     EXIT.                                                                    
706510                                                                              
706810****************************************************************              
707110*       IMPRIMO LOS TOTALES DE INVENTARIO POR CSI.                            
707410****************************************************************              
707710 53370000-TOT-CSIAHOR.                                                        
708010   IF WS-SEMANAL = 1                                                          
708310      IF WS-MENSUAL = 1                                                       
708610         NEXT SENTENCE                                                        
708910      ELSE                                                                    
709210         MOVE SPACES                               TO REG-INVEN               
709510         WRITE REG-INVEN                           BEFORE 3                   
709810         MOVE "  TOTAL VIGENTES POR CSI        "   TO WS-TIT-AHO              
710110         MOVE WS-NUM-VIG-CSI                       TO WS-NUM-AHO              
710410         MOVE WS-TOT-VIG-CSI                       TO WS-IMP-AHO              
710710         WRITE REG-INVEN FROM WS-TOT-AHORROS       BEFORE 1                   
711010         MOVE "  TOTAL BLOQUEADAS POS CSI      "   TO WS-TIT-AHO              
711310         MOVE WS-NUM-BLO-CSI                       TO WS-NUM-AHO              
711610         MOVE WS-TOT-BLO-CSI                       TO WS-IMP-AHO              
711910         WRITE REG-INVEN FROM WS-TOT-AHORROS       BEFORE 1                   
712210         MOVE "  TOTAL GENERAL POS CSI         "   TO WS-TIT-AHO              
712510         MOVE WS-NUM-TOT-CSI                       TO WS-NUM-AHO              
712810         MOVE WS-TOT-TOT-CSI                       TO WS-IMP-AHO              
713110         WRITE REG-INVEN FROM WS-TOT-AHORROS       BEFORE 1.                  
713410 53370000-EXIT.                                                               
713710     EXIT.                                                                    
714010                                                                              
714310******************************************************************            
714610* SI HUBO CAMBIO DE PRODUCTOS SE IMPRIME EL TOTAL POR SUC,NODO Y              
714910* CSI DEL PRODUCTO ANTERIOR.                                                  
715210******************************************************************            
715510 53380000-TOTALES-AHO.                                                        
715810   IF WS-LEOAHO = 1                                                           
716110      PERFORM 53350000-TOT-SUC     THRU 53350000-EXIT                         
716410      PERFORM 53360000-TOT-NODO    THRU 53360000-EXIT                         
716710      PERFORM 53370000-TOT-CSIAHOR THRU 53370000-EXIT.                        
717010 53380000-EXIT.                                                               
717310     EXIT.                                                                    
717610                                                                              
717910                                                                              
718210                                                                              
718510                                                                              
718810                                                                              
719110****************************************************************              
719410*     R U T I N A S    P A R A   E L   R E S T O   D E   L A S                
719710*                      I N E R S I O N E S.                                   
720010****************************************************************              
720310                                                                              
720610****************************************************************              
720910* TRABAJO CON EL RESTO DE LOS PRDS. PARA GENERAR 3 ARCHIVOS                   
721210*                         Y UN REPORTE.                                       
721510****************************************************************              
721810 53400000-OPERO-RESTO.                                                        
721825                                                                              
721830      IF (INV-88-STA-CANC)                                                    
721836     AND (INV-SDOACT-S = 0)                                                   
721840         NEXT SENTENCE                                                        
721850      ELSE                                                                    
722110         PERFORM 53410000-INICIO     THRU 53410000-EXIT                       
722410         PERFORM 53430000-CONLCRE    THRU 53430000-EXIT                       
722710         PERFORM 53440000-ARCTB      THRU 53440000-EXIT                       
723010         PERFORM 53450000-ARC151     THRU 53450000-EXIT                       
723310         PERFORM 53460000-LISTADOS   THRU 53460000-EXIT.                      
723610 53400000-EXIT.                                                               
723910     EXIT.                                                                    
723920                                                                              
723925****************************************************************              
724750                                                                              
724800****************************************************************              
724810* RUTINA EJECUTADA LA PRIMERA VEZ QUE SE LEE UN MOV. DEL RESTO DE             
725110* LOS PRODUCTOS.                                                              
725410****************************************************************              
725710 53410000-INICIO.                                                             
726010   IF WS-7VEZ = 0                                                             
726310      MOVE INV-PRODUCTO-S         TO WS-PRDANT  WS-NUM-PRODUCTO               
726610      MOVE INV-INSTRUMENTO-S      TO WS-INSANT  WS-NUM-INSTRUM                
726910      MOVE INV-MONEDA-S           TO WS-MONANT  WS-MONEDA                     
727210      MOVE INV-SUCURSAL-S         TO WS-SUCANT  WS-NUMSUC                     
727510      MOVE INV-NODO-S             TO WS-NODOANT                               
727810      PERFORM 53321000-BUSCO-PRD  THRU 53321000-EXIT                          
728110      MOVE B05-NOMBRE-PROD    TO  WS-DISPO-NOMBRE                             
728410      MOVE B05-NUM-PRODUCTO   TO  WS-DISPO-PRD                                
728710      MOVE B05-NUM-INSTRUM    TO  WS-DISPO-INS                                
729010      MOVE B05-MONEDA         TO  WS-DISPO-MON                                
729310      PERFORM 53322000-NOM-SUC    THRU 53322000-EXIT                          
729610      MOVE WS-NOMSUC1         TO  WS-NOMSUC                                   
729910      PERFORM 53411000-VALNODO    THRU 53411000-EXIT                          
730210      PERFORM 53412000-ENC-DISPO  THRU 53412000-EXIT                          
730510      MOVE 1 TO WS-7VEZ.                                                      
730810 53410000-EXIT.                                                               
731110     EXIT.                                                                    
731410                                                                              
731710****************************************************************              
732010*  RUTINA DONDE SE GENERA LA SEPARACION DE BACKUPS.                           
732310****************************************************************              
732610 53411000-VALNODO.                                                            
732910   IF WS-8VEZ = 0                                                             
733210      MOVE INV-NODO-S        TO WS-DISPO-CI                                   
733510      MOVE INV-SUBNODO-S     TO WS-DISPO-SUBNODO                              
733810      SET FILE-DISPONIBLE(USERBACKUPNAME) TO VALUE TRUE                       
734110      CHANGE ATTRIBUTE TITLE OF FILE-DISPONIBLE TO WS-ETIQ-DISPO              
734410      OPEN OUTPUT FILE-DISPONIBLE                                             
734710      MOVE 1 TO WS-8VEZ.                                                      
735010                                                                              
735310   IF INV-NODO-S NOT = WS-NODOANT                                             
735610      MOVE 0 TO WS-HOJA2 WS-HOJA3                                             
735910      PERFORM 53467000-TOT-NODO                                               
736210      CLOSE FILE-DISPONIBLE      WITH SAVE                                    
736510      MOVE INV-NODO-S       TO WS-NODOANT                                     
736810      MOVE INV-NODO-S       TO WS-DISPO-CI                                    
737110      MOVE INV-SUBNODO-S    TO WS-DISPO-SUBNODO                               
737410      SET FILE-DISPONIBLE(USERBACKUPNAME) TO VALUE TRUE                       
737710      CHANGE ATTRIBUTE TITLE OF FILE-DISPONIBLE TO WS-ETIQ-DISPO              
738010      OPEN OUTPUT FILE-DISPONIBLE.                                            
738310 53411000-EXIT.                                                               
738610     EXIT.                                                                    
738910                                                                              
739210****************************************************************              
739510* IMPRESION DE TITULOS PARA EL LISTADO DE SDO. DISP. DE CTAMAE.               
739810****************************************************************              
740110 53412000-ENC-DISPO.                                                          
740410      MOVE 0               TO    WS-LINEA2.                                   
740710      MOVE  SPACES         TO    REG-DISPONIBLE.                              
741010      WRITE REG-DISPONIBLE AFTER CHANNEL 1.                                   
741310      WRITE REG-DISPONIBLE FROM  WS-ENCABEZADO    BEFORE 1.                   
741610      WRITE REG-DISPONIBLE FROM  WS-ENCABEZADO1   BEFORE 1.                   
741910      WRITE REG-DISPONIBLE FROM  WS-03-DISPO      BEFORE 1.                   
742210      ADD 1                TO    WS-HOJA2.                                    
742510      MOVE WS-HOJA2        TO    WS-DISPO-HOJA.                               
742810      WRITE REG-DISPONIBLE FROM  WS-04-DISPO      BEFORE 1.                   
743110      WRITE REG-DISPONIBLE FROM  WS-ENCA-HORA     BEFORE 2.                   
743410      WRITE REG-DISPONIBLE FROM  WS-SUCURSAL      BEFORE 2.                   
743710      WRITE REG-DISPONIBLE FROM  WS-TIT-DISP      BEFORE 2.                   
744010      ADD 10               TO    WS-LINEA2.                                   
744310 53412000-EXIT.                                                               
744610     EXIT.                                                                    
744910                                                                              
745210****************************************************************              
745510* CONSULTO AL S408 PARA OBTENER EL SALDO DISPONIBLE TOMANDO EN                
745810* CUENTA LA LINEA DE CREDITO.                                                 
746110******************************************************************            
746410 53430000-CONLCRE.                                                            
746710    IF INV-LINEACRE-S = 0                                                     
747010       PERFORM 53431000-CALCULO-SDO THRU 53431000-EXIT                        
747310    ELSE                                                                      
747610       PERFORM 53432000-CONSULTO    THRU 53432000-EXIT.                       
747910 53430000-EXIT.                                                               
748210    EXIT.                                                                     
748510                                                                              
748810******************************************************************            
749110* EN CASO DE QUE EL CTO. NO TENGA LINEA DE CREDITO, SE EFECTUA EL             
749410* CALCULO EN BASE A LOS DATOS DEL CONTRATO SOLAMENTE.                         
749710******************************************************************            
750010 53431000-CALCULO-SDO.                                                        
750310   COMPUTE WS-SUM-SDOACT = INV-SDOACT-S + INV-SDOPEN-S.                       
750340   IF INV-SDOACT-S > (INV-AUTPEN-S + INV-SDOBLO-S +                           
750350                      INV-PCOBP-PEND-S + INV-SDODAANT-S)                      
750610       COMPUTE WS-SUM-SDODIS = INV-SDOACT-S -                                 
750612                     (INV-AUTPEN-S + INV-SDOBLO-S +                           
750614                      INV-PCOBP-PEND-S + INV-SDODAANT-S)                      
750630   ELSE                                                                       
750632      MOVE ZERO TO WS-SUM-SDODIS.                                             
750710                                                                              
750910 53431000-EXIT.                                                               
751210   EXIT.                                                                      
751510                                                                              
751810******************************************************************            
752110* SI EL CONTRATO POSEE LINEA DE CREDITO.                                      
752410* CHECO EL LIM. DE LA LINEA DE CREDITO DE LA INVER. EN EL S408.               
752710* Y EL SALDO DISPONIBLE DE LA LINEA.                                          
753010****************************************************************              
753310 53432000-CONSULTO.                                                           
753610     MOVE ALL @00@            TO WS-S408-FTO.                                 
753910     MOVE 0                   TO WS-S408-STATUS.                              
754210     MOVE 11                  TO WS-S408-FUNCION.                             
754510     MOVE 180                 TO WS-S408-PASO.                                
754810     MOVE WS-FEC-BLOQUEO      TO WS-S408-FECPRO.                              
755110     MOVE INV-PRODUCTO-S      TO WS03-NUM-PRODUCTO                            
755410     MOVE INV-INSTRUMENTO-S   TO WS03-NUM-INSTRUM                             
755710     MOVE INV-MONEDA-S        TO WS03-MONEDA                                  
756010     MOVE INV-CONTRATO-S      TO WS03-NUM-CONTRATO.                           
756310     PERFORM 40000200-CALL-S408 THRU 40000200-EXIT.                           
756610     IF WS-S408-STATUS = 0                                                    
756910        PERFORM 53432100-CAL-SDOC408 THRU 53432100-EXIT                       
757210        MOVE 1              TO  WS-FIN                                        
757510     ELSE                                                                     
757810        PERFORM 53432200-CAL-SDOS408 THRU 53432200-EXIT.                      
758110 53432000-EXIT.                                                               
758410    EXIT.                                                                     
758710                                                                              
759010******************************************************************            
759310* EN CASO DE QUE EL LLAMADO AL S408 HAYA SIDO EXITOSO.                        
759610******************************************************************            
759910 53432100-CAL-SDOC408.                                                        
760210    COMPUTE WS-SUM-SDOACT =   INV-SDOACT-S - WS-S408-IMPORIG                  
760510    IF WS-SUM-SDOACT <  0                                                     
760810       MOVE 0                 TO WS-SUM-SDODIS                                
761110    ELSE                                                                      
761115    IF (INV-SDOACT-S + WS-S408-IMPXDISP) >                                    
761120       (INV-AUTPEN-S + INV-SDOBLO-S +                                         
761125        INV-PCOBP-PEND-S + INV-SDODAANT-S)                                    
761410      COMPUTE WS-SUM-SDODIS =(INV-SDOACT-S + WS-S408-IMPXDISP) -              
761710       (INV-AUTPEN-S + INV-SDOBLO-S +                                         
761810        INV-PCOBP-PEND-S + INV-SDODAANT-S)                                    
761815    ELSE                                                                      
761820       MOVE ZERO TO WS-SUM-SDODIS.                                            
761910                                                                              
762010 53432100-EXIT.                                                               
762310    EXIT.                                                                     
762610                                                                              
762910******************************************************************            
763210* EN CASO DE QUE EL LLAMADO AL S408 HAYA FALLADO.                             
763510******************************************************************            
763810 53432200-CAL-SDOS408.                                                        
764110     COMPUTE WS-SUM-SDOACT = INV-SDOACT-S + INV-SDOPEN-S.                     
764120     IF INV-SDOACT-S > (INV-AUTPEN-S + INV-SDOBLO-S +                         
764130                        INV-PCOBP-PEND-S + INV-SDODAANT-S)                    
764410        COMPUTE WS-SUM-SDODIS = INV-SDOACT-S -                                
764420                (INV-AUTPEN-S + INV-SDOBLO-S +                                
764510                 INV-PCOBP-PEND-S + INV-SDODAANT-S)                           
764520     ELSE                                                                     
764530        MOVE ZERO TO WS-SUM-SDODIS.                                           
764610                                                                              
764710     MOVE 0                  TO WS-S408-IMPXDISP                              
765010     MOVE 0                  TO WS-S408-LIMITE.                               
765310 53432200-EXIT.                                                               
765610    EXIT.                                                                     
765910                                                                              
766210******************************************************************            
766510* GENERO EL ARCHIVO QUE SE ENVIA A TANDEM SALDOSTB.                           
766810******************************************************************            
767110 53440000-ARCTB.                                                              
767410        IF INV-BANTAR-S = 1                                                   
767710           PERFORM 53441000-GRABO-ARCHIVO.                                    
768010 53440000-EXIT.                                                               
768310   EXIT.                                                                      
768610                                                                              
768910******************************************************************            
769210* TODOS LOS CONTRATOS CUYO MEDIO DE ACCESO ES TARJETAS, ES ENVIADO            
769510* AL ARCHIVO PARA TANDEM.                                                     
769810******************************************************************            
770110 53441000-GRABO-ARCHIVO.                                                      
770410    MOVE INV-PRODUCTO-S     TO WS-TBDE-NUMPRD                                 
770710    MOVE INV-INSTRUMENTO-S  TO WS-TBDE-NUMINS                                 
771010    MOVE INV-MONEDA-S       TO WS-TBDE-NUMMON                                 
771310    MOVE INV-CONTRATO-S     TO WS-TBDE-NUMCTO                                 
771610    MOVE "+"                TO WS-TBDE-SIGSDO.                                
771910                                                                              
772210    IF INV-MONEDA-S = 1                                                       
772510       MOVE INV-AUTPEN-S    TO WS-TBDE-AUTPENMN                               
772810       MOVE INV-SDOACT-S    TO WS-TBDE-SDOMN                                  
773110       MOVE 0               TO WS-TBDE-AUTPENDL                               
773410       MOVE 0               TO WS-TBDE-SDODL                                  
773710    ELSE                                                                      
774010       MOVE INV-AUTPEN-S    TO WS-TBDE-AUTPENDL                               
774310       MOVE INV-SDOACT-S    TO WS-TBDE-SDODL                                  
774610       COMPUTE WS-IMP-CALAUT ROUNDED = INV-AUTPEN-S * WS-TIPCAM               
774910       COMPUTE WS-IMP-CALSDO ROUNDED = INV-SDOACT-S * WS-TIPCAM               
775210       MOVE WS-IMP-CALAUT   TO WS-TBDE-AUTPENMN                               
775510       MOVE WS-IMP-CALSDO   TO WS-TBDE-SDOMN.                                 
775810                                                                              
776110    MOVE INV-STATUS-S       TO WS-TBDE-STATUS.                                
776410    MOVE INV-SUCURSAL-S     TO WS-TBDE-SUCPRO                                 
776710                                                                              
777010    IF INV-LINEACRE-S = 0   OR WS-FIN = 0                                     
777310        MOVE 0              TO WS-TBDE-LIMCRE                                 
777610    ELSE                                                                      
777910       COMPUTE WS-S408-LIMITE =      WS-S408-LIMITE/1000                      
778210       MOVE WS-S408-LIMITE  TO WS-TBDE-LIMCRE.                                
778510                                                                              
778810    IF INV-PRODUCTO-S = 66  OR ((INV-PRODUCTO-S = 500 AND                     
778820       INV-INSTRUMENTO-S = 1))                                                
779110       WRITE REG-SALDOSTB    FROM WS-REGTB-DETALLE                            
779410       ADD  1                TO WS-REG-TANDEMCM                               
779710       IF INV-MONEDA-S = 1                                                    
780010          ADD  INV-SDOACT-S  TO WS-IMP-TANDEMCM                               
780310       ELSE                                                                   
780610          ADD  INV-SDOACT-S  TO WS-IMP-TANDEMCMDL                             
780910    ELSE                                                                      
781210       WRITE REG-SALDOSTBT   FROM WS-REGTB-DETALLE                            
781510       ADD  1                TO WS-REG-TANDEMCH                               
781810       IF INV-MONEDA-S = 1                                                    
782110          ADD  INV-SDOACT-S  TO WS-IMP-TANDEMCH                               
782410       ELSE                                                                   
782710          ADD  INV-SDOACT-S  TO WS-IMP-TANDEMCHDL.                            
783010 53441000-EXIT.                                                               
783310     EXIT.                                                                    
783610                                                                              
783910****************************************************************              
784210* GENERO EL TRAILER DEL ARCHIVO ENVIADO A TANDEM.                             
784510*****************************************************************             
784810 53442000-TRAILERTB.                                                          
785110     MOVE WS-REG-TANDEMCM        TO WS-TBTR-NUMREG                            
785410     MOVE WS-IMP-TANDEMCM        TO WS-TBTR-TOTSDOMN                          
785710     MOVE WS-IMP-TANDEMCMDL      TO WS-TBTR-TOTSDODL                          
786010     WRITE REG-SALDOSTB          FROM WS-REGTB-TRAILER                        
786310     MOVE WS-REG-TANDEMCH        TO WS-TBTR-NUMREG                            
786610     MOVE WS-IMP-TANDEMCH        TO WS-TBTR-TOTSDOMN                          
786910     MOVE WS-IMP-TANDEMCHDL      TO WS-TBTR-TOTSDODL                          
787210     WRITE REG-SALDOSTBT         FROM WS-REGTB-TRAILER.                       
787510 53442000-EXIT.                                                               
787810     EXIT.                                                                    
787815                                                                              
787820****************************************************************              
787995                                                                              
788000****************************************************************              
788045                                                                              
788050***************************************************************               
788165                                                                              
788170****************************************************************              
788280                                                                              
788285******************************************************************            
788290* ESTA RUTINA NO EJECUTA NUNGUN PROCESO DENTRO DEL PROGRAMA.                  
788295* SOLO ES UTILIZADA COMO SALIDA PARA EL MOMENTO EN QUE HA SIDO                
788300* PERMINADA LA LECTURA DE LA TABLA, E IDENTIFICAR SI HUBO O NO UN             
788305* ERROR EN LA BUSQUEDA DE UN ELEMENTO DE DICHA TABLA.                         
788310******************************************************************            
788315 53446000-PASO.                                                               
788320                                                                              
788325******************************************************************            
788330* DESPLIEGA EL PRODUCTO, INSTRUMENTO Y MONEDA DESEADO, YA SEA COMO            
788335* UN MSG. INFORMATIVO O COMO UN MSG. DE ERROR.                                
788340******************************************************************            
788345 53447000-DIS-PIM.                                                            
788360       STRING "PROD-INST-MONEDA ", WS-MSG-PRD                                 
788365                              "-", WS-MSG-INST                                
788370                              "-", WS-MSG-MDA                                 
788375              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
788380       PERFORM 70000050-MENSAJE.                                              
788385                                                                              
788390                                                                              
788395                                                                              
788400                                                                              
788405                                                                              
788410                                                                              
788415                                                                              
788420                                                                              
788425 53447000-EXIT.                                                               
788430     EXIT.                                                                    
788435                                                                              
788600****************************************************************              
788710* GENERO EL ARCHIVO DE SALDOS QUE ES ENVIADO AL S151.                         
789010****************************************************************              
789310 53450000-ARC151.                                                             
789610    IF WS-12VEZ = 0                                                           
789910       MOVE INV-SUCURSAL-S    TO WS-151-SUCANT                                
790210       MOVE 1                 TO WS-12VEZ.                                    
790510                                                                              
790810    IF INV-SUCURSAL-S = WS-151-SUCANT                                         
791110       PERFORM 53450010-ACUM-MON   THRU 53450010-EXIT                         
791410    ELSE                                                                      
791710      PERFORM 53451120-TOT-SUC    THRU 53451120-EXIT                          
792010       MOVE INV-SUCURSAL-S    TO WS-151-SUCANT                                
792310       PERFORM 53450010-ACUM-MON   THRU 53450010-EXIT.                        
792610                                                                              
792910    IF INV-SDOACT-S = INV-SDOANT-S                                            
793210       NEXT SENTENCE                                                          
793510    ELSE                                                                      
793810      COMPUTE  WS-SALDO-S151 = INV-SDOACT-S - INV-SDOANT-S                    
794110      IF (WS-SALDO-S151 < 1000000 AND INV-MONEDA-S = 1) OR                    
794410         (WS-SALDO-S151 < 10000   AND INV-MONEDA-S = 5)                       
794710         NEXT SENTENCE                                                        
795010      ELSE                                                                    
795310         PERFORM 53451110-DETALLE THRU 53451110-EXIT.                         
795610 53450000-EXIT.                                                               
795910    EXIT.                                                                     
796210                                                                              
796510*****************************************************************             
796810* ACUMULO LOS TOTALES POR MONEDA PARA LOS CORTES POR SUCURSAL.                
797110*****************************************************************             
797410 53450010-ACUM-MON.                                                           
797710   IF INV-PRODUCTO-S = 66 OR ((INV-PRODUCTO-S = 500 AND                       
797720      INV-INSTRUMENTO-S = 1))                                                 
798010      IF INV-MONEDA-S = 1                                                     
798310         ADD INV-SDOACT-S    TO WS-SUC-SDOACT-S151CM                          
798610         ADD INV-SDOANT-S    TO WS-SUC-SDOANT-S151CM                          
798910      ELSE                                                                    
799210         ADD INV-SDOACT-S    TO WS-SUC-SDOACT-S151CMD                         
799510         ADD INV-SDOANT-S    TO WS-SUC-SDOANT-S151CMD                         
799810   ELSE                                                                       
800110      IF INV-MONEDA-S = 1                                                     
800410         ADD INV-SDOACT-S    TO WS-SUC-SDOACT-S151MN                          
800710         ADD INV-SDOANT-S    TO WS-SUC-SDOANT-S151MN                          
801010      ELSE                                                                    
801310         ADD INV-SDOACT-S    TO WS-SUC-SDOACT-S151DL                          
801610         ADD INV-SDOANT-S    TO WS-SUC-SDOANT-S151DL.                         
801910 53450010-EXIT.                                                               
802210    EXIT.                                                                     
802510                                                                              
802810*****************************************************************             
803110* IMPRIMO EL DETALLE DEL ARCHIVO DEL S151 QUE CONTIENE LOS MOVS.              
803410* DE CTA. MAESTRA.                                                            
803710******************************************************************            
804010 53451110-DETALLE.                                                            
804310   MOVE LOW-VALUES              TO REG-S151SALDOS                             
804610   MOVE INV-PRODUCTO-S          TO WS-D151-SIST                               
804910   MOVE INV-SUCURSAL-S          TO WS-D151-SUC                                
805210   MOVE INV-MONEDA-S            TO WS-D151-MON                                
805510   MOVE INV-CONTRATO-S          TO WS-CTODIG                                  
805810   MOVE WS-CONTRATO             TO WS-D151-CTAS                               
806110   MOVE WS-DIGITO               TO WS-D151-DIG                                
806410   MOVE INV-INSTRUMENTO-S       TO WS-D151-INST                               
806710   MOVE INV-NOMBRE-S            TO WS-D151-NOMB                               
807010   MOVE INV-SDOACT-S            TO WS-D151-SACT                               
807310   MOVE INV-SDOANT-S            TO WS-D151-SANT                               
807610   ADD  1                       TO WS-CONT-S151                               
807910   WRITE REG-S151SALDOS  FROM WS-S151-DETALLE INVALID KEY                     
808810        MOVE "ERROR AL GRA DET 151"  TO WS-0101-TEXT-MSG                      
809110        PERFORM 70000050-MENSAJE                                              
809410        CALL SYSTEM DMTERMINATE.                                              
809710 53451110-EXIT.                                                               
810010    EXIT.                                                                     
810310                                                                              
810610****************************************************************              
810910* GRABO EN EL ARCHIVO PARA EL S151 LOS TOTALES POR SUCURSAL.                  
811210* DE MOVS. DE CUENTA MAESTRA Y DE CHEQUES MONEDA NACIONAL Y                   
811510* DOLLARES.                                                                   
811810****************************************************************              
812110 53451120-TOT-SUC.                                                            
812410      MOVE LOW-VALUES             TO REG-S151SALDOS                           
812710      MOVE 66                     TO WS-SUC151-SIST                           
813010      MOVE WS-151-SUCANT          TO WS-SUC151-SUC                            
813310      MOVE 1                      TO WS-SUC151-MON                            
813610      MOVE WS-SUC-SDOACT-S151CM   TO WS-SUC151-SACT                           
813910      MOVE WS-SUC-SDOANT-S151CM   TO WS-SUC151-SANT                           
814210      ADD  1                      TO WS-CONT-S151                             
814510      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE1 INVALID KEY                 
815410           MOVE "ERR.AL GRA TOT/SUC CM151" TO WS-0101-TEXT-MSG                
815710           PERFORM 70000050-MENSAJE                                           
816010           CALL SYSTEM DMTERMINATE.                                           
816310                                                                              
816610      MOVE LOW-VALUES             TO REG-S151SALDOS                           
816910      MOVE 66                     TO WS-SUC151-SIST                           
817210      MOVE WS-151-SUCANT          TO WS-SUC151-SUC                            
817510      MOVE 5                      TO WS-SUC151-MON                            
817810      MOVE WS-SUC-SDOACT-S151CMD  TO WS-SUC151-SACT                           
818110      MOVE WS-SUC-SDOANT-S151CMD  TO WS-SUC151-SANT                           
818410      ADD  1                      TO WS-CONT-S151                             
818710      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE1 INVALID KEY                 
819610           MOVE "ERR.AL GRA TOT/SUC CMDL " TO WS-0101-TEXT-MSG                
819910           PERFORM 70000050-MENSAJE                                           
820210           CALL SYSTEM DMTERMINATE.                                           
820510                                                                              
820810      MOVE LOW-VALUES             TO REG-S151SALDOS                           
821110      MOVE 1                      TO WS-SUC151-SIST                           
821410      MOVE WS-151-SUCANT          TO WS-SUC151-SUC                            
821710      MOVE 1                      TO WS-SUC151-MON                            
822010      MOVE WS-SUC-SDOACT-S151MN   TO WS-SUC151-SACT                           
822310      MOVE WS-SUC-SDOANT-S151MN   TO WS-SUC151-SANT                           
822610      ADD  1                      TO WS-CONT-S151                             
822910      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE1 INVALID KEY                 
823810           MOVE "ERR.AL GRA TOT/SUC CHMN " TO WS-0101-TEXT-MSG                
824110           PERFORM 70000050-MENSAJE                                           
824410           CALL SYSTEM DMTERMINATE.                                           
824710                                                                              
825010      MOVE LOW-VALUES             TO REG-S151SALDOS                           
825310      MOVE 1                      TO WS-SUC151-SIST                           
825610      MOVE WS-151-SUCANT          TO WS-SUC151-SUC                            
825910      MOVE 5                      TO WS-SUC151-MON                            
826210      MOVE WS-SUC-SDOACT-S151DL   TO WS-SUC151-SACT                           
826510      MOVE WS-SUC-SDOANT-S151DL   TO WS-SUC151-SANT                           
826810      ADD  1                      TO WS-CONT-S151                             
827110      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE1 INVALID KEY                 
828010           MOVE "ERR.AL GRA TOT/SUC CHDL " TO WS-0101-TEXT-MSG                
828310           PERFORM 70000050-MENSAJE                                           
828610           CALL SYSTEM DMTERMINATE.                                           
828910                                                                              
829210      ADD  WS-SUC-SDOACT-S151CM    TO  WS-TOT-SDOACT-S151CM                   
829510      ADD  WS-SUC-SDOACT-S151CMD   TO  WS-TOT-SDOACT-S151CMD                  
829810      ADD  WS-SUC-SDOACT-S151MN    TO  WS-TOT-SDOACT-S151MN                   
830110      ADD  WS-SUC-SDOACT-S151DL    TO  WS-TOT-SDOACT-S151DL                   
830410      ADD  WS-SUC-SDOANT-S151CM    TO  WS-TOT-SDOANT-S151CM                   
830710      ADD  WS-SUC-SDOANT-S151CMD   TO  WS-TOT-SDOANT-S151CMD                  
831010      ADD  WS-SUC-SDOANT-S151MN    TO  WS-TOT-SDOANT-S151MN                   
831310      ADD  WS-SUC-SDOANT-S151DL    TO  WS-TOT-SDOANT-S151DL                   
831610                                                                              
831910      MOVE 0  TO  WS-SUC-SDOACT-S151CM  WS-SUC-SDOANT-S151CM                  
832210                  WS-SUC-SDOACT-S151CMD WS-SUC-SDOANT-S151CMD                 
832510                  WS-SUC-SDOACT-S151MN  WS-SUC-SDOANT-S151MN                  
832810                  WS-SUC-SDOACT-S151DL  WS-SUC-SDOANT-S151DL.                 
833110 53451120-EXIT.                                                               
833410     EXIT.                                                                    
833710                                                                              
834010****************************************************************              
834310* OBTENGO LOS TOTALES DE ARCHIVO QUE SE ENVIA AL S151 POR PRD/MON.            
834610****************************************************************              
834910 53451130-TOT-GLO.                                                            
835210      MOVE LOW-VALUES              TO REG-S151SALDOS                          
835510      MOVE 66                      TO WS-GLO151-SIST                          
835810      MOVE 1                       TO WS-GLO151-MON                           
836110      MOVE WS-TOT-SDOACT-S151CM    TO WS-GLO151-SACT                          
836410      MOVE WS-TOT-SDOANT-S151CM    TO WS-GLO151-SANT                          
836710      ADD  1                       TO WS-CONT-S151                            
837010      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE2 INVALID KEY                 
837910         MOVE "ERR.AL GRA DET/GLO CM151" TO WS-0101-TEXT-MSG                  
838210         PERFORM 70000050-MENSAJE                                             
838510         CALL SYSTEM DMTERMINATE.                                             
838810                                                                              
839110      MOVE LOW-VALUES              TO REG-S151SALDOS                          
839410      MOVE 66                      TO WS-GLO151-SIST                          
839710      MOVE 5                       TO WS-GLO151-MON                           
840010      MOVE WS-TOT-SDOACT-S151CMD   TO WS-GLO151-SACT                          
840310      MOVE WS-TOT-SDOANT-S151CMD   TO WS-GLO151-SANT                          
840610      ADD  1                       TO WS-CONT-S151                            
840910      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE2 INVALID KEY                 
841810         MOVE "ERR.AL GRA DET/GLO CMDL " TO WS-0101-TEXT-MSG                  
842110         PERFORM 70000050-MENSAJE                                             
842410         CALL SYSTEM DMTERMINATE.                                             
842710                                                                              
843010                                                                              
843310      MOVE LOW-VALUES              TO REG-S151SALDOS                          
843610      MOVE 1                       TO WS-GLO151-SIST                          
843910      MOVE 1                       TO WS-GLO151-MON                           
844210      MOVE WS-TOT-SDOACT-S151MN    TO WS-GLO151-SACT                          
844510      MOVE WS-TOT-SDOANT-S151MN    TO WS-GLO151-SANT                          
844810      ADD  1                       TO WS-CONT-S151                            
845110      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE2 INVALID KEY                 
846010         MOVE "ERR.AL GRA DET/GLO MN151" TO WS-0101-TEXT-MSG                  
846310         PERFORM 70000050-MENSAJE                                             
846610         CALL SYSTEM DMTERMINATE.                                             
846910                                                                              
847210      MOVE LOW-VALUES              TO REG-S151SALDOS                          
847510      MOVE 1                       TO WS-GLO151-SIST                          
847810      MOVE 5                       TO WS-GLO151-MON                           
848110      MOVE WS-TOT-SDOACT-S151DL    TO WS-GLO151-SACT                          
848410      MOVE WS-TOT-SDOANT-S151DL    TO WS-GLO151-SANT                          
848710      ADD  1                       TO WS-CONT-S151                            
849010      WRITE REG-S151SALDOS  FROM WS-S151-DETALLE2 INVALID KEY                 
849910         MOVE "ERR.AL GRA DET/GLO DL151" TO WS-0101-TEXT-MSG                  
850210         PERFORM 70000050-MENSAJE                                             
850510         CALL SYSTEM DMTERMINATE.                                             
850810 53451130-EXIT.                                                               
851110     EXIT.                                                                    
851410                                                                              
851710******************************************************************            
852010* CUANDO EL PROCESO HA TERMINADO SE IMPRIME EL ULTIMO TOTAL DEL               
852310* ARCHIVO DEL S151 DE MOVS. DE CTAMAE. P/SUC, GLO Y EL TRAILER.               
852610******************************************************************            
852910 53451140-TOT151-CTAMAE.                                                      
853210       PERFORM 53451120-TOT-SUC     THRU  53451120-EXIT.                      
853510       PERFORM 53451130-TOT-GLO     THRU  53451130-EXIT.                      
853810       PERFORM 53451150-TRAILER     THRU  53451150-EXIT.                      
854110 53451140-EXIT.                                                               
854410    EXIT.                                                                     
854710                                                                              
855010******************************************************************            
855310* GRABO EL TRAILER DEL ARCHIVO DEL S151 DE MOVS. DE CTAM Y CHEQUES            
855610******************************************************************            
855910 53451150-TRAILER.                                                            
856210       MOVE LOW-VALUES                TO REG-S151SALDOS                       
856510       ADD  1                         TO WS-CONT-S151                         
856810       MOVE WS-CONT-S151              TO WS-T151-REG.                         
857110       WRITE REG-S151SALDOS  FROM WS-S151-TRAILER INVALID KEY                 
858010       MOVE "ERROR AL GRA. TRAILER S151 "  TO WS-0101-TEXT-MSG                
858310       PERFORM 70000050-MENSAJE                                               
858610       CALL SYSTEM DMTERMINATE.                                               
858910 53451150-EXIT.                                                               
859210    EXIT.                                                                     
859510                                                                              
859810******************************************************************            
860110*  IMPRIMO EL DETALLE PARA EL REPORTE DE SDOS DISPONIBLES.                    
860410****************************************************************              
860710 53460000-LISTADOS.                                                           
861010  IF INV-SUCURSAL-S = WS-SUCANT                                               
861310   IF INV-PRODUCTO-S = WS-PRDANT                                              
861610     IF INV-INSTRUMENTO-S = WS-INSANT                                         
861910        IF INV-MONEDA-S     = WS-MONANT                                       
862210           PERFORM 53461000-DETALLE THRU 53461000-EXIT                        
862510        ELSE                                                                  
862810           PERFORM 53462000-DISPUNI      THRU 53462000-EXIT                   
863110           PERFORM 53463005-TOT-PRD      THRU 53463005-EXIT                   
863410           PERFORM 53463010-TOT-MON      THRU 53463010-EXIT                   
863710           PERFORM 53465000-PRODUCTO     THRU 53465000-EXIT                   
864010           PERFORM 53465500-ENCDET       THRU 53465500-EXIT                   
864310     ELSE                                                                     
864610        IF INV-MONEDA-S     = WS-MONANT                                       
864910           PERFORM 53462000-DISPUNI      THRU 53462000-EXIT                   
865210           PERFORM 53463005-TOT-PRD      THRU 53463005-EXIT                   
865510           PERFORM 53465000-PRODUCTO     THRU 53465000-EXIT                   
865810           PERFORM 53465500-ENCDET       THRU 53465500-EXIT                   
866110        ELSE                                                                  
866410           PERFORM 53462000-DISPUNI      THRU 53462000-EXIT                   
866710           PERFORM 53463005-TOT-PRD      THRU 53463005-EXIT                   
867010           PERFORM 53463010-TOT-MON      THRU 53463010-EXIT                   
867310           PERFORM 53465000-PRODUCTO     THRU 53465000-EXIT                   
867610           PERFORM 53465500-ENCDET       THRU 53465500-EXIT                   
867910   ELSE                                                                       
868210        PERFORM 53462000-DISPUNI         THRU 53462000-EXIT                   
868510        PERFORM 53463005-TOT-PRD         THRU 53463005-EXIT                   
868810        PERFORM 53463010-TOT-MON         THRU 53463010-EXIT                   
869110        PERFORM 53465000-PRODUCTO        THRU 53465000-EXIT                   
869410        PERFORM 53465500-ENCDET          THRU 53465500-EXIT                   
869710  ELSE                                                                        
870010        PERFORM 53462000-DISPUNI      THRU 53462000-EXIT                      
870310        PERFORM 53463005-TOT-PRD      THRU 53463005-EXIT                      
870610        PERFORM 53463010-TOT-MON      THRU 53463010-EXIT                      
870910        PERFORM 53463000-TOT-SUC      THRU 53463000-EXIT                      
871210        PERFORM 53464000-NODO         THRU 53464000-EXIT                      
871510        PERFORM 53465000-PRODUCTO     THRU 53465000-EXIT                      
871810        PERFORM 53465500-ENCDET       THRU 53465500-EXIT.                     
872110 53460000-EXIT.                                                               
872410     EXIT.                                                                    
872710                                                                              
873010******************************************************************            
873310* IMPRIMO EL DETALLE DE LISTADO DE SDOS DISPONIBLE Y EL LISTADO               
873610* DE COMISIONES PENDIENTES.                                                   
873910******************************************************************            
874210 53461000-DETALLE.                                                            
874510   IF WS-LINEA2 > 55                                                          
874810      MOVE 0 TO WS-LINEA2                                                     
875110      PERFORM 53412000-ENC-DISPO  THRU 53412000-EXIT                          
875410      PERFORM 53461100-DET-DISPO  THRU 53461100-EXIT                          
875710   ELSE                                                                       
876010      PERFORM 53461100-DET-DISPO  THRU 53461100-EXIT.                         
876310 53461000-EXIT.                                                               
876610   EXIT.                                                                      
876910                                                                              
877210****************************************************************              
877510* IMPRIMO EL DE DETALLE DEL SDO DISPONIBLE.                                   
877810****************************************************************              
878110 53461100-DET-DISPO.                                                          
878410   IF WS-CONTADOR = 0                                                         
878710       ADD 1                   TO WS-DIS-NUMERO-PRD                           
879010       MOVE INV-CONTRATO-S     TO WS-CTODIG                                   
879310       MOVE WS-CONTRATO        TO WS-SDODIS-CTO                               
879610       MOVE WS-DIGITO          TO WS-SDODIS-DIG                               
879910       MOVE WS-SUM-SDOACT      TO WS-SDODIS-SALDO                             
880210       MOVE WS-SUM-SDODIS      TO WS-SDODIS-DISPO                             
880510       ADD 1                   TO WS-CONTADOR                                 
880810   ELSE                                                                       
881110   IF WS-CONTADOR = 1                                                         
881410       ADD 1                   TO WS-DIS-NUMERO-PRD                           
881710       MOVE INV-CONTRATO-S     TO WS-CTODIG                                   
882010       MOVE WS-CONTRATO        TO WS-SDODIS-CTO1                              
882310       MOVE WS-DIGITO          TO WS-SDODIS-DIG1                              
882610       MOVE WS-SUM-SDOACT      TO WS-SDODIS-SALDO1                            
882910       MOVE WS-SUM-SDODIS      TO WS-SDODIS-DISPO1                            
883210       ADD 1                   TO WS-CONTADOR.                                
883510                                                                              
883810   IF WS-CONTADOR = 2                                                         
884110      WRITE REG-DISPONIBLE  FROM WS-DET-SDODISP BEFORE 1                      
884410      ADD 1                 TO WS-LINEA2                                      
884710      MOVE 0 TO WS-CONTADOR                                                   
885010      MOVE SPACES TO REG-DISPONIBLE                                           
885310      MOVE SPACES TO WS-DET-SDODISP.                                          
885610                                                                              
885910   ADD WS-SUM-SDOACT         TO WS-DIS-SDOACT-PRD                             
886210   ADD WS-SUM-SDODIS         TO WS-DIS-SDODIS-PRD.                            
886510 53461100-EXIT.                                                               
886810     EXIT.                                                                    
887110                                                                              
887410*****************************************************************             
887710* IMPRIMO EL DETALLE DEL LISTADO DISPONIBLE CUANDO UNA SUCURSAL               
888010* SOLO TIENE UN MOVIMIENTO.                                                   
888310*****************************************************************             
888610 53462000-DISPUNI.                                                            
888910   IF WS-CONTADOR = 1                                                         
889210      MOVE 0               TO WS-SDODIS-CTO1                                  
889510      MOVE 0               TO WS-SDODIS-DIG1                                  
889810      MOVE 0               TO WS-SDODIS-SALDO1                                
890110      MOVE 0               TO WS-SDODIS-DISPO1                                
890410      WRITE REG-DISPONIBLE  FROM WS-DET-SDODISP BEFORE 1                      
890710      MOVE 0 TO WS-CONTADOR                                                   
891010      MOVE SPACES TO REG-DISPONIBLE                                           
891310      MOVE SPACES TO WS-DET-SDODISP.                                          
891610 53462000-EXIT.                                                               
891910    EXIT.                                                                     
892210                                                                              
892510******************************************************************            
892810* REALIZO EL CORTE POR SUCURSAL DE LOS LISTADOS CUANDO HAY UN                 
893110* CAMBIO DE SUC, MON, INS, O MONEDA.                                          
893410******************************************************************            
893710 53463000-TOT-SUC.                                                            
894010   PERFORM 53463100-TOTSUC-DISPO   THRU 53463100-EXIT.                        
894310 53463000-EXIT.                                                               
894610    EXIT.                                                                     
894910                                                                              
895210******************************************************************            
895510* REALIZO EL CORTE CUANDO HAY CAMBIO DE INSTRUMENTO.                          
895810* CAMBIO DE SUC, MON, INS, O MONEDA.                                          
896110******************************************************************            
896410 53463005-TOT-PRD.                                                            
896710   PERFORM 53463105-TOTPRD-DISPO   THRU 53463105-EXIT.                        
897010 53463005-EXIT.                                                               
897310    EXIT.                                                                     
897610                                                                              
897910******************************************************************            
898210* REALIZO EL CORTE POR MONEDA   DE LOS LISTADOS CUANDO HAY UN                 
898510* CAMBIO DE SUC, MON, INS, O MONEDA.                                          
898810******************************************************************            
899110 53463010-TOT-MON.                                                            
899410   PERFORM 53463110-TOTMON-DISPO   THRU 53463110-EXIT.                        
899710 53463010-EXIT.                                                               
900010    EXIT.                                                                     
900310                                                                              
900610******************************************************************            
900910*      OBTENGO LOS TOTALES DE SDO. DISPONIBLE POR SUCURSAL.                   
901210****************************************************************              
901510 53463100-TOTSUC-DISPO.                                                       
901810    MOVE SPACES               TO REG-DISPONIBLE                               
902110    WRITE REG-DISPONIBLE                             BEFORE 3                 
902410    MOVE WS-DIS-SDOACT-SUC    TO  WS-SDODIS-SDOSUC                            
902710    MOVE WS-DIS-SDODIS-SUC    TO  WS-SDODIS-DISSUC                            
903010    MOVE WS-DIS-NUMERO-SUC    TO  WS-SDODIS-NUMSUC                            
903310                                                                              
903610    WRITE REG-DISPONIBLE      FROM WS-TOT-SDOACT-SUC BEFORE 1                 
903910    WRITE REG-DISPONIBLE      FROM WS-TOT-DISP-SUC   BEFORE 1                 
904210                                                                              
904510    ADD   WS-DIS-SDOACT-SUC   TO  WS-DIS-SDOACT-NODO                          
904810    ADD   WS-DIS-SDODIS-SUC   TO  WS-DIS-SDODIS-NODO                          
905110    ADD   WS-DIS-NUMERO-SUC   TO  WS-DIS-NUMERO-NODO                          
905410                                                                              
905710    MOVE 0                    TO  WS-DIS-SDOACT-SUC                           
906010                                  WS-DIS-SDODIS-SUC                           
906310                                  WS-DIS-NUMERO-SUC.                          
906610 53463100-EXIT.                                                               
906910     EXIT.                                                                    
907210                                                                              
907510****************************************************************              
907810*      OBTENGO LOS TOTALES DE SDO. DISPONIBLE POR PRODUCTO                    
908110****************************************************************              
908410 53463105-TOTPRD-DISPO.                                                       
908710    MOVE SPACES               TO REG-DISPONIBLE                               
909010    WRITE REG-DISPONIBLE                             BEFORE 3                 
909310    MOVE WS-DIS-SDOACT-PRD    TO  WS-SDODIS-SDOPRD                            
909610    MOVE WS-DIS-SDODIS-PRD    TO  WS-SDODIS-DISPRD                            
909910    MOVE WS-DIS-NUMERO-PRD    TO  WS-SDODIS-NUMPRD                            
910210                                                                              
910510    WRITE REG-DISPONIBLE      FROM WS-TOT-SDOACT-PRD BEFORE 1                 
910810    WRITE REG-DISPONIBLE      FROM WS-TOT-DISP-PRD   BEFORE 1                 
911110                                                                              
911410    ADD   WS-DIS-SDOACT-PRD   TO  WS-DIS-SDOACT-MON                           
911710    ADD   WS-DIS-SDODIS-PRD   TO  WS-DIS-SDODIS-MON                           
912010    ADD   WS-DIS-NUMERO-PRD   TO  WS-DIS-NUMERO-MON                           
912310                                                                              
912610    MOVE 0                    TO  WS-DIS-SDOACT-PRD                           
912910                                  WS-DIS-SDODIS-PRD                           
913210                                  WS-DIS-NUMERO-PRD.                          
913510 53463105-EXIT.                                                               
913810     EXIT.                                                                    
914110                                                                              
914410****************************************************************              
914710*      OBTENGO LOS TOTALES DE SDO. DISPONIBLE POR MONEDA                      
915010****************************************************************              
915310 53463110-TOTMON-DISPO.                                                       
915610    MOVE SPACES               TO REG-DISPONIBLE                               
915910    WRITE REG-DISPONIBLE                             BEFORE 3                 
916210    MOVE WS-DIS-SDOACT-MON    TO  WS-SDODIS-SDOMON                            
916510    MOVE WS-DIS-SDODIS-MON    TO  WS-SDODIS-DISMON                            
916810    MOVE WS-DIS-NUMERO-MON    TO  WS-SDODIS-NUMMON                            
917110                                                                              
917410    WRITE REG-DISPONIBLE      FROM WS-TOT-SDOACT-MON BEFORE 1                 
917710    WRITE REG-DISPONIBLE      FROM WS-TOT-DISP-MON   BEFORE 1                 
918010                                                                              
918310    ADD   WS-DIS-SDOACT-MON   TO  WS-DIS-SDOACT-SUC                           
918610    ADD   WS-DIS-SDODIS-MON   TO  WS-DIS-SDODIS-SUC                           
918910    ADD   WS-DIS-NUMERO-MON   TO  WS-DIS-NUMERO-SUC                           
919210                                                                              
919510    MOVE 0                    TO  WS-DIS-SDOACT-MON                           
919810                                  WS-DIS-SDODIS-MON                           
920110                                  WS-DIS-NUMERO-MON.                          
920410 53463110-EXIT.                                                               
920710     EXIT.                                                                    
921010                                                                              
921310****************************************************************              
921610* VERIFICO SI HUBO CAMBIO DE NODO.                                            
921910****************************************************************              
922210 53464000-NODO.                                                               
922510   PERFORM 53411000-VALNODO      THRU 53411000-EXIT                           
922810   MOVE INV-SUCURSAL-S TO        WS-SUCANT WS-NUMSUC                          
923110   PERFORM 53322000-NOM-SUC      THRU 53322000-EXIT                           
923410   MOVE WS-NOMSUC1               TO WS-NOMSUC.                                
923710 53464000-EXIT.                                                               
924010    EXIT.                                                                     
924310                                                                              
924610*****************************************************************             
924910* CUANDO HAY UN CAMBIO DE MON, INS O PRD OBTENEMOS EL NUEVO                   
925210* NOMBRE DEL PRODUCTO.                                                        
925510*****************************************************************             
925810 53465000-PRODUCTO.                                                           
926110    MOVE INV-PRODUCTO-S     TO  WS-PRDANT WS-NUM-PRODUCTO                     
926410    MOVE INV-INSTRUMENTO-S  TO  WS-INSANT WS-NUM-INSTRUM                      
926710    MOVE INV-MONEDA-S       TO  WS-MONANT WS-MONEDA                           
927010    PERFORM 53321000-BUSCO-PRD  THRU 53321000-EXIT                            
927310    MOVE B05-NOMBRE-PROD    TO  WS-DISPO-NOMBRE                               
927610    MOVE B05-NUM-PRODUCTO   TO  WS-DISPO-PRD                                  
927910    MOVE B05-NUM-INSTRUM    TO  WS-DISPO-INS                                  
928210    MOVE B05-MONEDA         TO  WS-DISPO-MON.                                 
928510 53465000-EXIT.                                                               
928810    EXIT.                                                                     
929110                                                                              
929410****************************************************************              
929710* IMPRIMO ENCABEZADOS Y DETALLE DE AMBOS LISTADOS.                            
930010****************************************************************              
930310 53465500-ENCDET.                                                             
930610   PERFORM 53412000-ENC-DISPO    THRU 53412000-EXIT                           
930910   PERFORM 53461000-DETALLE      THRU 53461000-EXIT.                          
931210 53465500-EXIT.                                                               
931510   EXIT.                                                                      
931810                                                                              
932110*****************************************************************             
932410* OBTENGO LOS TOTALES POR NODO DE AMBOS LISTADOS.                             
932710****************************************************************              
933010 53467000-TOT-NODO.                                                           
933310    PERFORM 53467100-DISPO-NODO      THRU 53467100-EXIT.                      
933610 53467000-EXIT.                                                               
933910    EXIT.                                                                     
934210                                                                              
934510*****************************************************************             
934810* GENERO EL CORTE POR NODO.                                                   
935110*****************************************************************             
935410 53467100-DISPO-NODO.                                                         
935710      MOVE SPACES                  TO REG-DISPONIBLE                          
936010      WRITE REG-DISPONIBLE                        BEFORE 3                    
936310      MOVE WS-DIS-SDOACT-NODO      TO WS-SDODIS-SDONODO                       
936610      MOVE WS-DIS-SDODIS-NODO      TO WS-SDODIS-DISNODO                       
936910      MOVE WS-DIS-NUMERO-NODO      TO WS-SDODIS-NUMNODO                       
937210                                                                              
937510      WRITE REG-DISPONIBLE FROM    WS-TOT-SDONODO BEFORE 1                    
937810      WRITE REG-DISPONIBLE FROM    WS-TOT-DISNODO BEFORE 1                    
938110                                                                              
938410      ADD  WS-DIS-SDOACT-NODO      TO WS-DIS-SDOACT-CSI                       
938710      ADD  WS-DIS-SDODIS-NODO      TO WS-DIS-SDODIS-CSI                       
939010      ADD  WS-DIS-NUMERO-NODO      TO WS-DIS-NUMERO-CSI                       
939310                                                                              
939610      MOVE 0                       TO WS-DIS-SDOACT-NODO                      
939910                                   WS-DIS-SDODIS-NODO                         
940210                                   WS-DIS-NUMERO-NODO.                        
940510 53467100-EXIT.                                                               
940810     EXIT.                                                                    
941110                                                                              
941410****************************************************************              
941710* OBTENGO LOS TOTALES POR CSI DE AMBOS LISTADOS.                              
942010****************************************************************              
942310 53468000-TOT-CSI.                                                            
942610    PERFORM 53468100-DISPO-CSI        THRU 53468100-EXIT.                     
942910 53468000-EXIT.                                                               
943210   EXIT.                                                                      
943510                                                                              
943810****************************************************************              
944110* OBTENGO EL TOTAL POR CSI DE LOS SALDOS DISPONIBLES.                         
944410****************************************************************              
944710 53468100-DISPO-CSI.                                                          
945010   IF WS-LEOMAE = 1                                                           
945310      MOVE SPACES             TO REG-DISPONIBLE                               
945610      WRITE REG-DISPONIBLE                           BEFORE 3                 
945910      MOVE WS-DIS-SDOACT-CSI  TO  WS-SDODIS-SDOCSI                            
946210      MOVE WS-DIS-SDODIS-CSI  TO  WS-SDODIS-DISCSI                            
946510      MOVE WS-DIS-NUMERO-CSI  TO  WS-SDODIS-NUMCSI                            
946810      WRITE REG-DISPONIBLE FROM WS-TOT-SDOCSI        BEFORE 1                 
947110      WRITE REG-DISPONIBLE FROM WS-TOT-DISCSI        BEFORE 1.                
947410 53468100-EXIT.                                                               
947710     EXIT.                                                                    
948010                                                                              
948310                                                                              
948610                                                                              
948910                                                                              
949210                                                                              
949510                                                                              
949810                                                                              
950110****************************************************************              
950410* FINALIZO LA SECCION LE LECTURA DEL ARCHIVO SORT.                            
950710****************************************************************              
951010** 53000000-EXIT.                                                             
951310**   EXIT.                                                                    
951320                                                                              
951330                                                                              
951340                                                                              
951350                                                                              
951610                                                                              
951620******************************************************************            
951630* SECTION DE RUTINAS FINALES.                                                 
951640******************************************************************            
951650 60000000-FIN SECTION.                                                        
951655                                                                              
951660******************************************************************            
951670* RUTINA PARA IMPRESION DEL REPORTE DE COMISIONES POR TEF.                    
951680******************************************************************            
951700 60000000-REP-TEF.                                                            
951705    PERFORM 90000036-S500B36GRUPOCOM-FINDN                                    
951710    IF WS-STATUS-BASE > 0                                                     
951715       IF WS-STATUS-BASE = 1                                                  
951720          MOVE 1 TO WS-16VEZ                                                  
951725       ELSE                                                                   
951740          STRING "ERROR AL HACER FIND A B36 " ,   WS-STATUS-BASE              
951745          DELIMITED BY SIZE INTO                  WS-0101-TEXT-MSG            
951750          PERFORM 70000050-MENSAJE                                            
951755          CALL SYSTEM DMTERMINATE.                                            
951760                                                                              
951765    IF WS-16VEZ = 0                                                           
951770         MOVE WS-NUM-ACT08       TO W77-ID-ACTXX-MAPLI                        
951775         MOVE " "                TO W77-ID-TXTA-LIB                           
951780         PERFORM 70000950-ACT-REGPROC                                         
951785         PERFORM 60001000-LEOB36 THRU 60001000-EXIT.                          
951800 60000000-EXIT.                                                               
951810    EXIT.                                                                     
951820                                                                              
951830*****************************************************************             
951835* LEO B36 Y COMIENZO A GENERAR EL REPORTE. DE COMISIONES P/TEF.               
951840*****************************************************************             
951845 60001000-LEOB36.                                                             
951850    IF WS-17VEZ = 0                                                           
951855       MOVE B36-NUM-PRODUCTO   TO WS-NUM-PRODUCTO                             
951860       MOVE B36-NUM-PRODUCTO   TO WS-PRD-ANT   WS-TEF-PRD                     
951865       MOVE B36-NUM-INSTRUM    TO WS-NUM-INSTRUM                              
951870       MOVE B36-NUM-INSTRUM    TO WS-INS-ANT   WS-TEF-INS                     
951875       MOVE B36-MONEDA         TO WS-MONEDA                                   
951880       MOVE B36-MONEDA         TO WS-MON-ANT   WS-TEF-MON                     
951890       MOVE B36-NUM-GRUPO      TO WS-TEF-GRUPO WS-GPO-ANT                     
951895       PERFORM 60002000-ENCABEZADO  THRU 60002000-EXIT                        
951900       PERFORM 60005000-BUSCO-TARI  THRU 60005000-EXIT                        
951905       MOVE 1        TO WS-17VEZ.                                             
951910                                                                              
951915       IF B36-NUM-PRODUCTO = WS-PRD-ANT  AND                                  
951920          B36-NUM-INSTRUM  = WS-INS-ANT  AND                                  
951925          B36-MONEDA       = WS-MON-ANT  AND                                  
951930          B36-NUM-GRUPO    = WS-GPO-ANT                                       
951935          PERFORM 60003000-DETALLE     THRU 60003000-EXIT                     
951940       ELSE                                                                   
951945          MOVE B36-NUM-PRODUCTO   TO WS-NUM-PRODUCTO                          
951950          MOVE B36-NUM-PRODUCTO   TO WS-PRD-ANT   WS-TEF-PRD                  
951955          MOVE B36-NUM-INSTRUM    TO WS-NUM-INSTRUM                           
951960          MOVE B36-NUM-INSTRUM    TO WS-INS-ANT   WS-TEF-INS                  
951965          MOVE B36-MONEDA         TO WS-MONEDA                                
951970          MOVE B36-MONEDA         TO WS-MON-ANT   WS-TEF-MON                  
951975          MOVE B36-NUM-GRUPO      TO WS-TEF-GRUPO WS-GPO-ANT                  
951980          PERFORM 60002000-ENCABEZADO  THRU 60002000-EXIT                     
951985          PERFORM 60005000-BUSCO-TARI  THRU 60005000-EXIT                     
951990          PERFORM 60003000-DETALLE     THRU 60003000-EXIT.                    
951992 60001000-EXIT.                                                               
951994    EXIT.                                                                     
951996                                                                              
952000*****************************************************************             
952010* ENCABEZADO PARA EL REPORTE DE COMISIONES POR TEF.                           
952020*****************************************************************             
952030 60002000-ENCABEZADO.                                                         
952090       MOVE  SPACES            TO REG-TEF.                                    
952100       WRITE REG-TEF           AFTER CHANNEL 1.                               
952110       WRITE REG-TEF           FROM  WS-ENCABEZADO    BEFORE 1.               
952120       WRITE REG-TEF           FROM  WS-ENCABEZADO1   BEFORE 1.               
952130       WRITE REG-TEF           FROM  WS-03-TEF        BEFORE 1.               
952140       ADD 1                   TO    WS-HOJA5.                                
952150       MOVE WS-HOJA5           TO    WS-TEF-HOJA.                             
952160       WRITE REG-TEF           FROM  WS-04-TEF        BEFORE 1.               
952170       WRITE REG-TEF           FROM  WS-ENCA-HORA     BEFORE 2.               
952180       MOVE "SEMANAL "         TO    WS-TIPPRO                                
952190       WRITE REG-TEF           FROM  WS-CSIPRO        BEFORE 2.               
952200       WRITE REG-TEF           FROM  WS-PRDINSMON-GRU BEFORE 2.               
952210       WRITE REG-TEF           FROM  WS-TIT-TEF1      BEFORE 1.               
952220       WRITE REG-TEF           FROM  WS-TIT-TEF2      BEFORE 1.               
952230       MOVE 15                 TO    WS-LINEA4.                               
952250 60002000-EXIT.                                                               
952260    EXIT.                                                                     
952270                                                                              
952300******************************************************************            
952310* IMPRIMO EL DETALLE DEL LISTADO.                                             
952320******************************************************************            
952330 60003000-DETALLE.                                                            
952340   MOVE 0   TO WS-I  WS-I1 WS-I2  WS-R WS-T.                                  
952345   MOVE 0   TO WS-CHER WS-CHET WS-TARR WS-TART WS-AMBR WS-AMBT                
952350   PERFORM 60003100-LEO-B36 THRU 60003100-EXIT VARYING                        
952360   WS-I FROM 1 BY 1 UNTIL WS-I >60.                                           
952600 60003000-EXIT.                                                               
952610  EXIT.                                                                       
952620                                                                              
952730******************************************************************            
952740* LEO LAS 60 OCURR. B36 Y OBTENGO CON EL IND. EL DATO DE B05                  
952750******************************************************************            
952760 60003100-LEO-B36.                                                            
952765     MOVE  SPACES                      TO REG-TEF                             
952767     MOVE  SPACES                      TO WS-DET-TEF                          
952768     MOVE  "("                         TO WS-TEF-COR1                         
952769     MOVE  ")"                         TO WS-TEF-COR2                         
952770     MOVE WS-I                         TO WS-TEF-OCC                          
952780     MOVE B05-CLAVE-TARIF(WS-I)        TO WS-TEF-TARI                         
952790     PERFORM 60003200-LEO-ESQ THRU 60003200-EXIT VARYING                      
952800     WS-I1 FROM 1 BY 1 UNTIL WS-I1 > 2.                                       
952805     IF WS-36 = 1                                                             
952810        PERFORM 60005100-IMPDET        THRU 60005100-EXIT                     
952815        MOVE 0                         TO WS-36.                              
952850 60003100-EXIT.                                                               
952860    EXIT.                                                                     
952870                                                                              
952880******************************************************************            
952890* LEO LAS 2 OCURRENCIAS DE B36 PERTENECIENTE AL ESQUEMA.                      
952900******************************************************************            
952910 60003200-LEO-ESQ.                                                            
952935     PERFORM 60003300-LEO-MDA          THRU 60003300-EXIT VARYING             
952940     WS-I2 FROM 1 BY 1 UNTIL WS-I2 > 3.                                       
952950 60003200-EXIT.                                                               
952960   EXIT.                                                                      
952970                                                                              
952980******************************************************************            
952985* LEO LAS 3 OCURRENCIAS DE B36 PERTENECIENTE AL MDA.                          
952990******************************************************************            
952995 60003300-LEO-MDA.                                                            
953000    IF B36-ESQ-COMI(WS-I,WS-I1,WS-I2) > 0                                     
953005       MOVE 1                          TO WS-36                               
953010       IF WS-I2 = 1                                                           
953015          IF WS-I1 = 1                                                        
953020             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-CHER              
953025          ELSE                                                                
953030             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-CHET              
953035       ELSE                                                                   
953040       IF WS-I2 = 2                                                           
953045          IF WS-I1 = 1                                                        
953050             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-TARR              
953055          ELSE                                                                
953060             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-TART              
953065       ELSE                                                                   
953070          IF WS-I1 = 1                                                        
953075             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-AMBR              
953080          ELSE                                                                
953085             MOVE  B36-ESQ-COMI(WS-I,WS-I1,WS-I2) TO WS-TEF-AMBT.             
953090 60003300-EXIT.                                                               
953095   EXIT.                                                                      
953110                                                                              
953120******************************************************************            
953130* BUSCO EN B05 LAS TARIFAS CORRESPONDIENTES A CADA GRUPO.                     
953140******************************************************************            
953150 60005000-BUSCO-TARI.                                                         
953160   PERFORM 90000005-B05SXPRDINSTMON-FIND                                      
953170   IF WS-STATUS-BASE > 0                                                      
953180    IF WS-STATUS-BASE = 1                                                     
953210      MOVE "ERROR REG. INEX. EN B05 B036TAR" TO WS-0101-TEXT-MSG              
953220      PERFORM 70000050-MENSAJE                                                
953222      MOVE WS-NUM-PRODUCTO                   TO WS-MSG-PRD                    
953224      MOVE WS-NUM-INSTRUM                    TO WS-MSG-INST                   
953226      MOVE WS-MONEDA                         TO WS-MSG-MDA                    
953232      STRING "PRODUCTO INEXISTENTE ",        WS-MSG-PRD                       
953234      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                 
953236      PERFORM 70000050-MENSAJE                                                
953242      STRING "INSTRU.  INEXISTENTE ",        WS-MSG-INST                      
953244      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                 
953246      PERFORM 70000050-MENSAJE                                                
953252      STRING "MONEDA   INEXISTENTE ",        WS-MSG-MDA                       
953254      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                 
953256      PERFORM 70000050-MENSAJE                                                
953300      CALL SYSTEM DMTERMINATE                                                 
953310    ELSE                                                                      
953340       STRING "ERROR AL HACER FIND A B05 " ,  WS-STATUS-BASE                  
953350       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
953360       PERFORM 70000050-MENSAJE                                               
953370       CALL SYSTEM DMTERMINATE.                                               
953380 60005000-EXIT.                                                               
953390    EXIT.                                                                     
953400                                                                              
953405******************************************************************            
953410* IMPRIMO EL DETALLE DEL LISTADO.                                             
953415******************************************************************            
953420 60005100-IMPDET.                                                             
953600      WRITE REG-TEF           FROM  WS-DET-TEF      BEFORE 1.                 
953610      ADD  1                  TO    WS-LINEA4.                                
953620      MOVE  SPACES            TO REG-TEF.                                     
953800 60005100-EXIT.                                                               
953810   EXIT.                                                                      
953820                                                                              
954910******************************************************************            
955210* CIERRO LA BASE Y ARCHIVOS.                                                  
955510******************************************************************            
955810 70000000-CIERRO.                                                             
955820     MOVE 1                                TO W77-ID-NUMREG-PROC.             
955830     MOVE 09                               TO W77-ID-ACTXX-MAPLI              
955840     MOVE 09                               TO WS-NUM-ACT09.                   
955850     MOVE "CIERRO BASE Y ARCHIVOS        " TO W77-ID-NOMB-LIB                 
955860     MOVE "RUTINA DE CIERRE FINAL.       " TO W77-ID-TXTA-LIB                 
955870     PERFORM 70000910-INIACT-MAPLI.                                           
956110     CLOSE  S151SALDOS            WITH SAVE.                                  
956410     CLOSE  FILE-DISPONIBLE       WITH SAVE.                                  
956420     CLOSE  FILE-BPENDIENTE       WITH SAVE.                                  
956710                                                                              
956720     CLOSE  BLO-PEND    WITH SAVE.                                            
956722     CLOSE  BLO-PEND1   WITH SAVE.                                            
956724     CLOSE  BLO-PEND2   WITH PURGE.                                           
956726     CLOSE  BLO-PEND3   WITH SAVE.                                            
957010     CLOSE  SALDOSTBT   WITH SAVE.                                            
957310     CLOSE  SALDOSTB    WITH SAVE.                                            
957320**   CLOSE  CTOCHE      WITH SAVE.                                            
957322**   CLOSE  CTOCHEII    WITH SAVE.                                            
957330**   CLOSE  CTOCMA      WITH SAVE.                                            
957332**   CLOSE  CTOCMAII    WITH SAVE.                                            
957410     CLOSE  INVE-PTE    WITH SAVE.                                            
957610                                                                              
957620     IF WS-SEMANAL = 1                                                        
957630        CLOSE FILE-TEF  WITH SAVE.                                            
957640                                                                              
957910     IF WS-SEMANAL = 1                                                        
958210        IF WS-MENSUAL = 1                                                     
958510           NEXT SENTENCE                                                      
958810        ELSE                                                                  
959110           IF WS-LEOAHO = 1                                                   
959410              CLOSE  FILE-INVEN  WITH SAVE.                                   
959710                                                                              
960010       CLOSE  S500BD01CAPTACION ON EXCEPTION                                  
960910       MOVE "ERROR AL CERRAR LA BASE"    TO WS-0101-TEXT-MSG                  
961210       PERFORM 70000050-MENSAJE                                               
961510       CALL SYSTEM DMTERMINATE.                                               
961520                                                                              
961530       MOVE WS-NUM-ACT09        TO W77-ID-ACTXX-MAPLI                         
961540       MOVE " "                 TO W77-ID-TXTA-LIB                            
961550       PERFORM 70000950-ACT-REGPROC.                                          
961560                                                                              
961570       MOVE WS-NUM-ACT09         TO W77-ID-ACTXX-MAPLI.                       
961580       PERFORM 70000910-FIN-ACTI-MAPLI.                                       
961590       PERFORM 70000950-FIN-PGM-MAPLI.                                        
961810 70000000-EXIT.                                                               
962110     EXIT.                                                                    
962410                                                                              
962710                                                                              
963010                                                                              
963310                                                                              
963610                                                                              
963910******************************************************************            
964210*    R U T I N A S   D E   D E S P L I E G U E   D E   M S G.                 
964510*        P A R A   L A   P R I M E R A   S E C T I O N.                       
964810******************************************************************            
965110                                                                              
965410                                                                              
965710                                                                              
966010                                                                              
966310                                                                              
966610                                                                              
966910******************************************************************            
967210* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
967510******************************************************************            
967810 COPY "S500/INC/PRO/25MTP002".                                                
967815                                                                              
967820 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
