100100$SET LIST$                                                                    
100300$SET ERRORLIST                                                                
100700$ ERRORLIMIT = 500                                                            
100900$SET LIST STACK LINEINFO FREE                                                 
101100$SET BDB00R01 BDB00R03 BDB00R04                                               
101110$SET BDB02R01 BDB02R02 BDB02R03                                               
101120$SET BDB03R02                                                                 
101122$SET BDB05R02                                                                 
101130$SET BDB06R06 BDB06R11                                                        
101300$SET BDB91                                                                    
101500$SET S100VERSIONES S006LOCSUP S050SALDOS S080IVA                              
101510$SET S000LIBLJ                                                                
101600$SET S050L190                                                                 
101700$SET FECHA2000                                                                
101800******************************************************                        
101810$SET LIBMAPLI                                                                 
101820$SET MAPLIACTLIB012 MAPLIACTLIB013                                            
101830$SET MAPLIACTLIB015                                                           
101840$SET MAPLIACTLIB030 MAPLIACTLIB032                                            
101850$SET HOSTNAME                                                                 
101860                                                                              
101870                                                                              
101880***************************************************                           
101900$RESET LIST$                                                                  
102100****************************************************************              
102300** CARGA SALDOS DE OTRAS INVERSIONES A LA BASE DEL S500 (B06) **              
102500** ESTE PROCESO DEBE CORRER ANTES DEL BATCH DIARIO            **              
102510**      DURANTE LA LINEA,                                     **              
102520**      PARA AGILIZAR EL PROCESO DEL PASO S500/P130           **              
102700** UTILIZANDO LA LIBRERIA DEL S050.                           **              
102900** PARA LOS PRODUCTOS: CON FECHA DE CORTE DEL DIA             **              
103100**      CUENTA MAESTRA TRADICIONAL    0066-0006-001           **              
103300**      CUENTA MAESTRA OPCION         0066-0007-001           **              
103400**      CUENTA PERFIL                 0066-0008-001           **              
103500**      CUENTA PERFIL  UNIVERSITARIO  0066-0009-001           **              
103700**      CUENTA CHEQUES M.N.           0001-0001-001 (FISICAS) **              
103900**      CUENTA PRODUCTIVA             0001-0003-001           **              
103950**                                                            **              
104000** ADEMAS LA CARGA DE CONSULTAS DE ESTADO DE CUENTA           **              
104050** UTILIZANDO LA LIBRERIA S050/L190                           **              
104100** PARA LOS PRODUCTOS QUE COBRAN LA COMISION                  **              
104150** CON LA CALIFICACION DE TARIFA Y CLAVE DE COMISION          **              
104200** EN  LOS OCCURS DE LOS CAMPOS                               **              
104250** B05-CLAVE-TARIF EN LOS OCCURS 06,24,25                     **              
104300** B05-CLAVE-COMIS EN LOS OCCURS 06,24,25                     **              
104500****************************************************************              
104510* PASO ORIGINAL P300 SE CAMBIA AL P199 PARA QUE CORRA DIARIO  **              
104520* JUNIO/2005                                                  **              
104700* P199 P199 P199 P199 P199 P199 P199 P199 P199 P199 P199 P199 **              
104900****************************************************************              
105100 IDENTIFICATION DIVISION.                                                     
105300 PROGRAM-ID.    P199.                                                         
105500 AUTHOR.        JOSE LUIS IBARRA LARA.                                        
105700 DATE-WRITTEN.  ENE-1999.                                                     
105900 INSTALLATION.  BANCO NACIONAL DE MEXICO, S.A.                                
106100 SECURITY.                                                                    
106300****************************************************************              
106500 ENVIRONMENT    DIVISION.                                                     
106700 CONFIGURATION  SECTION.                                                      
106900 SOURCE-COMPUTER.                                                             
107100 OBJECT-COMPUTER.                                                             
107300 INPUT-OUTPUT   SECTION.                                                      
107500 FILE-CONTROL.                                                                
107700     SELECT  R01-MENSAJES  ASSIGN   TO PRINTER.                               
107900**************************************************************                
108100 DATA  DIVISION.                                                              
108300 FILE  SECTION.                                                               
108500*************************************************************                 
108700 FD  R01-MENSAJES.                                                            
108900 01  R01-L00-MENSAJE        PIC X(132).                                       
109100***************************************************************               
109300 DATA-BASE SECTION.                                                           
109500 DB  S500BD01CAPTACION.                                                       
109700 01  S500B02CONTROL.                                                          
109750 01  S500B05INSTRUMEN.                                                        
109900 01  S500B03CONTRATOS.                                                        
110100 01  S500B06HISTORICO.                                                        
110300 01  S500B91REINICIO.                                                         
110350                                                                              
110500*************************************************************                 
110700 WORKING-STORAGE SECTION.                                                     
110710************* PARA USO DE LIBRERIA MAPLI ***********                          
110720 77 W77-ID-ACT01-MAPLI       PIC 9(02).                                       
110730 77 W77-ID-ACT02-MAPLI       PIC 9(02).                                       
110740 77 W77-ID-ACT03-MAPLI       PIC 9(02).                                       
110750 77 W77-ERR-L035-MAPLI       PIC 9(01)  VALUE 0.                              
110755 77 W77-ERR-L035-DATO        PIC X(20)  VALUE " ".                            
110760                                                                              
110770                                                                              
110780                                                                              
110790***************************************************                           
110800 77  W77-IND-INST            PIC 9(02).                                       
110805 77  W77-IND-PERS            PIC 9(02).                                       
110810 77  W77-EOF-INST            PIC 9(02)               VALUE 0.                 
110812 77  W77-TOT-CORTES          PIC 9(08)               VALUE 0.                 
110814 77  W77-TOT-SALDOS          PIC 9(08)               VALUE 0.                 
110816 77  W77-TOT-CONSULTAS       PIC 9(08)               VALUE 0.                 
110821 77  W77-TOT-EXTENDED        PIC 9(08)               VALUE 0.                 
110910 77  W77-SI-TERMINA          PIC XX                  VALUE "SI".              
110920 77  W77-FIN-FORZADO         PIC 9(02)               VALUE 0.                 
110922 77  W77-REINICIO            PIC 9(02)               VALUE 0.                 
110930 77  W77-NUM-HI              PIC 9(04)               VALUE 0.                 
110940 77  W77-NUM-STOP            PIC 9(02)               VALUE 0.                 
110950 77  W77-SW-S050L190         PIC 9(02)               VALUE 0.                 
111100 77  W77-NUM-LEIDOS          PIC 9(07)               VALUE 0.                 
111110 77  W77-CARGA-ANT           PIC 9(07)               VALUE 0.                 
111500 77  W77-NUM-CALLS           PIC 9(07)               VALUE 0.                 
111510 77  W77-NUM-CALL-L190       PIC 9(07)               VALUE 0.                 
111520 77  W77-HAY-CONSULTA        PIC 9(07)               VALUE 0.                 
111530 77  W77-HAY-CONSULTA-A      PIC 9(07)               VALUE 0.                 
111700 77  W77-NUM-NO-S050         PIC 9(07)               VALUE 0.                 
111900 77  W77-NUM-SI-S050         PIC 9(07)               VALUE 0.                 
112100 77  W77-NUM-FONDOS          PIC 9(07)               VALUE 0.                 
112110 77  W77-NUM-FONDOS-A        PIC 9(07)               VALUE 0.                 
112300 77  W77-NUM-BCAINV          PIC 9(07)               VALUE 0.                 
112310 77  W77-NUM-BCAINV-A        PIC 9(07)               VALUE 0.                 
112500 77  W77-NUM-INVPLA          PIC 9(07)               VALUE 0.                 
112510 77  W77-NUM-INVPLA-A        PIC 9(07)               VALUE 0.                 
112700 77  W77-NUM-8412            PIC 9(07)               VALUE 0.                 
112710 77  W77-NUM-8412-A          PIC 9(07)               VALUE 0.                 
112720                                                                              
112740 77  W77-IMP-FONDOS          PIC 9(14)V99            VALUE 0.                 
112742 77  W77-IMP-FONDOS-A        PIC 9(14)V99            VALUE 0.                 
112760 77  W77-IMP-BCAINV          PIC 9(14)V99            VALUE 0.                 
112762 77  W77-IMP-BCAINV-A        PIC 9(14)V99            VALUE 0.                 
112780 77  W77-IMP-INVPLA          PIC 9(14)V99            VALUE 0.                 
112782 77  W77-IMP-INVPLA-A        PIC 9(14)V99            VALUE 0.                 
112800 77  W77-IMP-8412            PIC 9(14)V99            VALUE 0.                 
112802 77  W77-IMP-8412-A          PIC 9(14)V99            VALUE 0.                 
112820                                                                              
112900 77  W77-NUM-MIX             PIC 9(07).                                       
113100 77  W77-MY-CSI              PIC 9(02)         COMP  VALUE 0.                 
113500 77  W77-ES-PRUEBA           PIC 9(02)         COMP  VALUE 0.                 
113700 77  W77-ES-MENSUAL          PIC 9(02)         COMP  VALUE 0.                 
113900 77  W77-EOF-BASE            PIC 9(02)         COMP  VALUE 0.                 
114000 77  W77-SI-B06              PIC 9(02)         COMP  VALUE 0.                 
114010 77  W77-NOHAY-B05           PIC 9(02)         COMP  VALUE 0.                 
114100 77  W77-SI-SALDOS           PIC 9(02)         COMP  VALUE 0.                 
114105 77  W77-SI-CONSULTAS        PIC 9(02)         COMP  VALUE 0.                 
114110 77  W77-SI-CORTA            PIC 9(02)         COMP  VALUE 0.                 
114115 77  W77-SI-PROCESO          PIC 9(02)         COMP  VALUE 0.                 
114120 77  W77-DIA-CORTE           PIC 9(02)         COMP  VALUE 0.                 
114125 77  W77-RS-DIV              PIC 9(04)         COMP  VALUE 0.                 
114130 77  W77-BISIESTO            PIC 9(02)         COMP  VALUE 0.                 
114300 77  W77-NO-HAY-S050         PIC 9(02)         COMP  VALUE 0.                 
114700 77  W77-ERROR-S050          PIC 9(02)         COMP  VALUE 0.                 
115100 77  W77-ERROR-PROC          PIC 9(02)         COMP  VALUE 0.                 
115600 77  W77-OPEN-R01            PIC 9(02)         COMP  VALUE 0.                 
115700 77  W77-R01-NLIN            PIC 9(02)         COMP  VALUE 90.                
115900 77  W77-R01-NPAG            PIC 9(04)         COMP  VALUE 0.                 
116100 77  W77-FECHA-EDIT          PIC 9999/99/99.                                  
116300                                                                              
116310                                                                              
116320 01  WKS-HORA-EDIT.                                                           
116322     02 WKS-HRA-EDIT        PIC 99.                                           
116324     02 FILLER              PIC X(01) VALUE ":".                              
116326     02 WKS-MIN-EDIT        PIC 99.                                           
116328     02 FILLER              PIC X(01) VALUE ":".                              
116330     02 WKS-SEG-EDIT        PIC 99.                                           
116332     02 FILLER              PIC X(01) VALUE ":".                              
116334     02 WKS-CSE-EDIT        PIC 99.                                           
116350************************************************************                  
116400 01  WKS-TAB-INST.                                                            
116410     02 WKS-TB-B05INSTRUMEN       OCCURS 30 TIMES.                            
116420        04 WKS-TB-B05-PROD        PIC 9(04)     COMP.                         
116430        04 WKS-TB-B05-INST        PIC 9(04)     COMP.                         
116440        04 WKS-TB-B05-MONEDA      PIC 9(03)     COMP.                         
116450        04 WKS-TB-B05-S050L190    PIC 9(01)     COMP.                         
116460        04 WKS-TB-B05-COMISION.                                               
116470           06 WKS-TB-B05-CVTARIFA PIC 9(03) COMP OCCURS 60 TIMES.             
116480           06 WKS-TB-B05-COMIS    PIC 9(04) COMP OCCURS 60 TIMES.             
116490                                                                              
116500        04 WKS-TB-B05-SDOSINTEG         OCCURS 2 TIMES.                       
116510           06 WKS-TB-B05-SI-SDOSINTEG   PIC 9(01) COMP.                       
116520           06 WKS-TB-B05-USO-INVINTEGR  PIC 9(01) COMP.                       
116530           06 WKS-TB-B05-USO-INVPLAZO   PIC 9(01) COMP.                       
116540           06 WKS-TB-B05-USO-INVCPE     PIC 9(01) COMP.                       
116550           06 WKS-TB-B05-USO-BCAINV     PIC 9(01) COMP.                       
116555           06 WKS-TB-B05-USO-OTRAINV    PIC 9(01) COMP.                       
116560                                                                              
116600                                                                              
116700****************************************************************              
116900 01  WKS-TABLA-NOM-MES.                                                       
117100     02 FILLER                   PIC X(10) VALUE "ENERO     ".                
117300     02 FILLER                   PIC X(10) VALUE "FEBRERO   ".                
117500     02 FILLER                   PIC X(10) VALUE "MARZO     ".                
117700     02 FILLER                   PIC X(10) VALUE "ABRIL     ".                
117900     02 FILLER                   PIC X(10) VALUE "MAYO      ".                
118100     02 FILLER                   PIC X(10) VALUE "JUNIO     ".                
118300     02 FILLER                   PIC X(10) VALUE "JULIO     ".                
118500     02 FILLER                   PIC X(10) VALUE "AGOSTO    ".                
118700     02 FILLER                   PIC X(10) VALUE "SEPTIEMBRE".                
118900     02 FILLER                   PIC X(10) VALUE "OCTUBRE   ".                
119100     02 FILLER                   PIC X(10) VALUE "NOVIEMBRE ".                
119300     02 FILLER                   PIC X(10) VALUE "DICIEMBRE ".                
119500 01  WKS-RD-TABLA-NOM-MES        REDEFINES WKS-TABLA-NOM-MES.                 
119700     02 WKS-TAB-NOM-MES          OCCURS 12 TIMES.                             
119900        04 WKS-TB-MES-03         PIC X(03).                                   
120100        04 FILLER                PIC X(07).                                   
120120                                                                              
120140 01  WKS-TABLA-NUM-DIAS.                                                      
120160     02 FILLER                   PIC X(12) VALUE "312831303130".              
120180     02 FILLER                   PIC X(12) VALUE "313130313031".              
120200 01  WKS-RD-TABLA-NUM-DIAS       REDEFINES WKS-TABLA-NUM-DIAS.                
120220     02 WKS-TAB-DIAS-MES         PIC 99    OCCURS 12.                         
120240                                                                              
120300                                                                              
120320*************************************************                             
120340   01  WKS-VAR-TASKVALUE.                                                     
120360       02 WKS-TASKVALUE-PBA    PIC 9(02) VALUE 0.                             
120380       02 RD-WKS-TASKVALUE-PBA REDEFINES WKS-TASKVALUE-PBA.                   
120400          04 WKS-SIN-LBS050    PIC 9(02).                                     
120430          88 W88-SIN-LB301     VALUE 01, 03.                                  
120434          88 W88-SIN-LB190     VALUE 02, 03.                                  
120440                                                                              
120500*******************************************************                       
120700*01  WKS-NAME-HOST.                                                           
120900*    02 WKS-MY-HOST         PIC X(20).                                        
121100*    02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
121300*       04 WKS-MY-HOST-03   PIC X(04).                                        
121500*       04 WKS-MY-HOST-17   PIC X(16).                                        
121700*                                                                             
121720*                                                                             
121740***********************************************************                   
121760 01  WKS-MENSAJE-ESTAD.                                                       
121780     02 WKS-TIPO-ESTAD   PIC X(13)  VALUE " ".                                
121800     02 WKS-NUME-ESTAD   PIC Z,ZZZ,Z99.                                       
121810     02 FILLER           PIC X(01)  VALUE " ".                                
121820     02 WKS-IMPO-ESTAD   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                              
121870                                                                              
121900 01  WKS-TOTAL-ESTAD.                                                         
121920     02 WKS-TIPO-TTEST   PIC X(17)  VALUE " ".                                
121940     02 WKS-NUME-TTEST   PIC Z,ZZZ,Z99.                                       
121945     02 FILLER           PIC X(01)  VALUE " ".                                
121960     02 WKS-IMPO-TTEST   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                              
121980                                                                              
122100************************************************************                  
122300 01  WKS-VARIABLES-GLOBALES.                                                  
122500                                                                              
122700     02 WKS-FECHA-LOTE      PIC 9(08).                                        
122900     02 RD-WKS-FECHA-LOTE   REDEFINES WKS-FECHA-LOTE.                         
123100        04 WKS-AA-LOTE      PIC 9(04).                                        
123300        04 WKS-MM-LOTE      PIC 99.                                           
123500        04 WKS-DD-LOTE      PIC 99.                                           
123520                                                                              
123540     02 WKS-FECHA-BATCH     PIC 9(08).                                        
123560     02 RD-WKS-FECHA-BATCH  REDEFINES WKS-FECHA-BATCH.                        
123580        04 WKS-AA-BATCH     PIC 9(04).                                        
123600        04 WKS-MM-BATCH     PIC 99.                                           
123620        04 WKS-DD-BATCH     PIC 99.                                           
123700                                                                              
123900     02 WKS-FECHA-LINEA     PIC 9(08).                                        
124100     02 RD-WKS-FECHA-LINEA  REDEFINES WKS-FECHA-LINEA.                        
124300        04 WKS-AA-LINEA     PIC 9(04).                                        
124500        04 WKS-MM-LINEA     PIC 99.                                           
124700        04 WKS-DD-LINEA     PIC 99.                                           
124900                                                                              
125100     02 WKS-FEC-ANT         PIC 9(08).                                        
125300     02 RD-WKS-FEC-ANT      REDEFINES WKS-FEC-ANT.                            
125500        04 WKS-AA-ANT       PIC 9(04).                                        
125700        04 WKS-MM-ANT       PIC 99.                                           
125900        04 WKS-DD-ANT       PIC 99.                                           
126100                                                                              
126300     02 WKS-FEC-PROX        PIC 9(08).                                        
126500     02 RD-WKS-FEC-PROX     REDEFINES WKS-FEC-PROX.                           
126700        04 WKS-AA-PROX      PIC 9(04).                                        
126900        04 WKS-MM-PROX      PIC 99.                                           
127100        04 WKS-DD-PROX      PIC 99.                                           
127110                                                                              
127120     02 WKS-FECHA-PTE         PIC 9(08).                                      
127130     02 WKS-RD-FEC-PTE      REDEFINES WKS-FECHA-PTE.                          
127140        04 WKS-AA-PTE       PIC 9(04).                                        
127150        04 WKS-MM-PTE       PIC 99.                                           
127160        04 WKS-DD-PTE       PIC 99.                                           
127165                                                                              
127170     02 WKS-FECORTE-DANT     PIC 9(08).                                       
127180     02 RD-WKS-FECORTE-DANT  REDEFINES WKS-FECORTE-DANT.                      
127190        04 WKS-AA-CORT-DANT  PIC 9(04).                                       
127200        04 WKS-MM-CORT-DANT  PIC 99.                                          
127210        04 WKS-DD-CORT-DANT  PIC 99.                                          
127215                                                                              
127220     02 WKS-FECORTE-DNVO     PIC 9(08).                                       
127230     02 RD-WKS-FECORTE-DNVO  REDEFINES WKS-FECORTE-DNVO.                      
127240        04 WKS-AA-CORT-DNVO  PIC 9(04).                                       
127250        04 WKS-MM-CORT-DNVO  PIC 99.                                          
127260        04 WKS-DD-CORT-DNVO  PIC 99.                                          
127300                                                                              
127500                                                                              
127700     02 WKS-TIME-MAQ        PIC 9(08)        COMP.                            
127900     02 RD-WKS-TIME-MAQ     REDEFINES WKS-TIME-MAQ.                           
128100        04 WKS-HMS-MAQ      PIC 9(06)        COMP.                            
128300        04 FILLER           PIC 9(02)        COMP.                            
128320     02 RD2-WKS-TIME-MAQ    REDEFINES WKS-TIME-MAQ.                           
128330        04 WKS-HH-TIME      PIC 9(02)        COMP.                            
128340        04 WKS-MM-TIME      PIC 9(02)        COMP.                            
128350        04 WKS-SS-TIME      PIC 9(02)        COMP.                            
128360        04 WKS-DS-TIME      PIC 9(02)        COMP.                            
128500                                                                              
128700     02 WKS-TIME-R01        PIC 9(08)      COMP.                              
128710     02 RD-WKS-TIME-R01     REDEFINES WKS-TIME-R01.                           
128712        04 WKS-HH-TIME-R01  PIC 9(02)        COMP.                            
128714        04 WKS-MM-TIME-R01  PIC 9(02)        COMP.                            
128716        04 WKS-SS-TIME-R01  PIC 9(02)        COMP.                            
128718        04 WKS-DS-TIME-R01  PIC 9(02)        COMP.                            
128740                                                                              
128900     02 WKS-TIME-CALL       PIC 9(08)      COMP.                              
129100     02 RD-WKS-TIME-CALL    REDEFINES WKS-TIME-CALL.                          
129300        04 WKS-HMS-CALL     PIC 9(06)        COMP.                            
129500        04 WKS-DECSS-CALL   PIC 9(02)        COMP.                            
129700                                                                              
129900     02 WKS-FECPROC-EDIT.                                                     
130100        04 WKS-DD-FPRC-EDIT    PIC 99.                                        
130300        04 FILLER              PIC X       VALUE "/".                         
130500        04 WKS-MM-FPRC-EDIT    PIC X(03).                                     
130700        04 FILLER              PIC X       VALUE "/".                         
130900        04 WKS-AAAA-FPRC-EDIT  PIC 9(04).                                     
131100                                                                              
131300     02 WKS-FECMAQ-EDIT.                                                      
131500        04 WKS-DD-FMAQ-EDIT    PIC 99.                                        
131700        04 FILLER              PIC X       VALUE "/".                         
131900        04 WKS-MM-FMAQ-EDIT    PIC X(03).                                     
132100        04 FILLER              PIC X       VALUE "/".                         
132300        04 WKS-AAAA-FMAQ-EDIT  PIC 9(04).                                     
132500                                                                              
132700*****************************************************************             
132900 01  WKS-TITULO-R00.                                                          
133100     04 FILLER                PIC X(15) VALUE "S500/LIST/P199/".              
133300     04 WKS-TIT-R-NODO        PIC 99.                                         
133500     04 WKS-TIT-R-SBNODO      PIC 99    VALUE 0.                              
133700     04 FILLER                PIC X     VALUE "/".                            
133900     04 WKS-TIT-R-TPO         PIC X     VALUE "R".                            
134100     04 FILLER                PIC X(04)  VALUE "000/".                        
134300     04 WKS-TIT-R-FEC         PIC 9(06).                                      
134500     04 FILLER                PIC X     VALUE "/".                            
134700     04 WKS-TIT-R-MIX         PIC 9(07).                                      
134900     04 FILLER                PIC X     VALUE "/".                            
135100     04 WKS-TIT-R-NAME        PIC X(17).                                      
135300     04 FILLER                PIC X     VALUE ".".                            
135500                                                                              
135700***************************************************************               
135900**** LINEAS DE IMPRESION   ********************                               
136100 01  WLI-R00-L01-ENCA.                                                        
136300     02 FILLER              PIC X(19) VALUE                                   
136500                            "S500/P199/25MTP004/".                            
136700     02 WLI-R00-L01-NAME    PIC X(35) VALUE " ".                              
136900     02 FILLER              PIC X(51) VALUE                                   
137100                            "DEPOSITOS A LA VISTA".                           
137300     02 FILLER              PIC X(14) VALUE                                   
137500                            "FECHA MOVTOS: ".                                 
137700     02 WLI-R00-L01-FPROC   PIC X(13).                                        
137900                                                                              
138100 01  WLI-R00-L02-ENCA.                                                        
138300     02 FILLER              PIC X(15) VALUE                                   
138500                            "FECHA PROCESO: ".                                
138700     02 WLI-R00-L02-FMAQ    PIC X(11).                                        
138900     02 FILLER              PIC X(16) VALUE " ".                              
139100     02 WLI-R00-L02-TITULO.                                                   
139300        04 WLI-R00-L02-TIT1   PIC X(12) VALUE " ".                            
139500        04 WLI-R00-L02-TIT2   PIC X(51) VALUE                                 
139700           "REPORTE DE MENSAJES DEL PROCESO ".                                
139900                                                                              
140100     02 FILLER              PIC X(14) VALUE                                   
140300                            "TIPO PROCESO: ".                                 
140500     02 WLI-R00-L02-TPROC   PIC X(13) VALUE "DIARIO ".                        
140700                                                                              
140900 01  WLI-R00-L03-ENCA.                                                        
141100     02 FILLER              PIC X(15) VALUE                                   
141300                            "HORA  PROCESO: ".                                
141500     02 WLI-R00-L03-HH      PIC 99.                                           
141510     02 FILLER              PIC X(01) VALUE ":".                              
141520     02 WLI-R00-L03-MM      PIC 99.                                           
141530     02 FILLER              PIC X(01) VALUE ":".                              
141540     02 WLI-R00-L03-SS      PIC 99.                                           
141700     02 FILLER              PIC X(19) VALUE " ".                              
141900     02 WLI-R00-L03-SBTIT   PIC X(63) VALUE " ".                              
142100     02 FILLER              PIC X(14) VALUE                                   
142300                            "HOJA NUM    : ".                                 
142500     02 WLI-R00-L03-NPAG    PIC ZZZZZ.                                        
142700     02 FILLER              PIC X(08) VALUE " ".                              
142900                                                                              
143100 01  WLI-R00-L04-ENCA.                                                        
143300     02 WLI-R00-L04-SUC     PIC 9(04)  VALUE 0511.                            
143500     02 FILLER              PIC X(128) VALUE " ".                             
143700                                                                              
143900 01  WLI-R00-L05-ENCA.                                                        
144100     02 WLI-R00-L05-NBSUC   PIC X(060) VALUE                                  
144300                            "CTO PROC DE VALORES".                            
144500     02 WLI-R00-L05-NCSI    PIC X(072) VALUE                                  
144700                            "S500 CAPTACION".                                 
144900                                                                              
145100 01  WLI-R01-L06-DETALLE.                                                     
145300     02 WLI-R01-HORA        PIC X(11).                                        
145500     02 FILLER              PIC X.                                            
145700     02 WLI-R01-MENSAJE     PIC X(120).                                       
145900                                                                              
149300                                                                              
149500*****************************************************                         
149700 01  VARIABLES-B03-AUX.                                                       
149900     02 WS03-PIM.                                                             
150100        04 WS03-NUM-PRODUCTO            PIC 9(04).                            
150300        04 WS03-NUM-INSTRUM             PIC 9(04).                            
150500        04 WS03-MONEDA                  PIC 9(03).                            
150700     02 RD-WS03-PIM                     REDEFINES WS03-PIM.                   
150900        04 WS03-PIM-PROD                PIC 9(11).                            
151100        88 WS03-88-ES-AHORROS           VALUE  05000006001.                   
151300        88 WS03-88-ES-CTAMAE            VALUE  00660006001.                   
151500        88 WS03-88-ES-CTAMAEOP          VALUE  00660007001.                   
151520        88 WS03-88-ES-CTACCESO          VALUE  00660008001.                   
151530        88 WS03-88-ES-PERFUNIV          VALUE  00660009001.                   
151540                                                                              
151545        88 WS03-88-ES-PROD-A-SOR        VALUE  00660011001.                   
151550        88 WS03-88-ES-PROD-B-SOR        VALUE  00660012001.                   
151555        88 WS03-88-ES-CTA-BAS-BNX       VALUE  00660014001.                   
151700        88 WS03-88-ES-CTAMAEDL          VALUE  00660005005.                   
151900        88 WS03-88-ES-CHQ-MN            VALUE  00010001001.                   
152100        88 WS03-88-ES-DLS-FRONT         VALUE  00010001005.                   
152300        88 WS03-88-ES-CTA-PROD          VALUE  00010003001.                   
152500        88 WS03-88-ES-DLS-SINREND       VALUE  00010004005.                   
152700        88 WS03-88-ES-DLS-CONREND       VALUE  00010005005.                   
152900                                                                              
153100     02 WS03-TIPO-PERSONA               PIC 9(02).                            
153300     88 WS03-88-TP-FISICA               VALUE  1.                             
153500     88 WS03-88-TP-MORAL                VALUE  2.                             
153700     88 WS03-88-TP-FISEMP               VALUE  3.                             
153900     88 WS03-88-TP-MORNOLUCR1           VALUE  4.                             
154100     88 WS03-88-TP-FISMENOR             VALUE  5.                             
154300     88 WS03-88-TP-FISINCAP             VALUE  6.                             
154500     88 WS03-88-TP-FISDEEXT             VALUE  7.                             
154700     88 WS03-88-TP-CABGPO               VALUE  8.                             
154900     88 WS03-88-TP-MORDEEXT             VALUE  9.                             
155100     88 WS03-88-TP-FISEXT               VALUE  11.                            
155300     88 WS03-88-TP-MOREXT               VALUE  12.                            
155500     88 WS03-88-TP-MORNOLUCR2           VALUE  14.                            
155510     88 WS03-88-TP-FNALENEXT            VALUE  15.                            
155515     88 WS03-88-TP-FEMPEXTEM            VALUE  16.                            
155700     88 WS03-88-TP-GFISICA              VALUE  1,3,5,6,7,11,15,16.            
155900     88 WS03-88-TP-GMORAL               VALUE  2,4,8,9,12,14.                 
156100                                                                              
156300                                                                              
156500                                                                              
156700*****************************************************                         
156900                                                                              
157100 COPY "S500/INC/WOR/25MTP002".                                                
157200 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
157300/                                                                             
157320*********************************************                                 
157340*                                                                             
157360*WKS-TASKVALUE = (A)                                                          
157370* (A) = 00  CON LIB S050L301 CON S050L190.                                    
157380* (A) = 01  SIN LIB S050L301 CON S050L190.                                    
157400* (A) = 02  CON LIB S050L301 SIN S050L190.                                    
157420* (A) = 03  SIN LIB S050L301 SIN S050L190.                                    
157440*     NO HACE VALIDACION DEL TASKVALUE (ES PARA PRUEBAS)                      
157465*     CUALQUIER OTRO VALOR UTILIZA LAS LIBRERIAS.                             
157470*     EN PRODUCCION NO CORRE CON VALUE (TRUENA).                              
157500*****************************************************                         
157700 PROCEDURE DIVISION.                                                          
157900*****************************************************************             
158100 DECLARATIVES.                                                                
158300 INTERRUPT-SECCION        SECTION  00.                                        
158500*==================                                                           
158700                                                                              
158900     USE AS INTERRUPT PROCEDURE.                                              
159100                                                                              
159300 INTERRUPT-BY-HI.                                                             
159500*===============                                                              
159700                                                                              
159900     DISALLOW  INTERRUPT.                                                     
159910     MOVE "I"       TO W77-TIPO-DISP.                                         
159912     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO W77-NUM-HI.                        
159914                                                                              
159920     IF W77-NUM-HI = 4                                                        
159930        MOVE 1                 TO W77-FIN-FORZADO                             
159960        STRING "SOLICITUD FIN DE EMERGENCIA "                                 
159965               " HI=", W77-NUM-HI                                             
159970               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
159980        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
159990        PERFORM 60001000-ESC-MENSAJE                                          
160000        PERFORM 70000050-MENSAJE                                              
160010        MOVE "I"       TO W77-TIPO-DISP.                                      
160020     IF W77-NUM-HI = 0                                                        
160500        STRING "LEI=", W77-NUM-LEIDOS,                                        
160700               " CALL=", W77-NUM-CALLS,                                       
160720               " FON=", W77-NUM-FONDOS,                                       
160740               " BCI=", W77-NUM-BCAINV,                                       
160760               " PLA=", W77-NUM-INVPLA,                                       
160780               " CME=", W77-NUM-8412                                          
160900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
160910        MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                         
161100        PERFORM 60001000-ESC-MENSAJE                                          
161200        PERFORM 70000050-MENSAJE                                              
161300     ELSE                                                                     
161400        STRING "SOLICITUD DE HI ERRONEO ", W77-NUM-HI                         
161420               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
161440        MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                         
161460        PERFORM 60001000-ESC-MENSAJE                                          
161480        PERFORM 70000050-MENSAJE.                                             
161500                                                                              
161700     SET MYSELF (TASKVALUE) TO ZERO.                                          
161900     MOVE "E"       TO W77-TIPO-DISP.                                         
162100 END-INTERRUPT-BY-HI.                                                         
162300     ALLOW INTERRUPT.                                                         
162500 END DECLARATIVES.                                                            
162700                                                                              
162900******************************************************************            
163100 00000000-CONTROL  SECTION  01.                                               
163300 00000000-CONTROL-PROGRAMA.                                                   
163500*=========================                                                    
163510                                                                              
163515     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-TASKVALUE-PBA.                 
163516     SET MYSELF (TASKVALUE)             TO ZERO.                              
163520     MOVE 2             TO W77-USO-LIBLJ.                                     
163525     MOVE "S500P199"    TO W77-S000-MY-ID.                                    
163530     MOVE 199           TO WS-NUM-PASO.                                       
163540     MOVE "P199"        TO WS-0101-PASO-MSG.                                  
163545     MOVE "25MTP004"    TO WS-0101-MTP-MSG W77-S000-MY-VERSION.               
163550                                                                              
163600******************************************************                        
163602     PERFORM 10000100-VERSIONES.                                              
163605     PERFORM 1000038-S038L035.                                                
163610     MOVE 1                TO W77-ID-NUM-COPIA-MAPLI.                         
163620     MOVE 1                TO W77-ID-TPODSP-INFO-MAPLI.                       
163630     MOVE 07               TO W77-ID-ESINI-GRUPO-MAPLI.                       
163640     MOVE 07               TO W77-ID-NUM-GRUPO-MAPLI.                         
163650     MOVE "CARGA SALDOS"   TO W77-ID-NOMB-LIB.                                
163660     PERFORM 70000950-INI-PGM-MAPLI.                                          
163700                                                                              
163800******************************************************                        
163805     MOVE 1                           TO W77-ID-NUMREG-PROC.                  
163810     MOVE 01                          TO W77-ID-ACTXX-MAPLI                   
163815                                         W77-ID-ACT01-MAPLI.                  
163820     MOVE "OPEN Y VALIDA BASE  "      TO W77-ID-NOMB-LIB.                     
163830     MOVE "PROCESO INICIO UNICA VEZ " TO W77-ID-TXTA-LIB.                     
163845     PERFORM 70099998-INIACT-MAPLI.                                           
163855******************************************************                        
163900     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
164100     ACCEPT  WKS-TIME-MAQ  FROM TIME.                                         
164300     PERFORM 00001000-INICIO-PROGRAMA.                                        
164500     PERFORM 40000000-TITLE-LIBRERIAS.                                        
164700     PERFORM 20000000-ABRE-BASE.                                              
164905                                                                              
164910******************************************************                        
164915     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
164920     MOVE " "                TO W77-ID-TXTA-LIB.                              
164925     PERFORM 70099998-ACT-REGPROC.                                            
164930                                                                              
164935     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
164940     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
165000                                                                              
165005******************************************************                        
165006     IF W77-REINICIO = 9                                                      
165007        MOVE 1 TO W77-ID-NUMREG-PROC                                          
165008     ELSE                                                                     
165010        MOVE 3  TO W77-ID-NUMDSET-MAPLI                                       
165015        MOVE 1  TO W77-ID-NUMBASE-MAPLI                                       
165020        PERFORM 70000600-REGS-EN-BASE                                         
165022        IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                  
165023           MOVE "REGS EN B03 " TO    W77-ERR-L035-DATO                        
165024           PERFORM 70099999-ERROR-MAPLI.                                      
165030                                                                              
165040     MOVE 02                        TO W77-ID-ACTXX-MAPLI                     
165045                                       W77-ID-ACT02-MAPLI.                    
165050     MOVE "CARGA SALDOS "           TO W77-ID-NOMB-LIB.                       
165060     MOVE "ACTUALIZA X CONTRATO "   TO W77-ID-TXTA-LIB.                       
165075     PERFORM 70099998-INIACT-MAPLI.                                           
165085******************************************************                        
165087     IF W77-REINICIO = 9                                                      
165089        MOVE W77-ID-ACT02-MAPLI    TO W77-ID-ACTXX-MAPLI                      
165091        MOVE " "                   TO W77-ID-TXTA-LIB                         
165093        MOVE " YA CORRIO P199   "  TO W77-ID-TXTA-LIB                         
165095        PERFORM 70099998-ACT-REGPROC                                          
165097     ELSE                                                                     
165100        PERFORM 50000000-PROCESO-PRINCIPAL.                                   
165200                                                                              
165210******************************************************                        
165220     MOVE W77-ID-ACT02-MAPLI TO W77-ID-ACTXX-MAPLI.                           
165230     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
165250                                                                              
165252     MOVE 1                   TO W77-ID-NUMREG-PROC.                          
165254     MOVE 03                  TO W77-ID-ACTXX-MAPLI                           
165256                                 W77-ID-ACT03-MAPLI.                          
165258     MOVE "ACT CTRL Y CLOSE " TO W77-ID-NOMB-LIB.                             
165262     MOVE "PROCESO FINAL  "   TO W77-ID-TXTA-LIB.                             
165268     PERFORM 70099998-INIACT-MAPLI.                                           
165270******************************************************                        
165280     IF W77-REINICIO = 9                                                      
165282        NEXT SENTENCE                                                         
165284     ELSE                                                                     
165300        PERFORM 59000000-ACTUALIZA-CONTROL.                                   
165500                                                                              
165700     PERFORM 70000000-FIN-PROGRAMA.                                           
165800                                                                              
165805******************************************************                        
165810     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
165815     MOVE " "                TO W77-ID-TXTA-LIB.                              
165820     PERFORM 70099998-ACT-REGPROC.                                            
165825                                                                              
165830     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
165835     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
165840                                                                              
165845     PERFORM 70000950-FIN-PGM-MAPLI.                                          
165850                                                                              
165855******************************************************                        
165900     STOP RUN.                                                                
166100                                                                              
166300********************************************************                      
166500 00001000-INICIO-PROGRAMA.                                                    
166700*=========================                                                    
166800                                                                              
166805********************************************************                      
166810     MOVE ZEROS     TO WKS-TB-NUMACT-LIBS.                                    
166815                                                                              
166820     MOVE 20        TO WKS-NUMACT-LIB(12).                                    
166825     MOVE 21        TO WKS-NUMACT-LIB(13).                                    
166830     MOVE 22        TO WKS-NUMACT-LIB(15).                                    
166835     MOVE 23        TO WKS-NUMACT-LIB(30).                                    
166840     MOVE 24        TO WKS-NUMACT-LIB(32).                                    
166845     MOVE 25        TO WKS-NUMACT-LIB(73).                                    
166850     MOVE 26        TO WKS-NUMACT-LIB(74).                                    
166855     MOVE 27        TO WKS-NUMACT-LIB(75).                                    
166860                                                                              
166865********************************************************                      
166900                                                                              
167100     PERFORM 00000000-CHANGE-SOPCOMS.                                         
167300     PERFORM 0000-CALL-HOSTNAME.                                              
167500     IF WS-DH-HOSTNAME-PBA OR WS-DH-HOSTNAME-UAT OR                           
167900        WS-DH-HOSTNAME-SIT                                                    
168700        MOVE 1 TO W77-ES-PRUEBA.                                              
168900                                                                              
169300     PERFORM 00002000-MENSAJE-HOSTNAME.                                       
169700                                                                              
171100                                                                              
171300                                                                              
171500                                                                              
171700                                                                              
171710                                                                              
171720     IF W77-ES-PRUEBA = 0                                                     
171730        IF WKS-TASKVALUE-PBA > 0                                              
171760           STRING  "EN PRODUCCION NO CORRE CON VALUE > 0 ",                   
171770                   " VALUE= ", WKS-TASKVALUE-PBA                              
171780             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
171790           PERFORM 70000050-MENSAJE                                           
171800           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
171900                                                                              
172100*************************************************************                 
172300 10009000-LLAMA-LOCSUP.                                                       
172500     PERFORM 20000006-LOCSUP.                                                 
172700                                                                              
172900     IF WS-S006-FUNCION > 0                                                   
173100        MOVE WS-S006-FORMATO  TO WS-MSG-N-02                                  
173300        MOVE WS-S006-FUNCION  TO WS-MSG-N-04                                  
173500        STRING "ERR CALL LOCSUP ",                                            
173700               " FUNC ", WS-MSG-N-04                                          
173900               " FMTO ", WS-MSG-N-02                                          
174100               " FEC1 ", WS-S006-FECHA1                                       
174300               " FEC2 ", WS-S006-FECHA2                                       
174500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
174700        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
174900        PERFORM 60001000-ESC-MENSAJE                                          
175100        PERFORM 70000050-MENSAJE                                              
175300        CALL SYSTEM DMTERMINATE.                                              
175500                                                                              
175700****************************************************************              
175900 20000000-ABRE-BASE.                                                          
176100*==================                                                           
176300                                                                              
176500     OPEN UPDATE S500BD01CAPTACION.                                           
176700     PERFORM 20002000-VALIDA-CONTROL.                                         
176900     PERFORM 20003000-INICIA-WORKING.                                         
176910                                                                              
176920     IF W77-REINICIO = 9                                                      
176930        NEXT SENTENCE                                                         
176940     ELSE                                                                     
176950        PERFORM 20000010-SUBE-B05.                                            
176960                                                                              
176970*******************************************************                       
176980 20000010-SUBE-B05.                                                           
177000                                                                              
177005     MOVE ZEROS              TO W77-IND-INST.                                 
177010     SET S500B05INSTRUMEN    TO BEGINNING.                                    
177020     PERFORM 20002000-CARGA-INSTRUMENTOS                                      
177030             UNTIL W77-EOF-INST = 1.                                          
177050     MOVE 1                  TO W77-IND-INST.                                 
178300                                                                              
178500     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
178700            OF MYSELF.                                                        
178900     ALLOW INTERRUPT.                                                         
179000                                                                              
179050**********************************************************                    
179100 20002000-CARGA-INSTRUMENTOS.                                                 
179105     PERFORM 90000005-B05INSTRUMEN-FINDN.                                     
179110     IF WS-STATUS-BASE = 0                                                    
179115        PERFORM 20002100-CARGA-INSTR                                          
179120     ELSE                                                                     
179125     IF WS-DB-NOTFOUND                                                        
179130        MOVE 1 TO W77-EOF-INST                                                
179135     ELSE                                                                     
179150       STRING "ERR B05FINDNEXT ", WS-STATUS-BASE                              
179155              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
179160       PERFORM 70000050-MENSAJE                                               
179165       CALL SYSTEM DMTERMINATE.                                               
179170                                                                              
179175************************************************************                  
179180 20002100-CARGA-INSTR.                                                        
179200     ADD  1                    TO W77-IND-INST.                               
179205     IF W77-IND-INST > 30                                                     
179220        MOVE "MAS DE 30 INST. EN LA BASE" TO WS-0101-TEXT-MSG                 
179225        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
179230        PERFORM 60001000-ESC-MENSAJE                                          
179235        PERFORM 70000050-MENSAJE                                              
179240        CALL SYSTEM DMTERMINATE.                                              
179245                                                                              
179250     MOVE B05-NUM-PRODUCTO TO WKS-TB-B05-PROD   (W77-IND-INST).               
179255     MOVE B05-NUM-INSTRUM  TO WKS-TB-B05-INST   (W77-IND-INST).               
179260     MOVE B05-MONEDA       TO WKS-TB-B05-MONEDA (W77-IND-INST).               
179262     MOVE B05-COMISIONES   TO WKS-TB-B05-COMISION(W77-IND-INST).              
179263                                                                              
179264     MOVE B05-SDOSINTEGRA(01)                                                 
179265       TO WKS-TB-B05-SDOSINTEG (W77-IND-INST,01).                             
179266     MOVE B05-SDOSINTEGRA(02)                                                 
179267       TO WKS-TB-B05-SDOSINTEG (W77-IND-INST,02).                             
179268                                                                              
179270     IF (B05-CLAVE-TARIF(06) > 0 AND                                          
179271         B05-CLAVE-COMIS(06) > 0)                                             
179273     OR (B05-CLAVE-TARIF(24) > 0 AND                                          
179275         B05-CLAVE-COMIS(24) > 0)                                             
179277     OR (B05-CLAVE-TARIF(25) > 0 AND                                          
179279         B05-CLAVE-COMIS(25) > 0)                                             
179281        MOVE 1              TO WKS-TB-B05-S050L190(W77-IND-INST)              
179283     ELSE                                                                     
179285        MOVE 0              TO WKS-TB-B05-S050L190(W77-IND-INST).             
179287                                                                              
179300     IF WKS-TB-B05-S050L190(W77-IND-INST) = 1                                 
179305        MOVE WKS-TB-B05-PROD    (W77-IND-INST)  TO WS-MSG-PRD                 
179310        MOVE WKS-TB-B05-INST    (W77-IND-INST)  TO WS-MSG-INST                
179315        MOVE WKS-TB-B05-MONEDA  (W77-IND-INST)  TO WS-MSG-MDA                 
179320        STRING "PROD LLAMA S050/L190 "                                        
179325               WS-MSG-PRD  "-"                                                
179330               WS-MSG-INST "-"                                                
179335               WS-MSG-MDA  " "                                                
179340               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
179345        PERFORM 60001000-ESC-MENSAJE.                                         
179380                                                                              
179385     IF WKS-TB-B05-SI-SDOSINTEG (W77-IND-INST,01) = 1                         
179390        MOVE WKS-TB-B05-PROD    (W77-IND-INST)  TO WS-MSG-PRD                 
179395        MOVE WKS-TB-B05-INST    (W77-IND-INST)  TO WS-MSG-INST                
179400        MOVE WKS-TB-B05-MONEDA  (W77-IND-INST)  TO WS-MSG-MDA                 
179405        MOVE 01                                 TO WS-MSG-PERS                
179410        STRING "PROD LLAMA S050/L301 "                                        
179415               WS-MSG-PRD  "-"                                                
179420               WS-MSG-INST "-"                                                
179425               WS-MSG-MDA  "-"                                                
179430               WS-MSG-PERS " (FISICAS)"                                       
179435               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
179440        PERFORM 60001000-ESC-MENSAJE.                                         
179445                                                                              
179450     IF WKS-TB-B05-SI-SDOSINTEG (W77-IND-INST,02) = 1                         
179455        MOVE WKS-TB-B05-PROD    (W77-IND-INST)  TO WS-MSG-PRD                 
179457        MOVE WKS-TB-B05-INST    (W77-IND-INST)  TO WS-MSG-INST                
179459        MOVE WKS-TB-B05-MONEDA  (W77-IND-INST)  TO WS-MSG-MDA                 
179461        MOVE 02                                 TO WS-MSG-PERS                
179463        STRING "PROD LLAMA S050/L301 "                                        
179465               WS-MSG-PRD  "-"                                                
179467               WS-MSG-INST "-"                                                
179469               WS-MSG-MDA  "-"                                                
179471               WS-MSG-PERS " (MORALES)"                                       
179473               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
179475        PERFORM 60001000-ESC-MENSAJE.                                         
179477                                                                              
179490**************************************************************                
179500 20002000-VALIDA-CONTROL.                                                     
179700*=======================                                                      
179900                                                                              
180100     PERFORM 90000002-B02CONTROL-FIND.                                        
180300     IF WS-STATUS-BASE > 0                                                    
180900        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
181100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
181300        PERFORM 70000050-MENSAJE                                              
181500        CALL SYSTEM DMTERMINATE.                                              
181700                                                                              
181900**** VALIDA QUE NO HAYA CORRIDO COMPLETO ESTE PASO ***********                
182100     IF B02-STA-OTRINV = 1                                                    
182700***     MOVE "YA CORRIO EL PASO P199" TO WS-0101-TEXT-MSG                     
182900***     PERFORM 70000050-MENSAJE                                              
183100        MOVE 9  TO W77-REINICIO                                               
183150     ELSE                                                                     
183200     IF B02-STA-OTRINV = 2                                                    
183250        MOVE 1  TO W77-REINICIO.                                              
183300                                                                              
183500     MOVE B02-NUM-CSI                 TO W77-MY-CSI.                          
183700     MOVE B02-FECHA-LOTE              TO WKS-FECHA-LOTE.                      
183900     MOVE WKS-DD-LOTE                 TO WKS-DD-FPRC-EDIT                     
184100     MOVE WKS-AA-LOTE                 TO WKS-AAAA-FPRC-EDIT.                  
184300     MOVE WKS-TB-MES-03 (WKS-MM-LOTE) TO WKS-MM-FPRC-EDIT.                    
184500     MOVE B02-FECHA-LINEA             TO WKS-FECHA-LINEA.                     
184700                                                                              
184900****************************************************************              
185100 20003000-INICIA-WORKING.                                                     
185300*========================                                                     
185400     MOVE ALL @00@                      TO WKS-TAB-INST.                      
185500                                                                              
185600                                                                              
185700     MOVE WKS-AAAA-MAQ                  TO WKS-AAAA-FMAQ-EDIT.                
185900     MOVE WKS-DD-MAQ                    TO WKS-DD-FMAQ-EDIT.                  
186100     MOVE WKS-TB-MES-03(WKS-MM-MAQ)     TO WKS-MM-FMAQ-EDIT.                  
186300                                                                              
186500     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO W77-NUM-MIX.                       
186700                                                                              
186900     MOVE W77-NUM-MIX                   TO WKS-TIT-R-MIX.                     
187100     MOVE W77-MY-CSI                    TO WKS-TIT-R-NODO.                    
187300     MOVE WKS-FECHA-LOTE                TO WKS-TIT-R-FEC.                     
187500                                                                              
187700     MOVE WKS-FECPROC-EDIT              TO WLI-R00-L01-FPROC.                 
187900     MOVE WKS-FECMAQ-EDIT               TO WLI-R00-L02-FMAQ.                  
188100     MOVE WKS-HH-TIME                   TO WLI-R00-L03-HH.                    
188110     MOVE WKS-MM-TIME                   TO WLI-R00-L03-MM.                    
188120     MOVE WKS-SS-TIME                   TO WLI-R00-L03-SS.                    
188300                                                                              
188500     IF W77-MY-CSI = 10                                                       
188700        MOVE "C.S.I. MEXICO"        TO WLI-R00-L05-NCSI                       
188900        MOVE 3084                   TO WLI-R00-L04-SUC                        
189100        MOVE "PYCP JARDINES"        TO WLI-R00-L05-NBSUC                      
189300     ELSE                                                                     
189500        MOVE "C.S.I. MONTERREY"     TO WLI-R00-L05-NCSI                       
189700        MOVE 3667                   TO WLI-R00-L04-SUC                        
189900        MOVE "CYSAU MTY CTROL PROD" TO WLI-R00-L05-NBSUC.                     
190100                                                                              
190300     MOVE " "                       TO WLI-R01-L06-DETALLE.                   
190310     MOVE " "                       TO WS-0101-TEXT-MSG.                      
190500                                                                              
190700     SET R01-MENSAJES   (USERBACKUPNAME) TO VALUE TRUE.                       
190900     MOVE "001MENSAJES"                  TO WKS-TIT-R-NAME                    
191100                                            WLI-R00-L01-NAME.                 
191300     SET  R01-MENSAJES  (TITLE)          TO WKS-TITULO-R00.                   
191500                                                                              
191700     OPEN OUTPUT   R01-MENSAJES.                                              
191720     MOVE 1 TO W77-OPEN-R01.                                                  
191900                                                                              
192100     MOVE WKS-FEC-MAQ-08      TO W77-FECHA-EDIT.                              
192300     MOVE WKS-HH-TIME         TO WKS-HRA-EDIT.                                
192310     MOVE WKS-MM-TIME         TO WKS-MIN-EDIT.                                
192320     MOVE WKS-SS-TIME         TO WKS-SEG-EDIT.                                
192330     MOVE WKS-DS-TIME         TO WKS-CSE-EDIT.                                
192500                                                                              
192600                                                                              
192610     IF W77-REINICIO = 9                                                      
192620        STRING "ESTE PASO YA CORRIO COMPLETO ANTES DE ",                      
192630               " FECHA: ", W77-FECHA-EDIT                                     
192640               " HORA:  ", WKS-HORA-EDIT                                      
192650               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
192660        PERFORM 60001000-ESC-MENSAJE                                          
192670     ELSE                                                                     
192672     IF W77-REINICIO = 1                                                      
192674        STRING "REINICIO PROGRAMA ",                                          
192676               " FECHA: ", W77-FECHA-EDIT                                     
192678               " HORA:  ", WKS-HORA-EDIT                                      
192680               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
192682        PERFORM 60001000-ESC-MENSAJE                                          
192684     ELSE                                                                     
192700        STRING "INICIO PROGRAMA ",                                            
192900               " FECHA: ", W77-FECHA-EDIT                                     
193100               " HORA:  ", WKS-HORA-EDIT                                      
193300               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
193500        PERFORM 60001000-ESC-MENSAJE.                                         
193700                                                                              
193900     MOVE W77-NUM-MIX   TO WS-MSG-N-08.                                       
194100                                                                              
194500     STRING "MIXNUMBER=", WS-MSG-N-08                                         
194700            " PROCESO EN ", WKS-MY-HOST,                                      
194800            " VALUE =", WKS-TASKVALUE-PBA                                     
194900            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
195100     PERFORM 60001000-ESC-MENSAJE.                                            
196300                                                                              
196320                                                                              
196340     IF W77-REINICIO = 9                                                      
196360        NEXT SENTENCE                                                         
196380     ELSE                                                                     
196400        PERFORM 20003010-CONT-INIWORK.                                        
196420                                                                              
196440**********************************************************                    
196460 20003010-CONT-INIWORK.                                                       
196500     PERFORM 20003015-FECHAS.                                                 
196520                                                                              
196540     DIVIDE WKS-AA-BATCH BY 4 GIVING W77-RS-DIV                               
196560            REMAINDER W77-BISIESTO.                                           
196580                                                                              
196600     IF W77-BISIESTO = 0                                                      
196620        MOVE 29  TO WKS-TAB-DIAS-MES(2)                                       
196640        STRING WKS-AA-BATCH " ES AµO BISIESTO (FEB 29 DIAS) "                 
196650          DELIMITED BY SIZE INTO WLI-R01-MENSAJE                              
196660        PERFORM 60001000-ESC-MENSAJE.                                         
196700                                                                              
196900*************************************************************                 
197100 20003015-FECHAS.                                                             
197110                                                                              
197120     MOVE WKS-FECHA-LINEA        TO W77-FECHA-EDIT.                           
197130     STRING "FECHA B02-FECHA-LINEA         ", W77-FECHA-EDIT                  
197140            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
197150     PERFORM 60001000-ESC-MENSAJE.                                            
197160                                                                              
197170     MOVE WKS-FECHA-LOTE         TO W77-FECHA-EDIT.                           
197180     STRING "FECHA B02-FECHA-LOTE          ", W77-FECHA-EDIT                  
197190            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
197200     PERFORM 60001000-ESC-MENSAJE.                                            
197210                                                                              
197300********  PIDE DIA HABIL ANTERIOR   ******************                        
197500     MOVE WKS-FECHA-LINEA        TO WS-S006-FECHA1.                           
197700     MOVE 1                      TO WS-S006-FECHA2.                           
197900     MOVE 12                     TO WS-S006-FORMATO.                          
198100     MOVE 15                     TO WS-S006-FUNCION.                          
198300     PERFORM 10009000-LLAMA-LOCSUP.                                           
198500     MOVE WS-S006-FECHA1         TO WKS-FEC-ANT.                              
198700                                                                              
198900     MOVE WKS-FEC-ANT            TO W77-FECHA-EDIT.                           
199100     STRING "DIA HABIL ANTERIOR FECH-LINEA ", W77-FECHA-EDIT                  
199300            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
199500     PERFORM 60001000-ESC-MENSAJE.                                            
199700                                                                              
199900********  PIDE DIA HABIL PROXIMO    ******************                        
200100     MOVE WKS-FECHA-LINEA        TO WS-S006-FECHA1.                           
200300     MOVE 1                      TO WS-S006-FECHA2.                           
200500     MOVE 12                     TO WS-S006-FORMATO.                          
200700     MOVE 13                     TO WS-S006-FUNCION.                          
200900     PERFORM 10009000-LLAMA-LOCSUP.                                           
201100     MOVE WS-S006-FECHA1      TO WKS-FEC-PROX.                                
201300                                                                              
201500     MOVE WKS-FEC-PROX           TO W77-FECHA-EDIT.                           
201700     STRING "DIA HABIL PROXIMO  FECH-LINEA ", W77-FECHA-EDIT                  
201900            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
202100     PERFORM 60001000-ESC-MENSAJE.                                            
202300                                                                              
202500*****  VALIDA FECHA LINEA MENSUAL      ***************                        
202700     IF WKS-FECHA-LOTE = WKS-FECHA-LINEA                                      
202720        MOVE WKS-FECHA-LINEA TO WKS-FECHA-BATCH                               
202900        IF WKS-MM-LINEA NOT = WKS-MM-PROX                                     
203100           STRING "FECH-LINEA ", WKS-FECHA-LINEA                              
203300                  " FECH-LOTE ",  WKS-FECHA-LOTE                              
203320                  " FECH-BATCH ", WKS-FECHA-BATCH                             
203330                  " FECH-PROX ",  WKS-FEC-PROX                                
203500                  " ES PROCESO MENSUAL (EN LINEA) "                           
203700                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
203900           MOVE 1           TO W77-ES-MENSUAL                                 
204100        ELSE                                                                  
204300           STRING "FECH-LINEA ", WKS-FECHA-LINEA                              
204500                  " FECH-LOTE ", WKS-FECHA-LOTE                               
204520                  " FECH-BATCH ", WKS-FECHA-BATCH                             
204530                  " FECH-PROX ",  WKS-FEC-PROX                                
204700                  " ES PROCESO DIARIO (EN LINEA) "                            
204900                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
205100           MOVE 0           TO W77-ES-MENSUAL                                 
205300     ELSE                                                                     
205500     IF WKS-FECHA-LOTE < WKS-FECHA-LINEA                                      
205520        MOVE WKS-FECHA-LOTE  TO WKS-FECHA-BATCH                               
205530        MOVE WKS-FECHA-LINEA TO WKS-FEC-PROX                                  
205700        IF WKS-MM-LOTE NOT = WKS-MM-LINEA                                     
205900           STRING "FECH-LINEA ", WKS-FECHA-LINEA                              
206100                  " FECH-LOTE=", WKS-FECHA-LOTE                               
206120                  " FECH-BATCH ", WKS-FECHA-BATCH                             
206130                  " FECH-PROX ",  WKS-FEC-PROX                                
206300                  " ES PROCESO MENSUAL (EN BATCH) "                           
206500                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
206700           MOVE 1           TO W77-ES-MENSUAL                                 
206900        ELSE                                                                  
207100           STRING "FECH-LINEA ", WKS-FECHA-LINEA                              
207300                  " FECH-LOTE ", WKS-FECHA-LOTE                               
207320                  " FECH-BATCH ", WKS-FECHA-BATCH                             
207330                  " FECH-PROX ",  WKS-FEC-PROX                                
207500                  " ES PROCESO DIARIO (EN BATCH) "                            
207700                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
207900           MOVE 0           TO W77-ES-MENSUAL                                 
208100     ELSE                                                                     
208300        STRING " B02-FECHA-LOTE " WKS-FECHA-LOTE                              
208500               " MAYOR QUE "                                                  
208700               " B02-FECHA-LINEA " WKS-FECHA-LINEA                            
208900               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
209100        MOVE 1           TO W77-ERROR-PROC.                                   
209300                                                                              
209500     PERFORM 60001000-ESC-MENSAJE.                                            
209510                                                                              
209520     IF W77-ERROR-PROC = 1                                                    
209550        MOVE " ERROR DE FECHAS EN S500B02CONTROL "                            
209552          TO WS-0101-TEXT-MSG                                                 
209560        MOVE WS-0101-TEXT-MSG        TO WLI-R01-MENSAJE                       
209570        PERFORM 60001000-ESC-MENSAJE                                          
209580        PERFORM 70000050-MENSAJE                                              
209590        CALL SYSTEM DMTERMINATE.                                              
209600                                                                              
209700                                                                              
215700                                                                              
215900                                                                              
216100                                                                              
216300**************************************************************                
216500 40000000-TITLE-LIBRERIAS.                                                    
216700*========================                                                     
216900                                                                              
217100*************************** LIBRERIA DE VERSIONES ***************             
217500     PERFORM 20000100-CHECAME-VERSION.                                        
217700     IF S000-CTR-CVEERROR < 0                                                 
218300        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
218900        PERFORM 70000050-MENSAJE                                              
219100        CALL SYSTEM DMTERMINATE.                                              
219300                                                                              
219500*************************** LIBRERIA DE FECHAS  *****************             
219700     PERFORM 10000006-LOCSUP.                                                 
219900                                                                              
220100*************************** LIBRERIA DE SALDOS EN S050     ******             
220200     IF W88-SIN-LB301                                                         
220220        NEXT SENTENCE                                                         
220250     ELSE                                                                     
220300        PERFORM 10000050-SALDOS.                                              
220320                                                                              
220325********** LIBRERIA DE CARGA DE CONSULTAS S050 *********                      
220370     IF W88-SIN-LB190                                                         
220372        NEXT SENTENCE                                                         
220374     ELSE                                                                     
220380        PERFORM 10000050-L190-COBCOM.                                         
220500                                                                              
221100                                                                              
221300****************************************************                          
225500 50000000-PROCESO-PRINCIPAL.                                                  
225700*===========================                                                  
226000                                                                              
226100     SET S500B03CONTRATOS    TO BEGINNING.                                    
226300     PERFORM 50003000-PROCESO  UNTIL W77-EOF-BASE = 1.                        
226500                                                                              
226520     STRING "CONTRATOS QUE HOY CORTAN = " W77-TOT-CORTES                      
226540            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
226560     PERFORM 60001000-ESC-MENSAJE.                                            
226580                                                                              
226600     STRING "CONTRATOS PARA SALDOS    = " W77-TOT-SALDOS                      
226620            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
226640     PERFORM 60001000-ESC-MENSAJE.                                            
226660                                                                              
226665     STRING "CONTRATOS PARA CONSULTAS = " W77-TOT-CONSULTAS                   
226670            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
226675     PERFORM 60001000-ESC-MENSAJE.                                            
226676                                                                              
226677     STRING "CONTRATOS PARA EXTENDED = " W77-TOT-EXTENDED                     
226678            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
226679     PERFORM 60001000-ESC-MENSAJE.                                            
226680                                                                              
226700***********************************************************                   
226900 50003000-PROCESO.                                                            
227100*===================                                                          
227200     MOVE ZERO TO W77-SI-CORTA  W77-SI-CONSULTAS                              
227210                  W77-SI-SALDOS W77-SI-PROCESO.                               
227300                                                                              
227500     PERFORM 50003100-LEE-CTO.                                                
229500                                                                              
229700     IF W77-EOF-BASE = 0                                                      
229720        IF W77-SI-PROCESO = 1                                                 
229800           PERFORM 50003010-BUSCA-PROCESOS.                                   
230315                                                                              
230320     IF W77-FIN-FORZADO = 1                                                   
230350        STRING "CONFIRME FIN FORZADO "                                        
230360               "TECLEE (SI) PARA TERMINAR "                                   
230370               "(NO) PARA CONTINUAR"                                          
230380               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
230390        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
230400        PERFORM 60001000-ESC-MENSAJE                                          
230410        PERFORM 70000050-MENSAJE                                              
230420        ACCEPT W77-SI-TERMINA                                                 
230430        IF W77-SI-TERMINA = "SI" OR "S " OR " S"                              
230440           MOVE 1                 TO W77-EOF-BASE                             
230443           MOVE "FIN FORZADO A SOLICITUD DE OPERACION "                       
230444             TO WLI-R01-MENSAJE                                               
230445           PERFORM 60001000-ESC-MENSAJE                                       
230450        ELSE                                                                  
230460           MOVE 0  TO W77-FIN-FORZADO.                                        
230500                                                                              
230600                                                                              
230605*** ACTUALIZA REGISTRO PROCESADO LIB/MAPLI     *******                        
230610     IF W77-EOF-BASE = 0                                                      
230615        MOVE W77-ID-ACT02-MAPLI    TO W77-ID-ACTXX-MAPLI                      
230620        MOVE " "                   TO W77-ID-TXTA-LIB                         
230625        MOVE B03-NUM-CONTRATO      TO WS-MSG-CTO                              
230630        STRING "CTOS LEIDOS B03 = "   W77-NUM-LEIDOS                          
230635                   " ULTIMO CTO = "   WS-MSG-CTO                              
230640               DELIMITED BY SIZE INTO W77-ID-TXTA-LIB                         
230645        PERFORM 70099998-ACT-REGPROC.                                         
230650                                                                              
230690*******************************************************                       
230700 50003010-BUSCA-PROCESOS.                                                     
230701     MOVE B03-NUM-PRODUCTO    TO WS-MSG-PRD.                                  
230702     MOVE B03-NUM-INSTRUM     TO WS-MSG-INST.                                 
230703     MOVE B03-MONEDA          TO WS-MSG-MDA.                                  
230704     MOVE B03-NUM-CONTRATO    TO WS-MSG-CTO.                                  
230705                                                                              
230710     IF B06-ID-S050 = 0                                                       
230715        IF W77-SI-SALDOS = 1                                                  
230717           PERFORM 50004000-CARGA-SDOS-OTRINV                                 
230720           IF W77-SI-CONSULTAS = 1                                            
230722              PERFORM 50005000-CARGA-CONSULTAS                                
230724           ELSE                                                               
230730              NEXT SENTENCE                                                   
230735        ELSE                                                                  
230740           PERFORM 50005000-CARGA-CONSULTAS                                   
230750     ELSE                                                                     
230755        PERFORM 60088000-SUMA-CARGA-ANT.                                      
230770                                                                              
230780     IF W77-SI-B06 = 1                                                        
230782        PERFORM 50008000-STORE-B06                                            
230784        MOVE ZERO TO W77-SI-B06.                                              
230790                                                                              
230800**********************************************************                    
230900 50003100-LEE-CTO.                                                            
231100*=================                                                            
231300                                                                              
231500     PERFORM 90000003-B03CONTRATOS-FINDN.                                     
231700     IF WS-STATUS-BASE > 0                                                    
231900        IF WS-DB-NOTFOUND                                                     
232100           MOVE 1 TO W77-EOF-BASE                                             
232300        ELSE                                                                  
232900           STRING "ERR FINDN B03CONTRATO ", WS-STATUS-BASE                    
233100                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
233110           MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                      
233120           PERFORM 60001000-ESC-MENSAJE                                       
233300           PERFORM 70000050-MENSAJE                                           
233500           CALL SYSTEM DMTERMINATE.                                           
233600                                                                              
233620     IF W77-EOF-BASE = 0                                                      
233622        IF B03-MARCA-CLON = 3                                                 
233624           ADD  1                   TO W77-NUM-LEIDOS                         
233626           ADD  1                   TO W77-TOT-EXTENDED                       
233628        ELSE                                                                  
233630        IF (B03-STATUS < 2 OR B03-STATUS = 5) AND                             
233730            B03-MIGR-S111 NOT = 1                                             
234300           ADD  1                   TO W77-NUM-LEIDOS                         
234600           MOVE B03-NUM-PRODUCTO    TO WS03-NUM-PRODUCTO                      
234620           MOVE B03-NUM-INSTRUM     TO WS03-NUM-INSTRUM                       
234630           MOVE B03-MONEDA          TO WS03-MONEDA                            
234640           MOVE B03-TIPO-PERSONA    TO WS03-TIPO-PERSONA                      
234700           IF NOT WS03-88-ES-AHORROS                                          
234740              PERFORM 50003110-VERIFICA-CORTE.                                
234750                                                                              
234760**********************************************************                    
234800 50003110-VERIFICA-CORTE.                                                     
234820     IF WS03-88-TP-GFISICA                                                    
234840        MOVE 1 TO  W77-IND-PERS                                               
234860     ELSE                                                                     
234880        MOVE 2 TO  W77-IND-PERS.                                              
234900                                                                              
235000     PERFORM 50003160-VALIDA-CORTE.                                           
235100     IF W77-SI-CORTA = 1                                                      
235110        ADD  1  TO W77-TOT-CORTES                                             
235120        MOVE 0  TO W77-NOHAY-B05                                              
235300        PERFORM 50003120-DAME-INST                                            
235700        IF W77-NOHAY-B05 = 0                                                  
235900           PERFORM 50003170-VALIDA-PROCESO                                    
236100           IF W77-SI-PROCESO = 1                                              
236300              PERFORM 50003200-DAME-HISTORICO.                                
237900                                                                              
238100*************************************************************                 
238200 50003120-DAME-INST.                                                          
238202     IF B03-NUM-PRODUCTO = WKS-TB-B05-PROD  (W77-IND-INST)                    
238204    AND B03-NUM-INSTRUM  = WKS-TB-B05-INST  (W77-IND-INST)                    
238206    AND B03-MONEDA       = WKS-TB-B05-MONEDA(W77-IND-INST)                    
238208        NEXT SENTENCE                                                         
238210     ELSE                                                                     
238212        PERFORM 50003125-DAME-IND                                             
238213         VARYING W77-IND-INST FROM 1 BY 1                                     
238214          UNTIL (W77-IND-INST > 30)                                           
238215          OR   (B03-NUM-PRODUCTO = WKS-TB-B05-PROD (W77-IND-INST)             
238216            AND B03-NUM-INSTRUM  = WKS-TB-B05-INST (W77-IND-INST)             
238217            AND B03-MONEDA = WKS-TB-B05-MONEDA(W77-IND-INST)).                
238218                                                                              
238219     IF W77-IND-INST > 30                                                     
238220        MOVE 1                 TO W77-IND-INST                                
238221        MOVE B03-NUM-PRODUCTO  TO WS-MSG-PRD                                  
238224        MOVE B03-NUM-INSTRUM   TO WS-MSG-INST                                 
238226        MOVE B03-MONEDA        TO WS-MSG-MDA                                  
238227        MOVE B03-NUM-CONTRATO  TO WS-MSG-CTO                                  
238228        STRING "NO EXISTE EN B05 "                                            
238230               WS-MSG-PRD  "-"                                                
238232               WS-MSG-INST "-"                                                
238234               WS-MSG-MDA  " "                                                
238236               WS-MSG-CTO                                                     
238238               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
238240        PERFORM 60001000-ESC-MENSAJE                                          
238250        MOVE 1 TO W77-NOHAY-B05.                                              
238260                                                                              
238300*****************************************************************             
238340 50003125-DAME-IND.                                                           
238345                                                                              
238400*****************************************************************             
238402 50003160-VALIDA-CORTE.                                                       
238404     IF B03-DIA-CORTE-ANT  > 0                                                
238406        MOVE B03-DIA-CORTE-ANT TO W77-DIA-CORTE                               
238408        PERFORM 50003160-ARMA-FEC-CORTE                                       
238410        MOVE WKS-FECHA-PTE   TO WKS-FECORTE-DANT                              
238412     ELSE                                                                     
238414        MOVE 99999999        TO WKS-FECORTE-DANT.                             
238416                                                                              
238418     MOVE B03-DIA-CORTE      TO W77-DIA-CORTE.                                
238420     PERFORM 50003160-ARMA-FEC-CORTE.                                         
238422     MOVE WKS-FECHA-PTE      TO WKS-FECORTE-DNVO.                             
238424                                                                              
238426     IF WKS-FECORTE-DANT < WKS-FECORTE-DNVO                                   
238428        MOVE WKS-FECORTE-DANT TO WKS-FECHA-PTE.                               
238430                                                                              
238432     IF WKS-FECHA-PTE = WKS-FECHA-BATCH                                       
238434        MOVE 1  TO W77-SI-CORTA                                               
238436     ELSE                                                                     
238438     IF WKS-FECHA-PTE > WKS-FECHA-BATCH AND < WKS-FEC-PROX                    
238440        MOVE 1  TO W77-SI-CORTA.                                              
238442                                                                              
238444*****************************************************************             
238446 50003160-ARMA-FEC-CORTE.                                                     
238448     MOVE WKS-AA-BATCH         TO WKS-AA-PTE.                                 
238450     MOVE WKS-MM-BATCH         TO WKS-MM-PTE.                                 
238452                                                                              
238454     IF W77-DIA-CORTE = 30                                                    
238456        MOVE WKS-TAB-DIAS-MES(WKS-MM-BATCH) TO WKS-DD-PTE                     
238458     ELSE                                                                     
238460        MOVE W77-DIA-CORTE   TO WKS-DD-PTE.                                   
238462                                                                              
238464     IF WKS-DD-PTE < WKS-DD-BATCH                                             
238466        ADD 1               TO WKS-MM-PTE                                     
238468        IF WKS-MM-PTE > 12                                                    
238470           MOVE 1           TO WKS-MM-PTE                                     
238472           ADD  1           TO WKS-AA-PTE.                                    
238474                                                                              
238490************************************************************                  
238500 50003170-VALIDA-PROCESO.                                                     
238510     IF WKS-TB-B05-SI-SDOSINTEG (W77-IND-INST,W77-IND-PERS) = 1               
238570        ADD  1   TO W77-TOT-SALDOS                                            
238575        MOVE 1   TO W77-SI-PROCESO                                            
238580        MOVE 1   TO W77-SI-SALDOS.                                            
238590                                                                              
238600     IF WKS-TB-B05-S050L190(W77-IND-INST) = 1                                 
238610        ADD  1   TO W77-TOT-CONSULTAS                                         
238615        MOVE 1   TO W77-SI-PROCESO                                            
238620        MOVE 1   TO W77-SI-CONSULTAS.                                         
238630                                                                              
238640**************************************************************                
238700 50003200-DAME-HISTORICO.                                                     
238800*=======================                                                      
238900                                                                              
239100     MOVE B03-NUM-CONTRATO           TO WS-NUM-CONTRATO.                      
239300     PERFORM 90000006-B06SXCTO-LOCK.                                          
239500     IF WS-STATUS-BASE > 0                                                    
240100        MOVE B03-NUM-CONTRATO        TO WS-MSG-CTO                            
240300        STRING "FALTA HISTORICO ", WS-MSG-CTO                                 
240500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
240700        PERFORM 70000050-MENSAJE                                              
240900        CALL SYSTEM DMTERMINATE.                                              
241100                                                                              
249900*******************************************************                       
250100 50004000-CARGA-SDOS-OTRINV.                                                  
250300*==========================                                                   
250320     IF W88-SIN-LB301                                                         
250340        MOVE ZERO TO WS-S016-0401-RESFON   WS-S016-0401-RESBINV               
250360                     WS-S016-0401-RESPINV  WS-S016-0401-RESCME                
250362        MOVE 1    TO B06-ID-S050                                              
250375        MOVE 1    TO W77-SI-B06                                               
250380     ELSE                                                                     
250400        PERFORM 50004010-CALL-SDOS-OTRINV.                                    
250420                                                                              
250440********************************************************                      
250460 50004010-CALL-SDOS-OTRINV.                                                   
250500                                                                              
250700     MOVE 1                   TO W77-NO-HAY-S050.                             
250900     MOVE B03-NUM-PRODUCTO    TO WS-S016-0401-NUMPROD.                        
251100     MOVE B03-NUM-INSTRUM     TO WS-S016-0401-NUMINST.                        
251300     MOVE B03-NUM-CONTRATO    TO WS-S016-0401-CTE.                            
251500     MOVE SPACES              TO WS-S016-0401-FILL.                           
251700                                                                              
253500                                                                              
253700     PERFORM 20000050-SALDOS.                                                 
253710     ADD  1   TO W77-NUM-CALLS.                                               
253900                                                                              
255100                                                                              
255220     PERFORM 50004050-CONT-SDOSOTRINV.                                        
255250                                                                              
255255****************************************************************              
255260 50004050-CONT-SDOSOTRINV.                                                    
255262*=========================                                                    
255300****************************************************************              
255500***  ACTIVA INDICADOR EN B06 POR CADA CONTRATO        **********              
255700***  PARA QUE EL PASO P130 NO LLAME LA LIB/S050/SDOS  **********              
255900****************************************************************              
256100     MOVE  1                     TO B06-ID-S050.                              
256200     MOVE  1                     TO W77-SI-B06.                               
256300                                                                              
256500****************************************************************              
256700** ACTUALIZA SALDOS DE INVERSION INTEGRAL (FONDOS)            **              
256900****************************************************************              
257100                                                                              
257300     IF WKS-TB-B05-USO-INVINTEGR (W77-IND-INST,W77-IND-PERS) > 0              
258700        IF WS-S016-0401-RESFON  = 1                                           
258900           MOVE WS-S016-0401-FONDOS   TO B06-SDOFONDOS                        
258910           ADD  WS-S016-0401-FONDOS   TO W77-IMP-FONDOS                       
259100           ADD  1                     TO W77-NUM-FONDOS                       
259300           MOVE ZERO                  TO W77-NO-HAY-S050                      
259500        ELSE                                                                  
259700        IF WS-S016-0401-RESFON  = 9                                           
259900           MOVE WS-S016-0401-RESFON  TO WS-MSG-RS                             
260500           STRING "ERR CALL S050/L301 ",                                      
260700                  "(RS)INV/INTEGRAL=", WS-MSG-RS,                             
260720                  " ID CTO",                                                  
260740                  " ", WS-MSG-PRD,                                            
260760                  "-", WS-MSG-INST,                                           
260780                  "-", WS-MSG-MDA,                                            
260800                  "-", WS-MSG-CTO                                             
260900                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
261100           MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                        
261300           PERFORM 60001000-ESC-MENSAJE                                       
261500           PERFORM 70000050-MENSAJE                                           
261700           MOVE 9  TO W77-ERROR-S050.                                         
261900                                                                              
262100***************************************************************               
262300**  ACTUALIZA SALDOS DE INVERSIONES (PATRIMONIAL)  BCAINV    **               
262500***************************************************************               
262700                                                                              
262900     IF WKS-TB-B05-USO-BCAINV (W77-IND-INST,W77-IND-PERS) > 0                 
264300        IF WS-S016-0401-RESBINV = 1                                           
264500           MOVE WS-S016-0401-BCAINV   TO B06-SDOBCAINV                        
264520           ADD  WS-S016-0401-BCAINV   TO W77-IMP-BCAINV                       
264700           ADD  1                     TO W77-NUM-BCAINV                       
264900           MOVE ZERO                  TO W77-NO-HAY-S050                      
265100        ELSE                                                                  
265300        IF WS-S016-0401-RESBINV = 9                                           
265500           MOVE WS-S016-0401-RESBINV TO WS-MSG-RS                             
266100           STRING "ERR CALL S050/L301 ",                                      
266300                  "(RS)BCA/INV=", WS-MSG-RS                                   
266320                  " ID CTO",                                                  
266340                  " ", WS-MSG-PRD,                                            
266360                  "-", WS-MSG-INST,                                           
266380                  "-", WS-MSG-MDA,                                            
266400                  "-", WS-MSG-CTO                                             
266500                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
266700           MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                        
266900           PERFORM 60001000-ESC-MENSAJE                                       
267100           PERFORM 70000050-MENSAJE                                           
267300           MOVE 9  TO W77-ERROR-S050.                                         
267500                                                                              
267700****************************************************************              
267900**  ACTUALIZA SALDOS DE INVERSIONES A PLAZO                   **              
268100****************************************************************              
268300                                                                              
268500     IF WKS-TB-B05-USO-INVPLAZO(W77-IND-INST,W77-IND-PERS) > 0                
269900        IF WS-S016-0401-RESPINV = 1                                           
270100           MOVE WS-S016-0401-PLAINV   TO B06-SDOINVPLA                        
270120           ADD  WS-S016-0401-PLAINV   TO W77-IMP-INVPLA                       
270300           ADD  1                     TO W77-NUM-INVPLA                       
270500           MOVE ZERO                  TO W77-NO-HAY-S050                      
270700        ELSE                                                                  
270900        IF WS-S016-0401-RESPINV = 9                                           
271100           MOVE WS-S016-0401-RESPINV TO WS-MSG-RS                             
271700           STRING "ERR CALL S050/L301 ",                                      
271900                  "(RS)INV/PLAZO=", WS-MSG-RS                                 
271920                  " ID CTO",                                                  
271940                  " ", WS-MSG-PRD,                                            
271960                  "-", WS-MSG-INST,                                           
271980                  "-", WS-MSG-MDA,                                            
272000                  "-", WS-MSG-CTO                                             
272100                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
272300           MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                        
272500           PERFORM 60001000-ESC-MENSAJE                                       
272700           PERFORM 70000050-MENSAJE                                           
272900           MOVE 9  TO W77-ERROR-S050.                                         
273100                                                                              
273300**************************************************************                
273500**  ACTUALIZA SALDOS DE INVERSIONES DE EMPRESARIAL (84-12)  **                
273700**  ACTUALIZA IDENTIFICADOR DE QUE ES CTA/MTA/EMPRESARIAL   **                
273900**************************************************************                
274100                                                                              
274300     IF WKS-TB-B05-USO-INVCPE(W77-IND-INST,W77-IND-PERS) > 0                  
274500        IF WS-S016-0401-RESCME = 1                                            
274700           MOVE WS-S016-0401-SDOCME    TO B06-SDO8412                         
274720           ADD  WS-S016-0401-SDOCME    TO W77-IMP-8412                        
274900           ADD  1                      TO W77-NUM-8412                        
275100           MOVE 1                      TO B06-ID-CME                          
275300           MOVE ZERO                   TO W77-NO-HAY-S050                     
275500        ELSE                                                                  
275700        IF WS-S016-0401-RESCME  = 9                                           
275900           MOVE WS-S016-0401-RESCME  TO WS-MSG-RS                             
276500           STRING "ERR CALL S050/L301 ",                                      
276700                  "(RS)INV/EMPRE=", WS-MSG-RS                                 
276720                  " ID CTO",                                                  
276740                  " ", WS-MSG-PRD,                                            
276760                  "-", WS-MSG-INST,                                           
276780                  "-", WS-MSG-MDA,                                            
276800                  "-", WS-MSG-CTO                                             
276900                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
277100           MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                        
277300           PERFORM 60001000-ESC-MENSAJE                                       
277500           PERFORM 70000050-MENSAJE                                           
277700           MOVE 9  TO W77-ERROR-S050.                                         
277900                                                                              
278100****************************************************************              
278300**  VALIDA SI EXISTE SALDO DE OTRAS INVERSIONES                               
278500****************************************************************              
278700                                                                              
278900     IF W77-NO-HAY-S050 = 1                                                   
279100        ADD 1  TO W77-NUM-NO-S050                                             
279300     ELSE                                                                     
279500        ADD 1  TO W77-NUM-SI-S050.                                            
279700                                                                              
279900****************************************************************              
280100** VALIDA ERROR FATAL EN EL LLAMADO DE LIB/S050/SALDOS        **              
280300****************************************************************              
280500                                                                              
280700     IF W77-ERROR-S050 = 9                                                    
281300        MOVE "PROBLEMAS CON LA LIB/S050/L301/SALDOS "                         
281500          TO WS-0101-TEXT-MSG                                                 
281700        MOVE WS-0101-TEXT-MSG     TO WLI-R01-MENSAJE                          
281900        PERFORM 60001000-ESC-MENSAJE                                          
282100        PERFORM 70000050-MENSAJE                                              
282300        MOVE "AVISAR A LOS RESPONSABLES DEL S050 Y S500 "                     
282500          TO WS-0101-TEXT-MSG                                                 
282700        MOVE WS-0101-TEXT-MSG     TO WLI-R01-MENSAJE                          
282900        PERFORM 60001000-ESC-MENSAJE                                          
283100        PERFORM 70000050-MENSAJE                                              
283300        CALL SYSTEM DMTERMINATE.                                              
283320                                                                              
283330*********************************************************                     
283332 50005000-CARGA-CONSULTAS.                                                    
283342     IF W88-SIN-LB190                                                         
283343        IF B06-ID-S050 = 0                                                    
283344           MOVE 1       TO W77-SI-B06                                         
283345           MOVE 1       TO B06-ID-S050                                        
283346        ELSE                                                                  
283347           NEXT SENTENCE                                                      
283352     ELSE                                                                     
283357        MOVE ZERO       TO W77-SW-S050L190                                    
283362        MOVE ZERO       TO W77-NUM-STOP                                       
283367        PERFORM 50005100-PIDE-CONSULTAS                                       
283382                UNTIL W77-SW-S050L190 = 1                                     
283384        PERFORM 50005200-ACTUALIZA-CONSULTA.                                  
283386                                                                              
283390******************************************************                        
283400  50005100-PIDE-CONSULTAS.                                                    
283402     MOVE ALL @00@            TO WS-S050-L190-PARAM-SALIDA.                   
283404     MOVE B03-NUM-PRODUCTO    TO WS-S050-L190-01-PROD.                        
283406     MOVE B03-NUM-INSTRUM     TO WS-S050-L190-01-INST.                        
283408     MOVE B03-NUM-CONTRATO    TO WS-S050-L190-01-CONTRATO.                    
283409     MOVE 1                   TO WS-S050-L190-01-PROCESO.                     
283410                                                                              
283430     PERFORM 20000050-L190-COBCOM.                                            
283444                                                                              
283446     ADD   1   TO W77-NUM-CALL-L190.                                          
283448                                                                              
283458     IF W88-S050-L190-RS-NO-DISP                                              
283460        ADD  1                            TO W77-NUM-STOP                     
283488        MOVE WS-S050-L190-01-RESULT       TO WS-MSG-N-02                      
283490        IF W77-NUM-STOP < 5                                                   
283498           STRING "BASE S050 NO DISPONIBLE RS=" WS-MSG-N-02                   
283518                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
283538           PERFORM 60001000-ESC-MENSAJE                                       
283540           WAIT(60)                                                           
283544        ELSE                                                                  
283549           STRING "BASE S050 NO DISPONIBLE RS=" WS-MSG-N-02                   
283554                  " OK PARA CONTINUAR, ",                                     
283559                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
283564           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
283569           PERFORM 60001000-ESC-MENSAJE                                       
283574           PERFORM 70000055-STOP-PGM                                          
283584           MOVE ZERO                    TO W77-NUM-STOP                       
283586           MOVE " CONTINUO EL PROCESO " TO WLI-R01-MENSAJE                    
283588           PERFORM 60001000-ESC-MENSAJE                                       
283590     ELSE                                                                     
283592       MOVE 1   TO W77-SW-S050L190.                                           
283594                                                                              
283600********************************************************                      
283605 50005200-ACTUALIZA-CONSULTA.                                                 
283610     IF B06-ID-S050 = 0                                                       
283614        MOVE 1       TO  W77-SI-B06                                           
283615        MOVE 1       TO  B06-ID-S050.                                         
283620                                                                              
283625     IF W88-S050-L190-RS-OK                                                   
283626        MOVE 1                            TO W77-SI-B06                       
283630        MOVE WS-S050-L190-01-CONTADOR(01) TO B06-CONT-COMIS(12)               
283632        MOVE WS-S050-L190-01-CONTADOR(02) TO B06-CONT-COMIS(13)               
283634        MOVE WS-S050-L190-01-CONTADOR(06) TO B06-CONT-COMIS(06)               
283640        ADD  1                            TO W77-HAY-CONSULTA                 
283645     ELSE                                                                     
283650     IF W88-S050-L190-RS-NO-INF                                               
283655        NEXT SENTENCE                                                         
283660     ELSE                                                                     
283665        MOVE WS-S050-L190-01-RESULT TO WS-MSG-RS                              
283685        STRING "ERR CALL S050/L190 RS=" WS-MSG-RS                             
283690               " ID CTO",                                                     
283692               " ", WS-MSG-PRD,                                               
283694               "-", WS-MSG-INST,                                              
283696               "-", WS-MSG-MDA,                                               
283698               "-", WS-MSG-CTO                                                
283700               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
283705        PERFORM 60001000-ESC-MENSAJE.                                         
283770                                                                              
283990*********************************************************                     
284000 50008000-STORE-B06.                                                          
284100*===================                                                          
284600     PERFORM 90000000-BEGIN-TRANSACTION.                                      
284700                                                                              
284900     PERFORM 90000006-B06HISTORICO-STORE.                                     
285100     IF WS-STATUS-BASE > 0                                                    
285700        MOVE WS-NUM-CONTRATO   TO WS-MSG-CTO                                  
285900        STRING "ERROR STORE B06HISTORICO ", WS-STATUS-BASE,                   
286100               " CTO ", WS-MSG-CTO                                            
286300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
286500        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
286700        PERFORM 60001000-ESC-MENSAJE                                          
286900        PERFORM 70000050-MENSAJE                                              
287300        CALL SYSTEM DMTERMINATE.                                              
287500                                                                              
287700     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
287900                                                                              
288100************************************************************                  
288300 59000000-ACTUALIZA-CONTROL.                                                  
288500*===========================                                                  
288700********* YA NO RECIVE HI (INTERRUPT) *********                               
288800     DISALLOW  INTERRUPT.                                                     
288850                                                                              
288900************************************************************                  
289100**  ENCIENDE  INDICADOR DE CORRIDA DEL PASO P199          **                  
289110**  B02-STA-OTRINV = 1 PROCESO COMPLETO                   **                  
289112**  B02-STA-OTRINV = 2 PROCESO INCOMPLETO (FORZADO)       **                  
289300************************************************************                  
289500                                                                              
289700     PERFORM 90000002-B02CONTROL-LOCK.                                        
289900     IF WS-STATUS-BASE > 0                                                    
290500        STRING "ERR LOCK B02CONTROL ", WS-STATUS-BASE                         
290700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
290900        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
291100        PERFORM 60001000-ESC-MENSAJE                                          
291300        PERFORM 70000050-MENSAJE                                              
291500        CALL SYSTEM DMTERMINATE.                                              
291700                                                                              
291800     IF W77-FIN-FORZADO = 1                                                   
291900        MOVE 2                 TO B02-STA-OTRINV                              
291950     ELSE                                                                     
292000        MOVE 1                 TO B02-STA-OTRINV.                             
292100                                                                              
292300     PERFORM 90000000-BEGIN-TRANSACTION.                                      
292500                                                                              
292700     PERFORM 90000002-B02CONTROL-STORE                                        
292900     IF WS-STATUS-BASE > 0                                                    
293500        STRING "ERR STORE FINAL B02CONTROL ", WS-STATUS-BASE                  
293700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
293900        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
294100        PERFORM 60001000-ESC-MENSAJE                                          
294300        PERFORM 70000050-MENSAJE                                              
294500        CALL SYSTEM DMTERMINATE.                                              
294700                                                                              
294900     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
295100                                                                              
295300********************************************************                      
295500 60001000-ESC-MENSAJE.                                                        
295700*=====================                                                        
295900     IF W77-OPEN-R01 = 1                                                      
296100        ACCEPT WKS-TIME-R01   FROM TIME                                       
296110        MOVE WKS-HH-TIME-R01  TO WKS-HRA-EDIT                                 
296112        MOVE WKS-MM-TIME-R01  TO WKS-MIN-EDIT                                 
296114        MOVE WKS-SS-TIME-R01  TO WKS-SEG-EDIT                                 
296116        MOVE WKS-DS-TIME-R01  TO WKS-CSE-EDIT                                 
296300        MOVE WKS-HORA-EDIT    TO WLI-R01-HORA                                 
296500                                                                              
296700        ADD 1 TO W77-R01-NLIN                                                 
296900        IF W77-R01-NLIN > 59                                                  
297100           PERFORM 60002000-ENCA-MENSAJES.                                    
297300                                                                              
297400     IF W77-OPEN-R01 = 1                                                      
297500        WRITE R01-L00-MENSAJE FROM WLI-R01-L06-DETALLE AFTER 1.               
297520                                                                              
297700     MOVE " "  TO WLI-R01-L06-DETALLE.                                        
297900                                                                              
298100*****************************************************************             
298300 60002000-ENCA-MENSAJES.                                                      
298500*======================                                                       
298700                                                                              
298900     ADD 1                        TO W77-R01-NPAG.                            
299100     MOVE W77-R01-NPAG            TO WLI-R00-L03-NPAG.                        
299300                                                                              
299500     WRITE R01-L00-MENSAJE    FROM WLI-R00-L01-ENCA AFTER PAGE.               
299700     WRITE R01-L00-MENSAJE    FROM WLI-R00-L02-ENCA AFTER 1.                  
299900     WRITE R01-L00-MENSAJE    FROM WLI-R00-L03-ENCA AFTER 1.                  
300100     WRITE R01-L00-MENSAJE    FROM WLI-R00-L04-ENCA AFTER 1.                  
300300     WRITE R01-L00-MENSAJE    FROM WLI-R00-L05-ENCA AFTER 1.                  
300500     MOVE " "                 TO R01-L00-MENSAJE.                             
300700     WRITE R01-L00-MENSAJE                          AFTER 1.                  
300900     MOVE 7 TO W77-R01-NLIN.                                                  
301100                                                                              
301300****************************************************                          
312364 60088000-SUMA-CARGA-ANT.                                                     
312365     ADD  1  TO W77-CARGA-ANT.                                                
312366                                                                              
312367     IF W77-SI-SALDOS = 1                                                     
312368        PERFORM 60088005-SUMA-L301-ANT.                                       
312374                                                                              
312380     IF W77-SI-CONSULTAS = 1                                                  
312386        PERFORM 60088010-SUMA-L190-ANT.                                       
312388                                                                              
312400*********************************************                                 
312410 60088005-SUMA-L301-ANT.                                                      
312420     IF B06-SDOFONDOS > 0                                                     
312430        ADD 1              TO W77-NUM-FONDOS-A                                
312440        ADD B06-SDOFONDOS  TO W77-IMP-FONDOS-A.                               
312450                                                                              
312460     IF B06-SDOBCAINV > 0                                                     
312470        ADD 1              TO W77-NUM-BCAINV-A                                
312480        ADD B06-SDOBCAINV  TO W77-IMP-BCAINV-A.                               
312490                                                                              
312500     IF B06-SDOINVPLA > 0                                                     
312510        ADD 1              TO W77-NUM-INVPLA-A                                
312520        ADD B06-SDOINVPLA  TO W77-IMP-INVPLA-A.                               
312530                                                                              
312540     IF B06-SDO8412 > 0                                                       
312550        ADD 1              TO W77-NUM-8412-A                                  
312560        ADD B06-SDO8412    TO W77-IMP-8412-A.                                 
312570                                                                              
312580************************************************************                  
312590 60088010-SUMA-L190-ANT.                                                      
312600     IF B06-CONT-COMIS(12) > 0                                                
312610     OR B06-CONT-COMIS(13) > 0                                                
312620     OR B06-CONT-COMIS(06) > 0                                                
312630        ADD 1              TO W77-HAY-CONSULTA-A.                             
312640                                                                              
312660***********************************************************                   
312700                                                                              
312800                                                                              
312900************************************************************                  
313100 70000000-FIN-PROGRAMA.                                                       
313300*=====================                                                        
313500                                                                              
313700     PERFORM 70002000-CIERRA-BASE.                                            
313702                                                                              
313704     IF W77-REINICIO = 9                                                      
313706        PERFORM 70002020-CIERRA-R01                                           
313708     ELSE                                                                     
313710        PERFORM 70002010-RESUMEN-R01                                          
313712        PERFORM 70002020-CIERRA-R01.                                          
313714                                                                              
313716**********************************************                                
313718 70002010-RESUMEN-R01.                                                        
313720                                                                              
313740     PERFORM 60001000-ESC-MENSAJE.                                            
313760     MOVE "RESULTADO DE ESTA CARGA " TO WLI-R01-MENSAJE                       
313780     PERFORM 60001000-ESC-MENSAJE.                                            
313900                                                                              
313920     MOVE W77-NUM-FONDOS          TO WKS-NUME-TTEST.                          
313940     MOVE W77-IMP-FONDOS          TO WKS-IMPO-TTEST.                          
313960     MOVE "TOTAL FONDOS   "       TO WKS-TIPO-TTEST.                          
313980     MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE.                         
314000     PERFORM 60001000-ESC-MENSAJE.                                            
314100                                                                              
314120     MOVE W77-NUM-BCAINV          TO WKS-NUME-TTEST.                          
314140     MOVE W77-IMP-BCAINV          TO WKS-IMPO-TTEST.                          
314160     MOVE "TOTAL BCAINV   "       TO WKS-TIPO-TTEST.                          
314180     MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE.                         
314200     PERFORM 60001000-ESC-MENSAJE.                                            
314300                                                                              
314320     MOVE W77-NUM-INVPLA          TO WKS-NUME-TTEST.                          
314340     MOVE W77-IMP-INVPLA          TO WKS-IMPO-TTEST.                          
314360     MOVE "TOTAL INVPLAZO "       TO WKS-TIPO-TTEST.                          
314380     MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE.                         
314400     PERFORM 60001000-ESC-MENSAJE.                                            
314500                                                                              
314520     MOVE W77-NUM-8412            TO WKS-NUME-TTEST.                          
314540     MOVE W77-IMP-8412            TO WKS-IMPO-TTEST.                          
314560     MOVE "TOTAL C.M.E.   "       TO WKS-TIPO-TTEST.                          
314580     MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE.                         
314600     PERFORM 60001000-ESC-MENSAJE.                                            
314602                                                                              
314603*******  PARA INCLUIR TOTALES POR REINICIO DEL PASO *****                     
314604     IF W77-NUM-FONDOS-A > 0                                                  
314606     OR W77-NUM-BCAINV-A > 0                                                  
314608     OR W77-NUM-INVPLA-A > 0                                                  
314610     OR W77-NUM-8412-A   > 0                                                  
314612        PERFORM 60001000-ESC-MENSAJE                                          
314614        MOVE "RESULTADO CARGA ANTERIOR " TO WLI-R01-MENSAJE                   
314616        PERFORM 60001000-ESC-MENSAJE                                          
314617                                                                              
314620        MOVE W77-NUM-FONDOS-A        TO WKS-NUME-TTEST                        
314622        MOVE W77-IMP-FONDOS-A        TO WKS-IMPO-TTEST                        
314624        MOVE "ANTERIOR FONDOS"       TO WKS-TIPO-TTEST                        
314626        MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE                       
314628        PERFORM 60001000-ESC-MENSAJE                                          
314630                                                                              
314632        MOVE W77-NUM-BCAINV-A        TO WKS-NUME-TTEST                        
314634        MOVE W77-IMP-BCAINV-A        TO WKS-IMPO-TTEST                        
314636        MOVE "ANTERIOR BCAINV"       TO WKS-TIPO-TTEST                        
314638        MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE                       
314640        PERFORM 60001000-ESC-MENSAJE                                          
314642                                                                              
314644        MOVE W77-NUM-INVPLA-A        TO WKS-NUME-TTEST                        
314646        MOVE W77-IMP-INVPLA-A        TO WKS-IMPO-TTEST                        
314648        MOVE "ANTERIOR INVPLA"       TO WKS-TIPO-TTEST                        
314650        MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE                       
314652        PERFORM 60001000-ESC-MENSAJE                                          
314654                                                                              
314656        MOVE W77-NUM-8412-A          TO WKS-NUME-TTEST                        
314658        MOVE W77-IMP-8412-A          TO WKS-IMPO-TTEST                        
314660        MOVE "ANTERIOR C.M.E."       TO WKS-TIPO-TTEST                        
314662        MOVE WKS-TOTAL-ESTAD         TO WLI-R01-MENSAJE                       
314664        PERFORM 60001000-ESC-MENSAJE.                                         
314670*****                                                                         
315300                                                                              
315320     PERFORM 60001000-ESC-MENSAJE.                                            
315340     MOVE "* ESTADISTICO GLOBAL "   TO WLI-R01-MENSAJE                        
315360     PERFORM 60001000-ESC-MENSAJE.                                            
315380                                                                              
315500     STRING "CTOS LEIDOS=", W77-NUM-LEIDOS                                    
315700            " CALLS S050=", W77-NUM-CALLS                                     
315900            " SI EN S050=", W77-NUM-SI-S050                                   
316100            " NO EN S050=", W77-NUM-NO-S050                                   
316110            " CARGA ANT=",  W77-CARGA-ANT                                     
316300             DELIMITED BY SIZE INTO WLI-R01-MENSAJE                           
316500     PERFORM 60001000-ESC-MENSAJE.                                            
316520                                                                              
316540     STRING "CALL   L190=", W77-NUM-CALL-L190                                 
316560            " CON CONSULTA=",W77-HAY-CONSULTA                                 
316562            " CARGA ANT=", W77-HAY-CONSULTA-A                                 
316580            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
316600     PERFORM 60001000-ESC-MENSAJE.                                            
316700                                                                              
317500     IF W77-NUM-FONDOS = 0                                                    
317900        MOVE "NO ACTUALIZO SDOS FONDOS" TO WLI-R01-MENSAJE                    
318300        PERFORM 60001000-ESC-MENSAJE.                                         
318700                                                                              
318900     IF W77-NUM-BCAINV = 0                                                    
319300        MOVE "NO ACTUALIZO SDOS BCAINV" TO WLI-R01-MENSAJE                    
319700        PERFORM 60001000-ESC-MENSAJE.                                         
320100                                                                              
320300     IF W77-NUM-INVPLA = 0                                                    
320700        MOVE "NO ACTUALIZO SDOS INVPLA" TO WLI-R01-MENSAJE                    
321100        PERFORM 60001000-ESC-MENSAJE.                                         
321500                                                                              
321700     IF W77-NUM-8412 = 0                                                      
322100        MOVE "NO ACTUALIZO SDOS CME   " TO WLI-R01-MENSAJE                    
322500        PERFORM 60001000-ESC-MENSAJE.                                         
324700                                                                              
324800**********************************************************                    
324850 70002020-CIERRA-R01.                                                         
324900     ACCEPT WKS-TIME-MAQ             FROM TIME.                               
325100     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
325300                                                                              
325500     MOVE WKS-FEC-MAQ-08      TO W77-FECHA-EDIT                               
325700     MOVE WKS-HH-TIME         TO WKS-HRA-EDIT.                                
325710     MOVE WKS-MM-TIME         TO WKS-MIN-EDIT.                                
325720     MOVE WKS-SS-TIME         TO WKS-SEG-EDIT.                                
325730     MOVE WKS-DS-TIME         TO WKS-CSE-EDIT.                                
325735                                                                              
325740     IF W77-REINICIO = 9                                                      
325745        STRING "SIN PROCESO, YA HABIA CORRIDO ",                              
325750               "  FECHA: ",  W77-FECHA-EDIT,                                  
325755               "  HORA: ",   WKS-HORA-EDIT                                    
325760               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
325765        PERFORM 60001000-ESC-MENSAJE                                          
325800     ELSE                                                                     
325810     IF W77-FIN-FORZADO = 1                                                   
325820        STRING "FIN FORZADO DEL PROCESO ",                                    
325830               "  FECHA: ",  W77-FECHA-EDIT,                                  
325840               "  HORA: ",   WKS-HORA-EDIT                                    
325850               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
325860        PERFORM 60001000-ESC-MENSAJE                                          
325870     ELSE                                                                     
325900        STRING "FIN NORMAL DEL PROCESO ",                                     
326100               "  FECHA: ",  W77-FECHA-EDIT,                                  
326300               "  HORA: ",   WKS-HORA-EDIT                                    
326500               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
326700        PERFORM 60001000-ESC-MENSAJE.                                         
326900                                                                              
327100     MOVE "            *****  FIN DE REPORTE ******"                          
327300       TO WLI-R01-MENSAJE                                                     
327500     PERFORM 60001000-ESC-MENSAJE.                                            
327700                                                                              
327900     CLOSE R01-MENSAJES WITH SAVE.                                            
327920     MOVE 0 TO W77-OPEN-R01.                                                  
328100                                                                              
329100                                                                              
329300**********************************************************                    
334500*************************************************************                 
334700 70002000-CIERRA-BASE.                                                        
334900*====================                                                         
335100                                                                              
335300     CLOSE S500BD01CAPTACION.                                                 
335350                                                                              
335390************************************************************                  
335400 70099998-INIACT-MAPLI.                                                       
335405     PERFORM 70000910-INIACT-MAPLI.                                           
335410     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
335411        STRING "INICIO ACT =" W77-ID-ACTXX-MAPLI                              
335412          DELIMITED BY SIZE INTO W77-ERR-L035-DATO                            
335415        PERFORM 70099999-ERROR-MAPLI.                                         
335420                                                                              
335425************************************************************                  
335430 70099998-ACT-REGPROC.                                                        
335435     PERFORM 70000950-ACT-REGPROC.                                            
335440     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
335442        STRING "SUMA REGS ACT =" W77-ID-ACTXX-MAPLI                           
335444          DELIMITED BY SIZE INTO W77-ERR-L035-DATO                            
335445        PERFORM 70099999-ERROR-MAPLI.                                         
335450                                                                              
335455***********************************************************                   
335460 70099998-FIN-ACTI-MAPLI.                                                     
335465     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
335470     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
335472        STRING "FIN ACT =" W77-ID-ACTXX-MAPLI                                 
335474          DELIMITED BY SIZE INTO W77-ERR-L035-DATO                            
335475        PERFORM 70099999-ERROR-MAPLI.                                         
335480                                                                              
335485***********************************************************                   
335500                                                                              
335600                                                                              
335700*****************************************************                         
335800 70099999-ERROR-MAPLI.                                                        
335802     IF W77-OPEN-R01 = 1                                                      
335805        MOVE 1                   TO W77-ERR-L035-MAPLI                        
335810        MOVE WS-S038L035-RESULT  TO WS-MSG-RS                                 
335820        STRING "ERROR LIB/MAPLI "  WS-MSG-RS                                  
335830               " SUSPENDO MONITOREO "                                         
335840               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
335850        PERFORM 60001000-ESC-MENSAJE                                          
335852        STRING "CALL S038L035 " W77-ERR-L035-DATO                             
335854               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
335856        PERFORM 60001000-ESC-MENSAJE                                          
335858        MOVE " " TO W77-ERR-L035-DATO.                                        
335860                                                                              
335870*****************************************************                         
335872 00002000-MENSAJE-HOSTNAME.                                                   
335874*=================================                                            
335876   IF WS-DH-HOSTNAME-PBA                                                      
335878      STRING "HOSTNAME DE EJECUCION = " WS-DH-NOM-EQUIPO                      
335880          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
335882      PERFORM 70000050-MENSAJE.                                               
335884                                                                              
335900                                                                              
336100 COPY "S500/INC/PRO/25MTP002".                                                
336200 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
336300****************************************************                          
