100100****************************************************************              
100300* FRAUDLINK                                                    *              
100500* PARA GENERAR ARCHIVO PARA S711 DE MOVIMIENTOS CON CLAVE 2001 *              
100700* 2444,2496, SE GENERA DESDE S500B07MOVDIA Y S500B13MOVCVES    *              
100900*                                                              *              
101100****************************************************************              
101300$SET LIST$                                                                    
101500$SUPRESS                                                                      
101900$SET ERRORLIST                                                                
102100$SET LIST STACK  LINEINFO FREE                                                
102300$ERRORLIMIT = 1000                                                            
102500************************************************                              
102700$SET S100VERSIONES  S000LIBLJ                                                 
102900                                                                              
103100$SET BDB02R01                                                                 
103300$SET BDB07R02                                                                 
103500$SET BDB13R06                                                                 
103700                                                                              
103900                                                                              
104100*****************************************                                     
104300 IDENTIFICATION DIVISION.                                                     
104500 PROGRAM-ID.    P103.                                                         
104700 AUTHOR.        JOSE LUIS IBARRA LARA.                                        
104900 DATE-WRITTEN.  JUL/2005.                                                     
105100 INSTALLATION.  BANCO NACIONAL DE MEXICO, S.N.C.                              
105300 SECURITY.                                                                    
105500                                                                              
105700******************************************************************            
105900 ENVIRONMENT DIVISION.                                                        
106100 CONFIGURATION SECTION.                                                       
106300 SOURCE-COMPUTER.                                                             
106500 OBJECT-COMPUTER.                                                             
106700******************************************************************            
106900 INPUT-OUTPUT SECTION.                                                        
107100******************************************************************            
107300 FILE-CONTROL.                                                                
107500      SELECT E03-CVES2001   ASSIGN TO DISK.                                   
107700                                                                              
107900******************************************************************            
108100 DATA DIVISION.                                                               
108300 FILE SECTION.                                                                
108500******************************************************************            
108700 FD E03-CVES2001                                                              
108900    BLOCK   CONTAINS 540 RECORDS                                              
109100    RECORD  CONTAINS  60 CHARACTERS                                           
109300    VALUE OF                                                                  
109500            AREAS        IS 1000                                              
109700            AREASIZE     IS 2700                                              
109900            SECURITYTYPE IS PUBLIC                                            
110100            TITLE        IS WKS-TIT-E03-CVES.                                 
110300                                                                              
110500 01 REG-E03-CVES         PIC X(60).                                           
110700                                                                              
110900                                                                              
111100                                                                              
111300******************************************************                        
111500                                                                              
111700 DATA-BASE SECTION.                                                           
111900 DB S500BD01CAPTACION.                                                        
112100 01 S500B02CONTROL.                                                           
112300 01 S500B07MOVDIA.                                                            
112500 01 S500B13MOVCVES.                                                           
112700                                                                              
112900***********************************************************                   
113100 WORKING-STORAGE SECTION.                                                     
113300 77  W77-EOF-B07       PIC 9     VALUE 0.                                     
113500 77  W77-MY-CSI        PIC 99.                                                
113700 77  W77-IND-B07       PIC 99.                                                
113900 77  W77-IND-B13       PIC 99.                                                
114100 77  W77-SIN-B13       PIC 9     VALUE 0.                                     
114500                                                                              
114700                                                                              
114900                                                                              
115100***********************************************************                   
115300 01 WKS-TIT-E03-CVES.                                                         
115500    02 FILLER                PIC X(25) VALUE                                  
115700                            "S500/FILE/S711/FRAUDLINK/".                      
115900    02 WKS-TIT-E03-CSI       PIC 9(02).                                       
116100    02 FILLER                PIC X(01) VALUE "/".                             
116300    02 WKS-TIT-E03-FECH      PIC 9(08).                                       
116500    02 FILLER                PIC X(01) VALUE ".".                             
116700                                                                              
116900************************************************************                  
117100 01  WKS-E03-HEADER.                                                          
117300     02 FILLER         PIC X(01) VALUE "1".                                   
117500     02 FILLER         PIC X(04) VALUE "S500".                                
117700     02 FILLER         PIC X(04) VALUE "S711".                                
117900     02 WKS-HEAD-CSI   PIC 9(02).                                             
118100     02 FILLER         PIC X     VALUE " ".                                   
118300     02 WKS-HEAD-FECH  PIC 9(08).                                             
118500     02 FILLER         PIC X(40) VALUE " ".                                   
118700                                                                              
118900**********************************************************                    
119100 01 WKS-REG-E03-CVES.                                                         
119200    02 WKS-REG-E03-TPO        PIC 9(01).                                      
119300    02 WKS-REG-E03-BCO        PIC 9(04).                                      
119500    02 WKS-REG-E03-SUC-OPE    PIC 9(04).                                      
119700    02 WKS-REG-E03-CHQRA      PIC 9(16).                                      
119900    02 WKS-REG-E03-CVE        PIC 9(04).                                      
120100    02 WKS-REG-E03-FECHA      PIC 9(08).                                      
120300    02 WKS-REG-E03-IMPORTE    PIC 9(11)V99.                                   
120500    02 WKS-REG-E03-REFNUM     PIC 9(10).                                      
120700                                                                              
120900**********************************************************                    
121100 01  WKS-E03-TRAILER.                                                         
121300     02 FILLER         PIC X(01)    VALUE "9".                                
121500     02 WKS-NUM-REG    PIC 9(08)    VALUE 0.                                  
121700     02 WKS-IMP-TOT    PIC 9(12)V99 VALUE 0.                                  
121900     02 FILLER         PIC X(37)    VALUE " ".                                
122100                                                                              
122300**********************************************************                    
122500 01 WS-FECHA-MOV        PIC 9(08).                                            
122700 01 WS-FECHA-MOV-AMD REDEFINES WS-FECHA-MOV.                                  
122900    02 WS-FECHA-AA      PIC 9(04).                                            
123100    02 WS-FECHA-MM      PIC 9(02).                                            
123300    02 WS-FECHA-DD      PIC 9(02).                                            
123500                                                                              
123700                                                                              
123900 01 WKS-AUTORIZ-MOV     PIC 9(14) COMP.                                       
124100 01 RD-WKS-AUTORIZ-MOV  REDEFINES WKS-AUTORIZ-MOV.                            
124300    02 WKS-SUC-OPE      PIC 9(04) COMP.                                       
124500    02 WKS-CAJ-OPE      PIC 9(02) COMP.                                       
124700    02 WKS-SEQ-OPE      PIC 9(08) COMP.                                       
124900                                                                              
125100                                                                              
125300                                                                              
125500                                                                              
125700************************************************************                  
125900 COPY "S500/INC/WOR/25MTP002".                                                
126100                                                                              
126300                                                                              
126500****************************************************************              
126700*          P R O C E D U R E     D I V I S I O N               *              
126900****************************************************************              
127100 PROCEDURE DIVISION.                                                          
127300 00000000-MAIN-PARAGRAPH.                                                     
127500     PERFORM 10000000-INICIO.                                                 
127700     PERFORM 10000100-TIT-LIBS.                                               
127900     PERFORM 20000100-ABRE-BASE.                                              
128100     PERFORM 50001000-PROCESO UNTIL W77-EOF-B07 = 1.                          
128300     PERFORM 80000000-TERMINA.                                                
128500     STOP RUN.                                                                
128700                                                                              
128900**********************************************************                    
129100*         00100000-CHANGE-LIBRERIAS                      *                    
129300**********************************************************                    
129500 10000000-INICIO.                                                             
129700     MOVE "S500P103"        TO W77-S000-MY-ID.                                
129900     MOVE "P103"            TO WS-0101-PASO-MSG.                              
130100     MOVE "25MTP004"        TO WS-0101-MTP-MSG                                
130300                               W77-S000-MY-VERSION.                           
130350     MOVE 2                 TO W77-USO-LIBLJ.                                 
130500                                                                              
130700                                                                              
130900*********************************************************                     
131100 10000100-TIT-LIBS.                                                           
131300*************************** LIBRERIA DE VERSIONES ***************             
131500     PERFORM 10000100-VERSIONES.                                              
131700     PERFORM 20000100-CHECAME-VERSION.                                        
131900     IF S000-CTR-CVEERROR < 0                                                 
132500        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
132700        PERFORM 70000050-MENSAJE                                              
132900        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
133100                                                                              
133300**********************************************************                    
133500                                                                              
133700                                                                              
133900                                                                              
134100                                                                              
134300                                                                              
134500************************************************************                  
134700 20000100-ABRE-BASE.                                                          
134900*===================                                                          
135100     OPEN INQUIRY S500BD01CAPTACION.                                          
135300                                                                              
135500     PERFORM 90000002-B02CONTROL-FIND.                                        
135700     IF WS-STATUS-BASE > 0                                                    
136300        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
136500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
136700        PERFORM 70000050-MENSAJE                                              
136900        CALL SYSTEM DMTERMINATE.                                              
137100                                                                              
137300                                                                              
137500     MOVE B02-NUM-CSI           TO W77-MY-CSI                                 
137600                                   WKS-HEAD-CSI                               
137700                                   WKS-TIT-E03-CSI.                           
137900     MOVE B02-FECHA-LOTE        TO WS-FECHA-MOV                               
138000                                   WKS-HEAD-FECH                              
138100                                   WKS-TIT-E03-FECH.                          
138300                                                                              
138500     SET S500B07MOVDIA   TO BEGINNING.                                        
138700                                                                              
138900     OPEN OUTPUT E03-CVES2001.                                                
138950                                                                              
139000     PERFORM 20000600-GEN-HEADER.                                             
139050                                                                              
139100***************************************************                           
139110 20000600-GEN-HEADER.                                                         
139120     WRITE REG-E03-CVES FROM WKS-E03-HEADER INVALID KEY                       
139150           STRING "ERR WRITE ARCH-E03"                                        
139160                  " REGISTRO HEADER " WKS-NUM-REG                             
139170                  DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                    
139180           PERFORM 70000050-MENSAJE                                           
139190           CALL SYSTEM DMTERMINATE.                                           
139200                                                                              
139210***********************************************************                   
139215 20000700-GEN-TRAILER.                                                        
139230     WRITE REG-E03-CVES FROM WKS-E03-TRAILER INVALID KEY                      
139245           STRING "ERR WRITE ARCH-E03"                                        
139250                  " REG TRAILER " WKS-NUM-REG                                 
139255                  DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                    
139260           PERFORM 70000050-MENSAJE                                           
139265           CALL SYSTEM DMTERMINATE.                                           
139270                                                                              
139300***********************************************************                   
139500 50001000-PROCESO.                                                            
139700*=================                                                            
139900     PERFORM 90000007-B07MOVDIA-FINDN.                                        
140100     IF WS-STATUS-BASE > 0                                                    
140300        IF WS-STATUS-BASE = 1                                                 
140500           MOVE 1                  TO W77-EOF-B07                             
140700         ELSE                                                                 
141300           STRING "ERR FINDN A B07 ",WS-STATUS-BASE                           
141500           DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                           
141700           PERFORM 70000050-MENSAJE                                           
141900           CALL SYSTEM DMTERMINATE.                                           
142100                                                                              
142110     IF WS-STATUS-BASE = 0                                                    
142300        IF B07-STATUS-MOVTO = 1                                               
142500           NEXT SENTENCE                                                      
142700        ELSE                                                                  
142900           MOVE B07-AUTORIZACION    TO WKS-AUTORIZ-MOV                        
143100           PERFORM 50001100-MOV-ORIG                                          
143300           MOVE ZERO                TO W77-IND-B07                            
143500           PERFORM 50001200-OPERO5-B07 5 TIMES                                
143700           IF B07-IND-MOVSADS > 0                                             
143900              PERFORM 50001300-MOVS-B13.                                      
144100                                                                              
144300*************************************************************                 
144500 50001100-MOV-ORIG.                                                           
144700     IF B07-CLAVE-MOVTO = 2001 OR 2444 OR 2496                                
144900        MOVE 0002                  TO WKS-REG-E03-BCO                         
145100        MOVE WKS-SUC-OPE           TO WKS-REG-E03-SUC-OPE                     
145300        MOVE B07-MED-ACCESO        TO WKS-REG-E03-CHQRA                       
145500        MOVE WS-FECHA-MOV          TO WKS-REG-E03-FECHA                       
145700        MOVE B07-CLAVE-MOVTO       TO WKS-REG-E03-CVE                         
145900        MOVE B07-IMPORTE           TO WKS-REG-E03-IMPORTE                     
146100        MOVE B07-REFER-NUME        TO WKS-REG-E03-REFNUM                      
146300        PERFORM 50002000-ESC-ARCHIVO.                                         
146500                                                                              
146700*******************************************************                       
146900 50001200-OPERO5-B07.                                                         
147100     ADD 1 TO W77-IND-B07.                                                    
147300     IF B07-CVE-MOVAD (W77-IND-B07) = 2001 OR 2444 OR 2496                    
147500        MOVE 0002                       TO WKS-REG-E03-BCO                    
147700        MOVE WKS-SUC-OPE                TO WKS-REG-E03-SUC-OPE                
147900        MOVE B07-MED-ACCESO             TO WKS-REG-E03-CHQRA                  
148100        MOVE WS-FECHA-MOV               TO WKS-REG-E03-FECHA                  
148300        MOVE B07-CVE-MOVAD(W77-IND-B07) TO WKS-REG-E03-CVE                    
148500        MOVE B07-IMP-MOVAD(W77-IND-B07) TO WKS-REG-E03-IMPORTE                
148700        MOVE B07-REF-MOVAD(W77-IND-B07) TO WKS-REG-E03-REFNUM                 
148900        PERFORM 50002000-ESC-ARCHIVO.                                         
149100                                                                              
149300**********************************************************                    
149500 50001300-MOVS-B13.                                                           
149700     MOVE B07-NUM-CONTRATO  TO WS-NUM-CONTRATO.                               
149900     MOVE B07-AUTORIZACION  TO WS-AUTORIZACION.                               
150100     MOVE 0                 TO W77-SIN-B13.                                   
150300     PERFORM 90000013-B13SXCTOAUT-FIND                                        
150500     IF WS-STATUS-BASE > 0                                                    
150700        IF WS-STATUS-BASE = 1                                                 
150900           MOVE 1 TO W77-SIN-B13                                              
151100        ELSE                                                                  
151700         STRING "ERR FIND A B13 ",WS-STATUS-BASE                              
151900                " CTO=" WS-NUM-CONTRATO                                       
152100                " AUT=" WS-AUTORIZACION                                       
152300                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
152500         PERFORM 70000050-MENSAJE                                             
152700         CALL SYSTEM DMTERMINATE.                                             
152900                                                                              
153100     IF W77-SIN-B13 = 0                                                       
153300        MOVE ZERO       TO W77-IND-B13                                        
153500        PERFORM 50001350-BUSCA-B13 10 TIMES.                                  
153700                                                                              
153900******************************************************                        
154100 50001350-BUSCA-B13.                                                          
154300     ADD 1 TO W77-IND-B13.                                                    
154500     IF B13-CLAVE-MOVTO(W77-IND-B13) = 2001 OR 2444 OR 2496                   
154700        MOVE 0002                         TO WKS-REG-E03-BCO                  
154900        MOVE WKS-SUC-OPE                  TO WKS-REG-E03-SUC-OPE              
155100        MOVE B07-MED-ACCESO               TO WKS-REG-E03-CHQRA                
155300        MOVE WS-FECHA-MOV                 TO WKS-REG-E03-FECHA                
155500        MOVE B13-CLAVE-MOVTO(W77-IND-B13) TO WKS-REG-E03-CVE                  
155700        MOVE B13-IMPORTE    (W77-IND-B13) TO WKS-REG-E03-IMPORTE              
155900        MOVE B13-REF-MOVAD  (W77-IND-B13) TO WKS-REG-E03-REFNUM               
156100        PERFORM 50002000-ESC-ARCHIVO.                                         
156300                                                                              
156500*************************************************************                 
156700 50002000-ESC-ARCHIVO.                                                        
156900     ADD 1                   TO WKS-NUM-REG.                                  
156920     ADD WKS-REG-E03-IMPORTE TO WKS-IMP-TOT.                                  
156940                                                                              
156960     MOVE 2                  TO WKS-REG-E03-TPO.                              
156980                                                                              
157100     WRITE REG-E03-CVES FROM WKS-REG-E03-CVES INVALID KEY                     
157700           STRING "ERR WRITE ARCH-E03"                                        
157900                  " REGISTRO=" WKS-NUM-REG                                    
158100                  DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                    
158300           PERFORM 70000050-MENSAJE                                           
158500           CALL SYSTEM DMTERMINATE.                                           
158700                                                                              
158900***********************************************************                   
159100                                                                              
159300                                                                              
159500                                                                              
159700                                                                              
159900                                                                              
160100                                                                              
160300**********************************************************                    
160500 80000000-TERMINA.                                                            
160700     CLOSE S500BD01CAPTACION.                                                 
160750                                                                              
160800     PERFORM 20000700-GEN-TRAILER.                                            
160850                                                                              
160900     CLOSE E03-CVES2001 WITH SAVE.                                            
161100                                                                              
161300                                                                              
161500                                                                              
161700                                                                              
161900**********************************************************                    
162100 COPY "S500/INC/PRO/25MTP002".                                                
162300***********************************************************                   
