100000$SET LIST$                                                                    
100020$SET ERRORLIST                                                                
100060$ ERRORLIMIT = 500                                                            
100080$SET LIST STACK LINEINFO FREE                                                 
100100*****************************************************************             
100120*  PROGRAMA PARA TRANSFERENCIA DE ARCHIVOS                      *             
100140*  ENTRE HOST DE PLATAFORMA UNISYS:                             *             
100160*  CCI            MTY     VDM         VDM     MTY               *             
100180*  NODO            04      10          10      04               *             
100200*  PRODUCCION   MONBETA-VDMALFA     VDMALFA-MONBETA             *             
100220*  AL S274      MONBETA-MONDELTA    VDMALFA-VDMDELTA            *             
100240*                                                               *             
100260*  UAT          MONALFA-ACYPGAMA   ACYPGAMA-MONALFA             *             
100280*  AL S274      MONALFA-MONKAPPA   ACYPGAMA-ACYPKAPPA           *             
100300*  UAT                             ACYPOMEGA-VDMKAPPA           *             
100320*                                                               *             
100340*  SIT          VDMKAPPA-VDMBETA   VDMBETA-SITBETA              *             
100360*  AL S274      VDMKAPPA-VDMKAPPA  VDMBETA-VDMBETA              *             
100380*                                                               *             
100400*  DESARROLLO   ACYPBETA-VDMBETA                                *             
100420*  AL S274      ACYPBETA-ACYPBETA                               *             
100440*                                                               *             
100460*  TRANSFERENCIA VIA INTELAR:                                   *             
100480*  ARCHIVOS SALIDOS DEL PASO P180 A ETL                         *             
100500*    S500/FILE/INTS/CSI/AAAAMMDD/CHESDOS                        *             
100520*    S500/FILE/INTS/CSI/AAAAMMDD/CMASDOS                        *             
100540*                                                               *             
100560*  ARCHIVOS SALIDOS DE  LINEA                                   *             
100580*    S500/FILE/INTS/CSI/AAAAMMDD/PROB_XX  1 POR COPIA P010      *             
100600*    S500/FILE/INTS/CSI/AAAAMMDD/MONI_XX  1 POR COPIA P010      *             
100620*    S500/FILE/INTS/CSI/AAAAMMDD/RECH_XX  1 POR COPIA P010      *             
100640*    S500/FILE/INTS/CSI/AAAAMMDD/MONIP014_xx POR COPIA P014     *             
100660*    S500/FILE/INTS/CSI/AAAAMMDD/PROBP014_xx POR COPIA P014     *             
100680*                                                               *             
100700*  ARCHIVOS SALIDOS DEL PASO P315 A ETL                         *             
100720*    S500/FILE/INTS/50013S01/10/AAAAMMDD/S500_ART61             *             
100740*    S500/FILE/INTS/50013S01/04/AAAAMMDD/S500_ART61             *             
100760*                                                               *             
100780*  ARCHIVO SALIDO DEL PASO P430 A ETL                           *             
100800*    S500/FILE/INTS/50003S02/10/AAAAMMDD/AHOSDOS                *             
100820*                                                                             
100840*****************************************************************             
100860* EL PASO CORRE CON EL PARAMETRO: ("NN AAAAMMDD")               *             
100880*          NN = NUMERO DE ARCHIVO                               *             
100900*    AAAAMMDD = FECHA DEL ARCHIVO                               *             
100920*                                                               *             
100940*****************************************************************             
100960* NN      NOMBRE DEL ARCHIVO                            DE  A   *             
100980* ============================================================= *             
101000* 01=(S500)S500/FILE/X/GERENCIA/MTY/COR/AAMMDD        (MTY-VDM) *             
101020* 02=(S500)S500/FILE/S500/04/10/SALDOSTB/AAMMDD       (MTY-VDM) *             
101040* 03=(S500)S001/FILE/S500/04/10/SALDOSTB/AAMMDD       (MTY-VDM) *             
101060* 04=(S500)S500/FILE/S403/04/10/PAGOS/AAMMDD          (MTY-VDM) *             
101080* 05=(S500)S500/FILE/S084/PROMEDIOS/04/AMMDD          (MTY-VDM) *             
101100* 06=(S500)S500/FILE/E01/04/10/S151/AAMMDD            (MTY-VDM) *             
101120* 07=(S500)S500/FILE/S253/04/10/MOVTOS001/AAMMDD      (MTY-VDM) *             
101140* 08=(S500)S500/FILE/S253/04/10/MOVTOS066/AAMMDD      (MTY-VDM) *             
101160* 09=(S500)S500/FILE/S036/04/10/MOVTOS500/AAMMDD      (MTY-VDM) *             
101180* 10=(S500)S151/FILE/S500/10/04/PFORE/AAMMDD          (MTY-VDM) *             
101200* 11=(S500)S151/FILE/S500/04/10/PFOTR/AAMMDD          (MTY-VDM) *             
101220* 12=(S500)S500/FILE/S500/04/10/PUNTEOS054/AAMMDD/01  (MTY-VDM) *             
101240* 13=(S500)S500/FILE/S500/04/10/PUNTEOS054/AAMMDD/02  (MTY-VDM) *             
101260* 14=(S500)S500/FILE/S111/04/DEPINICIAL/AAMMDD        (MTY-VDM) *             
101280* 15=(S500)S500/FILE/S702/04/10/PAGOS/AAMMDD          (MTY-VDM) *             
101300* 16=(S500)S500/FILE/S500/04/10/CPESEC/AAMMDD         (MTY-VDM) *             
101320* 17=(S500)S500/FILE/S711/FRAUDLINK/04/AAAAMMDD       (MTY-VDM) *             
101340* 18=(S500)S500/FILE/S500/04/10/PUNTEOS054/AAMMDD/03  (MTY-VDM) *             
101360* 19=(S500)S500/FILE/S500/04/10/SDOSB24/AAMMDD        (MTY-VDM) *             
101380* 20=(S500)S500/FILE/S500/MOTOR/04/AAAAMMDD           (MTY-VDM) *             
101400* 21=(S500)S500/FILE/S500/04/10/I10/AAAAMMDD          (MTY-VDM) *             
101420* 22=(S500)S500/FILE/S500/04/10/I10PS/AAAAMMDD        (MTY-VDM) *             
101440* 23=(S500)S500/FILE/S500/04/10/I10PS2/AAAAMMDD       (MTY-VDM) *             
101460* 24=(S500)S500/FILE/S500/04/10/R-MIGR-SDOS/AAAAMMDD  (MTY-VDM) *             
101480*25=(S500)S500/FILE/S084/REACTAORIG/04/10/AAMMDD      (MTY-VDM) *             
101500*26=(S500)S500/FILE/S087/REACTAORIG/04/04/AAMMDD      (MTY-VDM) *             
101520*                                                               *             
101540* 30=(S500)S274/FILE/XDISP/AAMMDD/000000000500/01 (AL USER-S274)*             
101560*31=(S500)S274/FILE/XDISP/AAMMDD/000000000500/02  (AL USER-S274)*             
101580*                                                               *             
101590*40=(S500)S500/FILE/S500/10/04/MOVSTBINTEREAS/AAMMDD   (VDM-MTY)*             
101600*41=(S500)S500/FILE/S500/10/04/MOVSTBINTERSEMEAS/AAMMDD(VDM-MTY)*             
101620*                                                               *             
101640* 51=(S500)S500/FILE/S500/10/04/MOVSTBINTER/AAMMDD    (VDM-MTY) *             
101660* 52=(S500)S500/FILE/S500/10/04/MOVSTBINTERSEM/AAMMDD (VDM-MTY) *             
101680* 53=(S500)S111/FILE/S500/PREALTAS/AAMMDD             (VDM-MTY) *             
101700* 54=(S500)S152/FILE/S500/12/04/MOVSDISP/AAMMDD       (VDM-MTY) *             
101720* 55=(S500)S500/FILE/S500/TEF/AAMMDD                  (VDM-MTY) *             
101740* 56=(S500)S500/FILE/S500/MOTOR/10/AAAAMMDD           (VDM-MTY) *             
101760*57=(S500)S500/FILE/S087/REACTAORIG/10/04/AAMMDD      (VDM-MTY) *             
101780* 60=(S500)S500/FILE/INTS/50010S01/CSI/AAAAMMDD/COMPENDEPP      *             
101800* 61=(S500)S500/FILE/INTS/50004S01/XX/AAAAMMDD/INCIDENTE        *             
101820*62=S500/FILE/INTS/50014S01/CSI/AAAAMMDD/ISILOANS/01            *             
101840*63=S500/FILE/INTS/50021S01/CSI/AAAAMMDD/ISILOANS/02            *             
101860*65=S500/FILE/INTS/50009S01/CSI/AAAAMMDD/HL_ART61               *             
101880*66=S500/FILE/INTS/50009S01/04/AAAAMMDD/MOTOR                   *             
101900*67=S500/FILE/INTS/50020S01/CSI/AAAAMMDD/CTRLDEPRET             *             
101920*68=S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP020_xx POR COPIA  *             
101940*   C1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP020_01                 
101960*   C2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP020_02                 
101980*69=S500/FILE/INTS/50004S01/CSI/AAAAMMDD/P020/MONI_xx           *             
102000*   D1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP020_01                 
102020*   D2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP020_02                 
102040* 70=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_xx     *             
102060*   M1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_01                 
102080*   M2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_02                 
102100*   M3=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_03                 
102120*   M4=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_04                 
102140*   M5=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/MONIP014_05                 
102160* 71=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_xx                   
102180*   P1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_01                 
102200*   P2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_02                 
102220*   P3=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_03                 
102240*   P4=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_04                 
102260*   P5=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/PROBP014_05                 
102280* 72=(S500)S500/FILE/INTS/50013S01/10/AAAAMMDD/S500_ART61                     
102300* 73=(S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/ESQCONT   A ETL *             
102320* 74=(S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/AHOSDOS   A ETL *             
102340* 75=(S500)S500/FILE/INTS/50006S01/GCE/MX1/485/BALANCES/20151117              
102360* 76=(S500)S500/FILE/INTS/50006S01/GCE/MX1/485/BALANCES/20151117/             
102380* 77=(S500)S500/FILE/INTS/50006S01/GCE/MX1/485/BALANCES/2/2015111             
102400* 78=(S500)S500/FILE/INTS/50006S01/GCE/MX1/485/FWD/BACK/VALUEDATE             
102420* 79=(S500)S500/FILE/INTS/50007S01/CSI/AAAAMMDD/FRAUDEINT       *             
102440                                                                              
102460* 81=(S500)S500/FILE/S036/10/10/MOVTOS500/AAMMDD A S500S036VDM  *             
102480* 82=(S500)S500/FILE/S036/04/10/MOVTOS500/AAMMDD A S500S036MTY  *             
102500* 83=(S500)S500/FILE/S253/10/10/MOVTOS001/AAMMDD A S253S001VDM  *             
102520* 84=(S500)S500/FILE/S253/10/10/MOVTOS066/AAMMDD A S253S066VDM  *             
102540* 85=(S500)S001/FILE/S500/10/10/CINTACH/AAMMDD   A S500CHEQ     *             
102560* 86=(S500)S500/FILE/S500/10/10/CINTACM/AAMMDD   A S500CTAMAE   *             
102580* 87=(S500)S500/FILE/S253/04/10/MOVTOS001/AAMMDD A S253S001MTY  *             
102600* 88=(S500)S500/FILE/S253/04/10/MOVTOS066/AAMMDD A S253S066MTY  *             
102620* 89=(S500)S500/FILE/S050/12/12/AAMMDD           A S500FIOBOTR  *             
102640*                                                               *             
102660* R4-COPIAS-2011 ENVIO ARCHIVOS VIA INTELAR                     *             
102680* 90=(S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/CHESDOS   A ETL *             
102700*    (S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/CMASDOS   A ETL *             
102720*    (S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/ESQCONT   A ETL *             
102740* 91=(S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/CHESDOS   A ETL *             
102760* 92=(S500)S500/FILE/INTS/50003S02/CSI/AAAAMMDD/CMASDOS   A ETL *             
102780* 93=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_xx   VIA INTELAR    *             
102800*   A1=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_01   VIA INTELAR  *             
102820*   A2=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_02   VIA INTELAR  *             
102840*   A3=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_03   VIA INTELAR  *             
102860*   A4=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_04   VIA INTELAR  *             
102880*   A5=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_05   VIA INTELAR  *             
102900*   A6=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_06   VIA INTELAR  *             
102920*   A7=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_07   VIA INTELAR  *             
102922*   A8=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_08   VIA INTELAR  *             
102924*   A9=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_09   VIA INTELAR  *             
102926*   F0=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_10   VIA INTELAR  *             
102928*   F1=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_11   VIA INTELAR  *             
102930*   F2=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_12   VIA INTELAR  *             
102932*   F3=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_13   VIA INTELAR  *             
102934*   F4=(S500)S500/FILE/INTS/CSI/AAAAMMDD/PROB_14   VIA INTELAR  *             
102940* 94=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_XX   VIA INTELAR    *             
102960*   B1=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_01   VIA INTELAR  *             
102980*   B2=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_02   VIA INTELAR  *             
103000*   B3=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_03   VIA INTELAR  *             
103020*   B4=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_04   VIA INTELAR  *             
103040*   B5=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_05   VIA INTELAR  *             
103060*   B6=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_06   VIA INTELAR  *             
103080*   B7=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_07   VIA INTELAR  *             
103082*   B8=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_08   VIA INTELAR  *             
103084*   B9=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_09   VIA INTELAR  *             
103086*   G0=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_10   VIA INTELAR  *             
103088*   G1=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_11   VIA INTELAR  *             
103090*   G2=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_12   VIA INTELAR  *             
103092*   G3=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_13   VIA INTELAR  *             
103094*   G4=(S500)S500/FILE/INTS/CSI/AAAAMMDD/MONI_14   VIA INTELAR  *             
103100* 95=(S500)S500/FILE/INTS/CSI/AAAAMMDD/RANGOS    HP-UX 11.23    *             
103120* 96=(S500)S500/FILE/INTS/50004S01/CSI/aaaammdd/TIMES/nn        *             
103140*     donde nn = Numero Consecutivo de la fecha    VIA INTELAR  *             
103160* 97=(S500)S500/FILE/INTS/50008S01/CSI/aaaammdd/ALERTAS         *             
103180*                                                               *             
103200*      ARCHIVOS MONITOREO DE RECHAZOS  VIA INTELAR              *             
103220* 98=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_XX         *             
103240*  R1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_01        *             
103260*  R2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_02        *             
103280*  R3=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_03        *             
103300*  R4=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_04        *             
103320*  R5=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_05        *             
103340*  R6=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_06        *             
103360*  R7=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_07        *             
103362*  R8=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_08        *             
103364*  R9=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_09        *             
103366*  H0=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_10        *             
103368*  H1=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_11        *             
103370*  H2=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_12        *             
103372*  H3=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_13        *             
103374*  H4=(S500)S500/FILE/INTS/50004S01/CSI/AAAAMMDD/RECH_14        *             
103380*                                                               *             
103400*  GENERACION DE ARCHIVO PARA EL S711.                          *             
103420*  99=(S500)S500/FILE/INTS/50018S01/CSI/AAAAMMDD/S711FRAUDLINK  *             
104000*****************************************************************             
104010**           LLAMADO    "INTELARSND IN ADMONXFERS"             **             
104011*  CALL "INTELARSND IN ADMONXFERS"                              *             
104012*                             USING WS-ARCH-SDOS                *             
104013*                            GIVING WS77-INTELAR-RESULT.        *             
104014*  VALORES PARA WS77-INTELAR-RESULT :                           *             
104015*               0 = Transferencia OK                            *             
104016*              -1 = Error de sintaxis en WFL                    *             
104017*              -2 = Error, el archivo no tipo INTS o no existe  *             
104018*****************************************************************             
108000*****************************************************************             
108100 IDENTIFICATION DIVISION.                                                     
108200 PROGRAM-ID.    P197.                                                         
108210 AUTHOR.        JOSE LUIS IBARRA LARA.                                        
108220 DATE-WRITTEN.  FEB/2006.                                                     
108230 INSTALLATION.  BANCO NACIONAL DE MEXICO, S.A.                                
108300 ENVIRONMENT DIVISION.                                                        
108400 CONFIGURATION SECTION.                                                       
108500 INPUT-OUTPUT SECTION.                                                        
108600 FILE-CONTROL.                                                                
108605* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS           -DDG             
108610*    SELECT CTOCMA    ASSIGN TO DISK.                                         
108615*    SELECT CTOCHE    ASSIGN TO DISK.                                         
108616     SELECT ARCH-RESIDENTE ASSIGN TO DISK.                                    
108620                                                                              
108700 DATA  DIVISION.                                                              
108800 FILE  SECTION.                                                               
108803* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS           -DDG             
108806* FD CTOCHE                                                                   
108809*    RECORD CONTAINS 270 CHARACTERS                                           
108812*    BLOCK  CONTAINS 180 RECORDS                                              
108815*    VALUE OF AREAS 1000                                                      
108818*    VALUE OF AREASIZE 1620                                                   
108821*    VALUE OF SECURITYTYPE IS PUBLIC                                          
108824*    VALUE OF TITLE IS WKS-DATO-ARCH-CHESDOS.                                 
108827*                                                                             
108830*01 REG-CTOCHE                  PIC X(270).                                   
108833*                                                                             
108836* FD CTOCMA                                                                   
108839*     RECORD CONTAINS 270 CHARACTERS                                          
108842*     BLOCK  CONTAINS 180 RECORDS                                             
108845*     VALUE OF AREAS 1000                                                     
108848*     VALUE OF AREASIZE 1620                                                  
108851*     VALUE OF SECURITYTYPE IS PUBLIC                                         
108854*     VALUE OF TITLE IS WKS-DATO-ARCH-CMASDOS.                                
108857*                                                                             
108860* 01 REG-CTOCMA                  PIC X(270).                                  
108863*                                                                             
108864 FD ARCH-RESIDENTE                                                            
108865    VALUE OF DEPENDENTSPECS IS TRUE.                                          
108866 01 ARCH-RESIDENTE-REG           PIC X(120).                                  
108900******************************************************                        
109000 DATA-BASE SECTION.                                                           
109100 DB S500BD01CAPTACION.                                                        
109110 01 S500B02CONTROL.                                                           
109200***********************************************************                   
109300 WORKING-STORAGE SECTION.                                                     
109400 77 W77-STA-BASE            PIC 9(04).                                        
109500***** PARAMETRO DE ENTRADA *******************************                    
109600 77  W77-PARAM-WFL           PIC X(30) RECEIVED BY CONTENT.                   
109700                                                                              
109800 01 WKS-PARAM-ENT.                                                            
109900    02 WKS-PAR-OPCION  PIC XX.                                                
109910    88 W88-PAR-OPC1-OK VALUE "01","02","03","04","05","06","07",              
109920                             "08","09","10","11","12","13","14",              
109930                             "15","16","17","18","19","20",                   
109932                             "21","22","23","24","25","26","27".              
109950    88 W88-PAR-OPC2-OK VALUE "40","41","51","52","53","54","55",              
109960                             "56","57","58".                                  
109970    88 W88-PAR-OPC3-OK VALUE "81","82","83","84","85","86",                   
109980                             "87","88","89".                                  
109982                                                                              
110000    88 W88-PAR-OPC4-OK VALUE "60","61","62","63","65","66","67",              
110002                             "68","69","70","71","72","73","74",              
110004                             "75","76","77","78","79","90","91",              
110006                             "92","93","94","95","96","97","98",              
110008                             "99","80".                                       
110020                                                                              
110050    88 W88-PAR-OPC5-OK VALUE "30","31".                                       
110070**  88 W88-PAR-OPC6-OK VALUE "40".                                            
110120    88 W88-PAR-OPCA-OK VALUE "A1","A2","A3","A4","A5","A6","A7",              
110122                             "A8","A9","F0","F1","F2","F3","F4".              
110125    88 W88-PAR-OPCB-OK VALUE "B1","B2","B3","B4","B5","B6","B7",              
110126                             "B8","B9","G0","G1","G2","G3","G4".              
110127    88 W88-PAR-OPCC-OK VALUE "C1","C2","C5","C6","C7","C8".                   
110129    88 W88-PAR-OPCD-OK VALUE "D1","D2".                                       
110130    88 W88-PAR-OPCR-OK VALUE "R1","R2","R3","R4","R5","R6","R7",              
110132                             "R8","R9","H0","H1","H2","H3","H4".              
110135    88 W88-PAR-OPCM-OK VALUE "M1","M2","M3","M4","M5","M6","M7",              
110136                             "M8","M9".                                       
110140    88 W88-PAR-OPCP-OK VALUE "P1","P2","P3","P4","P5","P6","P7",              
110150                             "P8","P9".                                       
110160    88 W88-PAR-OPCE-OK VALUE "EO","E1","E2","E3","E4","E5","E6",              
110170                             "E7","E8","E9".                                  
110200    88 W88-PAR-OPCI-OK VALUE "I1".                                            
110300    02 FILLER                PIC X.                                           
110400    02 WKS-PAR-FECHA         PIC 9(08).                                       
110500    02 RD-WKS-PAR-FECHA      REDEFINES WKS-PAR-FECHA.                         
110600       04 WKS-PAR-FEC-AAAA   PIC 9(04).                                       
110700       88 W88-PAR-AAAA-OK    VALUE 2000 THRU 2060.                            
110800       04 WKS-PAR-FEC-MM     PIC 9(02).                                       
110900       88 W88-PAR-MM-OK      VALUE 01 THRU 12.                                
111000       04 WKS-PAR-FEC-DD     PIC 9(02).                                       
111100       88 W88-PAR-DD-OK      VALUE 01 THRU 31.                                
111104    02 FILLER                PIC X.                                           
111106    02 WKS-PAR-ARCH-CONSEC   PIC X(03).                                       
111108    02 RD-EKS-PAR-ARCH-CONS  REDEFINES WKS-PAR-ARCH-CONSEC.                   
111110       04 WKS-PAR-ARCH-DIAG  PIC X(01).                                       
111112       88 W88-PAR-DIAG-OK    VALUE "/".                                       
111114       04 WKS-PAR-NUM-CONSEC PIC 9(02).                                       
111116       88 W88-PAR-CONSEC-OK  VALUE 01 THRU 99.                                
111118    02 FILLER                PIC X.                                           
111119    02 WKS-PARAM-EXTRA       PIC X(14).                                       
111120    02 WKS-PARM-CAN          REDEFINES WKS-PARAM-EXTRA.                       
111130       04 WKS-PAR-SISTEMA    PIC X(04).                                       
111135       04 FILLER             PIC X.                                           
111140       04 WKS-PAR-MIX        PIC X(04).                                       
111145       04 FILLER             PIC X.                                           
111150       04 WKS-PAR-SEC        PIC X(04).                                       
111200                                                                              
111210*****************************************************                         
111220 01  WKS-PARAM-REPROC.                                                        
111230     02 FILLER            PIC X(01)  VALUE "(".                               
111232     02 FILLER            PIC X(16)  VALUE                                    
111240                          """CORRESOLO P197 ".                                
111242     02 WKS-PA-REPRO      PIC X      VALUE " ".                               
111250     02 WKS-PN-REPRO      PIC 9      VALUE 0.                                 
111260     02 FILLER            PIC X      VALUE " ".                               
111270     02 WKS-F-REPRO       PIC 9(08).                                          
111280     02 FILLER            PIC X(02)  VALUE """)".                             
111290                                                                              
111300******* VARIABLES PARA VALIDAR TRANSFERENCIA **********                       
111400                                                                              
111500 77  W77-ES-DESA             PIC 9 VALUE 0.                                   
111502 88  W88-ES-DESA             VALUE 1.                                         
111505 77  W77-ES-SIT              PIC 9 VALUE 0.                                   
111506 88  W88-ES-SIT              VALUE 1.                                         
111510 77  W77-ES-UAT              PIC 9 VALUE 0.                                   
111511 88  W88-ES-UAT              VALUE 1.                                         
111520 77  W77-ES-PROD             PIC 9 VALUE 0.                                   
111521 88  W88-ES-PROD             VALUE 1.                                         
111530                                                                              
111540 77  W77-SI-AL-274           PIC 9 VALUE 0.                                   
111550 77  W77-TRF-OK              PIC 9 VALUE 0.                                   
111552 77  W77-TRF-INTENTO         PIC 9 VALUE 0.                                   
111554 77  W77-TRF-TIMES           PIC 9 VALUE 0.                                   
111560 77  W77-SIN-TRANSF          PIC 9 VALUE 0.                                   
111600                                                                              
111700*** VARIABLES PARA LA LIBRERIA XFER ***********                               
111800 77  WS-TRF-RESULT           PIC 9(11) BINARY.                                
111900 77  WS-TRF-TAMACOM          PIC 9(11) BINARY.                                
112000 01  WS-TRF-COMANDO          PIC X(200).                                      
112010                                                                              
112020* WS-TRF-RESULT  = RSULTADO DEL CALL                                          
112022* WS-TRF-TAMACOM = TAMANO DEL COMANDO EN BYTES                                
112024* WS-TRF-COMANDO = COMANDO                                                    
112100                                                                              
112105* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS           -DDG             
112110* VARIABLES PARA EL ENVIO DE ARCHIVOS AL S022                                 
112115 01 WS-ARCH-SDOS                PIC X(73) VALUE SPACES.                       
112116 01 WS-ARCH-I10                 PIC X(73) VALUE SPACES.                       
112117 01 WS-ARCH-I10PS               PIC X(73) VALUE SPACES.                       
112118 01 WS-ARCH-I10PS2              PIC X(73) VALUE SPACES.                       
112119 01 WS-ARCH-I7PRIME             PIC X(73) VALUE SPACES.                       
112120 77 WS77-INTELAR-RESULT         PIC S9(11) BINARY.                            
112125 01 WS-RESULT-N1                PIC 9(05)-.                                   
112135                                                                              
112200 01 WKS-ARCHIVO-ENVIAR          PIC X(73) VALUE SPACES.                       
112205 01 WKS-NOMBRE-ARCH             PIC X(10) VALUE SPACES.                       
112210 01 WKS-OPCION-ARCH             PIC X(30) VALUE SPACES.                       
112215 01 WKS-INTENTOS                PIC 9(01).                                    
112300                                                                              
112400                                                                              
112500                                                                              
112510 01  WKS-VARIABLES.                                                           
112520     02 WKS-QUE-OPC      PIC XX.                                              
112530     02 RD-WKS-QUE-OPC   REDEFINES WKS-QUE-OPC.                               
112540        04 WKS-Q-OPC-1D  PIC X.                                               
112550        04 WKS-Q-OPC-2D  PIC 9.                                               
112560                                                                              
112600**********************************************************                    
112700**  PARAMETRO DE SALIDA SE REGRESA EN TASKVALUE **********                    
112800 77 W77-SAL-RESULT       PIC 9(11)  VALUE 0.                                  
112900*******************************************************                       
113000 01  WKS-VARIABLES-HOST.                                                      
113100     02 WKS-MY-HOST         PIC X(20).                                        
113200     02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
113300        04 WKS-MY-HOST-03   PIC X(04).                                        
113400        04 WKS-MY-HOST-17   PIC X(16).                                        
113500                                                                              
113600     02 WKS-CSI-ORIG        PIC 9(02).                                        
113700     02 WKS-CSI-DEST        PIC 9(02).                                        
113800                                                                              
113900**  ARCHIVOS *******************************************                      
114000********************************************************                      
114100 01 WKS-DATO-ARCH-01.                                                         
114150    02 WKS-USER-ORIG-01      PIC X(06)  VALUE "(S500)".                       
114160    02 WKS-ARCHIVO-01.                                                        
114200       04 WKS-ARCH-ORIG-01   PIC X(29)  VALUE                                 
114300                             "S500/FILE/X/GERENCIA/MTY/COR/".                 
114400       04 WKS-FECH-ARCH-01   PIC 9(06)  VALUE 999999.                         
114500    02 WKS-PACK-ORIG-01      PIC X(15)  VALUE "CAPTACION ".                   
114540    02 WKS-USER-DEST-01      PIC X(06)  VALUE "(S500)".                       
114560    02 WKS-PACK-DEST-01      PIC X(15)  VALUE "CAPTACION ".                   
114600                                                                              
114700*********************************************************                     
114800 01 WKS-DATO-ARCH-02.                                                         
114850    02 WKS-USER-ORIG-02      PIC X(06)  VALUE "(S500)".                       
114870    02 WKS-ARCHIVO-02.                                                        
114900       04 WKS-ARCH-ORIG-02   PIC X(30) VALUE                                  
115000                             "S500/FILE/S500/04/10/SALDOSTB/".                
115100       04 WKS-FECH-ARCH-02   PIC 9(06)  VALUE 999999.                         
115200    02 WKS-PACK-ORIG-02      PIC X(15)  VALUE "CAPTACION ".                   
115220    02 WKS-USER-DEST-02      PIC X(06)  VALUE "(S500)".                       
115240    02 WKS-PACK-DEST-02      PIC X(15)  VALUE "CAPTACION ".                   
115300                                                                              
115400**********************************************************                    
115500 01 WKS-DATO-ARCH-03.                                                         
115550    02 WKS-USER-ORIG-03      PIC X(06)  VALUE "(S500)".                       
115570    02 WKS-ARCHIVO-03.                                                        
115600       04 WKS-ARCH-ORIG-03   PIC X(30)  VALUE                                 
115700                             "S001/FILE/S500/04/10/SALDOSTB/".                
115800       04 WKS-FECH-ARCH-03   PIC 9(06)  VALUE 999999.                         
115900    02 WKS-PACK-ORIG-03      PIC X(15)  VALUE "CAPTACION ".                   
115920    02 WKS-USER-DEST-03      PIC X(06)  VALUE "(S500)".                       
115940    02 WKS-PACK-DEST-03      PIC X(15)  VALUE "CAPTACION ".                   
116000                                                                              
116100***********************************************************                   
116200 01 WKS-DATO-ARCH-04.                                                         
116220    02 WKS-USER-ORIG-04      PIC X(06)  VALUE "(S500)".                       
116270    02 WKS-ARCHIVO-04.                                                        
116300       04 WKS-ARCH-ORIG-04   PIC X(27)  VALUE                                 
116400                             "S500/FILE/S403/04/10/PAGOS/".                   
116500       04 WKS-FECH-ARCH-04   PIC 9(06)  VALUE 999999.                         
116600    02 WKS-PACK-ORIG-04      PIC X(15)  VALUE "CAPTACION ".                   
116610    02 WKS-USER-DEST-04      PIC X(06)  VALUE "(S403)".                       
116620    02 WKS-PACK-DEST-04      PIC X(15)  VALUE "EMPRESAS  ".                   
116700                                                                              
116800***********************************************************                   
116900 01 WKS-DATO-ARCH-05.                                                         
116950    02 WKS-USER-ORIG-05      PIC X(06)  VALUE "(S500)".                       
116970    02 WKS-ARCHIVO-05.                                                        
117000       04 WKS-ARCH-ORIG-05   PIC X(28) VALUE                                  
117100                             "S500/FILE/S084/PROMEDIOS/04/".                  
117200       04 WKS-FECH-ARCH-05   PIC 9(06)  VALUE 999999.                         
117300    02 WKS-PACK-ORIG-05      PIC X(15)  VALUE "CAPTACION ".                   
117320    02 WKS-USER-DEST-05      PIC X(06)  VALUE "(S500)".                       
117340    02 WKS-PACK-DEST-05      PIC X(15)  VALUE "CAPTACION ".                   
117400                                                                              
117500***********************************************************                   
117600 01 WKS-DATO-ARCH-06.                                                         
117610    02 WKS-USER-ORIG-06      PIC X(06)  VALUE "(S500)".                       
117660    02 WKS-ARCHIVO-06.                                                        
117700       04 WKS-ARCH-ORIG-06   PIC X(25)  VALUE                                 
117800                             "S500/FILE/E01/04/10/S151/".                     
117900       04 WKS-FECH-ARCH-06   PIC 9(06)  VALUE 999999.                         
118000    02 WKS-PACK-ORIG-06      PIC X(15)  VALUE "CAPTACION ".                   
118010    02 WKS-USER-DEST-06      PIC X(06)  VALUE "(S151)".                       
118020    02 WKS-PACK-DEST-06      PIC X(10)  VALUE "CMEMP     ".                   
118100                                                                              
118200***********************************************************                   
118300 01 WKS-DATO-ARCH-07.                                                         
118320    02 WKS-USER-ORIG-07      PIC X(06)  VALUE "(S500)".                       
118340    02 WKS-ARCHIVO-07.                                                        
118400       04 WKS-ARCH-ORIG-07   PIC X(31) VALUE                                  
118500                             "S500/FILE/S253/04/10/MOVTOS001/".               
118600       04 WKS-FECH-ARCH-07   PIC 9(06)  VALUE 999999.                         
118700    02 WKS-PACK-ORIG-07      PIC X(15)  VALUE "CAPTACION ".                   
118720    02 WKS-USER-DEST-07      PIC X(06)  VALUE "(S500)".                       
118740    02 WKS-PACK-DEST-07      PIC X(15)  VALUE "CAPTACION ".                   
118800                                                                              
118900***********************************************************                   
119000 01 WKS-DATO-ARCH-08.                                                         
119020    02 WKS-USER-ORIG-08      PIC X(06)  VALUE "(S500)".                       
119040    02 WKS-ARCHIVO-08.                                                        
119100       04 WKS-ARCH-ORIG-08   PIC X(31) VALUE                                  
119200                            "S500/FILE/S253/04/10/MOVTOS066/".                
119300       04 WKS-FECH-ARCH-08   PIC 9(06)  VALUE 999999.                         
119400    02 WKS-PACK-ORIG-08      PIC X(15)  VALUE "CAPTACION ".                   
119420    02 WKS-USER-DEST-08      PIC X(06)  VALUE "(S500)".                       
119440    02 WKS-PACK-DEST-08      PIC X(15)  VALUE "CAPTACION ".                   
119500                                                                              
119600***********************************************************                   
119700 01 WKS-DATO-ARCH-09.                                                         
119720    02 WKS-USER-ORIG-09      PIC X(06)  VALUE "(S500)".                       
119740    02 WKS-ARCHIVO-09.                                                        
119800       04 WKS-ARCH-ORIG-09   PIC X(31) VALUE                                  
119900                            "S500/FILE/S036/04/10/MOVTOS500/".                
120000       04 WKS-FECH-ARCH-09   PIC 9(06)  VALUE 999999.                         
120100    02 WKS-PACK-ORIG-09      PIC X(15)  VALUE "CAPTACION ".                   
120120    02 WKS-USER-DEST-09      PIC X(06)  VALUE "(S500)".                       
120140    02 WKS-PACK-DEST-09      PIC X(15)  VALUE "CAPTACION ".                   
120200                                                                              
120300***********************************************************                   
120400 01 WKS-DATO-ARCH-10.                                                         
120410    02 WKS-USER-ORIG-10      PIC X(06)  VALUE "(S500)".                       
120460    02 WKS-ARCHIVO-10.                                                        
120500       04 WKS-ARCH-ORIG-10   PIC X(27)  VALUE                                 
120600                            "S151/FILE/S500/10/04/PFORE/".                    
120700       04 WKS-FECH-ARCH-10   PIC 9(06)  VALUE 999999.                         
120800    02 WKS-PACK-ORIG-10      PIC X(15)  VALUE "CAPTACION ".                   
120810    02 WKS-USER-DEST-10      PIC X(06)  VALUE "(S151)".                       
120820    02 WKS-PACK-DEST-10      PIC X(15)  VALUE "CMEMP     ".                   
120900                                                                              
121000***********************************************************                   
121100 01 WKS-DATO-ARCH-11.                                                         
121110    02 WKS-USER-ORIG-11      PIC X(06)  VALUE "(S500)".                       
121160    02 WKS-ARCHIVO-11.                                                        
121200       04 WKS-ARCH-ORIG-11   PIC X(27)  VALUE                                 
121300                            "S151/FILE/S500/04/10/PFOTR/".                    
121400       04 WKS-FECH-ARCH-11   PIC 9(06)  VALUE 999999.                         
121500    02 WKS-PACK-ORIG-11      PIC X(15)  VALUE "CAPTACION ".                   
121510    02 WKS-USER-DEST-11      PIC X(06)  VALUE "(S151)".                       
121520    02 WKS-PACK-DEST-11      PIC X(15)  VALUE "CMEMP     ".                   
121600                                                                              
121700***********************************************************                   
121800***********************************************************                   
121900 01 WKS-DATO-ARCH-12.                                                         
122010    02 WKS-USER-ORIG-12      PIC X(06)  VALUE "(S500)".                       
122060    02 WKS-ARCHIVO-12.                                                        
122100       04 WKS-ARCH-ORIG-12   PIC X(32)  VALUE                                 
122200                      "S500/FILE/S500/04/10/PUNTEOS054/".                     
122300       04 WKS-FECH-ARCH-12   PIC 9(06)  VALUE 999999.                         
122350       04 WKS-ARCH-COPIA-12  PIC X(03)  VALUE "/01".                          
122400    02 WKS-PACK-ORIG-12      PIC X(15)  VALUE "CAPTACION ".                   
122410    02 WKS-USER-DEST-12      PIC X(06)  VALUE "(S500)".                       
122420    02 WKS-PACK-DEST-12      PIC X(15)  VALUE "CAPTACION ".                   
122500                                                                              
122550***********************************************************                   
122600 01 WKS-DATO-ARCH-13.                                                         
122610    02 WKS-USER-ORIG-13      PIC X(06)  VALUE "(S500)".                       
122660    02 WKS-ARCHIVO-13.                                                        
122700       04 WKS-ARCH-ORIG-13   PIC X(32)  VALUE                                 
122800                      "S500/FILE/S500/04/10/PUNTEOS054/".                     
122900       04 WKS-FECH-ARCH-13   PIC 9(06)  VALUE 999999.                         
122950       04 WKS-ARCH-COPIA-13  PIC X(03)  VALUE "/02".                          
123000    02 WKS-PACK-ORIG-13      PIC X(15)  VALUE "CAPTACION ".                   
123010    02 WKS-USER-DEST-13      PIC X(06)  VALUE "(S500)".                       
123020    02 WKS-PACK-DEST-13      PIC X(15)  VALUE "CAPTACION ".                   
123100************************************************************                  
123102 01 WKS-DATO-ARCH-14.                                                         
123104    02 WKS-USER-ORIG-14      PIC X(06)  VALUE "(S500)".                       
123106    02 WKS-ARCHIVO-14.                                                        
123108       04 WKS-ARCH-ORIG-14   PIC X(29)  VALUE                                 
123110                             "S500/FILE/S111/04/DEPINICIAL/".                 
123112       04 WKS-FECH-ARCH-14   PIC 9(06)  VALUE 999999.                         
123114    02 WKS-PACK-ORIG-14      PIC X(15)  VALUE "CAPTACION ".                   
123116    02 WKS-USER-DEST-14      PIC X(06)  VALUE "(S500)".                       
123118    02 WKS-PACK-DEST-14      PIC X(15)  VALUE "CAPTACION ".                   
123120************************************************************                  
123122 01 WKS-DATO-ARCH-15.                                                         
123124    02 WKS-USER-ORIG-15      PIC X(06)  VALUE "(S500)".                       
123126    02 WKS-ARCHIVO-15.                                                        
123128       04 WKS-ARCH-ORIG-15   PIC X(27)  VALUE                                 
123130                             "S500/FILE/S702/04/10/PAGOS/".                   
123132       04 WKS-FECH-ARCH-15   PIC 9(06)  VALUE 999999.                         
123134    02 WKS-PACK-ORIG-15      PIC X(15)  VALUE "CAPTACION ".                   
123136    02 WKS-USER-DEST-15      PIC X(06)  VALUE "(S500)".                       
123138    02 WKS-PACK-DEST-15      PIC X(15)  VALUE "CAPTACION ".                   
123140************************************************************                  
123150 01 WKS-DATO-ARCH-16.                                                         
123155    02 WKS-USER-ORIG-16      PIC X(06)  VALUE "(S500)".                       
123160    02 WKS-ARCHIVO-16.                                                        
123165       04 WKS-ARCH-ORIG-16   PIC X(28)  VALUE                                 
123170                             "S500/FILE/S500/04/10/CPESEC/".                  
123175       04 WKS-FECH-ARCH-16   PIC 9(06)  VALUE 999999.                         
123180    02 WKS-PACK-ORIG-16      PIC X(15)  VALUE "CAPTACION ".                   
123185    02 WKS-USER-DEST-16      PIC X(06)  VALUE "(S500)".                       
123190    02 WKS-PACK-DEST-16      PIC X(15)  VALUE "CAPTACION ".                   
123195*************************************************************                 
123196 01 WKS-DATO-ARCH-17.                                                         
123198    02 WKS-USER-ORIG-17      PIC X(06)  VALUE "(S500)".                       
123200    02 WKS-ARCHIVO-17.                                                        
123202       04 WKS-ARCH-ORIG-17   PIC X(28)  VALUE                                 
123204                             "S500/FILE/S711/FRAUDLINK/04/".                  
123206       04 WKS-FECH-ARCH-17   PIC 9(08)  VALUE 99999999.                       
123208    02 WKS-PACK-ORIG-17      PIC X(15)  VALUE "CAPTACION ".                   
123210    02 WKS-USER-DEST-17      PIC X(06)  VALUE "(S500)".                       
123212    02 WKS-PACK-DEST-17      PIC X(15)  VALUE "CAPTACION ".                   
123214*************************************************************                 
123216 01 WKS-DATO-ARCH-18.                                                         
123218   02 WKS-USER-ORIG-18      PIC X(06)  VALUE "(S500)".                        
123220   02 WKS-ARCHIVO-18.                                                         
123222      04 WKS-ARCH-ORIG-18   PIC X(32)  VALUE                                  
123224                      "S500/FILE/S500/04/10/PUNTEOS054/".                     
123225      04 WKS-FECH-ARCH-18   PIC 9(06)  VALUE 999999.                          
123230      04 WKS-ARCH-COPIA-18  PIC X(03)  VALUE "/03".                           
123235   02 WKS-PACK-ORIG-18      PIC X(15)  VALUE "CAPTACION ".                    
123240   02 WKS-USER-DEST-18      PIC X(06)  VALUE "(S500)".                        
123245   02 WKS-PACK-DEST-18      PIC X(15)  VALUE "CAPTACION ".                    
123300                                                                              
123400**********************************************************                    
123405 01 WKS-DATO-ARCH-19.                                                         
123410    02 WKS-USER-ORIG-19      PIC X(06)  VALUE "(S500)".                       
123415    02 WKS-ARCHIVO-19.                                                        
123420       04 WKS-ARCH-ORIG-19   PIC X(29)  VALUE                                 
123425                       "S500/FILE/S500/04/10/SDOSB24/".                       
123430       04 WKS-FECH-ARCH-19   PIC 9(06)  VALUE 999999.                         
123435    02 WKS-PACK-ORIG-19      PIC X(15)  VALUE "CAPTACION ".                   
123440    02 WKS-USER-DEST-19      PIC X(06)  VALUE "(S500)".                       
123445    02 WKS-PACK-DEST-19      PIC X(15)  VALUE "CAPTACION ".                   
123450*************************************************************                 
123452 01 WKS-DATO-ARCH-20.                                                         
123454    02 WKS-USER-ORIG-20      PIC X(06)  VALUE "(S500)".                       
123456    02 WKS-ARCHIVO-20.                                                        
123458       04 WKS-ARCH-ORIG-20   PIC X(24)  VALUE                                 
123460                       "S500/FILE/S500/MOTOR/04/".                            
123462       04 WKS-FECH-ARCH-20   PIC 9(08)  VALUE 99999999.                       
123464    02 WKS-PACK-ORIG-20      PIC X(15)  VALUE "CAPTACION ".                   
123466    02 WKS-USER-DEST-20      PIC X(06)  VALUE "(S500)".                       
123468    02 WKS-PACK-DEST-20      PIC X(15)  VALUE "CAPTACION ".                   
123470*************************************************************                 
123471 01 WKS-DATO-ARCH-21.                                                         
123472    02 WKS-USER-ORIG-21      PIC X(06)  VALUE "(S500)".                       
123473    02 WKS-ARCHIVO-21.                                                        
123474       04 WKS-ARCH-ORIG-21   PIC X(25)  VALUE                                 
123475                   "S500/FILE/S500/04/10/I10/".                               
123476       04 WKS-FECH-ARCH-21   PIC 9(08)  VALUE 99999999.                       
123477    02 WKS-PACK-ORIG-21      PIC X(15)  VALUE "CAPTACION ".                   
123478    02 WKS-USER-DEST-21      PIC X(06)  VALUE "(S500)".                       
123479    02 WKS-PACK-DEST-21      PIC X(15)  VALUE "CAPTACION ".                   
123480*************************************************************                 
123481 01 WKS-DATO-ARCH-22.                                                         
123482    02 WKS-USER-ORIG-22      PIC X(06)  VALUE "(S500)".                       
123483    02 WKS-ARCHIVO-22.                                                        
123484       04 WKS-ARCH-ORIG-22   PIC X(27)  VALUE                                 
123485                   "S500/FILE/S500/04/10/I10PS/".                             
123486       04 WKS-FECH-ARCH-22   PIC 9(08)  VALUE 99999999.                       
123487    02 WKS-PACK-ORIG-22      PIC X(15)  VALUE "CAPTACION ".                   
123488    02 WKS-USER-DEST-22      PIC X(06)  VALUE "(S500)".                       
123489    02 WKS-PACK-DEST-22      PIC X(15)  VALUE "CAPTACION ".                   
123490*************************************************************                 
123491 01 WKS-DATO-ARCH-23.                                                         
123492    02 WKS-USER-ORIG-23      PIC X(06)  VALUE "(S500)".                       
123493    02 WKS-ARCHIVO-23.                                                        
123494       04 WKS-ARCH-ORIG-23   PIC X(28)  VALUE                                 
123495                   "S500/FILE/S500/04/10/I10PS2/".                            
123496       04 WKS-FECH-ARCH-23   PIC 9(08)  VALUE 99999999.                       
123497    02 WKS-PACK-ORIG-23      PIC X(15)  VALUE "CAPTACION ".                   
123498    02 WKS-USER-DEST-23      PIC X(06)  VALUE "(S500)".                       
123499    02 WKS-PACK-DEST-23      PIC X(15)  VALUE "CAPTACION ".                   
123500***********************************************************                   
123502 01 WKS-DATO-ARCH-24.                                                         
123504    02 WKS-USER-ORIG-24      PIC X(06)  VALUE "(S500)".                       
123506    02 WKS-ARCHIVO-24.                                                        
123508       04 WKS-ARCH-ORIG-24   PIC X(33)  VALUE                                 
123510             "S500/FILE/S500/04/10/R-MIGR-SDOS/".                             
123512       04 WKS-FECH-ARCH-24   PIC 9(08)  VALUE 99999999.                       
123514    02 WKS-PACK-ORIG-24      PIC X(15)  VALUE "CAPTACION ".                   
123516    02 WKS-USER-DEST-24      PIC X(06)  VALUE "(S500)".                       
123518    02 WKS-PACK-DEST-24      PIC X(15)  VALUE "CAPTACION ".                   
123520***********************************************************                   
123522 01 WKS-DATO-ARCH-25.                                                         
123524    02 WKS-USER-ORIG-25      PIC X(06)  VALUE "(S500)".                       
123526    02 WKS-ARCHIVO-25.                                                        
123528       04 WKS-ARCH-ORIG-25   PIC X(32)  VALUE                                 
123530             "S500/FILE/S084/REACTAORIG/04/10/".                              
123532       04 WKS-FECH-ARCH-25   PIC 9(06)  VALUE 999999.                         
123534    02 WKS-PACK-ORIG-25      PIC X(15)  VALUE "CAPTACION ".                   
123536    02 WKS-USER-DEST-25      PIC X(06)  VALUE "(S500)".                       
123538    02 WKS-PACK-DEST-25      PIC X(15)  VALUE "CAPTACION ".                   
123540                                                                              
123542 01 WKS-DATO-ARCH-26.                                                         
123544    02 WKS-USER-ORIG-26      PIC X(06)  VALUE "(S500)".                       
123546    02 WKS-ARCHIVO-26.                                                        
123548       04 WKS-ARCH-ORIG-26   PIC X(32)  VALUE                                 
123550                  "S500/FILE/S087/REACTAORIG/04/04/".                         
123560       04 WKS-FECH-ARCH-26   PIC 9(06)  VALUE 999999.                         
123562    02 WKS-PACK-ORIG-26      PIC X(15)  VALUE "CAPTACION ".                   
123564    02 WKS-USER-DEST-26      PIC X(06)  VALUE "(S500)".                       
123566    02 WKS-PACK-DEST-26      PIC X(15)  VALUE "CAPTACION ".                   
123568                                                                              
123570 01 WKS-DATO-ARCH-27.                                                         
123572    02 WKS-USER-ORIG-27      PIC X(06)  VALUE "(S500)".                       
123574    02 WKS-ARCHIVO-ORIG-27.                                                   
123576       04 WKS-ARCH-ORIG-27   PIC X(15)  VALUE "S500/FILE/SINC/".              
123578       04 WKS-CSI-ORIG-27    PIC 9(02).                                       
123580       04 FILLER             PIC X(01)  VALUE "/".                            
123582       04 WKS-FECH-ORIG-27   PIC 9(06)  VALUE 999999.                         
123584    02 WKS-ARCHIVO-DEST-27.                                                   
123586       04 WKS-ARCH-DEST-27   PIC X(15)  VALUE "S500/FILE/SINC/".              
123588       04 WKS-CSI-DEST-27    PIC 9(02).                                       
123590       04 FILLER             PIC X(01)  VALUE "/".                            
123592       04 WKS-FECH-DEST-27   PIC 9(06)  VALUE 999999.                         
123594    02 WKS-PACK-ORIG-27      PIC X(15)  VALUE "CAPTACION ".                   
123596    02 WKS-USER-DEST-27      PIC X(06)  VALUE "(S500)".                       
123598    02 WKS-PACK-DEST-27      PIC X(15)  VALUE "CAPTACION ".                   
123600                                                                              
123700                                                                              
123710 01 WKS-DATO-ARCH-30.                                                         
123712    02 WKS-USER-ORIG-30      PIC X(06)  VALUE "(S500)".                       
123714    02 WKS-ARCHIVO-30.                                                        
123716       04 WKS-ARCH-ORIG-30   PIC X(16)  VALUE                                 
123718                       "S274/FILE/XDISP/".                                    
123720       04 WKS-FECH-ARCH-30   PIC 9(06)  VALUE 999999.                         
123722       04 WKS-IDS274-30      PIC X(16)  VALUE "/000000000500/01".             
123724    02 WKS-PACK-ORIG-30      PIC X(15)  VALUE "CAPTACION ".                   
123726    02 WKS-USER-DEST-30      PIC X(06)  VALUE "(S274)".                       
123728    02 WKS-PACK-DEST-30      PIC X(15)  VALUE "S067REMESAS ".                 
123730*************************************************************                 
123732                                                                              
123734 01 WKS-DATO-ARCH-31.                                                         
123736    02 WKS-USER-ORIG-31      PIC X(06)  VALUE "(S500)".                       
123738    02 WKS-ARCHIVO-31.                                                        
123740       04 WKS-ARCH-ORIG-31   PIC X(16)  VALUE                                 
123742                       "S274/FILE/XDISP/".                                    
123744       04 WKS-FECH-ARCH-31   PIC 9(06)  VALUE 999999.                         
123746       04 WKS-IDS274-31      PIC X(16)  VALUE "/000000000500/02".             
123748    02 WKS-PACK-ORIG-31      PIC X(15)  VALUE "CAPTACION ".                   
123750    02 WKS-USER-DEST-31      PIC X(06)  VALUE "(S274)".                       
123752    02 WKS-PACK-DEST-31      PIC X(15)  VALUE "S067REMESAS ".                 
123754                                                                              
123790*************************************************************                 
123792 01 WKS-DATO-ARCH-40.                                                         
123794   02 WKS-USER-ORIG-40       PIC X(06)  VALUE "(S500)".                       
123796   02 WKS-ARCHIVO-40.                                                         
123798      04 WKS-ARCH-ORIG-40    PIC X(36)  VALUE                                 
123800                        "S500/FILE/S500/10/04/MOVSTBINTEREAS/".               
123802      04 WKS-FECH-ARCH-40    PIC 9(06)  VALUE 999999.                         
123804   02 WKS-PACK-ORIG-40       PIC X(15)  VALUE "CAPTACION ".                   
123806   02 WKS-USER-DEST-40       PIC X(06)  VALUE "(S500)".                       
123808   02 WKS-PACK-DEST-40       PIC X(15)  VALUE "CAPTACION ".                   
123810**********************************************************                    
123812 01 WKS-DATO-ARCH-41.                                                         
123814    02 WKS-USER-ORIG-41       PIC X(06)  VALUE "(S500)".                      
123816    02 WKS-ARCHIVO-41.                                                        
123818       04 WKS-ARCH-ORIG-41    PIC X(39)  VALUE                                
123820                      "S500/FILE/S500/10/04/MOVSTBINTERSEMEAS/".              
123822       04 WKS-FECH-ARCH-41    PIC 9(06)  VALUE 999999.                        
123824    02 WKS-PACK-ORIG-41       PIC X(15)  VALUE "CAPTACION ".                  
123826    02 WKS-USER-DEST-41       PIC X(06)  VALUE "(S500)".                      
123828    02 WKS-PACK-DEST-41       PIC X(15)  VALUE "CAPTACION ".                  
123830**********************************************************                    
123832 01 WKS-DATO-ARCH-51.                                                         
123834    02 WKS-USER-ORIG-51      PIC X(06)  VALUE "(S500)".                       
123836    02 WKS-ARCHIVO-51.                                                        
123838       04 WKS-ARCH-ORIG-51   PIC X(33) VALUE                                  
123840                           "S500/FILE/S500/10/04/MOVSTBINTER/".               
123842       04 WKS-FECH-ARCH-51   PIC 9(06)  VALUE 999999.                         
123844    02 WKS-PACK-ORIG-51      PIC X(15)  VALUE "CAPTACION ".                   
123846    02 WKS-USER-DEST-51      PIC X(06)  VALUE "(S500)".                       
123848    02 WKS-PACK-DEST-51      PIC X(15)  VALUE "CAPTACION ".                   
123850                                                                              
123852**********************************************************                    
123900                                                                              
124000                                                                              
124100**********************************************************                    
124200 01 WKS-DATO-ARCH-52.                                                         
124220    02 WKS-USER-ORIG-52      PIC X(06)  VALUE "(S500)".                       
124240    02 WKS-ARCHIVO-52.                                                        
124300       04 WKS-ARCH-ORIG-52   PIC X(36) VALUE                                  
124400                          "S500/FILE/S500/10/04/MOVSTBINTERSEM/".             
124500       04 WKS-FECH-ARCH-52   PIC 9(06)  VALUE 999999.                         
124600    02 WKS-PACK-ORIG-52      PIC X(15)  VALUE "CAPTACION ".                   
124620    02 WKS-USER-DEST-52      PIC X(06)  VALUE "(S500)".                       
124640    02 WKS-PACK-DEST-52      PIC X(15)  VALUE "CAPTACION ".                   
124650**********************************************************                    
124652 01 WKS-DATO-ARCH-53.                                                         
124654    02 WKS-USER-ORIG-53      PIC X(06)  VALUE "(S500)".                       
124656    02 WKS-ARCHIVO-53.                                                        
124658       04 WKS-ARCH-ORIG-53   PIC X(24) VALUE                                  
124660                             "S111/FILE/S500/PREALTAS/".                      
124662       04 WKS-FECH-ARCH-53   PIC 9(06)  VALUE 999999.                         
124664    02 WKS-PACK-ORIG-53      PIC X(15)  VALUE "CAPTACION ".                   
124666    02 WKS-USER-DEST-53      PIC X(06)  VALUE "(S500)".                       
124668    02 WKS-PACK-DEST-53      PIC X(15)  VALUE "CAPTACION ".                   
124670**********************************************************                    
124672 01 WKS-DATO-ARCH-54.                                                         
124674    02 WKS-USER-ORIG-54      PIC X(06)  VALUE "(S500)".                       
124676    02 WKS-ARCHIVO-54.                                                        
124678       04 WKS-ARCH-ORIG-54   PIC X(30) VALUE                                  
124680                             "S152/FILE/S500/12/04/MOVSDISP/".                
124682       04 WKS-FECH-ARCH-54   PIC 9(06)  VALUE 999999.                         
124684    02 WKS-PACK-ORIG-54      PIC X(15)  VALUE "CAPTACION ".                   
124686    02 WKS-USER-DEST-54      PIC X(06)  VALUE "(S500)".                       
124688    02 WKS-PACK-DEST-54      PIC X(15)  VALUE "CAPTACION ".                   
124700                                                                              
124800**********************************************************                    
124810 01 WKS-DATO-ARCH-55.                                                         
124815    02 WKS-USER-ORIG-55      PIC X(06)  VALUE "(S500)".                       
124820    02 WKS-ARCHIVO-55.                                                        
124825       04 WKS-ARCH-ORIG-55   PIC X(19) VALUE                                  
124830                             "S500/FILE/S500/TEF/".                           
124835       04 WKS-FECH-ARCH-55   PIC 9(06)  VALUE 999999.                         
124840    02 WKS-PACK-ORIG-55      PIC X(15)  VALUE "CAPTACION ".                   
124845    02 WKS-USER-DEST-55      PIC X(06)  VALUE "(S500)".                       
124850    02 WKS-PACK-DEST-55      PIC X(15)  VALUE "CAPTACION ".                   
124855                                                                              
124860**************************************************************                
124862 01 WKS-DATO-ARCH-56.                                                         
124864    02 WKS-USER-ORIG-56      PIC X(06)  VALUE "(S500)".                       
124866    02 WKS-ARCHIVO-56.                                                        
124868       04 WKS-ARCH-ORIG-56   PIC X(24)  VALUE                                 
124870                       "S500/FILE/S500/MOTOR/10/".                            
124872       04 WKS-FECH-ARCH-56   PIC 9(08)  VALUE 99999999.                       
124874    02 WKS-PACK-ORIG-56      PIC X(15)  VALUE "CAPTACION ".                   
124876    02 WKS-USER-DEST-56      PIC X(06)  VALUE "(S500)".                       
124878    02 WKS-PACK-DEST-56      PIC X(15)  VALUE "CAPTACION ".                   
124879*************************************************************                 
124880                                                                              
124881 01 WKS-DATO-ARCH-57.                                                         
124882    02 WKS-USER-ORIG-57      PIC X(06)  VALUE "(S500)".                       
124883    02 WKS-ARCHIVO-57.                                                        
124884       04 WKS-ARCH-ORIG-57   PIC X(32)  VALUE                                 
124885                       "S500/FILE/S087/REACTAORIG/10/04/".                    
124886       04 WKS-FECH-ARCH-57   PIC 9(06)  VALUE 999999.                         
124887    02 WKS-PACK-ORIG-57      PIC X(15)  VALUE "CAPTACION ".                   
124888    02 WKS-USER-DEST-57      PIC X(06)  VALUE "(S500)".                       
124889    02 WKS-PACK-DEST-57      PIC X(15)  VALUE "CAPTACION ".                   
124890                                                                              
124891 01 WKS-DATO-ARCH-58.                                                         
124892    02 WKS-USER-ORIG-58      PIC X(06) VALUE "(S500)".                        
124893    02 WKS-ARCHIVO-58.                                                        
124894       04 WKS-ARCH-ORIG-58   PIC X(27) VALUE                                  
124895                             "S500/FILE/INTE/50019E01/10/".                   
124896       04 WKS-FECH-ARCH-58   PIC 9(08).                                       
124897       04 FILLER             PIC X(18) VALUE "/000000175172/0001".            
124898    02 WKS-PACK-ORIG-58      PIC X(15) VALUE "CAPTACION ".                    
124899    02 WKS-USER-DEST-58      PIC X(06) VALUE "(S500)".                        
124900    02 WKS-PACK-DEST-58      PIC X(15) VALUE "CAPTACION ".                    
124901                                                                              
124902 01 WKS-ARCH-60-COMPENDEPP.                                                   
124904    02 FILLER                 PIC X(24) VALUE                                 
124906                              "S500/FILE/INTS/50010S01/".                     
124908    02 WKS-60-CSIO            PIC 99.                                         
124910    02 FILLER                 PIC X(01) VALUE "/".                            
124912    02 WKS-60-FECHA           PIC 9(8).                                       
124914    02 FILLER                 PIC X(12) VALUE                                 
124916                              "/COMPENDEPP.".                                 
124918                                                                              
124920 01 WKS-ARCH-61-INCIDENTE.                                                    
124922    02 FILLER                 PIC X(24) VALUE                                 
124924                              "S500/FILE/INTS/50004S01/".                     
124926    02 WKS-61-CSIO            PIC 99.                                         
124928    02 FILLER                 PIC X(01) VALUE "/".                            
124930    02 WKS-61-FECHA           PIC 9(8).                                       
124932    02 FILLER                 PIC X(11) VALUE                                 
124934                              "/INCIDENTE/".                                  
124936    02 WKS-61-COPY            PIC 9(2).                                       
124938    02 FILLER                 PIC X(02) VALUE " .".                           
124988                                                                              
124989 01 WKS-ARCH-65-HL-ART61.                                                     
124990    02 FILLER                 PIC X(24) VALUE                                 
124991                              "S500/FILE/INTS/50009S01/".                     
124992    02 WKS-65-CSIO            PIC 99.                                         
124993    02 FILLER                 PIC X(01) VALUE "/".                            
124994    02 WKS-65-FECHA           PIC 9(8).                                       
124995    02 FILLER                 PIC X(09) VALUE                                 
124996                              "/HL_ART61".                                    
124997    02 FILLER                 PIC X     VALUE ".".                            
124998                                                                              
125000                                                                              
125001 01 WKS-ARCH-66-MOTOR.                                                        
125002    02 FILLER                 PIC X(27) VALUE                                 
125003                              "S500/FILE/INTS/50009S01/04/".                  
125004    02 WKS-66-FECHA           PIC 9(8).                                       
125005    02 FILLER                 PIC X(06) VALUE                                 
125006                              "/MOTOR".                                       
125007    02 FILLER                 PIC X     VALUE ".".                            
125008                                                                              
125010                                                                              
125012 01 WKS-ARCH-67-CTRLDEPRET.                                                   
125014    02 FILLER                 PIC X(24) VALUE                                 
125016                              "S500/FILE/INTS/50020S01/".                     
125018    02 WKS-67-CSIO            PIC 99.                                         
125020    02 FILLER                 PIC X(01) VALUE "/".                            
125022    02 WKS-67-FECHA           PIC 9(8).                                       
125024    02 FILLER                 PIC X(11) VALUE                                 
125026                              "/CTRLDEPRET".                                  
125028    02 FILLER                 PIC X     VALUE ".".                            
125030                                                                              
125032 01 WKS-ARCH-62-ISILOANS-1.                                                   
125034    02 FILLER                 PIC X(24) VALUE                                 
125036                              "S500/FILE/INTS/50014S01/".                     
125038    02 WKS-62-CSIO            PIC 99.                                         
125040    02 FILLER                 PIC X(01) VALUE "/".                            
125042    02 WKS-62-FECHA           PIC 9(8).                                       
125044    02 FILLER                 PIC X(12) VALUE                                 
125046                              "/ISILOANS/01".                                 
125048    02 FILLER                 PIC X     VALUE ".".                            
125050                                                                              
125052 01 WKS-ARCH-63-ISILOANS-2.                                                   
125054    02 FILLER                 PIC X(24) VALUE                                 
125056                              "S500/FILE/INTS/50021S01/".                     
125058    02 WKS-63-CSIO            PIC 99.                                         
125060    02 FILLER                 PIC X(01) VALUE "/".                            
125062    02 WKS-63-FECHA           PIC 9(8).                                       
125064    02 FILLER                 PIC X(12) VALUE                                 
125066                              "/ISILOANS/02".                                 
125068    02 FILLER                 PIC X     VALUE ".".                            
125070                                                                              
125100**************************************************************                
125110 01 WKS-ARCH-70-MONIP014.                                                     
125112    02 FILLER                 PIC X(24) VALUE                                 
125114                              "S500/FILE/INTS/50004S01/".                     
125116    02 WKS-70-CSIO            PIC 99.                                         
125118    02 FILLER                 PIC X(01) VALUE "/".                            
125120    02 WKS-70-FECHA           PIC 9(8).                                       
125122    02 FILLER                 PIC X(10) VALUE                                 
125124                              "/MONIP014_".                                   
125126    02 WKS-70-COPIA           PIC 99    VALUE 0.                              
125128    02 FILLER                 PIC X     VALUE ".".                            
125130**************************************************************                
125140 01 WKS-ARCH-71-PROBP014.                                                     
125142    02 FILLER                 PIC X(24) VALUE                                 
125144                              "S500/FILE/INTS/50004S01/".                     
125146    02 WKS-71-CSIO            PIC 99.                                         
125148    02 FILLER                 PIC X(01) VALUE "/".                            
125150    02 WKS-71-FECHA           PIC 9(8).                                       
125152    02 FILLER                 PIC X(10) VALUE                                 
125154                              "/PROBP014_".                                   
125156    02 WKS-71-COPIA           PIC 99    VALUE 0.                              
125158    02 FILLER                 PIC X     VALUE ".".                            
125160***************************************************************               
125162 01 WKS-ARCH-72-TRPBENF.                                                      
125164    02 FILLER                 PIC X(24) VALUE                                 
125166                              "S500/FILE/INTS/50013S01/".                     
125168    02 WKS-72-CSIO            PIC 99.                                         
125170    02 FILLER                 PIC X(01) VALUE "/".                            
125172    02 WKS-72-FECHA           PIC 9(8).                                       
125174    02 FILLER                 PIC X(11) VALUE                                 
125176                              "/S500_ART61".                                  
125178    02 FILLER                 PIC X     VALUE ".".                            
125180****************************************************************              
125200 01 WKS-ARCH-73-ESQCONT.                                                      
125220    02 FILLER                 PIC X(24) VALUE                                 
125240                              "S500/FILE/INTS/50003S02/".                     
125260    02 WKS-73-CSIO            PIC 99.                                         
125280    02 FILLER                 PIC X(01) VALUE "/".                            
125300    02 WKS-73-FECHA           PIC 9(08).                                      
125320    02 FILLER                 PIC X(09) VALUE                                 
125340                              "/ESQCONT.".                                    
125341****************************************************************              
125342 01 WKS-ARCH-74-AHOSDOS.                                                      
125344    02 FILLER                 PIC X(24) VALUE                                 
125346                              "S500/FILE/INTS/50003S02/".                     
125348    02 WKS-74-CSIO            PIC 99.                                         
125350    02 FILLER                 PIC X(01) VALUE "/".                            
125352    02 WKS-74-FECHA           PIC 9(8).                                       
125354    02 FILLER                 PIC X(09) VALUE                                 
125356                              "/AHOSDOS.".                                    
125358****************************************************************              
125360 01 WKS-ARCH-75-I10.                                                          
125361    02 FILLER                 PIC X(24) VALUE                                 
125362                              "S500/FILE/INTS/50006S01/".                     
125363    02 FILLER                 PIC X(21) VALUE                                 
125364                              "GCE/MX1/485/BALANCES/".                        
125365    02 WKS-75-FECHA           PIC 9(8).                                       
125366    02 FILLER                 PIC X(01) VALUE ".".                            
125368****************************************************************              
125370 01 WKS-ARCH-76-I10PS.                                                        
125371    02 FILLER                 PIC X(24) VALUE                                 
125372                              "S500/FILE/INTS/50006S02/".                     
125373    02 FILLER                 PIC X(21) VALUE                                 
125374                              "GCE/MX1/485/BALANCES/".                        
125375    02 WKS-76-FECHA           PIC 9(8).                                       
125376    02 FILLER                 PIC X(05) VALUE                                 
125377                              "/TXT.".                                        
125378****************************************************************              
125380 01 WKS-ARCH-77-I10PS2.                                                       
125381    02 FILLER                 PIC X(24) VALUE                                 
125382                              "S500/FILE/INTS/50006S02/".                     
125383    02 FILLER                 PIC X(23) VALUE                                 
125384                              "GCE/MX1/485/BALANCES/2/".                      
125385    02 WKS-77-FECHA           PIC 9(8).                                       
125386    02 FILLER                 PIC X(05) VALUE                                 
125387                              "/TXT.".                                        
125388****************************************************************              
125390 01 WKS-ARCH-78-I7PRIME.                                                      
125391    02 FILLER                 PIC X(24) VALUE                                 
125392                              "S500/FILE/INTS/50006S01/".                     
125393    02 FILLER                 PIC X(32) VALUE                                 
125394                              "GCE/MX1/485/FWD/BACK/VALUEDATED/".             
125395    02 WKS-78-FECHA           PIC 9(8).                                       
125396    02 FILLER                 PIC X(01) VALUE ".".                            
125600                                                                              
125602*****************************************************************             
125604 01 WKS-ARCH-79-FRAUDEINT.                                                    
125606    02 FILLER                 PIC X(24) VALUE                                 
125608                              "S500/FILE/INTS/50007S01/".                     
125610    02 WKS-79-CSIO            PIC 99.                                         
125612    02 FILLER                 PIC X(01) VALUE "/".                            
125614    02 WKS-79-FECHA           PIC 9(8).                                       
125616    02 FILLER                 PIC X(11) VALUE                                 
125618                              "/FRAUDEINT.".                                  
125700*************************************************************                 
125800 01 WKS-COPY-DUMPALL-81.                                                      
125900    02 FILLER            PIC X(35) VALUE                                      
126000                         "BEGIN JOB  S500/VDM/S036MOVTOS500; ".               
126100    02 FILLER            PIC X(28) VALUE                                      
126200                         "RUN SYSTEM/DUMPALL (""COPY ".                       
126300    02 WKS-NOMB-ARCH-81  PIC X(37) VALUE                                      
126400                         "(S500)S500/FILE/S036/10/10/MOVTOS500/".             
126500    02 WKS-FECH-ARCH-81  PIC 9(06) VALUE 999999.                              
126600    02 FILLER            PIC X(20) VALUE                                      
126700                         " ON CAPTACION TO UL ".                              
126800    02 FILLER            PIC X(28) VALUE                                      
126900                         "(KIND=TAPE,TITLE=S500S036VDM".                      
127000    02 WKS-FEC2-ARCH-81  PIC 9(06) VALUE 999999.                              
127100    02 FILLER            PIC X(03) VALUE                                      
127200                         ")"")".                                              
127300                                                                              
127400***************************************************************               
127500 01 WKS-COPY-DUMPALL-82.                                                      
127600    02 FILLER            PIC X(35) VALUE                                      
127700                         "BEGIN JOB  S500/MTY/S036MOVTOS500; ".               
127800    02 FILLER            PIC X(28) VALUE                                      
127900                         "RUN SYSTEM/DUMPALL (""COPY ".                       
128000    02 WKS-NOMB-ARCH-82  PIC X(37) VALUE                                      
128100                         "(S500)S500/FILE/S036/04/10/MOVTOS500/".             
128200    02 WKS-FECH-ARCH-82  PIC 9(06) VALUE 999999.                              
128300    02 FILLER            PIC X(20) VALUE                                      
128400                         " ON CAPTACION TO UL ".                              
128500    02 FILLER            PIC X(28) VALUE                                      
128600                         "(KIND=TAPE,TITLE=S500S036MTY".                      
128700    02 WKS-FEC2-ARCH-82  PIC 9(06) VALUE 999999.                              
128800    02 FILLER            PIC X(03) VALUE                                      
128900                         ")"")".                                              
129000                                                                              
129100**************************************************************                
129200 01 WKS-COPY-DUMPALL-83.                                                      
129300    02 FILLER            PIC X(35) VALUE                                      
129400                         "BEGIN JOB  S500/VDM/S253MOVTOS001; ".               
129500    02 FILLER            PIC X(28) VALUE                                      
129600                         "RUN SYSTEM/DUMPALL (""COPY ".                       
129700    02 WKS-NOMB-ARCH-83  PIC X(37) VALUE                                      
129800                         "(S500)S500/FILE/S253/10/10/MOVTOS001/".             
129900    02 WKS-FECH-ARCH-83  PIC 9(06) VALUE 999999.                              
130000    02 FILLER            PIC X(20) VALUE                                      
130100                         " ON CAPTACION TO UL ".                              
130200    02 FILLER            PIC X(28) VALUE                                      
130300                         "(KIND=TAPE,TITLE=S253S001VDM".                      
130400    02 WKS-FEC2-ARCH-83  PIC 9(06) VALUE 999999.                              
130500    02 FILLER            PIC X(03) VALUE                                      
130600                         ")"")".                                              
130700                                                                              
130800**************************************************************                
130900 01 WKS-COPY-DUMPALL-84.                                                      
131000    02 FILLER            PIC X(35) VALUE                                      
131100                         "BEGIN JOB  S500/VDM/S253MOVTOS066; ".               
131200    02 FILLER            PIC X(28) VALUE                                      
131300                         "RUN SYSTEM/DUMPALL (""COPY ".                       
131400    02 WKS-NOMB-ARCH-84  PIC X(37) VALUE                                      
131500                         "(S500)S500/FILE/S253/10/10/MOVTOS066/".             
131600    02 WKS-FECH-ARCH-84  PIC 9(06) VALUE 999999.                              
131700    02 FILLER            PIC X(20) VALUE                                      
131800                         " ON CAPTACION TO UL ".                              
131900    02 FILLER            PIC X(28) VALUE                                      
132000                         "(KIND=TAPE,TITLE=S253S066VDM".                      
132100    02 WKS-FEC2-ARCH-84  PIC 9(06) VALUE 999999.                              
132200    02 FILLER            PIC X(03) VALUE                                      
132300                         ")"")".                                              
132400                                                                              
132500**************************************************************                
132600 01 WKS-COPY-DUMPALL-85.                                                      
132700    02 FILLER            PIC X(33) VALUE                                      
132800                         "BEGIN JOB  S500/VDM/S001CINTACH; ".                 
132900    02 FILLER            PIC X(28) VALUE                                      
133000                         "RUN SYSTEM/DUMPALL (""COPY ".                       
133100    02 WKS-NOMB-ARCH-85  PIC X(35) VALUE                                      
133200                         "(S500)S001/FILE/S500/10/10/CINTACH/".               
133300    02 WKS-FECH-ARCH-85  PIC 9(06) VALUE 999999.                              
133400    02 FILLER            PIC X(20) VALUE                                      
133500                         " ON CAPTACION TO UL ".                              
133600    02 FILLER            PIC X(25) VALUE                                      
133700                         "(KIND=TAPE,TITLE=S500CHEQ".                         
133800    02 WKS-FEC2-ARCH-85  PIC 9(06) VALUE 999999.                              
133900    02 FILLER            PIC X(03) VALUE                                      
134000                         ")"")".                                              
134100                                                                              
134200**************************************************************                
134300 01 WKS-COPY-DUMPALL-86.                                                      
134400    02 FILLER            PIC X(33) VALUE                                      
134500                         "BEGIN JOB  S500/VDM/S001CINTACM; ".                 
134600    02 FILLER            PIC X(28) VALUE                                      
134700                         "RUN SYSTEM/DUMPALL (""COPY ".                       
134800    02 WKS-NOMB-ARCH-86  PIC X(35) VALUE                                      
134900                         "(S500)S500/FILE/S500/10/10/CINTACM/".               
135000    02 WKS-FECH-ARCH-86  PIC 9(06) VALUE 999999.                              
135100    02 FILLER            PIC X(20) VALUE                                      
135200                         " ON CAPTACION TO UL ".                              
135300    02 FILLER            PIC X(27) VALUE                                      
135400                         "(KIND=TAPE,TITLE=S500CTAMAE".                       
135500    02 WKS-FEC2-ARCH-86  PIC 9(06) VALUE 999999.                              
135600    02 FILLER            PIC X(03) VALUE                                      
135700                         ")"")".                                              
135800                                                                              
135900**************************************************************                
136000 01 WKS-COPY-DUMPALL-87.                                                      
136012    02 FILLER            PIC X(35) VALUE                                      
136014                         "BEGIN JOB  S500/MTY/S253MOVTOS001; ".               
136016    02 FILLER            PIC X(28) VALUE                                      
136018                         "RUN SYSTEM/DUMPALL (""COPY ".                       
136020    02 WKS-NOMB-ARCH-87  PIC X(37) VALUE                                      
136022                         "(S500)S500/FILE/S253/04/10/MOVTOS001/".             
136024    02 WKS-FECH-ARCH-87  PIC 9(06) VALUE 999999.                              
136026    02 FILLER            PIC X(20) VALUE                                      
136028                         " ON CAPTACION TO UL ".                              
136030    02 FILLER            PIC X(28) VALUE                                      
136032                         "(KIND=TAPE,TITLE=S253S001MTY".                      
136034    02 WKS-FEC2-ARCH-87  PIC 9(06) VALUE 999999.                              
136036    02 FILLER            PIC X(03) VALUE                                      
136038                         ")"")".                                              
136040                                                                              
136050**************************************************************                
136052 01 WKS-COPY-DUMPALL-88.                                                      
136054    02 FILLER            PIC X(35) VALUE                                      
136056                         "BEGIN JOB  S500/MTY/S253MOVTOS066; ".               
136058    02 FILLER            PIC X(28) VALUE                                      
136060                         "RUN SYSTEM/DUMPALL (""COPY ".                       
136062    02 WKS-NOMB-ARCH-88  PIC X(37) VALUE                                      
136064                         "(S500)S500/FILE/S253/04/10/MOVTOS066/".             
136066    02 WKS-FECH-ARCH-88  PIC 9(06) VALUE 999999.                              
136068    02 FILLER            PIC X(20) VALUE                                      
136070                         " ON CAPTACION TO UL ".                              
136072    02 FILLER            PIC X(28) VALUE                                      
136074                         "(KIND=TAPE,TITLE=S253S066MTY".                      
136076    02 WKS-FEC2-ARCH-88  PIC 9(06) VALUE 999999.                              
136078    02 FILLER            PIC X(03) VALUE                                      
136080                         ")"")".                                              
136082                                                                              
136090**************************************************************                
136100                                                                              
136102 01 WKS-COPY-DUMPALL-89.                                                      
136104    02 FILLER            PIC X(35) VALUE                                      
136106                         "BEGIN JOB  S500/VDM/S500EDOCTACPE; ".               
136108    02 FILLER            PIC X(28) VALUE                                      
136110                         "RUN SYSTEM/DUMPALL (""COPY ".                       
136112    02 WKS-NOMB-ARCH-89  PIC X(27) VALUE                                      
136114                         "(S500)S500/FILE/S050/12/12/".                       
136116    02 WKS-FECH-ARCH-89  PIC 9(06) VALUE 999999.                              
136118    02 FILLER            PIC X(30) VALUE                                      
136120                         " (FAMILYNAME=CAPTACION) TO UL ".                    
136122    02 FILLER            PIC X(28) VALUE                                      
136124                         "(KIND=TAPE,TITLE=S500FIOBOTR".                      
136126    02 WKS-FEC2-ARCH-89  PIC 9(06) VALUE 999999.                              
136130    02 FILLER            PIC X(46) VALUE                                      
136132             ",LABEL=STANDARD,MAXRECSIZE=360,BLOCKSIZE=27000".                
136134    02 FILLER            PIC X(28) VALUE                                      
136136             ",FRAMESIZE=8,PROTECTION=SAVE".                                  
136138    02 FILLER            PIC X(03) VALUE                                      
136140                         ")"")".                                              
136200                                                                              
136205* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS           -DDG             
136210* NOMENCLATURA ARCHIVO DE SALDOS DE CHEQUES                                   
136215 01 WKS-DATO-ARCH-CHESDOS.                                                    
136220    02 FILLER                 PIC X(24) VALUE                                 
136225                              "S500/FILE/INTS/50003S02/".                     
136230    02 WKS-CHE-CSIO           PIC 99.                                         
136235    02 FILLER                 PIC X(01) VALUE "/".                            
136240    02 WKS-CHE-FECHA          PIC 9(8).                                       
136245    02 FILLER                 PIC X(09) VALUE                                 
136250                              "/CHESDOS.".                                    
136255* NOMENCLATURA ARCHIVO DE SALDOS DE CUENTA MAESTRA                            
136260 01 WKS-DATO-ARCH-CMASDOS.                                                    
136262    02 FILLER                 PIC X(24) VALUE                                 
136264                              "S500/FILE/INTS/50003S02/".                     
136266    02 WKS-CMA-CSIO           PIC 99.                                         
136268    02 FILLER                 PIC X(01) VALUE "/".                            
136270    02 WKS-CMA-FECHA          PIC 9(8).                                       
136272    02 FILLER                 PIC X(09) VALUE                                 
136274                              "/CMASDOS.".                                    
136276                                                                              
136278 01 WKS-DATO-ARCH-IPAB.                                                       
136280    02 FILLER                 PIC X(24) VALUE                                 
136282                              "S500/FILE/INTS/50022S01/".                     
136284    02 WKS-IPAB-CSIO          PIC 99.                                         
136286    02 FILLER                 PIC X(01) VALUE "/".                            
136288    02 WKS-IPAB-FECHA         PIC 9(8).                                       
136290    02 FILLER                 PIC X(10) VALUE                                 
136292                              "/ARCHIPAB.".                                   
136294                                                                              
136300 01 WKS-ARCH-93-PROB.                                                         
136310    02 FILLER                 PIC X(24) VALUE                                 
136312                              "S500/FILE/INTS/50004S01/".                     
136314    02 WKS-93-CSIO            PIC 99.                                         
136316    02 FILLER                 PIC X(01) VALUE "/".                            
136318    02 WKS-93-FECHA           PIC 9(8).                                       
136320    02 FILLER                 PIC X(06) VALUE                                 
136322                              "/PROB_".                                       
136324    02 WKS-93-COPIA           PIC 99    VALUE 0.                              
136326    02 FILLER                 PIC X     VALUE ".".                            
136328                                                                              
136330 01 WKS-ARCH-94-MONI.                                                         
136332    02 FILLER                 PIC X(24) VALUE                                 
136334                              "S500/FILE/INTS/50004S01/".                     
136336    02 WKS-94-CSIO            PIC 99.                                         
136338    02 FILLER                 PIC X(01) VALUE "/".                            
136340    02 WKS-94-FECHA           PIC 9(8).                                       
136342    02 FILLER                 PIC X(06) VALUE                                 
136343                              "/MONI_".                                       
136344    02 WKS-94-COPIA           PIC 99    VALUE 0.                              
136346    02 FILLER                 PIC X     VALUE ".".                            
136348                                                                              
136350 01 WKS-ARCH-95-RANGOS.                                                       
136352    02 FILLER                 PIC X(24) VALUE                                 
136354                              "S500/FILE/INTS/50004S15/".                     
136356    02 WKS-95-CSIO            PIC 99.                                         
136358    02 FILLER                 PIC X(01) VALUE "/".                            
136360    02 WKS-95-FECHA           PIC 9(8).                                       
136362    02 FILLER                 PIC X(08) VALUE "/RANGOS.".                     
136366                                                                              
136368 01 WKS-ARCH-96-MONITIMES.                                                    
136370    02 FILLER                 PIC X(24) VALUE                                 
136372                              "S500/FILE/INTS/50004S01/".                     
136374    02 WKS-96-CSIO            PIC 99.                                         
136376    02 FILLER                 PIC X(01) VALUE "/".                            
136378    02 WKS-96-FECHA           PIC 9(8).                                       
136380    02 FILLER                 PIC X(06) VALUE                                 
136382                              "/TIMES".                                       
136383    02 FILLER                 PIC X(01) VALUE "/".                            
136384    02 WKS-96-CONSEC          PIC 99    VALUE 0.                              
136386    02 FILLER                 PIC X     VALUE ".".                            
136388                                                                              
136400 01 WKS-ARCH-97-ALERTAS.                                                      
136401    02 FILLER                 PIC X(24) VALUE                                 
136402                              "S500/FILE/INTS/50008S01/".                     
136403    02 WKS-97-CSIO            PIC 99.                                         
136404    02 FILLER                 PIC X(01) VALUE "/".                            
136405    02 WKS-97-FECHA          PIC 9(8).                                        
136406    02 FILLER                 PIC X(09) VALUE                                 
136407                              "/ALERTAS.".                                    
136409                                                                              
136410 01 WKS-ARCH-98-RECH.                                                         
136411    02 FILLER                 PIC X(24) VALUE                                 
136412                              "S500/FILE/INTS/50004S01/".                     
136413    02 WKS-98-CSIO            PIC 99.                                         
136414    02 FILLER                 PIC X(01) VALUE "/".                            
136415    02 WKS-98-FECHA           PIC 9(8).                                       
136416    02 FILLER                 PIC X(06) VALUE                                 
136417                              "/RECH_".                                       
136418    02 WKS-98-COPIA           PIC 99    VALUE 0.                              
136419    02 FILLER                 PIC X     VALUE ".".                            
137800                                                                              
137805******************************************************************            
137810 01 WKS-ARCH-99-S711FRAUDLINK.                                                
137815    02 FILLER                 PIC X(24) VALUE                                 
137820                              "S500/FILE/INTS/50018S01/".                     
137825    02 WKS-99-CSIO            PIC 99.                                         
137830    02 FILLER                 PIC X(01) VALUE "/".                            
137835    02 WKS-99-FECHA           PIC 9(8).                                       
137840    02 FILLER                 PIC X(15) VALUE                                 
137845                              "/S711FRAUDLINK.".                              
137855                                                                              
137857 01 WKS-ARCH-EO-BD-CTAS-ORDNT.                                                
137859    02 FILLER                 PIC X(24) VALUE                                 
137861                              "S500/FILE/INTS/50024S01/".                     
137863    02 WKS-EO-CSI             PIC 99.                                         
137865    02 FILLER                 PIC X(01) VALUE "/".                            
137867    02 WKS-EO-FECHA           PIC 9(08).                                      
137869    02 FILLER                 PIC X(08) VALUE                                 
137871                              "/CTOREP.".                                     
137873                                                                              
137900*********************************************************                     
137901 01 WKS-ARCH-68-PROB.                                                         
137902    02 FILLER                 PIC X(24) VALUE                                 
137903                              "S500/FILE/INTS/50004S01/".                     
137904    02 WKS-68-CSIO            PIC 99.                                         
137905    02 FILLER                 PIC X(01) VALUE "/".                            
137910    02 WKS-68-FECHA           PIC 9(8).                                       
137911    02 FILLER                 PIC X(10) VALUE                                 
137912                              "/PROBP020_".                                   
137913    02 WKS-68-COPIA           PIC 99    VALUE 0.                              
137914    02 FILLER                 PIC X     VALUE ".".                            
137915*********************************************************                     
137916 01 WKS-ARCH-69-MONI.                                                         
137917    02 FILLER                 PIC X(24) VALUE                                 
137918                              "S500/FILE/INTS/50004S01/".                     
137919    02 WKS-69-CSIO            PIC 99.                                         
137920    02 FILLER                 PIC X(01) VALUE "/".                            
137921    02 WKS-69-FECHA           PIC 9(8).                                       
137922    02 FILLER                 PIC X(10) VALUE                                 
137923                              "/MONIP020_".                                   
137924    02 WKS-69-COPIA           PIC 99    VALUE 0.                              
137925    02 FILLER                 PIC X     VALUE ".".                            
137930*********************************************************                     
137932 01 WKS-ARCH-E1-MONIP080.                                                     
137934    02 FILLER                 PIC X(24) VALUE                                 
137936                              "S500/FILE/INTS/50004S01/".                     
137938    02 WKS-E1-CSI             PIC 9(02).                                      
137940    02 FILLER                 PIC X(01) VALUE "/".                            
137942    02 WKS-E1-FECHA           PIC 9(08).                                      
137944    02 FILLER                 PIC X(13) VALUE "/MONIP080/01.".                
137954                                                                              
137956 01 WKS-ARCH-E2-PROBP080.                                                     
137957    02 FILLER                 PIC X(24) VALUE                                 
137958                              "S500/FILE/INTS/50004S01/".                     
137959    02 WKS-E2-CSI             PIC 9(02).                                      
137960    02 FILLER                 PIC X(01) VALUE "/".                            
137961    02 WKS-E2-FECHA           PIC 9(08).                                      
137962    02 FILLER                 PIC X(14) VALUE "/ARCHPROBP080/".               
137964    02 WKS-E2-NUM-COPIA       PIC 9(02).                                      
137966    02 FILLER                 PIC X(01) VALUE ".".                            
137968                                                                              
137970 01 WKS-ARCH-E3-BITAP080.                                                     
137972    02 FILLER                 PIC X(24) VALUE                                 
137974                              "S500/FILE/INTS/50024S01/".                     
137976    02 WKS-E3-CSI             PIC 9(02).                                      
137978    02 FILLER                 PIC X(01) VALUE "/".                            
137980    02 WKS-E3-FECHA           PIC 9(08).                                      
137982    02 FILLER                 PIC X(10) VALUE "/BITCAMNM.".                   
137988                                                                              
137990 01 WKS-ARCH-E4-MONIL081.                                                     
137992    02 FILLER                 PIC X(24) VALUE                                 
137994                              "S500/FILE/INTS/50004S01/".                     
137996    02 WKS-E4-CSI             PIC 9(02).                                      
137998    02 FILLER                 PIC X(01) VALUE "/".                            
138000    02 WKS-E4-FECHA           PIC 9(08).                                      
138001    02 FILLER                 PIC X(10) VALUE "/MONIL081/".                   
138002    02 WKS-E4-NUM-SISTEMA     PIC X(04).                                      
138003    02 FILLER                 PIC X(01) VALUE "/".                            
138004    02 WKS-E4-NUM-MIX         PIC 9(04).                                      
138006    02 FILLER                 PIC X(01) VALUE "/".                            
138008    02 WKS-E4-SECUENCIAL      PIC 9(04).                                      
138010    02 FILLER                 PIC X(01) VALUE ".".                            
138012                                                                              
138014 01 WKS-ARCH-E5-PROBL081.                                                     
138016    02 FILLER                 PIC X(24) VALUE                                 
138018                              "S500/FILE/INTS/50004S01/".                     
138020    02 WKS-E5-CSI             PIC 9(02).                                      
138022    02 FILLER                 PIC X(01) VALUE "/".                            
138024    02 WKS-E5-FECHA           PIC 9(08).                                      
138026    02 FILLER                 PIC X(10) VALUE "/PROBL081/".                   
138027    02 WKS-E5-NUM-SISTEMA     PIC X(04).                                      
138028    02 FILLER                 PIC X(01) VALUE "/".                            
138029    02 WKS-E5-NUM-MIX         PIC 9(04).                                      
138030    02 FILLER                 PIC X(01) VALUE "/".                            
138032    02 WKS-E5-SECUENCIAL      PIC 9(04).                                      
138034    02 FILLER                 PIC X(01) VALUE ".".                            
138036                                                                              
138038 01 WKS-ARCH-E6-APERT-MASIVAS.                                                
138040    02 FILLER                 PIC X(24) VALUE                                 
138042                              "S500/FILE/INTS/50020E01/".                     
138044    02 WKS-E6-CSI             PIC 9(02).                                      
138046    02 FILLER                 PIC X(01) VALUE "/".                            
138048    02 WKS-E6-FECHA           PIC 9(08).                                      
138050    02 FILLER                 PIC X(08) VALUE "/MMASIV/".                     
138052    02 WKS-E6-SECUENCIAL      PIC X(02).                                      
138054    02 FILLER                 PIC X(03) VALUE "-R.".                          
138056                                                                              
138058 01 WKS-ARCH-E7-PROBP142.                                                     
138060    02 FILLER                 PIC X(24) VALUE                                 
138062                              "S500/FILE/INTS/50004S01/".                     
138064    02 WKS-E7-CSI             PIC 9(02).                                      
138066    02 FILLER                 PIC X(01) VALUE "/".                            
138068    02 WKS-E7-FECHA           PIC 9(08).                                      
138070    02 FILLER                 PIC X(10) VALUE "/PROBP142.".                   
138072                                                                              
138074 01 WKS-ARCH-E8-PROB144.                                                      
138076    02 FILLER                 PIC X(24) VALUE                                 
138078                              "S500/FILE/INTS/50004S01/".                     
138080    02 WKS-E8-CSI             PIC 9(02).                                      
138082    02 FILLER                 PIC X(01) VALUE "/".                            
138084    02 WKS-E8-FECHA           PIC 9(08).                                      
138086    02 FILLER                 PIC X(10) VALUE "/PROBP144.".                   
138088                                                                              
138093 01 WKS-ARCH-E9-PGOSPEND.                                                     
138098    02 FILLER                 PIC X(24) VALUE                                 
138103                              "S500/FILE/INTS/50026S01/".                     
138108    02 WKS-E9-CSI             PIC 9(02).                                      
138113    02 FILLER                 PIC X(01) VALUE "/".                            
138118    02 WKS-E9-FECHA           PIC 9(08).                                      
138123    02 FILLER                 PIC X(10) VALUE "/PGOSPEND.".                   
138128                                                                              
138144 01 WKS-ARCH-C5-GBNPSDOS.                                                     
138146    02 FILLER                 PIC X(24) VALUE                                 
138148                              "S500/FILE/INTS/50025S01/".                     
138150    02 WKS-C5-CSI             PIC 99.                                         
138152    02 FILLER                 PIC X(01) VALUE "/".                            
138154    02 WKS-C5-FECHA           PIC 9(08).                                      
138156    02 FILLER                 PIC X(10) VALUE                                 
138158                              "/GBNPSDOS/".                                   
138160    02 WKS-C5-SECUENCIAL      PIC 9(04).                                      
138162    02 FILLER                 PIC X(01) VALUE ".".                            
138164                                                                              
138166 01 WKS-ARCH-C6-GBNPRSLT.                                                     
138168    02 FILLER                 PIC X(24) VALUE                                 
138170                              "S500/FILE/INTS/50025S02/".                     
138172    02 WKS-C6-CSI             PIC 99.                                         
138174    02 FILLER                 PIC X(01) VALUE "/".                            
138176    02 WKS-C6-FECHA           PIC 9(08).                                      
138178    02 FILLER                 PIC X(10) VALUE                                 
138180                              "/GBNPRSLT/".                                   
138182    02 WKS-C6-SECUENCIAL      PIC 9(04).                                      
138184    02 FILLER                 PIC X(01) VALUE ".".                            
138186                                                                              
138200*NOR-INI CONCILIACION EAS-HUB                                                 
138220 01 WKS-ARCH-CONHUB.                                                          
138240    02 FILLER                 PIC X(24) VALUE                                 
138260                              "S500/FILE/INTS/50035S01/".                     
138280    02 WKS-C8-CSI             PIC 99.                                         
138300    02 FILLER                 PIC X(01) VALUE "/".                            
138320    02 WKS-C8-FECHA           PIC 9(08).                                      
138340    02 FILLER                 PIC X(07) VALUE                                 
138360                              "/CONHUB".                                      
138380    02 FILLER                 PIC X(01) VALUE ".".                            
138400*NOR-FIN                                                                      
138420                                                                              
138440 01 WKS-MANE-HOST.                                                            
138800    02 WKS-HOST-ORIG          PIC X(11) VALUE " ".                            
139200    02 WKS-HOST-DEST          PIC X(11) VALUE " ".                            
139210    02 WKS-HOST-DEST-14       PIC X(11) VALUE " ".                            
139220    02 WKS-HOST-DEST-20       PIC X(11) VALUE " ".                            
139300                                                                              
139302  01 WKS-DATO-ARCH-I1.                                                        
139304    02 WKS-USER-ORIG-I1      PIC X(06)  VALUE "(S500)".                       
139306    02 WKS-ARCHIVO-I1.                                                        
139308       04 WKS-ARCH-ORIG-I1   PIC X(15) VALUE                                  
139310                             "S016/FILE/S500/".                               
139312       04 WKS-I1-CSI             PIC 9(02).                                   
139314       04 FILLER                 PIC X(01) VALUE "/".                         
139316       04 FILLER                 PIC X(06) VALUE "DEPURA".                    
139318       04 FILLER                 PIC X(01) VALUE "/".                         
139320       04 WKS-FECH-ARCH-I1   PIC 9(06)  VALUE 999999.                         
139322    02 WKS-PACK-ORIG-I1      PIC X(15)  VALUE "CAPTACION ".                   
139324    02 WKS-USER-DEST-I1      PIC X(06)  VALUE "(S016)".                       
139326    02 WKS-PACK-DEST-I1      PIC X(15)  VALUE "CLIENTES  ".                   
139328                                                                              
139350 01 WKS-NVOHOST-274           PIC 9(03).                                      
139352 01 RD2-WKS-NVOHOST-274       REDEFINES WKS-NVOHOST-274.                      
139354    02 WKS-NVOHOST-274-X      PIC X(03).                                      
139400 01 RD-WKS-NVOHOST-274        REDEFINES WKS-NVOHOST-274.                      
139450    02 WKS-NVOHOST-PROD       PIC 9(01).                                      
139500       88 WKS-PROD-ACT        VALUE 0.                                        
139550       88 WKS-PROD-INI274     VALUE 1.                                        
139600       88 WKS-PROD-VDMOK      VALUE 2.                                        
139650       88 WKS-PROD-MTYOK      VALUE 3.                                        
139660       88 WKS-PROD-PACKOK     VALUE 4.                                        
139680                                                                              
139700    02 WKS-NVOHOST-UAT        PIC 9(01).                                      
139750       88 WKS-UAT-ACT         VALUE 0.                                        
139800       88 WKS-UAT-INI274      VALUE 1.                                        
139850       88 WKS-UAT-VDMOK       VALUE 2.                                        
139900       88 WKS-UAT-MTYOK       VALUE 3.                                        
139910       88 WKS-UAT-PACKOK      VALUE 4.                                        
139930                                                                              
139950    02 WKS-NVOHOST-SIT        PIC 9(01).                                      
139970       88 WKS-SIT-ACT         VALUE 0.                                        
139990       88 WKS-SIT-INI274      VALUE 1.                                        
140000       88 WKS-SIT-PACKOK      VALUE 2.                                        
140050                                                                              
140700****************************************************************              
140705**   SIZE PARAMETRO 192  *******************************                      
140710 01 WKS-PARAM-XFER-XX.                                                        
140715    02 WKS-ADDCOPY-XFER-XX    PIC X(06) VALUE " ADD  ".                       
140720    02 WKS-QUSERORIG-XFER-XX  PIC X(06) VALUE "(S500)".                       
140725    02 WKS-ARCHIORIG-XFER-XX  PIC X(53) VALUE " ".                            
140730    02 FILLER                 PIC X(04) VALUE " AS ".                         
140735    02 WKS-QUSERDEST-XFER-XX  PIC X(06) VALUE "(S500)".                       
140740    02 WKS-ARCHIDEST-XFER-XX  PIC X(53) VALUE " ".                            
140745    02 FILLER                 PIC X(06) VALUE " FROM ".                       
140750    02 WKS-PACK-ORIG-XFER-XX  PIC X(15) VALUE "CAPTACION ".                   
140755    02 FILLER                 PIC X(01) VALUE ",".                            
140760    02 WKS-HOST-ORIG-XFER-XX  PIC X(11) VALUE " ".                            
140765    02 FILLER                 PIC X(04) VALUE " TO ".                         
140770    02 WKS-PACK-DEST-XFER-XX  PIC X(15) VALUE "CAPTACION ".                   
140775    02 FILLER                 PIC X(01) VALUE ",".                            
140780    02 WKS-HOST-DEST-XFER-XX  PIC X(11) VALUE " ".                            
140785                                                                              
140790****************************************************************              
140800                                                                              
141700                                                                              
141800*****************************************************                         
143200                                                                              
143300 01 WKS-FIN-MSG-EX     PIC 9(02) COMP VALUE @00@.                             
143400 01 RD-WKS-FIN-MSG-EX  REDEFINES WKS-FIN-MSG-EX.                              
143500    02 WKS-FIN-MSG     PIC X(01).                                             
143600                                                                              
143700***********************************************************                   
143800                                                                              
143900*****************************************************************             
144000*                                                               *             
144100*       PARAMETROS PARA LA LIBRERIA DE CONTROL DE VERSIONES     *             
144200*                                                               *             
144300*****************************************************************             
144400 77  WKS-88-CTLVERS        PIC 99      COMP  VALUE 0.                         
144500 77  W77-S000-MY-ID        PIC X(12).                                         
144600 77  W77-S000-MY-VERSION   PIC X(08).                                         
144700 01  S000-CTR-LIBID        PIC X(12).                                         
144800 01  S000-CTR-NOMLIB       PIC X(72).                                         
144900 01  S000-CTR-CVEERROR     PIC S9(11)  BINARY.                                
145000                                                                              
145100*****************************************************************             
145200                                                                              
145300************************************************************                  
145400 01 WKS-VARIABLE-PASO.                                                        
145500    02 WKS-HORA-MAQ          PIC 9(8).                                        
145600    02 RD-WKS-HORA-MAQ       REDEFINES WKS-HORA-MAQ.                          
145700       04 WS-HRAMAQ-HH       PIC 9(2).                                        
145800       04 WS-HRAMAQ-MM       PIC 9(2).                                        
145900       04 WS-HRAMAQ-SS       PIC 9(2).                                        
146000       04 WS-HRAMAQ-CC       PIC 9(2).                                        
146100    02 R2-WKS-HORA-MAQ       REDEFINES WKS-HORA-MAQ.                          
146200       04 WS-HRAMAQ-HHMMSS   PIC 9(06).                                       
146300       04 FILLER             PIC 9(02).                                       
146400                                                                              
146500    02 WKS-FECHA-MAQUINA     PIC X(10) TYPE IS NUMERIC-DATE.                  
146600    02 R-WKS-FECHA-MAQUINA   REDEFINES WKS-FECHA-MAQUINA.                     
146700       04 WKS-FECMQ-MES      PIC 9(02).                                       
146800       04 FILLER             PIC X.                                           
146900       04 WKS-FECMQ-DIA      PIC 9(02).                                       
147000       04 FILLER             PIC X.                                           
147100       04 WKS-FECMQ-ANIO     PIC 9(04).                                       
147200                                                                              
147300    02 WKS-FECHA-MAQ-AMD     PIC 9(08).                                       
147400    02 RD-WKS-FECMAQ-AMD     REDEFINES WKS-FECHA-MAQ-AMD.                     
147500       04 WKS-FECMAQ-AAAA    PIC 9(04).                                       
147600       04 WKS-FECMAQ-MM      PIC 9(02).                                       
147700       04 WKS-FECMAQ-DD      PIC 9(02).                                       
147800                                                                              
147900                                                                              
148000**************************************************************                
148600**** PARAMETROS PARA LA BIBLIOTECA DE MENSAJES A OPERADOR LJ                  
148700*************************************************                             
148750**  TIPO-LJ = "I" MSG A CONSOLA Y SUMLOG                                      
148800**  TIPO-LJ = "O" MSG A CONSOLA Y SUMLOG, Y QUEDA EN STOP                     
148850**  TIPO-LJ = "E" MSG A SUMLOG                                                
148860**  TIPO-LJ = "X" MSG A SUMLOG                                                
148900**             X = CUALQUIER LETRA DIFERENTE DE "I" "O".                      
148910**                SE RECOMIENDA UTILIZAR "E".                                 
149000********************************************************                      
149310  77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                              
149315  01 MENSAJE-LJ.                                                              
149320     02 SISTEMA-LJ     PIC X(04).                                             
149325     02 FILLER         PIC X VALUE "/".                                       
149330     02 PASO-LJ        PIC X(04).                                             
149335     02 FILLER         PIC X VALUE "/".                                       
149340     02 MTP-LJ          PIC 9(03).                                            
149345     02 FILLER         PIC X VALUE ":".                                       
149350     02 TIPO-LJ        PIC X.                                                 
149355     02 FILLER         PIC X VALUE ">".                                       
149360     02 CODIGO-LJ      PIC 9(06).                                             
149365     02 FILLER         PIC X VALUE "<".                                       
149370     02 TEXTO-LJ       PIC X(250).                                            
149375 01 WKS-SALIDA-BD      PIC 9 VALUE 0.                                         
149400**************************************************************                
149500 PROCEDURE DIVISION  USING W77-PARAM-WFL.                                     
149600*=======================================                                      
149700 0000000-CTRLPGM.                                                             
149800     PERFORM 1000100-LIBS.                                                    
149900     PERFORM 1000000-INICIO.                                                  
149910                                                                              
149920     IF W77-SIN-TRANSF = 0                                                    
150000        PERFORM 1000200-VALIDA-PARAM                                          
150100        PERFORM 5000000-PRINCIPAL                                             
150110     ELSE                                                                     
150120        MOVE 9 TO W77-SAL-RESULT.                                             
150200                                                                              
150300     SET MYSELF (TASKVALUE)  TO W77-SAL-RESULT.                               
150400                                                                              
150500     STOP RUN.                                                                
150600                                                                              
150700                                                                              
150800****************************************************************              
150900 1000000-INICIO.                                                              
150950                                                                              
151000     PERFORM 1000020-CTRL-BASE.                                               
151010     STRING "PARAMETRO B02 =" WKS-NVOHOST-274                                 
151012             DELIMITED BY SIZE INTO TEXTO-LJ                                  
151014     PERFORM 70000050-CALL-LJ-MSG.                                            
151100                                                                              
151200     ACCEPT WKS-HORA-MAQ         FROM TIME.                                   
151300     ACCEPT WKS-FECHA-MAQUINA    FROM DATE.                                   
151400                                                                              
151700                                                                              
151800     MOVE WKS-FECMQ-ANIO       TO WKS-FECMAQ-AAAA.                            
151900     MOVE WKS-FECMQ-MES        TO WKS-FECMAQ-MM.                              
152000     MOVE WKS-FECMQ-DIA        TO WKS-FECMAQ-DD.                              
152100                                                                              
152200     MOVE ATTRIBUTE HOSTNAME  OF MYSELF TO WKS-MY-HOST.                       
152300                                                                              
152400                                                                              
152420     IF WKS-MY-HOST = "ACYPBETA.           "                                  
152430     OR WKS-MY-HOST = "CACYPBET.           "                                  
152440        MOVE 1 TO W77-ES-DESA                                                 
152450     ELSE                                                                     
152500     IF WKS-MY-HOST = "VDMALFA.            "                                  
152510     OR WKS-MY-HOST = "MONBETA.            "                                  
152520     OR WKS-MY-HOST = "CVDMALF.            "                                  
152530     OR WKS-MY-HOST = "CMONBET.            "                                  
152550        MOVE 1 TO W77-ES-PROD                                                 
152560    ELSE                                                                      
152600     IF WKS-MY-HOST = "ACYPGAMA.           "                                  
152700     OR WKS-MY-HOST = "MONALFA.            "                                  
152710     OR WKS-MY-HOST = "ACYPOMEGA.          "                                  
152720     OR WKS-MY-HOST = "VDMKAPPA.           "                                  
152730     OR WKS-MY-HOST = "CACYPGAM.           "                                  
152740     OR WKS-MY-HOST = "CMONALF.            "                                  
152750        MOVE 1 TO W77-ES-UAT                                                  
152780     ELSE                                                                     
152800     IF WKS-MY-HOST = "VDMBETA.            "                                  
152900     OR WKS-MY-HOST = "SITBETA.            "                                  
152950     OR WKS-MY-HOST = "CVDMBET.            "                                  
153000        MOVE 1 TO W77-ES-SIT                                                  
153010     ELSE                                                                     
153020        MOVE 1 TO W77-ES-UAT.                                                 
153100                                                                              
153200     MOVE WKS-MY-HOST TO WKS-HOST-ORIG.                                       
153300                                                                              
153400     INSPECT WKS-HOST-ORIG REPLACING ALL "." BY " ".                          
153500                                                                              
153510     STRING "HOST =" WKS-HOST-ORIG                                            
153512            " DESA=" W77-ES-DESA                                              
153514            " SIT =" W77-ES-SIT                                               
153516            " UAT =" W77-ES-UAT                                               
153518            " PROD=" W77-ES-PROD                                              
153520            DELIMITED BY SIZE INTO TEXTO-LJ                                   
153522     PERFORM 70000050-CALL-LJ-MSG.                                            
153600                                                                              
153700                                                                              
153800     IF WKS-HOST-ORIG = "ACYPBETA  "                                          
153900        MOVE  04          TO WKS-CSI-ORIG                                     
154000        MOVE  10          TO WKS-CSI-DEST                                     
154100        MOVE "VDMBETA   " TO WKS-HOST-DEST                                    
154200     ELSE                                                                     
154300     IF WKS-HOST-ORIG = "VDMBETA  "                                           
154400        MOVE  10          TO WKS-CSI-ORIG                                     
154500        MOVE  04          TO WKS-CSI-DEST                                     
154600        IF WKS-SIT-PACKOK                                                     
154610           MOVE "SITBETA   " TO WKS-HOST-DEST                                 
154620        ELSE                                                                  
154630           MOVE "ACYPBETA  " TO WKS-HOST-DEST                                 
154700     ELSE                                                                     
154800     IF WKS-HOST-ORIG = "VDMKAPPA  "                                          
154900        MOVE  04          TO WKS-CSI-ORIG                                     
155000        MOVE  10          TO WKS-CSI-DEST                                     
155100        MOVE "ACYPOMEGA " TO WKS-HOST-DEST                                    
155200     ELSE                                                                     
155300     IF WKS-HOST-ORIG = "ACYPGAMA  "                                          
155400        MOVE  10          TO WKS-CSI-ORIG                                     
155500        MOVE  04          TO WKS-CSI-DEST                                     
155600        MOVE "MONALFA   " TO WKS-HOST-DEST                                    
155700     ELSE                                                                     
155800     IF WKS-HOST-ORIG = "MONALFA   "                                          
155900        MOVE  04          TO WKS-CSI-ORIG                                     
156000        MOVE  10          TO WKS-CSI-DEST                                     
156100        MOVE "ACYPGAMA  " TO WKS-HOST-DEST                                    
156200     ELSE                                                                     
156210     IF WKS-HOST-ORIG = "ACYPOMEGA "                                          
156220        MOVE  10          TO WKS-CSI-ORIG                                     
156230        MOVE  04          TO WKS-CSI-DEST                                     
156240        MOVE "VDMKAPPA  " TO WKS-HOST-DEST                                    
156250     ELSE                                                                     
156300     IF WKS-HOST-ORIG = "VDMALFA   "                                          
156400        MOVE  10          TO WKS-CSI-ORIG                                     
156500        MOVE  04          TO WKS-CSI-DEST                                     
156600        MOVE "MONBETA   " TO WKS-HOST-DEST                                    
156700     ELSE                                                                     
156720     IF WKS-HOST-ORIG = "MONBETA   "                                          
156740        MOVE  04          TO WKS-CSI-ORIG                                     
156760        MOVE  10          TO WKS-CSI-DEST                                     
156780        MOVE "VDMALFA   " TO WKS-HOST-DEST                                    
156782*** CITI                                                                      
156783     ELSE                                                                     
156784     IF WKS-HOST-ORIG = "CACYPBET  "                                          
156786        MOVE  04          TO WKS-CSI-ORIG                                     
156788        MOVE  10          TO WKS-CSI-DEST                                     
156790        MOVE "CVDMBET   " TO WKS-HOST-DEST                                    
156792     ELSE                                                                     
156794     IF WKS-HOST-ORIG = "CVDMBET  "                                           
156796        MOVE  10          TO WKS-CSI-ORIG                                     
156798        MOVE  04          TO WKS-CSI-DEST                                     
156800        MOVE "CACYPBET  " TO WKS-HOST-DEST                                    
156802     ELSE                                                                     
156804     IF WKS-HOST-ORIG = "CACYPGAM  "                                          
156806        MOVE  10          TO WKS-CSI-ORIG                                     
156808        MOVE  04          TO WKS-CSI-DEST                                     
156810        MOVE "CMONALF   " TO WKS-HOST-DEST                                    
156812     ELSE                                                                     
156814     IF WKS-HOST-ORIG = "CMONALF   "                                          
156816        MOVE  04          TO WKS-CSI-ORIG                                     
156818        MOVE  10          TO WKS-CSI-DEST                                     
156820        MOVE "CACYPGAM  " TO WKS-HOST-DEST                                    
156822     ELSE                                                                     
156824     IF WKS-HOST-ORIG = "CVDMALF   "                                          
156826        MOVE  10          TO WKS-CSI-ORIG                                     
156828        MOVE  04          TO WKS-CSI-DEST                                     
156830        MOVE "CMONBET   " TO WKS-HOST-DEST                                    
156832     ELSE                                                                     
156834     IF WKS-HOST-ORIG = "CMONBET   "                                          
156836        MOVE  04          TO WKS-CSI-ORIG                                     
156838        MOVE  10          TO WKS-CSI-DEST                                     
156840        MOVE "CVDMALF   " TO WKS-HOST-DEST                                    
156900     ELSE                                                                     
157000        STRING "NO RECONOCE HOST-NAME  " WKS-HOST-ORIG                        
157010               DELIMITED BY SIZE INTO TEXTO-LJ                                
157100        PERFORM 70000050-CALL-LJ-MSG                                          
157110        MOVE 10 TO WKS-CSI-ORIG                                               
157115        MOVE 04 TO WKS-CSI-DEST                                               
157120        MOVE 1  TO W77-SIN-TRANSF.                                            
157200                                                                              
157300                                                                              
157305     IF W88-ES-PROD                                                           
157310        IF WKS-PROD-PACKOK                                                    
157315           MOVE "MONDELTA  " TO WKS-HOST-DEST-14                              
157320           MOVE "VDMDELTA  " TO WKS-HOST-DEST-20                              
157325        ELSE                                                                  
157330        IF WKS-PROD-MTYOK                                                     
157335           MOVE "MONDELTA  " TO WKS-HOST-DEST-14                              
157340           MOVE "VDMALFA   " TO WKS-HOST-DEST-20                              
157345        ELSE                                                                  
157350        IF WKS-PROD-VDMOK                                                     
157355           MOVE "MONBETA   " TO WKS-HOST-DEST-14                              
157360           MOVE "VDMDELTA  " TO WKS-HOST-DEST-20                              
157365        ELSE                                                                  
157366           IF WKS-HOST-ORIG = "MONBETA   " OR "VDMALFA   "                    
157370              MOVE "MONBETA   " TO WKS-HOST-DEST-14                           
157375              MOVE "VDMALFA   " TO WKS-HOST-DEST-20                           
157380           ELSE                                                               
157385              MOVE "CMONBET   " TO WKS-HOST-DEST-14                           
157390              MOVE "CVDMALF   " TO WKS-HOST-DEST-20                           
157400     ELSE                                                                     
157405     IF W88-ES-UAT                                                            
157410        IF WKS-UAT-PACKOK                                                     
157415           MOVE "MONKAPPA  " TO WKS-HOST-DEST-14                              
157420           MOVE "ACYPKAPPA " TO WKS-HOST-DEST-20                              
157425        ELSE                                                                  
157430        IF WKS-UAT-MTYOK                                                      
157435           MOVE "MONKAPPA  " TO WKS-HOST-DEST-14                              
157440           MOVE "ACYPGAMA  " TO WKS-HOST-DEST-20                              
157445        ELSE                                                                  
157450        IF WKS-UAT-VDMOK                                                      
157455           MOVE "MONALFA   " TO WKS-HOST-DEST-14                              
157460           MOVE "ACYPKAPPA " TO WKS-HOST-DEST-20                              
157465        ELSE                                                                  
157466           IF WKS-HOST-ORIG = "ACYPGAMA  " OR "MONALFA   "                    
157470              MOVE "MONALFA   " TO WKS-HOST-DEST-14                           
157475              MOVE "ACYPGAMA  " TO WKS-HOST-DEST-20                           
157477           ELSE                                                               
157479           IF WKS-HOST-ORIG = "ACYPOMEGA  " OR "VDMKAPPA  "                   
157480              MOVE "VDMKAPPA  " TO WKS-HOST-DEST-14                           
157482              MOVE "ACYPOMEGA " TO WKS-HOST-DEST-20                           
157484           ELSE                                                               
157485              MOVE "CMONALF   " TO WKS-HOST-DEST-14                           
157487              MOVE "CACYPGAM  " TO WKS-HOST-DEST-20                           
157500     ELSE                                                                     
157510     IF W88-ES-SIT                                                            
157520        IF WKS-SIT-PACKOK                                                     
157530           MOVE "VDMKAPPA  " TO WKS-HOST-DEST-14                              
157540           MOVE "SITKAPPA  " TO WKS-HOST-DEST-20                              
157550        ELSE                                                                  
157560           MOVE "VDMKAPPA  " TO WKS-HOST-DEST-14                              
157570           MOVE "VDMBETA   " TO WKS-HOST-DEST-20                              
157575           IF WKS-HOST-ORIG =  "CVDMBET   "                                   
157580              MOVE "CVDMBET   " TO WKS-HOST-DEST-14                           
157585              MOVE "CVDMBET   " TO WKS-HOST-DEST-20                           
157590           ELSE                                                               
157595             NEXT SENTENCE                                                    
157600     ELSE                                                                     
157610     IF WKS-HOST-ORIG =  "ACYPBETA "                                          
157620        MOVE "ACYPBETA " TO WKS-HOST-DEST-14                                  
157640        MOVE "ACYPBETA " TO WKS-HOST-DEST-20                                  
157650     ELSE                                                                     
157660        MOVE  "CACYPBET "  TO WKS-HOST-DEST-14                                
157670        MOVE  "CACYPBET "  TO WKS-HOST-DEST-20.                               
157700                                                                              
157705     MOVE ZERO TO W77-SI-AL-274.                                              
157710                                                                              
157715     IF W88-ES-PROD                                                           
157720        IF WKS-NVOHOST-PROD > 0                                               
157725           MOVE 1  TO W77-SI-AL-274.                                          
157730                                                                              
157735     IF W88-ES-UAT                                                            
157740        IF WKS-NVOHOST-UAT  > 0                                               
157745           MOVE 1  TO W77-SI-AL-274.                                          
157750                                                                              
157755     IF W88-ES-SIT                                                            
157760        IF WKS-NVOHOST-SIT  > 0                                               
157765           MOVE 1  TO W77-SI-AL-274.                                          
157770                                                                              
157775     IF W88-ES-DESA                                                           
157777        IF WKS-NVOHOST-SIT > 0                                                
157780           MOVE 1  TO W77-SI-AL-274.                                          
157782                                                                              
157784     IF W77-SI-AL-274 = 1                                                     
157786        MOVE "SI HAGO ENVIO AL S274 " TO TEXTO-LJ                             
157788        PERFORM 70000050-CALL-LJ-MSG                                          
157790     ELSE                                                                     
157792        MOVE "NO HAGO ENVIO AL S274 " TO TEXTO-LJ                             
157794        PERFORM 70000050-CALL-LJ-MSG.                                         
157798                                                                              
157800************************************************************                  
157802 1000020-CTRL-BASE.                                                           
157804                                                                              
157806     PERFORM 1000100-OPEN-BD UNTIL WKS-SALIDA-BD = 1.                         
157808                                                                              
157810     PERFORM 1000022-FIND-B02.                                                
157812                                                                              
157814     IF W77-STA-BASE > 0                                                      
157816        STRING "ERROR FIND B02CONTROL " W77-STA-BASE                          
157818               DELIMITED BY SIZE INTO TEXTO-LJ                                
157820        PERFORM 70000050-CALL-LJ-MSG                                          
157822        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
157824                                                                              
157826     MOVE B02-NVOHOST-S274  TO WKS-NVOHOST-274.                               
157828                                                                              
157830     CLOSE S500BD01CAPTACION.                                                 
157832                                                                              
157834************************************************************                  
157836 1000022-FIND-B02.                                                            
157838     MOVE 0              TO W77-STA-BASE.                                     
157840     FIND FIRST S500B02CONTROL                                                
157842          ON EXCEPTION                                                        
157844             MOVE DMSTATUS(DMCATEGORY) TO W77-STA-BASE.                       
157846                                                                              
157848************************************************************                  
157850 1000100-OPEN-BD.                                                             
157852     MOVE 0 TO  W77-STA-BASE .                                                
157854     OPEN INQUIRY S500BD01CAPTACION                                           
157856          ON EXCEPTION                                                        
157858            MOVE DMSTATUS(DMCATEGORY) TO W77-STA-BASE.                        
157860            IF W77-STA-BASE = 11                                              
157862              STRING "ERROR OPEN DBS50001CAPTACION " W77-STA-BASE             
157864              DELIMITED BY SIZE INTO TEXTO-LJ                                 
157866              PERFORM 70000050-CALL-LJ-MSG                                    
157868              WAIT(2)                                                         
157870            ELSE                                                              
157872              IF W77-STA-BASE = 0                                             
157874                 MOVE 1 TO WKS-SALIDA-BD                                      
157876              ELSE                                                            
157878                 CALL SYSTEM DMTERMINATE.                                     
157880************************************************************                  
157900 1000100-LIBS.                                                                
158000     CHANGE ATTRIBUTE LIBACCESS    OF "CTLVERS" TO BYFUNCTION.                
158100     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVERS" TO "CTLVERS".                 
159400                                                                              
159500     CHANGE ATTRIBUTE LIBACCESS    OF "XFER" TO BYFUNCTION.                   
159600     CHANGE ATTRIBUTE FUNCTIONNAME OF "XFER" TO "XFER".                       
159700                                                                              
159705* R4-COPIAS-2011 ENVIO ARCHIVO DE SALDOS A GENESIS           -DDG             
159710* CHANGE A LA LIBRERIA ADMONXFER TRANSFERENCIAS VIA S022 INTELAR              
159715******************************************************************            
159720     CHANGE ATTRIBUTE LIBACCESS      OF "ADMONXFERS"                          
159725                                     TO BYFUNCTION.                           
159730     CHANGE ATTRIBUTE FUNCTIONNAME   OF "ADMONXFERS"                          
159735                                     TO "ADMONXFERS".                         
159740                                                                              
159800     CHANGE ATTRIBUTE TITLE OF "LIBLJ" TO                                     
159900            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".                  
159920                                                                              
159940     MOVE "S500"       TO SISTEMA-LJ.                                         
159960     MOVE "P197"       TO PASO-LJ.                                            
159980      MOVE 001          TO MTP-LJ.                                            
160000     MOVE 051010       TO CODIGO-LJ.                                          
160005     MOVE "E"          TO TIPO-LJ.                                            
160010     MOVE "S500P197"   TO W77-S000-MY-ID.                                     
160020      MOVE "26MTP001"    TO W77-S000-MY-VERSION.                              
160030                                                                              
160040     CALL "CHECAME IN CTLVERS"                                                
160050           USING   W77-S000-MY-ID                                             
160060                   W77-S000-MY-VERSION                                        
160070           GIVING  S000-CTR-CVEERROR.                                         
160080                                                                              
160090     IF S000-CTR-CVEERROR < 0                                                 
160100        MOVE "ERROR DE VERSION "    TO TEXTO-LJ                               
160130        PERFORM 70000050-CALL-LJ-MSG                                          
160140        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
160150                                                                              
160300****************************************************************              
160400 1000200-VALIDA-PARAM.                                                        
160500     MOVE    W77-PARAM-WFL      TO WKS-PARAM-ENT.                             
160600                                                                              
160700     IF (W88-PAR-OPC1-OK OR W88-PAR-OPC2-OK OR W88-PAR-OPC3-OK OR             
160800         W88-PAR-OPC4-OK OR W88-PAR-OPC5-OK OR W88-PAR-OPCE-OK OR             
160805         W88-PAR-OPCA-OK OR W88-PAR-OPCB-OK OR W88-PAR-OPCR-OK OR             
160810         W88-PAR-OPCM-OK OR W88-PAR-OPCP-OK OR W88-PAR-OPCC-OK OR             
160812         W88-PAR-OPCD-OK OR W88-PAR-OPCI-OK)                                  
160862                                                                              
160900    AND (WKS-PAR-FECHA  IS NUMERIC)                                           
161000    AND (WKS-PAR-FEC-AAAA  > 2016 AND < 2061)                                 
161100    AND (W88-PAR-MM-OK)                                                       
161200    AND (W88-PAR-DD-OK)                                                       
161203        IF WKS-PAR-OPCION = "96"                                              
161204           IF (W88-PAR-DIAG-OK)                                               
161205              AND (WKS-PAR-NUM-CONSEC IS NUMERIC)                             
161206              AND (W88-PAR-CONSEC-OK)                                         
161207              MOVE WKS-PAR-OPCION TO WKS-QUE-OPC                              
161208              PERFORM 1000400-PARAM-FIJO                                      
161209           ELSE                                                               
161210              STRING "ERR PARAM RECIBIDO <", WKS-PARAM-ENT, ">",              
161211                     ", OPCION 96 FECHA AAAAMMDD ",                           
161212                     ", CONSECUTIVO /nn ", WKS-FIN-MSG                        
161213                     DELIMITED BY SIZE INTO TEXTO-LJ                          
161214              PERFORM 70000050-CALL-LJ-MSG                                    
161215              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                         
161216        ELSE                                                                  
161290           MOVE WKS-PAR-OPCION TO WKS-QUE-OPC                                 
161300           PERFORM 1000400-PARAM-FIJO                                         
161400     ELSE                                                                     
161700        STRING "ERR PARAM RECIBIDO <",WKS-PARAM-ENT,">",                      
161800               ", OPCION DE 01-19, 30, 40-41, 51-55,60-61,70-71",             
161805               ",81-89 ",                                                     
161810               ", 90-97, A1-F4, B1-G4, R1-H4, M1-M5, P1-P5 ",                 
161860               ", C1-C2, D1-D2, EO, E1-E9",                                   
161900               "FECHA AAAAMMDD ", WKS-FIN-MSG                                 
162000               DELIMITED BY SIZE INTO TEXTO-LJ                                
162100        PERFORM 70000050-CALL-LJ-MSG                                          
162200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
162300                                                                              
162310     STRING "RECIBO PARAM  <", WKS-PARAM-ENT, ">"                             
162312             DELIMITED BY SIZE INTO TEXTO-LJ                                  
162314     PERFORM 70000050-CALL-LJ-MSG.                                            
162400                                                                              
163200***************************************************************               
163300 1000400-PARAM-FIJO.                                                          
163400*** OPCION DE 01-50 PARA COPIAR DE MTY-A-VDM ********                         
163500     IF W88-PAR-OPC1-OK                                                       
163600        IF WKS-CSI-ORIG = 04                                                  
163700           MOVE WKS-HOST-ORIG     TO WKS-HOST-ORIG-XFER-XX                    
163800           MOVE WKS-HOST-DEST     TO WKS-HOST-DEST-XFER-XX                    
163900        ELSE                                                                  
164000           MOVE WKS-HOST-DEST     TO WKS-HOST-ORIG-XFER-XX                    
164100           MOVE WKS-HOST-ORIG     TO WKS-HOST-DEST-XFER-XX                    
164200     ELSE                                                                     
164300*** OPCION DE 51-79 PARA COPIAR DE VDM-A-MTY ********                         
164400     IF W88-PAR-OPC2-OK                                                       
164500        IF WKS-CSI-ORIG = 10                                                  
164600           MOVE WKS-HOST-ORIG     TO WKS-HOST-ORIG-XFER-XX                    
164700           MOVE WKS-HOST-DEST     TO WKS-HOST-DEST-XFER-XX                    
164800        ELSE                                                                  
164900           MOVE WKS-HOST-DEST     TO WKS-HOST-ORIG-XFER-XX                    
165000           MOVE WKS-HOST-ORIG     TO WKS-HOST-DEST-XFER-XX                    
165100     ELSE                                                                     
165110     IF W88-PAR-OPC5-OK                                                       
165112        MOVE WKS-HOST-ORIG        TO WKS-HOST-ORIG-XFER-XX                    
165114        IF WKS-CSI-ORIG = 04                                                  
165116           MOVE WKS-HOST-DEST-14  TO WKS-HOST-DEST-XFER-XX                    
165118        ELSE                                                                  
165120           MOVE WKS-HOST-DEST-20  TO WKS-HOST-DEST-XFER-XX                    
165170     ELSE                                                                     
165180*** OTRA OPCION QUE NO UTILIZA HOST,S (DUMPALL O INTELAR)                     
165200*68-69,70-71,81-89,90-99,A1-F4,B1-G4,C1-C2,D1-D2,R1-H4,M1-M5,R1-R5            
165300         MOVE WKS-HOST-ORIG       TO WKS-HOST-ORIG-XFER-XX                    
165400         MOVE WKS-HOST-DEST       TO WKS-HOST-DEST-XFER-XX.                   
166000                                                                              
166100     IF WKS-PAR-OPCION = "01"                                                 
166200        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-01                        
166300        MOVE WKS-USER-ORIG-01      TO WKS-QUSERORIG-XFER-XX                   
166310        MOVE WKS-ARCHIVO-01        TO WKS-ARCHIORIG-XFER-XX                   
166320        MOVE WKS-USER-DEST-01      TO WKS-QUSERDEST-XFER-XX                   
166330        MOVE WKS-ARCHIVO-01        TO WKS-ARCHIDEST-XFER-XX                   
166340        MOVE WKS-PACK-ORIG-01      TO WKS-PACK-ORIG-XFER-XX                   
166350        MOVE WKS-PACK-DEST-01      TO WKS-PACK-DEST-XFER-XX                   
166400     ELSE                                                                     
166500     IF WKS-PAR-OPCION = "02"                                                 
166520        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-02                        
166540        MOVE WKS-USER-ORIG-02      TO WKS-QUSERORIG-XFER-XX                   
166560        MOVE WKS-ARCHIVO-02        TO WKS-ARCHIORIG-XFER-XX                   
166600        MOVE WKS-USER-DEST-02      TO WKS-QUSERDEST-XFER-XX                   
166620        MOVE WKS-ARCHIVO-02        TO WKS-ARCHIDEST-XFER-XX                   
166640        MOVE WKS-PACK-ORIG-02      TO WKS-PACK-ORIG-XFER-XX                   
166700        MOVE WKS-PACK-DEST-02      TO WKS-PACK-DEST-XFER-XX                   
166800     ELSE                                                                     
166900     IF WKS-PAR-OPCION = "03"                                                 
167000        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-03                        
167020        MOVE WKS-USER-ORIG-03      TO WKS-QUSERORIG-XFER-XX                   
167040        MOVE WKS-ARCHIVO-03        TO WKS-ARCHIORIG-XFER-XX                   
167060        MOVE WKS-USER-DEST-03      TO WKS-QUSERDEST-XFER-XX                   
167100        MOVE WKS-ARCHIVO-03        TO WKS-ARCHIDEST-XFER-XX                   
167120        MOVE WKS-PACK-ORIG-03      TO WKS-PACK-ORIG-XFER-XX                   
167140        MOVE WKS-PACK-DEST-03      TO WKS-PACK-DEST-XFER-XX                   
167200     ELSE                                                                     
167300     IF WKS-PAR-OPCION = "04"                                                 
167400        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-04                        
167500        MOVE WKS-USER-ORIG-04      TO WKS-QUSERORIG-XFER-XX                   
167520        MOVE WKS-ARCHIVO-04        TO WKS-ARCHIORIG-XFER-XX                   
167530        MOVE WKS-USER-DEST-04      TO WKS-QUSERDEST-XFER-XX                   
167540        MOVE WKS-ARCHIVO-04        TO WKS-ARCHIDEST-XFER-XX                   
167550        MOVE WKS-PACK-ORIG-04      TO WKS-PACK-ORIG-XFER-XX                   
167570        MOVE WKS-PACK-DEST-04      TO WKS-PACK-DEST-XFER-XX                   
167600     ELSE                                                                     
167700     IF WKS-PAR-OPCION = "05"                                                 
167800        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-05                        
167820        MOVE WKS-USER-ORIG-05      TO WKS-QUSERORIG-XFER-XX                   
167840        MOVE WKS-ARCHIVO-05        TO WKS-ARCHIORIG-XFER-XX                   
167900        MOVE WKS-USER-DEST-05      TO WKS-QUSERDEST-XFER-XX                   
167920        MOVE WKS-ARCHIVO-05        TO WKS-ARCHIDEST-XFER-XX                   
167940        MOVE WKS-PACK-ORIG-05      TO WKS-PACK-ORIG-XFER-XX                   
167960        MOVE WKS-PACK-DEST-05      TO WKS-PACK-DEST-XFER-XX                   
168000     ELSE                                                                     
168100     IF WKS-PAR-OPCION = "06"                                                 
168200        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-06                        
168300        MOVE WKS-USER-ORIG-06      TO WKS-QUSERORIG-XFER-XX                   
168320        MOVE WKS-ARCHIVO-06        TO WKS-ARCHIORIG-XFER-XX                   
168330        MOVE WKS-USER-DEST-06      TO WKS-QUSERDEST-XFER-XX                   
168340        MOVE WKS-ARCHIVO-06        TO WKS-ARCHIDEST-XFER-XX                   
168350        MOVE WKS-PACK-ORIG-06      TO WKS-PACK-ORIG-XFER-XX                   
168370        MOVE WKS-PACK-DEST-06      TO WKS-PACK-DEST-XFER-XX                   
168400     ELSE                                                                     
168500     IF WKS-PAR-OPCION = "07"                                                 
168600        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-07                        
168620        MOVE WKS-USER-ORIG-07      TO WKS-QUSERORIG-XFER-XX                   
168640        MOVE WKS-ARCHIVO-07        TO WKS-ARCHIORIG-XFER-XX                   
168700        MOVE WKS-USER-DEST-07      TO WKS-QUSERDEST-XFER-XX                   
168720        MOVE WKS-ARCHIVO-07        TO WKS-ARCHIDEST-XFER-XX                   
168740        MOVE WKS-PACK-ORIG-07      TO WKS-PACK-ORIG-XFER-XX                   
168760        MOVE WKS-PACK-DEST-07      TO WKS-PACK-DEST-XFER-XX                   
168800     ELSE                                                                     
168900     IF WKS-PAR-OPCION = "08"                                                 
169000        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-08                        
169020        MOVE WKS-USER-ORIG-08      TO WKS-QUSERORIG-XFER-XX                   
169040        MOVE WKS-ARCHIVO-08        TO WKS-ARCHIORIG-XFER-XX                   
169060        MOVE WKS-USER-DEST-08      TO WKS-QUSERDEST-XFER-XX                   
169100        MOVE WKS-ARCHIVO-08        TO WKS-ARCHIDEST-XFER-XX                   
169120        MOVE WKS-PACK-ORIG-08      TO WKS-PACK-ORIG-XFER-XX                   
169140        MOVE WKS-PACK-DEST-08      TO WKS-PACK-DEST-XFER-XX                   
169200     ELSE                                                                     
169300     IF WKS-PAR-OPCION = "09"                                                 
169400        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-09                        
169420        MOVE WKS-USER-ORIG-09      TO WKS-QUSERORIG-XFER-XX                   
169440        MOVE WKS-ARCHIVO-09        TO WKS-ARCHIORIG-XFER-XX                   
169460        MOVE WKS-USER-DEST-09      TO WKS-QUSERDEST-XFER-XX                   
169500        MOVE WKS-ARCHIVO-09        TO WKS-ARCHIDEST-XFER-XX                   
169520        MOVE WKS-PACK-ORIG-09      TO WKS-PACK-ORIG-XFER-XX                   
169540        MOVE WKS-PACK-DEST-09      TO WKS-PACK-DEST-XFER-XX                   
169600     ELSE                                                                     
169700     IF WKS-PAR-OPCION = "10"                                                 
169800        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-10                        
169900        MOVE WKS-USER-ORIG-10      TO WKS-QUSERORIG-XFER-XX                   
169910        MOVE WKS-ARCHIVO-10        TO WKS-ARCHIORIG-XFER-XX                   
169920        MOVE WKS-USER-DEST-10      TO WKS-QUSERDEST-XFER-XX                   
169930        MOVE WKS-ARCHIVO-10        TO WKS-ARCHIDEST-XFER-XX                   
169940        MOVE WKS-PACK-ORIG-10      TO WKS-PACK-ORIG-XFER-XX                   
169960        MOVE WKS-PACK-DEST-10      TO WKS-PACK-DEST-XFER-XX                   
170000     ELSE                                                                     
170100     IF WKS-PAR-OPCION = "11"                                                 
170200        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-11                        
170300        MOVE WKS-USER-ORIG-11      TO WKS-QUSERORIG-XFER-XX                   
170310        MOVE WKS-ARCHIVO-11        TO WKS-ARCHIORIG-XFER-XX                   
170320        MOVE WKS-USER-DEST-11      TO WKS-QUSERDEST-XFER-XX                   
170330        MOVE WKS-ARCHIVO-11        TO WKS-ARCHIDEST-XFER-XX                   
170340        MOVE WKS-PACK-ORIG-11      TO WKS-PACK-ORIG-XFER-XX                   
170360        MOVE WKS-PACK-DEST-11      TO WKS-PACK-DEST-XFER-XX                   
170400     ELSE                                                                     
170450     IF WKS-PAR-OPCION = "12"                                                 
170500        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-12                        
170600        MOVE WKS-USER-ORIG-12      TO WKS-QUSERORIG-XFER-XX                   
170610        MOVE WKS-ARCHIVO-12        TO WKS-ARCHIORIG-XFER-XX                   
170620        MOVE WKS-USER-DEST-12      TO WKS-QUSERDEST-XFER-XX                   
170630        MOVE WKS-ARCHIVO-12        TO WKS-ARCHIDEST-XFER-XX                   
170640        MOVE WKS-PACK-ORIG-12      TO WKS-PACK-ORIG-XFER-XX                   
170660        MOVE WKS-PACK-DEST-12      TO WKS-PACK-DEST-XFER-XX                   
170700     ELSE                                                                     
170800     IF WKS-PAR-OPCION = "13"                                                 
170850        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-13                        
170900        MOVE WKS-USER-ORIG-13      TO WKS-QUSERORIG-XFER-XX                   
170950        MOVE WKS-ARCHIVO-13        TO WKS-ARCHIORIG-XFER-XX                   
171000        MOVE WKS-USER-DEST-13      TO WKS-QUSERDEST-XFER-XX                   
171050        MOVE WKS-ARCHIVO-13        TO WKS-ARCHIDEST-XFER-XX                   
171100        MOVE WKS-PACK-ORIG-13      TO WKS-PACK-ORIG-XFER-XX                   
171150        MOVE WKS-PACK-DEST-13      TO WKS-PACK-DEST-XFER-XX                   
171200     ELSE                                                                     
171205     IF WKS-PAR-OPCION = "14"                                                 
171210        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-14                        
171215        MOVE WKS-USER-ORIG-14      TO WKS-QUSERORIG-XFER-XX                   
171220        MOVE WKS-ARCHIVO-14        TO WKS-ARCHIORIG-XFER-XX                   
171225        MOVE WKS-USER-DEST-14      TO WKS-QUSERDEST-XFER-XX                   
171230        MOVE WKS-ARCHIVO-14        TO WKS-ARCHIDEST-XFER-XX                   
171235        MOVE WKS-PACK-ORIG-14      TO WKS-PACK-ORIG-XFER-XX                   
171240        MOVE WKS-PACK-DEST-14      TO WKS-PACK-DEST-XFER-XX                   
171245     ELSE                                                                     
171295     IF WKS-PAR-OPCION = "15"                                                 
171345        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-15                        
171395        MOVE WKS-USER-ORIG-15      TO WKS-QUSERORIG-XFER-XX                   
171445        MOVE WKS-ARCHIVO-15        TO WKS-ARCHIORIG-XFER-XX                   
171495        MOVE WKS-USER-DEST-15      TO WKS-QUSERDEST-XFER-XX                   
171545        MOVE WKS-ARCHIVO-15        TO WKS-ARCHIDEST-XFER-XX                   
171595        MOVE WKS-PACK-ORIG-15      TO WKS-PACK-ORIG-XFER-XX                   
171645        MOVE WKS-PACK-DEST-15      TO WKS-PACK-DEST-XFER-XX                   
171647     ELSE                                                                     
171649     IF WKS-PAR-OPCION = "16"                                                 
171651        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-16                        
171653        MOVE WKS-USER-ORIG-16      TO WKS-QUSERORIG-XFER-XX                   
171655        MOVE WKS-ARCHIVO-16        TO WKS-ARCHIORIG-XFER-XX                   
171657        MOVE WKS-USER-DEST-16      TO WKS-QUSERDEST-XFER-XX                   
171659        MOVE WKS-ARCHIVO-16        TO WKS-ARCHIDEST-XFER-XX                   
171661        MOVE WKS-PACK-ORIG-16      TO WKS-PACK-ORIG-XFER-XX                   
171663        MOVE WKS-PACK-DEST-16      TO WKS-PACK-DEST-XFER-XX                   
171664     ELSE                                                                     
171666     IF WKS-PAR-OPCION = "17"                                                 
171668        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-17                        
171670        MOVE WKS-USER-ORIG-17      TO WKS-QUSERORIG-XFER-XX                   
171672        MOVE WKS-ARCHIVO-17        TO WKS-ARCHIORIG-XFER-XX                   
171674        MOVE WKS-USER-DEST-17      TO WKS-QUSERDEST-XFER-XX                   
171676        MOVE WKS-ARCHIVO-17        TO WKS-ARCHIDEST-XFER-XX                   
171678        MOVE WKS-PACK-ORIG-17      TO WKS-PACK-ORIG-XFER-XX                   
171680        MOVE WKS-PACK-DEST-17      TO WKS-PACK-DEST-XFER-XX                   
171682     ELSE                                                                     
171684     IF WKS-PAR-OPCION = "18"                                                 
171686        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-18                        
171688        MOVE WKS-USER-ORIG-18      TO WKS-QUSERORIG-XFER-XX                   
171690        MOVE WKS-ARCHIVO-18        TO WKS-ARCHIORIG-XFER-XX                   
171691        MOVE WKS-USER-DEST-18      TO WKS-QUSERDEST-XFER-XX                   
171692        MOVE WKS-ARCHIVO-18        TO WKS-ARCHIDEST-XFER-XX                   
171693        MOVE WKS-PACK-ORIG-18      TO WKS-PACK-ORIG-XFER-XX                   
171694        MOVE WKS-PACK-DEST-18      TO WKS-PACK-DEST-XFER-XX                   
171695     ELSE                                                                     
171696     IF WKS-PAR-OPCION = "19"                                                 
171697        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-19                        
171698        MOVE WKS-USER-ORIG-19      TO WKS-QUSERORIG-XFER-XX                   
171699        MOVE WKS-ARCHIVO-19        TO WKS-ARCHIORIG-XFER-XX                   
171700        MOVE WKS-USER-DEST-19      TO WKS-QUSERDEST-XFER-XX                   
171701        MOVE WKS-ARCHIVO-19        TO WKS-ARCHIDEST-XFER-XX                   
171702        MOVE WKS-PACK-ORIG-19      TO WKS-PACK-ORIG-XFER-XX                   
171703        MOVE WKS-PACK-DEST-19      TO WKS-PACK-DEST-XFER-XX                   
171704     ELSE                                                                     
171710     IF WKS-PAR-OPCION = "20"                                                 
171712        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-20                        
171714        MOVE WKS-USER-ORIG-20      TO WKS-QUSERORIG-XFER-XX                   
171716        MOVE WKS-ARCHIVO-20        TO WKS-ARCHIORIG-XFER-XX                   
171718        MOVE WKS-USER-DEST-20      TO WKS-QUSERDEST-XFER-XX                   
171720        MOVE WKS-ARCHIVO-20        TO WKS-ARCHIDEST-XFER-XX                   
171722        MOVE WKS-PACK-ORIG-20      TO WKS-PACK-ORIG-XFER-XX                   
171724        MOVE WKS-PACK-DEST-20      TO WKS-PACK-DEST-XFER-XX                   
171726     ELSE                                                                     
171730     IF WKS-PAR-OPCION = "21"                                                 
171731        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-21                        
171732        MOVE WKS-USER-ORIG-21      TO WKS-QUSERORIG-XFER-XX                   
171733        MOVE WKS-ARCHIVO-21        TO WKS-ARCHIORIG-XFER-XX                   
171734        MOVE WKS-USER-DEST-21      TO WKS-QUSERDEST-XFER-XX                   
171735        MOVE WKS-ARCHIVO-21        TO WKS-ARCHIDEST-XFER-XX                   
171736        MOVE WKS-PACK-ORIG-21      TO WKS-PACK-ORIG-XFER-XX                   
171737        MOVE WKS-PACK-DEST-21      TO WKS-PACK-DEST-XFER-XX                   
171738     ELSE                                                                     
171740     IF WKS-PAR-OPCION = "22"                                                 
171741        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-22                        
171742        MOVE WKS-USER-ORIG-22      TO WKS-QUSERORIG-XFER-XX                   
171743        MOVE WKS-ARCHIVO-22        TO WKS-ARCHIORIG-XFER-XX                   
171744        MOVE WKS-USER-DEST-22      TO WKS-QUSERDEST-XFER-XX                   
171745        MOVE WKS-ARCHIVO-22        TO WKS-ARCHIDEST-XFER-XX                   
171746        MOVE WKS-PACK-ORIG-22      TO WKS-PACK-ORIG-XFER-XX                   
171747        MOVE WKS-PACK-DEST-22      TO WKS-PACK-DEST-XFER-XX                   
171748     ELSE                                                                     
171750     IF WKS-PAR-OPCION = "23"                                                 
171751        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-23                        
171752        MOVE WKS-USER-ORIG-23      TO WKS-QUSERORIG-XFER-XX                   
171753        MOVE WKS-ARCHIVO-23        TO WKS-ARCHIORIG-XFER-XX                   
171754        MOVE WKS-USER-DEST-23      TO WKS-QUSERDEST-XFER-XX                   
171755        MOVE WKS-ARCHIVO-23        TO WKS-ARCHIDEST-XFER-XX                   
171756        MOVE WKS-PACK-ORIG-23      TO WKS-PACK-ORIG-XFER-XX                   
171757        MOVE WKS-PACK-DEST-23      TO WKS-PACK-DEST-XFER-XX                   
171758     ELSE                                                                     
171760     IF WKS-PAR-OPCION = "24"                                                 
171762        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-24                        
171764        MOVE WKS-USER-ORIG-24      TO WKS-QUSERORIG-XFER-XX                   
171766        MOVE WKS-ARCHIVO-24        TO WKS-ARCHIORIG-XFER-XX                   
171768        MOVE WKS-USER-DEST-24      TO WKS-QUSERDEST-XFER-XX                   
171770        MOVE WKS-ARCHIVO-24        TO WKS-ARCHIDEST-XFER-XX                   
171772        MOVE WKS-PACK-ORIG-24      TO WKS-PACK-ORIG-XFER-XX                   
171774        MOVE WKS-PACK-DEST-24      TO WKS-PACK-DEST-XFER-XX                   
171776     ELSE                                                                     
171777     IF WKS-PAR-OPCION = "25"                                                 
171778        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-25                        
171779        MOVE WKS-USER-ORIG-25      TO WKS-QUSERORIG-XFER-XX                   
171780        MOVE WKS-ARCHIVO-25        TO WKS-ARCHIORIG-XFER-XX                   
171781        MOVE WKS-USER-DEST-25      TO WKS-QUSERDEST-XFER-XX                   
171782        MOVE WKS-ARCHIVO-25        TO WKS-ARCHIDEST-XFER-XX                   
171783        MOVE WKS-PACK-ORIG-25      TO WKS-PACK-ORIG-XFER-XX                   
171784        MOVE WKS-PACK-DEST-25      TO WKS-PACK-DEST-XFER-XX                   
171785     ELSE                                                                     
171786     IF WKS-PAR-OPCION = "26"                                                 
171787        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-26                        
171790        MOVE WKS-USER-ORIG-26      TO WKS-QUSERORIG-XFER-XX                   
171791        MOVE WKS-ARCHIVO-26        TO WKS-ARCHIORIG-XFER-XX                   
171792        MOVE WKS-USER-DEST-26      TO WKS-QUSERDEST-XFER-XX                   
171793        MOVE WKS-ARCHIVO-26        TO WKS-ARCHIDEST-XFER-XX                   
171794        MOVE WKS-PACK-ORIG-26      TO WKS-PACK-ORIG-XFER-XX                   
171795        MOVE WKS-PACK-DEST-26      TO WKS-PACK-DEST-XFER-XX                   
171796     ELSE                                                                     
171798     IF WKS-PAR-OPCION = "27"                                                 
171800        MOVE WKS-CSI-ORIG          TO WKS-CSI-ORIG-27                         
171802                                      WKS-CSI-DEST-27                         
171804        MOVE WKS-PAR-FECHA         TO WKS-FECH-ORIG-27                        
171805                                      WKS-FECH-DEST-27                        
171806        MOVE WKS-HOST-ORIG         TO WKS-HOST-ORIG-XFER-XX                   
171807        MOVE WKS-HOST-DEST         TO WKS-HOST-DEST-XFER-XX                   
171808        MOVE WKS-USER-ORIG-27      TO WKS-QUSERORIG-XFER-XX                   
171810        MOVE WKS-ARCHIVO-ORIG-27   TO WKS-ARCHIORIG-XFER-XX                   
171812        MOVE WKS-USER-DEST-27      TO WKS-QUSERDEST-XFER-XX                   
171814        MOVE WKS-ARCHIVO-DEST-27   TO WKS-ARCHIDEST-XFER-XX                   
171816        MOVE WKS-PACK-ORIG-27      TO WKS-PACK-ORIG-XFER-XX                   
171818        MOVE WKS-PACK-DEST-27      TO WKS-PACK-DEST-XFER-XX                   
171820     ELSE                                                                     
171900     IF WKS-PAR-OPCION = "30"                                                 
171902        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-30                        
171904        MOVE WKS-USER-ORIG-30      TO WKS-QUSERORIG-XFER-XX                   
171906        MOVE WKS-ARCHIVO-30        TO WKS-ARCHIORIG-XFER-XX                   
171908        MOVE WKS-USER-DEST-30      TO WKS-QUSERDEST-XFER-XX                   
171910        MOVE WKS-ARCHIVO-30        TO WKS-ARCHIDEST-XFER-XX                   
171912        MOVE WKS-PACK-ORIG-30      TO WKS-PACK-ORIG-XFER-XX                   
171914        MOVE WKS-PACK-DEST-30      TO WKS-PACK-DEST-XFER-XX                   
171920     ELSE                                                                     
171922     IF WKS-PAR-OPCION = "31"                                                 
171924        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-31                        
171926        MOVE WKS-USER-ORIG-31      TO WKS-QUSERORIG-XFER-XX                   
171928        MOVE WKS-ARCHIVO-31        TO WKS-ARCHIORIG-XFER-XX                   
171930        MOVE WKS-USER-DEST-31      TO WKS-QUSERDEST-XFER-XX                   
171932        MOVE WKS-ARCHIVO-31        TO WKS-ARCHIDEST-XFER-XX                   
171934        MOVE WKS-PACK-ORIG-31      TO WKS-PACK-ORIG-XFER-XX                   
171936        MOVE WKS-PACK-DEST-31      TO WKS-PACK-DEST-XFER-XX                   
171938     ELSE                                                                     
171940     IF WKS-PAR-OPCION = "40"                                                 
171945        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-40                        
171950        MOVE WKS-USER-ORIG-40      TO WKS-QUSERORIG-XFER-XX                   
171955        MOVE WKS-ARCHIVO-40        TO WKS-ARCHIORIG-XFER-XX                   
171960        MOVE WKS-USER-DEST-40      TO WKS-QUSERDEST-XFER-XX                   
171965        MOVE WKS-ARCHIVO-40        TO WKS-ARCHIDEST-XFER-XX                   
171970        MOVE WKS-PACK-ORIG-40      TO WKS-PACK-ORIG-XFER-XX                   
171975        MOVE WKS-PACK-DEST-40      TO WKS-PACK-DEST-XFER-XX                   
171980     ELSE                                                                     
171985     IF WKS-PAR-OPCION = "41"                                                 
171990        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-41                        
171995        MOVE WKS-USER-ORIG-41      TO WKS-QUSERORIG-XFER-XX                   
172000        MOVE WKS-ARCHIVO-41        TO WKS-ARCHIORIG-XFER-XX                   
172005        MOVE WKS-USER-DEST-41      TO WKS-QUSERDEST-XFER-XX                   
172010        MOVE WKS-ARCHIVO-41        TO WKS-ARCHIDEST-XFER-XX                   
172015        MOVE WKS-PACK-ORIG-41      TO WKS-PACK-ORIG-XFER-XX                   
172020        MOVE WKS-PACK-DEST-41      TO WKS-PACK-DEST-XFER-XX                   
172025     ELSE                                                                     
172100     IF WKS-PAR-OPCION = "51"                                                 
172200        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-51                        
172220        MOVE WKS-USER-ORIG-51      TO WKS-QUSERORIG-XFER-XX                   
172240        MOVE WKS-ARCHIVO-51        TO WKS-ARCHIORIG-XFER-XX                   
172260        MOVE WKS-USER-DEST-51      TO WKS-QUSERDEST-XFER-XX                   
172300        MOVE WKS-ARCHIVO-51        TO WKS-ARCHIDEST-XFER-XX                   
172320        MOVE WKS-PACK-ORIG-51      TO WKS-PACK-ORIG-XFER-XX                   
172340        MOVE WKS-PACK-DEST-51      TO WKS-PACK-DEST-XFER-XX                   
172400     ELSE                                                                     
172500     IF WKS-PAR-OPCION = "52"                                                 
172600        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-52                        
172620        MOVE WKS-USER-ORIG-52      TO WKS-QUSERORIG-XFER-XX                   
172640        MOVE WKS-ARCHIVO-52        TO WKS-ARCHIORIG-XFER-XX                   
172660        MOVE WKS-USER-DEST-52      TO WKS-QUSERDEST-XFER-XX                   
172700        MOVE WKS-ARCHIVO-52        TO WKS-ARCHIDEST-XFER-XX                   
172720        MOVE WKS-PACK-ORIG-52      TO WKS-PACK-ORIG-XFER-XX                   
172740        MOVE WKS-PACK-DEST-52      TO WKS-PACK-DEST-XFER-XX                   
172750     ELSE                                                                     
172752     IF WKS-PAR-OPCION = "53"                                                 
172754        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-53                        
172756        MOVE WKS-USER-ORIG-53      TO WKS-QUSERORIG-XFER-XX                   
172758        MOVE WKS-ARCHIVO-53        TO WKS-ARCHIORIG-XFER-XX                   
172760        MOVE WKS-USER-DEST-53      TO WKS-QUSERDEST-XFER-XX                   
172762        MOVE WKS-ARCHIVO-53        TO WKS-ARCHIDEST-XFER-XX                   
172764        MOVE WKS-PACK-ORIG-53      TO WKS-PACK-ORIG-XFER-XX                   
172766        MOVE WKS-PACK-DEST-53      TO WKS-PACK-DEST-XFER-XX                   
172780     ELSE                                                                     
172782     IF WKS-PAR-OPCION = "54"                                                 
172784        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-54                        
172786        MOVE WKS-USER-ORIG-54      TO WKS-QUSERORIG-XFER-XX                   
172788        MOVE WKS-ARCHIVO-54        TO WKS-ARCHIORIG-XFER-XX                   
172790        MOVE WKS-USER-DEST-54      TO WKS-QUSERDEST-XFER-XX                   
172792        MOVE WKS-ARCHIVO-54        TO WKS-ARCHIDEST-XFER-XX                   
172794        MOVE WKS-PACK-ORIG-54      TO WKS-PACK-ORIG-XFER-XX                   
172796        MOVE WKS-PACK-DEST-54      TO WKS-PACK-DEST-XFER-XX                   
172800     ELSE                                                                     
172810     IF WKS-PAR-OPCION = "55"                                                 
172812        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-55                        
172814        MOVE WKS-USER-ORIG-55      TO WKS-QUSERORIG-XFER-XX                   
172816        MOVE WKS-ARCHIVO-55        TO WKS-ARCHIORIG-XFER-XX                   
172818        MOVE WKS-USER-DEST-55      TO WKS-QUSERDEST-XFER-XX                   
172820        MOVE WKS-ARCHIVO-55        TO WKS-ARCHIDEST-XFER-XX                   
172822        MOVE WKS-PACK-ORIG-55      TO WKS-PACK-ORIG-XFER-XX                   
172824        MOVE WKS-PACK-DEST-55      TO WKS-PACK-DEST-XFER-XX                   
172826     ELSE                                                                     
172828     IF WKS-PAR-OPCION = "56"                                                 
172830        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-56                        
172832        MOVE WKS-USER-ORIG-56      TO WKS-QUSERORIG-XFER-XX                   
172834        MOVE WKS-ARCHIVO-56        TO WKS-ARCHIORIG-XFER-XX                   
172836        MOVE WKS-USER-DEST-56      TO WKS-QUSERDEST-XFER-XX                   
172838        MOVE WKS-ARCHIVO-56        TO WKS-ARCHIDEST-XFER-XX                   
172840        MOVE WKS-PACK-ORIG-56      TO WKS-PACK-ORIG-XFER-XX                   
172842        MOVE WKS-PACK-DEST-56      TO WKS-PACK-DEST-XFER-XX                   
172844     ELSE                                                                     
172846     IF WKS-PAR-OPCION = "57"                                                 
172848        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-57                        
172850        MOVE WKS-USER-ORIG-57      TO WKS-QUSERORIG-XFER-XX                   
172852        MOVE WKS-ARCHIVO-57        TO WKS-ARCHIORIG-XFER-XX                   
172854        MOVE WKS-USER-DEST-57      TO WKS-QUSERDEST-XFER-XX                   
172856        MOVE WKS-ARCHIVO-57        TO WKS-ARCHIDEST-XFER-XX                   
172858        MOVE WKS-PACK-ORIG-57      TO WKS-PACK-ORIG-XFER-XX                   
172860        MOVE WKS-PACK-DEST-57      TO WKS-PACK-DEST-XFER-XX                   
172862     ELSE                                                                     
172864     IF WKS-PAR-OPCION = "58"                                                 
172866        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-58                        
172868        MOVE WKS-USER-ORIG-58      TO WKS-QUSERORIG-XFER-XX                   
172870        MOVE WKS-ARCHIVO-58        TO WKS-ARCHIORIG-XFER-XX                   
172872        MOVE WKS-USER-DEST-58      TO WKS-QUSERDEST-XFER-XX                   
172874        MOVE WKS-ARCHIVO-58        TO WKS-ARCHIDEST-XFER-XX                   
172876        MOVE WKS-PACK-ORIG-58      TO WKS-PACK-ORIG-XFER-XX                   
172878        MOVE WKS-PACK-DEST-58      TO WKS-PACK-DEST-XFER-XX                   
172880     ELSE                                                                     
173110     IF WKS-PAR-OPCION = "60"                                                 
173111        MOVE WKS-CSI-ORIG     TO WKS-60-CSIO                                  
173112        MOVE WKS-PAR-FECHA    TO WKS-60-FECHA                                 
173113     ELSE                                                                     
173114     IF WKS-PAR-OPCION = "61" OR WKS-PAR-OPCION = "C7"                        
173115        MOVE WKS-CSI-ORIG     TO WKS-61-CSIO                                  
173116        MOVE WKS-PAR-FECHA    TO WKS-61-FECHA                                 
173117     ELSE                                                                     
173119     IF WKS-PAR-OPCION = "62"                                                 
173121        MOVE WKS-CSI-ORIG     TO WKS-62-CSIO                                  
173123        MOVE WKS-PAR-FECHA    TO WKS-62-FECHA                                 
173125     ELSE                                                                     
173127     IF WKS-PAR-OPCION = "63"                                                 
173129        MOVE WKS-CSI-ORIG     TO WKS-63-CSIO                                  
173131        MOVE WKS-PAR-FECHA    TO WKS-63-FECHA                                 
173133     ELSE                                                                     
173135     IF WKS-PAR-OPCION = "65"                                                 
173137        MOVE WKS-CSI-ORIG     TO WKS-65-CSIO                                  
173139        MOVE WKS-PAR-FECHA    TO WKS-65-FECHA                                 
173141     ELSE                                                                     
173143     IF WKS-PAR-OPCION = "66" AND                                             
173145        WKS-CSI-ORIG = 04                                                     
173147        MOVE WKS-PAR-FECHA    TO WKS-66-FECHA                                 
173149     ELSE                                                                     
173151     IF WKS-PAR-OPCION = "67"                                                 
173153        MOVE WKS-CSI-ORIG     TO WKS-67-CSIO                                  
173155        MOVE WKS-PAR-FECHA    TO WKS-67-FECHA                                 
173157     ELSE                                                                     
173159     IF WKS-PAR-OPCION = "68"                                                 
173161        MOVE WKS-CSI-ORIG     TO WKS-68-CSIO                                  
173163        MOVE WKS-PAR-FECHA    TO WKS-68-FECHA                                 
173165     ELSE                                                                     
173167     IF WKS-PAR-OPCION = "69"                                                 
173169        MOVE WKS-CSI-ORIG     TO WKS-69-CSIO                                  
173171        MOVE WKS-PAR-FECHA    TO WKS-69-FECHA                                 
173173     ELSE                                                                     
173175     IF WKS-PAR-OPCION = "70"                                                 
173177     OR W88-PAR-OPCM-OK                                                       
173179        MOVE WKS-CSI-ORIG     TO WKS-70-CSIO                                  
173181        MOVE WKS-PAR-FECHA    TO WKS-70-FECHA                                 
173183     ELSE                                                                     
173185     IF WKS-PAR-OPCION = "71"                                                 
173187     OR W88-PAR-OPCP-OK                                                       
173189        MOVE WKS-CSI-ORIG     TO WKS-71-CSIO                                  
173191        MOVE WKS-PAR-FECHA    TO WKS-71-FECHA                                 
173193     ELSE                                                                     
173195     IF WKS-PAR-OPCION = "72"                                                 
173197        MOVE WKS-CSI-ORIG     TO WKS-72-CSIO                                  
173199        MOVE WKS-PAR-FECHA    TO WKS-72-FECHA                                 
174200     ELSE                                                                     
174220     IF WKS-PAR-OPCION = "73"                                                 
174240        MOVE WKS-CSI-ORIG     TO WKS-73-CSIO                                  
174260        MOVE WKS-PAR-FECHA    TO WKS-73-FECHA                                 
174262     ELSE                                                                     
174264     IF WKS-PAR-OPCION = "74"                                                 
174266        MOVE WKS-CSI-ORIG     TO WKS-74-CSIO                                  
174268        MOVE WKS-PAR-FECHA    TO WKS-74-FECHA                                 
174270     ELSE                                                                     
174272     IF WKS-PAR-OPCION = "75"                                                 
174276        MOVE WKS-PAR-FECHA    TO WKS-75-FECHA                                 
174278     ELSE                                                                     
174280     IF WKS-PAR-OPCION = "76"                                                 
174284        MOVE WKS-PAR-FECHA    TO WKS-76-FECHA                                 
174286     ELSE                                                                     
174288     IF WKS-PAR-OPCION = "77"                                                 
174292        MOVE WKS-PAR-FECHA    TO WKS-77-FECHA                                 
174294     ELSE                                                                     
174296     IF WKS-PAR-OPCION = "78"                                                 
174300        MOVE WKS-PAR-FECHA    TO WKS-78-FECHA                                 
174302     ELSE                                                                     
174304     IF WKS-PAR-OPCION = "79"                                                 
174306        MOVE WKS-CSI-ORIG     TO WKS-79-CSIO                                  
174308        MOVE WKS-PAR-FECHA    TO WKS-79-FECHA                                 
174310     ELSE                                                                     
174312     IF WKS-PAR-OPCION = "80"                                                 
174314        MOVE WKS-CSI-ORIG     TO WKS-IPAB-CSIO                                
174316        MOVE WKS-PAR-FECHA    TO WKS-IPAB-FECHA                               
174318     ELSE                                                                     
174350     IF WKS-PAR-OPCION = "81"                                                 
174400        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-81                            
174500        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-81                            
174600     ELSE                                                                     
174700     IF WKS-PAR-OPCION = "82"                                                 
174800        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-82                            
174900        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-82                            
175000     ELSE                                                                     
175100     IF WKS-PAR-OPCION = "83"                                                 
175200        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-83                            
175300        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-83                            
175400     ELSE                                                                     
175500     IF WKS-PAR-OPCION = "84"                                                 
175600        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-84                            
175700        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-84                            
175800     ELSE                                                                     
175900     IF WKS-PAR-OPCION = "85"                                                 
176000        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-85                            
176100        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-85                            
176200     ELSE                                                                     
176300     IF WKS-PAR-OPCION = "86"                                                 
176400        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-86                            
176500        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-86                            
176600     ELSE                                                                     
176610     IF WKS-PAR-OPCION = "87"                                                 
176612        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-87                            
176614        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-87                            
176616     ELSE                                                                     
176618     IF WKS-PAR-OPCION = "88"                                                 
176620        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-88                            
176622        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-88                            
176630     ELSE                                                                     
176640     IF WKS-PAR-OPCION = "89"                                                 
176642        MOVE WKS-PAR-FECHA     TO WKS-FECH-ARCH-89                            
176644        MOVE WKS-PAR-FECHA     TO WKS-FEC2-ARCH-89                            
176648     ELSE                                                                     
176650*  ENVIO ARCHIVO DE SALDOS A GENESIS Y DATOTECA POR INTELAR                   
176652     IF WKS-PAR-OPCION = "90" OR "91" OR "92"                                 
176654        MOVE  WKS-CSI-ORIG     TO WKS-CHE-CSIO                                
176656                                  WKS-CMA-CSIO                                
176657                                  WKS-73-CSIO                                 
176658        MOVE WKS-PAR-FECHA     TO WKS-CHE-FECHA                               
176660                                  WKS-CMA-FECHA                               
176661                                  WKS-73-FECHA                                
176662     ELSE                                                                     
176664     IF WKS-PAR-OPCION = "93"                                                 
176666     OR W88-PAR-OPCA-OK                                                       
176668        MOVE WKS-CSI-ORIG     TO WKS-93-CSIO                                  
176670        MOVE WKS-PAR-FECHA    TO WKS-93-FECHA                                 
176672     ELSE                                                                     
176674     IF WKS-PAR-OPCION = "94"                                                 
176676     OR W88-PAR-OPCB-OK                                                       
176678        MOVE WKS-CSI-ORIG     TO WKS-94-CSIO                                  
176680        MOVE WKS-PAR-FECHA    TO WKS-94-FECHA                                 
176682     ELSE                                                                     
176684     IF WKS-PAR-OPCION = "95"                                                 
176686        MOVE WKS-CSI-ORIG     TO WKS-95-CSIO                                  
176688        MOVE WKS-PAR-FECHA    TO WKS-95-FECHA                                 
178000     ELSE                                                                     
178003     IF WKS-PAR-OPCION = "96"                                                 
178004        MOVE WKS-CSI-ORIG       TO WKS-96-CSIO                                
178005        MOVE WKS-PAR-FECHA      TO WKS-96-FECHA                               
178006        MOVE WKS-PAR-NUM-CONSEC TO WKS-96-CONSEC                              
178007     ELSE                                                                     
178009     IF WKS-PAR-OPCION = "97"                                                 
178010        MOVE WKS-CSI-ORIG      TO WKS-97-CSIO                                 
178011        MOVE WKS-PAR-FECHA     TO WKS-97-FECHA                                
178012     ELSE                                                                     
178014     IF WKS-PAR-OPCION = "98"                                                 
178016     OR W88-PAR-OPCR-OK                                                       
178018        MOVE WKS-CSI-ORIG     TO WKS-98-CSIO                                  
178020        MOVE WKS-PAR-FECHA    TO WKS-98-FECHA                                 
178022     ELSE                                                                     
178024     IF WKS-PAR-OPCION = "99"                                                 
178026        MOVE WKS-CSI-ORIG     TO WKS-99-CSIO                                  
178028        MOVE WKS-PAR-FECHA    TO WKS-99-FECHA                                 
178030     ELSE                                                                     
178032     IF WKS-PAR-OPCION = "EO"                                                 
178034        MOVE WKS-CSI-ORIG     TO WKS-EO-CSI                                   
178036        MOVE WKS-PAR-FECHA    TO WKS-EO-FECHA                                 
178038     ELSE                                                                     
178047     IF WKS-PAR-OPCION = "E1"                                                 
178048        MOVE WKS-CSI-ORIG     TO WKS-E1-CSI                                   
178049        MOVE WKS-PAR-FECHA    TO WKS-E1-FECHA                                 
178051     ELSE                                                                     
178052     IF WKS-PAR-OPCION = "E2"                                                 
178053        MOVE WKS-CSI-ORIG     TO WKS-E2-CSI                                   
178054        MOVE WKS-PAR-FECHA    TO WKS-E2-FECHA                                 
178055        MOVE 1                TO WKS-E2-NUM-COPIA                             
178056     ELSE                                                                     
178057     IF WKS-PAR-OPCION = "E3"                                                 
178058        MOVE WKS-CSI-ORIG     TO WKS-E3-CSI                                   
178059        MOVE WKS-PAR-FECHA    TO WKS-E3-FECHA                                 
178061     ELSE                                                                     
178062     IF WKS-PAR-OPCION = "E4"                                                 
178063        MOVE WKS-CSI-ORIG     TO WKS-E4-CSI                                   
178064        MOVE WKS-PAR-FECHA    TO WKS-E4-FECHA                                 
178065        MOVE WKS-PAR-SISTEMA  TO WKS-E4-NUM-SISTEMA                           
178066        MOVE WKS-PAR-MIX      TO WKS-E4-NUM-MIX                               
178067        MOVE WKS-PAR-SEC      TO WKS-E4-SECUENCIAL                            
178068     ELSE                                                                     
178069     IF WKS-PAR-OPCION = "E5"                                                 
178070        MOVE WKS-CSI-ORIG     TO WKS-E5-CSI                                   
178071        MOVE WKS-PAR-FECHA    TO WKS-E5-FECHA                                 
178072        MOVE WKS-PAR-SISTEMA  TO WKS-E5-NUM-SISTEMA                           
178073        MOVE WKS-PAR-MIX      TO WKS-E5-NUM-MIX                               
178074        MOVE WKS-PAR-SEC      TO WKS-E5-SECUENCIAL                            
178075     ELSE                                                                     
178076     IF WKS-PAR-OPCION = "E6"                                                 
178078        MOVE WKS-CSI-ORIG       TO WKS-E6-CSI                                 
178079        MOVE WKS-PAR-FECHA      TO WKS-E6-FECHA                               
178080        MOVE WKS-PAR-NUM-CONSEC TO WKS-E6-SECUENCIAL                          
178081     ELSE                                                                     
178082     IF WKS-PAR-OPCION = "E7"                                                 
178083        MOVE WKS-CSI-ORIG       TO WKS-E7-CSI                                 
178084        MOVE WKS-PAR-FECHA      TO WKS-E7-FECHA                               
178085     ELSE                                                                     
178086     IF WKS-PAR-OPCION = "E8"                                                 
178087        MOVE WKS-CSI-ORIG       TO WKS-E8-CSI                                 
178088        MOVE WKS-PAR-FECHA      TO WKS-E8-FECHA                               
178089     ELSE                                                                     
178091     IF WKS-PAR-OPCION = "E9"                                                 
178093        MOVE WKS-CSI-ORIG       TO WKS-E9-CSI                                 
178095        MOVE WKS-PAR-FECHA      TO WKS-E9-FECHA                               
178097     ELSE                                                                     
178100     IF WKS-PAR-OPCION = "C5"                                                 
178101        MOVE WKS-CSI-ORIG       TO WKS-C5-CSI                                 
178102        MOVE WKS-PAR-FECHA      TO WKS-C5-FECHA                               
178103        MOVE WKS-PAR-SISTEMA    TO WKS-C5-SECUENCIAL                          
178104     ELSE                                                                     
178105     IF WKS-PAR-OPCION = "C6"                                                 
178106        MOVE WKS-CSI-ORIG       TO WKS-C6-CSI                                 
178107        MOVE WKS-PAR-FECHA      TO WKS-C6-FECHA                               
178108        MOVE WKS-PAR-SISTEMA    TO WKS-C6-SECUENCIAL                          
178113     ELSE                                                                     
178118     IF WKS-PAR-OPCION = "I1"                                                 
178123        MOVE WKS-CSI-ORIG          TO WKS-I1-CSI                              
178128        MOVE WKS-PAR-FECHA         TO WKS-FECH-ARCH-I1                        
178133        MOVE WKS-USER-ORIG-I1      TO WKS-QUSERORIG-XFER-XX                   
178138        MOVE WKS-ARCHIVO-I1        TO WKS-ARCHIORIG-XFER-XX                   
178143        MOVE WKS-USER-DEST-I1      TO WKS-QUSERDEST-XFER-XX                   
178148        MOVE WKS-ARCHIVO-I1        TO WKS-ARCHIDEST-XFER-XX                   
178150        MOVE WKS-PACK-ORIG-I1      TO WKS-PACK-ORIG-XFER-XX                   
178152        MOVE WKS-PACK-DEST-I1      TO WKS-PACK-DEST-XFER-XX                   
178154        MOVE WKS-HOST-ORIG         TO WKS-HOST-ORIG-XFER-XX                   
178156        MOVE WKS-HOST-ORIG         TO WKS-HOST-DEST-XFER-XX                   
178163     ELSE                                                                     
178168*NOR-INI CONCILIACION EAS-HUB                                                 
178173     IF WKS-PAR-OPCION = "C8"                                                 
178178        MOVE WKS-CSI-ORIG       TO WKS-C8-CSI                                 
178183        MOVE WKS-PAR-FECHA      TO WKS-C8-FECHA                               
178188     ELSE                                                                     
178193*NOR-FIN                                                                      
178198        MOVE "ARCHIVO/ERRONEO " TO WKS-ARCHIDEST-XFER-XX.                     
178199                                                                              
178200***************************************************************               
178300 5000000-PRINCIPAL.                                                           
178310**   IF WKS-HOST-ORIG = "ACYPOMEGA "                                          
178320**      NEXT SENTENCE                                                         
178330**   ELSE                                                                     
178400     IF W88-PAR-OPC1-OK OR W88-PAR-OPC2-OK OR W88-PAR-OPCI-OK                 
178500        PERFORM 5001000-ARMA-PARAM                                            
178510     ELSE                                                                     
178520     IF W88-PAR-OPC5-OK                                                       
178525        IF W77-SI-AL-274 = 1 OR WKS-PAR-OPCION = "31"                         
178530*          IF WKS-HOST-ORIG-XFER-XX = WKS-HOST-DEST-XFER-XX                   
178535*             STRING "NO TRANSFIERE AL MISMO HOST ",                          
178540*                 WKS-QUSERDEST-XFER-XX, WKS-ARCHIDEST-XFER-XX                
178542*                 " AL PACK ", WKS-PACK-DEST-XFER-XX                          
178545*              DELIMITED BY SIZE INTO TEXTO-LJ                                
178550*             PERFORM 70000050-CALL-LJ-MSG                                    
178555*          ELSE                                                               
178560           PERFORM 5001000-ARMA-PARAM                                         
178565        ELSE                                                                  
178570           NEXT SENTENCE                                                      
178600     ELSE                                                                     
178610     IF W88-PAR-OPC3-OK                                                       
178700        PERFORM 5002000-LLAMA-DMPALL                                          
178705     ELSE                                                                     
178710        PERFORM 7003000-ENVIA-S022.                                           
178800                                                                              
178900***************************************************************               
179000 5001000-ARMA-PARAM.                                                          
179100                                                                              
179300     MOVE ZERO               TO WS-TRF-RESULT.                                
179500     MOVE SPACES             TO WS-TRF-COMANDO.                               
179510                                                                              
179520     MOVE 192                TO WS-TRF-TAMACOM.                               
179550     MOVE WKS-PARAM-XFER-XX  TO WS-TRF-COMANDO.                               
179600                                                                              
179620     IF (WKS-PAR-OPCION = "17" AND B02-IND-ENVIOS711 > 0)                     
179640        NEXT SENTENCE                                                         
179660     ELSE                                                                     
179700        PERFORM 5002000-LLAMA-XFER.                                           
179800                                                                              
179900                                                                              
180000                                                                              
180100************************************************************                  
180200 5002000-LLAMA-XFER.                                                          
180300                                                                              
180400     CALL "ENVIA_XFER IN XFER"                                                
180500           USING  WS-TRF-COMANDO                                              
180600                  WS-TRF-TAMACOM                                              
180700          GIVING  WS-TRF-RESULT.                                              
180800                                                                              
180900     MOVE WS-TRF-RESULT  TO W77-SAL-RESULT.                                   
181000                                                                              
181100     IF WS-TRF-RESULT > 0                                                     
181140        MOVE "O" TO TIPO-LJ                                                   
181200        STRING " ERR CALL LIB XFER RS=" W77-SAL-RESULT                        
181300               " TRANSFERIR MANUAL: " WS-TRF-COMANDO,                         
181400               " OK PARA CONTINUAR " WKS-FIN-MSG                              
181500               DELIMITED BY SIZE INTO TEXTO-LJ                                
181600        PERFORM 70000050-CALL-LJ-MSG                                          
181620        MOVE "E"  TO TIPO-LJ                                                  
181700     ELSE                                                                     
181710        STRING " ENVIO " WKS-QUSERDEST-XFER-XX                                
181712                         WKS-ARCHIDEST-XFER-XX                                
181714                     " " WKS-HOST-DEST-XFER-XX                                
181716                     "(" WKS-PACK-DEST-XFER-XX ")"                            
181718               DELIMITED BY SIZE INTO TEXTO-LJ                                
181720        PERFORM 70000050-CALL-LJ-MSG.                                         
182200                                                                              
182300********************************************************                      
182400 5002000-LLAMA-DMPALL.                                                        
182500     MOVE 0 TO W77-SAL-RESULT.                                                
182510                                                                              
182600     IF WKS-PAR-OPCION = "81"                                                 
182700        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-81                           
182800     ELSE                                                                     
182900     IF WKS-PAR-OPCION = "82"                                                 
183000        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-82                           
183100     ELSE                                                                     
183200     IF WKS-PAR-OPCION = "83"                                                 
183300        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-83                           
183400     ELSE                                                                     
183500     IF WKS-PAR-OPCION = "84"                                                 
183600        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-84                           
183700     ELSE                                                                     
183800     IF WKS-PAR-OPCION = "85"                                                 
183900        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-85                           
184000     ELSE                                                                     
184100     IF WKS-PAR-OPCION = "86"                                                 
184200        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-86                           
184210     ELSE                                                                     
184212     IF WKS-PAR-OPCION = "87"                                                 
184214        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-87                           
184216     ELSE                                                                     
184218     IF WKS-PAR-OPCION = "88"                                                 
184220        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-88                           
184230     ELSE                                                                     
184232     IF WKS-PAR-OPCION = "89"                                                 
184234        CALL  SYSTEM WFL  USING WKS-COPY-DUMPALL-89                           
184300     ELSE                                                                     
185900        MOVE 9 TO W77-SAL-RESULT.                                             
186000                                                                              
186100****************************************************                          
186200 70000050-CALL-LJ-MSG.                                                        
186300     CALL "LJ IN LIBLJ" USING CONTADOR-LJ, MENSAJE-LJ.                        
186400                                                                              
186500                                                                              
186600********************************************************                      
186700                                                                              
186800                                                                              
186900***********************************************************                   
187000* R4-COPIAS-2011 ENVIO ARCHIVOS A INTELAR                                     
187100 7003000-ENVIA-S022.                                                          
187101     MOVE ZERO    TO W77-TRF-OK W77-TRF-INTENTO W77-TRF-TIMES.                
187102     MOVE SPACES  TO WS-ARCH-SDOS.                                            
187103     MOVE ZEROS   TO WS77-INTELAR-RESULT.                                     
187104                                                                              
187105     IF WKS-PAR-OPCION = "60"                                                 
187106        PERFORM 7004680-ENVIA-COMPENDEPP                                      
187110     ELSE                                                                     
187112     IF WKS-PAR-OPCION = "61"                                                 
187114        PERFORM 7004690-ENVIA-INCIDENTE 3 TIMES                               
187115     ELSE                                                                     
187116     IF WKS-PAR-OPCION = "62"                                                 
187117        PERFORM 7004680-ENVIA-ISILOANS                                        
187118     ELSE                                                                     
187119     IF WKS-PAR-OPCION = "63"                                                 
187120        PERFORM 7004680-ENVIA-ISILOANS                                        
187121     ELSE                                                                     
187122     IF WKS-PAR-OPCION = "65"                                                 
187123        PERFORM 7004680-ENVIA-HL-ART61                                        
187124     ELSE                                                                     
187125     IF WKS-PAR-OPCION = "66" AND WKS-CSI-ORIG = 04                           
187126        PERFORM 7004680-ENVIA-MOTOR                                           
187127     ELSE                                                                     
187128     IF WKS-PAR-OPCION = "67"                                                 
187129        PERFORM 7004680-ENVIA-CTRLDEPRET                                      
187130     ELSE                                                                     
187131     IF WKS-PAR-OPCION = "68"                                                 
187132        PERFORM 7005100-ENVIA-PROBP020 UNTIL W77-TRF-TIMES = 1                
187133     ELSE                                                                     
187134     IF WKS-PAR-OPCION = "69"                                                 
187135        PERFORM 7005200-ENVIA-MONIP020 UNTIL W77-TRF-TIMES = 1                
187136     ELSE                                                                     
187137     IF WKS-PAR-OPCION = "70" OR W88-PAR-OPCM-OK                              
187138        PERFORM 7004700-ENVIA-MONIP014 UNTIL W77-TRF-TIMES = 1                
187139     ELSE                                                                     
187140     IF WKS-PAR-OPCION = "71" OR W88-PAR-OPCP-OK                              
187141        PERFORM 7004800-ENVIA-PROBP014 UNTIL W77-TRF-TIMES = 1                
187142     ELSE                                                                     
187143     IF WKS-PAR-OPCION = "72"                                                 
187144        PERFORM 7004900-ENVIA-TRPBENEF UNTIL W77-TRF-OK = 1                   
187145     ELSE                                                                     
187146     IF WKS-PAR-OPCION = "73"                                                 
187164        PERFORM 7003050-ENVIA-ESQCONT                                         
187174     ELSE                                                                     
187176     IF WKS-PAR-OPCION = "74"                                                 
187178        PERFORM 7003350-ENVIA-AHOSDOS                                         
187180     ELSE                                                                     
187182     IF WKS-PAR-OPCION = "75"                                                 
187184       PERFORM 7005400-ENVIA-I10-GCE                                          
187186     ELSE                                                                     
187188     IF WKS-PAR-OPCION = "76"                                                 
187190        PERFORM 7005450-ENVIA-I10PS-GCE                                       
187192     ELSE                                                                     
187194     IF WKS-PAR-OPCION = "77"                                                 
187196        PERFORM 7005500-ENVIA-I10PS2-GCE                                      
187198     ELSE                                                                     
187200     IF WKS-PAR-OPCION = "78"                                                 
187202        PERFORM 7005550-ENVIA-I7PRIME-GCE                                     
187204     ELSE                                                                     
187206     IF WKS-PAR-OPCION = "79"                                                 
187208        PERFORM 7005560-ENVIA-FRAUDEINT                                       
187210     ELSE                                                                     
187212     IF WKS-PAR-OPCION = "80"                                                 
187214        PERFORM 7003120-ENVIA-ARCHIPAB                                        
187216     ELSE                                                                     
187250     IF WKS-PAR-OPCION = "90"                                                 
187300        PERFORM 7003100-ENVIA-CHESDOS                                         
187400        PERFORM 7003200-ENVIA-CMASDOS                                         
187450        PERFORM 7003050-ENVIA-ESQCONT                                         
187500     ELSE                                                                     
187600     IF WKS-PAR-OPCION = "91"                                                 
187700        PERFORM 7003100-ENVIA-CHESDOS                                         
187800     ELSE                                                                     
187900     IF WKS-PAR-OPCION = "92"                                                 
188000        PERFORM 7003200-ENVIA-CMASDOS                                         
188010     ELSE                                                                     
188020     IF WKS-PAR-OPCION = "93" OR W88-PAR-OPCA-OK                              
188022        PERFORM 7004100-ENVIA-PROB UNTIL W77-TRF-TIMES = 1                    
188030     ELSE                                                                     
188032     IF WKS-PAR-OPCION = "94" OR W88-PAR-OPCB-OK                              
188034        PERFORM 7004200-ENVIA-MONI UNTIL W77-TRF-TIMES = 1                    
188036     ELSE                                                                     
188038     IF WKS-PAR-OPCION = "95"                                                 
188040        PERFORM 7004300-ENVIA-RANGOS                                          
188100     ELSE                                                                     
188102     IF WKS-PAR-OPCION = "96"                                                 
188104        PERFORM 7004400-ENVIA-MONI-TIMES UNTIL W77-TRF-TIMES = 1              
188106     ELSE                                                                     
188109     IF WKS-PAR-OPCION = "97"                                                 
188110        PERFORM 7004500-ENVIA-ARCH-ALERTAS                                    
188111     ELSE                                                                     
188114     IF WKS-PAR-OPCION = "98" OR W88-PAR-OPCR-OK                              
188116        PERFORM 7004600-ENVIA-RECH UNTIL W77-TRF-TIMES = 1                    
188118     ELSE                                                                     
188138     IF WKS-PAR-OPCION = "99"                                                 
188158        PERFORM 7006000-ENVIA-S711FRAUDLINK                                   
188178     ELSE                                                                     
188179     IF WKS-PAR-OPCION = "EO"                                                 
188180        PERFORM 7006100-ENVIA-BD-CTAS-ORDNT                                   
188181     ELSE                                                                     
188185     IF WKS-PAR-OPCION = "E1"                                                 
188186        PERFORM 7006100-ENVIA-MONIT-P080                                      
188188     ELSE                                                                     
188189     IF WKS-PAR-OPCION = "E2"                                                 
188190        PERFORM 7006200-ENVIA-PROBL-P080                                      
188191                UNTIL WKS-E2-NUM-COPIA > 2                                    
188192     ELSE                                                                     
188193     IF WKS-PAR-OPCION = "E3"                                                 
188194        PERFORM 7006300-ENVIA-BITA-P080                                       
188195     ELSE                                                                     
188196     IF WKS-PAR-OPCION = "E4"                                                 
188197        PERFORM 7006300-ENVIA-MONIT-L081                                      
188198     ELSE                                                                     
188199     IF WKS-PAR-OPCION = "E5"                                                 
188200        PERFORM 7006400-ENVIA-PROBL-L081                                      
188201     ELSE                                                                     
188202     IF WKS-PAR-OPCION = "E6"                                                 
188203        PERFORM 7006500-ENVIA-APERT-MASIV                                     
188204     ELSE                                                                     
188205     IF WKS-PAR-OPCION = "E7"                                                 
188206        PERFORM 7006600-ENVIA-PROBL-P142                                      
188207     ELSE                                                                     
188208     IF WKS-PAR-OPCION = "E8"                                                 
188209        PERFORM 7006700-ENVIA-PROBL-P144                                      
188210     ELSE                                                                     
188212     IF WKS-PAR-OPCION = "E9"                                                 
188214        PERFORM 7006700-ENVIA-PGOSPEND                                        
188216     ELSE                                                                     
188217     IF WKS-PAR-OPCION = "C5"                                                 
188218        PERFORM 7007000-ENVIA-GBNPSDOS                                        
188219     ELSE                                                                     
188220     IF WKS-PAR-OPCION = "C6"                                                 
188221        PERFORM 7007100-ENVIA-GBNPRSLT                                        
188222     ELSE                                                                     
188242     IF WKS-PAR-OPCION = "C7"                                                 
188262        PERFORM 7004690-ENVIA-INC-186                                         
188264*NOR-INI CONCILIACION EAS-HUB                                                 
188266     ELSE                                                                     
188268     IF WKS-PAR-OPCION = "C8"                                                 
188270        PERFORM 7007200-ENVIA-CONHUB                                          
188272*NOR-FIN                                                                      
188282     ELSE                                                                     
188299        MOVE 9 TO W77-SAL-RESULT.                                             
188300*                                                                             
188302 7003050-ENVIA-ESQCONT.                                                       
188304     MOVE SPACES                   TO WS-ARCH-SDOS.                           
188306     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
188308     MOVE WKS-ARCH-73-ESQCONT      TO WS-ARCH-SDOS.                           
188310     CALL "INTELARSND IN ADMONXFERS"                                          
188312                                USING WS-ARCH-SDOS                            
188314                               GIVING WS77-INTELAR-RESULT.                    
188316*                                                                             
188318     IF WS77-INTELAR-RESULT NOT = 0                                           
188320        WAIT (60)                                                             
188322        MOVE SPACES                TO WS-ARCH-SDOS                            
188324        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
188326        MOVE WKS-ARCH-73-ESQCONT   TO WS-ARCH-SDOS                            
188328        CALL "INTELARSND IN ADMONXFERS"                                       
188330                                USING WS-ARCH-SDOS                            
188332                               GIVING WS77-INTELAR-RESULT                     
188334*                                                                             
188336        IF WS77-INTELAR-RESULT NOT = 0                                        
188338           MOVE "O"                   TO TIPO-LJ                              
188340           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
188342           STRING "ERROR AL ENVIAR ARCHIVO ESQCONT RS="                       
188344                                 WS-RESULT-N1                                 
188346                  " TRANSFERIR MANUAL OPC=73 AAAAMMDD"                        
188348                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
188350           DELIMITED BY SIZE INTO TEXTO-LJ                                    
188352           PERFORM 70000050-CALL-LJ-MSG                                       
188354        ELSE                                                                  
188356           MOVE "E"                       TO TIPO-LJ                          
188358           MOVE "ARCHIVO ESQCONT ENVIADO" TO TEXTO-LJ                         
188360           PERFORM 70000050-CALL-LJ-MSG                                       
188362     ELSE                                                                     
188364        MOVE "E"                          TO TIPO-LJ                          
188366        MOVE "ARCHIVO ESQCONT ENVIADO"    TO TEXTO-LJ                         
188368        PERFORM 70000050-CALL-LJ-MSG.                                         
188370*                                                                             
188400 7003100-ENVIA-CHESDOS.                                                       
188405*    CHANGE ATTRIBUTE TITLE OF CTOCHE TO WKS-DATO-ARCH-CHESDOS.               
188410*    IF ATTRIBUTE RESIDENT  OF CTOCHE IS TRUE                                 
188415*       MOVE "O"                   TO TIPO-LJ                                 
188420*       STRING "ERROR NO EXISTE ARCHIVOS CHESDOS "                            
188425*                                  WKS-DATO-ARCH-CHESDOS                      
188430*              " OK PARA CONTINUAR " WKS-FIN-MSG                              
188435*       DELIMITED BY SIZE INTO TEXTO-LJ                                       
188440*       PERFORM 70000050-CALL-LJ-MSG                                          
188445*    ELSE                                                                     
188500     MOVE SPACES                   TO WS-ARCH-SDOS.                           
188600     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
188700     MOVE WKS-DATO-ARCH-CHESDOS    TO WS-ARCH-SDOS.                           
188800     CALL "INTELARSND IN ADMONXFERS"                                          
188900                                USING WS-ARCH-SDOS                            
189000                               GIVING WS77-INTELAR-RESULT.                    
189100*                                                                             
189200     IF WS77-INTELAR-RESULT NOT = 0                                           
189300        WAIT (60)                                                             
189400        MOVE SPACES                TO WS-ARCH-SDOS                            
189500        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
189600        MOVE WKS-DATO-ARCH-CHESDOS TO WS-ARCH-SDOS                            
189700        CALL "INTELARSND IN ADMONXFERS"                                       
189800                                USING WS-ARCH-SDOS                            
189900                               GIVING WS77-INTELAR-RESULT                     
190000*                                                                             
190100        IF WS77-INTELAR-RESULT NOT = 0                                        
190200           MOVE "O"                   TO TIPO-LJ                              
190300           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
190400           STRING "ERROR AL ENVIAR ARCHIVO CHESDOS RS="                       
190500                                 WS-RESULT-N1                                 
190600                  " TRANSFERIR MANUAL OPC=91 AAAAMMDD"                        
190700                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
190800           DELIMITED BY SIZE INTO TEXTO-LJ                                    
190900           PERFORM 70000050-CALL-LJ-MSG                                       
191000        ELSE                                                                  
191100           MOVE "E"                       TO TIPO-LJ                          
191200           MOVE "ARCHIVO CHESDOS ENVIADO" TO TEXTO-LJ                         
191300           PERFORM 70000050-CALL-LJ-MSG                                       
191400     ELSE                                                                     
191500        MOVE "E"                          TO TIPO-LJ                          
191600        MOVE "ARCHIVO CHESDOS ENVIADO"    TO TEXTO-LJ                         
191700        PERFORM 70000050-CALL-LJ-MSG.                                         
191800*                                                                             
191900 7003200-ENVIA-CMASDOS.                                                       
191905*    CHANGE ATTRIBUTE TITLE OF CTOCMA TO WKS-DATO-ARCH-CMASDOS.               
191910*    IF ATTRIBUTE RESIDENT  OF CTOCMA = 0                                     
191915*       MOVE "O"                   TO TIPO-LJ                                 
191920*       STRING "ERROR NO EXISTE ARCHIVOS CMASDOS "                            
191925*                                  WKS-DATO-ARCH-CMASDOS                      
191930*              " OK PARA CONTINUAR " WKS-FIN-MSG                              
191935*       DELIMITED BY SIZE INTO TEXTO-LJ                                       
191940*       PERFORM 70000050-CALL-LJ-MSG                                          
191945*    ELSE                                                                     
192000     MOVE SPACES                   TO WS-ARCH-SDOS                            
192100     MOVE ZEROS                    TO WS77-INTELAR-RESULT                     
192200     MOVE WKS-DATO-ARCH-CMASDOS    TO WS-ARCH-SDOS                            
192300     CALL "INTELARSND IN ADMONXFERS"                                          
192400                                USING WS-ARCH-SDOS                            
192500                               GIVING WS77-INTELAR-RESULT                     
192600*                                                                             
192700     IF WS77-INTELAR-RESULT NOT = 0                                           
192800        WAIT (60)                                                             
192900        MOVE SPACES                TO WS-ARCH-SDOS                            
193000        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
193100        MOVE WKS-DATO-ARCH-CMASDOS TO WS-ARCH-SDOS                            
193200        CALL "INTELARSND IN ADMONXFERS"                                       
193300                                USING WS-ARCH-SDOS                            
193400                               GIVING WS77-INTELAR-RESULT                     
193500*                                                                             
193600        IF WS77-INTELAR-RESULT NOT = 0                                        
193700           MOVE "O"                   TO TIPO-LJ                              
193800           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
193900           STRING "ERROR AL ENVIAR ARCHIVO CMASDOS RS="                       
194000                                 WS-RESULT-N1                                 
194100                  " TRANSFERIR MANUAL OPC=92 AAAAMMDD"                        
194200                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
194300           DELIMITED BY SIZE INTO TEXTO-LJ                                    
194400           PERFORM 70000050-CALL-LJ-MSG                                       
194500        ELSE                                                                  
194600           MOVE "E"                       TO TIPO-LJ                          
194700           MOVE "ARCHIVO CMASDOS ENVIADO" TO TEXTO-LJ                         
194800           PERFORM 70000050-CALL-LJ-MSG                                       
194900     ELSE                                                                     
195000        MOVE "E"                          TO TIPO-LJ                          
195100        MOVE "ARCHIVO CMASDOS ENVIADO"    TO TEXTO-LJ                         
195102        PERFORM 70000050-CALL-LJ-MSG.                                         
195104                                                                              
195106 7003120-ENVIA-ARCHIPAB.                                                      
195108     MOVE SPACES                   TO WS-ARCH-SDOS.                           
195110     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
195112     MOVE WKS-DATO-ARCH-IPAB       TO WS-ARCH-SDOS.                           
195114     CALL "INTELARSND IN ADMONXFERS"                                          
195116                                USING WS-ARCH-SDOS                            
195118                               GIVING WS77-INTELAR-RESULT.                    
195120*                                                                             
195122     IF WS77-INTELAR-RESULT NOT = 0                                           
195124        WAIT (60)                                                             
195126        MOVE SPACES                TO WS-ARCH-SDOS                            
195128        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
195130        MOVE WKS-DATO-ARCH-IPAB    TO WS-ARCH-SDOS                            
195132        CALL "INTELARSND IN ADMONXFERS"                                       
195134                                USING WS-ARCH-SDOS                            
195136                               GIVING WS77-INTELAR-RESULT                     
195138*                                                                             
195140        IF WS77-INTELAR-RESULT NOT = 0                                        
195142           MOVE "O"                   TO TIPO-LJ                              
195144           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
195146           STRING "ERROR AL ENVIAR ARCHIVO ARCHIPAB RS="                      
195148                                 WS-RESULT-N1                                 
195150                  " TRANSFERIR MANUAL OPC=80 AAAAMMDD"                        
195152                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
195154           DELIMITED BY SIZE INTO TEXTO-LJ                                    
195156           PERFORM 70000050-CALL-LJ-MSG                                       
195158        ELSE                                                                  
195160           MOVE "E"                       TO TIPO-LJ                          
195162           MOVE "ARCHIVO ARCHIPAB ENVIADO" TO TEXTO-LJ                        
195164           PERFORM 70000050-CALL-LJ-MSG                                       
195166     ELSE                                                                     
195168        MOVE "E"                          TO TIPO-LJ                          
195170        MOVE "ARCHIVO ARCHIPAB ENVIADO"    TO TEXTO-LJ                        
195172        PERFORM 70000050-CALL-LJ-MSG.                                         
195174*                                                                             
195176                                                                              
195202**************************************************************                
195203 7005200-ENVIA-MONIP020.                                                      
195204     IF W88-PAR-OPCD-OK                                                       
195205        MOVE WKS-Q-OPC-2D  TO WKS-69-COPIA                                    
195206     ELSE                                                                     
195207        ADD  1       TO WKS-69-COPIA.                                         
195208                                                                              
195209     MOVE 0       TO W77-TRF-INTENTO.                                         
195210     MOVE 0       TO W77-TRF-OK.                                              
195211                                                                              
195212     PERFORM 7005250-MONIP020-1X1 UNTIL W77-TRF-OK = 1.                       
195213                                                                              
195214     IF W88-PAR-OPCB-OK                                                       
195215     OR WKS-69-COPIA = 5                                                      
195216        MOVE 1    TO  W77-TRF-TIMES.                                          
195217 7005250-MONIP020-1X1.                                                        
195218    ADD  1                        TO W77-TRF-INTENTO.                         
195219    MOVE SPACES                   TO WS-ARCH-SDOS.                            
195220    MOVE ZEROS                    TO WS77-INTELAR-RESULT.                     
195221    MOVE WKS-ARCH-69-MONI         TO WS-ARCH-SDOS.                            
195222    CALL "INTELARSND IN ADMONXFERS"                                           
195223         USING  WS-ARCH-SDOS                                                  
195224         GIVING WS77-INTELAR-RESULT.                                          
195225                                                                              
195226    IF WS77-INTELAR-RESULT NOT = 0                                            
195227       IF W77-TRF-INTENTO = 1                                                 
195228          WAIT (05)                                                           
195229       ELSE                                                                   
195230          MOVE "E"                   TO TIPO-LJ                               
195231          MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                          
195232          MOVE WKS-69-COPIA          TO WKS-PN-REPRO                          
195233          MOVE "M"                   TO WKS-PA-REPRO                          
195234          MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                           
195235          STRING "ERR ENVIO " WKS-ARCH-69-MONI                                
195236                 ", RESULT=" WS-RESULT-N1                                     
195237                 DELIMITED BY SIZE INTO TEXTO-LJ                              
195238          PERFORM 70000050-CALL-LJ-MSG                                        
195239**         MOVE "O"                   TO TIPO-LJ                              
195240           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
195241                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
195242                  DELIMITED BY SIZE INTO TEXTO-LJ                             
195243           PERFORM 70000050-CALL-LJ-MSG                                       
195244**         MOVE "E"                   TO TIPO-LJ                              
195245           MOVE 1                     TO W77-TRF-OK                           
195246     ELSE                                                                     
195247        STRING "ARCHIVO ", WKS-ARCH-69-MONI                                   
195248               ", ENVIADO "                                                   
195249               DELIMITED BY SIZE INTO TEXTO-LJ                                
195250        PERFORM 70000050-CALL-LJ-MSG                                          
195251        MOVE 1                     TO W77-TRF-OK.                             
195252**************************************************************                
195253 7005100-ENVIA-PROBP020.                                                      
195254     IF W88-PAR-OPCC-OK                                                       
195255        MOVE WKS-Q-OPC-2D  TO WKS-68-COPIA                                    
195256     ELSE                                                                     
195257        ADD  1       TO WKS-68-COPIA.                                         
195258     MOVE 0       TO W77-TRF-INTENTO.                                         
195259     MOVE 0       TO W77-TRF-OK.                                              
195260                                                                              
195261     PERFORM 7005150-PROBP020-1X1 UNTIL W77-TRF-OK = 1.                       
195262                                                                              
195263     IF W88-PAR-OPCC-OK                                                       
195264     OR WKS-68-COPIA = 5                                                      
195265        MOVE 1    TO  W77-TRF-TIMES.                                          
195266 7005150-PROBP020-1X1.                                                        
195267     ADD  1                        TO W77-TRF-INTENTO.                        
195268     MOVE SPACES                   TO WS-ARCH-SDOS.                           
195269     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
195270     MOVE WKS-ARCH-68-PROB         TO WS-ARCH-SDOS.                           
195271     CALL "INTELARSND IN ADMONXFERS"                                          
195272          USING  WS-ARCH-SDOS                                                 
195273          GIVING WS77-INTELAR-RESULT.                                         
195274     IF WS77-INTELAR-RESULT NOT = 0                                           
195275        IF W77-TRF-INTENTO = 1                                                
195276           WAIT (05)                                                          
195277        ELSE                                                                  
195278           MOVE "E"                   TO TIPO-LJ                              
195279           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
195280           MOVE WKS-68-COPIA          TO WKS-PN-REPRO                         
195281           MOVE "A"                   TO WKS-PA-REPRO                         
195282           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
195283           STRING "ERR ENVIO " WKS-ARCH-68-PROB                               
195284                  ", RESULT=" WS-RESULT-N1                                    
195285                  DELIMITED BY SIZE INTO TEXTO-LJ                             
195286           PERFORM 70000050-CALL-LJ-MSG                                       
195287**         MOVE "O"                   TO TIPO-LJ                              
195288           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
195289                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
195290                  DELIMITED BY SIZE INTO TEXTO-LJ                             
195291           PERFORM 70000050-CALL-LJ-MSG                                       
195292**         MOVE "E"                   TO TIPO-LJ                              
195293           MOVE 1                     TO W77-TRF-OK                           
195294     ELSE                                                                     
195295        STRING "ARCHIVO ", WKS-ARCH-68-PROB                                   
195296               ", ENVIADO "                                                   
195297               DELIMITED BY SIZE INTO TEXTO-LJ                                
195298        PERFORM 70000050-CALL-LJ-MSG                                          
195299        MOVE 1                     TO W77-TRF-OK.                             
195310**************************************************************                
195312 7003350-ENVIA-AHOSDOS.                                                       
195314      MOVE SPACES                   TO WS-ARCH-SDOS.                          
195316      MOVE ZEROS                    TO WS77-INTELAR-RESULT.                   
195318      MOVE WKS-ARCH-74-AHOSDOS      TO WS-ARCH-SDOS.                          
195320      CALL "INTELARSND IN ADMONXFERS"                                         
195322                                 USING WS-ARCH-SDOS                           
195324                                GIVING WS77-INTELAR-RESULT.                   
195326*                                                                             
195328      IF WS77-INTELAR-RESULT NOT = 0                                          
195330         WAIT (60)                                                            
195332         MOVE SPACES                TO WS-ARCH-SDOS                           
195334         MOVE ZEROS                 TO WS77-INTELAR-RESULT                    
195336         MOVE WKS-ARCH-74-AHOSDOS   TO WS-ARCH-SDOS                           
195338         CALL "INTELARSND IN ADMONXFERS"                                      
195340                                USING WS-ARCH-SDOS                            
195342                               GIVING WS77-INTELAR-RESULT                     
195344*                                                                             
195346        IF WS77-INTELAR-RESULT NOT = 0                                        
195348           MOVE "O"                   TO TIPO-LJ                              
195350           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
195352           STRING "ERROR AL ENVIAR ARCHIVO AHOSDOS RS="                       
195354                                 WS-RESULT-N1                                 
195356                  " TRANSFERIR MANUAL OPC=74 AAAAMMDD"                        
195358                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
195360           DELIMITED BY SIZE INTO TEXTO-LJ                                    
195362           PERFORM 70000050-CALL-LJ-MSG                                       
195364        ELSE                                                                  
195366           MOVE "E"                       TO TIPO-LJ                          
195368           MOVE "ARCHIVO AHOSDOS ENVIADO" TO TEXTO-LJ                         
195370           PERFORM 70000050-CALL-LJ-MSG                                       
195372     ELSE                                                                     
195374        MOVE "E"                          TO TIPO-LJ                          
195376        MOVE "ARCHIVO AHOSDOS ENVIADO"    TO TEXTO-LJ                         
195378        PERFORM 70000050-CALL-LJ-MSG.                                         
195380*                                                                             
195400 7004100-ENVIA-PROB.                                                          
195401     IF W88-PAR-OPCA-OK                                                       
195402        MOVE WKS-Q-OPC-2D  TO WKS-93-COPIA                                    
195403        IF WKS-Q-OPC-1D = "F"                                                 
195404           ADD 10          TO WKS-93-COPIA                                    
195405        ELSE                                                                  
195406           NEXT SENTENCE                                                      
195407     ELSE                                                                     
195410        ADD  1       TO WKS-93-COPIA.                                         
195415                                                                              
195420     MOVE 0       TO W77-TRF-INTENTO.                                         
195430     MOVE 0       TO W77-TRF-OK.                                              
195440                                                                              
195450     PERFORM 7004150-PROB-1X1 UNTIL W77-TRF-OK = 1.                           
195451                                                                              
195452     IF W88-PAR-OPCA-OK                                                       
195453     OR WKS-93-COPIA = 14                                                     
195454        MOVE 1    TO  W77-TRF-TIMES.                                          
195460                                                                              
195485*************************************************************                 
195490 7004150-PROB-1X1.                                                            
195500     ADD  1                        TO W77-TRF-INTENTO.                        
195600     MOVE SPACES                   TO WS-ARCH-SDOS.                           
195700     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
195800     MOVE WKS-ARCH-93-PROB         TO WS-ARCH-SDOS.                           
195900     CALL "INTELARSND IN ADMONXFERS"                                          
196000          USING  WS-ARCH-SDOS                                                 
196100          GIVING WS77-INTELAR-RESULT.                                         
196200                                                                              
196300     IF WS77-INTELAR-RESULT NOT = 0                                           
196400        IF W77-TRF-INTENTO = 1                                                
196500           WAIT (05)                                                          
196600        ELSE                                                                  
196700           MOVE "E"                   TO TIPO-LJ                              
196800           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
196810           MOVE WKS-93-COPIA          TO WKS-PN-REPRO                         
196820           MOVE WKS-Q-OPC-1D          TO WKS-PA-REPRO                         
196830           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
196900           STRING "ERR ENVIO " WKS-ARCH-93-PROB                               
196910                  ", RESULT=" WS-RESULT-N1                                    
196920                  DELIMITED BY SIZE INTO TEXTO-LJ                             
196930           PERFORM 70000050-CALL-LJ-MSG                                       
196940**         MOVE "O"                   TO TIPO-LJ                              
197000           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
197100                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
197200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
197300           PERFORM 70000050-CALL-LJ-MSG                                       
197400**         MOVE "E"                   TO TIPO-LJ                              
197450           MOVE 1                     TO W77-TRF-OK                           
197500     ELSE                                                                     
197600        STRING "ARCHIVO ", WKS-ARCH-93-PROB                                   
197610               ", ENVIADO "                                                   
197620               DELIMITED BY SIZE INTO TEXTO-LJ                                
197700        PERFORM 70000050-CALL-LJ-MSG                                          
197800        MOVE 1                     TO W77-TRF-OK.                             
197850                                                                              
197860***********************************************************                   
197900 7004200-ENVIA-MONI.                                                          
197901     IF W88-PAR-OPCB-OK                                                       
197902        MOVE WKS-Q-OPC-2D  TO WKS-94-COPIA                                    
197903        IF WKS-Q-OPC-1D = "G"                                                 
197904           ADD 10             TO WKS-94-COPIA                                 
197905        ELSE                                                                  
197906           NEXT SENTENCE                                                      
197907     ELSE                                                                     
197908        ADD  1       TO WKS-94-COPIA.                                         
197910                                                                              
197920     MOVE 0       TO W77-TRF-INTENTO.                                         
197930     MOVE 0       TO W77-TRF-OK.                                              
197940                                                                              
197950     PERFORM 7004250-MONI-1X1 UNTIL W77-TRF-OK = 1.                           
197960                                                                              
197965     IF W88-PAR-OPCB-OK                                                       
197970     OR WKS-94-COPIA = 14                                                     
197975        MOVE 1    TO  W77-TRF-TIMES.                                          
197980                                                                              
197985*************************************************************                 
197990 7004250-MONI-1X1.                                                            
198000     ADD  1                        TO W77-TRF-INTENTO.                        
198100     MOVE SPACES                   TO WS-ARCH-SDOS.                           
198200     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
198300     MOVE WKS-ARCH-94-MONI         TO WS-ARCH-SDOS.                           
198400     CALL "INTELARSND IN ADMONXFERS"                                          
198500          USING  WS-ARCH-SDOS                                                 
198600          GIVING WS77-INTELAR-RESULT.                                         
198700                                                                              
198800     IF WS77-INTELAR-RESULT NOT = 0                                           
198900        IF W77-TRF-INTENTO = 1                                                
199000           WAIT (05)                                                          
199100        ELSE                                                                  
199200           MOVE "E"                   TO TIPO-LJ                              
199300           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
199400           MOVE WKS-94-COPIA          TO WKS-PN-REPRO                         
199420           MOVE WKS-Q-OPC-1D          TO WKS-PA-REPRO                         
199425           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
199500           STRING "ERR ENVIO " WKS-ARCH-94-MONI                               
199600                  ", RESULT=" WS-RESULT-N1                                    
199610                  DELIMITED BY SIZE INTO TEXTO-LJ                             
199620           PERFORM 70000050-CALL-LJ-MSG                                       
199625**         MOVE "O"                   TO TIPO-LJ                              
199630           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
199640                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
199650                  DELIMITED BY SIZE INTO TEXTO-LJ                             
199660           PERFORM 70000050-CALL-LJ-MSG                                       
199700**         MOVE "E"                   TO TIPO-LJ                              
199800           MOVE 1                     TO W77-TRF-OK                           
200100     ELSE                                                                     
200200        STRING "ARCHIVO ", WKS-ARCH-94-MONI                                   
200210               ", ENVIADO "                                                   
200220               DELIMITED BY SIZE INTO TEXTO-LJ                                
200300        PERFORM 70000050-CALL-LJ-MSG                                          
200400        MOVE 1                     TO W77-TRF-OK.                             
200500                                                                              
200510**********************************************************                    
200600 7004300-ENVIA-RANGOS.                                                        
200700                                                                              
200800     MOVE SPACES                   TO WS-ARCH-SDOS                            
200900     MOVE ZEROS                    TO WS77-INTELAR-RESULT                     
201000     MOVE WKS-ARCH-95-RANGOS    TO WS-ARCH-SDOS                               
201100     CALL "INTELARSND IN ADMONXFERS"                                          
201200                                USING WS-ARCH-SDOS                            
201300                               GIVING WS77-INTELAR-RESULT                     
201400                                                                              
201500     IF WS77-INTELAR-RESULT NOT = 0                                           
201600        WAIT (05)                                                             
201700        MOVE SPACES                TO WS-ARCH-SDOS                            
201800        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
201900        MOVE WKS-ARCH-95-RANGOS TO WS-ARCH-SDOS                               
202000        CALL "INTELARSND IN ADMONXFERS"                                       
202100                                USING WS-ARCH-SDOS                            
202200                               GIVING WS77-INTELAR-RESULT                     
202300                                                                              
202400        IF WS77-INTELAR-RESULT NOT = 0                                        
202500           MOVE "O"                   TO TIPO-LJ                              
202600           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
202700           STRING "ERROR AL ENVIAR ARCHIVO RANGOS RS="                        
202800                                 WS-RESULT-N1                                 
202900                  " TRANSFERIR MANUAL OPC=95 AAAAMMDD"                        
203000                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
203100           DELIMITED BY SIZE INTO TEXTO-LJ                                    
203200           PERFORM 70000050-CALL-LJ-MSG                                       
203300        ELSE                                                                  
203400           MOVE "E"                       TO TIPO-LJ                          
203500           STRING "ARCHIVO ", WKS-ARCH-95-RANGOS, " ENVIADO"                  
203600             DELIMITED BY SIZE INTO TEXTO-LJ                                  
203700           PERFORM 70000050-CALL-LJ-MSG                                       
203800     ELSE                                                                     
203900        MOVE "E"                          TO TIPO-LJ                          
204000        STRING "ARCHIVO ", WKS-ARCH-95-RANGOS, " ENVIADO"                     
204100             DELIMITED BY SIZE INTO TEXTO-LJ                                  
204200        PERFORM 70000050-CALL-LJ-MSG.                                         
204300******************************************************************            
204500 7004400-ENVIA-MONI-TIMES.                                                    
204600     MOVE 0       TO W77-TRF-INTENTO.                                         
204700     MOVE 0       TO W77-TRF-OK.                                              
204800                                                                              
204900     PERFORM 7004450-MONI-TIME UNTIL W77-TRF-OK = 1.                          
205000                                                                              
205100     MOVE 1    TO  W77-TRF-TIMES.                                             
205200                                                                              
205300*************************************************************                 
205400 7004450-MONI-TIME.                                                           
205500     ADD  1                        TO W77-TRF-INTENTO.                        
205600     MOVE SPACES                   TO WS-ARCH-SDOS.                           
205700     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
205800     MOVE WKS-ARCH-96-MONITIMES    TO WS-ARCH-SDOS.                           
205900     CALL "INTELARSND IN ADMONXFERS"                                          
206000          USING  WS-ARCH-SDOS                                                 
206100          GIVING WS77-INTELAR-RESULT.                                         
206200                                                                              
206300     IF WS77-INTELAR-RESULT NOT = 0                                           
206400        IF W77-TRF-INTENTO = 1                                                
206500           WAIT (05)                                                          
206600        ELSE                                                                  
206700           MOVE "O"                   TO TIPO-LJ                              
206800           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
206900           STRING "ERROR AL ENVIAR ARCHIVO " WKS-ARCH-96-MONITIMES            
207000                  ", RESULT=" WS-RESULT-N1                                    
207100                  DELIMITED BY SIZE INTO TEXTO-LJ                             
207200           PERFORM 70000050-CALL-LJ-MSG                                       
207300           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
207400                  "ENVIAMONITOR AAAAMMDD /NN, OK PARA CONTINUAR"              
207500                  DELIMITED BY SIZE INTO TEXTO-LJ                             
207600           PERFORM 70000050-CALL-LJ-MSG                                       
207700           MOVE 1                     TO W77-TRF-OK                           
207800     ELSE                                                                     
207900        STRING "ARCHIVO ", WKS-ARCH-96-MONITIMES                              
208000               ", ENVIADO CORRECTAMENTE"                                      
208100               DELIMITED BY SIZE INTO TEXTO-LJ                                
208200        PERFORM 70000050-CALL-LJ-MSG                                          
208300        MOVE 1                     TO W77-TRF-OK.                             
208400                                                                              
208500*****************************************************************             
208600 7004500-ENVIA-ARCH-ALERTAS.                                                  
208700     MOVE SPACES                   TO WS-ARCH-SDOS.                           
208800     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
208900     MOVE WKS-ARCH-97-ALERTAS    TO WS-ARCH-SDOS.                             
209000     CALL "INTELARSND IN ADMONXFERS"                                          
209100                                USING WS-ARCH-SDOS                            
209200                               GIVING WS77-INTELAR-RESULT.                    
209300*                                                                             
209400     IF WS77-INTELAR-RESULT NOT = 0                                           
209500        WAIT (30)                                                             
209600        MOVE SPACES                TO WS-ARCH-SDOS                            
209700        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
209800        MOVE WKS-ARCH-97-ALERTAS TO WS-ARCH-SDOS                              
209900        CALL "INTELARSND IN ADMONXFERS"                                       
210000                                USING WS-ARCH-SDOS                            
210100                               GIVING WS77-INTELAR-RESULT                     
210200*                                                                             
210300        IF WS77-INTELAR-RESULT NOT = 0                                        
210400           MOVE "O"                   TO TIPO-LJ                              
210500           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
210600           STRING "ERROR AL ENVIAR ARCHIVO " WKS-ARCH-97-ALERTAS              
210700                            ", RS=" WS-RESULT-N1                              
210800                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
210900           DELIMITED BY SIZE INTO TEXTO-LJ                                    
211000           PERFORM 70000050-CALL-LJ-MSG                                       
211100        ELSE                                                                  
211200           MOVE "E"                       TO TIPO-LJ                          
211300           STRING "ARCHIVO " WKS-ARCH-97-ALERTAS " ENVIADO"                   
211400           DELIMITED BY SIZE INTO TEXTO-LJ                                    
211500           PERFORM 70000050-CALL-LJ-MSG                                       
211600     ELSE                                                                     
211700        MOVE "E"                          TO TIPO-LJ                          
211800        STRING "ARCHIVO " WKS-ARCH-97-ALERTAS " ENVIADO"                      
211900        DELIMITED BY SIZE INTO TEXTO-LJ                                       
212000        PERFORM 70000050-CALL-LJ-MSG.                                         
212100                                                                              
212200************************************************************                  
212250 7004600-ENVIA-RECH.                                                          
212300     IF W88-PAR-OPCR-OK                                                       
212350        MOVE WKS-Q-OPC-2D  TO WKS-98-COPIA                                    
212351        IF WKS-Q-OPC-1D = "H"                                                 
212352           ADD 10             TO WKS-98-COPIA                                 
212353        ELSE                                                                  
212354           NEXT SENTENCE                                                      
212400     ELSE                                                                     
212450        ADD  1       TO WKS-98-COPIA.                                         
212500                                                                              
212550     MOVE 0       TO W77-TRF-INTENTO.                                         
212600     MOVE 0       TO W77-TRF-OK.                                              
212650                                                                              
212700     PERFORM 7004650-RECH-1X1 UNTIL W77-TRF-OK = 1.                           
212750                                                                              
212800     IF W88-PAR-OPCR-OK                                                       
212850     OR WKS-98-COPIA = 14                                                     
212900        MOVE 1    TO  W77-TRF-TIMES.                                          
212902                                                                              
212904*NOR-INI CONCILIACION EAS-HUB                                                 
212906 7007200-ENVIA-CONHUB.                                                        
212908     MOVE SPACES                   TO WS-ARCH-SDOS.                           
212910     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
212912     MOVE WKS-ARCH-CONHUB          TO WS-ARCH-SDOS.                           
212914     CALL "INTELARSND IN ADMONXFERS"                                          
212916                                USING WS-ARCH-SDOS                            
212918                               GIVING WS77-INTELAR-RESULT.                    
212920*                                                                             
212922     IF WS77-INTELAR-RESULT NOT = 0                                           
212924        WAIT (60)                                                             
212926        MOVE SPACES                TO WS-ARCH-SDOS                            
212928        MOVE ZEROS                 TO WS77-INTELAR-RESULT                     
212930        MOVE WKS-ARCH-CONHUB       TO WS-ARCH-SDOS                            
212932        CALL "INTELARSND IN ADMONXFERS"                                       
212934                                USING WS-ARCH-SDOS                            
212936                               GIVING WS77-INTELAR-RESULT                     
212938*                                                                             
212940        IF WS77-INTELAR-RESULT NOT = 0                                        
212942           MOVE "O"                   TO TIPO-LJ                              
212944           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
212946           STRING "ERROR AL ENVIAR ARCHIVO: " WKS-ARCH-CONHUB                 
212948                  " RS= "                     WS-RESULT-N1                    
212950                  "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION: "              
212952           "ENVIACONHUB AAAAMMDD, OK PARA CONTINUAR" WKS-FIN-MSG              
212954           DELIMITED BY SIZE INTO TEXTO-LJ                                    
212956           PERFORM 70000050-CALL-LJ-MSG                                       
212958        ELSE                                                                  
212960           MOVE "E"                       TO TIPO-LJ                          
212962           MOVE "ARCHIVO CONHUB ENVIADO" TO TEXTO-LJ                          
212964           PERFORM 70000050-CALL-LJ-MSG                                       
212966     ELSE                                                                     
212968        MOVE "E"                          TO TIPO-LJ                          
212970        MOVE "ARCHIVO CONHUB ENVIADO"    TO TEXTO-LJ                          
212972        PERFORM 70000050-CALL-LJ-MSG.                                         
212974*NOR-FIN                                                                      
213000*************************************************************                 
213050 7004650-RECH-1X1.                                                            
213100     ADD  1                        TO W77-TRF-INTENTO.                        
213150     MOVE SPACES                   TO WS-ARCH-SDOS.                           
213200     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
213250     MOVE WKS-ARCH-98-RECH         TO WS-ARCH-SDOS.                           
213300     CALL "INTELARSND IN ADMONXFERS"                                          
213350          USING  WS-ARCH-SDOS                                                 
213400          GIVING WS77-INTELAR-RESULT.                                         
213450                                                                              
213500     IF WS77-INTELAR-RESULT NOT = 0                                           
213550        IF W77-TRF-INTENTO = 1                                                
213600           WAIT (05)                                                          
213650        ELSE                                                                  
213700           MOVE "E"                   TO TIPO-LJ                              
213750           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
213800           MOVE WKS-98-COPIA          TO WKS-PN-REPRO                         
213850           MOVE WKS-Q-OPC-1D          TO WKS-PA-REPRO                         
213900           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
213950           STRING "ERR ENVIO " WKS-ARCH-98-RECH                               
214000                  ", RESULT=" WS-RESULT-N1                                    
214050                  DELIMITED BY SIZE INTO TEXTO-LJ                             
214100           PERFORM 70000050-CALL-LJ-MSG                                       
214150**         MOVE "O"                   TO TIPO-LJ                              
214200           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
214250                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
214300                  DELIMITED BY SIZE INTO TEXTO-LJ                             
214350           PERFORM 70000050-CALL-LJ-MSG                                       
214400**         MOVE "E"                   TO TIPO-LJ                              
214450           MOVE 1                     TO W77-TRF-OK                           
214500     ELSE                                                                     
214550        STRING "ARCHIVO ", WKS-ARCH-98-RECH                                   
214600               ", ENVIADO "                                                   
214650               DELIMITED BY SIZE INTO TEXTO-LJ                                
214700        PERFORM 70000050-CALL-LJ-MSG                                          
214750        MOVE 1                     TO W77-TRF-OK.                             
214752                                                                              
214754 7004680-ENVIA-COMPENDEPP.                                                    
214756*=========================                                                    
214758       MOVE SPACES                       TO WS-ARCH-SDOS.                     
214760       MOVE ZEROS                        TO WS77-INTELAR-RESULT.              
214762       MOVE WKS-ARCH-60-COMPENDEPP       TO WS-ARCH-SDOS.                     
214764       CALL "INTELARSND IN ADMONXFERS"                                        
214766                                  USING WS-ARCH-SDOS                          
214768                                  GIVING WS77-INTELAR-RESULT.                 
214770*                                                                             
214772       IF WS77-INTELAR-RESULT NOT = 0                                         
214774          WAIT (60)                                                           
214776          MOVE SPACES                    TO WS-ARCH-SDOS                      
214778          MOVE ZEROS                     TO WS77-INTELAR-RESULT               
214780          MOVE WKS-ARCH-60-COMPENDEPP    TO WS-ARCH-SDOS                      
214782          CALL "INTELARSND IN ADMONXFERS"                                     
214784                                     USING WS-ARCH-SDOS                       
214786                                     GIVING WS77-INTELAR-RESULT               
214788*                                                                             
214790          IF WS77-INTELAR-RESULT NOT = 0                                      
214792             MOVE "O"                 TO TIPO-LJ                              
214794             MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                         
214796             STRING "ERROR AL ENVIAR ARCHIVO COMPENDEPP RS="                  
214798                                   WS-RESULT-N1                               
214800                    " TRANSFERIR MANUAL OPC=60 AAAAMMDD"                      
214802                    " OK PARA CONTINUAR " WKS-FIN-MSG                         
214804             DELIMITED BY SIZE INTO TEXTO-LJ                                  
214806             PERFORM 70000050-CALL-LJ-MSG                                     
214808          ELSE                                                                
214810             MOVE "E"                          TO TIPO-LJ                     
214812             MOVE "ARCHIVO COMPENDEPP ENVIADO" TO TEXTO-LJ                    
214814               PERFORM 70000050-CALL-LJ-MSG                                   
214816       ELSE                                                                   
214818            MOVE "E"                           TO TIPO-LJ                     
214820            MOVE "ARCHIVO COMPENDEPP ENVIADO"  TO TEXTO-LJ                    
214822            PERFORM 70000050-CALL-LJ-MSG.                                     
214824*                                                                             
214828***********************************************************                   
214830 7004690-ENVIA-INCIDENTE.                                                     
214832      ADD  1                            TO WKS-61-COPY.                       
214834      MOVE WKS-ARCH-61-INCIDENTE        TO WS-ARCH-SDOS.                      
214836      PERFORM 7004691-ENVIA-COPIAS.                                           
214838      WAIT (5).                                                               
214839                                                                              
214840 7004691-ENVIA-COPIAS.                                                        
214841     CALL "INTELARSND IN ADMONXFERS"                                          
214842           USING WS-ARCH-SDOS                                                 
214844          GIVING WS77-INTELAR-RESULT.                                         
214846*                                                                             
214848     IF WS77-INTELAR-RESULT NOT = 0                                           
214850        WAIT (30)                                                             
214852        MOVE SPACES                    TO WS-ARCH-SDOS                        
214854        MOVE ZEROS                     TO WS77-INTELAR-RESULT                 
214856        MOVE WKS-ARCH-61-INCIDENTE     TO WS-ARCH-SDOS                        
214858        CALL "INTELARSND IN ADMONXFERS"                                       
214860             USING WS-ARCH-SDOS                                               
214862            GIVING WS77-INTELAR-RESULT                                        
214864*                                                                             
214866        IF WS77-INTELAR-RESULT NOT = 0                                        
214868           MOVE "O"                 TO TIPO-LJ                                
214870           MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                           
214872           STRING "ERROR AL ENVIAR ARCHIVO",                                  
214874                  " INCIDENTE RS=", WS-RESULT-N1                              
214876                  " TRANSFERIR MANUAL OPC=61 AAAAMMDD /00"                    
214878                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
214880                    DELIMITED BY SIZE INTO TEXTO-LJ                           
214882           PERFORM 70000050-CALL-LJ-MSG                                       
214884        ELSE                                                                  
214886           MOVE "E" TO TIPO-LJ                                                
214887           STRING "ARCHIVO INCIDENTE COPIA=", WKS-61-COPY                     
214888                  " ENVIADO " WKS-FIN-MSG                                     
214889                  DELIMITED BY SIZE INTO TEXTO-LJ                             
214890             PERFORM 70000050-CALL-LJ-MSG                                     
214891     ELSE                                                                     
214892        MOVE "E" TO TIPO-LJ                                                   
214893        STRING "ARCHIVO INCIDENTE COPIA=" WKS-61-COPY                         
214894               " ENVIADO," WKS-FIN-MSG                                        
214895               DELIMITED BY SIZE INTO TEXTO-LJ                                
214898       PERFORM 70000050-CALL-LJ-MSG.                                          
214900*                                                                             
214950 7004700-ENVIA-MONIP014.                                                      
214955     IF W88-PAR-OPCM-OK                                                       
215000        MOVE WKS-Q-OPC-2D  TO WKS-70-COPIA                                    
215050     ELSE                                                                     
215100        ADD  1       TO WKS-70-COPIA.                                         
215150                                                                              
215200     MOVE 0       TO W77-TRF-INTENTO.                                         
215250     MOVE 0       TO W77-TRF-OK.                                              
215300                                                                              
215350     PERFORM 7004750-MONIP014-1X1 UNTIL W77-TRF-OK = 1.                       
215400                                                                              
215450     IF W88-PAR-OPCM-OK                                                       
215500     OR WKS-70-COPIA = 9                                                      
215550        MOVE 1    TO  W77-TRF-TIMES.                                          
215552                                                                              
215554 7004690-ENVIA-INC-186.                                                       
215556  MOVE  4                            TO WKS-61-COPY.                          
215558  MOVE WKS-ARCH-61-INCIDENTE        TO WS-ARCH-SDOS.                          
215560  PERFORM 7004691-ENVIA-COPIAS.                                               
215562  WAIT (5).                                                                   
215564                                                                              
215566                                                                              
215568                                                                              
215570                                                                              
215600                                                                              
215602*************************************************************                 
215604 7004680-ENVIA-HL-ART61.                                                      
215606*=========================                                                    
215608       MOVE SPACES                       TO WS-ARCH-SDOS.                     
215610       MOVE ZEROS                       TO WS77-INTELAR-RESULT.               
215612       MOVE WKS-ARCH-65-HL-ART61         TO WS-ARCH-SDOS.                     
215614       CALL "INTELARSND IN ADMONXFERS"                                        
215616                                  USING WS-ARCH-SDOS                          
215618                                  GIVING WS77-INTELAR-RESULT.                 
215620*                                                                             
215622       IF WS77-INTELAR-RESULT NOT = 0                                         
215624           WAIT (30)                                                          
215626           MOVE SPACES                    TO WS-ARCH-SDOS                     
215628           MOVE ZEROS                     TO WS77-INTELAR-RESULT              
215630           MOVE WKS-ARCH-65-HL-ART61    TO WS-ARCH-SDOS                       
215632           CALL "INTELARSND IN ADMONXFERS"                                    
215634                                      USING WS-ARCH-SDOS                      
215636                                      GIVING WS77-INTELAR-RESULT              
215638           IF WS77-INTELAR-RESULT NOT = 0                                     
215639              MOVE "O"                 TO TIPO-LJ                             
215640              MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                        
215641              STRING "ERROR AL ENVIAR " WKS-ARCH-65-HL-ART61                  
215642                     " RS="               WS-RESULT-N1                        
215643                     " TRANSFERIR MANUAL OPC=65 AAAAMMDD"                     
215644                     " OK PARA CONTINUAR " WKS-FIN-MSG                        
215645              DELIMITED BY SIZE INTO TEXTO-LJ                                 
215646              PERFORM 70000050-CALL-LJ-MSG                                    
215647           ELSE                                                               
215648              MOVE "E"                          TO TIPO-LJ                    
215649              STRING  "ARCHIVO " WKS-ARCH-65-HL-ART61 " ENVIADO"              
215650                       DELIMITED BY SIZE INTO TEXTO-LJ                        
215651              PERFORM 70000050-CALL-LJ-MSG                                    
215652        ELSE                                                                  
215653           MOVE "E"                          TO TIPO-LJ                       
215654           STRING  "ARCHIVO " WKS-ARCH-65-HL-ART61 " ENVIADO"                 
215655                    DELIMITED BY SIZE INTO TEXTO-LJ                           
215656           PERFORM 70000050-CALL-LJ-MSG.                                      
215657                                                                              
215658 7004680-ENVIA-MOTOR.                                                         
215659*=========================                                                    
215660       MOVE SPACES                       TO WS-ARCH-SDOS.                     
215661       MOVE ZEROS                        TO WS77-INTELAR-RESULT.              
215662       MOVE WKS-ARCH-66-MOTOR            TO WS-ARCH-SDOS.                     
215663       CALL "INTELARSND IN ADMONXFERS"                                        
215664                                  USING WS-ARCH-SDOS                          
215665                                  GIVING WS77-INTELAR-RESULT.                 
215666*                                                                             
215667       IF WS77-INTELAR-RESULT NOT = 0                                         
215668          WAIT (30)                                                           
215669          MOVE SPACES                    TO WS-ARCH-SDOS                      
215670          MOVE ZEROS                     TO WS77-INTELAR-RESULT               
215671          MOVE WKS-ARCH-66-MOTOR    TO WS-ARCH-SDOS                           
215672          CALL "INTELARSND IN ADMONXFERS"                                     
215673                                     USING WS-ARCH-SDOS                       
215674                                     GIVING WS77-INTELAR-RESULT               
215675*                                                                             
215676          IF WS77-INTELAR-RESULT NOT = 0                                      
215677             MOVE "O"                 TO TIPO-LJ                              
215678             MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                         
215679             STRING "ERROR AL ENVIAR " WKS-ARCH-66-MOTOR                      
215680                    " RS="               WS-RESULT-N1                         
215681                    " TRANSFERIR MANUAL OPC=60 AAAAMMDD"                      
215682                    " OK PARA CONTINUAR " WKS-FIN-MSG                         
215683             DELIMITED BY SIZE INTO TEXTO-LJ                                  
215684             PERFORM 70000050-CALL-LJ-MSG                                     
215685          ELSE                                                                
215686             MOVE "E"                          TO TIPO-LJ                     
215687             STRING "ARCHIVO " WKS-ARCH-66-MOTOR " ENVIADO"                   
215688                    DELIMITED BY SIZE INTO TEXTO-LJ                           
215689             PERFORM 70000050-CALL-LJ-MSG                                     
215690       ELSE                                                                   
215691          MOVE "E"                           TO TIPO-LJ                       
215692          STRING "ARCHIVO " WKS-ARCH-66-MOTOR " ENVIADO"                      
215693                  DELIMITED BY SIZE INTO TEXTO-LJ                             
215694          PERFORM 70000050-CALL-LJ-MSG.                                       
215695*************************************************************                 
215696*************************************************************                 
215700 7004750-MONIP014-1X1.                                                        
215750     ADD  1                        TO W77-TRF-INTENTO.                        
215800     MOVE SPACES                   TO WS-ARCH-SDOS.                           
215850     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
215900     MOVE WKS-ARCH-70-MONIP014     TO WS-ARCH-SDOS.                           
215950     CALL "INTELARSND IN ADMONXFERS"                                          
216000          USING  WS-ARCH-SDOS                                                 
216050          GIVING WS77-INTELAR-RESULT.                                         
216100                                                                              
216150     IF WS77-INTELAR-RESULT NOT = 0                                           
216200        IF W77-TRF-INTENTO = 1                                                
216250           WAIT (05)                                                          
216300        ELSE                                                                  
216350           MOVE "E"                   TO TIPO-LJ                              
216400           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
216450           MOVE WKS-70-COPIA          TO WKS-PN-REPRO                         
216500           MOVE "M"                   TO WKS-PA-REPRO                         
216550           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
216600           STRING "ERR ENVIO " WKS-ARCH-93-PROB                               
216650                  ", RESULT=" WS-RESULT-N1                                    
216700                  DELIMITED BY SIZE INTO TEXTO-LJ                             
216750           PERFORM 70000050-CALL-LJ-MSG                                       
216800**         MOVE "O"                   TO TIPO-LJ                              
216850           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
216900                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
216950                  DELIMITED BY SIZE INTO TEXTO-LJ                             
217000           PERFORM 70000050-CALL-LJ-MSG                                       
217050**         MOVE "E"                   TO TIPO-LJ                              
217100           MOVE 1                     TO W77-TRF-OK                           
217150     ELSE                                                                     
217200        STRING "ARCHIVO ", WKS-ARCH-70-MONIP014                               
217250               ", ENVIADO "                                                   
217300               DELIMITED BY SIZE INTO TEXTO-LJ                                
217350        PERFORM 70000050-CALL-LJ-MSG                                          
217400        MOVE 1                     TO W77-TRF-OK.                             
217450                                                                              
217500***********************************************************                   
217600 7004800-ENVIA-PROBP014.                                                      
217650     IF W88-PAR-OPCP-OK                                                       
217700        MOVE WKS-Q-OPC-2D  TO WKS-71-COPIA                                    
217750     ELSE                                                                     
217800        ADD  1       TO WKS-71-COPIA.                                         
217850                                                                              
217900     MOVE 0       TO W77-TRF-INTENTO.                                         
217950     MOVE 0       TO W77-TRF-OK.                                              
218000                                                                              
218050     PERFORM 7004850-PROBP014-1X1 UNTIL W77-TRF-OK = 1.                       
218100                                                                              
218150     IF W88-PAR-OPCP-OK                                                       
218200     OR WKS-71-COPIA = 9                                                      
218250        MOVE 1    TO  W77-TRF-TIMES.                                          
218300                                                                              
218350*************************************************************                 
218400 7004850-PROBP014-1X1.                                                        
218450     ADD  1                        TO W77-TRF-INTENTO.                        
218500     MOVE SPACES                   TO WS-ARCH-SDOS.                           
218550     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
218600     MOVE WKS-ARCH-71-PROBP014     TO WS-ARCH-SDOS.                           
218650     CALL "INTELARSND IN ADMONXFERS"                                          
218700          USING  WS-ARCH-SDOS                                                 
218750          GIVING WS77-INTELAR-RESULT.                                         
218800                                                                              
218850     IF WS77-INTELAR-RESULT NOT = 0                                           
218900        IF W77-TRF-INTENTO = 1                                                
218950           WAIT (05)                                                          
219000        ELSE                                                                  
219050           MOVE "E"                   TO TIPO-LJ                              
219100           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
219150           MOVE WKS-71-COPIA          TO WKS-PN-REPRO                         
219200           MOVE "P"                   TO WKS-PA-REPRO                         
219250           MOVE WKS-PAR-FECHA         TO WKS-F-REPRO                          
219300           STRING "ERR ENVIO " WKS-ARCH-93-PROB                               
219350                  ", RESULT=" WS-RESULT-N1                                    
219400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
219450           PERFORM 70000050-CALL-LJ-MSG                                       
219500**         MOVE "O"                   TO TIPO-LJ                              
219550           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
219600                  WKS-PARAM-REPROC, ", OK PARA CONTINUAR"                     
219650                  DELIMITED BY SIZE INTO TEXTO-LJ                             
219700           PERFORM 70000050-CALL-LJ-MSG                                       
219750**         MOVE "E"                   TO TIPO-LJ                              
219800           MOVE 1                     TO W77-TRF-OK                           
219850     ELSE                                                                     
219900        STRING "ARCHIVO ", WKS-ARCH-71-PROBP014                               
219950               ", ENVIADO "                                                   
220000               DELIMITED BY SIZE INTO TEXTO-LJ                                
220050        PERFORM 70000050-CALL-LJ-MSG                                          
220100        MOVE 1                     TO W77-TRF-OK.                             
220150                                                                              
220200***********************************************************                   
220300 7004900-ENVIA-TRPBENEF.                                                      
220400     ADD  1                        TO W77-TRF-INTENTO.                        
220500     MOVE SPACES                   TO WS-ARCH-SDOS.                           
220600     MOVE ZEROS                    TO WS77-INTELAR-RESULT.                    
220700     MOVE WKS-ARCH-72-TRPBENF      TO WS-ARCH-SDOS.                           
220800     CALL "INTELARSND IN ADMONXFERS"                                          
220900          USING  WS-ARCH-SDOS                                                 
221000          GIVING WS77-INTELAR-RESULT.                                         
221100                                                                              
221200     IF WS77-INTELAR-RESULT NOT = 0                                           
221300        IF W77-TRF-INTENTO = 1                                                
221400           WAIT (05)                                                          
221500        ELSE                                                                  
221600           MOVE "O"                   TO TIPO-LJ                              
221700           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
221800           STRING "ERROR AL ENVIAR ARCHIVO " WKS-ARCH-72-TRPBENF              
221900                  ", RESULT=" WS-RESULT-N1                                    
222000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
222100           PERFORM 70000050-CALL-LJ-MSG                                       
222200           STRING "TRANSFERIR MANUAL CON S500/WFL/LOTE OPCION ",              
222300                  "ENVTRASBENEF AAAAMMDD /NN, OK PARA CONTINUAR"              
222400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
222500           PERFORM 70000050-CALL-LJ-MSG                                       
222600           MOVE 1                     TO W77-TRF-OK                           
222700     ELSE                                                                     
222800        STRING "ARCHIVO ", WKS-ARCH-72-TRPBENF                                
222900               ", ENVIADO CORRECTAMENTE"                                      
223000               DELIMITED BY SIZE INTO TEXTO-LJ                                
223100        PERFORM 70000050-CALL-LJ-MSG                                          
223200        MOVE 1                     TO W77-TRF-OK.                             
223202                                                                              
223204*************************************************************                 
223206 7004680-ENVIA-CTRLDEPRET.                                                    
223208*=========================                                                    
223210       MOVE SPACES                      TO WS-ARCH-SDOS.                      
223212       MOVE ZEROS                       TO WS77-INTELAR-RESULT.               
223214       MOVE WKS-ARCH-67-CTRLDEPRET      TO WS-ARCH-SDOS.                      
223216       CALL "INTELARSND IN ADMONXFERS"                                        
223218                                  USING WS-ARCH-SDOS                          
223220                                  GIVING WS77-INTELAR-RESULT.                 
223222*                                                                             
223224       IF WS77-INTELAR-RESULT NOT = 0                                         
223226           WAIT (30)                                                          
223228           MOVE SPACES                    TO WS-ARCH-SDOS                     
223230           MOVE ZEROS                     TO WS77-INTELAR-RESULT              
223232           MOVE WKS-ARCH-67-CTRLDEPRET    TO WS-ARCH-SDOS                     
223234           CALL "INTELARSND IN ADMONXFERS"                                    
223236                                      USING WS-ARCH-SDOS                      
223238                                      GIVING WS77-INTELAR-RESULT              
223240           IF WS77-INTELAR-RESULT NOT = 0                                     
223242               MOVE "O"                 TO TIPO-LJ                            
223244               MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                       
223246               STRING "ERROR AL ENVIAR " WKS-ARCH-67-CTRLDEPRET               
223248                     " RS="               WS-RESULT-N1                        
223250                     " TRANSFERIR MANUAL OPC=67 AAAAMMDD"                     
223252                     " OK PARA CONTINUAR " WKS-FIN-MSG                        
223254              DELIMITED BY SIZE INTO TEXTO-LJ                                 
223256              PERFORM 70000050-CALL-LJ-MSG                                    
223258           ELSE                                                               
223260              MOVE "E"                          TO TIPO-LJ                    
223262           STRING  "ARCHIVO " WKS-ARCH-67-CTRLDEPRET " ENVIADO"               
223264                       DELIMITED BY SIZE INTO TEXTO-LJ                        
223266              PERFORM 70000050-CALL-LJ-MSG                                    
223268        ELSE                                                                  
223270           MOVE "E"                          TO TIPO-LJ                       
223272        STRING  "ARCHIVO " WKS-ARCH-67-CTRLDEPRET " ENVIADO"                  
223274                    DELIMITED BY SIZE INTO TEXTO-LJ                           
223276           PERFORM 70000050-CALL-LJ-MSG.                                      
223278                                                                              
223280*************************************************************                 
223282 7004680-ENVIA-ISILOANS.                                                      
223284*=========================                                                    
223286       MOVE SPACES                      TO WS-ARCH-SDOS.                      
223288       MOVE ZEROS                       TO WS77-INTELAR-RESULT.               
223290                                                                              
223292       IF WKS-PAR-OPCION = "63"                                               
223294          MOVE WKS-ARCH-63-ISILOANS-2 TO WKS-ARCH-62-ISILOANS-1.              
223296                                                                              
223298       MOVE WKS-ARCH-62-ISILOANS-1      TO WS-ARCH-SDOS.                      
223300       CALL "INTELARSND IN ADMONXFERS"                                        
223302                                  USING WS-ARCH-SDOS                          
223304                                  GIVING WS77-INTELAR-RESULT.                 
223306*                                                                             
223308       IF WS77-INTELAR-RESULT NOT = 0                                         
223310           WAIT (30)                                                          
223312           MOVE SPACES                    TO WS-ARCH-SDOS                     
223314           MOVE ZEROS                     TO WS77-INTELAR-RESULT              
223316           MOVE WKS-ARCH-62-ISILOANS-1    TO WS-ARCH-SDOS                     
223318           CALL "INTELARSND IN ADMONXFERS"                                    
223320                                      USING WS-ARCH-SDOS                      
223322                                      GIVING WS77-INTELAR-RESULT              
223324           IF WS77-INTELAR-RESULT NOT = 0                                     
223326               MOVE "O"                 TO TIPO-LJ                            
223328               MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                       
223330               STRING "ERROR AL ENVIAR " WKS-ARCH-62-ISILOANS-1               
223332                     " RS="               WS-RESULT-N1                        
223334                     " TRANSFERIR MANUAL OPC=" WKS-PAR-OPCION                 
223336                     " AAAAMMDD"                                              
223338                     " OK PARA CONTINUAR " WKS-FIN-MSG                        
223340              DELIMITED BY SIZE INTO TEXTO-LJ                                 
223342              PERFORM 70000050-CALL-LJ-MSG                                    
223344           ELSE                                                               
223346              MOVE "E"                          TO TIPO-LJ                    
223348           STRING  "ARCHIVO " WKS-ARCH-62-ISILOANS-1 " ENVIADO"               
223350                       DELIMITED BY SIZE INTO TEXTO-LJ                        
223352              PERFORM 70000050-CALL-LJ-MSG                                    
223354        ELSE                                                                  
223356           MOVE "E"                          TO TIPO-LJ                       
223358        STRING  "ARCHIVO " WKS-ARCH-62-ISILOANS-1 " ENVIADO"                  
223360                    DELIMITED BY SIZE INTO TEXTO-LJ                           
223362           PERFORM 70000050-CALL-LJ-MSG.                                      
223364                                                                              
223400*****************************************************************             
223500 7005400-ENVIA-I10-GCE.                                                       
223600      MOVE SPACES                   TO WS-ARCH-I10.                           
223700      MOVE ZEROS                    TO WS77-INTELAR-RESULT.                   
223800      MOVE WKS-ARCH-75-I10          TO WS-ARCH-I10.                           
223900      CALL "INTELARSND IN ADMONXFERS"                                         
224000                                 USING WS-ARCH-I10                            
224100                                GIVING WS77-INTELAR-RESULT.                   
224200*                                                                             
224300      IF WS77-INTELAR-RESULT NOT = 0                                          
224400         WAIT (60)                                                            
224500         MOVE SPACES                TO WS-ARCH-I10                            
224600         MOVE ZEROS                 TO WS77-INTELAR-RESULT                    
224700         MOVE WKS-ARCH-75-I10       TO WS-ARCH-I10                            
224800         CALL "INTELARSND IN ADMONXFERS"                                      
224900                                USING WS-ARCH-I10                             
225000                                GIVING WS77-INTELAR-RESULT                    
225100*                                                                             
225200        IF WS77-INTELAR-RESULT NOT = 0                                        
225300           MOVE "O"                   TO TIPO-LJ                              
225400           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
225500           STRING "ERROR AL ENVIAR ARCHIVO I10-GCE RS="                       
225600                                 WS-RESULT-N1                                 
225700                  " TRANSFERIR MANUAL OPC=75 AAAAMMDD"                        
225800                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
225900           DELIMITED BY SIZE INTO TEXTO-LJ                                    
226000           PERFORM 70000050-CALL-LJ-MSG                                       
226100        ELSE                                                                  
226200           MOVE "E"                       TO TIPO-LJ                          
226300           MOVE "ARCHIVO I10     ENVIADO" TO TEXTO-LJ                         
226400           PERFORM 70000050-CALL-LJ-MSG                                       
226500     ELSE                                                                     
226600        MOVE "E"                          TO TIPO-LJ                          
226700        MOVE "ARCHIVO I10     ENVIADO"    TO TEXTO-LJ                         
226800        PERFORM 70000050-CALL-LJ-MSG.                                         
226900***************************************************************               
227000 7005450-ENVIA-I10PS-GCE.                                                     
227100       MOVE SPACES                   TO WS-ARCH-I10PS.                        
227200       MOVE ZEROS                    TO WS77-INTELAR-RESULT.                  
227300       MOVE WKS-ARCH-76-I10PS        TO WS-ARCH-I10PS.                        
227400       CALL "INTELARSND IN ADMONXFERS"                                        
227500                                  USING WS-ARCH-I10PS                         
227600                                  GIVING WS77-INTELAR-RESULT.                 
227700*                                                                             
227800       IF WS77-INTELAR-RESULT NOT = 0                                         
227900          WAIT (60)                                                           
228000          MOVE SPACES                TO WS-ARCH-I10PS                         
228100          MOVE ZEROS                 TO WS77-INTELAR-RESULT                   
228200          MOVE WKS-ARCH-76-I10PS     TO WS-ARCH-I10PS                         
228300          CALL "INTELARSND IN ADMONXFERS"                                     
228400                                 USING WS-ARCH-I10PS                          
228500                                 GIVING WS77-INTELAR-RESULT                   
228600*                                                                             
228700         IF WS77-INTELAR-RESULT NOT = 0                                       
228800            MOVE "O"                   TO TIPO-LJ                             
228900            MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                        
229000            STRING "ERROR AL ENVIAR ARCHIVO I10PS  RS="                       
229100                                  WS-RESULT-N1                                
229200                   " TRANSFERIR MANUAL OPC=76 AAAAMMDD"                       
229300                   " OK PARA CONTINUAR " WKS-FIN-MSG                          
229400            DELIMITED BY SIZE INTO TEXTO-LJ                                   
229500            PERFORM 70000050-CALL-LJ-MSG                                      
229600         ELSE                                                                 
229700            MOVE "E"                       TO TIPO-LJ                         
229800            MOVE "ARCHIVO I10PS   ENVIADO" TO TEXTO-LJ                        
229900            PERFORM 70000050-CALL-LJ-MSG                                      
230000      ELSE                                                                    
230100         MOVE "E"                          TO TIPO-LJ                         
230200         MOVE "ARCHIVO I10PS   ENVIADO"    TO TEXTO-LJ                        
230300         PERFORM 70000050-CALL-LJ-MSG.                                        
230400***************************************************************               
230500 7005500-ENVIA-I10PS2-GCE.                                                    
230600      MOVE SPACES                   TO WS-ARCH-I10PS2.                        
230700      MOVE ZEROS                    TO WS77-INTELAR-RESULT.                   
230800      MOVE WKS-ARCH-77-I10PS2       TO WS-ARCH-I10PS2.                        
230900      CALL "INTELARSND IN ADMONXFERS"                                         
231000                                 USING WS-ARCH-I10PS2                         
231100                                 GIVING WS77-INTELAR-RESULT.                  
231200*                                                                             
231300      IF WS77-INTELAR-RESULT NOT = 0                                          
231400         WAIT (60)                                                            
231500         MOVE SPACES                TO WS-ARCH-I10PS2                         
231600         MOVE ZEROS                 TO WS77-INTELAR-RESULT                    
231700         MOVE WKS-ARCH-77-I10PS2    TO WS-ARCH-I10PS2                         
231800         CALL "INTELARSND IN ADMONXFERS"                                      
231900                                USING WS-ARCH-I10PS2                          
232000                                GIVING WS77-INTELAR-RESULT                    
232100*                                                                             
232200        IF WS77-INTELAR-RESULT NOT = 0                                        
232300           MOVE "O"                   TO TIPO-LJ                              
232400           MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                         
232500           STRING "ERROR AL ENVIAR ARCHIVO I10PS2 RS="                        
232600                                 WS-RESULT-N1                                 
232700                  " TRANSFERIR MANUAL OPC=77 AAAAMMDD"                        
232800                  " OK PARA CONTINUAR " WKS-FIN-MSG                           
232900           DELIMITED BY SIZE INTO TEXTO-LJ                                    
233000           PERFORM 70000050-CALL-LJ-MSG                                       
233100        ELSE                                                                  
233200           MOVE "E"                       TO TIPO-LJ                          
233300           MOVE "ARCHIVO I10PS2  ENVIADO" TO TEXTO-LJ                         
233400           PERFORM 70000050-CALL-LJ-MSG                                       
233500     ELSE                                                                     
233600        MOVE "E"                          TO TIPO-LJ                          
233700        MOVE "ARCHIVO I10PS2  ENVIADO"    TO TEXTO-LJ                         
233800        PERFORM 70000050-CALL-LJ-MSG.                                         
233900***************************************************************               
234000 7005550-ENVIA-I7PRIME-GCE.                                                   
234100       MOVE SPACES                   TO WS-ARCH-I7PRIME.                      
234200       MOVE ZEROS                    TO WS77-INTELAR-RESULT.                  
234300       MOVE WKS-ARCH-78-I7PRIME      TO WS-ARCH-I7PRIME.                      
234400       CALL "INTELARSND IN ADMONXFERS"                                        
234500                                  USING WS-ARCH-I7PRIME                       
234600                                  GIVING WS77-INTELAR-RESULT.                 
234700*                                                                             
234800       IF WS77-INTELAR-RESULT NOT = 0                                         
234900          WAIT (60)                                                           
235000          MOVE SPACES                TO WS-ARCH-I7PRIME                       
235100          MOVE ZEROS                 TO WS77-INTELAR-RESULT                   
235200          MOVE WKS-ARCH-78-I7PRIME   TO WS-ARCH-I7PRIME                       
235300          CALL "INTELARSND IN ADMONXFERS"                                     
235400                                 USING WS-ARCH-I7PRIME                        
235500                                 GIVING WS77-INTELAR-RESULT                   
235600*                                                                             
235700         IF WS77-INTELAR-RESULT NOT = 0                                       
235800            MOVE "O"                   TO TIPO-LJ                             
235900            MOVE WS77-INTELAR-RESULT   TO WS-RESULT-N1                        
236000            STRING "ERROR AL ENVIAR ARCHIVO I7PRIME RS="                      
236100                                  WS-RESULT-N1                                
236200                   " TRANSFERIR MANUAL OPC=78 AAAAMMDD"                       
236300                   " OK PARA CONTINUAR " WKS-FIN-MSG                          
236400            DELIMITED BY SIZE INTO TEXTO-LJ                                   
236500            PERFORM 70000050-CALL-LJ-MSG                                      
236600         ELSE                                                                 
236700            MOVE "E"                       TO TIPO-LJ                         
236800            MOVE "ARCHIVO I7PRIME ENVIADO" TO TEXTO-LJ                        
236900            PERFORM 70000050-CALL-LJ-MSG                                      
237000      ELSE                                                                    
237100         MOVE "E"                          TO TIPO-LJ                         
237200         MOVE "ARCHIVO I7PRIME ENVIADO"    TO TEXTO-LJ                        
237300         PERFORM 70000050-CALL-LJ-MSG.                                        
237400***************************************************************               
237450*                                                                             
237500 7005560-ENVIA-FRAUDEINT.                                                     
237600*========================                                                     
237700       MOVE SPACES                    TO WS-ARCH-SDOS.                        
237800       MOVE ZEROS                     TO WS77-INTELAR-RESULT.                 
237900       MOVE WKS-ARCH-79-FRAUDEINT     TO WS-ARCH-SDOS.                        
238000       CALL "INTELARSND IN ADMONXFERS"                                        
238100                                  USING WS-ARCH-SDOS                          
238200                                  GIVING WS77-INTELAR-RESULT.                 
238300*                                                                             
238400       IF WS77-INTELAR-RESULT NOT = 0                                         
238500          WAIT (60)                                                           
238600          MOVE SPACES                 TO WS-ARCH-SDOS                         
238700          MOVE ZEROS                  TO WS77-INTELAR-RESULT                  
238800          MOVE WKS-ARCH-79-FRAUDEINT    TO WS-ARCH-SDOS                       
238900          CALL "INTELARSND IN ADMONXFERS"                                     
239000                                   USING WS-ARCH-SDOS                         
239100                                   GIVING WS77-INTELAR-RESULT                 
239200*                                                                             
239300          IF WS77-INTELAR-RESULT NOT = 0                                      
239400             MOVE "O"                 TO TIPO-LJ                              
239500             MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                         
239600             STRING "ERROR AL ENVIAR ARCHIVO FRAUDEINT RS="                   
239700                                   WS-RESULT-N1                               
239800                    " TRANSFERIR MANUAL OPC=79 AAAAMMDD"                      
239900                    " OK PARA CONTINUAR " WKS-FIN-MSG                         
240000             DELIMITED BY SIZE INTO TEXTO-LJ                                  
240100             PERFORM 70000050-CALL-LJ-MSG                                     
240200          ELSE                                                                
240300             MOVE "E"                       TO TIPO-LJ                        
240400             MOVE "ARCHIVO FRAUDEINT ENVIADO" TO TEXTO-LJ                     
240500               PERFORM 70000050-CALL-LJ-MSG                                   
240600       ELSE                                                                   
240700            MOVE "E"                            TO TIPO-LJ                    
240800            MOVE "ARCHIVO FRAUDEINT ENVIADO"    TO TEXTO-LJ                   
240900            PERFORM 70000050-CALL-LJ-MSG.                                     
241000*                                                                             
241100 7006000-ENVIA-S711FRAUDLINK.                                                 
241200*============================                                                 
241300       MOVE SPACES                       TO WS-ARCH-SDOS.                     
241400       MOVE ZEROS                        TO WS77-INTELAR-RESULT.              
241500       MOVE WKS-ARCH-99-S711FRAUDLINK    TO WS-ARCH-SDOS.                     
241600       CALL "INTELARSND IN ADMONXFERS"                                        
241700                                  USING WS-ARCH-SDOS                          
241800                                  GIVING WS77-INTELAR-RESULT.                 
241900*                                                                             
242000       IF WS77-INTELAR-RESULT NOT = 0                                         
242100          WAIT (60)                                                           
242200          MOVE SPACES                    TO WS-ARCH-SDOS                      
242300          MOVE ZEROS                     TO WS77-INTELAR-RESULT               
242400          MOVE WKS-ARCH-99-S711FRAUDLINK TO WS-ARCH-SDOS                      
242500          CALL "INTELARSND IN ADMONXFERS"                                     
242600                                     USING WS-ARCH-SDOS                       
242700                                     GIVING WS77-INTELAR-RESULT               
242800*                                                                             
242900          IF WS77-INTELAR-RESULT NOT = 0                                      
243000             MOVE "O"                 TO TIPO-LJ                              
243100             MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                         
243200             STRING "ERROR AL ENVIAR ARCHIVO S711FRAUDLINK RS="               
243300                                   WS-RESULT-N1                               
243400                    " TRANSFERIR MANUAL OPC=99 AAAAMMDD"                      
243500                    " OK PARA CONTINUAR " WKS-FIN-MSG                         
243600             DELIMITED BY SIZE INTO TEXTO-LJ                                  
243700             PERFORM 70000050-CALL-LJ-MSG                                     
243800          ELSE                                                                
243900             MOVE "E"                          TO TIPO-LJ                     
244000             MOVE "ARCHIVO S711FRAUDLINK ENVIADO" TO TEXTO-LJ                 
244100               PERFORM 70000050-CALL-LJ-MSG                                   
244200       ELSE                                                                   
244300            MOVE "E"                           TO TIPO-LJ                     
244400            MOVE "ARCHIVO S711FRAUDLINK ENVIADO"  TO TEXTO-LJ                 
244500            PERFORM 70000050-CALL-LJ-MSG.                                     
244600*                                                                             
244620              MOVE "O"                 TO TIPO-LJ.                            
244625                                                                              
244630 9000000-ENVIA-INTELAR.                                                       
244635   MOVE 0                            TO WKS-INTENTOS                          
244640   MOVE SPACES                       TO WS-ARCH-SDOS.                         
244645   MOVE ZEROS                        TO WS77-INTELAR-RESULT.                  
244650   MOVE WKS-ARCHIVO-ENVIAR           TO WS-ARCH-SDOS.                         
244655   PERFORM 9000001-CALL-INTELARSND UNTIL WKS-INTENTOS = 2.                    
244660                                                                              
244665 9000001-CALL-INTELARSND.                                                     
244670   CALL "INTELARSND IN ADMONXFERS" USING WS-ARCH-SDOS                         
244675                                   GIVING WS77-INTELAR-RESULT.                
244680   IF WS77-INTELAR-RESULT NOT = 0                                             
244690      ADD 1                       TO WKS-INTENTOS                             
244695      IF WKS-INTENTOS = 2                                                     
244700         MOVE "O"                 TO TIPO-LJ                                  
244705         MOVE WS77-INTELAR-RESULT TO WS-RESULT-N1                             
244710         STRING "ERROR AL ENVIAR ARCHIVO " WKS-NOMBRE-ARCH                    
244711         DELIMITED BY "  "                                                    
244712         " RS=" WS-RESULT-N1 " TRANSFERIR MANUAL OPC="                        
244713         WKS-OPCION-ARCH DELIMITED BY "  "                                    
244725         " OK PARA CONTINUAR " WKS-FIN-MSG                                    
244730         DELIMITED BY SIZE INTO TEXTO-LJ                                      
244735         PERFORM 70000050-CALL-LJ-MSG                                         
244740      ELSE                                                                    
244745         WAIT (60)                                                            
244750   ELSE                                                                       
244751      MOVE 2                         TO WKS-INTENTOS                          
244755      MOVE "E"                       TO TIPO-LJ                               
244760      STRING "ARCHIVO " WKS-NOMBRE-ARCH DELIMITED BY "  "                     
244762      " ENVIADO" DELIMITED BY SIZE INTO TEXTO-LJ                              
244765      PERFORM 70000050-CALL-LJ-MSG .                                          
244770   MOVE "O"                          TO TIPO-LJ.                              
244775                                                                              
244780 7006100-ENVIA-BD-CTAS-ORDNT.                                                 
244785*============================                                                 
244790   MOVE WKS-ARCH-EO-BD-CTAS-ORDNT    TO WKS-ARCHIVO-ENVIAR                    
244795   MOVE "CTOSREP"                    TO WKS-NOMBRE-ARCH                       
244800   MOVE "EO AAAAMMDD"                TO WKS-OPCION-ARCH                       
244805   PERFORM 9000000-ENVIA-INTELAR.                                             
244845                                                                              
244850 7006300-ENVIA-MONIT-L081.                                                    
244855*=========================                                                    
244860   MOVE WKS-ARCH-E4-MONIL081         TO WKS-ARCHIVO-ENVIAR                    
244865   MOVE "MONIL081"                   TO WKS-NOMBRE-ARCH                       
244870   MOVE "E4 AAAAMMDD SSSS MMMM XXXX" TO WKS-OPCION-ARCH                       
244880   PERFORM 9000000-ENVIA-INTELAR.                                             
244885                                                                              
244890 7006400-ENVIA-PROBL-L081.                                                    
244895*=========================                                                    
244900   MOVE WKS-ARCH-E5-PROBL081         TO WKS-ARCHIVO-ENVIAR                    
244905   MOVE "PROBL081"                   TO WKS-NOMBRE-ARCH                       
244910   MOVE "E5 AAAAMMDD SSSS MMMM XXXX" TO WKS-OPCION-ARCH                       
244920   PERFORM 9000000-ENVIA-INTELAR.                                             
244925                                                                              
244930 7006100-ENVIA-MONIT-P080.                                                    
244935*=========================                                                    
244940   MOVE WKS-ARCH-E1-MONIP080         TO WKS-ARCHIVO-ENVIAR                    
244945   MOVE "MONIP080"                   TO WKS-NOMBRE-ARCH                       
244950   MOVE "E1 AAAAMMDD"                TO WKS-OPCION-ARCH                       
244951   PERFORM 9000001-ENVIA-O-RECHAZA.                                           
244965                                                                              
244970 7006200-ENVIA-PROBL-P080.                                                    
244975*=========================                                                    
244980   MOVE WKS-ARCH-E2-PROBP080         TO WKS-ARCHIVO-ENVIAR                    
244985   MOVE "PROBP080"                   TO WKS-NOMBRE-ARCH                       
244990   MOVE "E2 AAAAMMDD"                TO WKS-OPCION-ARCH                       
244995   PERFORM 9000000-ENVIA-INTELAR.                                             
245000   ADD 1                             TO WKS-E2-NUM-COPIA.                     
245005                                                                              
245010 7006300-ENVIA-BITA-P080.                                                     
245015*=========================                                                    
245020   MOVE WKS-ARCH-E3-BITAP080         TO WKS-ARCHIVO-ENVIAR                    
245025   MOVE "BITAP080"                   TO WKS-NOMBRE-ARCH                       
245030   MOVE "E3 AAAAMMDD"                TO WKS-OPCION-ARCH                       
245035   PERFORM 9000000-ENVIA-INTELAR.                                             
245040                                                                              
245045 7006500-ENVIA-APERT-MASIV.                                                   
245050*=========================                                                    
245055   MOVE WKS-ARCH-E6-APERT-MASIVAS    TO WKS-ARCHIVO-ENVIAR                    
245060   MOVE "MMASIV"                     TO WKS-NOMBRE-ARCH                       
245065   MOVE "E6 AAAAMMDD SS"             TO WKS-OPCION-ARCH                       
245070   PERFORM 9000000-ENVIA-INTELAR.                                             
245075                                                                              
245080 7006600-ENVIA-PROBL-P142.                                                    
245085*=========================                                                    
245090   MOVE WKS-ARCH-E7-PROBP142         TO WKS-ARCHIVO-ENVIAR                    
245095   MOVE "PROBP142"                   TO WKS-NOMBRE-ARCH                       
245100   MOVE "E7 AAAAMMDD"                TO WKS-OPCION-ARCH                       
245105   PERFORM 9000000-ENVIA-INTELAR.                                             
245110                                                                              
245115 7006700-ENVIA-PROBL-P144.                                                    
245120*=========================                                                    
245125   MOVE WKS-ARCH-E8-PROB144          TO WKS-ARCHIVO-ENVIAR                    
245130   MOVE "PROBP144"                   TO WKS-NOMBRE-ARCH                       
245135   MOVE "E8 AAAAMMDD"                TO WKS-OPCION-ARCH                       
245140   PERFORM 9000000-ENVIA-INTELAR.                                             
245145                                                                              
245146 9000002-ERROR-RESIDENTE.                                                     
245147*========================                                                     
245148   STRING "ERROR AL ENVIAR ARCHIVO " WKS-NOMBRE-ARCH                          
245149   DELIMITED BY "  " " NO RESIDENTE"                                          
245150   DELIMITED BY SIZE INTO TEXTO-LJ                                            
245151   PERFORM 70000050-CALL-LJ-MSG.                                              
245152                                                                              
245153 9000001-ENVIA-O-RECHAZA.                                                     
245154*========================                                                     
245155   CHANGE ATTRIBUTE TITLE OF ARCH-RESIDENTE TO WKS-ARCHIVO-ENVIAR             
245156   IF ATTRIBUTE RESIDENT OF ARCH-RESIDENTE = VALUE TRUE                       
245157      PERFORM 9000000-ENVIA-INTELAR                                           
245158   ELSE                                                                       
245159      PERFORM 9000002-ERROR-RESIDENTE.                                        
245160                                                                              
245220 7007000-ENVIA-GBNPSDOS.                                                      
245225*=========================                                                    
245230   MOVE WKS-ARCH-C5-GBNPSDOS         TO WKS-ARCHIVO-ENVIAR                    
245235   MOVE "GBNPSDOS"                   TO WKS-NOMBRE-ARCH                       
245240   MOVE "C5 AAAAMMDD SSSS"           TO WKS-OPCION-ARCH                       
245245   PERFORM 9000001-ENVIA-O-RECHAZA.                                           
245250                                                                              
245255 7007100-ENVIA-GBNPRSLT.                                                      
245260*=========================                                                    
245265   MOVE WKS-ARCH-C6-GBNPRSLT         TO WKS-ARCHIVO-ENVIAR                    
245270   MOVE "GBNPRSLT"                   TO WKS-NOMBRE-ARCH                       
245275   MOVE "C6 AAAAMMDD SSSS"           TO WKS-OPCION-ARCH                       
245280   PERFORM 9000001-ENVIA-O-RECHAZA.                                           
245290                                                                              
245300 7006700-ENVIA-PGOSPEND.                                                      
245310*=========================                                                    
245320   MOVE WKS-ARCH-E9-PGOSPEND       TO WKS-ARCHIVO-ENVIAR                      
245330   MOVE "PGOSPEND"                 TO WKS-NOMBRE-ARCH                         
245340   MOVE "E9 AAAAMMDD"              TO WKS-OPCION-ARCH                         
245350   PERFORM 9000000-ENVIA-INTELAR.                                             
