000100$SET LIST$                                                                    
000200$SUPRESS                                                                      
000400$SET ERRORLIST                                                                
000500$SET LIST STACK  LINEINFO FREE                                                
000600$ERRORLIMIT = 5                                                               
000650$SET BD4B07R10                                                                
000670$SET LIST ERRORLIST XREF                                                      
000700*****************************************************************             
000800*        PARA INCLUDE MANEJO DE LIBRERIAS                       *             
000900*****************************************************************             
001000$SET S100VERSIONES                                                            
001100$SET S006LOCSUP                                                               
001200$SET FECHA2000 S000LIBLJ                                                      
001210$SET HOSTNAME                                                                 
001300*****************************************************************             
001400*    PARA INCLUDE  PROCESO BATCH                                *             
001500*****************************************************************             
001600                                                                              
001700*$RESET LIST$                                                                 
001800*****************************************************************             
001900* P188  P188  P188  P188  P188  P188  P188  P188  P188  P188    *             
002000*****************************************************************             
002100* FUNCIONES PRINCIPALES:                                        *             
002200* - GENERAR REPORTE DE DETALLES PARA LOS ARCHIVOS DE SALIDA QUE *             
002300*   ASI LO REQUIERAN                                            *             
002400* - ELIMINA EL ARCHIVO DE CONTROL DEL P187 PARA                 *             
002500*   INDICAR QUE GENERO EL REPORTE DE DETALLE.                   *             
002600* - PERMITE SER LLAMADO DESDE CUALQUIER SISTEMA Y GENERA EL     *             
002650*   LISTADO EN EL PACK DEL SISTEMA QUE LO INVOCA                *             
002700*                                                               *             
002800*                                                               *             
002900*****************************************************************             
003000 IDENTIFICATION DIVISION.                                                     
003100*****************************************************************             
003200 PROGRAM-ID.    P188.                                                         
003300 AUTHOR.        ROBERTO CARLOS.                                               
003400 DATE-WRITTEN.  JUNIO/2013.                                                   
003500*****************************************************************             
003600 ENVIRONMENT DIVISION.                                                        
003700*****************************************************************             
003800 INPUT-OUTPUT  SECTION.                                                       
003900 FILE-CONTROL.                                                                
004000     SELECT A01-SALIDA      ASSIGN TO DISK.                                   
004020     SELECT A01-SALORD      ASSIGN TO DISK.                                   
004040     SELECT A01-SALSORT     ASSIGN TO SORT DISK.                              
004100     SELECT A04-PROCDET     ASSIGN TO DISK                                    
004200                            ACCESS MODE  IS RANDOM                            
004300                            ACTUAL KEY   IS W77-KEY-DET.                      
004400     SELECT R04-DETALLE     ASSIGN TO PRINTER.                                
004500                                                                              
004600*****************************************************************             
004700 DATA DIVISION.                                                               
004800*****************************************************************             
004900 FILE                            SECTION.                                     
005000                                                                              
005100  FD A01-SALIDA                                                               
005200     VALUE OF DEPENDENTSPECS IS TRUE.                                         
005300     01 REG-A01-SAL.                                                          
005400        02 A01-ARCH-SALIDA    PIC X(130).                                     
005500        02 A01-SAL-HEADER     REDEFINES A01-ARCH-SALIDA.                      
005600          03 A01-HED-TREG        PIC X(01).                                   
005700          03 A01-HED-NODO        PIC 9(02).                                   
005800          03 A01-HED-FECPRO      PIC 9(06).                                   
005900          03 A01-HED-SISTCTE     PIC 9(12).                                   
006000          03 A01-HED-SEC         PIC 9(04).                                   
006100          03 A01-HED-DESC        PIC X(36).                                   
006200          03 FILLER              PIC X(69).                                   
006300        02 A01-SAL-DETALLE    REDEFINES A01-ARCH-SALIDA.                      
006400          03 A01-DET-TREG        PIC X(01).                                   
006500          03 A01-DET-SEC         PIC 9(08).                                   
006600          03 A01-DET-SUCORIG     PIC 9(04).                                   
006700          03 A01-DET-CAJORIG     PIC 9(02).                                   
006800          03 A01-DET-AUT         PIC 9(08).                                   
006900          03 A01-DET-CVETX       PIC 9(04).                                   
007000          03 A01-DET-TMOV        PIC 9(01).                                   
007100          03 A01-DET-TMDO        PIC 9(02).                                   
007200          03 A01-DET-SUCCTA      PIC 9(04).                                   
007300          03 A01-DET-CTO         PIC 9(12).                                   
007400          03 A01-DET-IMPORTE     PIC 9(14)V99.                                
007450          03 A01-DET-MONEDA      PIC 9(03).                                   
007500          03 A01-DET-REF         PIC 9(12).                                   
007600          03 A01-DET-STATUS      PIC 9(01).                                   
007700          03 A01-DET-CVERECH     PIC 9(04).                                   
007800          03 A01-DET-DESCRECH    PIC X(48).                                   
007900        02 A01-SAL-TRAILER    REDEFINES A01-ARCH-SALIDA.                      
008000          03 A01-TRA-TREG        PIC X(01).                                   
008100          03 A01-TRA-NUMABONOS   PIC 9(08).                                   
008200          03 A01-TRA-IMPABONOS   PIC 9(16)V99.                                
008300          03 A01-TRA-NUMCARGOS   PIC 9(08).                                   
008400          03 A01-TRA-TOTCARGOS   PIC 9(16)V99.                                
008500          03 A01-TRA-NUMNC       PIC 9(08).                                   
008600          03 A01-TRA-TOTACEPT    PIC 9(08).                                   
008700          03 A01-TRA-TOSRECH     PIC 9(08).                                   
008800          03 FILLER              PIC X(53).                                   
008801                                                                              
008802  FD A01-SALORD                                                               
008803     VALUE OF DEPENDENTSPECS IS TRUE.                                         
008804     01 REG-A01-O-SAL.                                                        
008805        02 A01-O-ARCH-SALIDA    PIC X(130).                                   
008806        02 A01-O-SAL-HEADER     REDEFINES A01-O-ARCH-SALIDA.                  
008807          03 A01-O-HED-TREG        PIC X(01).                                 
008808          03 A01-O-HED-NODO        PIC 9(02).                                 
008809          03 A01-O-HED-FECPRO      PIC 9(06).                                 
008810          03 A01-O-HED-SISTCTE     PIC 9(12).                                 
008811          03 A01-O-HED-SEC         PIC 9(04).                                 
008812          03 A01-O-HED-DESC        PIC X(36).                                 
008813          03 FILLER              PIC X(69).                                   
008814        02 A01-O-SAL-DETALLE    REDEFINES A01-O-ARCH-SALIDA.                  
008815          03 A01-O-DET-TREG        PIC X(01).                                 
008816          03 A01-O-DET-SEC         PIC 9(08).                                 
008817          03 A01-O-DET-SUCORIG     PIC 9(04).                                 
008818          03 A01-O-DET-CAJORIG     PIC 9(02).                                 
008819          03 A01-O-DET-AUT         PIC 9(08).                                 
008820          03 A01-O-DET-CVETX       PIC 9(04).                                 
008821          03 A01-O-DET-TMOV        PIC 9(01).                                 
008822          03 A01-O-DET-TMDO        PIC 9(02).                                 
008823          03 A01-O-DET-SUCCTA      PIC 9(04).                                 
008824          03 A01-O-DET-CTO         PIC 9(12).                                 
008825          03 A01-O-DET-IMPORTE     PIC 9(14)V99.                              
008826          03 A01-O-DET-MONEDA      PIC 9(03).                                 
008827          03 A01-O-DET-REF         PIC 9(12).                                 
008828          03 A01-O-DET-STATUS      PIC 9(01).                                 
008829          03 A01-O-DET-CVERECH     PIC 9(04).                                 
008830          03 A01-O-DET-DESCRECH    PIC X(48).                                 
008831        02 A01-O-SAL-TRAILER    REDEFINES A01-O-ARCH-SALIDA.                  
008832          03 A01-O-TRA-TREG        PIC X(01).                                 
008833          03 A01-O-TRA-NUMABONOS   PIC 9(08).                                 
008834          03 A01-O-TRA-IMPABONOS   PIC 9(16)V99.                              
008835          03 A01-O-TRA-NUMCARGOS   PIC 9(08).                                 
008836          03 A01-O-TRA-TOTCARGOS   PIC 9(16)V99.                              
008837          03 A01-O-TRA-NUMNC       PIC 9(08).                                 
008838          03 A01-O-TRA-TOTACEPT    PIC 9(08).                                 
008839          03 A01-O-TRA-TOSRECH     PIC 9(08).                                 
008840          03 FILLER              PIC X(53).                                   
008841                                                                              
008842  SD A01-SALSORT                                                              
008843     VALUE OF DEPENDENTSPECS IS TRUE.                                         
008844     01 REG-A01-S-SAL.                                                        
008845        02 A01-S-ARCH-SALIDA    PIC X(130).                                   
008846        02 A01-S-SAL-HEADER     REDEFINES A01-S-ARCH-SALIDA.                  
008847          03 A01-S-HED-TREG        PIC X(01).                                 
008848          03 A01-S-HED-NODO        PIC 9(02).                                 
008849          03 A01-S-HED-FECPRO      PIC 9(06).                                 
008850          03 A01-S-HED-SISTCTE     PIC 9(12).                                 
008851          03 A01-S-HED-SEC         PIC 9(04).                                 
008852          03 A01-S-HED-DESC        PIC X(36).                                 
008853          03 FILLER              PIC X(69).                                   
008854        02 A01-S-SAL-DETALLE    REDEFINES A01-S-ARCH-SALIDA.                  
008855          03 A01-S-DET-TREG        PIC X(01).                                 
008856          03 A01-S-DET-SEC         PIC 9(08).                                 
008857          03 A01-S-DET-SUCORIG     PIC 9(04).                                 
008858          03 A01-S-DET-CAJORIG     PIC 9(02).                                 
008859          03 A01-S-DET-AUT         PIC 9(08).                                 
008860          03 A01-S-DET-CVETX       PIC 9(04).                                 
008861          03 A01-S-DET-TMOV        PIC 9(01).                                 
008862          03 A01-S-DET-TMDO        PIC 9(02).                                 
008863          03 A01-S-DET-SUCCTA      PIC 9(04).                                 
008864          03 A01-S-DET-CTO         PIC 9(12).                                 
008865          03 A01-S-DET-IMPORTE     PIC 9(14)V99.                              
008866          03 A01-S-DET-MONEDA      PIC 9(03).                                 
008867          03 A01-S-DET-REF         PIC 9(12).                                 
008868          03 A01-S-DET-STATUS      PIC 9(01).                                 
008869          03 A01-S-DET-CVERECH     PIC 9(04).                                 
008870          03 A01-S-DET-DESCRECH    PIC X(48).                                 
008871        02 A01-S-SAL-TRAILER    REDEFINES A01-S-ARCH-SALIDA.                  
008872          03 A01-S-TRA-TREG        PIC X(01).                                 
008873          03 A01-S-TRA-NUMABONOS   PIC 9(08).                                 
008874          03 A01-S-TRA-IMPABONOS   PIC 9(16)V99.                              
008875          03 A01-S-TRA-NUMCARGOS   PIC 9(08).                                 
008876          03 A01-S-TRA-TOTCARGOS   PIC 9(16)V99.                              
008877          03 A01-S-TRA-NUMNC       PIC 9(08).                                 
008878          03 A01-S-TRA-TOTACEPT    PIC 9(08).                                 
008879          03 A01-S-TRA-TOSRECH     PIC 9(08).                                 
008880          03 FILLER              PIC X(53).                                   
008900                                                                              
009000  FD A04-PROCDET                                                              
009100     BLOCK   CONTAINS   50 RECORDS                                            
009200     VALUE OF PROTECTION           IS PROTECTED.                              
009300     01 REG-ARCHDET.                                                          
009400          03 A04-DET-INDI        PIC 9(01).                                   
009500          03 A04-DET-NOMARCH.                                                 
009600             05 FILLER           PIC X(02).                                   
009700             05 A04-DET-TITUSER  PIC X(03).                                   
009800             05 FILLER           PIC X(01).                                   
009900             05 A04-DET-TITSIST  PIC X(04).                                   
010000             05 FILLER           PIC X(11).                                   
010100             05 A04-DET-TITBUZO  PIC X(08).                                   
010200             05 FILLER           PIC X(01).                                   
010300             05 A04-DET-TITNODO  PIC X(02).                                   
010400             05 FILLER           PIC X(01).                                   
010500             05 A04-DET-TITFPRC  PIC X(08).                                   
010600             05 FILLER           PIC X(01).                                   
010700             05 A04-DET-TITSCTE  PIC X(12).                                   
010800             05 A04-DET-TITSCTE-R REDEFINES A04-DET-TITSCTE.                  
010900                07 FILLER        PIC X(09).                                   
011000                07 A04-DET-TITSIS PIC X(03).                                  
011100             05 FILLER           PIC X(01).                                   
011200             05 A04-DET-TITSEC   PIC X(04).                                   
011300             05 A04-DET-TITSEC-R REDEFINES A04-DET-TITSEC.                    
011400                07 FILLER        PIC X(01).                                   
011500                07 A04-DET-TITSEQ PIC X(03).                                  
011600             05 FILLER           PIC X(04).                                   
011700             05 A04-DET-TITPACK  PIC X(12).                                   
011800             05 FILLER           PIC X(01).                                   
011820          03 A04-DET-NOMARCH-R REDEFINES A04-DET-NOMARCH.                     
011840             05 FILLER           PIC X(06).                                   
011860             05 A04-DET-NOM-REN  PIC X(70).                                   
011900          03 A04-DET-FEC         PIC 9(08).                                   
011950          03 A04-DET-FEC-R     REDEFINES A04-DET-FEC.                         
012000             05 A04-DET-AA       PIC 9(04).                                   
012100             05 A04-DET-MM       PIC 9(02).                                   
012200             05 A04-DET-DD       PIC 9(02).                                   
012300          03 A04-DET-TOTREG      PIC 9(10).                                   
012400          03 A04-DET-TOTPROC     PIC 9(10).                                   
012500          03 A04-DET-TOTOK       PIC 9(10).                                   
012600          03 A04-DET-TOTRECH     PIC 9(10).                                   
012700          03 A04-DET-TOTFORAN    PIC 9(10).                                   
012800          03 A04-DET-CSI         PIC 9(02).                                   
012900          03 A04-DET-TIPO        PIC 9(01).                                   
013000          03 A04-DET-MIX         PIC 9(07).                                   
013002*** IBM-CHARITY-2002 INI                                                      
013004          03 A04-ESTATUS         PIC X(01).                                   
013006          03 A04-SUBESTATUS      PIC X(01).                                   
013008          03 A04-REINTENTOS      PIC 9(02).                                   
013100          03 FILLER              PIC X(31).                                   
013102*** IBM-CHARITY-2002 FIN                                                      
013200                                                                              
013300 FD R04-DETALLE                  REPORT IS REPORTE-DETA                       
013400   VALUE OF USERBACKUPNAME IS TRUE.                                           
013500                                                                              
013510*****************************************************************             
013520  DATA-BASE SECTION.                                                          
013530  DB S500BD04TARJETAS.                                                        
013540   01 S500B07PARCHIVOS.                                                       
013550   01 S500B08PCTRARRIBO.                                                      
013600*****************************************************************             
013700 WORKING-STORAGE SECTION.                                                     
013800                                                                              
013900********* INCLUDE DE WORKING PARA RUTINAS COMUNES ***************             
014000 COPY "S500/INC/WOR/25MTP002".                                                
014100                                                                              
014200***** VARIABLE USADAS POR LOS REPORTES                                        
014300 01 WKS-EDIT-FECMAQ.                                                          
014400    03 WKS-FECMAQ-DD     PIC 9(02).                                           
014500    03 FILLER            PIC X(01) VALUE "/".                                 
014600    03 WKS-FECMAQ-MM     PIC 9(02).                                           
014700    03 FILLER            PIC X(01) VALUE "/".                                 
014800    03 WKS-FECMAQ-AA     PIC 9(04).                                           
014900 01 WKS-EDIT-FECPROC.                                                         
015000    03 WKS-FECPROC-DD    PIC 9(02).                                           
015100    03 FILLER            PIC X(01) VALUE "/".                                 
015200    03 WKS-FECPROC-MM    PIC 9(02).                                           
015300    03 FILLER            PIC X(01) VALUE "/".                                 
015400    03 WKS-FECPROC-AA    PIC 9(04).                                           
015500 01 WKS-EDIT-TIME.                                                            
015600    03 WKS-TIME-HH       PIC 9(02).                                           
015700    03 FILLER            PIC X(01) VALUE ":".                                 
015800    03 WKS-TIME-MIN      PIC 9(02).                                           
015900    03 FILLER            PIC X(01) VALUE ":".                                 
016000    03 WKS-TIME          PIC 9(02).                                           
016100                                                                              
016200 01 WKS-ARCH-ENTRADA     PIC X(76) VALUE SPACES.                              
016300 01 WKS-ARCH-SALIDA      PIC X(76) VALUE SPACES.                              
016310 01 WKS-ARCH-SALIDA-R  REDEFINES WKS-ARCH-SALIDA.                             
016320    03 WKS-USERTIT       PIC X(10).                                           
016330    03 FILLER            PIC X(66).                                           
016340 01 WKS-ARCH-SALIDA-R2 REDEFINES WKS-ARCH-SALIDA.                             
016350    03 WKS-SAL-USER      PIC X(06).                                           
016360    03 WKS-SAL-SINUSER   PIC X(70).                                           
016370                                                                              
016380 01 WKS-ARCH-SALORD      PIC X(76) VALUE SPACES.                              
016386                                                                              
016400 01 WKS-WFL-PARAM.                                                            
016500   02 WKS-WFL-SISCTE PIC 9(12).                                               
016600   02 WKS-WFL-NODO   PIC 9(02).                                               
016700   02 WKS-WFL-SEC    PIC 9(04).                                               
016800   02 WKS-WFL-FEC    PIC 9(08).                                               
016900   02 WKS-WFL-REG    PIC 9(04).                                               
017000                                                                              
017020 77 WS-TASKSTRING    PIC X(46).                                               
017040                                                                              
017100  01 WS-TIT-A04.                                                              
017200     03 FILLER                    PIC X(16)                                   
017300        VALUE "(S500)S500/FILE/".                                             
017320     03 WS-A04-PASO               PIC X(04) VALUE "P187".                     
017340     03 FILLER                    PIC X(01) VALUE "/".                        
017400     03 WS-A04-CSI                PIC 9(02).                                  
017500     03 FILLER                    PIC X(08) VALUE "/IMPDET/".                 
017600     03 WS-A04-FEC                PIC 9(08).                                  
017700     03 WS-A04-FECX               REDEFINES WS-A04-FEC.                       
017800        05 WS-A04-AA              PIC 9(04).                                  
017900        05 WS-A04-MM              PIC 9(02).                                  
018000        05 WS-A04-DD              PIC 9(02).                                  
018100     03 FILLER                    PIC X(01) VALUE "/".                        
018200     03 WS-A04-SEC                PIC 9(04).                                  
018300     03 WS-A04-PUNTO              PIC X(01) VALUE ".".                        
018400                                                                              
018500  01  WS-TIT-REPORTES.                                                        
018600      03 FILLER                    PIC X(01) VALUE "S".                       
018620      03 WS-TIT-SIST-ORIG          PIC X(03) VALUE "500".                     
018640      03 FILLER                    PIC X(06) VALUE "/LIST/".                  
018700      03 WS-TIT-PASO               PIC X(04) VALUE "P187".                    
018750      03 FILLER                    PIC X(01) VALUE "/".                       
018800      03 WS-TIT-CE-NODO            PIC 99    VALUE 04.                        
018900      03 WS-TIT-CE-SBNODO          PIC 99    VALUE ZEROS.                     
019000      03 FILLER                    PIC X(02) VALUE "/R".                      
019100      03 WS-TIT-SECUENC            PIC 9(03) VALUE ZEROS.                     
019200      03 FILLER                    PIC X(01) VALUE "/".                       
019300      03 WS-TIT-CE-FEC             PIC 9(06).                                 
019400      03 FILLER                    PIC X     VALUE "/".                       
019500      03 WS-TIT-CE-MIX             PIC 9(07).                                 
019600      03 FILLER                    PIC X(02) VALUE "/0".                      
019700      03 FILLER                    PIC X(02) VALUE "04".                      
019800      03 WS-TIT-MNE-TIPO           PIC X(01) VALUE SPACES.                    
019900      03 WS-TIT-MNE-SISCTE         PIC X(03) VALUE SPACES.                    
020000      03 WS-TIT-CE-NAME            PIC X(07) VALUE "DETALLE".                 
020050      03 WS-TIT-MNE-NODO           PIC X(02) VALUE SPACES.                    
020100      03 FILLER                    PIC X     VALUE ".".                       
020110                                                                              
020120 01 WS-NOMBRE-VALUE.                                                          
020130    03  WS-NOMBRE-VALUE-PRE         PIC X(10).                                
020140    03  WS-NOMBRE-VALUE-OK          PIC X(46).                                
020150    03  WS-NOMBRE-VALUE-PUNTO       PIC X.                                    
020155                                                                              
020160 01 WKS-WFL-SYSTEMF USAGE DISPLAY.                                            
020165    03 FILLER                             PIC X(29) VALUE                     
020170              "BEGIN JOB SYSTEM/FORZA/P188; ".                                
020175    03 FILLER                             PIC X(26) VALUE                     
020180              "JOBSUMMARY=UNCONDITIONAL; ".                                   
020185    03 FILLER                             PIC X(40) VALUE                     
020190              "FAMILY DISK = CAPTACION OTHERWISE DISK; ".                     
020195    03 FILLER                             PIC X(17) VALUE                     
020200       "RUN SYSTEM/FORZA(".                                                   
020205    03 FILLER                             PIC X(01) VALUE QUOTES.             
020210    03 FILLER                             PIC X(14) VALUE                     
020215               "S500/LIST/P187".                                              
020220    03 FILLER                             PIC X(01) VALUE QUOTES.             
020225    03 FILLER                             PIC X(03) VALUE "); ".              
020230    03 FILLER                             PIC X(08) VALUE                     
020235                               "END JOB.".                                    
020240                                                                              
020300 01 WS-TIT-RENOMB                PIC X(86) VALUE SPACES.                      
020400 01 SW-EOF-AD                    PIC 9(02)      VALUE 0.                      
020500 01 SW-EOF-SAL                   PIC 9(02)      VALUE 0.                      
020600 01 SW-GENERA-REP                PIC 9(02)      VALUE 0.                      
020700 01 WKS-MSG-LJ                   PIC X(50) VALUE SPACES.                      
020800 01 WKS-HORA-MAQUINA             PIC 9(08).                                   
020900 01 RED-WKS-HORA-MAQ   REDEFINES WKS-HORA-MAQUINA.                            
021000    03 WKS-MAQ-HH                PIC 9(02).                                   
021100    03 WKS-MAQ-MM                PIC 9(02).                                   
021200    03 WKS-MAQ-SS                PIC 9(02).                                   
021300    03 WKS-MAQ-CC                PIC 9(02).                                   
021400                                                                              
021500 01 WKS-FECHA-M                   PIC 9(08).                                  
021600 01 WKS-FECHA-G REDEFINES WKS-FECHA-M.                                        
021700     03 WKS-FEC-ANO               PIC 9(04).                                  
021800     03 WKS-FEC-MES               PIC 9(02).                                  
021900     03 WKS-FEC-DIA               PIC 9(02).                                  
021905                                                                              
021908 77 WKS-SUCU-ANT          PIC 9(04) VALUE ZEROS.                              
021910 77 WKS-CAJA-ANT          PIC 9(02) VALUE ZEROS.                              
021914                                                                              
021916 77 WKS-SUCCAJ-TOTREG     PIC 9(10) VALUE ZEROS.                              
021918 77 WKS-SUCCAJ-TOTOK      PIC 9(10) VALUE ZEROS.                              
021920 77 WKS-SUCCAJ-TOTRECH    PIC 9(10) VALUE ZEROS.                              
021922 77 WKS-SUCCAJ-TOTFORAN   PIC 9(10) VALUE ZEROS.                              
021950                                                                              
021955 77  W77-FRAMESIZE                        PIC  9(02) COMP.                    
021960 77  W77-LASTRECORD                       PIC  9(12) COMP.                    
021965 77  W77-MAXRECSIZE                       PIC  9(12) COMP.                    
021970 77  W77-DISK-SIZE                        PIC  9(18) COMP.                    
021975 77  W77-MEMORY-SIZE                      PIC  9(18) COMP.                    
021980 77  W77-MEMORY-65K                       PIC  9(18) COMP.                    
021985 01  WS-CALC-WORD                         PIC  9(12)V99.                      
021990 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                               
021995     02 WS-WORD-ENT                       PIC  9(012).                        
022000     02 WS-WORD-RES                       PIC  9(002).                        
022035                                                                              
022100 77 W77-KEY-DET          PIC 9(16) VALUE ZEROS.                               
022200 77 WKS-CSI              PIC 9(02) VALUE ZEROS.                               
022300 77 WKS-NOM-ARCHENT      PIC X(75) VALUE SPACES.                              
022400 77 WKS-R1-ARCHPROC      PIC 9(10) VALUE ZEROS.                               
022500 77 WKS-R1-TOTREG        PIC 9(10) VALUE ZEROS.                               
022600 77 WKS-R1-TOTPROC       PIC 9(10) VALUE ZEROS.                               
022700 77 WKS-R1-TOTOK         PIC 9(10) VALUE ZEROS.                               
022800 77 WKS-R1-TOTRECH       PIC 9(10) VALUE ZEROS.                               
022900 77 WKS-R1-TOTFORAN      PIC 9(10) VALUE ZEROS.                               
023000 77 WKS-R2-LEYENDA       PIC X(75) VALUE SPACES.                              
023100 77 WKS-R2-TOTARCH       PIC 9(10) VALUE ZEROS.                               
023200 77 WKS-R2-TOTALPEND     PIC 9(10) VALUE ZEROS.                               
023300 77 WKS-R3-LEYENDA       PIC X(50) VALUE SPACES.                              
023400 77 WKS-R3-TOTARCH       PIC 9(10) VALUE ZEROS.                               
023500 77 WKS-R3-TOTALPEND     PIC 9(10) VALUE ZEROS.                               
023502 77 WKS-R1-TOTNOPROCE    PIC 9(10) VALUE ZEROS.                               
023600 77 WKS-FIN              PIC 9(01) VALUE ZERO.                                
023700 77 WKS-TIT-LEY          PIC X(14) VALUE SPACES.                              
023800 77 WKS-NUM-DETALLES     PIC 9(10) VALUE ZEROS.                               
023900 77 WS-SIST-CTE          PIC 9(12) VALUE ZEROS.                               
024000 77 WS-TIPO              PIC 9(02) VALUE ZEROS.                               
024100 77 WS-SECUENCIAL        PIC 9(04) VALUE ZEROS.                               
024200 77 WS-NODO              PIC 9(02) VALUE ZEROS.                               
024300 77 W77-MY-PASO          PIC 9(04) COMP.                                      
024400*    PARA OBTENER EL NOMBRE DEL EQUIPO                                        
024500 01  WKS-NAME-HOST.                                                           
024600     02 WKS-MY-HOST         PIC X(20).                                        
024700     02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
024800        04 WKS-MY-HOST-03   PIC X(04).                                        
024900        04 WKS-MY-HOST-17   PIC X(16).                                        
025000                                                                              
025001*** IBM-CHARITY-2002 INI                                                      
025002 01 WS-TAB-LEYENDA.                                                           
025003       03 FILLER            PIC X(046) VALUE                                  
025004          "A=POR RECIBIRSE".                                                  
025005       03 FILLER            PIC X(046) VALUE                                  
025006          "B=RECIBIDO".                                                       
025007       03 FILLER            PIC X(046) VALUE                                  
025008          "C=EN PROCESO".                                                     
025009       03 FILLER            PIC X(046) VALUE                                  
025010          "D=PROCESADO-TERMINADO                         ".                   
025011       03 FILLER            PIC X(046) VALUE                                  
025012          "E=BLOQUEADO POR RECIBIRSE".                                        
025013       03 FILLER            PIC X(046) VALUE                                  
025014          "F=BLOQUEADO RECIBIDO".                                             
025015       03 FILLER            PIC X(046) VALUE                                  
025016          "G=SUSPENDIDO".                                                     
025017       03 FILLER            PIC X(046) VALUE                                  
025018          "H=SUSPENDIDO POR INICIO DE BATCH".                                 
025019       03 FILLER            PIC X(046) VALUE                                  
025020          "I=RECIBIDO FUERA DE HORARIO".                                      
025021       03 FILLER            PIC X(046) VALUE                                  
025022          "J=SUSPENDIDO POR ERROR DE LECTURA".                                
025023       03 FILLER            PIC X(046) VALUE                                  
025024          "K=SUSPENDIDO POR ERROR DE LECTURA-NOTIFICADO".                     
025025       03 FILLER            PIC X(046) VALUE                                  
025026          "L=SUSPENDIDO POR ERROR DE ESCRITURA".                              
025027       03 FILLER            PIC X(046) VALUE                                  
025028          "M=SUSPENDIDO POR ERROR DE ESCRITURA-NOTIFICADO".                   
025029       03 FILLER            PIC X(046) VALUE                                  
025030          "N=SUSPENDIDO POR ERROR DE HEADER".                                 
025031       03 FILLER            PIC X(046) VALUE                                  
025032          "O=SUSPENDIDO POR ERROR DE TRAILER".                                
025033       03 FILLER            PIC X(046) VALUE                                  
025034          "P=ERROR ARCHIVO DE ENTRADA REMOVIDO".                              
025035       03 FILLER            PIC X(046) VALUE                                  
025036          "Q=ERROR ARCHIVO DE ENTRADA REMOVIDO-NOTIFICADO".                   
025037       03 FILLER            PIC X(046) VALUE                                  
025038          "R=ARCHIVO SIN INTEGRIDAD                      ".                   
025039       03 FILLER            PIC X(046) VALUE                                  
025040          "S=EXCEDIO REGISTROS PERMITIDOS                ".                   
025041       03 FILLER            PIC X(046) VALUE                                  
025042          "T=TERMINADO PARCIAL                           ".                   
025043       03 FILLER            PIC X(046) VALUE                                  
025044          "U=ARCHIVO NO RECIBIDO                         ".                   
025045       03 FILLER            PIC X(046) VALUE                                  
025046          "V=VALIDANDO                                   ".                   
025047       03 FILLER            PIC X(046) VALUE                                  
025048          "W=DISPERSANDO                                 ".                   
025049                                                                              
025050                                                                              
025051                                                                              
025052                                                                              
025053                                                                              
025054                                                                              
025055                                                                              
025056                                                                              
025057                                                                              
025058                                                                              
025059                                                                              
025060 01 WS-TAB-LEYENDA-X  REDEFINES WS-TAB-LEYENDA.                               
025061    03 WKS-TAB-LEYOCC       OCCURS 23 TIMES                                   
025062                            INDEXED BY INDICE.                                
025063       05 WKS-ID-LEY        PIC X(001).                                       
025064       05 FILLER            PIC X(001).                                       
025065       05 WKS-LEYENDA       PIC X(044).                                       
025066                                                                              
025067                                                                              
025068                                                                              
025069                                                                              
025070                                                                              
025071                                                                              
025072                                                                              
025073 01 WKS-ARC-ESTATUS              PIC X.                                       
025074 01 WKS-ARC-LEYENDA              PIC X(44).                                   
025075 01 WKS-ARC-REINTENTOS           PIC 9(02).                                   
025076                                                                              
025100                                                                              
025101 01 WS-TAB-LEYENDA-SUBEST.                                                    
025102       03 FILLER            PIC X(028) VALUE                                  
025103          " - OK                       ".                                     
025104       03 FILLER            PIC X(028) VALUE                                  
025105          "J-ERROR DE LECTURA          ".                                     
025106       03 FILLER            PIC X(028) VALUE                                  
025107          "K-ERROR DE LECTURA          ".                                     
025108       03 FILLER            PIC X(028) VALUE                                  
025109          "L-ERROR DE ESCRITURA        ".                                     
025110       03 FILLER            PIC X(028) VALUE                                  
025111          "M-ERROR DE ESCRITURA        ".                                     
025112       03 FILLER            PIC X(028) VALUE                                  
025113          "N-ERROR DE HEADER           ".                                     
025114       03 FILLER            PIC X(028) VALUE                                  
025115          "O-ERROR DE TRAILER          ".                                     
025116       03 FILLER            PIC X(028) VALUE                                  
025117          "P-ARCHIVO REMOVIDO          ".                                     
025118       03 FILLER            PIC X(028) VALUE                                  
025119          "Q-ARCHIVO REMOVIDO          ".                                     
025120       03 FILLER            PIC X(028) VALUE                                  
025121          "R-ERROR DE INTEGRIDAD       ".                                     
025122       03 FILLER            PIC X(028) VALUE                                  
025123          "S-EXCEDIO LIMITE REGISTROS  ".                                     
025124                                                                              
025125                                                                              
025126                                                                              
025127                                                                              
025128                                                                              
025129                                                                              
025130                                                                              
025131                                                                              
025132                                                                              
025133                                                                              
025134 01 WS-TAB-LEYENDA-ARRAYSUB REDEFINES WS-TAB-LEYENDA-SUBEST.                  
025135    03 WKS-TAB-LEYOCC-SUB   OCCURS 11 TIMES                                   
025136                            INDEXED BY INDICE-SUB.                            
025137       05 WKS-ID-LEY-SUB        PIC X(001).                                   
025138       05 WKS-LEYENDA-SUB       PIC X(027).                                   
025139*** IBM-CHARITY-2002 FIN                                                      
025200*****     TABLAS *****                                                        
025300 01 WS-TAB-TIP-MOVTO.                                                         
025400    03 FILLER            PIC X(02) VALUE "CA".                                
025500    03 FILLER            PIC X(02) VALUE "AB".                                
025600    03 FILLER            PIC X(02) VALUE "NC".                                
025700    03 FILLER            PIC X(02) VALUE "ER".                                
025800 01 WS-TAB-TIP-MOVTO-X   REDEFINES WS-TAB-TIP-MOVTO.                          
025900    03 WS-TAB-TIP-MOV  PIC X(002) OCCURS 4 TIMES.                             
026000                                                                              
026100 01 WS-TAB-STATUS.                                                            
026200    03 FILLER            PIC X(004) VALUE "APL ".                             
026300    03 FILLER            PIC X(004) VALUE "RECH".                             
026400    03 FILLER            PIC X(004) VALUE "FOR ".                             
026500    03 FILLER            PIC X(004) VALUE "ERR ".                             
026600 01 WS-TAB-ESTATUS-X     REDEFINES WS-TAB-STATUS.                             
026700    03 WS-TAB-TIP-STATUS PIC X(004) OCCURS 4 TIMES.                           
026800                                                                              
026900 01 WS-TAB-MDOACCESO.                                                         
027000    03 FILLER            PIC X(004) VALUE "CTO ".                             
027100    03 FILLER            PIC X(004) VALUE "CHEQ".                             
027200    03 FILLER            PIC X(004) VALUE "TARJ".                             
027300    03 FILLER            PIC X(004) VALUE "ERR ".                             
027400 01 WS-TAB-MEDOACCESO-X  REDEFINES WS-TAB-MDOACCESO.                          
027500    03 WS-TAB-TIP-MDOACC PIC X(004) OCCURS 4 TIMES.                           
027600                                                                              
027700 01  WKS-HI-TEXTO.                                                            
027800     02 WKS-HI-TEX01             PIC X(03) VALUE "HI=".                       
027900     02 WKS-HI-NUMHI             PIC 9(03).                                   
028000     02 FILLER                   PIC X(07) VALUE " COPIA=".                   
028100     02 WKS-HI-NCOPIA            PIC 99.                                      
028200     02 FILLES                   PIC X     VALUE " ".                         
028300     02 WKS-HI-DETALLE.                                                       
028400        04 WKS-HI-TEX02          PIC X(08).                                   
028500        04 WKS-HI-LEIDOS         PIC 9(08).                                   
028600        04 WKS-HI-TEX04          PIC X(12).                                   
028700        04 WKS-HI-PROCESA        PIC 9(08).                                   
028800        04 WKS-HI-TEX05          PIC X(07).                                   
028900        04 WKS-HI-TOTALBD        PIC 9(08).                                   
029000                                                                              
029005*  77 W77-CONTADOR-REG             PIC 9(10) VALUE ZEROS.                     
029010  01 WKS-HORARIO-MAQ         PIC 9(06).                                       
029015  01 WKS-TIME-MAQ REDEFINES  WKS-HORARIO-MAQ.                                 
029020     03 WKS-TIME-MAQ-H       PIC 9(02).                                       
029025     03 WKS-TIME-MAQ-M       PIC 9(02).                                       
029030     03 WKS-TIME-MAQ-S       PIC 9(02).                                       
029035  77 WKS-TIME-MAX            PIC 9(06) VALUE 100000.                          
029040  77 WKS-TIME-INI            PIC 9(06) VALUE 190000.                          
029045  77 WKS-FEC-TERMINO         PIC 9(08) VALUE ZEROS.                           
029050                                                                              
029052 01  WKS-START-WFL USAGE DISPLAY.                                             
029054     03 FILLER                    PIC  X(16)  VALUE                           
029056                               "BEGIN JOB LOTE; ".                            
029058     03 FILLER                    PIC  X(25)  VALUE                           
029060        "JOBSUMMARY=UNCONDITIONAL;".                                          
029062     03 FILLER                    PIC  X(06)  VALUE                           
029064        " COPY ".                                                             
029066     03 WKS-NOM-SISORIG           PIC  X(06) VALUE "(S500)".                  
029067     03 WKS-NOM-ORIG              PIC  X(53).                                 
029068     03 FILLER                    PIC  X(04)  VALUE                           
029070        " AS ".                                                               
029072     03 WKS-NOM-DEST              PIC  X(68).                                 
029075     03 WKS-NOM-DEST-R REDEFINES WKS-NOM-DEST.                                
029080        05  WKS-NOM-DEST-USER     PIC  X(06).                                 
029085        05  WKS-NOM-DEST-APL      PIC  X(09).                                 
029090        05  WKS-NOM-DEST-RESTO    PIC  X(53).                                 
029095                                                                              
029100  01 WKS-NOMGEN.                                                              
029120     03  WKS-NOMGEN-SINPACK      PIC X(53).                                   
029140     03  WKS-NOMGEN-PACK         PIC X(17).                                   
029142                                                                              
029144                                                                              
029176                                                                              
029178******************************************************************            
029200 REPORT SECTION.                                                              
029300******************************************************************            
029400******************************************************************            
029500************    REPORTE DETALLE DE CADA ARCHIVO                               
029600******************************************************************            
029700 RD REPORTE-DETA                                                              
029800          PAGE LIMIT  40 LINES                                                
029900          HEADING      1                                                      
030000          FIRST DETAIL 12                                                     
030100          LAST  DETAIL 40.                                                    
030200                                                                              
030300 01 R04-ENC-PROC TYPE PH.                                                     
030400    02 LINE 1.                                                                
030500       03 COLUMN  051     PIC X(30) VALUE                                     
030600          "BANCO NACIONAL DE MEXICO, S.A.".                                   
030700*---------                                                                    
030800    02 LINE 2.                                                                
030900       03 COLUMN  055     PIC X(20) VALUE                                     
031000          "DEPOSITOS A LA VISTA".                                             
031100*---------                                                                    
031200    02 LINE 3.                                                                
031300       03 COLUMN  001     PIC X(05) VALUE "S500-".                            
031400       03 COLUMN  006     PIC X(04) SOURCE WS-TIT-PASO.                       
031450       03 COLUMN  010     PIC X(14) VALUE "-004DETALLE   ".                   
031500       03 COLUMN  053     PIC X(50) VALUE                                     
031600          "DETALLE ARCHIVO PROCESADO".                                        
031700       03 COLUMN  115     PIC X(05) VALUE "FECHA ".                           
031800       03 COLUMN  122     PIC X(10) SOURCE WKS-EDIT-FECMAQ.                   
031900*---------                                                                    
032000    02 LINE 4.                                                                
032100       03 COLUMN  001     PIC X(08) VALUE                                     
032200          "PROCESO ".                                                         
032300       03 COLUMN  009     PIC X(10) SOURCE WKS-EDIT-FECPROC.                  
032400       03 COLUMN  115     PIC X(06) VALUE "HOJA ".                            
032500       03 COLUMN  122     PIC 9(05) SOURCE PAGE-COUNTER.                      
032600*----------                                                                   
032700    02 LINE 5.                                                                
032800       03 COLUMN  001     PIC X(05) VALUE "HORA ".                            
032900       03 COLUMN  009     PIC X(10) SOURCE WKS-EDIT-TIME.                     
033000       03 COLUMN  024     PIC X(04) VALUE "CSI:".                             
033100       03 COLUMN  030     PIC X(02) SOURCE WKS-CSI.                           
033102*** IBM-CHARITY-2002 INI                                                      
033104       03 COLUMN  035     PIC X(09) VALUE "ESTATUS: ".                        
033106       03 COLUMN  044     PIC X(01) SOURCE WKS-ARC-ESTATUS.                   
033108       03 COLUMN  045     PIC X(01) VALUE "=".                                
033110       03 COLUMN  046     PIC X(44) SOURCE WKS-ARC-LEYENDA.                   
033112       03 COLUMN  115     PIC X(11) VALUE "REINTENTOS:".                      
033114       03 COLUMN  126     PIC Z9    SOURCE WKS-ARC-REINTENTOS.                
033116*** IBM-CHARITY-2002 FIN                                                      
033200*----------                                                                   
033300    02 LINE 6.                                                                
033400       03 COLUMN  001     PIC X(90) VALUE SPACES.                             
033500*----------                                                                   
033600    02 LINE 7.                                                                
033700       03 COLUMN  016     PIC X(17) VALUE "ARCHIVO ENTRADA:".                 
033800       03 COLUMN  035     PIC X(76) SOURCE WKS-ARCH-ENTRADA.                  
033900       03 COLUMN  116     PIC X(14) SOURCE WKS-TIT-LEY.                       
034000*----------                                                                   
034100    02 LINE 8.                                                                
034200       03 COLUMN  016     PIC X(17) VALUE "ARCHIVO SALIDA :".                 
034300       03 COLUMN  035     PIC X(76) SOURCE WKS-ARCH-SALIDA.                   
034400*----------                                                                   
034500    02 LINE 9.                                                                
034600       03 COLUMN  001     PIC X(90) VALUE SPACES.                             
034605*----------                                                                   
034610    02 LINE 10.                                                               
034615       03 COLUMN  001     PIC X(09) VALUE "SUCURSAL:".                        
034620       03 COLUMN  010     PIC X(04) SOURCE A01-O-DET-SUCORIG.                 
034630       03 COLUMN  015     PIC X(05) VALUE "CAJA:".                            
034635       03 COLUMN  020     PIC X(02) SOURCE A01-O-DET-CAJORIG.                 
034650*----------                                                                   
034800    02 LINE 11.                                                               
034900       03 COLUMN  001     PIC X(36) VALUE                                     
035000          "TIPO /MEDIO DE ACCESO  REFERENCIA".                                
035100       03 COLUMN  036     PIC X(36) VALUE                                     
035200          "AUTORIZACION SECUENCIAL TRANSAC".                                  
035300       03 COLUMN  076     PIC X(49) VALUE                                     
035400          "IMPORTE          STATUS/CLAVE RECHAZO/DESCRIPCION".                
035570                                                                              
035600*---------                                                                    
035700 01 R04-DET-PROC             TYPE DETAIL.                                     
035800    02 LINE PLUS 1.                                                           
035900       03 COLUMN  001     PIC X(04) SOURCE                                    
036000                          WS-TAB-TIP-MDOACC(A01-O-DET-TMDO).                  
036100       03 COLUMN  006     PIC X(04) SOURCE A01-O-DET-SUCCTA.                  
036200       03 COLUMN  010     PIC X(12) SOURCE A01-O-DET-CTO.                     
036300       03 COLUMN  024     PIC X(12) SOURCE A01-O-DET-REF.                     
036400       03 COLUMN  039     PIC X(08) SOURCE A01-O-DET-AUT.                     
036500       03 COLUMN  050     PIC X(08) SOURCE A01-O-DET-SEC.                     
036600       03 COLUMN  061     PIC X(04) SOURCE A01-O-DET-CVETX.                   
036620       03 COLUMN  069     PIC $ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99                          
036640                                    SOURCE A01-O-DET-IMPORTE.                 
036700       03 COLUMN  095     PIC X(04) SOURCE                                    
036800                          WS-TAB-TIP-MOV(A01-O-DET-TMOV).                     
036900       03 COLUMN  100     PIC X(04) SOURCE                                    
037000                          WS-TAB-TIP-STATUS(A01-O-DET-STATUS).                
037100       03 COLUMN  109     PIC X(04) SOURCE A01-O-DET-CVERECH.                 
037200       03 COLUMN  114     PIC X(46) SOURCE A01-O-DET-DESCRECH.                
037300*---------                                                                    
037400 01 R04-DET-PROC-VACIO         TYPE DETAIL.                                   
037500    02 LINE PLUS 1.                                                           
037600       03 COLUMN  001     PIC X(30) VALUE SPACES.                             
037700       03 COLUMN  035     PIC X(47) VALUE                                     
037800          "********       NO HAY INFORMACION       *******".                  
037805*---------                                                                    
037810 01 R04-DET-PROC-INTERRUP TYPE DETAIL.                                        
037815    02 LINE PLUS 1.                                                           
037820       03 COLUMN  001     PIC X(30) VALUE SPACES.                             
037825    02 LINE PLUS 2.                                                           
037835       03 COLUMN  016     PIC X(48) VALUE                                     
037840       "******** LISTADO INTERRUPMPIDO SE SUSPENDIO POR ".                    
037845       03 COLUMN  064     PIC X(40) VALUE                                     
037850       "LIMITE DE HORARIO DE PROCESO ********".                               
037855    02 LINE PLUS 3.                                                           
037860       03 COLUMN  024     PIC X(08) VALUE "********".                         
037865       03 COLUMN  032     PIC X(55) VALUE                                     
037870       "ESPERAR UN DIA PARA OBTENER EL LISTADO COMPLETO********".             
037900                                                                              
038000*---------                                                                    
038005 01 R04-SUC-CAJ-TOTAL         TYPE DETAIL.                                    
038014    02 LINE PLUS 2.                                                           
038015       03 COLUMN 001      PIC X(23)                                           
038020                          VALUE "TOTAL REG POR SUC/CAJ: ".                    
038025       03 COLUMN 024      PIC X(10)  SOURCE WKS-SUCCAJ-TOTREG.                
038030       03 COLUMN 035      PIC X(04)  VALUE "OK: ".                            
038035       03 COLUMN 040      PIC X(10)  SOURCE WKS-SUCCAJ-TOTOK.                 
038040       03 COLUMN 051      PIC X(12)  VALUE "RECHAZADOS: ".                    
038045       03 COLUMN 064      PIC X(10)  SOURCE WKS-SUCCAJ-TOTRECH.               
038050       03 COLUMN 075      PIC X(10)  VALUE "FORANEOS: ".                      
038055       03 COLUMN 086      PIC X(10)  SOURCE WKS-SUCCAJ-TOTFORAN.              
038060                                                                              
038065*---------                                                                    
038100 01 R04-DET-PROC-TOTAL         TYPE DETAIL.                                   
038200    02 LINE PLUS 2.                                                           
038300       03 COLUMN 001      PIC X(17)  VALUE "TOTAL REGISTROS: ".               
038400       03 COLUMN 018      PIC X(10)  SOURCE WKS-R1-TOTREG.                    
038500       03 COLUMN 029      PIC X(12)  VALUE "PROCESADOS: ".                    
038600       03 COLUMN 041      PIC X(10)  SOURCE WKS-R1-TOTPROC.                   
038700       03 COLUMN 052      PIC X(04)  VALUE "OK: ".                            
038800       03 COLUMN 056      PIC X(10)  SOURCE WKS-R1-TOTOK.                     
038900       03 COLUMN 067      PIC X(12)  VALUE "RECHAZADOS: ".                    
039000       03 COLUMN 079      PIC X(10)  SOURCE WKS-R1-TOTRECH.                   
039100       03 COLUMN 090      PIC X(10)  VALUE "FORANEOS: ".                      
039200       03 COLUMN 100      PIC X(10)  SOURCE WKS-R1-TOTFORAN.                  
039202       03 COLUMN 111      PIC X(10)  VALUE "NO PROCE: ".                      
039204       03 COLUMN 121      PIC X(10)  SOURCE WKS-R1-TOTNOPROCE.                
039300                                                                              
039400*****************************************************************             
039500 PROCEDURE DIVISION.                                                          
039600*****************************************************************             
039700 DECLARATIVES.                                                                
039800 INTERRUPT-SECCION        SECTION  00.                                        
039900     USE AS INTERRUPT PROCEDURE.                                              
040000 INTERRUPT-BY-HI.                                                             
040100     DISALLOW  INTERRUPT.                                                     
040300     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI-NUMHI                       
040400     IF WKS-HI-NUMHI = 4                                                      
040500         STRING "TERMINO DE PROCESO POR INTERRUPCION CON HI-4,",              
040600         "AL PROCESAR ARCHIVO DE SALIDA: " A04-DET-NOMARCH                    
040700         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
040800        PERFORM 70000050-MENSAJE                                              
040900        STOP RUN                                                              
041000     ELSE                                                                     
041100        STRING "NUM HI ERRONEO ", WKS-HI-NUMHI                                
041200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
041300        PERFORM 70000050-MENSAJE.                                             
041400                                                                              
041500     SET MYSELF (TASKVALUE)  TO ZERO.                                         
041600     ALLOW INTERRUPT.                                                         
041700                                                                              
041800 END DECLARATIVES.                                                            
041900*****************************************************************             
042000 00000000-CONTROL  SECTION  01.                                               
042100*****************************************************************             
042200 00000000-CONTROL-PROGRAMA.                                                   
042300*****************************************************************             
042400                                                                              
042500  ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF.             
042600  ALLOW INTERRUPT.                                                            
042700                                                                              
042800    PERFORM 40000000-INICIO.                                                  
042900    PERFORM 50000000-PROCESO.                                                 
042950    PERFORM 60000000-FIN.                                                     
043000    STOP RUN.                                                                 
043100                                                                              
043200*================                                                             
043300 40000000-INICIO.                                                             
043400*================                                                             
043500                                                                              
043600    MOVE 2            TO  W77-USO-LIBLJ                                       
043700    MOVE "P188"       TO  WS-0101-PASO-MSG  W77-MY-PASO                       
043800    MOVE "25MTP006"   TO  WS-0101-MTP-MSG   W77-S000-MY-VERSION               
043900    MOVE "S500P188"   TO  W77-S000-MY-ID.                                     
044000    SET MYSELF (TASKVALUE)  TO ZERO.                                          
044100    MOVE " "               TO WS-0101-TEXT-MSG.                               
044200    PERFORM 10000100-VERSIONES.                                               
044300    PERFORM 10000000-TITLE-LIBRERIAS.                                         
044400    MOVE ATTRIBUTE TASKSTRING OF MYSELF TO WKS-WFL-PARAM.                     
044500    MOVE WKS-WFL-NODO TO WS-A04-CSI                                           
044600    MOVE WKS-WFL-FEC  TO WS-A04-FEC                                           
044700    MOVE WKS-WFL-REG  TO WS-A04-SEC                                           
044800    MOVE 0            TO WKS-FIN                                              
044900    MOVE "E"          TO W77-TIPO-DISP                                        
045000                                                                              
045050  IF WKS-WFL-SISCTE = 999999999999                                            
045070     MOVE "P187"      TO WS-A04-PASO WS-TIT-PASO                              
045100     CHANGE ATTRIBUTE TITLE OF  A04-PROCDET TO WS-TIT-A04                     
045200     IF ATTRIBUTE RESIDENT OF A04-PROCDET IS= VALUE TRUE                      
045300        PERFORM 50000000-OPEN-ARCHCTRL                                        
045400     ELSE                                                                     
045500        STRING "ERROR: NO EXISTE ARCHIVO DE CONTROL "                         
045600        "PARA  SIST/CTE: ", WKS-WFL-SISCTE,                                   
045700        " FECHA: ",         WKS-WFL-FEC ,                                     
045800        " NODO: ",  WKS-WFL-NODO , " SEC: ", WKS-WFL-REG                      
045900        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
046000        PERFORM 70000050-MENSAJE                                              
046100        MOVE 1 TO WKS-FIN                                                     
046200  ELSE                                                                        
046205     PERFORM 50000000-LEE-B07P                                                
046210     MOVE B07P-LISTADOS   TO A04-DET-INDI                                     
046220     MOVE "P188"          TO WS-A04-PASO WS-TIT-PASO.                         
046240                                                                              
046300  IF WKS-FIN = 0                                                              
046400     IF A04-DET-INDI = 1                                                      
046500        MOVE "(1=TODO)" TO WKS-TIT-LEY                                        
046600     ELSE                                                                     
046700     IF A04-DET-INDI = 2                                                      
046800        MOVE "(2=APLICADOS)" TO WKS-TIT-LEY                                   
046900     ELSE                                                                     
047000     IF A04-DET-INDI = 3                                                      
047100        MOVE "(3=RECHAZADO)" TO WKS-TIT-LEY                                   
047200     ELSE                                                                     
047300     IF A04-DET-INDI = 4                                                      
047400        MOVE "(4=TODO-LOCAL)" TO WKS-TIT-LEY                                  
047500     ELSE                                                                     
047600        STRING "ERROR: INDICADOR NO ESPECIFICA TIPO DE REPORTE ",             
047700        "DE DETALLE : ", A04-DET-INDI, "SE ASIGNA POR DEFAULT ",              
047800        "'TODO' AL REPORTE "                                                  
047900        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
048000        PERFORM 70000050-MENSAJE                                              
048100        MOVE "(1=TODO)" TO WKS-TIT-LEY                                        
048200        MOVE 1          TO A04-DET-INDI                                       
048300   ELSE                                                                       
048400     STOP RUN.                                                                
048405                                                                              
048410   PERFORM 10000050-HORA-INI.                                                 
048415                                                                              
048420*==================                                                           
048425 10000050-HORA-INI.                                                           
048430*==================                                                           
048435    ACCEPT WKS-TIME-MAQ FROM TIME                                             
048440    PERFORM 90000000-DAME-FEC-MAQUINA                                         
048445    IF WKS-TIME-MAQ > WKS-TIME-INI                                            
048450       MOVE 8              TO WS-S006-FUNCION                                 
048455       MOVE WKS-FEC-MAQ-08 TO WS-S006-FECHA1                                  
048460       MOVE 1              TO WS-S006-FECHA2                                  
048465       MOVE 12             TO WS-S006-FORMATO                                 
048470       PERFORM 20000006-LOCSUP                                                
048475       MOVE WS-S006-FECHA1 TO WKS-FEC-TERMINO                                 
048480    ELSE                                                                      
048485       MOVE WKS-FEC-MAQ-08 TO WKS-FEC-TERMINO.                                
048490                                                                              
048500                                                                              
048600                                                                              
048700*****************************************************************             
048800 10000000-TITLE-LIBRERIAS.                                                    
048900*************************** LIBRERIA DE VERSIONES ***************             
049000                                                                              
049100      PERFORM 20000100-CHECAME-VERSION.                                       
049200      IF S000-CTR-CVEERROR < 0                                                
049300         MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                      
049400         PERFORM 70000050-MENSAJE                                             
049500         CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                             
049600                                                                              
049700      PERFORM 10000006-LOCSUP.                                                
049800                                                                              
049900*=================                                                            
050000 50000000-PROCESO.                                                            
050100*=================                                                            
050200                                                                              
050300    PERFORM 50000000-CREA-REPDETALLE                                          
050400    PERFORM 50000000-UPDATE-ARCHCTRL.                                         
050500                                                                              
050600 50000000-OPEN-ARCHCTRL.                                                      
050700*=======================                                                      
050800                                                                              
050900    OPEN I-O A04-PROCDET                                                      
051000    MOVE 0                   TO SW-EOF-AD SW-GENERA-REP                       
051100                                SW-EOF-SAL                                    
051200    MOVE 1                   TO W77-KEY-DET                                   
051300                                                                              
051400    READ A04-PROCDET                                                          
051500         AT END                                                               
051600            MOVE 1     TO SW-EOF-AD.                                          
051700                                                                              
051800    CLOSE A04-PROCDET WITH SAVE.                                              
051900                                                                              
052000 50000000-CREA-REPDETALLE.                                                    
052100*=========================                                                    
052200                                                                              
052300   IF A04-DET-TIPO = 2                                                        
052400      MOVE "C"  TO WS-TIT-MNE-TIPO                                            
052500   ELSE                                                                       
052600      MOVE "S"  TO WS-TIT-MNE-TIPO.                                           
052700                                                                              
052710   IF WKS-WFL-SISCTE NOT = 999999999999                                       
052712      STRING "(S500)S500/FILE/INTS/50099E01/04/20131009/",                    
052714             "000000000500/0001 ON CAPTACION   ."                             
052716             DELIMITED BY SIZE INTO A04-DET-NOMARCH                           
052720      MOVE WKS-WFL-SISCTE      TO A04-DET-TITSCTE                             
052722      MOVE A04-DET-TITSIS      TO WS-TIT-SIST-ORIG                            
052723      MOVE 500                 TO A04-DET-TITUSER                             
052724      STRING "S", A04-DET-TITSIS DELIMITED BY SIZE                            
052726                           INTO A04-DET-TITSIST                               
052730      MOVE WKS-WFL-NODO        TO A04-DET-TITNODO                             
052735                                  A04-DET-CSI                                 
052740      MOVE WKS-WFL-FEC         TO A04-DET-TITFPRC A04-DET-FEC                 
052750      MOVE WKS-WFL-REG         TO A04-DET-TITSEC                              
052760      MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO A04-DET-MIX                       
052770      MOVE B07P-BUZON          TO A04-DET-TITBUZO.                            
052780                                                                              
052790                                                                              
052800*     IF WKS-WFL-SISCTE = 999999999999                                        
052810    PERFORM 00000000-CHANGE-SOPCOMS.                                          
052820    PERFORM 0000-CALL-HOSTNAME.                                               
052830    IF WS-DH-HOSTNAME-VDM                                                     
052840       MOVE 10 TO WS-TIT-CE-NODO                                              
052850    ELSE                                                                      
052860       MOVE 04 TO WS-TIT-CE-NODO.                                             
052870                                                                              
052900        MOVE A04-DET-TITNODO     TO WS-TIT-MNE-NODO                           
053100        MOVE A04-DET-TITFPRC     TO WS-TIT-CE-FEC                             
053200        MOVE ATTRIBUTE MIXNUMBER OF MYSELF                                    
053250                                 TO WS-TIT-CE-MIX                             
053300*       MOVE A04-DET-MIX         TO WS-TIT-CE-MIX                             
053400        MOVE A04-DET-TITSIS      TO WS-TIT-MNE-SISCTE                         
053500        MOVE A04-DET-TITSEQ      TO WS-TIT-SECUENC                            
053600        CHANGE ATTRIBUTE TITLE OF R04-DETALLE TO WS-TIT-REPORTES              
053602        MOVE WS-TIT-REPORTES      TO WS-NOMBRE-VALUE                          
053604*       SET MYSELF (TASKSTRING)   TO WS-NOMBRE-VALUE-OK                       
053700        OPEN OUTPUT R04-DETALLE                                               
053800        PERFORM 50000000-ARMA-NOMARCH                                         
053900        IF ATTRIBUTE RESIDENT  OF A01-SALIDA = VALUE FALSE                    
054000           GENERATE R04-DET-PROC-VACIO                                        
054100           TERMINATE REPORTE-DETA                                             
054200        ELSE                                                                  
054240           PERFORM 50000050-ORDEN-SAL                                         
054360           OPEN INPUT A01-SALORD                                              
054400           MOVE 0  TO SW-EOF-SAL                                              
054500*                      WKS-R1-TOTPROC     WKS-R1-TOTOK                        
054600*                      WKS-R1-TOTRECH     WKS-R1-TOTFORAN                     
054620                      WKS-SUCCAJ-TOTREG  WKS-SUCCAJ-TOTOK                     
054640                      WKS-SUCCAJ-TOTRECH WKS-SUCCAJ-TOTFORAN                  
054660                      WKS-SUCU-ANT   WKS-CAJA-ANT                             
054670           PERFORM 50000060-LEE-ARCH-SALORD                                   
054680           MOVE A01-O-DET-SUCORIG TO WKS-SUCU-ANT                             
054690           MOVE A01-O-DET-CAJORIG TO WKS-CAJA-ANT                             
054700           PERFORM 50000100-GENREP-DETALLE UNTIL SW-EOF-SAL = 1               
054800           PERFORM 50000000-RENOM-ARCH-SALIDA                                 
055100           CLOSE A01-SALORD WITH PURGE                                        
055200           IF WKS-NUM-DETALLES = 0                                            
055300              GENERATE R04-DET-PROC-VACIO                                     
055400              TERMINATE REPORTE-DETA                                          
055500           ELSE                                                               
055550              GENERATE R04-SUC-CAJ-TOTAL                                      
055600              GENERATE R04-DET-PROC-TOTAL                                     
055700              TERMINATE REPORTE-DETA.                                         
055800                                                                              
055900 50000000-RENOM-ARCH-SALIDA.                                                  
056000*===========================                                                  
056100  IF WKS-WFL-SISCTE = 999999999999                                            
056110     MOVE SPACES TO   WKS-NOM-ORIG                                            
056120                      WKS-NOM-DEST                                            
056125     MOVE WKS-SAL-SINUSER     TO  WKS-NOMGEN                                  
056130     MOVE WKS-NOMGEN-SINPACK  TO  WKS-NOM-ORIG                                
056132                                  WKS-NOM-DEST-RESTO                          
056134     MOVE "(S500)"            TO  WKS-NOM-DEST-USER                           
056136     MOVE "APLXDISP/"         TO  WKS-NOM-DEST-APL                            
056140                                                                              
056150     CALL SYSTEM WFL USING WKS-START-WFL.                                     
056160*    DISPLAY WKS-START-WFL.                                                   
056200*  IF WKS-WFL-SISCTE = 999999999999                                           
056201*     STRING "(S500)APLXDISP/", WKS-SAL-SINUSER                               
056202*     DELIMITED BY SIZE INTO WS-TIT-RENOMB                                    
056203*     CHANGE ATTRIBUTE TITLE OF A01-SALIDA TO WS-TIT-RENOMB.                  
056204                                                                              
056205 50000000-LEE-B07P.                                                           
056210*==================                                                           
056215                                                                              
056220   OPEN INQUIRY S500BD04TARJETAS.                                             
056225   MOVE WKS-WFL-SISCTE   TO WS-SIST-CTE                                       
056230   MOVE 1                TO WS-TIPO                                           
056235   MOVE WKS-WFL-REG      TO WS-SECUENCIAL                                     
056240   MOVE WKS-WFL-NODO     TO WS-NODO                                           
056245   PERFORM 90400007-B07PSXSISCTESEC-F                                         
056250   IF WS-STATUS-BASE > 0                                                      
056255      MOVE "50099E01"    TO B07P-BUZON.                                       
056256*** IBM-CHARITY-2002 INI                                                      
056257   PERFORM  202002-B08PSXFECSISCTE.                                           
056260                                                                              
056261   IF WS-STATUS-BASE = 0                                                      
056262      MOVE  B08P-CONT-REINTENTOS   TO  WKS-ARC-REINTENTOS                     
056263      MOVE  B08P-ESTATUS           TO  A04-ESTATUS.                           
056266*** IBM-CHARITY-2002 FIN                                                      
056268   CLOSE S500BD04TARJETAS.                                                    
056270   MOVE B07P-TIPO        TO A04-DET-INDI                                      
056275   MOVE B07P-BUZON       TO A04-DET-TITBUZO.                                  
056280                                                                              
056300 50000000-ARMA-NOMARCH.                                                       
056400*======================                                                       
056500                                                                              
056600    MOVE 1                 TO SW-GENERA-REP                                   
056700    MOVE A04-DET-DD        TO WKS-FECPROC-DD                                  
056800    MOVE A04-DET-MM        TO WKS-FECPROC-MM                                  
056900    MOVE A04-DET-AA        TO WKS-FECPROC-AA                                  
057000    MOVE A04-DET-CSI       TO WKS-CSI                                         
057002*** IBM-CHARITY-2002 INI                                                      
057004    MOVE A04-ESTATUS       TO WKS-ARC-ESTATUS.                                
057040    PERFORM  202002-VALIDA-LEYENDA                                            
057060    MOVE A04-REINTENTOS    TO  WKS-ARC-REINTENTOS                             
057080*** IBM-CHARITY-2002 FIN                                                      
057100    MOVE A04-DET-NOMARCH   TO WKS-ARCH-ENTRADA                                
057120    MOVE "CAPTACION   "    TO A04-DET-TITPACK                                 
057140    MOVE A04-DET-NOMARCH   TO WKS-ARCH-SALIDA                                 
057200    INSPECT WKS-ARCH-ENTRADA REPLACING ALL "INTS" BY "INTE"                   
057250    MOVE "(S500)"          TO WKS-SAL-USER                                    
057270    MOVE WKS-ARCH-SALIDA   TO WKS-ARCH-SALORD                                 
057290    INSPECT WKS-ARCH-SALORD REPLACING ALL "INTS" BY "ORDS"                    
057300    ACCEPT WKS-HORA-MAQUINA     FROM TIME                                     
057400    PERFORM 90000000-DAME-FEC-MAQUINA                                         
057450    MOVE WKS-FEC-MAQ-08    TO WKS-FECHA-M                                     
057500    MOVE WKS-MAQ-HH        TO WKS-TIME-HH                                     
057600    MOVE WKS-MAQ-MM        TO WKS-TIME-MIN                                    
057700    MOVE WKS-MAQ-SS        TO WKS-TIME                                        
057800    MOVE WKS-FEC-ANO       TO WKS-FECMAQ-AA                                   
057900    MOVE WKS-FEC-MES       TO WKS-FECMAQ-MM                                   
058000    MOVE WKS-FEC-DIA       TO WKS-FECMAQ-DD                                   
058200    CHANGE ATTRIBUTE TITLE OF A01-SALIDA TO WKS-ARCH-SALIDA                   
058240    CHANGE ATTRIBUTE TITLE OF A01-SALORD TO WKS-ARCH-SALORD                   
058400       INITIATE REPORTE-DETA                                                  
058450                                                                              
058500    MOVE A04-DET-TOTREG    TO WKS-R1-TOTREG                                   
058600    MOVE A04-DET-TOTPROC   TO WKS-R1-TOTPROC                                  
058700    MOVE A04-DET-TOTOK     TO WKS-R1-TOTOK                                    
058800    MOVE A04-DET-TOTRECH   TO WKS-R1-TOTRECH                                  
058900    MOVE A04-DET-TOTFORAN  TO WKS-R1-TOTFORAN.                                
058902    COMPUTE WKS-R1-TOTNOPROCE = WKS-R1-TOTREG - WKS-R1-TOTPROC.               
059000                                                                              
059005*=============                                                                
059010 60000000-FIN.                                                                
059015*=============                                                                
059020    MOVE SPACES  TO WS-TASKSTRING                                             
059025    MOVE "P187"  TO WS-TASKSTRING                                             
059030    SET MYSELF (TASKSTRING) TO WS-TASKSTRING.                                 
059035    WAIT (60).                                                                
059100                                                                              
059200                                                                              
059300 50000000-UPDATE-ARCHCTRL.                                                    
059400*=========================                                                    
059500                                                                              
059600    IF SW-GENERA-REP = 1                                                      
059700       CLOSE R04-DETALLE WITH SAVE                                            
059710       WAIT (60)                                                              
059720       CALL SYSTEM WFL USING WKS-WFL-SYSTEMF                                  
059800*                                                                             
059850       IF WKS-WFL-SISCTE = 999999999999                                       
059900          OPEN I-O A04-PROCDET                                                
060000          CLOSE A04-PROCDET  WITH PURGE.                                      
060100                                                                              
060102 50000050-ORDEN-SAL.                                                          
060104*=======================                                                      
060106     MOVE 0      TO W77-FRAMESIZE W77-LASTRECORD                              
060108                    W77-MAXRECSIZE W77-DISK-SIZE W77-MEMORY-SIZE              
060110                    W77-MEMORY-65K WS-CALC-WORD WS-CALC-WORD-RED.             
060112                                                                              
060114     OPEN INPUT A01-SALIDA.                                                   
060116                                                                              
060118     COMPUTE W77-FRAMESIZE =                                                  
060120          (ATTRIBUTE FRAMESIZE OF A01-SALIDA).                                
060122     COMPUTE W77-MAXRECSIZE =                                                 
060124          (ATTRIBUTE MAXRECSIZE OF A01-SALIDA) + 54.                          
060126     COMPUTE W77-LASTRECORD =                                                 
060128          (ATTRIBUTE LASTRECORD OF A01-SALIDA + 1).                           
060130                                                                              
060132     PERFORM                       70000000-CALCULA-ESPACIO.                  
060134                                                                              
060136     CLOSE A01-SALIDA WITH RELEASE.                                           
060138                                                                              
060140     SORT A01-SALSORT ON ASCENDING KEY A01-S-DET-TREG                         
060160                                       A01-S-DET-SUCORIG                      
060180                                       A01-S-DET-CAJORIG                      
060200     INPUT PROCEDURE 80009000-PRIMER-SORT                                     
060220     GIVING A01-SALORD SAVE                                                   
060240     MEMORY SIZE IS W77-MEMORY-SIZE WORDS                                     
060260     DISK   SIZE IS W77-DISK-SIZE   WORDS.                                    
060262                                                                              
060264 70000000-CALCULA-ESPACIO.                                                    
060266     IF W77-FRAMESIZE = 8                                                     
060268          COMPUTE WS-CALC-WORD = W77-MAXRECSIZE / 6                           
060270          IF WS-WORD-RES   >   ZEROS                                          
060272              COMPUTE W77-MAXRECSIZE = WS-WORD-ENT + 1                        
060274          ELSE                                                                
060276              COMPUTE W77-MAXRECSIZE = WS-WORD-ENT.                           
060278     COMPUTE W77-MEMORY-65K = 66000 * W77-MAXRECSIZE.                         
060280                                                                              
060282     COMPUTE W77-MEMORY-SIZE ROUNDED                                          
060284          = (W77-MAXRECSIZE + 3) * (W77-LASTRECORD / 16)                      
060286          + 1500.                                                             
060288                                                                              
060290     IF W77-MEMORY-SIZE > 258435000                                           
060292          MOVE 258435000   TO W77-MEMORY-SIZE                                 
060294     ELSE                                                                     
060296          IF W77-MEMORY-SIZE < 400000                                         
060298                MOVE W77-MEMORY-65K TO W77-MEMORY-SIZE.                       
060300                                                                              
060302     COMPUTE W77-DISK-SIZE ROUNDED                                            
060304           =  (W77-MAXRECSIZE + 3) * W77-LASTRECORD * 3.5 .                   
060305                                                                              
060325 50000100-GENREP-DETALLE.                                                     
060345*========================                                                     
060365                                                                              
060385*     ADD 1 TO WKS-R1-TOTPROC                                                 
060405     PERFORM 50000100-VAL-DETALLE.                                            
060425                                                                              
060445     IF A01-O-DET-SUCORIG NOT = WKS-SUCU-ANT OR                               
060465        A01-O-DET-CAJORIG NOT = WKS-CAJA-ANT                                  
060485        PERFORM 50000070-TOT-SUCCAJA.                                         
060505                                                                              
060525     PERFORM 50000105-GEN-DETALLE.                                            
060545     PERFORM 50000100-ADD-TOT-SUCCAJ.                                         
060565                                                                              
060585     PERFORM 50000060-LEE-ARCH-SALORD.                                        
060605                                                                              
060625*** IBM-CHARITY-2002 INI                                                      
060645*     IF  SW-EOF-SAL = 0 AND W77-CONTADOR-REG > 5000                          
060665*       PERFORM 90000000-DAME-FEC-MAQUINA                                     
060685*       MOVE WKS-FEC-MAQ-08    TO WKS-FECHA-M                                 
060705*       IF WKS-FECHA-M = WKS-FEC-TERMINO                                      
060725*          MOVE 0              TO  W77-CONTADOR-REG                           
060745*          ACCEPT WKS-TIME-MAQ FROM TIME                                      
060765*          IF WKS-TIME-MAQ > WKS-TIME-MAX                                     
060785*             STRING "HORARIO MAX DEL P187 SUPERADO ",                        
060805*                    "SE SUSPENDE PROCESO DEL LISTADO CON ",                  
060825*                    "EL PARAMETRO: ", WKS-WFL-PARAM                          
060845*             DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                        
060865*             PERFORM 70000050-MENSAJE                                        
060885*             GENERATE R04-DET-PROC-INTERRUP                                  
060905*             TERMINATE REPORTE-DETA                                          
060925*             CLOSE R04-DETALLE WITH SAVE                                     
060945*             CLOSE A01-SALIDA WITH REMOVE                                    
060965*             WAIT(1)                                                         
060985*             STOP RUN.                                                       
061005*** IBM-CHARITY-2002 FIN                                                      
061025                                                                              
06104550000105-GEN-DETALLE.                                                         
061065*========================                                                     
061085     ADD 1 TO WKS-NUM-DETALLES.                                               
061105     GENERATE R04-DET-PROC.                                                   
061125                                                                              
061145 50000060-LEE-ARCH-SALORD.                                                    
061165*========================                                                     
061185     READ A01-SALORD AT END                                                   
061205                        MOVE 1 TO SW-EOF-SAL.                                 
061225                                                                              
061245 50000070-TOT-SUCCAJA.                                                        
061265*=====================                                                        
061285                                                                              
061305     GENERATE R04-SUC-CAJ-TOTAL.                                              
061325                                                                              
061345     ADD 41 TO LINE-COUNTER OF REPORTE-DETA.                                  
061365                                                                              
061385     MOVE 0                 TO WKS-SUCCAJ-TOTREG                              
061405                               WKS-SUCCAJ-TOTOK                               
061425                               WKS-SUCCAJ-TOTRECH                             
061445                               WKS-SUCCAJ-TOTFORAN.                           
061465                                                                              
061885     MOVE A01-O-DET-SUCORIG TO WKS-SUCU-ANT.                                  
061890     MOVE A01-O-DET-CAJORIG TO WKS-CAJA-ANT.                                  
061895                                                                              
061900 50000100-VAL-DETALLE.                                                        
062000*=====================                                                        
062050  IF A01-O-DET-TMDO = 0 OR A01-O-DET-TMDO = 1                                 
062060  OR A01-O-DET-TMDO = 2                                                       
062070     ADD 1 TO A01-O-DET-TMDO.                                                 
062100  IF A01-O-DET-TMDO < 1 OR A01-O-DET-TMDO > 3                                 
062200     MOVE 4 TO A01-O-DET-TMDO.                                                
062300                                                                              
062400   IF A01-O-DET-TMOV < 1 OR > 3                                               
062500      MOVE 4 TO A01-O-DET-TMOV.                                               
062600                                                                              
062610   IF A01-O-DET-STATUS < 1 OR > 3                                             
062640      MOVE 4 TO A01-O-DET-STATUS.                                             
062650                                                                              
062700*   IF A01-O-DET-STATUS= 1                                                    
062850*      ADD 1 TO WKS-R1-TOTOK                                                  
062900*   ELSE                                                                      
063000*   IF A01-O-DET-STATUS = 2                                                   
063150*      ADD 1 TO WKS-R1-TOTRECH                                                
063200*   ELSE                                                                      
063300*   IF A01-O-DET-STATUS = 3                                                   
063450*      ADD 1 TO WKS-R1-TOTFORAN                                               
063500*   ELSE                                                                      
063600*      MOVE 4 TO A01-O-DET-STATUS.                                            
063610                                                                              
063620 50000100-ADD-TOT-SUCCAJ.                                                     
063630*=====================                                                        
063640   ADD 1 TO WKS-SUCCAJ-TOTREG.                                                
063650                                                                              
063660   IF A01-O-DET-STATUS = 1                                                    
063670      ADD 1 TO WKS-SUCCAJ-TOTOK                                               
063680   ELSE                                                                       
063690   IF A01-O-DET-STATUS = 2                                                    
063700      ADD 1 TO WKS-SUCCAJ-TOTRECH                                             
063710   ELSE                                                                       
063720   IF A01-O-DET-STATUS = 3                                                    
063730      ADD 1 TO WKS-SUCCAJ-TOTFORAN.                                           
063800                                                                              
063900 COPY "S500/INC/PRO/25MTP002".                                                
064000                                                                              
064100*** IBM-CHARITY-2002 INI                                                      
064200 202002-VALIDA-LEYENDA.                                                       
064300*==============================                                               
064400   IF WKS-ARC-ESTATUS = "T"                                                   
064500      PERFORM  202002-VALIDA-SUBLEYENDA                                       
064600      EXIT PERFORM.                                                           
064700                                                                              
064800   SET INDICE          TO 1                                                   
064900   SEARCH                  WKS-TAB-LEYOCC                                     
065000    AT END                                                                    
065100       STRING "ESTATUS INVALIDO : ", WKS-ARC-ESTATUS                          
065200       DELIMITED BY SIZE INTO WKS-ARC-LEYENDA                                 
065300    WHEN                                                                      
065400       WKS-ID-LEY(INDICE) = WKS-ARC-ESTATUS                                   
065500       MOVE WKS-LEYENDA(INDICE)  TO WKS-ARC-LEYENDA.                          
065600                                                                              
065700                                                                              
065800                                                                              
065900 202002-VALIDA-SUBLEYENDA.                                                    
066000*==============================                                               
066100   SET INDICE-SUB      TO 1                                                   
066200   SEARCH          WKS-TAB-LEYOCC-SUB                                         
066300      AT END                                                                  
066400        MOVE "TERMINADO PARCIAL S/SUB-ESTATUS" TO WKS-ARC-LEYENDA             
066500      WHEN                                                                    
066600        WKS-ID-LEY-SUB(INDICE-SUB) = A04-SUBESTATUS                           
066700        STRING "TERMINADO PARCIAL", WKS-LEYENDA-SUB(INDICE-SUB)               
066800        DELIMITED BY SIZE INTO WKS-ARC-LEYENDA.                               
066900                                                                              
067000                                                                              
067100 202002-B08PSXFECSISCTE.                                                      
067200*==============================                                               
067300   MOVE WS-STATUS-BASE TO WS-STATUS-BASE-ANT.                                 
067400   MOVE 0              TO WS-STATUS-BASE.                                     
067500   FIND FIRST  B08PSXFECSISCTESQ           AT                                 
067600        B08P-FEC-PROC    =  WKS-WFL-FEC     AND                               
067700        B08P-SIST-CTE    =  WS-SIST-CTE     AND                               
067800        B08P-TIPO        =  WS-TIPO         AND                               
067900        B08P-SECUENCIAL  =  WS-SECUENCIAL   AND                               
068000        B08P-NODO        =  WS-NODO                                           
068100        ON EXCEPTION                                                          
068200           MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                       
068300                                                                              
068400                                                                              
068500*** IBM-CHARITY-2002 FIN                                                      
069500                                                                              
070500**********************************************************                    
071500 80009000-PRIMER-SORT           SECTION.                                      
072500 80009000-OPEN-FILE.                                                          
073500     MOVE ZERO TO SW-EOF-SAL                                                  
074500                  WKS-R1-TOTPROC WKS-R1-TOTOK                                 
075500                  WKS-R1-TOTRECH WKS-R1-TOTFORAN.                             
076500     OPEN INPUT A01-SALIDA.                                                   
077500     PERFORM 80009200-LEE-SALIDA.                                             
078500     PERFORM 80009200-PROC-SALIDA UNTIL SW-EOF-SAL = 1.                       
079500     MOVE ZERO TO SW-EOF-SAL.                                                 
080500     CLOSE A01-SALIDA WITH RELEASE.                                           
081500     GO TO 80009900-FIN-SORT.                                                 
082500                                                                              
083500***********************************************************                   
084500 80009200-LEE-SALIDA.                                                         
085500     READ A01-SALIDA INTO REG-A01-S-SAL AT END                                
086500          MOVE 1 TO SW-EOF-SAL.                                               
087500                                                                              
088500 80009200-PROC-SALIDA.                                                        
089500                                                                              
090500     IF A01-S-DET-TREG = 2                                                    
091500        PERFORM 80009200-SUMA-TOTALES                                         
092500        IF A04-DET-INDI = 1 OR                                                
093500          (A04-DET-INDI = 2 AND  A01-S-DET-STATUS = 1) OR                     
094500          (A04-DET-INDI = 3 AND  A01-S-DET-STATUS = 2) OR                     
095500          (A04-DET-INDI = 4 AND (A01-S-DET-STATUS = 1  OR                     
096500                                 A01-S-DET-STATUS = 2 ))                      
097500        RELEASE REG-A01-S-SAL.                                                
098500                                                                              
099500     PERFORM 80009200-LEE-SALIDA.                                             
100500                                                                              
101500 80009200-SUMA-TOTALES.                                                       
102500                                                                              
103500     ADD 1 TO WKS-R1-TOTPROC.                                                 
104500                                                                              
105500     IF A01-S-DET-STATUS = 1                                                  
106500        ADD 1 TO WKS-R1-TOTOK                                                 
107500     ELSE IF A01-S-DET-STATUS = 2                                             
108500        ADD 1 TO WKS-R1-TOTRECH                                               
109500     ELSE IF A01-S-DET-STATUS = 3                                             
110500        ADD 1 TO WKS-R1-TOTFORAN.                                             
111500                                                                              
112500****************************************************                          
113500 80009900-FIN-SORT.                                                           
114500     EXIT.                                                                    
