100100$ SET   LIST$                                                                 
100200$ SET ERRORLIST                                                               
100300*$ SET LIST STACK XREF LINEINFO FREE                                          
100310$ SET LIST STACK LINEINFO FREE                                                
100400$ SET BDB02R01   S000LIBLJ                                                    
100410$ SET BDB03R09   BDB03R12                                                     
100420$ SET BDB06R08                                                                
100425$ SET BDB12R02                                                                
100430$ SET BDB20R09                                                                
100440$ SET BDB91                                                                   
100500$ SET S006LOCSUP S100VERSIONES S080L700  S080CATALOGOS                        
100510$ SET FECHA2000  S080IVA       S080L100  S080DATOS                            
100530$ SET LIBMAPLI                                                                
100550$ SET MAPLIACTLIB012 MAPLIACTLIB013 MAPLIACTLIB015                            
100570$ SET MAPLIACTLIB033 MAPLIACTLIB034 MAPLIACTLIB041                            
100600$ ERRORLIMIT = 500                                                            
100700$ RESET LIST$                                                                 
100800***************************************************************               
100900* P320 P320 P320 P320 P320 P320 P320 P320 P320 P320 P320 P320 *               
101000***************************************************************               
101100 IDENTIFICATION DIVISION.                                                     
101200 PROGRAM-ID.  P320.                                                           
101300 AUTHOR.      JOSE LUIS IBARRA LARA.                                          
101400 DATE-WRITTEN. FEBRERO/1997.                                                  
101500 INSTALLATION.                                                                
101600 SECURITY.                                                                    
101700**************************************************************                
101800* GENERA REPORTE DE CLIENTES CON MAS DE 2 DEVOLUCIONES                        
101900* EN EL BIMESTRE, POR SUC Y POR NODO DE IMPRESION                             
102000*                                                                             
102100**************************************************************                
102200 ENVIRONMENT DIVISION.                                                        
102300 CONFIGURATION SECTION.                                                       
102400 SOURCE-COMPUTER.   SERIES-A.                                                 
102500 OBJECT-COMPUTER.   SERIES-A.                                                 
102600 INPUT-OUTPUT  SECTION.                                                       
102700 FILE-CONTROL.                                                                
102800     SELECT  I01-DEVMENSUAL    ASSIGN  TO DISK.                               
102900     SELECT  S02-SORTDEVMES    ASSIGN  TO SORT DISK.                          
103000     SELECT  R01-DEVOLBIM      ASSIGN  TO PRINTER.                            
103050     SELECT  R02-COMIPEND      ASSIGN  TO PRINTER.                            
103100                                                                              
103200 DATA DIVISION.                                                               
103300 FILE SECTION.                                                                
103400***************************************************************               
103500 FD  I01-DEVMENSUAL                                                           
103600     BLOCK   CONTAINS   100 RECORDS                                           
103700     RECORD  CONTAINS    90 CHARACTERS                                        
103800     VALUE OF                                                                 
103900             AREAS       IS 1000                                              
104000             AREASIZE    IS 1200                                              
104100             TITLE       IS "S500/FILE/DEVOLBIM".                             
104200                                                                              
104300 01  I01-R00-DEVMENSUAL  PIC X(90).                                           
104400***************************************************************               
104500 SD  S02-SORTDEVMES.                                                          
104600                                                                              
104700 01  WKS-S02-R01-DETALLE.                                                     
104800     02 WKS-S02-R01-NODO              PIC 9(02)       COMP.                   
104900     02 WKS-S02-R01-SUC-PROM          PIC 9(04)       COMP.                   
105000     02 WKS-S02-R01-CONTRATO          PIC 9(12)       COMP.                   
105010     02 WKS-S02-R01-MEDIOACC          PIC 9(12)       COMP.                   
105100     02 WKS-S02-R01-DEVMES-ACT        PIC 9(04)       COMP.                   
105200     02 WKS-S02-R01-DEVMES-ANT        PIC 9(04)       COMP.                   
105300     02 WKS-S02-R01-DEVMES-TOT        PIC 9(04)       COMP.                   
105400     02 WKS-S02-R01-PROM-MES          PIC 9(12)V99    COMP.                   
105500     02 WKS-S02-R01-PROM-ANH          PIC 9(12)V99    COMP.                   
105600     02 WKS-S02-R01-PRDINSTMON        PIC 9(12)       COMP.                   
105700     02 RD-WKS-S02-R01-PRDINSTMON                                             
105800        REDEFINES  WKS-S02-R01-PRDINSTMON.                                    
105900        04 WKS-S02-R01-PRODUCTO       PIC 9(04)       COMP.                   
106000        04 WKS-S02-R01-INSTRUMENTO    PIC 9(04)       COMP.                   
106100        04 WKS-S02-R01-MONEDA         PIC 9(04)       COMP.                   
106200     02 WKS-S02-R01-INDPRD            PIC 9(02)       COMP.                   
106300     02 WKS-S02-R01-NOMBRE            PIC X(36).                              
106400     02 FILLER                        PIC X(12).                              
106500                                                                              
106600**********************************************************                    
106700 FD  R01-DEVOLBIM.                                                            
106800 01  R01-L00-DEVOLBIM           PIC X(132).                                   
106900                                                                              
106910**********************************************************                    
106920 FD  R02-COMIPEND.                                                            
106930 01  R02-L00-COMIPEND           PIC X(132).                                   
106960                                                                              
107000**********************************************************                    
107100 DATA-BASE SECTION.                                                           
107200 DB  S500BD01CAPTACION.                                                       
107300 01  S500B02CONTROL.                                                          
107400 01  S500B03CONTRATOS.                                                        
107500 01  S500B06HISTORICO.                                                        
107505 01  S500B12COMPEN.                                                           
107510 01  S500B20DEVMENSUAL.                                                       
107600 01  S500B91REINICIO.                                                         
107700                                                                              
107800********************************************************                      
107900 WORKING-STORAGE SECTION.                                                     
107910*********  PARA USO DE LIBRERIA MAPLI **********                              
107920 77 W77-ID-ACT01-MAPLI       PIC 9(02).                                       
107930 77 W77-ID-ACT02-MAPLI       PIC 9(02).                                       
107940 77 W77-ID-ACT03-MAPLI       PIC 9(02).                                       
107950 77 W77-ID-ACT04-MAPLI       PIC 9(02).                                       
107960                                                                              
107970                                                                              
107980                                                                              
107990*************************************************                             
108000 77  W77-MY-CSI              PIC 9(02)    COMP.                               
108100 77  W77-MY-MIX              PIC 9(06)    COMP.                               
108200 77  W77-VEO-BASE            PIC 9(02)    COMP   VALUE 0.                     
108300 77  W77-EOF-ARCHS           PIC 9(02)    COMP   VALUE 0.                     
108310 77  W77-STATUS-PASO         PIC 9(02)    COMP   VALUE 0.                     
108400 77  W77-EOF-BASE            PIC 9(02)    COMP   VALUE 0.                     
108410 77  W77-EOF-B12             PIC 9(02)    COMP   VALUE 0.                     
108500 77  W77-LIN-R01             PIC 9(02)    COMP   VALUE 70.                    
108510 77  W77-LIN-R02             PIC 9(02)    COMP   VALUE 70.                    
108600 77  W77-PAG-R01             PIC 9(04)    COMP   VALUE 0.                     
108610 77  W77-PAG-R02             PIC 9(04)    COMP   VALUE 0.                     
108700 77  W77-TOT-REGDEV          PIC 9(06)           VALUE 0.                     
108710 77  W77-TOT-ESCRITOS        PIC 9(06)           VALUE 0.                     
108800 77  W77-NUM-LEIDOS          PIC 9(06)           VALUE 0.                     
108900 77  W77-TOT-DSKSIZE         PIC 9(08)    COMP.                               
109000 77  W77-TOT-MEMSIZE         PIC 9(08)    COMP.                               
109100 77  W77-SUC-ANT             PIC 9(04)           VALUE 0.                     
109200 77  W77-NODO-ANT            PIC 9(02)           VALUE 0.                     
109300 77  W77-IND-SUC             PIC 9(04)    COMP.                               
109400 88  W88-IND-SUCOK           VALUE 1 THRU 1899.                               
109500 77  W77-IND-NODO            PIC 9(04)    COMP.                               
109600 77  W77-IND-REP             PIC 9(04)    COMP.                               
109700 77  W77-IND-MES             PIC 9(04)    COMP.                               
109800 77  W77-CORTE-NODO          PIC 9(02)    COMP   VALUE 0.                     
109900 77  W77-SW-NOHAY            PIC 9(02)    COMP   VALUE 0.                     
110200 77  W77-CONTADOR            PIC 9(04)    COMP   VALUE 0.                     
110300 77  W77-IND-A               PIC 9(04)    COMP   VALUE 0.                     
110400 77  W77-IND-B               PIC 9(04)    COMP   VALUE 0.                     
110405                                                                              
110410 77  W77-IND-C               PIC 9(04)    COMP   VALUE 0.                     
110415 88  W88-IND-COM-ID          VALUE 02, 05, 16, 22, 50.                        
110420 88  W88-IND-CHQDEV          VALUE 16, 22.                                    
110425                                                                              
110430 77  W77-TOTCOM-CTO          PIC 9(08)V99 COMP   VALUE 0.                     
110435 77  W77-OTRCOM-CTO          PIC 9(07)V99 COMP   VALUE 0.                     
110440 77  W77-CHQDEV-CTO          PIC 9(07)V99 COMP   VALUE 0.                     
110445                                                                              
110450                                                                              
110500                                                                              
110600****************************************************************              
110700 01  WKS-TAB-MESES.                                                           
110800     02 FILLER         PIC X(10) VALUE "ENERO     ".                          
110900     02 FILLER         PIC X(10) VALUE "FEBRERO   ".                          
111000     02 FILLER         PIC X(10) VALUE "MARZO     ".                          
111100     02 FILLER         PIC X(10) VALUE "ABRIL     ".                          
111200     02 FILLER         PIC X(10) VALUE "MAYO      ".                          
111300     02 FILLER         PIC X(10) VALUE "JUNIO     ".                          
111400     02 FILLER         PIC X(10) VALUE "JULIO     ".                          
111500     02 FILLER         PIC X(10) VALUE "AGOSTO    ".                          
111600     02 FILLER         PIC X(10) VALUE "SEPTIEMBRE".                          
111700     02 FILLER         PIC X(10) VALUE "OCTUBRE   ".                          
111800     02 FILLER         PIC X(10) VALUE "NOVIEMBRE ".                          
111900     02 FILLER         PIC X(10) VALUE "DICIEMBRE ".                          
112000 01  WKS-RD-TAB-MESES  REDEFINES WKS-TAB-MESES.                               
112100     02 WKS-TB-NOM-MES OCCURS 12 TIMES.                                       
112120        04 WKS-TB-MES-X3  PIC X(03).                                          
112140        04 FILLER         PIC X(07).                                          
112200                                                                              
112205************************************************************                  
112210 01  WKS-FECPROC-EDIT.                                                        
112215     02 WKS-DD-FPRC-EDIT    PIC 99.                                           
112220     02 FILLER              PIC X       VALUE "/".                            
112225     02 WKS-MM-FPRC-EDIT    PIC X(03).                                        
112230     02 FILLER              PIC X       VALUE "/".                            
112235     02 WKS-AAAA-FPRC-EDIT  PIC 9(04).                                        
112240                                                                              
112245 01  WKS-FECMAQ-EDIT.                                                         
112250     02 WKS-DD-FMAQ-EDIT    PIC 99.                                           
112255     02 FILLER              PIC X       VALUE "/".                            
112260     02 WKS-MM-FMAQ-EDIT    PIC X(03).                                        
112265     02 FILLER              PIC X       VALUE "/".                            
112270     02 WKS-AAAA-FMAQ-EDIT  PIC 9(04).                                        
112275                                                                              
112280****************************************************************              
112300 01  WKS-MES-JUST-R.                                                          
112400     02 WKS-DIG-MES    PIC X     OCCURS 10 TIMES.                             
112500                                                                              
112600 01  WKS-NOMB-MES.                                                            
112700     02 WKS-OCC-MES    PIC X     OCCURS 10 TIMES.                             
112710                                                                              
112800******************************************************                        
112900 01  WKS-TABLA-PRODUCTOS.                                                     
113000     02 FILLER   PIC X(20) VALUE "CHEQUES MN.         ".                      
113100     02 FILLER   PIC X(20) VALUE "CHEQUES DLS FRONT   ".                      
113200     02 FILLER   PIC X(20) VALUE "CTA.PROD MN.        ".                      
113300     02 FILLER   PIC X(20) VALUE "CHEQUES DLS SIN/REND".                      
113400     02 FILLER   PIC X(20) VALUE "CHEQUES DLS CON/REND".                      
113500     02 FILLER   PIC X(20) VALUE "MAESTRA BANAMEX MN. ".                      
113600     02 FILLER   PIC X(20) VALUE "MAESTRA OPCION MN.  ".                      
113900     02 FILLER   PIC X(20) VALUE "MAESTRA DLS         ".                      
113905     02 FILLER   PIC X(20) VALUE "SMARTACCOUNT (1-11) ".                      
113910     02 FILLER   PIC X(20) VALUE "SMARTACCOUNT (1-12) ".                      
113915     02 FILLER   PIC X(20) VALUE "SMARTACCOUNT (1-13) ".                      
113920     02 FILLER   PIC X(20) VALUE "SMARTACCOUNT (1-14) ".                      
113925     02 FILLER   PIC X(20) VALUE "SMARTACCOUNT (1-15) ".                      
113930     02 FILLER   PIC X(20) VALUE "TRADICIONAL MORALES ".                      
113935     02 FILLER   PIC X(20) VALUE "CITICUENTA MORAL    ".                      
113940     02 FILLER   PIC X(20) VALUE "DOLARES             ".                      
113945     02 FILLER   PIC X(20) VALUE "CITINVEST           ".                      
113950     02 FILLER   PIC X(20) VALUE "CITIONE PREMIUM     ".                      
113955     02 FILLER   PIC X(20) VALUE "CITIONE TRADICIONAL ".                      
113960     02 FILLER   PIC X(20) VALUE "CITIONE CLASSIC     ".                      
113965     02 FILLER   PIC X(20) VALUE "GLOBAL SECURITY SERV".                      
113970     02 FILLER   PIC X(20) VALUE "ACCESO 2003         ".                      
113999     02 FILLER   PIC X(20) VALUE "*****               ".                      
114000 01  RD-WKS-TABLA-PROD  REDEFINES WKS-TABLA-PRODUCTOS.                        
114100     02 WKS-TB-PROD   PIC X(20)  OCCURS 23 TIMES.                             
114200                                                                              
114300************************************************************                  
114400 01  WKS-VARIABLES-GLOBAL.                                                    
114500     02 WKS-NOMB-SUC           PIC X(40) VALUE " ".                           
114600     02 WKS-MES-ACT            PIC 99.                                        
114700     02 WKS-MES-ANT            PIC 99.                                        
114800     02 WKS-ACUM-PROM          PIC 9(12)V99.                                  
114900     02 WKS-NUM-MES            PIC 9(02).                                     
115000                                                                              
115100     02 WKS-TOTALES-SUC.                                                      
115200        04 WKS-TOTS-NUM-DEV    PIC 9(08)       COMP.                          
115300        04 WKS-TOTS-NUM-CTOS   PIC 9(06)       COMP.                          
115400                                                                              
115500     02 WKS-TOTALES-CCI.                                                      
115600        04 WKS-TOTC-NUM-DEV    PIC 9(08)       COMP.                          
115700        04 WKS-TOTC-NUM-CTOS   PIC 9(06)       COMP.                          
115800                                                                              
115900     02 WKS-TASK-VALUE         PIC 9(10).                                     
116000     02 WKS-RD-TASK-VALUE      REDEFINES  WKS-TASK-VALUE.                     
116100        04 WKS-TASK-FECHA      PIC 9(08).                                     
116200        04 WKS-TASK-CSI        PIC 9(02).                                     
116300                                                                              
116310     02 WKS-FEC-LINEA-08       PIC 9(08).                                     
116320     02 RD1-WKS-FEC-LINEA-08   REDEFINES WKS-FEC-LINEA-08.                    
116330        04 WKS-AAAA-LINEA      PIC 9(04).                                     
116340        04 FILLER              PIC 9(04).                                     
116350     02 RD2-WKS-FEC-LINEA-08   REDEFINES WKS-FEC-LINEA-08.                    
116360        04 WKS-AA1-LINEA       PIC 9(02).                                     
116400        04 WKS-FEC-LINEA       PIC 9(6).                                      
116500        04 WKS-RD-FECHA-LINEA  REDEFINES WKS-FEC-LINEA.                       
116600           06 WKS-AA-LINEA     PIC 99.                                        
116700           06 WKS-MM-LINEA     PIC 99.                                        
116800           06 WKS-DD-LINEA     PIC 99.                                        
116900                                                                              
116910     02 WKS-FEC-BATCH-08       PIC 9(08).                                     
116920     02 RD1-WKS-FEC-BATCH-08   REDEFINES WKS-FEC-BATCH-08.                    
116930        04 WKS-AAAA-BATCH      PIC 9(04).                                     
116940        04 FILLER              PIC 9(04).                                     
116950     02 RD2-WKS-FEC-BATCH-08   REDEFINES WKS-FEC-BATCH-08.                    
116960        04 WKS-AA1-BATCH       PIC 9(02).                                     
117000        04 WKS-FEC-BATCH       PIC 9(6).                                      
117100        04 WKS-RD-FEC-BATCH    REDEFINES WKS-FEC-BATCH.                       
117200           06 WKS-AA-BATCH     PIC 99.                                        
117300           06 WKS-MM-BATCH     PIC 99.                                        
117400           06 WKS-DD-BATCH     PIC 99.                                        
117410                                                                              
117420     02 WKS-FBAS-DMA            PIC 9(08).                                    
117430     02 RD1-WKS-FBAS-DMA        REDEFINES WKS-FBAS-DMA.                       
117440        04 WKS-DD-FBAS-DMA      PIC 99.                                       
117450        04 WKS-MM-FBAS-DMA      PIC 99.                                       
117460        04 WKS-AAAA-FBAS-DMA    PIC 9(04).                                    
117470        04 RD2-WKS-AAAA-FBAS-DMA REDEFINES WKS-AAAA-FBAS-DMA.                 
117480           06 WKS-SS-FBAS-DMA   PIC 99.                                       
117490           06 WKS-AA-FBAS-DMA   PIC 99.                                       
117500                                                                              
118200     02 WKS-TIME-MAQ           PIC 9(08).                                     
118300     02 WKS-RD-TIME-MAQ        REDEFINES WKS-TIME-MAQ.                        
118400        04 WKS-HMS-MAQ         PIC 9(06).                                     
118500        04 WKS-DSS-MAQ         PIC 9(02).                                     
118510     02 RD-WKS-HRA-MAQ           REDEFINES WKS-TIME-MAQ.                      
118520        04 WKS-HRMAQ-HH          PIC 9(02).                                   
118530        04 WKS-HRMAQ-MM          PIC 9(02).                                   
118540        04 WKS-HRMAQ-SS          PIC 9(02).                                   
118550        04 WKS-HRMAQ-DD          PIC 9(02).                                   
118600                                                                              
118700                                                                              
119100                                                                              
119200****************************************************************              
119300 01  WKS-TB-REPNODOS.                                                         
119400     02 WKS-GEN-REP1           PIC 99  COMP  OCCURS 5 TIMES.                  
119500                                                                              
119600 01  WKS-TB-NODOS-R.                                                          
119700     02 WKS-NODOS-VDM         PIC X(10) VALUE "1009000000".                   
119800     02 RD-WKS-NODOS-VDM      REDEFINES WKS-NODOS-VDM.                        
119900        04 WKS-QNODO-VDM      PIC 99    OCCURS 5 TIMES.                       
120000                                                                              
120100     02 WKS-NODOS-MTY         PIC X(10) VALUE "0407066101".                   
120200     02 RD-WKS-NODOS-MTY      REDEFINES WKS-NODOS-MTY.                        
120300        04 WKS-QNODO-MTY      PIC 99    OCCURS 5 TIMES.                       
120400                                                                              
120500*************************************************************                 
120600****** CAMPOS DEL ARCHIVO I01-DEVMENSUAL      ****************                
120700                                                                              
120800 01  WKS-I01-R01-DETALLE.                                                     
120900     02 WKS-I01-R01-NODO              PIC 9(02)       COMP.                   
121000     02 WKS-I01-R01-SUC-PROM          PIC 9(04)       COMP.                   
121100     02 WKS-I01-R01-CONTRATO          PIC 9(12)       COMP.                   
121109                                                                              
121110     02 WKS-I01-R01-MEDIOACC          PIC 9(12)       COMP.                   
121112     02 RD-WKS-I01-R01-MEDIOACC REDEFINES WKS-I01-R01-MEDIOACC.               
121114        04 WKS-I01-R01-MDASUC         PIC 9(04)       COMP.                   
121116        04 FILLER                     PIC 9(01)       COMP.                   
121118        04 WKS-I01-R01-MDACTA         PIC 9(07)       COMP.                   
121119                                                                              
121200     02 WKS-I01-R01-DEVMES-ACT        PIC 9(04)       COMP.                   
121300     02 WKS-I01-R01-DEVMES-ANT        PIC 9(04)       COMP.                   
121400     02 WKS-I01-R01-DEVMES-TOT        PIC 9(04)       COMP.                   
121500     02 WKS-I01-R01-PROM-MES          PIC 9(12)V99    COMP.                   
121600     02 WKS-I01-R01-PROM-ANH          PIC 9(12)V99    COMP.                   
121700     02 WKS-I01-R01-PRODUCTO          PIC 9(04)       COMP.                   
121800     02 WKS-I01-R01-INSTRUMENTO       PIC 9(04)       COMP.                   
121900     02 WKS-I01-R01-MONEDA            PIC 9(04)       COMP.                   
122000     02 WKS-I01-R01-INDPRD            PIC 9(02)       COMP.                   
122100     02 WKS-I01-R01-NOMBRE            PIC X(36).                              
122200     02 FILLER                        PIC X(12).                              
122300                                                                              
122400****************************************************************              
122500**********LINEAS DE IMPRESION     ***************************                 
122600 01  WLI-R00-L01-ENCA.                                                        
122700     02 FILLER                    PIC X(19) VALUE                             
122800                                  "S500/P320/25MTP003/".                      
122900     02 WLI-R00-L01-NAME          PIC X(35) VALUE                             
123000                                  "001DEVOLBIM".                              
123100     02 FILLER                    PIC X(51) VALUE                             
123200                                  "DEPOSITOS A LA VISTA".                     
123300     02 FILLER                    PIC X(14) VALUE                             
123400                                  "FECHA MOVTOS: ".                           
123500     02 WLI-R00-L01-FPROC         PIC X(13).                                  
123700                                                                              
123800 01  WLI-R00-L02-ENCA.                                                        
123900     02 FILLER                   PIC X(15) VALUE                              
124000                                 "FECHA PROCESO: ".                           
124100     02 WLI-R00-L02-FMAQ         PIC X(11).                                   
124200     02 FILLER                   PIC X(16) VALUE " ".                         
124300     02 WLI-R00-L02-TITULO       PIC X(63) VALUE " ".                         
124400     02 FILLER                   PIC X(14) VALUE                              
124500                                 "TIPO PROCESO: ".                            
124600     02 WLI-R00-L02-TPROC        PIC X(13) VALUE                              
124700                                 "MENSUAL".                                   
124800                                                                              
124900 01  WLI-R00-L03-ENCA.                                                        
125000     02 FILLER                   PIC X(15) VALUE                              
125100                                 "HORA  PROCESO: ".                           
125200     02 WLI-R00-L03-HR-HH   PIC 99.                                           
125220     02 FILLER              PIC X(01)   VALUE ":".                            
125240     02 WLI-R00-L03-HR-MM   PIC 99.                                           
125260     02 FILLER              PIC X(01)   VALUE ":".                            
125280     02 WLI-R00-L03-HR-SS   PIC 99.                                           
125300     02 FILLER                   PIC X(19) VALUE " ".                         
125400     02 WLI-R00-L03-SBTIT        PIC X(63).                                   
125500     02 FILLER                   PIC X(14) VALUE                              
125600                                 "HOJA NUM    : ".                            
125700     02 WLI-R00-L03-NPAG         PIC ZZZZZ.                                   
125800     02 FILLER                   PIC X(08) VALUE " ".                         
125900                                                                              
126000 01  WLI-R00-L04-ENCA.                                                        
126100     02 WLI-R00-L04-SUC     PIC 9(04)  VALUE 1580.                            
126200     02 FILLER              PIC X(128) VALUE " ".                             
126300                                                                              
126400 01  WLI-R00-L05-ENCA.                                                        
126500     02 WLI-R00-L05-NBSUC   PIC X(54) VALUE                                   
126600                            "CAPTACION LEON GTO.".                            
126620     02 WLI-R00-L05-NCSI    PIC X(78) VALUE                                   
126640                            "CENTRO DE DESARROLL0 LEON".                      
126700                                                                              
126800**************************************************************                
126900 01  WLI-R01-L06-ENCA.                                                        
126950     02 FILLER               PIC X(14) VALUE                                  
127000                             "       NUMERO ".                                
127010     02 FILLER               PIC X(15) VALUE                                  
127020                             "   MEDIO DE    ".                               
127050     02 FILLER               PIC X(36) VALUE                                  
127100                             "N O M B R E ".                                  
127150     02 FILLER               PIC X(09) VALUE                                  
127200                             "  NUMERO ".                                     
127250     02 FILLER               PIC X(19) VALUE                                  
127300                             "  PROMEDIO MENSUAL ".                           
127350     02 FILLER               PIC X(19) VALUE                                  
127400                             "    PROMEDIO ANUAL ".                           
127420     02 FILLER               PIC X(20) VALUE                                  
127440                             "NOMBRE".                                        
127500                                                                              
127600 01  WLI-R01-L07-ENCA.                                                        
127700     02 FILLER               PIC X(14) VALUE                                  
127800                             "     CONTRATO ".                                
127810     02 FILLER               PIC X(15) VALUE                                  
127820                             "    ACCESO     ".                               
127900     02 FILLER               PIC X(36) VALUE                                  
128000                             "DEL CLIENTE ".                                  
128100     02 FILLER               PIC X(09) VALUE                                  
128200                             "   DEVOL ".                                     
128220     02 FILLER               PIC X(19) VALUE                                  
128240                             "    ULTIMO  CICLO  ".                           
128620     02 FILLER               PIC X(19) VALUE                                  
128640                             "    ULT. 12 CICLOS ".                           
128660     02 FILLER               PIC X(20) VALUE                                  
128680                             "PRODUCTO".                                      
128700                                                                              
128800 01  WLI-R01-L08-DETALLE.                                                     
128900     02 FILLER                    PIC X.                                      
129000     02 WLI-R01-L08-CONTRATO      PIC Z(12).                                  
129010     02 FILLER                    PIC X.                                      
129020     02 WLI-R01-L08-MDASUC        PIC 9999.                                   
129022     02 WLI-R01-L08-MDAFIL        PIC X.                                      
129024     02 WLI-R01-L08-MDACTA        PIC 999999B9.                               
129100     02 FILLER                    PIC XX.                                     
129200     02 WLI-R01-L08-NOMBRE        PIC X(35).                                  
129300     02 FILLER                    PIC X.                                      
129400     02 WLI-R01-L08-NUMDEV        PIC ZZZZ,ZZ9.                               
129500     02 FILLER                    PIC X.                                      
129600     02 WLI-R01-L08-PROM-MES      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                     
129700     02 FILLER                    PIC X.                                      
129800     02 WLI-R01-L08-PROM-ANH      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                     
129810     02 FILLER                    PIC X.                                      
129820     02 WLI-R01-L08-PRODUCTO      PIC X(20).                                  
129850                                                                              
129900****************************************************************              
129902 01  WLI-R02-L06-ENCA.                                                        
129904     02 FILLER              PIC X(36) VALUE                                   
129906                         "NSUC-PROD-INST-MON      CLIENTE     ".              
129908     02 FILLER              PIC X(35) VALUE                                   
129910                         "CONTRATO   MANEJO-CTA   RENTA-MENS ".               
129912     02 FILLER              PIC X(27) VALUE                                   
129914                         "CHQS-GIRADOS   CHQ-DEVLTO  ".                       
129916     02 FILLER              PIC X(34) VALUE                                   
129918                         "OTRAS-COMIS         TOTAL  MES/SM ".                
129920                                                                              
130000******************************************************                        
130002 01 WLI-R02-L08-DETA.                                                         
130004     02 WLI-R02-L08-NSUC         PIC ZZZ9.                                    
130006     02 WLI-R02-L08-PROD         PIC Z9999.                                   
130008     02 WLI-R02-L08-INST         PIC Z9999.                                   
130010     02 WLI-R02-L08-MONE         PIC ZZ99.                                    
130012     02 WLI-R02-L08-CLTE         PIC Z(13).                                   
130014     02 WLI-R02-L08-CTO          PIC Z(13).                                   
130016     02 FILLER                   PIC X(01).                                   
130018     02 WLI-R02-L08-MANCTA       PIC Z,ZZZ,ZZ9.99.                            
130020     02 FILLER                   PIC X(01).                                   
130022     02 WLI-R02-L08-RENTA        PIC Z,ZZZ,ZZ9.99.                            
130024     02 FILLER                   PIC X(01).                                   
130026     02 WLI-R02-L08-CHQGIR       PIC Z,ZZZ,ZZ9.99.                            
130028     02 FILLER                   PIC X(01).                                   
130030     02 WLI-R02-L08-CHQDEV       PIC Z,ZZZ,ZZ9.99.                            
130032     02 FILLER                   PIC X(01).                                   
130034     02 WLI-R02-L08-OTRCOM       PIC Z,ZZZ,ZZ9.99.                            
130036     02 FILLER                   PIC X(01).                                   
130038     02 WLI-R02-L08-TOTCOM       PIC ZZ,ZZZ,ZZ9.99.                           
130040     02 FILLER                   PIC X(04).                                   
130042     02 WLI-R02-L08-MESSM        PIC ZZ9.                                     
130044     02 FILLER                   PIC X(02).                                   
130100                                                                              
130105******************************************************                        
130110 01  WLI-STRING-PROD.                                                         
130115     02 FILLER                PIC X(01)   VALUE " ".                          
130120     02 WLI-STR-PROD          PIC 9(04).                                      
130125     02 FILLER                PIC X(01)   VALUE "-".                          
130130     02 WLI-STR-INST          PIC 9(04).                                      
130135     02 FILLER                PIC X(01)   VALUE "-".                          
130140     02 WLI-STR-MONE          PIC 9(03).                                      
130145     02 FILLER                PIC X(01)   VALUE " ".                          
130150                                                                              
130200***********************************************************                   
130300 01  WLI-R00-L98-FIN.                                                         
130400     02 FILLER   PIC X(30)  VALUE " ".                                        
130500     02 FILLER   PIC X(30)  VALUE "** SIN INFORMACION *****".                 
130600                                                                              
130700 01  WLI-R00-L99-FIN.                                                         
130800     02 FILLER   PIC X(30)  VALUE " ".                                        
130900     02 FILLER   PIC X(30)  VALUE "***** FIN DE REPORTE *****".               
131000                                                                              
131100***************************************************************               
131200 01  WKS-TITULOS-REPORTES.                                                    
131300     02 WKS-TITULO-R01.                                                       
131400        04 FILLER      PIC X(05) VALUE " ".                                   
131500        04 FILLER      PIC X(60) VALUE                                        
131600                       "CONTRATOS CON MAS DE 2 DEVOLUCIONES".                 
131700                                                                              
131800     02 WKS-SUBTIT-R01.                                                       
131900        04 FILLER           PIC X(15) VALUE                                   
132000                            "EN EL BIMESTRE ".                                
132100        04 WKS-SBT-MES-01   PIC X(10) VALUE " ".                              
132200        04 FILLER           PIC X     VALUE "-".                              
132300        04 WKS-SBT-MES-02   PIC X(10) VALUE " ".                              
132400        04 FILLER           PIC X(04) VALUE                                   
132500                            " DE ".                                           
132600        04 WLI-SBT-ANH      PIC 9999.                                         
132700        04 FILLER           PIC X(21) VALUE " ".                              
132710                                                                              
132720     02 WKS-TITULO-R02.                                                       
132730        04 FILLER      PIC X(05) VALUE " ".                                   
132740        04 FILLER      PIC X(60) VALUE                                        
132750                       "COMISIONES PENDIENTES SIN IVA ".                      
132760                                                                              
132770     02 WKS-SUBTIT-R02.                                                       
132780        04 FILLER           PIC X(65) VALUE " ".                              
132790                                                                              
132800                                                                              
132900****************************************************************              
133000 01  WKS-NAME-REPORTE.                                                        
133100     02 FILLER                   PIC X(15) VALUE                              
133200                                 "S500/LIST/P320/".                           
133300     02 WKS-TIT-R00-NODO         PIC 99.                                      
133400     02 WKS-TIT-R00-SBNODO       PIC 99    VALUE 0.                           
133500     02 FILLER                   PIC X     VALUE "/".                         
133600     02 WKS-TIT-R00-TIPO         PIC X(4)  VALUE "R000".                      
133700     02 FILLER                   PIC X     VALUE "/".                         
133800     02 WKS-TIT-R00-FECHA        PIC 9(6).                                    
133900     02 FILLER                   PIC X     VALUE "/".                         
134000     02 WKS-TIT-R00-NUMMIX       PIC 9(07).                                   
134100     02 FILLER                   PIC X     VALUE "/".                         
134200     02 WKS-TIT-R00-NOM-REP      PIC X(17).                                   
134300     02 FILLER                   PIC X     VALUE ".".                         
134400                                                                              
134500************************************************                              
134600 COPY "S500/INC/WOR/25MTP002".                                                
134700 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
134800/                                                                             
134900***************************************************************               
135000 PROCEDURE DIVISION.                                                          
135100*****************************************************************             
135200 DECLARATIVES.                                                                
135300 INTERRUPT-SECCION        SECTION  00.                                        
135400     USE AS INTERRUPT PROCEDURE.                                              
135500 INTERRUPT-BY-HI.                                                             
135600     DISALLOW  INTERRUPT.                                                     
135805                                                                              
135815     MOVE "I" TO W77-TIPO-DISP                                                
135820     IF W77-STATUS-PASO = 0                                                   
135840        MOVE "ABRE Y VALIDA BASE"  TO WS-0101-TEXT-MSG                        
135860     ELSE                                                                     
135880     IF W77-STATUS-PASO = 1                                                   
135900        STRING " GENERA ARCH-PTE",                                            
135910               " LEIDOS BD=", W77-NUM-LEIDOS,                                 
136000               " ESC-PTE=",   W77-TOT-ESCRITOS                                
136100               DELIMITED BY SIZE INTO   WS-0101-TEXT-MSG                      
136110     ELSE                                                                     
136120     IF W77-STATUS-PASO = 2                                                   
136130        STRING "SORT ARCH-PTE  REGS=", W77-TOT-ESCRITOS                       
136140               DELIMITED BY SIZE INTO   WS-0101-TEXT-MSG                      
136150     ELSE                                                                     
136155     IF W77-STATUS-PASO = 3                                                   
136160        STRING "GENERA REPORTE  LEIDOS ", W77-TOT-REGDEV                      
136170               " DE  ", W77-TOT-ESCRITOS                                      
136180               DELIMITED BY SIZE INTO   WS-0101-TEXT-MSG                      
136182     ELSE                                                                     
136184        MOVE "GENERA REPORTE COMI-PEND " TO   WS-0101-TEXT-MSG.               
136190                                                                              
136200     PERFORM 70000050-MENSAJE.                                                
136220     MOVE "E" TO W77-TIPO-DISP.                                               
136240                                                                              
136300 END-INTERRUPT-BY-HI.                                                         
136400     ALLOW INTERRUPT.                                                         
136500 END DECLARATIVES.                                                            
136600******************************************************************            
136700 00000000-SECCION-GRAL    SECTION  01.                                        
136710 00000000-CONTROL-PROGRAMA.                                                   
136715******************************************************                        
136720     MOVE ATTRIBUTE HOSTNAME OF MYSELF TO WKS-NAME-HOST.                      
136725     MOVE 2            TO  W77-USO-LIBLJ                                      
136735     MOVE "P320"       TO  WS-0101-PASO-MSG                                   
136745     MOVE "25MTP003"   TO  WS-0101-MTP-MSG                                    
136755                           W77-S000-MY-VERSION                                
136765     MOVE "S500P320"   TO  W77-S000-MY-ID.                                    
136775                                                                              
136806     PERFORM 10000100-VERSIONES.                                              
136810     PERFORM 1000038-S038L035.                                                
136815     MOVE 1                TO W77-ID-NUM-COPIA-MAPLI.                         
136820     MOVE 1                TO W77-ID-TPODSP-INFO-MAPLI.                       
136825     MOVE 00               TO W77-ID-ESINI-GRUPO-MAPLI.                       
136830     MOVE 06               TO W77-ID-NUM-GRUPO-MAPLI.                         
136835     MOVE "BATCH DIARIO"   TO W77-ID-NOMB-LIB.                                
136840     PERFORM 70000950-INI-PGM-MAPLI.                                          
136845******************************************************                        
136850     MOVE 1                           TO W77-ID-NUMREG-PROC.                  
136855     MOVE 01                          TO W77-ID-ACTXX-MAPLI                   
136860                                         W77-ID-ACT01-MAPLI.                  
136865     MOVE "OPEN Y LIGA LIBS "         TO W77-ID-NOMB-LIB.                     
136875     MOVE "PROCESO INICIO UNICA VEZ " TO W77-ID-TXTA-LIB.                     
136890     PERFORM 70000910-INIACT-MAPLI.                                           
136895*******************************************************                       
136900     PERFORM 10000010-INICIO-PGM.                                             
137000     PERFORM 10000000-TITLE-LIBRERIAS.                                        
137100     PERFORM 20000000-ABRE-BASE.                                              
137200     PERFORM 20003000-INICIA-WORKING.                                         
137300     PERFORM 40001000-LIBS-AMEMORIA.                                          
137320     PERFORM 40001100-CANCEL-LIBS.                                            
137325******************************************************                        
137330     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
137335     MOVE " "                TO W77-ID-TXTA-LIB.                              
137340     PERFORM 70000950-ACT-REGPROC.                                            
137345                                                                              
137350     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
137355     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
137360******************************************************                        
137400     PERFORM 50000000-PROCESO-PRINCIPAL.                                      
137500     PERFORM 70000000-FIN-PROGRAMA.                                           
137505******************************************************                        
137525                                                                              
137530     MOVE W77-ID-ACT04-MAPLI TO W77-ID-ACTXX-MAPLI.                           
137535     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
137540                                                                              
137545     PERFORM 70000950-FIN-PGM-MAPLI.                                          
137550*******************************************************                       
137600     STOP RUN.                                                                
137700                                                                              
137800************************************************************                  
137900 10000010-INICIO-PGM.                                                         
137905                                                                              
137910     MOVE ZEROS     TO WKS-TB-NUMACT-LIBS.                                    
137915                                                                              
137920     MOVE 20        TO WKS-NUMACT-LIB(12).                                    
137925     MOVE 21        TO WKS-NUMACT-LIB(13).                                    
137930     MOVE 22        TO WKS-NUMACT-LIB(15).                                    
137935     MOVE 23        TO WKS-NUMACT-LIB(33).                                    
137940     MOVE 23        TO WKS-NUMACT-LIB(34).                                    
137945     MOVE 23        TO WKS-NUMACT-LIB(41).                                    
137950                                                                              
138600                                                                              
138700     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-TASK-VALUE.                    
138800                                                                              
138900     MOVE WKS-TASK-FECHA      TO WKS-FEC-BATCH-08.                            
139000     MOVE WKS-TASK-CSI        TO W77-MY-CSI.                                  
139100                                                                              
139200     IF WKS-TASK-FECHA > 0                                                    
139300     OR WKS-TASK-CSI   > 0                                                    
139400        IF  (WKS-AAAA-BATCH > 1996)                                           
139500        AND (WKS-MM-BATCH   > 0 AND < 13)                                     
139600        AND (WKS-DD-BATCH   > 0 AND < 32)                                     
139700        AND (W77-MY-CSI     = 04 OR 10)                                       
139800             MOVE 0                TO W77-VEO-BASE                            
139810             MOVE WKS-DD-BATCH     TO WKS-DD-FBAS-DMA                         
139811                                      WKS-DD-FPRC-EDIT                        
139812             MOVE WKS-MM-BATCH     TO WKS-MM-FBAS-DMA                         
139814             MOVE WKS-AAAA-BATCH   TO WKS-AAAA-FBAS-DMA                       
139834                                      WKS-AAAA-FPRC-EDIT                      
139854             MOVE WKS-TB-MES-X3(WKS-MM-BATCH)                                 
139874               TO WKS-MM-FPRC-EDIT                                            
139900        ELSE                                                                  
140200           STRING "ERR FECH/CSI EN VALUE ",                                   
140300                  " FECHA " WKS-TASK-FECHA                                    
140400                  " CSI " WKS-TASK-CSI                                        
140500           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                            
140600           PERFORM 70000050-MENSAJE                                           
140700           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                            
140800     ELSE                                                                     
140900        MOVE 1         TO W77-VEO-BASE.                                       
141000                                                                              
141100     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
141200            OF MYSELF.                                                        
141300     ALLOW INTERRUPT.                                                         
141400                                                                              
141500***************************************************************               
141600 10000000-TITLE-LIBRERIAS.                                                    
141700*************************** LIBRERIA DE VERSIONES  *************              
141800     PERFORM 20000100-CHECAME-VERSION.                                        
141820     IF S000-CTR-CVEERROR < 0                                                 
141850        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
141860        PERFORM 70000050-MENSAJE                                              
141870        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
141900                                                                              
142000*************************** LIBRERIA DE ESTRUCTURA **************             
142100     PERFORM 10000080-S080L700.                                               
142130     PERFORM 10000080-S080IVA.                                                
142200                                                                              
142300*************************** LIBRERIA LOCSUP   "CALENDAR"  *******             
142400     PERFORM 10000006-LOCSUP.                                                 
142500                                                                              
142600*****************************************************************             
142700 20000000-ABRE-BASE.                                                          
142800     OPEN INQUIRY S500BD01CAPTACION.                                          
142900     IF W77-VEO-BASE = 1                                                      
143000        PERFORM 20001000-VALIDA-BASE.                                         
143100                                                                              
143200***************************************************************               
143300 20001000-VALIDA-BASE.                                                        
143400     PERFORM 90000002-B02CONTROL-FIND.                                        
143500     IF WS-STATUS-BASE > 0                                                    
143800        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
143900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
144000        PERFORM 70000050-MENSAJE                                              
144100        CALL SYSTEM DMTERMINATE.                                              
144200                                                                              
144300     MOVE B02-NUM-CSI          TO W77-MY-CSI.                                 
144400     MOVE B02-FECHA-LINEA      TO WKS-FEC-LINEA-08.                           
144500                                                                              
144600     MOVE WKS-FEC-LINEA-08         TO WS-S006-FECHA1.                         
144700     MOVE 1                        TO WS-S006-FECHA2.                         
144800     MOVE 12                       TO WS-S006-FORMATO.                        
144900     MOVE 15                       TO WS-S006-FUNCION.                        
145000     PERFORM 20003500-LLAMA-LOCSUP                                            
145100     MOVE WS-S006-FECHA1        TO WKS-FEC-BATCH-08.                          
145110     MOVE WKS-DD-BATCH             TO WKS-DD-FBAS-DMA                         
145111                                      WKS-DD-FPRC-EDIT.                       
145112     MOVE WKS-MM-BATCH             TO WKS-MM-FBAS-DMA.                        
145114     MOVE WKS-AAAA-BATCH           TO WKS-AAAA-FBAS-DMA                       
145134                                      WKS-AAAA-FPRC-EDIT.                     
145154     MOVE WKS-TB-MES-X3(WKS-MM-BATCH)                                         
145174       TO WKS-MM-FPRC-EDIT.                                                   
145200                                                                              
145300**************************************************************                
145400 20003000-INICIA-WORKING.                                                     
145500     ACCEPT WKS-TIME-MAQ        FROM TIME.                                    
145600     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
145610                                                                              
145620     MOVE WKS-AAAA-MAQ              TO WKS-AAAA-FMAQ-EDIT.                    
145630     MOVE WKS-DD-MAQ                TO WKS-DD-FMAQ-EDIT.                      
145640     MOVE WKS-TB-MES-X3(WKS-MM-MAQ) TO WKS-MM-FMAQ-EDIT.                      
145650                                                                              
145700     MOVE ATTRIBUTE MIXNUMBER   OF MYSELF TO W77-MY-MIX.                      
145800                                                                              
145900     MOVE W77-MY-MIX            TO WKS-TIT-R00-NUMMIX.                        
146000     MOVE W77-MY-CSI            TO WKS-TIT-R00-NODO.                          
146100                                                                              
146200     MOVE WKS-FEC-BATCH-08      TO WKS-TIT-R00-FECHA.                         
146300     MOVE WKS-FECPROC-EDIT      TO WLI-R00-L01-FPROC.                         
146400                                                                              
146500     MOVE WKS-FECMAQ-EDIT       TO WLI-R00-L02-FMAQ.                          
146600                                                                              
146700     MOVE WKS-HRMAQ-HH          TO WLI-R00-L03-HR-HH.                         
146720     MOVE WKS-HRMAQ-MM          TO WLI-R00-L03-HR-MM.                         
146740     MOVE WKS-HRMAQ-SS          TO WLI-R00-L03-HR-SS.                         
146800                                                                              
146820     MOVE " "                   TO WKS-NOMB-MES                               
146840                                   WKS-MES-JUST-R                             
146860                                   WLI-R01-L08-DETALLE                        
146865                                   WLI-R02-L08-DETA.                          
146880                                                                              
146900     MOVE WKS-MM-BATCH          TO WKS-MES-ACT                                
147000                                   WKS-MES-ANT.                               
147100     SUBTRACT 1 FROM WKS-MES-ANT.                                             
147200                                                                              
147300     IF WKS-MES-ANT = 0                                                       
147400        MOVE 12 TO WKS-MES-ANT.                                               
147500                                                                              
147600     MOVE WKS-TB-NOM-MES(WKS-MES-ACT)  TO WKS-SBT-MES-02                      
147700                                          WKS-NOMB-MES.                       
148200                                                                              
148300     MOVE WKS-TB-NOM-MES(WKS-MES-ANT)  TO WKS-NOMB-MES.                       
148400     MOVE 10   TO W77-IND-B.                                                  
148500     MOVE 11   TO W77-IND-A.                                                  
148600     PERFORM 20003010-NOMBRE-MES.                                             
148700     MOVE WKS-MES-JUST-R               TO WKS-SBT-MES-01.                     
148800                                                                              
148900                                                                              
149000     MOVE WKS-AAAA-BATCH               TO WLI-SBT-ANH.                        
149400                                                                              
149500     MOVE ALL @00@              TO WKS-TOTALES-SUC                            
149600                                   WKS-TOTALES-CCI                            
149700                                   WKS-TB-REPNODOS.                           
149710                                                                              
149720     IF W77-MY-CSI = 4                                                        
149730        MOVE "C.S.I. MONTERREY"       TO WLI-R00-L05-NCSI                     
149740     ELSE                                                                     
149750        MOVE "C.S.I. MEXICO   "       TO WLI-R00-L05-NCSI.                    
149800                                                                              
149900     OPEN OUTPUT I01-DEVMENSUAL.                                              
150000                                                                              
150100     IF W77-MY-CSI = 10                                                       
150200        MOVE 1       TO WKS-GEN-REP1(3)                                       
150300                        WKS-GEN-REP1(4)                                       
150400                        WKS-GEN-REP1(5).                                      
150500                                                                              
150600                                                                              
150700***********************************************************                   
150800 20003010-NOMBRE-MES.                                                         
150900     IF WKS-OCC-MES(W77-IND-B) NOT = " "                                      
151000        SUBTRACT 1 FROM W77-IND-A                                             
151100        IF W77-IND-A > 0 AND < 11                                             
151200           MOVE WKS-OCC-MES(W77-IND-B) TO WKS-DIG-MES(W77-IND-A)              
151300        ELSE                                                                  
151400           MOVE " " TO WKS-DIG-MES(W77-IND-A).                                
151500     SUBTRACT 1 FROM W77-IND-B                                                
151600     IF W77-IND-B > 0                                                         
151700        GO TO 20003010-NOMBRE-MES.                                            
151800                                                                              
151900**************************************************************                
152000 20003500-LLAMA-LOCSUP.                                                       
152100     PERFORM 20000006-LOCSUP.                                                 
152200                                                                              
152300     IF WS-S006-FUNCION > 0                                                   
152400        MOVE WS-S006-FORMATO  TO WS-MSG-N-02                                  
152500        MOVE WS-S006-FUNCION  TO WS-MSG-N-04                                  
152600        STRING "ERR CALL LOCSUP ",                                            
152700               " FUNC ", WS-MSG-N-04                                          
152800               " FMTO ", WS-MSG-N-02                                          
152900               " FEC1 ", WS-S006-FECHA1                                       
153000               " FEC2 ", WS-S006-FECHA2                                       
153100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
153200        PERFORM 70000050-MENSAJE                                              
153300        CALL SYSTEM DMTERMINATE.                                              
153400                                                                              
153500****************************************************                          
153600 40001000-LIBS-AMEMORIA.                                                      
153720     MOVE 320                   TO WKS-S080-NUMPASO.                          
153740     MOVE ZERO                  TO WKS-S080-NUMSUC.                           
153800     MOVE WKS-FEC-BATCH-08      TO WKS-S080-FECHA.                            
153820                                                                              
153840     PERFORM 40000080-CARGA-DATOS-S080.                                       
153900                                                                              
153905     IF WKS-S080-RS-CARGA = 0 OR 1                                            
153910        MOVE 0                     TO WKS-S080-NUMSUC                         
153915     ELSE                                                                     
153930        MOVE WKS-S080-RS-CARGA     TO WS-MSG-RS                               
153935        MOVE WKS-S080-NUMSUC       TO WS-MSG-N-04                             
153940        STRING " ERROR CARGA S080 RS=", WS-MSG-RS                             
153945            "  ULTIMA SUC/CARGADA=", WS-MSG-N-04                              
153950            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
153955        PERFORM 70000050-MENSAJE                                              
153960        CALL SYSTEM DMTERMINATE.                                              
154000                                                                              
154020************************************************************                  
154040 40001100-CANCEL-LIBS.                                                        
154060     CANCEL "CTLVERS".                                                        
154080     CANCEL "S080TARIFAS".                                                    
154100     CANCEL "S080BD01CON".                                                    
154120                                                                              
154140                                                                              
154160                                                                              
154200************************************************************                  
156300 50000000-PROCESO-PRINCIPAL.                                                  
156305******************************************************                        
156310     MOVE 20  TO W77-ID-NUMDSET-MAPLI.                                        
156315     MOVE 1  TO W77-ID-NUMBASE-MAPLI.                                         
156320     PERFORM 70000600-REGS-EN-BASE.                                           
156340                                                                              
156345     MOVE 02                          TO W77-ID-ACTXX-MAPLI                   
156350                                         W77-ID-ACT02-MAPLI.                  
156355     MOVE "GENERA ARCHIVO PTE "       TO W77-ID-NOMB-LIB.                     
156365     MOVE "GENERA ARCHIVO DESDE B20 " TO W77-ID-TXTA-LIB.                     
156380     PERFORM 70000910-INIACT-MAPLI.                                           
156385*******************************************************                       
156390     MOVE 1                 TO W77-STATUS-PASO.                               
156400     SET S500B20DEVMENSUAL  TO BEGINNING.                                     
156450     SET B20SXCTOMA         TO BEGINNING.                                     
156455     MOVE 999999999999      TO B03-NUM-CONTRATO.                              
156500     PERFORM 50003000-GENERA-ARCH  UNTIL W77-EOF-BASE = 1.                    
156600**   CLOSE S500BD01CAPTACION.                                                 
156605********************************************************                      
156610     MOVE W77-ID-ACT02-MAPLI TO W77-ID-ACTXX-MAPLI.                           
156615     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
156620******************************************************                        
156625     MOVE 1                             TO W77-ID-NUMREG-PROC.                
156630     MOVE 03                            TO W77-ID-ACTXX-MAPLI                 
156635                                           W77-ID-ACT03-MAPLI.                
156640     MOVE "GENERA REPORTE "             TO W77-ID-NOMB-LIB.                   
156650     MOVE "CLASIFICA Y GENERA REPORTE " TO W77-ID-TXTA-LIB.                   
156665     PERFORM 70000910-INIACT-MAPLI.                                           
156670*******************************************************                       
156700                                                                              
156800     IF W77-TOT-ESCRITOS > 0                                                  
156900        CLOSE I01-DEVMENSUAL WITH SAVE                                        
157000        PERFORM 50004000-SORT-DEVMES                                          
157100        OPEN INPUT I01-DEVMENSUAL                                             
157200        MOVE ZERO              TO W77-EOF-ARCHS                               
157300        MOVE 3                 TO W77-STATUS-PASO                             
157400        PERFORM 50005000-REPORTE-ASUC UNTIL W77-EOF-ARCHS = 1                 
157500        CLOSE I01-DEVMENSUAL WITH PURGE                                       
157600     ELSE                                                                     
157700        CLOSE I01-DEVMENSUAL WITH PURGE.                                      
157705                                                                              
157710***************************************************************               
157720     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
157730     MOVE " "                TO W77-ID-TXTA-LIB.                              
157740     PERFORM 70000950-ACT-REGPROC.                                            
157750                                                                              
157760     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
157770     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
157780                                                                              
157800******************************************************                        
157810     MOVE 1                           TO W77-ID-NUMREG-PROC.                  
157818     MOVE 04                          TO W77-ID-ACTXX-MAPLI                   
157820                                         W77-ID-ACT04-MAPLI.                  
157822     MOVE "GENERA LIST COMIPEN"       TO W77-ID-NOMB-LIB.                     
157824     MOVE "GENERA LISTADO COMIPEND  " TO W77-ID-TXTA-LIB.                     
157826     PERFORM 70000910-INIACT-MAPLI.                                           
157828*******************************************************                       
157830     MOVE 4                 TO W77-STATUS-PASO.                               
157832     SET S500B12COMPEN      TO BEGINNING.                                     
157834     PERFORM 60010000-GENERA-COMIPEND.                                        
157836     CLOSE S500BD01CAPTACION.                                                 
157840                                                                              
157846                                                                              
157900************************************************************                  
158000 50003000-GENERA-ARCH.                                                        
158010     MOVE ZERO   TO  WS-NUM-CONTRATO                                          
158020                     WS-MEDIO-ACCESO.                                         
158100     PERFORM 50003100-DAME-B20DEV.                                            
158200     IF W77-EOF-BASE = 0                                                      
158300        IF W77-SW-NOHAY = 0                                                   
158400           PERFORM 50003250-ESCRIBE-ARCHIVO.                                  
158410******************************************************                        
158420     IF W77-EOF-BASE = 0                                                      
158430        MOVE W77-ID-ACT02-MAPLI    TO W77-ID-ACTXX-MAPLI                      
158440        MOVE " "                   TO W77-ID-TXTA-LIB                         
158450        MOVE B20-NUM-CONTRATO      TO WS-MSG-CTO                              
158460        STRING "CTOS LEIDOS B03 = "   W77-NUM-LEIDOS                          
158470                   " ULTIMO CTO = "   WS-MSG-CTO                              
158480               DELIMITED BY SIZE INTO W77-ID-TXTA-LIB                         
158490        PERFORM 70000950-ACT-REGPROC.                                         
158500                                                                              
158600**************************************************************                
158700 50003100-DAME-B20DEV.                                                        
158800     PERFORM 90000020-B20SXCTOMA-FINDN.                                       
158900     IF WS-STATUS-BASE > 0                                                    
159000        IF WS-DB-NOTFOUND                                                     
159100           MOVE 1                     TO W77-EOF-BASE                         
159200                                         W77-SW-NOHAY                         
159300        ELSE                                                                  
159700           STRING "ERR FINDN B20DEVMENSUAL ",                                 
159800                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
159900           PERFORM 70000050-MENSAJE                                           
160000           CALL SYSTEM DMTERMINATE.                                           
160100                                                                              
160200     IF W77-EOF-BASE = 0                                                      
160300        ADD 1  TO W77-NUM-LEIDOS                                              
160400        COMPUTE WKS-I01-R01-DEVMES-TOT = B20-DEV-MES-ANT                      
160500                                       + B20-DEV-MESANTANT                    
160600        IF WKS-I01-R01-DEVMES-TOT > 2                                         
160610           MOVE ZERO   TO W77-SW-NOHAY                                        
160612           IF B20-NUM-CONTRATO = 0                                            
160614              MOVE 1   TO W77-SW-NOHAY                                        
160616           ELSE                                                               
160630           IF B20-NUM-CONTRATO = B03-NUM-CONTRATO                             
160650              NEXT SENTENCE                                                   
160670           ELSE                                                               
160680              MOVE B20-NUM-CONTRATO TO WS-NUM-CONTRATO                        
160700              PERFORM 550003150-DAME-B03CTO                                   
160710              IF W77-SW-NOHAY = 0                                             
160720                 PERFORM 50003180-DAME-HISTORICO                              
160730              ELSE                                                            
160740                 NEXT SENTENCE                                                
160750        ELSE                                                                  
160760           MOVE 1   TO W77-SW-NOHAY.                                          
160900                                                                              
161000*************************************************                             
161100 550003150-DAME-B03CTO.                                                       
161200                                                                              
161300     PERFORM 90000003-B03SXCTO-FIND.                                          
161400     IF WS-STATUS-BASE > 0                                                    
162100        MOVE 1 TO W77-SW-NOHAY.                                               
162120                                                                              
162140**   IF W77-SW-NOHAY = 0                                                      
162160**      PERFORM 50003180-DAME-HISTORICO.                                      
162200                                                                              
162205****************************************************                          
162210 50003180-DAME-HISTORICO.                                                     
162215                                                                              
162220     PERFORM 90000006-B06SXCTO-FIND.                                          
162225     IF WS-STATUS-BASE > 0                                                    
162240        MOVE WS-NUM-CONTRATO       TO WS-MSG-CTO                              
162245        STRING "ERR FIND B06SXCTO ", WS-MSG-CTO                               
162250               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
162255        PERFORM 70000050-MENSAJE                                              
162260        CALL SYSTEM DMTERMINATE.                                              
162265                                                                              
162300***************************************************************               
165200 50003250-ESCRIBE-ARCHIVO.                                                    
165300     MOVE B03-SUC-PROMOTORA      TO WKS-I01-R01-SUC-PROM.                     
165400     MOVE B03-NUM-CONTRATO       TO WKS-I01-R01-CONTRATO.                     
165500     MOVE B03-NUM-PRODUCTO       TO WKS-I01-R01-PRODUCTO.                     
165600     MOVE B03-NUM-INSTRUM        TO WKS-I01-R01-INSTRUMENTO.                  
165700     MOVE B03-MONEDA             TO WKS-I01-R01-MONEDA.                       
165800     MOVE B03-NOMBRE             TO WKS-I01-R01-NOMBRE.                       
165820                                                                              
165840     INSPECT WKS-I01-R01-NOMBRE REPLACING ALL "/" BY " ".                     
165860     INSPECT WKS-I01-R01-NOMBRE REPLACING ALL "," BY " ".                     
165900                                                                              
165910     MOVE B20-MEDIO-ACCESO       TO WKS-I01-R01-MEDIOACC.                     
166000     MOVE B20-DEV-MES-ANT        TO WKS-I01-R01-DEVMES-ACT.                   
166100     MOVE B20-DEV-MESANTANT      TO WKS-I01-R01-DEVMES-ANT.                   
166200     MOVE B06-PROM-CICLO(12)     TO WKS-I01-R01-PROM-MES.                     
166300                                                                              
166400     MOVE ZERO                   TO W77-IND-MES                               
166500                                    WKS-ACUM-PROM                             
166600                                    WKS-NUM-MES.                              
166610                                                                              
166700     PERFORM 50003260-SUMA-PROM-ANUAL 12 TIMES.                               
166710                                                                              
166800     IF WKS-NUM-MES > 0                                                       
166900        COMPUTE WKS-I01-R01-PROM-ANH = WKS-ACUM-PROM                          
167000                                     / WKS-NUM-MES                            
167100     ELSE                                                                     
167200        MOVE ZERO  TO WKS-I01-R01-PROM-ANH.                                   
167300                                                                              
167320     IF WKS-I01-R01-SUC-PROM  NOT  = WKS-S080-NUMSUC                          
167400        MOVE WKS-I01-R01-SUC-PROM TO WKS-S080-NUMSUC                          
167410        PERFORM 42000080-DATOS-S080.                                          
167500                                                                              
167600     MOVE WKS-S080-NODO-IMP            TO WKS-I01-R01-NODO.                   
167700                                                                              
167750     IF W77-MY-CSI = 4                                                        
167800        IF WKS-I01-R01-NODO = 01 OR 04 OR 06 OR 07 OR 61                      
167900           NEXT SENTENCE                                                      
167950        ELSE                                                                  
168000           MOVE 04                 TO WKS-I01-R01-NODO                        
168050     ELSE                                                                     
168100     IF WKS-I01-R01-NODO = 09 OR 10                                           
168150        NEXT SENTENCE                                                         
168200     ELSE                                                                     
168250        MOVE 10                 TO WKS-I01-R01-NODO.                          
168300                                                                              
171910     MOVE 00 TO WKS-I01-R01-INDPRD.                                           
172000                                                                              
172100     WRITE I01-R00-DEVMENSUAL  FROM WKS-I01-R01-DETALLE                       
172200           INVALID KEY                                                        
172500           MOVE "ERR WRITE DEVMENSUAL" TO WS-0101-TEXT-MSG                    
172600           PERFORM 70000050-MENSAJE                                           
172700           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
172800                                                                              
172900     ADD 1 TO W77-TOT-ESCRITOS.                                               
173000                                                                              
173100*******************************************************                       
173200 50003260-SUMA-PROM-ANUAL.                                                    
173300     ADD 1 TO W77-IND-MES.                                                    
173400     IF B06-PROM-CICLO(W77-IND-MES) > 0                                       
173500        ADD B06-PROM-CICLO(W77-IND-MES)  TO WKS-ACUM-PROM                     
173600        ADD 1                            TO WKS-NUM-MES.                      
173700                                                                              
173800*************************************************************                 
173900 50004000-SORT-DEVMES.                                                        
173910     MOVE 2                 TO W77-STATUS-PASO.                               
174000     ADD                    10  TO W77-TOT-ESCRITOS.                          
174100     COMPUTE W77-TOT-DSKSIZE = W77-TOT-ESCRITOS  * 15 * 2.5.                  
174200     COMPUTE W77-TOT-MEMSIZE = (18 * 2000) + 1500.                            
174300     SORT S02-SORTDEVMES ON ASCENDING KEY WKS-S02-R01-NODO                    
174400                                          WKS-S02-R01-SUC-PROM                
174500                                          WKS-S02-R01-INDPRD                  
174600                                          WKS-S02-R01-CONTRATO                
174610                                          WKS-S02-R01-MEDIOACC                
174700          USING  I01-DEVMENSUAL                                               
174800          GIVING I01-DEVMENSUAL                                               
174900          MEMORY SIZE W77-TOT-MEMSIZE WORDS                                   
175000          DISK   SIZE W77-TOT-DSKSIZE WORDS.                                  
175100                                                                              
175200**********************************************************                    
175300 50005000-REPORTE-ASUC.                                                       
175400     READ I01-DEVMENSUAL INTO WKS-I01-R01-DETALLE                             
175500          AT END MOVE 1  TO W77-EOF-ARCHS.                                    
175600                                                                              
175700     IF W77-EOF-ARCHS = 0                                                     
175800        ADD  1  TO W77-TOT-REGDEV                                             
175900        PERFORM 50005100-ARMA-REPORTE                                         
176000     ELSE                                                                     
176100        PERFORM 50008300-CORTE-SUC THRU 50008400-CORTE-NODO                   
176200        PERFORM 50009300-CIERRA-REP-01.                                       
176300                                                                              
176400************************************************************                  
176500 50005100-ARMA-REPORTE.                                                       
176600     IF W77-NODO-ANT = 0                                                      
176700        MOVE WKS-I01-R01-NODO      TO W77-NODO-ANT                            
176800        MOVE WKS-I01-R01-SUC-PROM  TO W77-SUC-ANT                             
176900        PERFORM 50008500-NOMBRE-SUC                                           
177000        PERFORM 50009000-ABRE-REP-01.                                         
177100                                                                              
177200     IF WKS-I01-R01-NODO NOT = W77-NODO-ANT                                   
177300        PERFORM 50008300-CORTE-SUC THRU 50008400-CORTE-NODO                   
177400        PERFORM 50009300-CIERRA-REP-01                                        
177500        MOVE WKS-I01-R01-NODO      TO W77-NODO-ANT                            
177600        MOVE WKS-I01-R01-SUC-PROM  TO W77-SUC-ANT                             
177700        PERFORM 50008500-NOMBRE-SUC                                           
177800        PERFORM 50009000-ABRE-REP-01.                                         
177900                                                                              
178000     IF WKS-I01-R01-SUC-PROM  NOT = W77-SUC-ANT                               
178100        PERFORM 50008300-CORTE-SUC                                            
178200        MOVE WKS-I01-R01-SUC-PROM   TO W77-SUC-ANT                            
178300        PERFORM 50008500-NOMBRE-SUC.                                          
178400                                                                              
178500     MOVE WKS-I01-R01-CONTRATO       TO WLI-R01-L08-CONTRATO                  
178510     MOVE WKS-I01-R01-MDASUC         TO WLI-R01-L08-MDASUC.                   
178530     MOVE "/"                        TO WLI-R01-L08-MDAFIL.                   
178550     MOVE WKS-I01-R01-MDACTA         TO WLI-R01-L08-MDACTA.                   
178570                                                                              
178600     MOVE WKS-I01-R01-NOMBRE         TO WLI-R01-L08-NOMBRE.                   
178700     MOVE WKS-I01-R01-DEVMES-TOT     TO WLI-R01-L08-NUMDEV.                   
178800     MOVE WKS-I01-R01-PROM-MES       TO WLI-R01-L08-PROM-MES.                 
178900     MOVE WKS-I01-R01-PROM-ANH       TO WLI-R01-L08-PROM-ANH.                 
179000                                                                              
179620     MOVE WKS-I01-R01-PRODUCTO      TO WLI-STR-PROD.                          
179630     MOVE WKS-I01-R01-INSTRUMENTO   TO WLI-STR-INST.                          
179640     MOVE WKS-I01-R01-MONEDA        TO WLI-STR-MONE.                          
179650     MOVE WLI-STRING-PROD           TO WLI-R01-L08-PRODUCTO.                  
179700                                                                              
179800     ADD 1                      TO WKS-TOTS-NUM-CTOS                          
179900                                   WKS-TOTC-NUM-CTOS.                         
180000                                                                              
180100     ADD WKS-I01-R01-DEVMES-TOT TO WKS-TOTS-NUM-DEV                           
180200                                   WKS-TOTC-NUM-DEV.                          
180300                                                                              
180400     PERFORM 60005000-ESC-REP-01.                                             
180500                                                                              
180600**************************************************************                
180700 50008300-CORTE-SUC.                                                          
180800     PERFORM 60005000-ESC-REP-01.                                             
180900                                                                              
181000     MOVE WKS-TOTS-NUM-DEV            TO WLI-R01-L08-NUMDEV.                  
181100     MOVE WKS-TOTS-NUM-CTOS           TO WLI-R01-L08-CONTRATO.                
181200     MOVE "CLIENTES CON DEVOLUCIONES" TO WLI-R01-L08-NOMBRE.                  
181300                                                                              
181400     PERFORM 60005000-ESC-REP-01.                                             
181500                                                                              
181600     MOVE ALL @00@            TO WKS-TOTALES-SUC.                             
181700     MOVE 70                  TO W77-LIN-R01.                                 
181800     MOVE 0                   TO W77-PAG-R01.                                 
181900                                                                              
182000***********************************************************                   
182100 50008400-CORTE-NODO.                                                         
182200     MOVE 1                TO W77-CORTE-NODO.                                 
182300     PERFORM 60005000-ESC-REP-01.                                             
182400                                                                              
182500     MOVE WKS-TOTC-NUM-DEV            TO WLI-R01-L08-NUMDEV.                  
182600     MOVE WKS-TOTC-NUM-CTOS           TO WLI-R01-L08-CONTRATO.                
182700     MOVE "CLIENTES CON DEVOLUCIONES" TO WLI-R01-L08-NOMBRE.                  
182800                                                                              
182900     PERFORM 60005000-ESC-REP-01   2 TIMES.                                   
183000                                                                              
183100     MOVE WLI-R00-L99-FIN  TO WLI-R01-L08-DETALLE.                            
183200                                                                              
183300     PERFORM 60005000-ESC-REP-01.                                             
183400                                                                              
183500     MOVE ALL @00@       TO WKS-TOTALES-CCI.                                  
183600     MOVE 70               TO W77-LIN-R01.                                    
183700     MOVE 0                TO W77-PAG-R01                                     
183800                              W77-CORTE-NODO.                                 
183900                                                                              
184000***********************************************************                   
184100 50008500-NOMBRE-SUC.                                                         
184200     MOVE W77-SUC-ANT          TO WKS-S080-NUMSUC.                            
184300     PERFORM 42000080-DATOS-S080.                                             
184400                                                                              
185200     MOVE WKS-S080-NOMCORTO     TO WKS-NOMB-SUC.                              
185400                                                                              
185500***************************************************************               
185600 50009000-ABRE-REP-01.                                                        
185700     SET R01-DEVOLBIM   (USERBACKUPNAME) TO VALUE TRUE.                       
185800     MOVE W77-NODO-ANT                   TO WKS-TIT-R00-NODO.                 
185900     MOVE "001DEVOLBIM"                  TO WKS-TIT-R00-NOM-REP.              
186000     SET R01-DEVOLBIM     (TITLE)        TO WKS-NAME-REPORTE.                 
186100     OPEN OUTPUT R01-DEVOLBIM.                                                
186200                                                                              
186300     IF W77-NODO-ANT = W77-MY-CSI                                             
186400        MOVE 1         TO WKS-GEN-REP1(1)                                     
186500     ELSE                                                                     
186600     IF W77-NODO-ANT = 07 OR 09                                               
186700        MOVE 1         TO WKS-GEN-REP1(2)                                     
186800     ELSE                                                                     
186900     IF W77-NODO-ANT = 06                                                     
187000        MOVE 1         TO WKS-GEN-REP1(3)                                     
187100     ELSE                                                                     
187200     IF W77-NODO-ANT = 61                                                     
187300        MOVE 1         TO WKS-GEN-REP1(4)                                     
187400     ELSE                                                                     
187500     IF W77-NODO-ANT = 01                                                     
187600        MOVE 1         TO WKS-GEN-REP1(5).                                    
187700                                                                              
187800***************************************************************               
187900 50009300-CIERRA-REP-01.                                                      
188000     CLOSE R01-DEVOLBIM   WITH SAVE.                                          
188100                                                                              
188200**************************************************************                
188300 60005000-ESC-REP-01.                                                         
188400     ADD 1    TO W77-LIN-R01.                                                 
188500     IF W77-LIN-R01 > 56                                                      
188600        PERFORM 60005100-ENCA-REP-01.                                         
188700     WRITE R01-L00-DEVOLBIM  FROM WLI-R01-L08-DETALLE AFTER 1.                
188800     MOVE " "  TO WLI-R01-L08-DETALLE.                                        
188900                                                                              
189000*************************************************************                 
189100 60005100-ENCA-REP-01.                                                        
189200     ADD  1                 TO W77-PAG-R01.                                   
189300     MOVE W77-PAG-R01       TO WLI-R00-L03-NPAG.                              
189400     MOVE "001DEVOLBIM"     TO WLI-R00-L01-NAME.                              
189500     MOVE WKS-TITULO-R01    TO WLI-R00-L02-TITULO.                            
189600     MOVE WKS-SUBTIT-R01    TO WLI-R00-L03-SBTIT.                             
189700                                                                              
189800     IF W77-CORTE-NODO = 1                                                    
189900        MOVE 9999           TO WLI-R00-L04-SUC                                
190000        MOVE " "            TO WLI-R00-L05-NBSUC                              
190100        STRING "TOTAL NODO ", W77-NODO-ANT                                    
190200               DELIMITED BY SIZE INTO WLI-R00-L05-NBSUC                       
190300     ELSE                                                                     
190400        MOVE W77-SUC-ANT    TO WLI-R00-L04-SUC                                
190500        MOVE WKS-NOMB-SUC   TO WLI-R00-L05-NBSUC.                             
190600                                                                              
190700     WRITE R01-L00-DEVOLBIM FROM WLI-R00-L01-ENCA AFTER PAGE.                 
190800     WRITE R01-L00-DEVOLBIM FROM WLI-R00-L02-ENCA AFTER 1.                    
190900     WRITE R01-L00-DEVOLBIM FROM WLI-R00-L03-ENCA AFTER 1.                    
191000     WRITE R01-L00-DEVOLBIM FROM WLI-R00-L04-ENCA AFTER 1.                    
191100     WRITE R01-L00-DEVOLBIM FROM WLI-R00-L05-ENCA AFTER 1.                    
191200     WRITE R01-L00-DEVOLBIM FROM WLI-R01-L06-ENCA AFTER 2.                    
191300     WRITE R01-L00-DEVOLBIM FROM WLI-R01-L07-ENCA AFTER 1.                    
191400     MOVE  " "              TO R01-L00-DEVOLBIM.                              
191500     WRITE R01-L00-DEVOLBIM                       AFTER 1.                    
191600     MOVE 10 TO W77-LIN-R01.                                                  
191700                                                                              
191800********************************************************                      
192000 60010000-GENERA-COMIPEND.                                                    
192020     SET R02-COMIPEND (USERBACKUPNAME) TO VALUE TRUE.                         
192030     MOVE W77-MY-CSI                   TO WKS-TIT-R00-NODO.                   
192040     MOVE "002COMIPEND"                TO WKS-TIT-R00-NOM-REP.                
192050     SET R02-COMIPEND (TITLE)          TO WKS-NAME-REPORTE.                   
192060     OPEN OUTPUT R02-COMIPEND.                                                
192070                                                                              
192080     PERFORM 60011000-LEE-B12COM UNTIL W77-EOF-B12 = 1.                       
192090                                                                              
192100*****************************************************************             
192110 60011000-LEE-B12COM.                                                         
192115     PERFORM 90000012-B12COMPEN-FINDN.                                        
192120     IF WS-STATUS-BASE > 0                                                    
192125        IF WS-STATUS-BASE = 1                                                 
192130           MOVE 1 TO W77-EOF-B12                                              
192135        ELSE                                                                  
192140          MOVE WS-NUM-CONTRATO       TO WS-MSG-CTO                            
192145          STRING "ERR FINDN B12COMPEN STA=", WS-STATUS-BASE                   
192150                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
192155          PERFORM 70000050-MENSAJE                                            
192160          CALL SYSTEM DMTERMINATE.                                            
192165                                                                              
192170     IF W77-EOF-B12 = 0                                                       
192175        PERFORM 60011010-VAL-COMIPEN                                          
192180        IF W77-TOTCOM-CTO > 0                                                 
192185           PERFORM 60012000-GEN-REPCOMI.                                      
192190                                                                              
192200*****************************************************************             
192500 60011010-VAL-COMIPEN.                                                        
192520     MOVE ZERO TO W77-IND-C W77-SW-NOHAY.                                     
192530     MOVE ZERO TO W77-TOTCOM-CTO.                                             
192540     MOVE ZERO TO W77-OTRCOM-CTO.                                             
192550     MOVE ZERO TO W77-CHQDEV-CTO.                                             
192560     PERFORM 60011030-BUSCA-COMIPEN  99 TIMES.                                
192570                                                                              
192580*****************************************************************             
192600 60011030-BUSCA-COMIPEN.                                                      
192610     ADD 1 TO W77-IND-C.                                                      
192615     IF B12-IMP-ACUMULADO(W77-IND-C) > 0                                      
192620        ADD B12-IMP-ACUMULADO(W77-IND-C) TO W77-TOTCOM-CTO                    
192625        IF NOT W88-IND-COM-ID                                                 
192630           ADD B12-IMP-ACUMULADO(W77-IND-C) TO W77-OTRCOM-CTO                 
192635        ELSE                                                                  
192640        IF W88-IND-CHQDEV                                                     
192645           ADD B12-IMP-ACUMULADO(W77-IND-C) TO W77-CHQDEV-CTO.                
192650                                                                              
192700****************************************************************              
192800 60012000-GEN-REPCOMI.                                                        
192810     MOVE B12-NUM-CONTRATO TO WS-NUM-CONTRATO.                                
192820     PERFORM 550003150-DAME-B03CTO.                                           
192830                                                                              
192840     IF W77-SW-NOHAY = 0                                                      
192850        PERFORM 60012020-ARMA-REP-02.                                         
192860                                                                              
192880****************************************************************              
193000 60012020-ARMA-REP-02.                                                        
193010     MOVE B03-SUC-PROMOTORA             TO WLI-R02-L08-NSUC.                  
193020     MOVE B03-NUM-PRODUCTO              TO WLI-R02-L08-PROD.                  
193030     MOVE B03-NUM-INSTRUM               TO WLI-R02-L08-INST.                  
193040     MOVE B03-MONEDA                    TO WLI-R02-L08-MONE.                  
193050     MOVE B03-NUM-CLIENTE               TO WLI-R02-L08-CLTE.                  
193060     MOVE B03-NUM-CONTRATO              TO WLI-R02-L08-CTO.                   
193070     MOVE B12-IMP-ACUMULADO(05)         TO WLI-R02-L08-MANCTA.                
193080     MOVE B12-IMP-ACUMULADO(50)         TO WLI-R02-L08-RENTA.                 
193090     MOVE B12-IMP-ACUMULADO(02)         TO WLI-R02-L08-CHQGIR.                
193100     MOVE W77-CHQDEV-CTO                TO WLI-R02-L08-CHQDEV.                
193110     MOVE W77-OTRCOM-CTO                TO WLI-R02-L08-OTRCOM.                
193120     MOVE W77-TOTCOM-CTO                TO WLI-R02-L08-TOTCOM.                
193125     MOVE B03-MESES-SINMOV              TO WLI-R02-L08-MESSM.                 
193130                                                                              
193140     PERFORM 60012100-ESC-REP-02.                                             
193150                                                                              
193160***************************************************************               
193200 60012100-ESC-REP-02.                                                         
193210     ADD 1    TO W77-LIN-R02.                                                 
193220                                                                              
193230     IF W77-LIN-R02 > 52                                                      
193240        PERFORM 60012120-ENCA-REP-02.                                         
193250                                                                              
193260     WRITE R02-L00-COMIPEND  FROM WLI-R02-L08-DETA AFTER 1.                   
193270     MOVE " "  TO  WLI-R02-L08-DETA.                                          
193280                                                                              
193300***************************************************************               
193400 60012120-ENCA-REP-02.                                                        
193450     ADD  1                        TO W77-PAG-R02.                            
193500     MOVE W77-PAG-R02              TO WLI-R00-L03-NPAG.                       
193550     MOVE "002COMIPEND"            TO WLI-R00-L01-NAME.                       
193600     MOVE WKS-TITULO-R02           TO WLI-R00-L02-TITULO.                     
193650     MOVE WKS-SUBTIT-R02           TO WLI-R00-L03-SBTIT.                      
193700     MOVE 3006                     TO WLI-R00-L04-SUC.                        
193750     MOVE "PRODUCTOS DE CAPTACION" TO WLI-R00-L05-NBSUC.                      
193800                                                                              
193850     WRITE R02-L00-COMIPEND FROM WLI-R00-L01-ENCA AFTER PAGE.                 
193900     WRITE R02-L00-COMIPEND FROM WLI-R00-L02-ENCA AFTER 1.                    
193950     WRITE R02-L00-COMIPEND FROM WLI-R00-L03-ENCA AFTER 1.                    
194000     WRITE R02-L00-COMIPEND FROM WLI-R00-L04-ENCA AFTER 1.                    
194050     WRITE R02-L00-COMIPEND FROM WLI-R00-L05-ENCA AFTER 1.                    
194100     WRITE R02-L00-COMIPEND FROM WLI-R02-L06-ENCA AFTER 2.                    
194150     MOVE  " "                TO R02-L00-COMIPEND.                            
194200     WRITE R02-L00-COMIPEND                       AFTER 1.                    
194250     MOVE 09 TO W77-LIN-R02.                                                  
194300                                                                              
194350******************************************************************            
194500                                                                              
195000 70000000-FIN-PROGRAMA.                                                       
195100     MOVE ZERO  TO W77-IND-REP.                                               
195200     PERFORM 70006000-ARMA-REPVACIOS 5 TIMES.                                 
195300                                                                              
195310     PERFORM 60012100-ESC-REP-02.                                             
195320     MOVE WLI-R00-L99-FIN  TO WLI-R02-L08-DETA.                               
195340     PERFORM 60012100-ESC-REP-02.                                             
195360     CLOSE R02-COMIPEND WITH SAVE.                                            
195400                                                                              
195500*********************************************************                     
195600 70006000-ARMA-REPVACIOS.                                                     
195700     ADD 1    TO W77-IND-REP.                                                 
195800     IF W77-MY-CSI = 10                                                       
195900        MOVE WKS-QNODO-VDM(W77-IND-REP)  TO W77-NODO-ANT                      
196000     ELSE                                                                     
196100        MOVE WKS-QNODO-MTY(W77-IND-REP)  TO W77-NODO-ANT.                     
196200                                                                              
196300     IF WKS-GEN-REP1(W77-IND-REP) = 0                                         
196400        PERFORM 50009000-ABRE-REP-01                                          
196500        PERFORM 50008400-CORTE-NODO                                           
196600        PERFORM 50009300-CIERRA-REP-01.                                       
196700                                                                              
196800**********************************************************                    
196900 90000000-INCLUDE       SECTION.                                              
197000*****************************************************                         
197100 COPY "S500/INC/PRO/25MTP002".                                                
197200 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
197300****************************************************                          
