100100$SET LIST$                                                                    
100200$SUPRESS                                                                      
100400$SET ERRORLIST                                                                
100500*$SET LIST STACK XREF LINEINFO FREE                                           
100600$SET LIST STACK  LINEINFO FREE                                                
100700$ERRORLIMIT = 1000                                                            
100800*****************************************************************             
100900*        PARA MANEJO DE INCLUDE  BASE DE DATOS                  *             
101000*****************************************************************             
101100$SET BDB00R01 BDB00R03 BDB00R04 S000LIBLJ                                     
101120$SET BDB00R22 BDB00R23                                                        
101200$SET BDB02R01 BDB02R02 BDB02R03                                               
101300$SET BDB03R05 BDB03R08 BDB03R12                                               
101400$SET BDB05R02                                                                 
101500$SET BDB06R06 BDB06R11                                                        
101700$SET BDB09R06 BDB09R10 BDB09R03                                               
101800$SET BDB14R03 BDB14R05 BDB14R09                                               
101900$SET BDB17R02 BDB17R06                                                        
102000$SET BDB22R05 BDB22R01                                                        
102100$SET BDB91                                                                    
102200*****************************************************************             
102300*        PARA INCLUDE MANEJO DE LIBRERIAS                       *             
102400*****************************************************************             
102500$SET S100VERSIONES                                                            
102600$SET SYSTEMLIBCOMSXATMI                                                       
102700$SET S006LOCSUP                                                               
102750$SET S151REGISTRA S151REGISTRA2                                               
102800*$SET S151REGISTRA S151REGISTRA1                                              
102900$SET S408LINCRED   S080IVA                                                    
103100$SET FECHA2000                                                                
103110$SET LIBMAPLI                                                                 
103125$SET MAPLIACTLIB015 MAPLIACTLIB049                                            
103126$SET MAPLIACTLIB052 MAPLIACTLIB053                                            
103127$SET HOSTNAME                                                                 
103200***************************************************************               
103300*    PARA INCLUDE  PROCESO BATCH                              *               
103400***************************************************************               
103500                                                                              
103600$RESET LIST$                                                                  
103700*****************************************************************             
103800* P102  P102  P102  P102  P102  P102  P102  P102                *             
103900*****************************************************************             
104000* FUNCIONES PRINCIPALES:                                        *             
104100* - EFECTUAR PAGOS PENDIENTES A L.C.(S408)                      *             
104200*   B02-PGOPEND-S408 = 1                                        *             
104300*                                                               *             
104400* - ACTUALIZACION DE DATA SET B09 Y B14 CON LOS                 *             
104500*   MOVIMIENTOS GENERADOS                                       *             
105000*                                                               *             
105100* - FIN DE DIA AL (S408) PARA INICIO DE SU BATCH.               *             
105200*                                                               *             
105300* - INICIALIZACION DE CAMPOS:                                   *             
105400*   B02-PGOPEND-S408 = 0                                        *             
105500*   B02-HAY-ST2113   = 0                                        *             
105520*                                                               *             
105540* - GENERACION DE ARCHIVO POR PROTECCI¿N DE COBROS:             *             
105560*   S500/FILE/INTE/50002E01/XX/AAAAMMDD/PROTCOBR                *             
105580*                                                               *             
105600*                                                               *             
105700*****************************************************************             
105800 IDENTIFICATION DIVISION.                                                     
105900 PROGRAM-ID.    P102.                                                         
106000 AUTHOR.        JOSE LUIS IBARRA LARA.                                        
106100 DATE-WRITTEN.  JULIO/2002.                                                   
106200 INSTALLATION.                                                                
106300 SECURITY.                                                                    
106400 ENVIRONMENT DIVISION.                                                        
106500 CONFIGURATION SECTION.                                                       
106600 SOURCE-COMPUTER.   SERIES-A.                                                 
106700 OBJECT-COMPUTER.   SERIES-A.                                                 
106800 INPUT-OUTPUT  SECTION.                                                       
106900 FILE-CONTROL.                                                                
107200     SELECT  I02-PUNTEOOUT       ASSIGN  TO DISK.                             
107210                                                                              
107220     SELECT  I03-TRASPBENEF      ASSIGN  TO DISK                              
107240             ACCESS MODE  IS RANDOM                                           
107260             ACTUAL KEY   IS W77-KEY-I03.                                     
107272                                                                              
107275     SELECT  I04-DISP-P010       ASSIGN  TO DISK.                             
107280     SELECT  I05-ARCHB22         ASSIGN  TO DISK.                             
107285                                                                              
107300     SELECT  R01-MENSAJES        ASSIGN  TO PRINTER.                          
107320     SELECT  R02-TRPBENEF        ASSIGN  TO PRINTER.                          
107400                                                                              
107500************************************************************                  
107600 DATA DIVISION.                                                               
107700 FILE SECTION.                                                                
107800*****************************************************************             
107810 FD  I04-DISP-P010                                                            
107815     BLOCK   CONTAINS   180 RECORDS                                           
107820     RECORD  CONTAINS   226 CHARACTERS                                        
107825     VALUE OF                                                                 
107830             AREAS         IS 1000                                            
107835             AREASIZE      IS 2400                                            
107840                 SECURITYTYPE  IS PUBLIC                                      
107845                 TITLE         IS WKS-TIT-I04-P010.                           
107850                                                                              
107860 01  I04-FD-DISP-P010   PIC X(226).                                           
107865                                                                              
107870************************************************************                  
107875 FD  I05-ARCHB22                                                              
107880     BLOCK   CONTAINS    30 RECORDS                                           
107885     RECORD  CONTAINS   144 CHARACTERS                                        
107890     VALUE OF                                                                 
107895             AREAS         IS 1000                                            
107900             AREASIZE      IS 2400                                            
107905                 SECURITYTYPE  IS PUBLIC                                      
107910                 TITLE         IS WKS-TIT-I05-ARCHB22.                        
107915                                                                              
107920 01  I05-FD-ARCHB22     PIC X(144).                                           
107925                                                                              
109500************************************************************                  
110500**************************************************************                
110600 FD  I02-PUNTEOOUT                                                            
110700     BLOCK   CONTAINS   300 RECORDS                                           
110800     RECORD  CONTAINS    60 CHARACTERS                                        
110900     VALUE OF                                                                 
111000             AREAS        IS 1000                                             
111100             AREASIZE     IS 7200                                             
111200             SECURITYTYPE IS PUBLIC                                           
111300             TITLE        IS WKS-TIT-PUNTEOOUT.                               
111400                                                                              
111500 01  I02-R00-PUNTEOOUT   PIC X(60).                                           
111600                                                                              
111700*************************************************************                 
111800 FD  R01-MENSAJES.                                                            
111900 01  R01-L00-MENSAJE     PIC X(132).                                          
111910                                                                              
111920*****************************************************                         
111922 FD  I03-TRASPBENEF                                                           
111924     BLOCK   CONTAINS   360 RECORDS                                           
111926     RECORD  CONTAINS    67 CHARACTERS                                        
111928     VALUE OF                                                                 
111930             TITLE        IS WKS-TIT-TRASPBENF.                               
111932                                                                              
111934 01  I03-R00-TRASBENEF   PIC X(67).                                           
111940                                                                              
111950*********************************************************                     
111960 FD  R02-TRPBENEF.                                                            
111962 01  R02-L00-TRPBENEF    PIC X(132).                                          
111970                                                                              
112000                                                                              
112100***********************************************************                   
112200 DATA-BASE SECTION.                                                           
112300 DB  S500BD01CAPTACION.                                                       
112320 01  S500B00CTRLPASO.                                                         
112400 01  S500B02CONTROL.                                                          
112500 01  S500B03CONTRATOS.                                                        
112600 01  S500B05INSTRUMEN.                                                        
112700 01  S500B06HISTORICO.                                                        
112900 01  S500B09CIFRAS.                                                           
113000 01  S500B14TOTCVES.                                                          
113100 01  S500B17CVESXFUN.                                                         
113200 01  S500B22ESQCONT.                                                          
113300 01  S500B91REINICIO.                                                         
113400                                                                              
113500*************************************************************                 
113600 WORKING-STORAGE SECTION.                                                     
113610***************** CAMPOS PARA LIB/MAPLI  *********************                
113620 77 W77-DATASET-E           PIC 9(04).                                        
113650 77 W77-ID-ACT01-MAPLI      PIC 9(04).                                        
113652 77 W77-ID-ACT02-MAPLI      PIC 9(04).                                        
113654 77 W77-ID-ACT03-MAPLI      PIC 9(04).                                        
113656 77 W77-ID-ACT04-MAPLI      PIC 9(04).                                        
113680 77 W77-ERR-L035-MAPLI      PIC 9(01)    VALUE 0.                             
113685 77 W77-ERR-LOCSUP          PIC 9(01)    VALUE 0.                             
113686 77 W77-LIN-ERR             PIC 9(06)    VALUE 0.                             
113687 77 W77-ES-FUNC20           PIC 9(01)    VALUE 0.                             
113700 77  W77-TOT-DISKSIZE            PIC 9(08).                                   
113800 77  W77-TOT-MEMSIZE             PIC 9(08).                                   
113900 77  W77-RS-XATMI                PIC 9(12)-.                                  
114000 77  W77-RS-DIV                  PIC 9(08).                                   
114100 77  W77-ES-BISIESTO             PIC 9(04).                                   
114200 77  W77-FECHA-EDIT              PIC 9999/99/99.                              
114300 77  W77-FECHA-EDIT2             PIC 9999/99/99.                              
114400                                                                              
114500 77  W77-IMP-EDIT                PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                     
114600 77  W77-IMP-EDIT1               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                     
114700 77  W77-IMP-EDIT2               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                     
114800 77  W77-IMP-EDIT3               PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.                     
114870                                                                              
114876 77  W77-BAN-REGS                PIC 9(01)   VALUE 0.                         
114878 77  W77-NUMREG-B03              PIC 9(08)   VALUE 0.                         
114880 77  W77-NUMREG-CPY-1            PIC 9(08)   VALUE 0.                         
114882 77  W77-NUMREG-CPY-2            PIC 9(08)   VALUE 0.                         
114884 77  W77-NUMREG-CPY-3            PIC 9(08)   VALUE 0.                         
114890 77  W77-NUMCTO-CPY-1            PIC 9(12)   VALUE 0.                         
114892 77  W77-NUMCTO-CPY-2            PIC 9(12)   VALUE 0.                         
114894 77  W77-NUMCTO-CPY-3            PIC 9(12)   VALUE 0.                         
114898                                                                              
114900 77  WS-IND-INST                 PIC 9(04)      COMP   VALUE 0.               
115000 77  W77-SEC-ESQCONT             PIC 9(04)      COMP.                         
115100 77  W77-SET-MAXCARDS            PIC 9(02)      COMP   VALUE 9.               
115300 77  W77-ES-PRODUCCION           PIC 9(02)      COMP   VALUE 0.               
115310 77  W77-ES-UAT                  PIC 9(02)      COMP   VALUE 0.               
115320 77  W77-ES-DESARROLLO           PIC 9(02)      COMP   VALUE 0.               
115400 77  W77-SI-PROCESO              PIC 9(02)      COMP   VALUE 0.               
115500 77  W77-TOT-B03-CTOS            PIC 9(08)      COMP   VALUE 0.               
115600 77  W77-TOT-B03-SELEC           PIC 9(08)      COMP   VALUE 0.               
115700 77  W77-TOT-B03-STORE           PIC 9(08)      COMP   VALUE 0.               
115800 77  W77-TOT-B06-STORE           PIC 9(08)      COMP   VALUE 0.               
115900 77  W77-CALLS-S408              PIC 9(08)      COMP   VALUE 0.               
116000 77  W77-SW-S408                 PIC 9(02)      COMP   VALUE 0.               
116100 77  W77-CALL-S408-FAL           PIC 9(04)      COMP   VALUE 0.               
116400 77  W77-HAY-PAGOLC              PIC 9(02)      COMP   VALUE 0.               
116600 77  W77-HAY-MOVBATCH            PIC 9(02)      COMP   VALUE 0.               
116700 77  W77-HAY-SDO-PEND            PIC 9(02)      COMP   VALUE 0.               
116800 77  W77-MY-CSI                  PIC 9(02)      COMP.                         
116900 77  W77-MY-PASO                 PIC 9(04)      COMP.                         
117000 77  W77-MY-AUTORIZ              PIC 9(08)      COMP.                         
117100 77  W77-AUT-S151                PIC 9(08)      COMP   VALUE 0.               
117200 77  W77-NUM-MIX                 PIC 9(07)      COMP.                         
117300 77  W77-CAJA-PUENTE             PIC 9(02)      COMP   VALUE 0.               
117400 77  W77-EOF-CVES-VAL            PIC 9(02)      COMP   VALUE 0.               
117500 77  W77-EOF-B03                 PIC 9(02)      COMP   VALUE 0.               
117600 77  W77-EOF-B05                 PIC 9(02)      COMP   VALUE 0.               
117610 77  W77-EOF-B22                 PIC 9(02)      COMP   VALUE 0.               
117620 77  W77-FIN-B09                 PIC 9(02)      COMP   VALUE 0.               
117800 77  W77-EOF-I01                 PIC 9(02)      COMP   VALUE 0.               
117810 77  W77-EOF-I03                 PIC 9(02)      COMP   VALUE 0.               
117820 77  W77-HAY-ARCH-BENEF          PIC 9(02)      COMP   VALUE 0.               
117830 77  W77-KEY-I03                 PIC 9(08)      COMP   VALUE 0.               
117832 77  W77-LAST-I03                PIC 9(08)      COMP   VALUE 0.               
117834 77  W77-HEAD-I03-OK             PIC 9(02)      COMP   VALUE 0.               
117836 77  W77-REG-TPO3                PIC 9(08)      COMP   VALUE 0.               
117838 77  W77-TPO-ERR                 PIC 9(02)      COMP   VALUE 0.               
117839 88  W88-TPO-ERR-NB03            VALUE 01,02,03,04,10.                        
117840 77  W77-TPO-ACEPT               PIC 9(02)      COMP   VALUE 0.               
117842 77  W77-STA-ANT                 PIC 9(02)      COMP   VALUE 0.               
117844 77  W77-LEIDOS-I03              PIC 9(08)      COMP   VALUE 0.               
117846 77  W77-RECHAZO-I03             PIC 9(08)      COMP   VALUE 0.               
117848 77  W77-ACEPTA-I03              PIC 9(08)      COMP   VALUE 0.               
117850 77  W77-SI-DESBLOQUEO           PIC 9(01)      COMP   VALUE 0.               
117860 77  W77-STOR-B03-ANT            PIC 9(08)      COMP   VALUE 0.               
117900 77  W77-SAME-ANT                PIC 9(02)      COMP   VALUE 0.               
118000 77  W77-SECTOR-ANT              PIC 9(02)      COMP   VALUE 99.              
118400 77  W77-R01-NPAG                PIC 9(06)      COMP   VALUE 0.               
118410 77  W77-R02-NPAG                PIC 9(06)      COMP   VALUE 0.               
118500 77  W77-R01-NLIN                PIC 9(02)      COMP   VALUE 70.              
118510 77  W77-R02-NLIN                PIC 9(02)      COMP   VALUE 70.              
118520 77  W77-OPEN-R01                PIC 9(02)      COMP   VALUE 0.               
118600 77  W77-DATO-ADD-151            PIC 9(02)      COMP  VALUE 0.                
118700 77  W77-CVE-COMUN               PIC 9(04)      COMP.                         
118800 77  W77-IMP-COMUN               PIC 9(14)V99   COMP.                         
118900                                                                              
118910 01  WKS-HORA-EDIT-P.                                                         
118920     02 WKS-HH-EDIT-P       PIC 99.                                           
118930     02 FILLER              PIC X   VALUE ":".                                
118940     02 WKS-MM-EDIT-P       PIC 99.                                           
118950     02 FILLER              PIC X   VALUE ":".                                
118960     02 WKS-SS-EDIT-P       PIC 99.                                           
118970     02 FILLER              PIC X   VALUE ":".                                
118980     02 WKS-DD-EDIT-P       PIC 99.                                           
118990                                                                              
119000 01  WKS-LEY-ADICIONAL.                                                       
119100     02 WKS-LEY-DAT-POR          PIC X(05).                                   
119200     02 WKS-LEY-ADIC-IMP         PIC ZZ,ZZZ,ZZ9.99.                           
119300     02 FILLER                   PIC X(02).                                   
119400     02 WKS-LEY-DAT-MASIVA       PIC X(20).                                   
119500 01  RD-WKS-LEY-ADICIONAL        REDEFINES WKS-LEY-ADICIONAL.                 
119600     02 WKS-LEY-REF-01           PIC 9(10).                                   
119700     02 WKS-LEY-REF-02           PIC 9(10).                                   
119800     02 FILLER                   PIC X(20).                                   
119900                                                                              
120000*******************************************************                       
120100*01  WKS-NAME-HOST.                                                           
120200*    02 WKS-MY-HOST         PIC X(20).                                        
120300*    02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
120400*       04 WKS-MY-HOST-03   PIC X(04).                                        
120500*       04 WKS-MY-HOST-17   PIC X(16).                                        
120600*                                                                             
120700*************************************************************                 
120800  01  WKS-VAR-TASKVALUE.                                                      
120900      02 WKS-TASKVALUE-PBA    PIC 9(04).                                      
121000      02 RD-WKS-TASKVALUE-PBA REDEFINES WKS-TASKVALUE-PBA.                    
121100         04 WKS-CON-LCPEND    PIC 9(01).                                      
121200         04 WKS-CON-ST2113    PIC 9(01).                                      
121300         04 WKS-SIN-LBS408    PIC 9(01).                                      
121400         04 WKS-SIN-LBS151    PIC 9(01).                                      
121600                                                                              
121700***************************************************************               
121800* LINEA DE MENSAJE DE ESTADISTICAS (EN HI )                                   
121900***************************************************************               
122000 01  WKS-HI-TEXTO.                                                            
122100     02 WKS-HI-TEX00         PIC X(03) VALUE "HI=".                           
122200     02 WKS-HI-NUMHI         PIC 9(03).                                       
122300     02 WKS-HI-DETALLE.                                                       
122400        04 WKS-HI-TEX01      PIC X(06).                                       
122500        04 WKS-HI-TEX02      PIC X(08).                                       
122600        04 WKS-HI-LEIDOS     PIC 9(07).                                       
122700        04 WKS-HI-TEX04      PIC X(05).                                       
122800        04 WKS-HI-REGSEL     PIC 9(07).                                       
122900        04 WKS-HI-TEX05      PIC X(06).                                       
123000        04 WKS-HI-NUMCALL    PIC 9(07).                                       
123100                                                                              
123200**************************************************************                
123300 01  WS-TB-INST.                                                              
123400     02 TB-B05-OCC-INST           OCCURS 30 TIMES.                            
123500        04 TB-B05INSTRUMEN.                                                   
123600           06 TB-B05-PROD         PIC 9(04)   COMP.                           
123700           06 TB-B05-INST         PIC 9(04)   COMP.                           
123800           06 TB-B05-MONEDA       PIC 9(03)   COMP.                           
123810           06 TB-B05-IND-BENEF    PIC 9(01)   COMP.                           
123900                                                                              
124000**********************************************************                    
124100 01  WKS-TABLA-DIASEM.                                                        
124200     02 FILLER                   PIC X(10) VALUE "DOMINGO   ".                
124300     02 FILLER                   PIC X(10) VALUE "LUNES     ".                
124400     02 FILLER                   PIC X(10) VALUE "MARTES    ".                
124500     02 FILLER                   PIC X(10) VALUE "MIERCOLES ".                
124600     02 FILLER                   PIC X(10) VALUE "JUEVES    ".                
124700     02 FILLER                   PIC X(10) VALUE "VIERNES   ".                
124800     02 FILLER                   PIC X(10) VALUE "SABADO    ".                
124900 01  WKS-RD-TABLA-DIASEM         REDEFINES WKS-TABLA-DIASEM.                  
125000     02 WKS-TAB-QDIASEM          PIC X(10) OCCURS 7 TIMES.                    
125100***************************************************************               
125200 01  WKS-TABLA-NUM-DIAS.                                                      
125300     02 FILLER                   PIC X(12) VALUE "312831303130".              
125400     02 FILLER                   PIC X(12) VALUE "313130313031".              
125500 01  WKS-RD-TABLA-NUM-DIAS       REDEFINES WKS-TABLA-NUM-DIAS.                
125600     02 WKS-TAB-DIAS-MES         PIC 99    OCCURS 12.                         
125700                                                                              
125800**************************************************************                
125900 01  WKS-TABLA-NOM-MES.                                                       
126000     02 FILLER                   PIC X(10) VALUE "ENERO     ".                
126100     02 FILLER                   PIC X(10) VALUE "FEBRERO   ".                
126200     02 FILLER                   PIC X(10) VALUE "MARZO     ".                
126300     02 FILLER                   PIC X(10) VALUE "ABRIL     ".                
126400     02 FILLER                   PIC X(10) VALUE "MAYO      ".                
126500     02 FILLER                   PIC X(10) VALUE "JUNIO     ".                
126600     02 FILLER                   PIC X(10) VALUE "JULIO     ".                
126700     02 FILLER                   PIC X(10) VALUE "AGOSTO    ".                
126800     02 FILLER                   PIC X(10) VALUE "SEPTIEMBRE".                
126900     02 FILLER                   PIC X(10) VALUE "OCTUBRE   ".                
127000     02 FILLER                   PIC X(10) VALUE "NOVIEMBRE ".                
127100     02 FILLER                   PIC X(10) VALUE "DICIEMBRE ".                
127200 01  WKS-RD-TABLA-NOM-MES        REDEFINES WKS-TABLA-NOM-MES.                 
127300     02 WKS-TAB-NOM-MES          OCCURS 12 TIMES.                             
127400        04 WKS-TB-MES-03         PIC X(03).                                   
127500        04 FILLER                PIC X(07).                                   
127550                                                                              
127600********************************************************                      
127605 01  WKS-TAB-ERROR-B.                                                         
127610     02 WS-ERROR-01 PIC X(25) VALUE "ERR TIPO DE REGISTRO     ".              
127615     02 WS-ERROR-02 PIC X(25) VALUE "ERR CALIFICACION ARCHIVO ".              
127620     02 WS-ERROR-03 PIC X(25) VALUE "ERR CTO > 12 DIGITOS     ".              
127625     02 WS-ERROR-04 PIC X(25) VALUE "*** NO EXISTE EN LA BASE ".              
127630     02 WS-ERROR-05 PIC X(25) VALUE "ERR CALIF ARCH NO ES 5   ".              
127635     02 WS-ERROR-06 PIC X(25) VALUE "ERR CALIF ARCH NO ES 1   ".              
127640     02 WS-ERROR-07 PIC X(25) VALUE "ERR NO ACEPTA ESTA CALIF ".              
127645     02 WS-ERROR-08 PIC X(25) VALUE "ERR PROD-INST-MONEDA B03 ".              
127650     02 WS-ERROR-09 PIC X(25) VALUE "ERR CONTRATO BLOQUEADO   ".              
127655     02 WS-ERROR-10 PIC X(25) VALUE "ERR FECHA A PLANCHAR     ".              
127657     02 WS-ERROR-11 PIC X(25) VALUE "CONTRATO EXTENDED NETWORK".              
127660                                                                              
127665 01  WKS-TAB-ERROR-B-RD REDEFINES  WKS-TAB-ERROR-B.                           
127670     02 WS-ERR-TB-BEBEF PIC X(25)  OCCURS 11 TIMES.                           
127680                                                                              
127700***************************************************************               
127800 01  WKS-FECPROC-EDIT.                                                        
127900     02 WKS-DD-FPRC-EDIT    PIC 99.                                           
128000     02 FILLER              PIC X       VALUE "/".                            
128100     02 WKS-MM-FPRC-EDIT    PIC X(03).                                        
128200     02 FILLER              PIC X       VALUE "/".                            
128300     02 WKS-AAAA-FPRC-EDIT  PIC 9(04).                                        
128400                                                                              
128500 01  WKS-FECMAQ-EDIT.                                                         
128600     02 WKS-DD-FMAQ-EDIT    PIC 99.                                           
128700     02 FILLER              PIC X       VALUE "/".                            
128800     02 WKS-MM-FMAQ-EDIT    PIC X(03).                                        
128900     02 FILLER              PIC X       VALUE "/".                            
129000     02 WKS-AAAA-FMAQ-EDIT  PIC 9(04).                                        
129100                                                                              
129200****************************************************************              
130600***********************************************************                   
130700 01  WKS-TABLA-CVES-VALIDAS.                                                  
130800     02 WKS-TAB-CVES-VALIDAS     OCCURS 2000 TIMES.                           
130900        04 WKS-TAB-CVEVAL        PIC 9(04)   COMP.                            
131000        04 WKS-TAB-CVE-ACT-SDO   PIC 9(02)   COMP.                            
131100                                                                              
131200**************************************************************                
131300 01 WKS-TOTAL-CVES-01.                                                        
131320    02 WKS-TCVES-INST-01         OCCURS  30   TIMES.                          
131340       04 WKS-HAY-CLAVES-01      PIC 99        COMP.                          
131360       04 WKS-TCVES-CVES-01      OCCURS 100   TIMES.                          
131380          06 WKS-TCVE-01-IMP     PIC 9(12)V99  COMP.                          
131400          06 WKS-TCVE-01-NUM     PIC 9(06)     COMP.                          
131420          06 WKS-TCVE-01-CVE     PIC 9(04)     COMP.                          
131440                                                                              
131460 01 WKS-TOTAL-CVES-02.                                                        
131480    02 WKS-TCVES-INST-02         OCCURS  30   TIMES.                          
131500       04 WKS-HAY-CLAVES-02      PIC 99        COMP.                          
131520       04 WKS-TCVES-CVES-02      OCCURS 100   TIMES.                          
131540          06 WKS-TCVE-02-IMP     PIC 9(12)V99  COMP.                          
131560          06 WKS-TCVE-02-NUM     PIC 9(06)     COMP.                          
131580          06 WKS-TCVE-02-CVE     PIC 9(04)     COMP.                          
131600                                                                              
131620 01 WKS-TOTAL-CVES-03.                                                        
131640    02 WKS-TCVES-INST-03         OCCURS  30   TIMES.                          
131660       04 WKS-HAY-CLAVES-03      PIC 99        COMP.                          
131680       04 WKS-TCVES-CVES-03      OCCURS 100   TIMES.                          
131700          06 WKS-TCVE-03-IMP     PIC 9(12)V99  COMP.                          
131720          06 WKS-TCVE-03-NUM     PIC 9(06)     COMP.                          
131740          06 WKS-TCVE-03-CVE     PIC 9(04)     COMP.                          
131760                                                                              
131780 01 WKS-TOTAL-CVES-04.                                                        
131800    02 WKS-TCVES-INST-04         OCCURS  30   TIMES.                          
131820       04 WKS-HAY-CLAVES-04      PIC 99        COMP.                          
131840       04 WKS-TCVES-CVES-04      OCCURS 100   TIMES.                          
131860          06 WKS-TCVE-04-IMP     PIC 9(12)V99  COMP.                          
131880          06 WKS-TCVE-04-NUM     PIC 9(06)     COMP.                          
131900          06 WKS-TCVE-04-CVE     PIC 9(04)     COMP.                          
131920                                                                              
131940 01 WKS-TOTAL-CVES-05.                                                        
131960    02 WKS-TCVES-INST-05         OCCURS  30   TIMES.                          
131980       04 WKS-HAY-CLAVES-05      PIC 99        COMP.                          
132000       04 WKS-TCVES-CVES-05      OCCURS 100   TIMES.                          
132020          06 WKS-TCVE-05-IMP     PIC 9(12)V99  COMP.                          
132040          06 WKS-TCVE-05-NUM     PIC 9(06)     COMP.                          
132060          06 WKS-TCVE-05-CVE     PIC 9(04)     COMP.                          
132080                                                                              
132100 01 WKS-TOTAL-CVES-06.                                                        
132120    02 WKS-TCVES-INST-06         OCCURS  30   TIMES.                          
132140       04 WKS-HAY-CLAVES-06      PIC 99        COMP.                          
132160       04 WKS-TCVES-CVES-06      OCCURS 100   TIMES.                          
132180          06 WKS-TCVE-06-IMP     PIC 9(12)V99  COMP.                          
132200          06 WKS-TCVE-06-NUM     PIC 9(06)     COMP.                          
132220          06 WKS-TCVE-06-CVE     PIC 9(04)     COMP.                          
132240                                                                              
132260 01 WKS-TOTAL-CVES-07.                                                        
132280    02 WKS-TCVES-INST-07         OCCURS  30   TIMES.                          
132300       04 WKS-HAY-CLAVES-07      PIC 99        COMP.                          
132320       04 WKS-TCVES-CVES-07      OCCURS 100   TIMES.                          
132340          06 WKS-TCVE-07-IMP     PIC 9(12)V99  COMP.                          
132360          06 WKS-TCVE-07-NUM     PIC 9(06)     COMP.                          
132380          06 WKS-TCVE-07-CVE     PIC 9(04)     COMP.                          
132400                                                                              
132420 01 WKS-TOTAL-CVES-08.                                                        
132440    02 WKS-TCVES-INST-08         OCCURS  30   TIMES.                          
132460       04 WKS-HAY-CLAVES-08      PIC 99        COMP.                          
132480       04 WKS-TCVES-CVES-08      OCCURS 100   TIMES.                          
132500          06 WKS-TCVE-08-IMP     PIC 9(12)V99  COMP.                          
132520          06 WKS-TCVE-08-NUM     PIC 9(06)     COMP.                          
132540          06 WKS-TCVE-08-CVE     PIC 9(04)     COMP.                          
132560                                                                              
132580 01 WKS-TOTAL-CVES-09.                                                        
132600    02 WKS-TCVES-INST-09         OCCURS  30   TIMES.                          
132620       04 WKS-HAY-CLAVES-09      PIC 99        COMP.                          
132640       04 WKS-TCVES-CVES-09      OCCURS 100   TIMES.                          
132660          06 WKS-TCVE-09-IMP     PIC 9(12)V99  COMP.                          
132680          06 WKS-TCVE-09-NUM     PIC 9(06)     COMP.                          
132700          06 WKS-TCVE-09-CVE     PIC 9(04)     COMP.                          
132720                                                                              
132740 01 WKS-TOTAL-CVES-10.                                                        
132760    02 WKS-TCVES-INST-10         OCCURS  30   TIMES.                          
132780       04 WKS-HAY-CLAVES-10      PIC 99        COMP.                          
132800       04 WKS-TCVES-CVES-10      OCCURS 100   TIMES.                          
132820          06 WKS-TCVE-10-IMP     PIC 9(12)V99  COMP.                          
132840          06 WKS-TCVE-10-NUM     PIC 9(06)     COMP.                          
132860          06 WKS-TCVE-10-CVE     PIC 9(04)     COMP.                          
132900                                                                              
132920 01 WKS-TOTAL-CVES-11.                                                        
132930    02 WKS-TCVES-INST-11         OCCURS  30   TIMES.                          
132940       04 WKS-HAY-CLAVES-11      PIC 99        COMP.                          
132950       04 WKS-TCVES-CVES-11      OCCURS 100   TIMES.                          
132960          06 WKS-TCVE-11-IMP     PIC 9(12)V99  COMP.                          
132970          06 WKS-TCVE-11-NUM     PIC 9(06)     COMP.                          
132980          06 WKS-TCVE-11-CVE     PIC 9(04)     COMP.                          
132990                                                                              
133000 01 WKS-TOTAL-CVES-12.                                                        
133010    02 WKS-TCVES-INST-12         OCCURS  30   TIMES.                          
133020       04 WKS-HAY-CLAVES-12      PIC 99        COMP.                          
133030       04 WKS-TCVES-CVES-12      OCCURS 100   TIMES.                          
133040          06 WKS-TCVE-12-IMP     PIC 9(12)V99  COMP.                          
133050          06 WKS-TCVE-12-NUM     PIC 9(06)     COMP.                          
133060          06 WKS-TCVE-12-CVE     PIC 9(04)     COMP.                          
133070                                                                              
133080 01 WKS-TOTAL-CVES-13.                                                        
133090    02 WKS-TCVES-INST-13         OCCURS  30   TIMES.                          
133100       04 WKS-HAY-CLAVES-13      PIC 99        COMP.                          
133110       04 WKS-TCVES-CVES-13      OCCURS 100   TIMES.                          
133120          06 WKS-TCVE-13-IMP     PIC 9(12)V99  COMP.                          
133130          06 WKS-TCVE-13-NUM     PIC 9(06)     COMP.                          
133140          06 WKS-TCVE-13-CVE     PIC 9(04)     COMP.                          
133150                                                                              
133160 01 WKS-TOTAL-CVES-14.                                                        
133170    02 WKS-TCVES-INST-14         OCCURS  30   TIMES.                          
133180       04 WKS-HAY-CLAVES-14      PIC 99        COMP.                          
133190       04 WKS-TCVES-CVES-14      OCCURS 100   TIMES.                          
133200          06 WKS-TCVE-14-IMP     PIC 9(12)V99  COMP.                          
133210          06 WKS-TCVE-14-NUM     PIC 9(06)     COMP.                          
133220          06 WKS-TCVE-14-CVE     PIC 9(04)     COMP.                          
133230                                                                              
133240 01 WKS-TOTAL-CVES-15.                                                        
133250    02 WKS-TCVES-INST-15         OCCURS  30   TIMES.                          
133260       04 WKS-HAY-CLAVES-15      PIC 99        COMP.                          
133270       04 WKS-TCVES-CVES-15      OCCURS 100   TIMES.                          
133280          06 WKS-TCVE-15-IMP     PIC 9(12)V99  COMP.                          
133290          06 WKS-TCVE-15-NUM     PIC 9(06)     COMP.                          
133300          06 WKS-TCVE-15-CVE     PIC 9(04)     COMP.                          
133310                                                                              
133320 01 WKS-TOTAL-CVES-16.                                                        
133330    02 WKS-TCVES-INST-16         OCCURS  30   TIMES.                          
133340       04 WKS-HAY-CLAVES-16      PIC 99        COMP.                          
133350       04 WKS-TCVES-CVES-16      OCCURS 100   TIMES.                          
133360          06 WKS-TCVE-16-IMP     PIC 9(12)V99  COMP.                          
133370          06 WKS-TCVE-16-NUM     PIC 9(06)     COMP.                          
133380          06 WKS-TCVE-16-CVE     PIC 9(04)     COMP.                          
133390                                                                              
133400 01 WKS-TOTAL-CVES-17.                                                        
133410    02 WKS-TCVES-INST-17         OCCURS  30   TIMES.                          
133420       04 WKS-HAY-CLAVES-17      PIC 99        COMP.                          
133430       04 WKS-TCVES-CVES-17      OCCURS 100   TIMES.                          
133440          06 WKS-TCVE-17-IMP     PIC 9(12)V99  COMP.                          
133450          06 WKS-TCVE-17-NUM     PIC 9(06)     COMP.                          
133460          06 WKS-TCVE-17-CVE     PIC 9(04)     COMP.                          
133470                                                                              
133480 01 WKS-TOTAL-CVES-18.                                                        
133490    02 WKS-TCVES-INST-18         OCCURS  30   TIMES.                          
133500       04 WKS-HAY-CLAVES-18      PIC 99        COMP.                          
133510       04 WKS-TCVES-CVES-18      OCCURS 100   TIMES.                          
133520          06 WKS-TCVE-18-IMP     PIC 9(12)V99  COMP.                          
133530          06 WKS-TCVE-18-NUM     PIC 9(06)     COMP.                          
133540          06 WKS-TCVE-18-CVE     PIC 9(04)     COMP.                          
133550                                                                              
133560 01 WKS-TOTAL-CVES-19.                                                        
133570    02 WKS-TCVES-INST-19         OCCURS  30   TIMES.                          
133580       04 WKS-HAY-CLAVES-19      PIC 99        COMP.                          
133590       04 WKS-TCVES-CVES-19      OCCURS 100   TIMES.                          
133600          06 WKS-TCVE-19-IMP     PIC 9(12)V99  COMP.                          
133610          06 WKS-TCVE-19-NUM     PIC 9(06)     COMP.                          
133620          06 WKS-TCVE-19-CVE     PIC 9(04)     COMP.                          
133630                                                                              
133640 01 WKS-TOTAL-CVES-20.                                                        
133650    02 WKS-TCVES-INST-20         OCCURS  30   TIMES.                          
133660       04 WKS-HAY-CLAVES-20      PIC 99        COMP.                          
133670       04 WKS-TCVES-CVES-20      OCCURS 100   TIMES.                          
133680          06 WKS-TCVE-20-IMP     PIC 9(12)V99  COMP.                          
133690          06 WKS-TCVE-20-NUM     PIC 9(06)     COMP.                          
133700          06 WKS-TCVE-20-CVE     PIC 9(04)     COMP.                          
139200                                                                              
139300 01 WKS-TOTAL-CVES-99.                                                        
139400    02 WKS-TCVES-INST-99         OCCURS  30   TIMES.                          
139500       04 WKS-HAY-CLAVES-99      PIC 99        COMP.                          
139600       04 WKS-TCVES-CVES-99      OCCURS 100   TIMES.                          
139700          06 WKS-TCVE-99-IMP     PIC 9(12)V99  COMP.                          
139800          06 WKS-TCVE-99-NUM     PIC 9(06)     COMP.                          
139900          06 WKS-TCVE-99-CVE     PIC 9(04)     COMP.                          
140000                                                                              
140100***************************************************************               
140200 01  WKS-VARIABLES-INDICES.                                                   
140300     02 WKS-SI-B00               PIC 9(02)      COMP    VALUE 0.              
140400     02 WKS-SI-B03               PIC 9(02)      COMP    VALUE 0.              
140500     02 WKS-SI-B06               PIC 9(02)      COMP    VALUE 0.              
140510     02 WKS-SIN-B03              PIC 9(02)      COMP    VALUE 0.              
140600     02 WKS-IND-A                PIC 9(04)      COMP.                         
140700     02 WKS-IND-B                PIC 9(04)      COMP.                         
140800     02 WKS-IND-C                PIC 9(04)      COMP.                         
140900     02 WKS-HAY-CVE              PIC 9(02)      COMP.                         
141000     02 WKS-IND-99               PIC 9(04)      COMP.                         
141100     02 WKS-IND-MOV              PIC 9(04)      COMP.                         
141200     02 WKS-IND-TBCVE            PIC 9(04)      COMP.                         
141300     02 WKS-IND-MXCVE            PIC 9(04)      COMP.                         
141400     02 WKS-IND-TOT              PIC 9(04)      COMP.                         
141500     02 WKS-INST-MEM             PIC 9(04)      COMP  VALUE 0.                
141600     02 WKS-IND-ESQ              PIC 9(04)     COMP.                          
141700     02 WKS-HAY-ESQ              PIC 9(02)     COMP.                          
141800     02 WKS-ESQ-CONTABLE         PIC 9(04)     COMP.                          
141810                                                                              
141820     02 WKS-AUT-P010             PIC 9(08).                                   
141822     02 RD-WKS-AUT-P010          REDEFINES  WKS-AUT-P010.                     
141824        04 WKS-AUT-DIA           PIC 9(02).                                   
141826        04 WKS-AUT-SEQ           PIC 9(06).                                   
141830                                                                              
141900                                                                              
142000 01  WKS-VARIABLES-FECHAS.                                                    
142100     02 WKS-TIME-OPEN-BD         PIC 9(08)      COMP.                         
142110     02 RD-WKS-TIME-OPEN-BD      REDEFINES WKS-TIME-OPEN-BD.                  
142120        04 WKS-HH-OPEN-BD        PIC 9(02)      COMP.                         
142130        04 WKS-MM-OPEN-BD        PIC 9(02)      COMP.                         
142140        04 WKS-SS-OPEN-BD        PIC 9(02)      COMP.                         
142150        04 WKS-DD-OPEN-BD        PIC 9(02)      COMP.                         
142160                                                                              
142200     02 WKS-TIME-R01             PIC 9(08)      COMP.                         
142210     02 RD-WKS-TIME-R01          REDEFINES WKS-TIME-R01.                      
142220        04 WKS-HH-TIME-R01       PIC 9(02)      COMP.                         
142230        04 WKS-MM-TIME-R01       PIC 9(02)      COMP.                         
142240        04 WKS-SS-TIME-R01       PIC 9(02)      COMP.                         
142250        04 WKS-DD-TIME-R01       PIC 9(02)      COMP.                         
142300                                                                              
142400     02 WKS-TIME-MAQ-INI         PIC 9(08)      COMP.                         
142500     02 WKS-RD-TIME-MAQ-INI      REDEFINES WKS-TIME-MAQ-INI.                  
142600        04 WKS-HORA-MAQ-INI      PIC 9(06)      COMP.                         
142700        04 WKS-DSSS-MAQ-INI      PIC 9(02)      COMP.                         
142710     02 RD-WKS-TIME-MAQ-INI      REDEFINES WKS-TIME-MAQ-INI.                  
142720        04 WKS-HH-MAQ-INI        PIC 9(02)      COMP.                         
142730        04 WKS-MM-MAQ-INI        PIC 9(02)      COMP.                         
142740        04 WKS-SS-MAQ-INI        PIC 9(02)      COMP.                         
142750        04 WKS-DD-MAQ-INI        PIC 9(02)      COMP.                         
142800                                                                              
142900     02 WKS-TIME-MAQ-TEM         PIC 9(08)      COMP.                         
143000     02 WKS-RD-TIME-MAQ-TEM      REDEFINES WKS-TIME-MAQ-TEM.                  
143100        04 WKS-HORA-MAQ-TEM      PIC 9(06)      COMP.                         
143200        04 WKS-DSSS-MAQ-TEM      PIC 9(02)      COMP.                         
143210     02 RD-WKS-TIME-MAQ-TEM      REDEFINES WKS-TIME-MAQ-TEM.                  
143212        04 WKS-HH-MAQ-TEM        PIC 9(02)      COMP.                         
143214        04 WKS-MM-MAQ-TEM        PIC 9(02)      COMP.                         
143216        04 WKS-SS-MAQ-TEM        PIC 9(02)      COMP.                         
143218        04 WKS-DD-MAQ-TEM        PIC 9(02)      COMP.                         
143300                                                                              
143400     02 WS-TIME-MAQ            PIC 9(08)          COMP.                       
143500     02 RD-WS-TIME-MAQ         REDEFINES  WS-TIME-MAQ.                        
143600        04 WS-HORA-MAQ         PIC 9(06)          COMP.                       
143700        04 FILLER              PIC 9(02)          COMP.                       
143800                                                                              
143900     02 WKS-FEC-BASE             PIC 9(08)      COMP.                         
144000     02 WKS-RD1-FEC-BASE         REDEFINES WKS-FEC-BASE.                      
144100        04 WKS-AAAA-FBASE        PIC 9(04)      COMP.                         
144200        04 FILLER                PIC 9(04)      COMP.                         
144300     02 WKS-RD2-FEC-BASE         REDEFINES WKS-FEC-BASE.                      
144400        04 WKS-SS-FBASE          PIC 9(02)      COMP.                         
144500        04 WKS-FEC-BASE-06       PIC 9(06)      COMP.                         
144600        04 WKS-RD-FEC-BASE-06    REDEFINES WKS-FEC-BASE-06.                   
144700           06 WKS-AA-FBASE       PIC 9(02)      COMP.                         
144800           06 WKS-MM-FBASE       PIC 9(02)      COMP.                         
144900           06 WKS-DD-FBASE       PIC 9(02)      COMP.                         
145000                                                                              
145100     02 WKS-FEC-PROX             PIC 9(08)      COMP.                         
145200     02 WKS-RD1-FEC-PROX         REDEFINES WKS-FEC-PROX.                      
145300        04 WKS-AAAA-FPROX        PIC 9(04)      COMP.                         
145400        04 FILLER                PIC 9(04)      COMP.                         
145500     02 WKS-RD2-FEC-PROX         REDEFINES WKS-FEC-PROX.                      
145600        04 WKS-SS-FPROX          PIC 9(02)      COMP.                         
145700        04 WKS-FEC-PROX-06       PIC 9(06)      COMP.                         
145800        04 WKS-RD-FEC-PROX-06    REDEFINES WKS-FEC-PROX-06.                   
145900           06 WKS-AA-FPROX       PIC 9(02)      COMP.                         
146000           06 WKS-MM-FPROX       PIC 9(02)      COMP.                         
146100           06 WKS-DD-FPROX       PIC 9(02)      COMP.                         
146200                                                                              
146300     02 WKS-FEC-ANTE             PIC 9(08)      COMP.                         
146400     02 WKS-RD1-FEC-ANTE         REDEFINES WKS-FEC-ANTE.                      
146500        04 WKS-AAAA-FANTE        PIC 9(04)      COMP.                         
146600        04 FILLER                PIC 9(04)      COMP.                         
146700     02 WKS-RD2-FEC-ANTE         REDEFINES WKS-FEC-ANTE.                      
146800        04 WKS-SS-FANTE          PIC 9(02)      COMP.                         
146900        04 WKS-FEC-ANTE-06       PIC 9(06)      COMP.                         
147000        04 WKS-RD-FEC-ANTE-06    REDEFINES WKS-FEC-ANTE-06.                   
147100           06 WKS-AA-FANTE       PIC 9(02)      COMP.                         
147200           06 WKS-MM-FANTE       PIC 9(02)      COMP.                         
147300           06 WKS-DD-FANTE       PIC 9(02)      COMP.                         
147400                                                                              
147500     02 WKS-DIA-SEMHOY           PIC 9(02)      COMP.                         
147600     02 WKS-DIA-SEMPROX          PIC 9(02)      COMP.                         
147700     02 WKS-ES-SEMANAL           PIC 9(02)      COMP  VALUE 0.                
147800     02 WKS-ES-MENSUAL           PIC 9(02)      COMP  VALUE 0.                
147900     02 WKS-ES-INICIOMES         PIC 9(02)      COMP  VALUE 0.                
148000     02 WKS-ES-INIANH            PIC 9(02)      COMP  VALUE 0.                
148100                                                                              
148200 01  WKS-TOTAL-MOVTOS-S408.                                                   
148300     02 WKS-TOT-ABO-S408-LC      PIC S9(13)V99  COMP  VALUE 0.                
148400     02 WKS-TOT-ABO-S408-ST      PIC S9(13)V99  COMP  VALUE 0.                
148500                                                                              
148600                                                                              
148700 01  WKS-VARIABLES-IMPORTES.                                                  
148800     02 WKS-PAGO-S408            PIC S9(13)V99  COMP VALUE 0.                 
148900     02 WKS-PAGO-S408-LC         PIC S9(13)V99  COMP VALUE 0.                 
149000     02 WKS-PAGO-S408-ST         PIC S9(13)V99  COMP VALUE 0.                 
149100     02 WKS-DISPONIBLE-ANT       PIC 9(14)V99   COMP VALUE 0.                 
149200     02 WKS-SDO-DISPONIBLE       PIC 9(14)V99   COMP VALUE 0.                 
149300     02 WKS-SDO-FIDEICOMISO      PIC S9(13)V99  COMP VALUE 0.                 
149400                                                                              
149500******************************************************                        
150500*************************************************************                 
150600                                                                              
150700                                                                              
150800                                                                              
150900******************************************************                        
151000****** CAMPOS ARCHIVOS PARA PUNTEO      ***********************               
151100 01  WKS-TIT-PUNTEOOUT.                                                       
151200     02 FILLER              PIC X(22) VALUE                                   
151300                            "S500/FILE/P102/PUNTEO/".                         
151400     02 WKS-TIT-CSI-I02     PIC 99.                                           
151500     02 FILLER              PIC X     VALUE "/".                              
151600     02 WKS-TIT-FEC-I02     PIC 9(06).                                        
151700     02 FILLER              PIC X     VALUE ".".                              
151800                                                                              
151900 01  WKS-I02-R00-HEADER.                                                      
152000     02 WKS-I02-R00-TPOREG       PIC 99         VALUE 00.                     
152100     02 WKS-I02-R00-SISORI       PIC 9(04)      VALUE 0500.                   
152200     02 WKS-I02-R00-SISDES       PIC 9(04)      VALUE 0500.                   
152300     02 WKS-I02-R00-FEC-MOVTO    PIC 9(08).                                   
152400     02 WKS-I02-R00-CSI-ORIG     PIC 9(02).                                   
152500     02 WKS-I02-R00-FEC-MAQ      PIC 9(08).                                   
152600     02 WKS-I02-R00-HOR-MAQ      PIC 9(06).                                   
152700     02 WKS-I02-R00-PASO         PIC X(04).                                   
152720     02 WKS-I02-R00-COPIA        PIC 9(02).                                   
152800     02 FILLER                   PIC X(20).                                   
152900                                                                              
153000 01  WKS-I02-R01-DATOS.                                                       
153100     02 WKS-I02-R01-TPOREG       PIC 9(02).                                   
153200     02 WKS-I02-R01-LLAVE        PIC 9(12)      COMP.                         
153300     02 WKS-RD-I02-R01-LLAVE     REDEFINES WKS-I02-R01-LLAVE.                 
153400        04 WKS-I02-R01-SUCTRA    PIC 9(04)      COMP.                         
153500        04 WKS-I02-R01-CAJTRA    PIC 9(02)      COMP.                         
153600        04 WKS-I02-R01-AUTTRA    PIC 9(06)      COMP.                         
153700     02 WKS-I02-R01-CTO          PIC 9(12)      COMP.                         
153800     02 WKS-I02-R01-PROD         PIC 9(04)      COMP.                         
153900     02 WKS-I02-R01-INST         PIC 9(04)      COMP.                         
154000     02 WKS-I02-R01-MONEDA       PIC 9(04)      COMP.                         
154100     02 WKS-I02-R01-CLAVE        PIC 9(04)      COMP.                         
154200     02 WKS-I02-R01-IMPORTE      PIC 9(10)V99   COMP.                         
154300     02 WKS-I02-R01-REFE         PIC 9(12)      COMP.                         
154400     02 WKS-I02-R01-AUTS151      PIC 9(08)      COMP.                         
154500     02 WKS-I02-R01-FECMAQ       PIC 9(08)      COMP.                         
154600     02 WKS-I02-R01-HORAMAQ      PIC 9(06)      COMP.                         
154700     02 WKS-I02-R01-TPOMOV       PIC 9(02)      COMP.                         
154800     02 WKS-I02-R01-SISORIG      PIC 9(04)      COMP.                         
154900     02 WKS-I02-R01-TPOPROC      PIC 9(02)      COMP.                         
155000     02 WKS-I02-R01-ESQCONT      PIC 9(04)      COMP.                         
155100     02 WKS-I02-R01-BCO-DEST     PIC 9(06)      COMP.                         
155200***     BANCO-ORIGEN   (03)                                                   
155300***     BANCO-DESTINO  (03)                                                   
155400     02 FILLER                   PIC X(05).                                   
155500     02 WKS-I02-R01-MEDIOEN      PIC 9(02)      COMP.                         
155600                                                                              
155700 01  WKS-I02-R99-TRAILER.                                                     
155800     02 WKS-I02-R99-TPOREG        PIC 99            VALUE 99.                 
155900     02 WKS-I02-R99-NUMREGS       PIC 9(08)   COMP  VALUE 0.                  
156000     02 FILLER                    PIC X(54).                                  
156100                                                                              
156200*****************************************************************             
156202****** CAMPOS ARCHIVOS PARA BENEFICENCIA  ************                        
156204 01  WKS-TIT-TRASPBENF.                                                       
156206     02 FILLER              PIC X(24) VALUE                                   
156207                            "S500/FILE/INTE/50002E01/".                       
156208     02 WKS-TIT-CSI-I03     PIC 9(02).                                        
156209     02 FILLER              PIC X(01) VALUE "/".                              
156210     02 WKS-TIT-FEC-I03     PIC 9(08).                                        
156211     02 FILLER              PIC X(11) VALUE                                   
156212                            "/TRSPMANUAL".                                    
156213     02 FILLER              PIC X(01) VALUE ".".                              
156214                                                                              
156216********************************************************                      
156218 01  WKS-I03-R01-HEADER.                                                      
156219     02 WKS-I03-R01-DATA.                                                     
156220        04 WKS-I03-R01-TPOREG       PIC 9(01)      VALUE 1.                   
156222        04 WKS-I03-R01-SEQ          PIC 9(07).                                
156224        04 WKS-I03-R01-SISDES       PIC X(04)      VALUE "S500".              
156226        04 WKS-I03-R01-FECHA        PIC 9(08).                                
156228     02 FILLER                      PIC X(47).                                
156230                                                                              
156232 01  WKS-I03-R03-DATOS.                                                       
156234     02 WKS-I03-R03-TPOREG       PIC 9(01)      VALUE 3.                      
156236     02 WKS-I03-R03-SEQ          PIC 9(07).                                   
156238     02 WKS-I03-R03-PROD         PIC 9(04).                                   
156240     02 WKS-I03-R03-INST         PIC 9(04).                                   
156242     02 WKS-I03-R03-MONE         PIC 9(02).                                   
156244     02 WKS-I03-R03-CTO          PIC 9(18).                                   
156246     02 WKS-I03-R03-CALIF        PIC 9(02).                                   
156248     02 WKS-I03-R03-FECHAP       PIC 9(08).                                   
156250     02 FILLER                   PIC X(21).                                   
156252                                                                              
156254 01  WKS-I03-R09-TRAILER.                                                     
156256     02 WKS-I03-R09-TPOREG       PIC 9             VALUE 9.                   
156258     02 WKS-I03-R09-SEQ          PIC 9(07).                                   
156260     02 WKS-I03-R09-TOTREG3      PIC 9(08).                                   
156262     02 FILLER                   PIC X(51).                                   
156264                                                                              
156280******************************************************                        
156290***    TITULO ARCHIVO DISP-P010                    ***                        
156292******************************************************                        
156294 01  WKS-TIT-I04-P010.                                                        
156296     02 FILLER              PIC X(24) VALUE                                   
156298                            "S500/FILE/INTE/50099E01/".                       
156300     02 WKS-TIT-I04-CSI     PIC 9(02).                                        
156302     02 FILLER              PIC X(01) VALUE "/".                              
156304     02 WKS-TIT-I04-FECH    PIC 9(08).                                        
156305     02 FILLER              PIC X(01) VALUE "/".                              
156306     02 FILLER              PIC 9(12) VALUE  500.                             
156308     02 FILLER              PIC X(01) VALUE  "/".                             
156309     02 WKS-TIT-I04-SEQ     PIC 9(04) VALUE  0001.                            
156310     02 FILLER              PIC X(01) VALUE ".".                              
156312***************************************************************               
156314 01  WKS-I04-R01-HEADER.                                                      
156316     02 WKS-I04-R01-TPOREG       PIC 9(01)      VALUE  1.                     
156318     02 WKS-I04-R01-CSI          PIC 9(02).                                   
156320     02 WKS-I04-R01-FECH-CONT    PIC 9(06).                                   
156322     02 WKS-I04-R01-SIST-ORIG    PIC 9(12)      VALUE 500.                    
156324     02 WKS-I04-R01-SEQ-ARCH     PIC 9(04)      VALUE 1.                      
156326     02 WKS-I04-R01-DET-SIST     PIC X(36)      VALUE                         
156328        "INTE-INSTRUCCION DE PAGO PROTECCION ".                               
156330     02 FILLER                   PIC X(165)     VALUE " ".                    
156332                                                                              
156334                                                                              
156336                                                                              
156342**************************************************                            
156344 01  WKS-I04-R02-DATOS.                                                       
156346     02 WKS-I04-R02-TPOREG       PIC 9(01)      VALUE 2.                      
156347     02 WKS-I04-R02-SEQ          PIC 9(08)      VALUE 0.                      
156348     02 WKS-I04-R02-SUCUOPE      PIC 9(04)      VALUE 0342.                   
156350     02 WKS-I04-R02-CAJAOPE      PIC 9(02)      VALUE 90.                     
156352     02 WKS-I04-R02-AUTORIZ      PIC 9(08).                                   
156354     02 WKS-I04-R02-CVE-TRANS    PIC 9(04)      VALUE 1004.                   
156355     02 WKS-I04-R02-TPO-MOV      PIC 9(01).                                   
156356     02 WKS-I04-R02-TPO-MDA      PIC 9(02)      VALUE 0.                      
156357     02 WKS-I04-R02-SUC-CTO      PIC 9(04).                                   
156358     02 WKS-I04-R02-MDA-CTO      PIC 9(12).                                   
156360     02 WKS-I04-R02-IMPORTE      PIC 9(14)V99   VALUE 0.                      
156366     02 WKS-I04-R02-MONEDA       PIC 9(03).                                   
156372     02 WKS-I04-R02-NUM-REF      PIC 9(12).                                   
156374     02 WKS-I04-R02-CVE-FTOVAR   PIC 9(01)      VALUE 0.                      
156376     02 WKS-I04-R02-LEYENDA      PIC X(148)     VALUE                         
156378        "B02INSTRUCCION DE PAGO DE PAGO PROTECCION.".                         
156386                                                                              
156390*********************************************************                     
156392 01  WKS-I04-R09-TRAILER.                                                     
156394     02 WKS-I04-R09-TPOREG       PIC 9(01)      VALUE 9.                      
156396     02 WKS-I04-R09-NUMABONOS    PIC 9(08)      VALUE 0.                      
156398     02 WKS-I04-R09-IMPABONOS    PIC 9(16)V99   VALUE 0.                      
156400     02 WKS-I04-R09-NUMCARGOS    PIC 9(08)      VALUE 0.                      
156402     02 WKS-I04-R09-IMPCARGOS    PIC 9(16)V99   VALUE 0.                      
156404     02 WKS-I04-R09-NUMNOCONT    PIC 9(08)      VALUE 0.                      
156406     02 FILLER                   PIC X(165)     VALUE " ".                    
156408***************************************************************               
156410 01  WKS-TIT-I05-ARCHB22.                                                     
156412     02 FILLER              PIC X(24) VALUE                                   
156414                            "S500/FILE/INTS/50003S02/".                       
156416     02 WKS-TIT-I05-CSI     PIC 9(02).                                        
156418     02 FILLER              PIC X(01) VALUE "/".                              
156420     02 WKS-TIT-I05-FECH    PIC 9(08).                                        
156421     02 FILLER              PIC X(01) VALUE "/".                              
156422     02 FILLER              PIC X(07) VALUE "ESQCONT".                        
156424     02 FILLER              PIC X(01) VALUE ".".                              
156426***************************************************************               
156428 01  WKS-I05-R01-HEADER.                                                      
156430     02 WKS-I05-R01-TPOREG        PIC 9(02) VALUE 01.                         
156432     02 WKS-I05-R01-CSI           PIC 9(02).                                  
156434     02 WKS-I05-R01-FECH-CONT     PIC 9(06).                                  
156442     02 FILLER                    PIC X(134) VALUE " ".                       
156444 01  WKS-I05-R02-DATOS.                                                       
156446     02 WKS-I05-R02-TPOREG        PIC 9(02) VALUE 02.                         
156448     02 WKS-I05-R02-LLAVE-BANCOS  PIC 9(06).                                  
156450     02 WKS-I05-R02-NUM-PRODUCTO  PIC 9(04).                                  
156452     02 WKS-I05-R02-NUM-INSTRUM   PIC 9(04).                                  
156454     02 WKS-I05-R02-MONEDA        PIC 9(03).                                  
156456     02 WKS-I05-R02-FILLER        PIC 9(01).                                  
156458     02 WKS-I05-R02-ESQCON-DEFLT  PIC 9(04).                                  
156460     02 WKS-I05-R02-ESQCONT-SECT  OCCURS 20 TIMES.                            
156462        05 WKS-I05-R02-SECTOR     PIC 9(02).                                  
156464        05 WKS-I05-R02-ESQCONT    PIC 9(04).                                  
156466 01  WKS-I05-R09-TRAILER.                                                     
156468     02 WKS-I05-R09-TPOREG        PIC 9(02)  VALUE 09.                        
156470     02 WKS-I05-R09-NUMREG        PIC 9(08)  VALUE 0.                         
156472     02 FILLER                    PIC X(134) VALUE " ".                       
156474                                                                              
156490*****************************************************************             
156500 01  WKS-TITULO-R00.                                                          
156600     04 FILLER                PIC X(15) VALUE "S500/LIST/P102/".              
156700     04 WKS-TIT-R-NODO        PIC 99.                                         
156800     04 WKS-TIT-R-SBNODO      PIC 99    VALUE 0.                              
156900     04 FILLER                PIC X     VALUE "/".                            
157000     04 WKS-TIT-R-TPO         PIC X     VALUE "R".                            
157100     04 FILLER                PIC X(04)  VALUE "000/".                        
157200     04 WKS-TIT-R-FEC         PIC 9(06).                                      
157300     04 FILLER                PIC X     VALUE "/".                            
157400     04 WKS-TIT-R-MIX         PIC 9(07).                                      
157500     04 FILLER                PIC X     VALUE "/".                            
157600     04 WKS-TIT-R-NAME        PIC X(17).                                      
157700     04 FILLER                PIC X     VALUE ".".                            
157800                                                                              
157900***************************************************************               
158000**** LINEAS DE IMPRESION   ********************                               
158100 01  WLI-R00-L01-ENCA.                                                        
158200     02 FILLER              PIC X(19) VALUE                                   
158300                            "S500/P102/25MTP006/".                            
158400     02 WLI-R00-L01-NAME    PIC X(35) VALUE " ".                              
158500     02 FILLER              PIC X(51) VALUE                                   
158600                            "DEPOSITOS A LA VISTA".                           
158700     02 FILLER              PIC X(14) VALUE                                   
158800                            "FECHA MOVTOS: ".                                 
158900     02 WLI-R00-L01-FPROC   PIC X(13).                                        
159000                                                                              
159100 01  WLI-R00-L02-ENCA.                                                        
159200     02 FILLER              PIC X(15) VALUE                                   
159300                            "FECHA PROCESO: ".                                
159400     02 WLI-R00-L02-FMAQ    PIC X(11).                                        
159500     02 FILLER              PIC X(16) VALUE " ".                              
159600     02 WLI-R00-L02-TITULO  PIC X(63) VALUE " ".                              
159700     02 FILLER              PIC X(14) VALUE                                   
159800                            "TIPO PROCESO: ".                                 
159900     02 WLI-R00-L02-TPROC   PIC X(13) VALUE "DIARIO".                         
160000                                                                              
160100 01  WLI-R00-L03-ENCA.                                                        
160200     02 FILLER              PIC X(15) VALUE                                   
160300                            "HORA  PROCESO: ".                                
160400     02 WLI-R00-L03-HH      PIC 99.                                           
160420     02 FILLER              PIC X    VALUE ":".                               
160440     02 WLI-R00-L03-MM      PIC 99.                                           
160460     02 FILLER              PIC X    VALUE ":".                               
160480     02 WLI-R00-L03-SS      PIC 99.                                           
160500     02 FILLER              PIC X(19) VALUE " ".                              
160600     02 WLI-R00-L03-SBTIT   PIC X(63) VALUE " ".                              
160700     02 FILLER              PIC X(14) VALUE                                   
160800                            "HOJA NUM    : ".                                 
160900     02 WLI-R00-L03-NPAG    PIC ZZZZZ.                                        
161000     02 FILLER              PIC X(08) VALUE " ".                              
161100                                                                              
161200 01  WLI-R00-L04-ENCA.                                                        
161300     02 WLI-R00-L04-SUC     PIC 9(04)  VALUE 0511.                            
161400     02 FILLER              PIC X(128) VALUE " ".                             
161500                                                                              
161600 01  WLI-R00-L05-ENCA.                                                        
161700     02 WLI-R00-L05-NBSUC   PIC X(060) VALUE                                  
161800                            "CTO PROC DE VALORES".                            
161900     02 WLI-R00-L05-NCSI    PIC X(072) VALUE                                  
162000                            "S500 CAPTACION".                                 
162100                                                                              
162200**************************************************************                
162300 01  WLI-R01-L06-DETALLE.                                                     
162400     02 WLI-R01-HORA             PIC X(11).                                   
162500     02 FILLER                   PIC X.                                       
162600     02 WLI-R01-MENSAJE          PIC X(120).                                  
162602                                                                              
162604***************************************************************               
162606 01  WLI-R02-L06-ENCA.                                                        
162608     02 FILLER           PIC X(39) VALUE                                      
162610                         "R NUM-SEQ  SUC PROD INST MONE ".                    
162612     02 FILLER           PIC X(37) VALUE                                      
162614                         "CONTRATO             SALDO  STA-500".               
162616     02 FILLER           PIC X(56) VALUE                                      
162618                         "STA-ARCH  STA-NVO  CONCEPTO".                       
162620                                                                              
162622                                                                              
162624 01  WLI-R02-L07-DETALLE.                                                     
162625     02 WLI-R02-L07-TPREG   PIC X(01).                                        
162626     02 FILLER              PIC X(01).                                        
162628     02 WLI-R02-L07-SEQ     PIC 9(07).                                        
162630     02 FILLER              PIC X(01).                                        
162632     02 WLI-R02-L07-SUC     PIC Z(04).                                        
162634     02 FILLER              PIC X(01).                                        
162636     02 WLI-R02-L07-PROD    PIC 9(04).                                        
162638     02 FILLER              PIC X(01).                                        
162640     02 WLI-R02-L07-INST    PIC 9(04).                                        
162642     02 FILLER              PIC X(02).                                        
162644     02 WLI-R02-L07-MONE    PIC 9(02).                                        
162646     02 FILLER              PIC X(02).                                        
162648     02 WLI-R02-L07-CTO     PIC Z(18).                                        
162650     02 FILLER              PIC X(01).                                        
162652     02 WLI-R02-L07-SDO     PIC ZZ,ZZZ,ZZZ,ZZZ.99.                            
162654     02 FILLER              PIC X(05).                                        
162656     02 WLI-R02-L07-STAB    PIC 9(02).                                        
162658     02 FILLER              PIC X(07).                                        
162660     02 WLI-R02-L07-STAA    PIC 9(02).                                        
162662     02 FILLER              PIC X(08).                                        
162664     02 WLI-R02-L07-STAN    PIC Z(02).                                        
162666     02 FILLER              PIC X(05).                                        
162668     02 WLI-R02-L07-CONCP   PIC X(35).                                        
162700                                                                              
164400                                                                              
164500************************************************************                  
164600***** TITULOS DE REPORTES ***********                                         
164700 01  WKS-TITULOS-R00.                                                         
164800     02 WKS-TITULO-R01.                                                       
164900        03 FILLER                PIC X(12) VALUE " ".                         
165000        03 FILLER                PIC X(24) VALUE                              
165100                                 "REPORTE DE MENSAJES DEL ".                  
165200        03 FILLER                PIC X(08) VALUE                              
165300                                 "PROCESO ".                                  
165310                                                                              
165312     02 WKS-TITULO-R02.                                                       
165314        03 FILLER              PIC X(12) VALUE " ".                           
165316        03 FILLER              PIC X(32) VALUE                                
165318                               "RESULTADO MARCA PARA TRASPASOS".              
165320                                                                              
165380***********************************************************                   
165400***** SUBTITULOS DE REPORTES ***********                                      
165410 01  WKS-USBTIT-R00.                                                          
165412     02 WKS-SUBTIT-R02.                                                       
165414        03 FILLER          PIC X(15) VALUE " ".                               
165416        03 FILLER          PIC X(29) VALUE                                    
165418                          "MANUALES A CUENTA GLOBAL     ".                    
165420                                                                              
165450************************************************************                  
165500                                                                              
165600**********************************************************                    
165700 01  WLI-R00-L98-SININF.                                                      
165800     02 FILLER                   PIC X(30)  VALUE " ".                        
165900     02 FILLER                   PIC X(25)  VALUE                             
166000                                 "*** SIN INFORMACION ***".                   
166100 01  WLI-R00-L99-FINAL.                                                       
166200     02 FILLER                   PIC X(30)  VALUE " ".                        
166300     02 FILLER                   PIC X(25)  VALUE                             
166400                                 "*** FIN DE REPORTE ***".                    
166420 01  WLI-R00-L97-ESPA.                                                        
166430     02 FILLER                   PIC X(50) VALUE " ".                         
166500                                                                              
166600****************************************************************              
166700**************************************************************                
166800                                                                              
166900                                                                              
167000                                                                              
167100                                                                              
167200                                                                              
167300**************************************************************                
167400                                                                              
167500********* INCLUDE DE WORKING PARA RUTINAS COMUNES *************               
167600 COPY "S500/INC/WOR/25MTP002".                                                
167700                                                                              
167750                                                                              
167800 COPY "S500/INC/WOR/DAS/25MTP006".                                            
167850                                                                              
167900                                                                              
168000                                                                              
168020 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
168030                                                                              
168100*************************************************************                 
168200***    HI=0 ESTADISTICAS DEL PROCESO                                          
168300*************************************************************                 
168400***    (X)         1234                                                       
168500***    TASKVALUE = 0000                                                       
168600*************************************************************                 
168700***    (1)  =01  CON LC PENDIENTES FORZADO.                                   
168800***    (2)  =01  CON ST 2113       FORZADO.                                   
168900***    (3)  =01  SIN LIBRERIA  DEL SISTEMA S408.                              
169000***    (4)  =01  SIN LIBRERIAS DEL SISTEMA S151.                              
169100                                                                              
169200***                                                                           
169300***    EN PRODUCCION NO CORRE CON VALUE                                       
169400***************************************************************               
169500                                                                              
169600                                                                              
169700****************************************************                          
169800 PROCEDURE DIVISION.                                                          
169900*****************************************************************             
170000 DECLARATIVES.                                                                
170100 INTERRUPT-SECCION        SECTION  00.                                        
170200     USE AS INTERRUPT PROCEDURE.                                              
170300 INTERRUPT-BY-HI.                                                             
170400     DISALLOW  INTERRUPT.                                                     
170500     MOVE "I" TO W77-TIPO-DISP.                                               
170600     IF ATTRIBUTE  TASKVALUE OF MYSELF = 0                                    
170700        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI-NUMHI                    
171000        MOVE WKS-HI-TEXTO      TO WS-0101-TEXT-MSG                            
171100        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
171200        PERFORM 60613000-ESC-MENSAJES                                         
171300        PERFORM 70000050-MENSAJE                                              
171400     ELSE                                                                     
171700        STRING "NUM HI ERRONEO ", WKS-HI-NUMHI                                
171800               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
171900        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
172000        PERFORM 60613000-ESC-MENSAJES                                         
172100        PERFORM 70000050-MENSAJE.                                             
172200                                                                              
172300     SET MYSELF (TASKVALUE)  TO ZERO.                                         
172400     MOVE "E" TO W77-TIPO-DISP.                                               
172500 END-INTERRUPT-BY-HI.                                                         
172600     ALLOW INTERRUPT.                                                         
172700 END DECLARATIVES.                                                            
172800                                                                              
172900                                                                              
173000*****************************************************************             
173100 00000000-CONTROL  SECTION  01.                                               
173200*****************************************************************             
173300 00000000-CONTROL-PROGRAMA.                                                   
173400*****************************************************************             
173410**  MANEJO DE LA LIB LJ     -ENE-08-                                          
173420    MOVE 2            TO  W77-USO-LIBLJ                                       
173440    MOVE "P102"       TO  WS-0101-PASO-MSG                                    
173442                          W77-MY-PASO                                         
173444                          B91-IDPROG                                          
173450     MOVE "25MTP006"   TO  WS-0101-MTP-MSG                                    
173460                          W77-S000-MY-VERSION                                 
173470    MOVE "S500P102"   TO  W77-S000-MY-ID.                                     
173480**                                                                            
173500     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
173600     ACCEPT  WKS-TIME-MAQ-INI         FROM TIME.                              
173620                                                                              
173630     PERFORM 10000100-VERSIONES.                                              
173650     PERFORM 1000038-S038L035.                                                
173660     PERFORM 70000000-INI-PGM-MAPLI.                                          
173670     PERFORM 70000100-ACTI-01-INICIO.                                         
173690                                                                              
173700     PERFORM 00001000-INICIO-PGM.                                             
173800     PERFORM 10000000-TITLE-LIBRERIAS.                                        
173900     PERFORM 20000000-ABRE-BASE.                                              
174000     PERFORM 20000010-SUBE-INSTRUM.                                           
174100     PERFORM 20000020-ABRE-ARCH.                                              
174200                                                                              
174220                                                                              
174225     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
174226     MOVE " "                TO W77-ID-TXTA-LIB.                              
174230     PERFORM 70000950-ACT-REGPROC.                                            
174235                                                                              
174240     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
174260     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
174280                                                                              
174300     PERFORM 50000000-PROCESO-PRINCIPAL.                                      
174400     DISALLOW  INTERRUPT.                                                     
174500                                                                              
174600     PERFORM 59999990-FIN-PGM.                                                
174620                                                                              
174622     MOVE W77-ID-ACT04-MAPLI    TO W77-ID-ACTXX-MAPLI.                        
174623     MOVE " "                   TO W77-ID-TXTA-LIB.                           
174624     PERFORM 70000950-ACT-REGPROC.                                            
174626     MOVE W77-ID-ACT04-MAPLI    TO W77-ID-ACTXX-MAPLI.                        
174628     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
174630                                                                              
174640     PERFORM 70000950-FIN-PGM-MAPLI.                                          
174660                                                                              
174700     STOP RUN.                                                                
174800*****************************************************************             
174900 00001000-INICIO-PGM.                                                         
174910                                                                              
174920     MOVE ZEROS     TO WKS-TB-NUMACT-LIBS.                                    
174930                                                                              
174940     MOVE 20        TO WKS-NUMACT-LIB(15).                                    
174950     MOVE 21        TO WKS-NUMACT-LIB(49).                                    
174960     MOVE 22        TO WKS-NUMACT-LIB(53).                                    
174965     MOVE 23        TO WKS-NUMACT-LIB(52).                                    
174970                                                                              
175000     PERFORM 00000000-CHANGE-SOPCOMS.                                         
175020     PERFORM 0000-CALL-HOSTNAME.                                              
175040     MOVE WS-DH-NOM-EQUIPO TO WKS-NAME-HOST                                   
175100                                                                              
175200     IF WS-DH-HOSTNAME-PROD                                                   
175220        MOVE 1 TO W77-ES-PRODUCCION                                           
175230     ELSE                                                                     
175300     IF WS-DH-HOSTNAME-UAT                                                    
175600        MOVE 1 TO W77-ES-UAT                                                  
175605     ELSE                                                                     
175610     IF WS-DH-HOSTNAME-PBA OR WS-DH-HOSTNAME-SIT                              
175614        MOVE 1 TO W77-ES-DESARROLLO                                           
175616     ELSE                                                                     
175636        MOVE 1 TO W77-ES-UAT.                                                 
175700                                                                              
175800     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-TASKVALUE-PBA.                 
175900                                                                              
176000     SET MYSELF (TASKVALUE)  TO ZERO.                                         
176100                                                                              
176850                                                                              
176900     MOVE " "               TO WS-0101-TEXT-MSG.                              
177000                                                                              
177100     IF WKS-TASKVALUE-PBA > 0                                                 
177200        IF W77-ES-PRODUCCION = 1                                              
177220           IF WKS-SIN-LBS408 > 0                                              
177240           OR WKS-SIN-LBS151 > 0                                              
177500              STRING "VALUE INVALIDO EN PRODUCCION ",                         
177600                     "VALUE=", WKS-TASKVALUE-PBA                              
177700              DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                        
177800              PERFORM 70000050-MENSAJE                                        
177900              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                        
178000                                                                              
178100     PERFORM  00002000-MENSAJE-HOSTNAME.                                      
178200****************************************************************              
178300 10000000-TITLE-LIBRERIAS.                                                    
178400*************************** LIBRERIA DE VERSIONES ***************             
178500                                                                              
178600     PERFORM 20000100-CHECAME-VERSION.                                        
178700     IF S000-CTR-CVEERROR < 0                                                 
179000        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
179100        PERFORM 70000050-MENSAJE                                              
179200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
179300                                                                              
179400     PERFORM 0000-CHANGE-XATMI.                                               
179500     MOVE "S500P102"            TO WS-XATMI-PROG-NAME.                        
179600     PERFORM 0000-CALL-TRANSIT.                                               
179700                                                                              
179710     IF W77-ES-DESARROLLO = 1                                                 
179712        MOVE "I" TO W77-TIPO-DISP.                                            
179720                                                                              
179800     IF WS-XATMI-RSLT NOT = 0                                                 
180100        MOVE WS-XATMI-RSLT       TO W77-RS-XATMI                              
180200        STRING "ERROR AL IDENTIFICAR XATMI "                                  
180300               " RESULT=" W77-RS-XATMI                                        
180400               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
180500        PERFORM 70000050-MENSAJE                                              
180600        IF W77-ES-DESARROLLO = 1                                              
180610           STRING "SOLO EN PRUEBAS DESARROLLO: ",                             
180620                  "(OK PARA CONTINUAR) O (DS PARA TERMINAR)"                  
180630                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
180640           STOP WS-0101-MENSAJE                                               
180645           MOVE " "  TO  WS-0101-TEXT-MSG                                     
180650        ELSE                                                                  
180660           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
180670                                                                              
180675     MOVE "E" TO W77-TIPO-DISP.                                               
180700                                                                              
180800*************************** LIBRERIA DE FECHAS  *****************             
180900     PERFORM 10000006-LOCSUP.                                                 
181000                                                                              
181100***************** LIBRERIA MOVIMIENTOS Y SALDOS  AL(S151)*******              
181200     PERFORM 10000151-REGISTRA.                                               
181300                                                                              
181400*************************** LIBRERIA LINEAS CREDITO S408 ********             
181500     PERFORM 10000408-LINCRED.                                                
181600                                                                              
181900                                                                              
182000**************************************************************                
182100 20000000-ABRE-BASE.                                                          
182200                                                                              
182300     ACCEPT WKS-TIME-OPEN-BD  FROM TIME.                                      
182400     OPEN UPDATE S500BD01CAPTACION.                                           
182500     MOVE "ABRE Y VALIDA BASE CAPTACION" TO WKS-HI-DETALLE.                   
182600                                                                              
182700     PERFORM 20010000-VALIDA-BASE.                                            
182800                                                                              
182900     MOVE ZEROS          TO WKS-IND-TBCVE                                     
183000                            WS-IND-INST.                                      
183100                                                                              
183200     MOVE "CARGA INSTRUMENT Y CVES VALIDAS " TO WKS-HI-DETALLE.               
183300     SET S500B17CVESXFUN     TO BEGINNING.                                    
183400     SET S500B05INSTRUMEN    TO BEGINNING.                                    
183500     PERFORM 20030000-CARGA-CLAVES-VAL                                        
183600            UNTIL W77-EOF-CVES-VAL = 1.                                       
183700                                                                              
183800     MOVE WKS-IND-MXCVE     TO WS-MSG-N-04.                                   
183900     STRING "NUMERO DE CLAVES VALIDAS ", WS-MSG-N-04                          
184000            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
184100     PERFORM 60613000-ESC-MENSAJES.                                           
184200                                                                              
184210     MOVE "INICIALIZO B09-CIFRAS (ORDEN B09)" TO WLI-R01-MENSAJE.             
184220     PERFORM 60613000-ESC-MENSAJES.                                           
184230     PERFORM 20039000-LIMPIA-B09.                                             
184240     MOVE "FIN INICIALIZO B09-CIFRAS " TO WLI-R01-MENSAJE                     
184250     PERFORM 60613000-ESC-MENSAJES.                                           
184260                                                                              
184300****************************************************************              
184400 20000010-SUBE-INSTRUM.                                                       
184500     SET S500B05INSTRUMEN    TO BEGINNING.                                    
184510     MOVE "INFORMACION DE B05 " TO WLI-R01-MENSAJE.                           
184520     PERFORM 60613000-ESC-MENSAJES.                                           
184530                                                                              
184600     PERFORM 20000011-CARGA-INSTRUMENTOS                                      
184700             UNTIL W77-EOF-B05 = 1.                                           
184800                                                                              
184900     MOVE 1 TO WS-IND-INST.                                                   
184910                                                                              
184920     MOVE "FIN INF. DE B05 " TO WLI-R01-MENSAJE.                              
184930     PERFORM 60613000-ESC-MENSAJES.                                           
185000                                                                              
185100*************************************************************                 
185200 20000011-CARGA-INSTRUMENTOS.                                                 
185300     PERFORM 90000005-B05INSTRUMEN-FINDN.                                     
185400     IF WS-STATUS-BASE = 0                                                    
185500        PERFORM 20000011-SUBE-INSTR                                           
185600     ELSE                                                                     
185700     IF WS-DB-NOTFOUND                                                        
185800        MOVE 1 TO W77-EOF-B05                                                 
185900     ELSE                                                                     
186200       STRING "ERR B05FINDNEXT ", WS-STATUS-BASE                              
186300              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
186400       MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                            
186500       PERFORM 60613000-ESC-MENSAJES                                          
186600       PERFORM 70000050-MENSAJE                                               
186700       MOVE 1 TO W77-EOF-B05                                                  
186800       CALL SYSTEM DMTERMINATE.                                               
186900                                                                              
187000***********************************************************                   
187100 20000011-SUBE-INSTR.                                                         
187200     ADD  1                    TO WS-IND-INST.                                
187300     IF WS-IND-INST > 30                                                      
187600        MOVE "MAS DE 30 INST. EN LA BASE"                                     
187700          TO WS-0101-TEXT-MSG                                                 
187800        MOVE WS-0101-TEXT-MSG    TO WLI-R01-MENSAJE                           
187900        PERFORM 60613000-ESC-MENSAJES                                         
188000        PERFORM 70000050-MENSAJE                                              
188100        MOVE 1 TO W77-EOF-B05                                                 
188200        CALL SYSTEM DMTERMINATE.                                              
188300                                                                              
188400     MOVE B05-NUM-PRODUCTO TO TB-B05-PROD  (WS-IND-INST).                     
188500     MOVE B05-NUM-INSTRUM  TO TB-B05-INST  (WS-IND-INST).                     
188600     MOVE B05-MONEDA       TO TB-B05-MONEDA(WS-IND-INST).                     
188610     MOVE B05-IND-BENEF    TO TB-B05-IND-BENEF(WS-IND-INST).                  
188615                                                                              
188620     MOVE B05-NUM-PRODUCTO   TO WS-MSG-PRD.                                   
188625     MOVE B05-NUM-INSTRUM    TO WS-MSG-INST.                                  
188630     MOVE B05-MONEDA         TO WS-MSG-MDA.                                   
188635     MOVE B05-IND-BENEF      TO WS-MSG-N-02.                                  
188638                                                                              
188642**   IF B05-IND-BENEF > 0                                                     
188645        STRING "PRODUCTO=" WS-MSG-PRD "-" WS-MSG-INST                         
188650               "-" WS-MSG-MDA                                                 
188655               " IND-BENEF=" WS-MSG-N-02                                      
188660               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
188665        PERFORM 60613000-ESC-MENSAJES.                                        
188670                                                                              
188700                                                                              
188800*******************************************************                       
188900 20000020-ABRE-ARCH.                                                          
188910                                                                              
188930     PERFORM 20000050-VAL-ARCH-BENF.                                          
188940                                                                              
189000     OPEN OUTPUT I02-PUNTEOOUT.                                               
189010     OPEN OUTPUT I04-DISP-P010.                                               
189020     OPEN OUTPUT I05-ARCHB22.                                                 
189100                                                                              
189200     MOVE WKS-FEC-BASE        TO WKS-I02-R00-FEC-MOVTO.                       
189300     MOVE W77-MY-CSI          TO WKS-I02-R00-CSI-ORIG.                        
189400     MOVE WKS-FEC-MAQ-08      TO WKS-I02-R00-FEC-MAQ.                         
189500     MOVE WKS-HORA-MAQ-INI    TO WKS-I02-R00-HOR-MAQ.                         
189600     MOVE "P102"              TO WKS-I02-R00-PASO.                            
189620     MOVE 01                  TO WKS-I02-R00-COPIA.                           
189700                                                                              
189800     MOVE WKS-I02-R00-HEADER  TO I02-R00-PUNTEOOUT.                           
189900                                                                              
190000     PERFORM 20015600-ESCRIBE-PUNTEO.                                         
190002     PERFORM 20015620-ESC-HEAD-P010.                                          
190005                                                                              
190010***************************************************************               
190015 20000050-VAL-ARCH-BENF.                                                      
190020     SET I03-TRASPBENEF  (TITLE)   TO WKS-TIT-TRASPBENF.                      
190025                                                                              
190030     IF ATTRIBUTE RESIDENT OF I03-TRASPBENEF IS = VALUE TRUE                  
190032        MOVE 1    TO W77-HAY-ARCH-BENEF                                       
190034        OPEN INPUT I03-TRASPBENEF                                             
190040     ELSE                                                                     
190045        MOVE 0    TO W77-HAY-ARCH-BENEF.                                      
190050                                                                              
190055***************************************************************               
190100                                                                              
190200*************************************************************                 
190300 20010000-VALIDA-BASE.                                                        
190310     PERFORM 90000000-B00CTRLPASO-LOCK                                        
190320     IF WS-STATUS-BASE > 0                                                    
190350        STRING "ERR LOCK B00CTRLPASO ", WS-STATUS-BASE                        
190360               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
190370        PERFORM 70000050-MENSAJE                                              
190380        CALL SYSTEM DMTERMINATE.                                              
190390                                                                              
190400     PERFORM 90000002-B02CONTROL-FIND.                                        
190500     IF WS-STATUS-BASE > 0                                                    
190800        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
190900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
191000        PERFORM 70000050-MENSAJE                                              
191100        CALL SYSTEM DMTERMINATE.                                              
191200                                                                              
191300     MOVE B02-NUM-CSI       TO W77-MY-CSI.                                    
191400     MOVE B02-FECHA-LOTE    TO WKS-FEC-BASE.                                  
191500     MOVE WKS-DD-FBASE      TO WKS-DD-FPRC-EDIT                               
191600     MOVE WKS-AAAA-FBASE    TO WKS-AAAA-FPRC-EDIT.                            
191700     MOVE WKS-TB-MES-03(WKS-MM-FBASE)                                         
191800       TO WKS-MM-FPRC-EDIT.                                                   
191900     MOVE B02-FECHA-LINEA   TO WKS-FEC-PROX.                                  
192000     MOVE ZERO              TO W77-MY-AUTORIZ.                                
192100                                                                              
192600     MOVE B02-PGOPEND-S408  TO W77-HAY-PAGOLC.                                
192800                                                                              
192810     IF WKS-CON-LCPEND = 1                                                    
192820        MOVE 1              TO W77-HAY-PAGOLC.                                
192830                                                                              
192900                                                                              
193000     DIVIDE WKS-AAAA-FBASE  BY 4 GIVING W77-RS-DIV                            
193100            REMAINDER W77-ES-BISIESTO.                                        
193200                                                                              
193300     IF W77-ES-BISIESTO = 0                                                   
193400        MOVE 29  TO WKS-TAB-DIAS-MES(2).                                      
193500                                                                              
193600     PERFORM 20040000-INICIA-WORKING.                                         
193700                                                                              
193710     IF W77-ES-DESARROLLO = 1                                                 
193712        MOVE "I" TO W77-TIPO-DISP.                                            
193720                                                                              
193800     IF B00-TIPO-PROCESO = 1                                                  
193900        IF  B00-NUM-PASO-01  = 010                                            
193920       AND  B00-NUM-PASO-02  = 010                                            
194000       AND  B02-FECHA-LOTE < B02-FECHA-LINEA                                  
194100            NEXT SENTENCE                                                     
194200        ELSE                                                                  
194500           MOVE B00-NUM-PASO-01   TO WS-MSG-MDA                               
194520           MOVE B00-NUM-PASO-02   TO WS-MSG-PASO                              
194530           MOVE B00-NUM-PASO-03   TO WS-MSG-CVE                               
194600           MOVE B02-FECHA-LINEA   TO W77-FECHA-EDIT                           
194700           MOVE B02-FECHA-LOTE    TO W77-FECHA-EDIT2                          
194800           STRING "BASE NO SALIDA DE PREBATCH"                                
194900                  " PASO-01-ANT=", WS-MSG-MDA                                 
194920                  " PASO-02-ANT=", WS-MSG-PASO                                
194930                  " PASO-03-ANT=", WS-MSG-CVE                                 
195000                  " FECLINEA=", W77-FECHA-EDIT                                
195100                  " FECLOTE=",  W77-FECHA-EDIT2                               
195200                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
195300           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
195400           PERFORM 60613000-ESC-MENSAJES                                      
195500           PERFORM 70000050-MENSAJE                                           
195510           IF W77-ES-DESARROLLO = 1                                           
195512              NEXT SENTENCE                                                   
195514           ELSE                                                               
195600              CALL SYSTEM DMTERMINATE                                         
195700     ELSE                                                                     
196000         MOVE B00-TIPO-PROCESO      TO WS-MSG-N-02                            
196005         MOVE B00-NUM-PASO-01       TO WS-MSG-MDA                             
196010         MOVE B00-NUM-PASO-02       TO WS-MSG-PASO                            
196012         MOVE B00-NUM-PASO-03       TO WS-MSG-CVE                             
196015         MOVE B02-FECHA-LINEA       TO W77-FECHA-EDIT                         
196020         MOVE B02-FECHA-LOTE        TO W77-FECHA-EDIT2                        
196025         STRING "ERR BASE"                                                    
196030                " T-PROC=", WS-MSG-N-02                                       
196035                " PASO-1=", WS-MSG-MDA                                        
196040                " PASO-2=", WS-MSG-PASO                                       
196042                " PASO-3=", WS-MSG-CVE                                        
196045                " FECHL=", W77-FECHA-EDIT                                     
196050                " FECHB=", W77-FECHA-EDIT2                                    
196200                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
196300         MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                            
196400         PERFORM 60613000-ESC-MENSAJES                                        
196500         PERFORM 70000050-MENSAJE                                             
196510         IF W77-ES-DESARROLLO = 1                                             
196512            NEXT SENTENCE                                                     
196514         ELSE                                                                 
196600            CALL SYSTEM DMTERMINATE.                                          
196610                                                                              
196612     MOVE "E" TO W77-TIPO-DISP.                                               
196700                                                                              
196800     IF W77-HAY-PAGOLC = 1                                                    
196900        MOVE " CON PAGOS PENDIENTES " TO WLI-R01-MENSAJE                      
197000        PERFORM 60613000-ESC-MENSAJES                                         
197100     ELSE                                                                     
197200        MOVE " SIN PAGOS PENDIENTES " TO WLI-R01-MENSAJE                      
197300        PERFORM 60613000-ESC-MENSAJES.                                        
197400                                                                              
198100                                                                              
198200     MOVE ZERO               TO B00-NUM-PASO-01.                              
198220     MOVE 102                TO B00-NUM-PASO-02                               
198240                                B00-NUM-PASO-03.                              
198270                                                                              
198300     PERFORM 90000000-BEGIN-TRANSACTION.                                      
198400     IF WS-STATUS-BASE > 0                                                    
198500        CALL SYSTEM DMTERMINATE.                                              
198550                                                                              
198600     PERFORM 90000000-B00CTRLPASO-STORE.                                      
198700     IF WS-STATUS-BASE > 0                                                    
199000        STRING "ERR STORE B00CTRLPASO ", WS-STATUS-BASE                       
199100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
199200        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
199300        PERFORM 60613000-ESC-MENSAJES                                         
199400        PERFORM 70000050-MENSAJE                                              
199500        CALL SYSTEM DMTERMINATE.                                              
199550                                                                              
199600     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
199700     IF WS-STATUS-BASE > 0                                                    
199800        CALL SYSTEM DMTERMINATE.                                              
200100                                                                              
200200     CHANGE ATTRIBUTE MAXCARDS OF MYSELF TO W77-SET-MAXCARDS.                 
200300*********************************************************                     
200400 20030000-CARGA-CLAVES-VAL.                                                   
200500     PERFORM 90000017-B17CVESXFUN-FINDN.                                      
200600     IF WS-STATUS-BASE = 0                                                    
200700        PERFORM 20030100-SUBE-CVE-VAL                                         
200800     ELSE                                                                     
200900     IF WS-DB-NOTFOUND                                                        
201000        MOVE 1 TO W77-EOF-CVES-VAL                                            
201100     ELSE                                                                     
201400       STRING "ERR B17CVESXFUN-FINDN ", WS-STATUS-BASE                        
201500              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
201600       MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                              
201700       PERFORM 60613000-ESC-MENSAJES                                          
201800       PERFORM 70000050-MENSAJE                                               
201900       CALL SYSTEM DMTERMINATE.                                               
202000                                                                              
202100**************************************************************                
202200 20030100-SUBE-CVE-VAL.                                                       
202300     ADD 1 TO WKS-IND-TBCVE.                                                  
202400     IF WKS-IND-TBCVE > 2000                                                  
202700        MOVE "MAS DE 2000 CVES-X-FUN EN B17 " TO WS-0101-TEXT-MSG             
202800        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
202900        PERFORM 60613000-ESC-MENSAJES                                         
203000        PERFORM 70000050-MENSAJE                                              
203100        CALL SYSTEM DMTERMINATE.                                              
203110                                                                              
203200     MOVE B17-CLAVE-TRANS      TO WKS-TAB-CVEVAL(WKS-IND-TBCVE).              
203300     MOVE WKS-IND-TBCVE        TO WKS-IND-MXCVE.                              
203400                                                                              
203450     MOVE B17-AFECTA-S052 TO WKS-TAB-CVE-ACT-SDO(WKS-IND-TBCVE).              
203490*****************************************************************             
203500 20039000-LIMPIA-B09.                                                         
203505     SET S500B09CIFRAS       TO BEGINNING.                                    
203510                                                                              
203515     PERFORM 90000000-BEGIN-TRANSACTION                                       
203520     IF WS-STATUS-BASE > 0                                                    
203525        CALL SYSTEM DMTERMINATE.                                              
203530                                                                              
203535     PERFORM 20039100-INICIALIZA-B09                                          
203540             UNTIL W77-FIN-B09 = 1.                                           
203545                                                                              
203550     PERFORM 90000000-END-TRANSACTIONNOAU                                     
203555     IF WS-STATUS-BASE > 0                                                    
203560        CALL SYSTEM DMTERMINATE.                                              
203565                                                                              
203570**************************************************************                
203575 20039100-INICIALIZA-B09.                                                     
203580     PERFORM 90000009-B09CIFRAS-LOCKN                                         
203585                                                                              
203590     IF WS-STATUS-BASE > 0                                                    
203595        IF WS-DB-NOTFOUND                                                     
203600           MOVE 1                     TO W77-FIN-B09                          
203605        ELSE                                                                  
203620           STRING "ERR LOCKN B09CIFRAS STA=" WS-STATUS-BASE                   
203622                  DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                    
203625           MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                      
203630           PERFORM 60613000-ESC-MENSAJES                                      
203635           PERFORM 70000050-MENSAJE                                           
203645           CALL SYSTEM DMTERMINATE.                                           
203650                                                                              
203655     IF W77-FIN-B09 = 0                                                       
203656        MOVE B09-NUM-PRODUCTO    TO WS-MSG-PRD                                
203657        MOVE B09-NUM-INSTRUM     TO WS-MSG-INST                               
203658        MOVE B09-MONEDA          TO WS-MSG-MDA                                
203659        STRING "PRODUCTO: " WS-MSG-PRD                                        
203660                          "-" WS-MSG-INST                                     
203661                          "-" WS-MSG-MDA                                      
203662               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
203663        MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                         
203664        PERFORM 60613000-ESC-MENSAJES                                         
203665        PERFORM 70000050-MENSAJE                                              
203670        PERFORM 20039105-ACT-CAMPOS-B09.                                      
203680                                                                              
203685**************************************************************                
203725* PARA LA SALIDA DE SBC-6D EN EL P105 SE UTILIZAN:          **                
203747* MOVE B09-SBC6D-GBL-L             TO B09-SBC6D-SAL-GL.     **                
203749* MOVE B09-SBC6D-GBL-FR            TO B09-SBC6D-SAL-GFR.    **                
203765**************************************************************                
203800 20039105-ACT-CAMPOS-B09.                                                     
203804     MOVE B09-SDO-ACTUAL              TO B09-SDO-ANTERIOR.                    
203806     MOVE B09-IMP-SDOSBC-L            TO B09-IMP-SDOPEN-L.                    
203808     MOVE B09-IMP-SDOSBC-FE           TO B09-IMP-SDOPEN-FE.                   
203810     MOVE B09-IMP-SDOSBC-FR           TO B09-IMP-SDOPEN-FR.                   
203812     MOVE B09-SBC6D-GBL-L             TO B09-SBC6D-SAL-GL.                    
203814     MOVE B09-SBC6D-GBL-FR            TO B09-SBC6D-SAL-GFR.                   
203816                                                                              
203818     MOVE B09-SBC6D-SDOACT            TO B09-SBC6D-SDOANT.                    
203820                                                                              
203822     MOVE ZERO  TO B09-POSIB-CARGOS   B09-POSIB-ABONOS                        
203824                   B09-POSIL-CARLOC   B09-POSIL-ABOLOC                        
203826                   B09-POSIL-CARFOR   B09-POSIL-ABOFOR                        
203828                   B09-SBC6D-ENT-L    B09-SBC6D-ENT-FR                        
203830                   B09-SBC6D-SAL-L    B09-SBC6D-SAL-FR                        
203832                   B09-SBC6D-GBL-L    B09-SBC6D-GBL-FR                        
203834                   B09-IMP-SDOSBC-L   B09-IMP-SDOSBC-FE                       
203836                   B09-IMP-SDOSBC-FR.                                         
203848                                                                              
203850     PERFORM 90000009-B09CIFRAS-STORE.                                        
203852     IF WS-STATUS-BASE > 0                                                    
203854        STRING "ERR STORE B09CIFRAS STA=" WS-STATUS-BASE                      
203856               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
203858        MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                         
203860        PERFORM 60613000-ESC-MENSAJES                                         
203862        PERFORM 70000050-MENSAJE                                              
203864        CALL SYSTEM DMTERMINATE.                                              
203866                                                                              
203890**********************************************************                    
203900 20040000-INICIA-WORKING.                                                     
204000     MOVE WKS-AAAA-MAQ               TO WKS-AAAA-FMAQ-EDIT.                   
204100     MOVE WKS-DD-MAQ                 TO WKS-DD-FMAQ-EDIT.                     
204200     MOVE WKS-TB-MES-03(WKS-MM-MAQ)  TO WKS-MM-FMAQ-EDIT.                     
204300                                                                              
204400     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO W77-NUM-MIX.                       
204500                                                                              
204510     MOVE WKS-FEC-BASE           TO WKS-TIT-I04-FECH                          
204511                                    WKS-TIT-I05-FECH                          
204512                                    WKS-I04-R01-FECH-CONT                     
204513                                    WKS-I05-R01-FECH-CONT.                    
204514                                                                              
204516     MOVE WKS-DD-FBASE           TO WKS-AUT-DIA.                              
204520                                                                              
204600     MOVE W77-MY-CSI             TO WKS-TIT-R-NODO                            
204800                                    WKS-TIT-CSI-I02                           
204810                                    WKS-TIT-CSI-I03                           
204812                                    WKS-I04-R01-CSI                           
204813                                    WKS-I05-R01-CSI                           
204814                                    WKS-TIT-I04-CSI                           
204816                                    WKS-TIT-I05-CSI.                          
204900                                                                              
205000     MOVE W77-NUM-MIX            TO WKS-TIT-R-MIX.                            
205100                                                                              
205200     MOVE WKS-FECPROC-EDIT       TO WLI-R00-L01-FPROC.                        
205300     MOVE WKS-FEC-BASE           TO WKS-TIT-R-FEC                             
205500                                    WKS-TIT-FEC-I02                           
205510                                    WKS-TIT-FEC-I03.                          
205600                                                                              
205700     MOVE WKS-FECMAQ-EDIT        TO WLI-R00-L02-FMAQ.                         
205800                                                                              
205900     MOVE WKS-HH-MAQ-INI         TO WLI-R00-L03-HH.                           
205920     MOVE WKS-MM-MAQ-INI         TO WLI-R00-L03-MM.                           
205940     MOVE WKS-SS-MAQ-INI         TO WLI-R00-L03-SS.                           
206000                                                                              
206100     MOVE   " "                  TO WLI-R01-L06-DETALLE.                      
206110     MOVE   " "                  TO WLI-R02-L07-DETALLE.                      
206200                                                                              
206300     MOVE SPACES                 TO WKS-LEY-ADICIONAL.                        
206400                                                                              
206500     IF W77-MY-CSI = 10                                                       
206600        MOVE "C.S.I. MEXICO"     TO WLI-R00-L05-NCSI                          
206700     ELSE                                                                     
206800        MOVE "C.S.I. MONTERREY"  TO WLI-R00-L05-NCSI.                         
206900                                                                              
207000     MOVE ALL @00@               TO WKS-TOTAL-CVES-01                         
207100                                    WKS-TOTAL-CVES-02                         
207200                                    WKS-TOTAL-CVES-03                         
207300                                    WKS-TOTAL-CVES-04                         
207400                                    WKS-TOTAL-CVES-05                         
207500                                    WKS-TOTAL-CVES-06                         
207600                                    WKS-TOTAL-CVES-07                         
207700                                    WKS-TOTAL-CVES-08                         
207800                                    WKS-TOTAL-CVES-09                         
207900                                    WKS-TOTAL-CVES-10                         
207905                                    WKS-TOTAL-CVES-11                         
207910                                    WKS-TOTAL-CVES-12                         
207915                                    WKS-TOTAL-CVES-13                         
207920                                    WKS-TOTAL-CVES-14                         
207925                                    WKS-TOTAL-CVES-15                         
207930                                    WKS-TOTAL-CVES-16                         
207935                                    WKS-TOTAL-CVES-17                         
207940                                    WKS-TOTAL-CVES-18                         
207945                                    WKS-TOTAL-CVES-19                         
207950                                    WKS-TOTAL-CVES-20                         
208000                                    WKS-TABLA-CVES-VALIDAS.                   
208100                                                                              
208200     PERFORM 20050000-ABRE-REPORTES.                                          
208300                                                                              
208400     MOVE WKS-HH-MAQ-INI          TO WKS-HH-EDIT-P.                           
208420     MOVE WKS-MM-MAQ-INI          TO WKS-MM-EDIT-P.                           
208440     MOVE WKS-SS-MAQ-INI          TO WKS-SS-EDIT-P.                           
208460     MOVE WKS-DD-MAQ-INI          TO WKS-DD-EDIT-P.                           
208500     MOVE WKS-FEC-MAQ-08          TO W77-FECHA-EDIT.                          
208600                                                                              
208700     STRING "INICIO PROCESO ",                                                
208800            "  FECHA: ", W77-FECHA-EDIT,                                      
208900            "  HORA: ",  WKS-HORA-EDIT-P                                      
209000     DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                   
209100     PERFORM 60613000-ESC-MENSAJES.                                           
209200                                                                              
209300     MOVE W77-NUM-MIX         TO WS-MSG-N-08.                                 
209400     IF W77-ES-DESARROLLO = 1                                                 
209410     OR W77-ES-UAT        = 1                                                 
209500        STRING "PRUEBA EN ", WKS-MY-HOST,                                     
209600               " MIXNUMBER=", WS-MSG-N-08,                                    
209700               " VALUE=", WKS-TASKVALUE-PBA                                   
209800               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
209900        PERFORM 60613000-ESC-MENSAJES                                         
210000     ELSE                                                                     
210100        STRING "PRODUCCION EN ", WKS-MY-HOST,                                 
210200               " MIXNUMBER=", WS-MSG-N-08,                                    
210300               " VALUE=", WKS-TASKVALUE-PBA                                   
210400        DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                
210500        PERFORM 60613000-ESC-MENSAJES.                                        
210600                                                                              
210700     MOVE WKS-HH-OPEN-BD   TO WKS-HH-EDIT-P.                                  
210720     MOVE WKS-MM-OPEN-BD   TO WKS-MM-EDIT-P.                                  
210740     MOVE WKS-SS-OPEN-BD   TO WKS-SS-EDIT-P.                                  
210760     MOVE WKS-DD-OPEN-BD   TO WKS-DD-EDIT-P.                                  
210800     STRING "*** ABRO BASE DEL S500 ", WKS-HORA-EDIT-P                        
210900            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
211000     PERFORM 60613000-ESC-MENSAJES.                                           
211100                                                                              
211200     PERFORM 20040100-FECHAS.                                                 
211300                                                                              
211400                                                                              
211500**********************************************************                    
211600 20040100-FECHAS.                                                             
211700********  PIDE QUE DIA DE LA SEMANA ES HOY ********                           
211800     MOVE WKS-FEC-BASE           TO WS-S006-FECHA1.                           
211900     MOVE 1                      TO WS-S006-FECHA2.                           
212000     MOVE 12                     TO WS-S006-FORMATO.                          
212100     MOVE 6                      TO WS-S006-FUNCION.                          
212105     MOVE 212200                 TO W77-LIN-ERR.                              
212200     PERFORM 20040300-LLAMA-LOCSUP.                                           
212210     IF W77-ERR-LOCSUP > 0                                                    
212214        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
212216                                                                              
212300     MOVE WS-S006-FECHA1      TO WKS-DIA-SEMHOY.                              
212400                                                                              
212500     COMPUTE WKS-IND-99 = WKS-DIA-SEMHOY + 1.                                 
212600                                                                              
212700     IF WKS-IND-99 > 0 AND < 8                                                
212800        STRING "HOY ES              ",                                        
212900               WKS-FECPROC-EDIT                                               
213000               " ", WKS-TAB-QDIASEM(WKS-IND-99)                               
213100               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
213200     ELSE                                                                     
213300        MOVE WKS-DIA-SEMHOY  TO  WS-MSG-N-02                                  
213400        STRING "EL DIA DE HOY ES    ",                                        
213500               WLI-R00-L01-FPROC,                                             
213600               " ", WS-MSG-N-02,                                              
213700                DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                       
213800                                                                              
213900     PERFORM 60613000-ESC-MENSAJES.                                           
214000                                                                              
214100********   SIGUIENTE FECHA HABIL  ********                                    
214200                                                                              
214300     MOVE WKS-FEC-PROX  TO W77-FECHA-EDIT.                                    
214400                                                                              
214500********  PIDE DIA DE LA SEMANA SIGUIENTE FECHA HABIL **                      
214600     MOVE WKS-FEC-PROX           TO WS-S006-FECHA1.                           
214700     MOVE 1                      TO WS-S006-FECHA2.                           
214800     MOVE 12                     TO WS-S006-FORMATO.                          
214900     MOVE 6                      TO WS-S006-FUNCION.                          
214910     MOVE 215000                 TO W77-LIN-ERR.                              
215000     PERFORM 20040300-LLAMA-LOCSUP.                                           
215010     IF W77-ERR-LOCSUP > 0                                                    
215015        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
215016                                                                              
215100     MOVE WS-S006-FECHA1      TO WKS-DIA-SEMPROX.                             
215200                                                                              
215300     COMPUTE WKS-IND-99 = WKS-DIA-SEMPROX + 1                                 
215400     IF WKS-IND-99 > 0 AND < 8                                                
215500        STRING "PROXIMO DIA HABIL   ",                                        
215600                W77-FECHA-EDIT,                                               
215700               "  ", WKS-TAB-QDIASEM(WKS-IND-99)                              
215800               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
215900     ELSE                                                                     
216000        MOVE WKS-DIA-SEMPROX   TO WS-MSG-N-02                                 
216100        STRING "SIGUIENTE DIA ES    ", W77-FECHA-EDIT,                        
216200               " ", WS-MSG-N-02                                               
216300               DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                        
216400                                                                              
216500     PERFORM 60613000-ESC-MENSAJES.                                           
216600                                                                              
216700********  PIDE DIA HABIL ANTERIOR   ******************                        
216800     MOVE WKS-FEC-BASE           TO WS-S006-FECHA1.                           
216900     MOVE 1                      TO WS-S006-FECHA2.                           
217000     MOVE 12                     TO WS-S006-FORMATO.                          
217100     MOVE 15                     TO WS-S006-FUNCION.                          
217110     MOVE 217200                 TO W77-LIN-ERR.                              
217200     PERFORM 20040300-LLAMA-LOCSUP.                                           
217210     IF W77-ERR-LOCSUP > 0                                                    
217212        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
217216                                                                              
217300     MOVE WS-S006-FECHA1      TO WKS-FEC-ANTE.                                
217400                                                                              
217500     MOVE WKS-FEC-ANTE           TO W77-FECHA-EDIT.                           
217600     STRING "DIA  HABIL ANTERIOR ", W77-FECHA-EDIT                            
217700            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
217800     PERFORM 60613000-ESC-MENSAJES.                                           
217900                                                                              
218000**** VERIFICA INICIO DE MES ************************                          
218100*    IF WKS-MM-FANTE NOT = WKS-MM-FBASE                                       
218200*       MOVE "ES INICIO DE MES " TO WLI-R01-MENSAJE                           
218300*       PERFORM 60613000-ESC-MENSAJES                                         
218400*       MOVE 1                    TO WKS-ES-INICIOMES                         
218500*       IF WKS-AAAA-FANTE NOT = WKS-AAAA-FBASE                                
218600*          MOVE 1                 TO WKS-ES-INIANH                            
218700*          MOVE "ES INICIO DE AµO " TO WLI-R01-MENSAJE                        
218800*          PERFORM 60613000-ESC-MENSAJES.                                     
218900                                                                              
219000**** VERIFICA SI ES FIN DE SEMANA *************                               
219100*    IF WKS-DIA-SEMHOY > WKS-DIA-SEMPROX                                      
219200*       MOVE 1              TO WKS-ES-SEMANAL                                 
219300*       MOVE "ES PROCESO SEMANAL" TO WLI-R01-MENSAJE                          
219400*       PERFORM 60613000-ESC-MENSAJES.                                        
219500                                                                              
219600**** VERIFICA SI ES FIN DE MES   **************                               
219700     IF WKS-MM-FPROX  = WKS-MM-FBASE                                          
219800        MOVE 0          TO WKS-ES-MENSUAL                                     
219900     ELSE                                                                     
220000        MOVE "ES PROCESO MENSUAL"  TO WLI-R01-MENSAJE                         
220100        PERFORM 60613000-ESC-MENSAJES                                         
220200        MOVE 1                      TO WKS-ES-MENSUAL.                        
220300                                                                              
220400*************************************************************                 
220500 20040300-LLAMA-LOCSUP.                                                       
220510                                                                              
220515     MOVE ZERO TO W77-ERR-LOCSUP W77-ES-FUNC20.                               
220520                                                                              
220525     IF WS-S006-FUNCION = 20                                                  
220530       MOVE 1 TO W77-ES-FUNC20.                                               
220580                                                                              
220600     PERFORM 20000006-LOCSUP.                                                 
220700                                                                              
220800     IF WS-S006-FUNCION > 0                                                   
220805        MOVE 1 TO W77-ERR-LOCSUP                                              
220810        IF W77-ES-FUNC20 = 0                                                  
220900           MOVE WS-S006-FORMATO  TO WS-MSG-N-02                               
221000           MOVE WS-S006-FUNCION  TO WS-MSG-N-04                               
221100           STRING "ERR CALL LOCSUP ",                                         
221200                  " FUNC ", WS-MSG-N-04                                       
221300                  " FMTO ", WS-MSG-N-02                                       
221400                  " FEC1 ", WS-S006-FECHA1                                    
221500                  " FEC2 ", WS-S006-FECHA2                                    
221510                  " LINERR=" W77-LIN-ERR                                      
221600                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
221700           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
221800           PERFORM 60613000-ESC-MENSAJES                                      
221900           PERFORM 70000050-MENSAJE.                                          
222000***        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
222100                                                                              
222200*********************************************************                     
222300                                                                              
222400                                                                              
222500                                                                              
222600                                                                              
222700                                                                              
222800                                                                              
222900**************************************************************                
223000 20050000-ABRE-REPORTES.                                                      
223100     SET  R01-MENSAJES     (USERBACKUPNAME)  TO VALUE TRUE.                   
223200                                                                              
223300     MOVE "R"                        TO WKS-TIT-R-TPO.                        
223400     MOVE "001MENSAJES"              TO WKS-TIT-R-NAME.                       
223500     SET  R01-MENSAJES      (TITLE)  TO WKS-TITULO-R00.                       
223600                                                                              
223700     OPEN OUTPUT   R01-MENSAJES.                                              
223720     MOVE 1 TO W77-OPEN-R01.                                                  
223730                                                                              
223735     SET  R02-TRPBENEF     (USERBACKUPNAME)  TO VALUE TRUE.                   
223740     MOVE "002TRASPMANUAL"           TO WKS-TIT-R-NAME.                       
223750     SET  R02-TRPBENEF      (TITLE)  TO WKS-TITULO-R00.                       
223760                                                                              
223770     OPEN OUTPUT   R02-TRPBENEF.                                              
223800                                                                              
223900     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
224000            OF MYSELF.                                                        
224100     ALLOW INTERRUPT.                                                         
224200                                                                              
224300***********************************************************                   
224400                                                                              
224500                                                                              
224600                                                                              
224700                                                                              
224800                                                                              
224900                                                                              
225000                                                                              
225100**************************************************************                
225200 40020000-S151-INICIO.                                                        
225300     MOVE 11                    TO WS-S151-0101-FUNCION-I.                    
225400     MOVE WKS-FEC-BASE          TO WS-S151-0101-FECCONT-I.                    
225500     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-FECMOV-I.                     
225600     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-HORAMOV-I.                    
225700     MOVE 22                    TO WS-S151-0101-TIPO-PROC-I.                  
225800                                                                              
225900     PERFORM 20000151-CARGAMOV1.                                              
226000                                                                              
226100     IF WS-S151-0101-STATUS > 0                                               
226400        MOVE WS-S151-0101-STATUS TO WS-MSG-N-04                               
226500        STRING "ERROR EN INICIO LIB S151 ", WS-MSG-N-04                       
226600               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
226700        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
226800        PERFORM 60613000-ESC-MENSAJES                                         
226900        PERFORM 70000050-MENSAJE                                              
227000        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
227100     ELSE                                                                     
227200        MOVE "INICIO LIB S151 OK " TO WLI-R01-MENSAJE                         
227300        PERFORM 60613000-ESC-MENSAJES.                                        
227400                                                                              
227500***************************************************************               
227600 40021000-S151-REBLOQUEA-50.                                                  
227700     MOVE 31                    TO WS-S151-0101-FUNCION-I.                    
227800     MOVE WKS-FEC-BASE          TO WS-S151-0101-FECCONT-I.                    
227900     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-FECMOV-I.                     
228000     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-HORAMOV-I.                    
228100     MOVE 22                    TO WS-S151-0101-TIPO-PROC-I.                  
228200     PERFORM 20000151-CARGAMOV1.                                              
228300                                                                              
228400     IF WS-S151-0101-STATUS > 0                                               
228700        MOVE WS-S151-0101-STATUS TO WS-MSG-N-04                               
228800        STRING "ERR REBLOQUEA-50 LIB S151 ", WS-MSG-N-04                      
228900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
229000        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
229100        PERFORM 60613000-ESC-MENSAJES                                         
229200        PERFORM 70000050-MENSAJE                                              
229300        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
229400     ELSE                                                                     
229500        MOVE "CALL REBLOQ-50 LIB S151 OK " TO WLI-R01-MENSAJE                 
229600        PERFORM 60613000-ESC-MENSAJES.                                        
229700                                                                              
229800***************************************************************               
229900 40030000-S151-DELMOV1.                                                       
230000     MOVE 21                  TO WS-S151-0101-FUNCION-I.                      
230100     MOVE WKS-FEC-BASE        TO WS-S151-0101-FECCONT-I.                      
230200     MOVE WKS-FEC-MAQ-08      TO WS-S151-0101-FECMOV-I.                       
230300     MOVE ZEROS               TO WS-S151-0101-PRODUCT-I                       
230400                                 WS-S151-0101-INSTRUMENTO-I.                  
230500     MOVE WKS-FEC-MAQ-08      TO WS-S151-0101-HORAMOV-I.                      
230600     MOVE 22                  TO WS-S151-0101-TIPO-PROC-I.                    
230700     PERFORM 20000151-CARGAMOV1.                                              
230800                                                                              
230900     IF WS-S151-0101-STATUS > 0                                               
231200        MOVE WS-S151-0101-STATUS      TO WS-MSG-RS                            
231300        STRING "ERR AL ELIMINAR(21) S151 ",  WS-MSG-RS                        
231400               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
231500        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
231600        PERFORM 60613000-ESC-MENSAJES                                         
231700        PERFORM 70000050-MENSAJE                                              
231800        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
231900     ELSE                                                                     
232000        MOVE "ELIMINA MOVTOS S151 INICIO OK "                                 
232100          TO WLI-R01-MENSAJE                                                  
232200        PERFORM 60613000-ESC-MENSAJES                                         
232300        MOVE ZERO TO WKS-IND-MOV.                                             
232400                                                                              
232500****************************************************************              
232600 40031000-S151-REBLOQUEA-01.                                                  
232700     MOVE 32                    TO WS-S151-0101-FUNCION-I.                    
232800     MOVE WKS-FEC-BASE          TO WS-S151-0101-FECCONT-I.                    
232900     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-FECMOV-I.                     
233000     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-HORAMOV-I.                    
233100     MOVE 22                    TO WS-S151-0101-TIPO-PROC-I.                  
233200     PERFORM 20000151-CARGAMOV1.                                              
233300                                                                              
233400     IF WS-S151-0101-STATUS > 0                                               
233700        MOVE WS-S151-0101-STATUS TO WS-MSG-N-04                               
233800        STRING "ERR REBLOQUEA-01 LIB S151 ", WS-MSG-N-04                      
233900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
234000        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
234100        PERFORM 60613000-ESC-MENSAJES                                         
234200        PERFORM 70000050-MENSAJE                                              
234300***     CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
234400     ELSE                                                                     
234500        MOVE "CALL REBLOQUEA-01 LIB S151 OK "                                 
234600          TO WLI-R01-MENSAJE                                                  
234700        PERFORM 60613000-ESC-MENSAJES.                                        
234800                                                                              
234900*************************************************************                 
235000 40040000-S151-FIN.                                                           
235100     MOVE 12                  TO WS-S151-0101-FUNCION-I.                      
235200     MOVE WKS-FEC-BASE        TO WS-S151-0101-FECCONT-I.                      
235300     MOVE WKS-FEC-MAQ-08      TO WS-S151-0101-FECMOV-I.                       
235400     MOVE WKS-FEC-MAQ-08      TO WS-S151-0101-HORAMOV-I.                      
235500     MOVE 22                  TO WS-S151-0101-TIPO-PROC-I.                    
235600     PERFORM 20000151-CARGAMOV1.                                              
235700                                                                              
235800     IF WS-S151-0101-STATUS > 0                                               
236100        MOVE WS-S151-0101-STATUS         TO WS-MSG-N-04                       
236200        STRING "ERROR EN FINAL  LIB S151 ", WS-MSG-N-04                       
236300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
236400        MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                         
236500        PERFORM 60613000-ESC-MENSAJES                                         
236600        PERFORM 70000050-MENSAJE                                              
236700****    CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
236800     ELSE                                                                     
236900        MOVE "CALL FIN LIB S151 OK " TO WLI-R01-MENSAJE                       
237000        PERFORM 60613000-ESC-MENSAJES.                                        
237100                                                                              
237200     CANCEL "REGISTRAS500".                                                   
237300                                                                              
237400********************************************************                      
237500 40050000-ELIMINA-S408.                                                       
237600     MOVE ALL @00@            TO WS-S408-FTO.                                 
237700     MOVE 45                  TO WS-S408-FUNCION.                             
237800     MOVE 102                 TO WS-S408-PASO.                                
237900     MOVE WKS-FEC-BASE        TO WS-S408-FECPRO.                              
238000     MOVE 30                  TO WS-S408-TIPOPROCESO.                         
238100     MOVE 0                   TO WS-S408-SUBPROCESO.                          
238200     MOVE 0                   TO WS-S408-STATUS.                              
238300                                                                              
238400     PERFORM 20000408-LINCRED.                                                
238500                                                                              
238600     IF WS-S408-STATUS = 0                                                    
238650        MOVE 1  TO W77-SW-S408                                                
238700        MOVE WS-S408-REFTRA   TO WS-MSG-N-12                                  
238800        MOVE WS-S408-AUTS408  TO WS-MSG-N-08                                  
238900        STRING "ELIM S408(45) OK ",                                           
239000               " MOVIMIENTOS ", WS-MSG-N-12,                                  
239100               " AUT-S408 ", WS-MSG-N-08                                      
239200        DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                
239300        PERFORM 60613000-ESC-MENSAJES                                         
239500     ELSE                                                                     
239600     IF WS-S408-STATUS = 96                                                   
239700        ADD 1 TO W77-CALL-S408-FAL                                            
239800        IF W77-CALL-S408-FAL > 4                                              
240100           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
240200           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
240300           STRING "ERR CALL(45) S408 RS=", WS-MSG-RS                          
240400                  " INTENTOS=", WS-MSG-N-04                                   
240500                  " (OK CUANDO ESTE DISPONIBLE S408L011LCRD)"                 
240600                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
240700           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
240800           PERFORM 60613000-ESC-MENSAJES                                      
240900           STOP WS-0101-MENSAJE                                               
241000           MOVE " "  TO WS-0101-TEXT-MSG                                      
241100           MOVE ZERO TO WS-S408-STATUS W77-CALL-S408-FAL                      
241200        ELSE                                                                  
241300           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
241400           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
241500           STRING "ERR CALL(45) S408 RS=", WS-MSG-RS                          
241600                  " INTENTOS=", WS-MSG-N-04                                   
241700                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
241800           PERFORM 60613000-ESC-MENSAJES                                      
241900           MOVE ZERO TO WS-S408-STATUS                                        
242000           WAIT(05)                                                           
242100     ELSE                                                                     
242400        MOVE WS-S408-STATUS   TO WS-MSG-RS                                    
242500        MOVE WS-S408-LINERROR TO WS-MSG-N-12                                  
242600        STRING "ERR CALL(45) S408 RS=", WS-MSG-RS                             
242700               " LINERR=" WS-MSG-N-12                                         
242800        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
242900        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
243000        PERFORM 60613000-ESC-MENSAJES                                         
243100        PERFORM 70000050-MENSAJE                                              
243200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
243300                                                                              
243400**************************************************************                
243500 40051000-S408-FIN.                                                           
243600     MOVE ALL @00@            TO WS-S408-FTO.                                 
243700     MOVE 37                  TO WS-S408-FUNCION.                             
243800     MOVE 102                 TO WS-S408-PASO.                                
243900     MOVE WKS-FEC-BASE        TO WS-S408-FECPRO.                              
244000     MOVE 30                  TO WS-S408-TIPOPROCESO.                         
244100     MOVE 0                   TO WS-S408-SUBPROCESO.                          
244200     MOVE 0                   TO WS-S408-STATUS.                              
244300                                                                              
244400     PERFORM 20000408-LINCRED-CTRL.                                           
244500                                                                              
244600     IF WS-S408-STATUS = 0                                                    
244620        MOVE 1                TO W77-SW-S408                                  
244700        MOVE WS-S408-STATUS   TO WS-MSG-RS                                    
244800        STRING "FIN DE DIA LIB S408 OK RS=", WS-MSG-RS                        
244900               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
245000        PERFORM 60613000-ESC-MENSAJES                                         
245100     ELSE                                                                     
245200     IF WS-S408-STATUS = 96                                                   
245300        ADD 1 TO W77-CALL-S408-FAL                                            
245400        IF W77-CALL-S408-FAL > 4                                              
245700           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
245800           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
245900           STRING "ERR CALL(37) S408 RS=", WS-MSG-RS                          
246000                  " INTENTOS=", WS-MSG-N-04                                   
246100                  " (OK CUANDO ESTE DISPONIBLE S408L011LCRD)"                 
246200                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
246300           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
246400           PERFORM 60613000-ESC-MENSAJES                                      
246500           STOP WS-0101-MENSAJE                                               
246600           MOVE " "  TO WS-0101-TEXT-MSG                                      
246700           MOVE ZERO TO WS-S408-STATUS W77-CALL-S408-FAL                      
246800        ELSE                                                                  
246900           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
247000           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
247100           STRING "ERR CALL(37) S408 RS=", WS-MSG-RS                          
247200                  " INTENTOS=", WS-MSG-N-04                                   
247300                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
247400           PERFORM 60613000-ESC-MENSAJES                                      
247500           MOVE ZERO TO WS-S408-STATUS                                        
247600           WAIT(05)                                                           
247700     ELSE                                                                     
247720        MOVE 1                TO W77-SW-S408                                  
248000        MOVE WS-S408-STATUS   TO WS-MSG-RS                                    
248100        MOVE WS-S408-LINERROR TO WS-MSG-N-12                                  
248200        STRING "ERR CALL(37) FIN DIA S408 ", WS-MSG-RS                        
248300               " LINERR" WS-MSG-N-12                                          
248400               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
248500        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
248600        PERFORM 60613000-ESC-MENSAJES                                         
248700        PERFORM 70000050-MENSAJE.                                             
248800                                                                              
248900     CANCEL "LINCRED".                                                        
249000                                                                              
249100*********************************************************                     
251400***************************************************************               
251500 50000000-PROCESO-PRINCIPAL.                                                  
251600     IF WKS-SIN-LBS151 = 1                                                    
251700        NEXT SENTENCE                                                         
251800     ELSE                                                                     
251900        PERFORM 40020000-S151-INICIO                                          
252000        PERFORM 40021000-S151-REBLOQUEA-50                                    
252100        PERFORM 40030000-S151-DELMOV1.                                        
252200                                                                              
252300     IF WKS-SIN-LBS408 = 1                                                    
252400        NEXT SENTENCE                                                         
252500     ELSE                                                                     
252600        MOVE ZERO TO W77-SW-S408                                              
252700                     W77-CALL-S408-FAL                                        
252800        PERFORM 40050000-ELIMINA-S408                                         
252900                UNTIL W77-SW-S408 = 1.                                        
253000                                                                              
253100                                                                              
253200     MOVE "B03  "          TO WKS-HI-TEX01.                                   
253300     MOVE " LEIDOS="       TO WKS-HI-TEX02.                                   
253400     MOVE " SEL="          TO WKS-HI-TEX04.                                   
253500     MOVE " CALL="         TO WKS-HI-TEX05.                                   
253600                                                                              
253700**   IF W77-HAY-PAGOLC = 1                                                    
253800        MOVE "INICIO PAGOS PENDIENTES Y ARCH P010 "                           
253810          TO WLI-R01-MENSAJE                                                  
253900        PERFORM 60613000-ESC-MENSAJES                                         
254000        SET S500B03CONTRATOS  TO BEGINNING                                    
254100        MOVE 1                TO WS-IND-INST                                  
254110                                                                              
254120        MOVE 3  TO W77-ID-NUMDSET-MAPLI                                       
254125        MOVE 1  TO W77-ID-NUMBASE-MAPLI                                       
254127        MOVE 0  TO W77-ID-NUMREG-PROC                                         
254130        PERFORM 70000600-REGS-EN-BASE                                         
254132        MOVE W77-ID-NUMREG-PROC  TO  W77-NUMREG-B03                           
254134        PERFORM 90005090-CALCULA-REGS                                         
254136                                                                              
254140        PERFORM 70000400-ACTI-02-PGOSPEND                                     
254150                                                                              
254200        PERFORM 50100000-LEE-BASE UNTIL W77-EOF-B03 = 1                       
254300                                                                              
254400        MOVE "INICIO ACT B09 Y B14 "  TO WLI-R01-MENSAJE                      
254500        PERFORM 60613000-ESC-MENSAJES                                         
254600                                                                              
254700        PERFORM 50600000-ACTUALIZA-GLOBALES                                   
254800                                                                              
254900        MOVE "FIN ACT B09 Y B14 "  TO WLI-R01-MENSAJE                         
255000        PERFORM 60613000-ESC-MENSAJES                                         
255100                                                                              
255120        MOVE W77-ID-ACT02-MAPLI    TO W77-ID-ACTXX-MAPLI                      
255140        PERFORM 70000910-FIN-ACTI-MAPLI                                       
255150                                                                              
255200        MOVE "TERMINO PAGOS PENDIENTES Y ARCH P010"                           
255210          TO WLI-R01-MENSAJE                                                  
255300        PERFORM 60613000-ESC-MENSAJES.                                        
255380                                                                              
255400                                                                              
255410*******************************************                                   
255420**** Aplicaciÿn archivo beneficencia  *****                                   
255430**** Calificaciÿn Traspasos Manuales  *****                                   
255440*******************************************                                   
255442     MOVE W77-TOT-B03-STORE TO W77-STOR-B03-ANT.                              
255444                                                                              
255450     PERFORM 70000420-ACTI-03-BENEF.                                          
255460                                                                              
255500     IF W77-HAY-ARCH-BENEF = 1                                                
255600        PERFORM 51000000-BENEFICENCIA                                         
255610     ELSE                                                                     
255620        STRING WKS-TIT-TRASPBENF " NO RESIDENTE "                             
255630               DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                     
255640        MOVE WLI-R02-L07-DETALLE TO WLI-R01-MENSAJE                           
255650        PERFORM 60613000-ESC-MENSAJES                                         
255660        PERFORM 60614000-ESC-R02.                                             
255700                                                                              
255720     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
255740     MOVE " "                TO W77-ID-TXTA-LIB.                              
255760     PERFORM 70000950-ACT-REGPROC.                                            
255780                                                                              
255800     MOVE W77-ID-ACT03-MAPLI    TO W77-ID-ACTXX-MAPLI                         
255900     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
255910                                                                              
255920*** GENERA ARCHIVO DE ESQUEMAS CONTABLES                                      
255930                                                                              
255940     PERFORM 90005094-ARCH-ESQCONT.                                           
255950***                                                                           
256000                                                                              
256100***********************************************                               
256800                                                                              
256850     PERFORM 70000700-ACTI-04-ACTCTRL.                                        
256900                                                                              
257000     PERFORM 59000000-ACTUALIZA-CONTROL.                                      
257100     CLOSE   S500BD01CAPTACION.                                               
257200                                                                              
257300     MOVE "*** CIERRO BASE DEL S500 "  TO WLI-R01-MENSAJE.                    
257400     PERFORM 60613000-ESC-MENSAJES.                                           
257500                                                                              
257600     IF WKS-SIN-LBS151 = 1                                                    
257700        NEXT SENTENCE                                                         
257800     ELSE                                                                     
257900        PERFORM 40031000-S151-REBLOQUEA-01                                    
258000        PERFORM 40040000-S151-FIN.                                            
258100                                                                              
258200************ FIN DE DIA A LIB/LINCRED S408 **************                     
258300     IF WKS-SIN-LBS408 = 1                                                    
258400        NEXT SENTENCE                                                         
258500     ELSE                                                                     
258600        MOVE ZERO TO W77-SW-S408                                              
258700                     W77-CALL-S408-FAL                                        
258800        PERFORM 40051000-S408-FIN                                             
258900                UNTIL W77-SW-S408 = 1.                                        
259000                                                                              
259100                                                                              
259200***********************************************************                   
259300 50100000-LEE-BASE.                                                           
259400     MOVE ZERO TO W77-SI-PROCESO WKS-SI-B03 WKS-SI-B06.                       
259500     MOVE ZERO TO W77-SI-DESBLOQUEO.                                          
259600     PERFORM 50101000-DAME-BDCONTRATO.                                        
259700     IF B03-MARCA-CLON= 2                                                     
259705        EXIT PERFORM.                                                         
259710*INI ECC PROTECCION DE COBROS CHUBB SEGUROS                                   
259715     IF W77-EOF-B03 = 0                                                       
259720        IF B03-PCOBP-PENDTE  NOT = 0 AND                                      
259725           WKS-FEC-BASE      NOT = B03-FEC-VENT-CIEGA                         
259730           MOVE ZEROS       TO B03-PCOBP-PENDTE                               
259735                               B03-IND-PROTECSDO                              
259740                               B03-LIB-SDOPROTEG                              
259745                               B03-IND-PROTNOM                                
259750                               B03-FEC-VENT-CIEGA                             
259752           PERFORM 50110100-INICIALIZA-SDOBLOQ                                
259755           MOVE 1 TO WKS-SI-B03                                               
259760           PERFORM 50125000-STORE-BASE.                                       
259765*FIN ECC PROTECCION DE COBROS CHUBB SEGUROS                                   
259770                                                                              
259800     IF W77-EOF-B03 = 0                                                       
259900        MOVE W77-TOT-B03-CTOS      TO WKS-HI-LEIDOS                           
260000        MOVE W77-TOT-B03-SELEC     TO WKS-HI-REGSEL                           
260100        MOVE W77-CALLS-S408        TO WKS-HI-NUMCALL                          
260200        IF W77-SI-PROCESO = 1                                                 
260300           PERFORM 50102000-DAME-BDHISTORICO                                  
260400           PERFORM 50104000-DAME-INSTRUMENTO                                  
260500           PERFORM 50110000-ACTUALIZACION.                                    
260520                                                                              
260522     IF W77-SI-DESBLOQUEO = 1                                                 
260524        PERFORM 50110100-INICIALIZA-SDOBLOQ                                   
260526        MOVE 1       TO WKS-SI-B03                                            
260528        PERFORM 50125000-STORE-BASE.                                          
260530                                                                              
260540     IF W77-EOF-B03 = 0                                                       
260560        MOVE W77-ID-ACT02-MAPLI    TO W77-ID-ACTXX-MAPLI                      
260561        MOVE " "                   TO W77-ID-TXTA-LIB                         
260562        MOVE W77-TOT-B03-CTOS      TO WS-MSG-N-08                             
260564        STRING "CTOS LEIDOS B03 = "   WS-MSG-N-08                             
260566                   " ULTIMO CTO = "   WS03-NUM-CONTRATO                       
260568               DELIMITED BY SIZE INTO W77-ID-TXTA-LIB                         
260580        PERFORM 70000950-ACT-REGPROC.                                         
260600                                                                              
260700***********************************************************                   
260800 50101000-DAME-BDCONTRATO.                                                    
261700                                                                              
261800     PERFORM 90000003-B03CONTRATOS-LOCKN.                                     
261900                                                                              
262500                                                                              
262600     IF WS-STATUS-BASE > 0                                                    
262700        IF WS-DB-NOTFOUND                                                     
262800           MOVE 1                     TO  W77-EOF-B03                         
262900        ELSE                                                                  
263200           MOVE WS-NUM-CONTRATO       TO WS-MSG-CTO                           
263300           STRING "ERR LOCKN B03SXCTO CTO=", WS-MSG-CTO                       
263310                  " STA=" WS-STATUS-BASE                                      
263400                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
263500           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
263600           PERFORM 60613000-ESC-MENSAJES                                      
263700           PERFORM 70000050-MENSAJE                                           
263800           CALL SYSTEM DMTERMINATE.                                           
263900                                                                              
264000     IF W77-EOF-B03 = 0                                                       
264020      IF B03-MARCA-CLON= 2                                                    
264040         EXIT PERFORM                                                         
264060      ELSE                                                                    
264100        ADD 1 TO W77-TOT-B03-CTOS                                             
264200        IF B03-STATUS < 2 OR B03-STATUS = 5                                   
264300           IF (B03-IND-PENDLC > 0    OR B03-SDO-PENDIENTE > 0)                
264400           OR  B03-IND-PROTECSDO > 0                                          
264450           OR  B03-SELLO-GCE     > 0                                          
264470           OR  B03-CGO-PENDSAB > 0                                            
264500              MOVE 1 TO W77-SI-PROCESO                                        
264600              PERFORM 50101100-MUEVE-B03-WKS                                  
264700              ADD  1 TO W77-TOT-B03-SELEC.                                    
264710                                                                              
264712     IF W77-EOF-B03 = 0                                                       
264714     AND B03-SDO-BLOQ-GCE > 0                                                 
264716         MOVE 1 TO W77-SI-DESBLOQUEO.                                         
264718                                                                              
264720     IF W77-EOF-B03 = 0                                                       
264722        IF W77-BAN-REGS = 2                                                   
264724           PERFORM 90005092-SELEC-REGS.                                       
264800                                                                              
264900********************************************************                      
265000 50101100-MUEVE-B03-WKS.                                                      
265100     MOVE B03-SUC-PROMOTORA   TO WS03-SUC-PROMOTORA.                          
265200     MOVE B03-NUM-CONTRATO    TO WS03-NUM-CONTRATO.                           
265300     MOVE B03-NUM-CLIENTE     TO WS03-NUM-CLIENTE.                            
265400     MOVE B03-NUM-PRODUCTO    TO WS03-NUM-PRODUCTO.                           
265500     MOVE B03-NUM-INSTRUM     TO WS03-NUM-INSTRUM.                            
265600     MOVE B03-MONEDA          TO WS03-MONEDA.                                 
265700     MOVE B03-CTA-CONCENT     TO WS03-CTA-CONCENT.                            
265800     MOVE B03-FEC-APERTURA    TO WS03-FEC-APERTURA.                           
265900     MOVE B03-DIA-CORTE       TO WS03-DIA-CORTE.                              
266000***  MOVE B03-DIA-CORTE-ANT   TO WS03-DIA-CORTE-ANT.                          
266100     MOVE B03-SDO-ANTERIOR    TO WS03-SDO-ANTERIOR.                           
266200     MOVE B03-SDO-ACTUAL      TO WS03-SDO-ACTUAL.                             
266300***  MOVE B03-SDO-PENDIENTE   TO WS03-SDO-PENDIENTE.                          
266400***  MOVE B03-FEC-SDOPEN      TO WS03-FEC-SDOPEN.                             
266500***  MOVE B03-IMPUESTO-RET    TO WS03-IMPUESTO-RET.                           
266600***  MOVE B03-SDO-SBC         TO WS03-SDO-SBC.                                
266700***  MOVE B03-AUT-PENDIENTE   TO WS03-AUT-PENDIENTE.                          
266800***  MOVE B03-SDO-PROTEGIDO   TO WS03-SDO-PROTEGIDO.                          
266810     MOVE B03-IMPSOL-BLOQ     TO WS03-IMPSOL-BLOQ.                            
266812     MOVE B03-SDOPROT-BLOQ    TO WS03-SDOPROT-BLOQ.                           
266900     MOVE B03-TIPO-PERSONA    TO WS03-TIPO-PERSONA.                           
267000***  MOVE B03-BANCA           TO WS03-BANCA.                                  
267100     MOVE B03-SECTOR          TO WS03-SECTOR.                                 
267200***  MOVE B03-FEC-ULTMOV      TO WS03-FEC-ULTMOV.                             
267300***  MOVE B03-FEC-ULTACT      TO WS03-FEC-ULTACT.                             
267400     MOVE B03-STATUS          TO WS03-STATUS.                                 
267500     MOVE B03-TIPO-BLOQUEO    TO WS03-TIPO-BLOQUEO.                           
267600***  MOVE B03-RESTRICCIONES   TO WS03-RESTRICCIONES.                          
267700***  MOVE B03-REST-CTACONCE   TO WS03-REST-CTACONCE.                          
267800     MOVE B03-ESTACION-LB     TO WS03-ESTACION-LB.                            
267900***  MOVE B03-IND-2DAREF      TO WS03-IND-2DAREF.                             
268000***  MOVE B03-MODVALI-CTCON   TO WS03-MODVALI-CTCON.                          
268100***  MOVE B03-MODULO-DIGITO   TO WS03-MODULO-DIGITO.                          
268200***  MOVE B03-NIV-SEGLOGICA   TO WS03-NIV-SEGLOGICA.                          
268300***  MOVE B03-INTS-CAPIT      TO WS03-INTS-CAPIT.                             
268400     MOVE B03-SDO-FINCORTE    TO WS03-SDO-FINCORTE.                           
268500***  MOVE B03-FEC-CORTE(1)    TO WS03-FEC-CORTE(1).                           
268600***  MOVE B03-FEC-CORTE(2)    TO WS03-FEC-CORTE(2).                           
268700***  MOVE B03-FEC-CORTE(3)    TO WS03-FEC-CORTE(3).                           
268800***  MOVE B03-IND-LINCREDIT   TO WS03-IND-LINCREDIT.                          
268900***  MOVE B03-IND-PENDLC      TO WS03-IND-PENDLC.                             
269000     MOVE B03-IND-COMPENDTE   TO WS03-IND-COMPENDTE.                          
269100***  MOVE B03-TASA-ANTERIOR   TO WS03-TASA-ANTERIOR.                          
269200***  MOVE B03-TASA-ANT-ANT    TO WS03-TASA-ANT-ANT.                           
269300***  MOVE B03-NUM-MOVS        TO WS03-NUM-MOVS.                               
269400***  MOVE B03-NOMBRE          TO WS03-NOMBRE.                                 
269500     MOVE B03-TIPO-CUENTA     TO WS03-TIPO-CUENTA.                            
269600     MOVE B03-PRODUCTO-NVO    TO WS03-PRODUCTO-NVO.                           
269700     MOVE B03-INSTRUM-NVO     TO WS03-INSTRUM-NVO.                            
269800     MOVE B03-FEC-CAMBPROD    TO WS03-FEC-CAMBPROD.                           
269900***  MOVE B03-PRODUCTO-ANT    TO WS03-PRODUCTO-ANT.                           
270000***  MOVE B03-INSTRUM-ANT     TO WS03-INSTRUM-ANT.                            
270100***  MOVE B03-IMP-CGOSDIA     TO WS03-IMP-CGOSDIA.                            
270200***  MOVE B03-IMP-ABOSDIA     TO WS03-IMP-ABOSDIA.                            
270300***  MOVE B03-IND-LC-CANCEL   TO WS03-IND-LC-CANCEL.                          
270400***  MOVE B03-STA-CANCEL      TO WS03-STA-CANCEL.                             
270500***  MOVE B03-TRAS-CTO(1)     TO WS03-TRAS-CTO(1).                            
270600***  MOVE B03-TRAS-CTO(2)     TO WS03-TRAS-CTO(2).                            
270700***  MOVE B03-TRAS-CTO(3)     TO WS03-TRAS-CTO(3).                            
270800     MOVE B03-FEC-LCINV       TO WS03-FEC-LCINV.                              
270900                                                                              
271000     IF B03-CTA-CONCENT = 8                                                   
271100        MOVE 99               TO W77-SEC-ESQCONT                              
271200     ELSE                                                                     
271300        MOVE B03-SECTOR       TO W77-SEC-ESQCONT.                             
271400                                                                              
271500********************************************************                      
271600 50102000-DAME-BDHISTORICO.                                                   
271700     MOVE B03-NUM-CONTRATO         TO WS-NUM-CONTRATO.                        
271800                                                                              
272700                                                                              
272800     PERFORM 90000006-B06SXCTO-LOCK.                                          
272900                                                                              
273500                                                                              
273600     IF WS-STATUS-BASE > 0                                                    
273900        MOVE B03-NUM-CONTRATO      TO WS-MSG-CTO                              
274000        STRING "ERR LOCK B06SXCTO CTO=", WS-MSG-CTO                           
274010               " STA=", WS-STATUS-BASE                                        
274100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
274200        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
274300        PERFORM 60613000-ESC-MENSAJES                                         
274400        PERFORM 70000050-MENSAJE                                              
274500        CALL SYSTEM DMTERMINATE.                                              
274600                                                                              
274700                                                                              
274800*******************************************************                       
274900 50104000-DAME-INSTRUMENTO.                                                   
275000     MOVE ZERO  TO W77-SAME-ANT.                                              
275100     IF  (B03-NUM-PRODUCTO = TB-B05-PROD(WS-IND-INST)                         
275200     AND  B03-NUM-INSTRUM  = TB-B05-INST(WS-IND-INST)                         
275300     AND  B03-MONEDA       = TB-B05-MONEDA(WS-IND-INST))                      
275400          MOVE 1 TO W77-SAME-ANT                                              
275500     ELSE                                                                     
275600          PERFORM 50104100-DAME-INDICE-INSTR                                  
275700            VARYING WS-IND-INST FROM 1 BY 1                                   
275800            UNTIL (WS-IND-INST > 30)                                          
275900              OR  (TB-B05-PROD(WS-IND-INST)   = B03-NUM-PRODUCTO              
276000              AND  TB-B05-INST(WS-IND-INST)   = B03-NUM-INSTRUM               
276100              AND  TB-B05-MONEDA(WS-IND-INST) = B03-MONEDA).                  
276200                                                                              
276300                                                                              
276400     IF WS-IND-INST > 30                                                      
276700        MOVE B03-NUM-PRODUCTO    TO WS-MSG-PRD                                
276800        MOVE B03-NUM-INSTRUM     TO WS-MSG-INST                               
276900        MOVE B03-MONEDA          TO WS-MSG-MDA                                
277000        STRING "NO HAY INSTR ", WS-MSG-PRD                                    
277100                           " ", WS-MSG-INST                                   
277200                           " ", WS-MSG-MDA                                    
277300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
277400        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
277500        PERFORM 60613000-ESC-MENSAJES                                         
277600        PERFORM 70000050-MENSAJE                                              
277700        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
277800                                                                              
277900     IF WS-IND-INST NOT = WKS-INST-MEM                                        
278000        MOVE WS-IND-INST TO WKS-INST-MEM                                      
278100        MOVE ZERO        TO W77-SAME-ANT.                                     
278200                                                                              
278300     IF  W77-SAME-ANT = 1                                                     
278400     AND W77-SECTOR-ANT = W77-SEC-ESQCONT                                     
278500         NEXT SENTENCE                                                        
278600     ELSE                                                                     
278700        MOVE B03-NUM-PRODUCTO  TO WS-NUM-PRODUCTO  WS-MSG-PRD                 
278800        MOVE B03-NUM-INSTRUM   TO WS-NUM-INSTRUM   WS-MSG-INST                
278900        MOVE B03-MONEDA        TO WS-MONEDA        WS-MSG-MDA                 
279000        PERFORM 50104005-LEE-ESQCONT                                          
279100        MOVE W77-SEC-ESQCONT   TO W77-SECTOR-ANT                              
279200        IF W77-SEC-ESQCONT = 0                                                
279300           MOVE B22-ESQCON-DEFLT    TO WKS-ESQ-CONTABLE                       
279400        ELSE                                                                  
279500           MOVE ZERO TO WKS-HAY-ESQ                                           
279600           PERFORM 50104200-DAME-ESQ-CONT                                     
279700                   VARYING WKS-IND-ESQ  FROM 1 BY 1                           
279800                   UNTIL   (WKS-IND-ESQ > 20)                                 
279900                   OR      (WKS-HAY-ESQ = 1)                                  
280000          IF WKS-HAY-ESQ = 0                                                  
280100             MOVE B22-ESQCON-DEFLT    TO WKS-ESQ-CONTABLE.                    
280200                                                                              
280300*************************************************************                 
280400 50104100-DAME-INDICE-INSTR.                                                  
280500                                                                              
280600**************************************************************                
280700 50104005-LEE-ESQCONT.                                                        
280800     MOVE 002002      TO WS-LLAVE-BANCOS  WS-MSG-N-06.                        
280900     PERFORM 90000022-B22SXESQCONTXPRD-FIND.                                  
281000                                                                              
281100     IF WS-STATUS-BASE > 0                                                    
281400        STRING "ERR FIND B22SXESQCONTXPROD ", WS-STATUS-BASE                  
281500               " BCOS=" WS-MSG-N-06                                           
281600               " PROD=" WS-MSG-PRD                                            
281700               " INST=" WS-MSG-INST                                           
281800               " MONE=" WS-MSG-MDA                                            
281900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
282000        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
282100        PERFORM 60613000-ESC-MENSAJES                                         
282200        PERFORM 70000050-MENSAJE                                              
282300        CALL SYSTEM DMTERMINATE.                                              
282400                                                                              
282500*************************************************************                 
282600 50104200-DAME-ESQ-CONT.                                                      
282700     IF B22-SECTOR(WKS-IND-ESQ) = W77-SEC-ESQCONT                             
282800        MOVE B22-ESQCONT(WKS-IND-ESQ)  TO WKS-ESQ-CONTABLE                    
282900        MOVE 1                         TO WKS-HAY-ESQ.                        
283000                                                                              
283100*************************************************************                 
283200 50104800-DAME-CVEFUNCION.                                                    
283300     IF B17-CLAVE-TRANS NOT = WS-CLAVE-TRANS                                  
283400        PERFORM 90000017-B17AXCLAVE-FIND                                      
283500        IF WS-STATUS-BASE > 0                                                 
283800           MOVE WS-CLAVE-TRANS    TO WS-MSG-N-04                              
283900           STRING "ERR FIND B17XCVE CVE=", WS-MSG-N-04                        
283910                  " STA=" WS-STATUS-BASE                                      
284000                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
284100           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
284200           PERFORM 60613000-ESC-MENSAJES                                      
284300           PERFORM 70000050-MENSAJE                                           
284400           CALL SYSTEM DMTERMINATE.                                           
284500                                                                              
284600***************************************************************               
284700 50104900-BUSCA-CVE-MEM.                                                      
284800     MOVE ZEROS                 TO WKS-HAY-CVE.                               
284900     IF WS-CLAVE-TRANS = WKS-TAB-CVEVAL(WKS-IND-TBCVE)                        
285000        NEXT SENTENCE                                                         
285100     ELSE                                                                     
285200        PERFORM 50104920-DAME-INDTBCVE                                        
285300        IF WKS-HAY-CVE = 9                                                    
285600           MOVE WS-CLAVE-TRANS    TO WS-MSG-N-04                              
285700           STRING  "NO HAY EN TABLA CVE ", WS-MSG-N-04                        
285800                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
285900           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
286000           PERFORM 60613000-ESC-MENSAJES                                      
286100           PERFORM 70000050-MENSAJE                                           
286200           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
286300                                                                              
286400*******************************************************                       
286500 50104920-DAME-INDTBCVE.                                                      
286600     MOVE 1                  TO WKS-IND-B.                                    
286700     MOVE WKS-IND-MXCVE      TO WKS-IND-A.                                    
286800     IF WKS-TAB-CVEVAL(WKS-IND-B) = WS-CLAVE-TRANS                            
286900        MOVE WKS-IND-B       TO WKS-IND-TBCVE                                 
287000        MOVE 1               TO WKS-HAY-CVE                                   
287100     ELSE                                                                     
287200     IF WKS-TAB-CVEVAL(WKS-IND-B) > WS-CLAVE-TRANS                            
287300        MOVE 9               TO WKS-HAY-CVE                                   
287400     ELSE                                                                     
287500     IF WKS-TAB-CVEVAL(WKS-IND-A) = WS-CLAVE-TRANS                            
287600        MOVE WKS-IND-A       TO WKS-IND-TBCVE                                 
287700        MOVE 1               TO WKS-HAY-CVE                                   
287800     ELSE                                                                     
287900     IF WKS-TAB-CVEVAL(WKS-IND-A) < WS-CLAVE-TRANS                            
288000        MOVE 9               TO WKS-HAY-CVE                                   
288100     ELSE                                                                     
288200        PERFORM 50104930-BUSCA-BIN-CVE UNTIL WKS-HAY-CVE > 0.                 
288300                                                                              
288400***********************************************************                   
288500 50104930-BUSCA-BIN-CVE.                                                      
288600     SUBTRACT WKS-IND-B FROM WKS-IND-A  GIVING WKS-IND-C.                     
288700     IF WKS-IND-C  < 2                                                        
288800        MOVE 9   TO WKS-HAY-CVE                                               
288900     ELSE                                                                     
289000        COMPUTE WKS-IND-C = (WKS-IND-B + WKS-IND-A) / 2                       
289100        IF WKS-TAB-CVEVAL(WKS-IND-C) = WS-CLAVE-TRANS                         
289200           MOVE WKS-IND-C       TO WKS-IND-TBCVE                              
289300           MOVE 1               TO WKS-HAY-CVE                                
289400        ELSE                                                                  
289500        IF WKS-TAB-CVEVAL(WKS-IND-C) > WS-CLAVE-TRANS                         
289600           MOVE WKS-IND-C       TO WKS-IND-A                                  
289700        ELSE                                                                  
289800           MOVE WKS-IND-C       TO WKS-IND-B.                                 
289900                                                                              
290000***********************************************************                   
290010 50110000-ACTUALIZACION.                                                      
290015     IF B03-CGO-PENDSAB   > 0                                                 
290020        IF B03-FEC-SAB    = B02-FECHA-LOTE                                    
290025           IF B03-HORA-SAB < 1901                                             
290030              MOVE 0 TO B03-CGO-PENDSAB B03-FEC-SAB B03-HORA-SAB              
290035              MOVE 1 TO WKS-SI-B03                                            
290040              IF B03-IND-LINCREDIT > 0                                        
290045                 MOVE 1 TO  B03-IND-PENDLC                                    
290050              ELSE                                                            
290055                 NEXT SENTENCE                                                
290060           ELSE                                                               
290065              NEXT SENTENCE                                                   
290070        ELSE                                                                  
290075           IF B03-FEC-SAB < B02-FECHA-LOTE                                    
290080              MOVE 0   TO B03-CGO-PENDSAB B03-FEC-SAB B03-HORA-SAB            
290085              MOVE 1   TO WKS-SI-B03                                          
290090              IF B03-IND-LINCREDIT > 0                                        
290095                 MOVE 1   TO  B03-IND-PENDLC.                                 
290105     IF B03-IND-PROTECSDO > 0                                                 
290110        PERFORM 50124000-GEN-ARCH-P010.                                       
290115                                                                              
290116     IF B03-SELLO-GCE = 1                                                     
290117        MOVE B03-NUM-CONTRATO TO WS-MSG-N-12                                  
290118        MOVE B03-SELLO-GCE    TO WS-MSG-N-01                                  
290119        STRING "EL CONTRATO " WS-MSG-N-12                                     
290120               " TIENE SELLO GCE " WS-MSG-N-01                                
290121               " SE QUITA SELLO"                                              
290122                DELIMITED BY SIZE INTO WLI-R01-MENSAJE                        
290123        PERFORM 60613000-ESC-MENSAJES                                         
290124        MOVE 0       TO B03-SELLO-GCE                                         
290125        MOVE 1       TO WKS-SI-B03.                                           
290126                                                                              
290127     IF W77-HAY-PAGOLC = 1                                                    
290128        IF B03-IND-PENDLC > 0                                                 
290130        OR B03-SDO-PENDIENTE > 0                                              
290135           PERFORM 50110010-SIGUE-ACT.                                        
290140                                                                              
290141     IF W77-SI-DESBLOQUEO = 1                                                 
290142        PERFORM 50110100-INICIALIZA-SDOBLOQ                                   
290143        MOVE 1       TO WKS-SI-B03.                                           
290144                                                                              
290145     IF WKS-SI-B03 = 1                                                        
290150        PERFORM 50125000-STORE-BASE.                                          
290155                                                                              
290160*************************************************************                 
290165 50110010-SIGUE-ACT.                                                          
290200     MOVE ZERO TO W77-HAY-SDO-PEND.                                           
290300                                                                              
290400     IF B03-SDO-PENDIENTE > 0                                                 
290500        PERFORM 50111200-SALDO-PENDIENTE.                                     
290600                                                                              
290700     PERFORM 50111300-CALCULA-DISPONIBLE.                                     
290800                                                                              
290900     MOVE WKS-SDO-DISPONIBLE  TO WKS-DISPONIBLE-ANT.                          
291000                                                                              
291100     IF WKS-SIN-LBS408 = 1                                                    
291200        NEXT SENTENCE                                                         
291300     ELSE                                                                     
291400        IF (B03-IND-PENDLC = 1)                                               
291500        OR (W77-HAY-SDO-PEND = 1 AND B03-IND-LINCREDIT > 0)                   
291510** para pago de lineas de crôdito no se considera B03-SDOPROT-BLOQ            
291600            IF B03-SDO-ACTUAL > 0                                             
291700               PERFORM 50112000-SDO-PENDTE-LC                                 
291800            ELSE                                                              
291900            IF B03-IND-PENDLC > 0                                             
292000               MOVE ZERO  TO B03-IND-PENDLC                                   
292100               MOVE 1         TO WKS-SI-B03.                                  
292200                                                                              
292300***  IF WKS-SDO-DISPONIBLE NOT = WKS-DISPONIBLE-ANT                           
292400***     IF WS03-88-PIM-CTAMAE                                                 
292500***     OR WS03-88-PIM-CTAMAEOP                                               
292700***        PERFORM 50116650-VE-FIDEICOMISO.                                   
292800                                                                              
292900                                                                              
293000     PERFORM 50123000-ENVIA-MOVSS408.                                         
293100                                                                              
293200     IF W77-HAY-MOVBATCH = 1                                                  
293300        MOVE WKS-FEC-BASE    TO B03-FEC-ULTACT                                
293400        MOVE ZERO            TO W77-HAY-MOVBATCH                              
293500        MOVE 1               TO WKS-SI-B03.                                   
293600                                                                              
294700                                                                              
294800     IF WKS-SI-B03 = 1                                                        
294900     OR WKS-SI-B06 = 1                                                        
295000        PERFORM 50125000-STORE-BASE.                                          
295100                                                                              
295700                                                                              
295800*****************************************************                         
295900 50111200-SALDO-PENDIENTE.                                                    
296000                                                                              
296100     ADD  B03-SDO-PENDIENTE    TO B03-SDO-ACTUAL.                             
296200     MOVE 0                    TO B03-SDO-PENDIENTE.                          
296300     MOVE WKS-FEC-BASE         TO B03-FEC-ULTACT.                             
296400     MOVE 1                    TO WKS-SI-B03                                  
296500                                  W77-HAY-SDO-PEND.                           
296600                                                                              
296700                                                                              
296800*****************************************************                         
296900                                                                              
297000***********************************************************                   
297002*** para calcular DISPONIBLE no se considera B03-SDOPROT-BLOQ                 
297004*** este campo ya est¾ restado del saldo actual                               
297100 50111300-CALCULA-DISPONIBLE.                                                 
297200                                                                              
297610     COMPUTE WKS-SDO-DISPONIBLE = B03-SDO-ACTUAL    -                         
297620                                  B03-CGO-PENDSAB   -                         
297630                                  B03-AUT-PENDIENTE -                         
297640                                  B03-PCOBP-PENDTE  -                         
297650                                  B03-SDO-DAACT-TES -                         
297660                                  B03-SDO-BLOQ-GCE.                           
297670     IF WKS-SDO-DISPONIBLE < 0                                                
297700        MOVE 0 TO WKS-SDO-DISPONIBLE.                                         
297800                                                                              
297900     IF B03-SDO-ACTUAL < 0                                                    
298000        MOVE B03-NUM-CONTRATO  TO WS-MSG-CTO                                  
298100        MOVE B03-SDO-ACTUAL    TO W77-IMP-EDIT                                
298200        MOVE B03-SDO-PENDIENTE TO W77-IMP-EDIT2                               
298210        MOVE B03-SDOPROT-BLOQ  TO W77-IMP-EDIT1                               
298300        STRING "S/ACT NEG ENT/P102 ",                                         
298400                  "CTO ", WS-MSG-CTO                                          
298500               " S/ACT=", W77-IMP-EDIT                                        
298600               " S/PEN=", W77-IMP-EDIT2                                       
298610              " S/BLOQ=", W77-IMP-EDIT1                                       
298700               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
298800        PERFORM 60613000-ESC-MENSAJES.                                        
298900                                                                              
299000**********************************************************                    
299100 50112000-SDO-PENDTE-LC.                                                      
299200     MOVE ZERO TO W77-SW-S408 W77-CALL-S408-FAL.                              
299300                                                                              
299350     IF WKS-SDO-DISPONIBLE > 0                                                
299400        PERFORM 50112050-PAGA-SDOLC                                           
299500             UNTIL W77-SW-S408 = 1.                                           
299600                                                                              
299700****************************************************************              
299800 50112050-PAGA-SDOLC.                                                         
299900     ADD  1                      TO W77-CALLS-S408.                           
300000     MOVE ALL @00@               TO WS-S408-FTO.                              
300100     MOVE 35                     TO WS-S408-FUNCION.                          
300200     MOVE 102                    TO WS-S408-PASO.                             
300300     MOVE WKS-FEC-BASE           TO WS-S408-FECPRO.                           
300400     MOVE B03-SUC-PROMOTORA      TO WS-S408-SUCOPER.                          
300500     MOVE 01                     TO WS-S408-CAJA.                             
300590** para pago de lineas de crôdito no se considera B03-SDOPROT-BLOQ            
300600     MOVE WKS-SDO-DISPONIBLE     TO WS-S408-IMPORTE.                          
300700     MOVE 30                     TO WS-S408-TIPOPROCESO.                      
300800     MOVE 0                      TO WS-S408-SUBPROCESO.                       
300900     MOVE 0                      TO WS-S408-STATUS.                           
301000                                                                              
301100     MOVE W77-MY-AUTORIZ         TO WS-S408-AUTS500.                          
301200     MOVE WKS-FEC-MAQ-08         TO WS-S408-FECHATRA.                         
301300     MOVE WKS-HORA-MAQ-INI       TO WS-S408-HORATRA.                          
301400                                                                              
302300                                                                              
302400     PERFORM 20000408-LINCRED.                                                
302500                                                                              
303100                                                                              
303200     IF WS-S408-STATUS = 0                                                    
303300        MOVE 1  TO W77-SW-S408                                                
303400        PERFORM 50112110-APLICA-SDOLC                                         
303500     ELSE                                                                     
303600     IF WS-S408-STATUS = 96                                                   
303700        ADD 1 TO W77-CALL-S408-FAL                                            
303800        IF W77-CALL-S408-FAL > 4                                              
304100           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
304200           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
304300           STRING "ERR CALL(35) S408 RS=", WS-MSG-RS                          
304400                  " INTENTOS=", WS-MSG-N-04                                   
304500                  " (OK CUANDO ESTE DISPONIBLE S408L011LCRD)"                 
304600                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
304700           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
304800           PERFORM 60613000-ESC-MENSAJES                                      
304900           STOP WS-0101-MENSAJE                                               
305000           MOVE " "  TO WS-0101-TEXT-MSG                                      
305100           MOVE ZERO TO W77-CALL-S408-FAL                                     
305200        ELSE                                                                  
305300           MOVE WS-S408-STATUS    TO WS-MSG-RS                                
305400           MOVE W77-CALL-S408-FAL TO WS-MSG-N-04                              
305500           STRING "ERR CALL(35) S408 RS=", WS-MSG-RS                          
305600                  " INTENTOS=", WS-MSG-N-04                                   
305700                  DELIMITED BY SIZE INTO WLI-R01-MENSAJE                      
305800           PERFORM 60613000-ESC-MENSAJES                                      
305900           WAIT(05)                                                           
306000     ELSE                                                                     
306100        MOVE 1  TO W77-SW-S408                                                
306200        PERFORM 50112100-ERRS408-PAGO.                                        
306300                                                                              
306400********************************************************                      
306500                                                                              
306600                                                                              
306700***************************************************************               
306800 50112100-ERRS408-PAGO.                                                       
306900     MOVE B03-NUM-CONTRATO     TO WS-MSG-CTO.                                 
307000     MOVE B03-NUM-PRODUCTO     TO WS-MSG-PRD.                                 
307100     MOVE B03-NUM-INSTRUM      TO WS-MSG-INST.                                
307200     MOVE B03-MONEDA           TO WS-MSG-MDA.                                 
307300     MOVE B03-SUC-PROMOTORA    TO WS-MSG-SUC.                                 
307400     MOVE WS-S408-STATUS       TO WS-MSG-RS.                                  
307500     MOVE WKS-SDO-DISPONIBLE   TO W77-IMP-EDIT.                               
307600     MOVE WS-S408-LINERROR     TO WS-MSG-N-12.                                
307700     MOVE WS-S408-RESEXIST     TO WS-MSG-N-02.                                
307800     STRING "ERR CALL(35) S408",                                              
307900            " RS=",  WS-MSG-RS,    " SUC=",     WS-MSG-SUC,                   
308000            " CTO=", WS-MSG-CTO,   " PRD=",     WS-MSG-PRD,                   
308100            " INS=", WS-MSG-INST,  " MON=",     WS-MSG-MDA,                   
308200            " IMP=", W77-IMP-EDIT, " REX=",     WS-MSG-N-02,                  
308300            " LER",  WS-MSG-N-12                                              
308400     DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                   
308500     PERFORM 60613000-ESC-MENSAJES.                                           
308600                                                                              
308700     IF WS-S408-RESEXIST = 99                                                 
308800        NEXT SENTENCE                                                         
308900     ELSE                                                                     
309000     IF WS-S408-RESEXIST NOT = B03-IND-LINCREDIT                              
309100        MOVE WS-S408-RESEXIST  TO B03-IND-LINCREDIT                           
309200        MOVE 1                 TO WKS-SI-B03.                                 
309300                                                                              
309400     IF B03-IND-LINCREDIT = 0                                                 
309500        IF B03-IND-PENDLC > 0                                                 
309600           MOVE ZERO  TO  B03-IND-PENDLC                                      
309700           MOVE 1     TO  WKS-SI-B03                                          
309800        ELSE                                                                  
309900           NEXT SENTENCE                                                      
310000     ELSE                                                                     
310100     IF B03-IND-PENDLC = 0                                                    
310200        MOVE 1     TO B03-IND-PENDLC                                          
310300        MOVE 1     TO WKS-SI-B03.                                             
310400                                                                              
310500*************************************************************                 
310600 50112110-APLICA-SDOLC.                                                       
310700     COMPUTE WKS-PAGO-S408 =                                                  
310800             WKS-SDO-DISPONIBLE  - WS-S408-IMP-EXCEDIDO.                      
310900                                                                              
311000     IF WKS-PAGO-S408 > 0                                                     
311100        IF WS-S408-IMPAUT > 0                                                 
311200           MOVE     WS-S408-IMPAUT     TO WKS-PAGO-S408-ST                    
311300           COMPUTE  WKS-PAGO-S408-LC = WKS-PAGO-S408                          
311400                                     - WS-S408-IMPAUT                         
311500        ELSE                                                                  
311600           MOVE WKS-PAGO-S408          TO WKS-PAGO-S408-LC                    
311700           MOVE ZEROS                  TO WKS-PAGO-S408-ST                    
311800     ELSE                                                                     
311900       MOVE ZEROS                     TO WKS-PAGO-S408-LC                     
312000                                         WKS-PAGO-S408-ST                     
312100       IF WKS-PAGO-S408 < 0                                                   
312200          MOVE B03-NUM-CONTRATO          TO WS-MSG-CTO                        
312300          MOVE B03-NUM-PRODUCTO          TO WS-MSG-PRD                        
312400          MOVE B03-NUM-INSTRUM           TO WS-MSG-INST                       
312500          MOVE B03-MONEDA                TO WS-MSG-MDA                        
312600          MOVE B03-SDO-ACTUAL            TO W77-IMP-EDIT                      
312700          MOVE WS-S408-RESEXIST          TO WS-MSG-N-02                       
312800          MOVE WS-S408-STATUS            TO WS-MSG-RS                         
312900          MOVE WKS-PAGO-S408             TO W77-IMP-EDIT1                     
313000          MOVE WS-S408-IMP-EXCEDIDO      TO W77-IMP-EDIT3                     
313100          STRING "ERR PAG/LC/S408",    " RS=", WS-MSG-RS,                     
313200              " CTO=", WS-MSG-CTO,    " PRD ", WS-MSG-PRD,                    
313300                  "-", WS-MSG-INST,       "-", WS-MSG-MDA,                    
313400           " B03SDO=", W77-IMP-EDIT,  " PGO=", W77-IMP-EDIT1,                 
313500           DELIMITED BY SIZE INTO WLI-R01-MENSAJE                             
313600           PERFORM 60613000-ESC-MENSAJES                                      
313700           STRING "ERR PAG/LC/S408",    " RS=", WS-MSG-RS,                    
313800               " CTO=", WS-MSG-CTO,    " PRD ", WS-MSG-PRD,                   
313900                   "-", WS-MSG-INST,       "-", WS-MSG-MDA,                   
314000               " EXE=", W77-IMP-EDIT3, " RSEX=",WS-MSG-N-02                   
314100           DELIMITED BY SIZE INTO WLI-R01-MENSAJE                             
314200           PERFORM 60613000-ESC-MENSAJES                                      
314300           MOVE ZEROS                     TO WKS-PAGO-S408                    
314400                                             WKS-PAGO-S408-LC                 
314500                                             WKS-PAGO-S408-ST.                
314600                                                                              
314700     IF WKS-PAGO-S408-LC > 0                                                  
314800     OR WKS-PAGO-S408-ST > 0                                                  
314900        MOVE     WKS-PAGO-S408-LC TO WKS-TOT-ABO-S408-LC                      
315000        MOVE     WKS-PAGO-S408-ST TO WKS-TOT-ABO-S408-ST                      
315100        SUBTRACT WKS-PAGO-S408    FROM B03-SDO-ACTUAL                         
315200        MOVE 1                    TO WKS-SI-B03                               
315300        MOVE B03-NUM-CONTRATO     TO WS-MSG-CTO                               
315400        MOVE B03-NUM-PRODUCTO     TO WS-MSG-PRD                               
315500        MOVE B03-NUM-INSTRUM      TO WS-MSG-INST                              
315600        MOVE B03-MONEDA           TO WS-MSG-MDA                               
315700        MOVE WS-S408-STATUS       TO WS-MSG-RS                                
315800        MOVE WKS-PAGO-S408-LC     TO W77-IMP-EDIT                             
315900        MOVE WS-S408-IMP-EXCEDIDO TO W77-IMP-EDIT3                            
316000        MOVE WKS-PAGO-S408-ST     TO W77-IMP-EDIT2                            
316100        MOVE WKS-PAGO-S408        TO W77-IMP-EDIT1                            
316200        MOVE WS-S408-STATUS       TO WS-MSG-RS                                
316300        MOVE WS-S408-RESEXIST     TO WS-MSG-N-02                              
316400        STRING "PAGO LC S408",                                                
316500               " CTO=", WS-MSG-CTO,    " PRD=", WS-MSG-PRD,                   
316600                   "-", WS-MSG-INST,       "-", WS-MSG-MDA,                   
316700              " PAGO=", W77-IMP-EDIT1,                                        
316720               " EXE=", W77-IMP-EDIT3,                                        
316800               " REX=", WS-MSG-N-02     " RS=", WS-MSG-RS                     
316900        DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                
317000        PERFORM 60613000-ESC-MENSAJES                                         
317100        STRING "PAGO LC S408",                                                
317200               " CTO=", WS-MSG-CTO,   " PRD ", WS-MSG-PRD,                    
317300                   "-", WS-MSG-INST,      "-", WS-MSG-MDA,                    
317400              "  L/C=", W77-IMP-EDIT,                                         
317500               " S/T=", W77-IMP-EDIT2,                                        
317600        DELIMITED BY SIZE INTO WLI-R01-MENSAJE                                
317700        PERFORM 60613000-ESC-MENSAJES                                         
317800        IF WKS-SDO-DISPONIBLE > WKS-PAGO-S408                                 
317900           SUBTRACT WKS-PAGO-S408       FROM WKS-SDO-DISPONIBLE               
318000        ELSE                                                                  
318100           MOVE ZERO    TO WKS-SDO-DISPONIBLE.                                
318200                                                                              
318300     IF WS-S408-RESEXIST = 99                                                 
318400        NEXT SENTENCE                                                         
318500     ELSE                                                                     
318600     IF WS-S408-RESEXIST NOT = B03-IND-LINCREDIT                              
318700        MOVE WS-S408-RESEXIST  TO B03-IND-LINCREDIT                           
318800        MOVE 1                 TO WKS-SI-B03.                                 
318900                                                                              
319000     IF B03-IND-PENDLC > 0                                                    
319050        IF (WS-S408-SALDO  = 0 OR WKS-SDO-DISPONIBLE = 0)                     
319100           MOVE ZEROS     TO B03-IND-PENDLC                                   
319200           MOVE 1         TO WKS-SI-B03.                                      
319300                                                                              
319400***********************************************************                   
319500 50116650-VE-FIDEICOMISO.                                                     
319600***  IF  B03-STATUS = 1                                                       
319700***  AND B03-TIPO-BLOQUEO = 13                                                
319800***      COMPUTE WKS-SDO-FIDEICOMISO =                                        
319900***              WKS-SDO-DISPONIBLE - WKS-DISPONIBLE-ANT                      
320000***  ELSE                                                                     
320100***      MOVE ZERO TO WKS-SDO-FIDEICOMISO.                                    
320200***                                                                           
320300***  IF WKS-SDO-FIDEICOMISO = 0                                               
320400***     NEXT SENTENCE                                                         
320500***  ELSE                                                                     
320600***     PERFORM 50116670-GENERA-FIDEICOMISO.                                  
320700***                                                                           
320800************************************************                              
320900 50116670-GENERA-FIDEICOMISO.                                                 
321000***  MOVE WKS-SDO-FIDEICOMISO    TO W77-IMP-COMUN.                            
321100***                                                                           
321200***  IF WKS-SDO-FIDEICOMISO < 0                                               
321300***     MOVE 3004        TO  W77-CVE-COMUN                                    
321400***  ELSE                                                                     
321500***     MOVE 4005        TO  W77-CVE-COMUN.                                   
321600***                                                                           
321700***  PERFORM 50116700-LLENA-MOVS-S151.                                        
321800***  PERFORM 50122000-ENVIA-MOVSS151.                                         
321900***                                                                           
322000*******************************************************                       
322100 50116700-LLENA-MOVS-S151.                                                    
322200                                                                              
322300     ADD 1   TO WKS-IND-MOV.                                                  
322400                                                                              
322500     IF WKS-IND-MOV > 30                                                      
322600        PERFORM  50122000-ENVIA-MOVSS151                                      
322700        MOVE 1                 TO WKS-IND-MOV.                                
322800                                                                              
322900     MOVE W77-CVE-COMUN    TO WS-S151-0101-CVETRAN-I(WKS-IND-MOV)             
323000                              WS-CLAVE-TRANS.                                 
323100     MOVE W77-IMP-COMUN    TO WS-S151-0101-IMPORTE-I(WKS-IND-MOV).            
323200     MOVE WKS-ESQ-CONTABLE TO WS-S151-0101-ESQCON-I(WKS-IND-MOV).             
323300                                                                              
323400     IF WKS-LEY-ADICIONAL = SPACES                                            
323500        NEXT SENTENCE                                                         
323600     ELSE                                                                     
323700        MOVE WKS-LEY-ADICIONAL                                                
323800          TO WS-S151-0101-LEYENDA-I(WKS-IND-MOV)                              
323900        MOVE SPACES        TO WKS-LEY-ADICIONAL                               
324000        MOVE 2             TO WS-S151-0101-INDLEY-I(WKS-IND-MOV)              
324100        MOVE 1             TO W77-DATO-ADD-151.                               
324200                                                                              
324300     PERFORM 50117700-GENERA-PUNTEO.                                          
324400                                                                              
324500     PERFORM 50116800-ACUMULA-CLAVES.                                         
324600                                                                              
324700     IF WKS-TAB-CVE-ACT-SDO(WKS-IND-TBCVE) = 1 OR 2                           
324800        MOVE 1          TO W77-HAY-MOVBATCH.                                  
324900                                                                              
325000********************************************************                      
325100 50116800-ACUMULA-CLAVES.                                                     
325200     PERFORM 50104900-BUSCA-CVE-MEM.                                          
325300                                                                              
325400     IF WKS-IND-TBCVE < 1                                                     
325500     OR WKS-IND-TBCVE > 2000                                                  
325800        MOVE WKS-IND-TBCVE     TO WS-MSG-N-04                                 
325900        STRING "ERR EN WKS-IND-TBCVE ", WS-MSG-N-04                           
326000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
326100        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
326200        PERFORM 60613000-ESC-MENSAJES                                         
326300        PERFORM 70000050-MENSAJE                                              
326400        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
326500                                                                              
326600     MOVE WKS-IND-TBCVE        TO WKS-IND-TOT.                                
326700                                                                              
326800     IF WKS-IND-TOT < 101                                                     
326850        PERFORM 50116900-ACUMULA-TAB01                                        
326900     ELSE                                                                     
326950     IF WKS-IND-TOT < 201                                                     
327000        PERFORM 50117000-ACUMULA-TAB02                                        
327050     ELSE                                                                     
327100     IF WKS-IND-TOT < 301                                                     
327150        PERFORM 50117100-ACUMULA-TAB03                                        
327200     ELSE                                                                     
327250     IF WKS-IND-TOT < 401                                                     
327300        PERFORM 50117200-ACUMULA-TAB04                                        
327350     ELSE                                                                     
327400     IF WKS-IND-TOT < 501                                                     
327450        PERFORM 50117300-ACUMULA-TAB05                                        
327500     ELSE                                                                     
327550     IF WKS-IND-TOT < 601                                                     
327600        PERFORM 50117310-ACUMULA-TAB06                                        
327650     ELSE                                                                     
327700     IF WKS-IND-TOT < 701                                                     
327750        PERFORM 50117320-ACUMULA-TAB07                                        
327800     ELSE                                                                     
327850     IF WKS-IND-TOT < 801                                                     
327900        PERFORM 50117330-ACUMULA-TAB08                                        
327950     ELSE                                                                     
328000     IF WKS-IND-TOT < 901                                                     
328050        PERFORM 50117340-ACUMULA-TAB09                                        
328100     ELSE                                                                     
328120     IF WKS-IND-TOT < 1001                                                    
328150        PERFORM 50117350-ACUMULA-TAB10                                        
328200     ELSE                                                                     
328210     IF WKS-IND-TOT < 1101                                                    
328220        PERFORM 50116900-ACUMULA-TAB11                                        
328230     ELSE                                                                     
328240     IF WKS-IND-TOT < 1201                                                    
328250        PERFORM 50117000-ACUMULA-TAB12                                        
328260     ELSE                                                                     
328270     IF WKS-IND-TOT < 1301                                                    
328280        PERFORM 50117100-ACUMULA-TAB13                                        
328290     ELSE                                                                     
328300     IF WKS-IND-TOT < 1401                                                    
328310        PERFORM 50117200-ACUMULA-TAB14                                        
328320     ELSE                                                                     
328330     IF WKS-IND-TOT < 1501                                                    
328340        PERFORM 50117300-ACUMULA-TAB15                                        
328350     ELSE                                                                     
328360     IF WKS-IND-TOT < 1601                                                    
328370        PERFORM 50117310-ACUMULA-TAB16                                        
328380     ELSE                                                                     
328390     IF WKS-IND-TOT < 1701                                                    
328400        PERFORM 50117320-ACUMULA-TAB17                                        
328410     ELSE                                                                     
328420     IF WKS-IND-TOT < 1801                                                    
328430        PERFORM 50117330-ACUMULA-TAB18                                        
328440     ELSE                                                                     
328450     IF WKS-IND-TOT < 1901                                                    
328460        PERFORM 50117340-ACUMULA-TAB19                                        
328470     ELSE                                                                     
328480        PERFORM 50117350-ACUMULA-TAB20.                                       
329600                                                                              
329700     IF W77-IMP-COMUN > 0                                                     
329800        PERFORM 50117400-SUMCVES-HISTORICO.                                   
329900                                                                              
330000***********************************************************                   
330100 50116900-ACUMULA-TAB01.                                                      
330110     IF WKS-TCVE-01-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
330120        MOVE W77-CVE-COMUN                                                    
330130          TO WKS-TCVE-01-CVE(WS-IND-INST, WKS-IND-TOT).                       
330140                                                                              
330150     IF WKS-TCVE-01-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
330160        MOVE 1 TO WKS-HAY-CLAVES-01(WS-IND-INST)                              
330170        ADD W77-IMP-COMUN                                                     
330180            TO WKS-TCVE-01-IMP(WS-IND-INST, WKS-IND-TOT)                      
330190        ADD 1                                                                 
330200            TO WKS-TCVE-01-NUM(WS-IND-INST, WKS-IND-TOT)                      
330210     ELSE                                                                     
330240        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
330250        MOVE WKS-TCVE-01-CVE(WS-IND-INST, WKS-IND-TOT)                        
330260          TO WS-MSG-N-04                                                      
330270        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
330280               " CVE EN TABLA-01 ", WS-MSG-N-04                               
330290               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
330300        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
330310        PERFORM 60613000-ESC-MENSAJES                                         
330320        PERFORM 70000050-MENSAJE                                              
330330        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
330340                                                                              
330350*************************************************                             
330360 50117000-ACUMULA-TAB02.                                                      
330370     SUBTRACT 100 FROM WKS-IND-TOT.                                           
330380     IF WKS-TCVE-02-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
330390        MOVE W77-CVE-COMUN                                                    
330400          TO WKS-TCVE-02-CVE(WS-IND-INST, WKS-IND-TOT).                       
330410                                                                              
330420     IF WKS-TCVE-02-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
330430        MOVE 1 TO WKS-HAY-CLAVES-02(WS-IND-INST)                              
330440        ADD W77-IMP-COMUN                                                     
330450            TO WKS-TCVE-02-IMP(WS-IND-INST, WKS-IND-TOT)                      
330460        ADD 1                                                                 
330470            TO WKS-TCVE-02-NUM(WS-IND-INST, WKS-IND-TOT)                      
330480     ELSE                                                                     
330510        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
330520        MOVE WKS-TCVE-02-CVE(WS-IND-INST, WKS-IND-TOT)                        
330530          TO WS-MSG-N-04                                                      
330540        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
330550               " CVE EN TABLA-02 ", WS-MSG-N-04                               
330560               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
330570        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
330580        PERFORM 60613000-ESC-MENSAJES                                         
330590        PERFORM 70000050-MENSAJE                                              
330600        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
330610                                                                              
330620************************************************************                  
330630 50117100-ACUMULA-TAB03.                                                      
330640     SUBTRACT 200 FROM WKS-IND-TOT.                                           
330650     IF WKS-TCVE-03-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
330660        MOVE W77-CVE-COMUN                                                    
330670          TO WKS-TCVE-03-CVE(WS-IND-INST, WKS-IND-TOT).                       
330680                                                                              
330690     IF WKS-TCVE-03-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
330700        MOVE 1 TO WKS-HAY-CLAVES-03(WS-IND-INST)                              
330710        ADD W77-IMP-COMUN                                                     
330720            TO WKS-TCVE-03-IMP(WS-IND-INST, WKS-IND-TOT)                      
330730        ADD 1                                                                 
330740            TO WKS-TCVE-03-NUM(WS-IND-INST, WKS-IND-TOT)                      
330750     ELSE                                                                     
330780        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
330790        MOVE WKS-TCVE-03-CVE(WS-IND-INST, WKS-IND-TOT)                        
330800          TO WS-MSG-N-04                                                      
330810        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
330820               " CVE EN TABLA-03 ", WS-MSG-N-04                               
330830               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
330840        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
330850        PERFORM 60613000-ESC-MENSAJES                                         
330860        PERFORM 70000050-MENSAJE                                              
330870        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
330880                                                                              
330890*****************************************************************             
330900 50117200-ACUMULA-TAB04.                                                      
330910     SUBTRACT 300 FROM WKS-IND-TOT.                                           
330920     IF WKS-TCVE-04-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
330930        MOVE W77-CVE-COMUN                                                    
330940          TO WKS-TCVE-04-CVE(WS-IND-INST, WKS-IND-TOT).                       
330950                                                                              
330960     IF WKS-TCVE-04-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
330970        MOVE 1 TO WKS-HAY-CLAVES-04(WS-IND-INST)                              
330980        ADD W77-IMP-COMUN                                                     
330990            TO WKS-TCVE-04-IMP(WS-IND-INST, WKS-IND-TOT)                      
331000        ADD 1                                                                 
331010            TO WKS-TCVE-04-NUM(WS-IND-INST, WKS-IND-TOT)                      
331020     ELSE                                                                     
331050        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
331060        MOVE WKS-TCVE-04-CVE(WS-IND-INST, WKS-IND-TOT)                        
331070          TO WS-MSG-N-04                                                      
331080        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
331090               " CVE EN TABLA-04 ", WS-MSG-N-04                               
331100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
331110        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
331120        PERFORM 60613000-ESC-MENSAJES                                         
331130        PERFORM 70000050-MENSAJE                                              
331140        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
331150                                                                              
331160************************************************************                  
331170 50117300-ACUMULA-TAB05.                                                      
331180     SUBTRACT 400 FROM WKS-IND-TOT.                                           
331190     IF WKS-TCVE-05-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
331200        MOVE W77-CVE-COMUN                                                    
331210          TO WKS-TCVE-05-CVE(WS-IND-INST, WKS-IND-TOT).                       
331220                                                                              
331230     IF WKS-TCVE-05-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
331240        MOVE 1 TO WKS-HAY-CLAVES-05(WS-IND-INST)                              
331250        ADD W77-IMP-COMUN                                                     
331260            TO WKS-TCVE-05-IMP(WS-IND-INST, WKS-IND-TOT)                      
331270        ADD 1                                                                 
331280            TO WKS-TCVE-05-NUM(WS-IND-INST, WKS-IND-TOT)                      
331290     ELSE                                                                     
331320        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
331330        MOVE WKS-TCVE-05-CVE(WS-IND-INST, WKS-IND-TOT)                        
331340          TO WS-MSG-N-04                                                      
331350        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
331360               " CVE EN TABLA-05 ", WS-MSG-N-04                               
331370               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
331380        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
331390        PERFORM 60613000-ESC-MENSAJES                                         
331400        PERFORM 70000050-MENSAJE                                              
331410        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
331420                                                                              
331430***********************************************************                   
331440 50117310-ACUMULA-TAB06.                                                      
331450     SUBTRACT 500 FROM WKS-IND-TOT.                                           
331460     IF WKS-TCVE-06-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
331470        MOVE W77-CVE-COMUN                                                    
331480          TO WKS-TCVE-06-CVE(WS-IND-INST, WKS-IND-TOT).                       
331490                                                                              
331500     IF WKS-TCVE-06-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
331510        MOVE 1 TO WKS-HAY-CLAVES-06(WS-IND-INST)                              
331520        ADD W77-IMP-COMUN                                                     
331530            TO WKS-TCVE-06-IMP(WS-IND-INST, WKS-IND-TOT)                      
331540        ADD 1                                                                 
331550            TO WKS-TCVE-06-NUM(WS-IND-INST, WKS-IND-TOT)                      
331560     ELSE                                                                     
331590        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
331600        MOVE WKS-TCVE-06-CVE(WS-IND-INST, WKS-IND-TOT)                        
331610          TO WS-MSG-N-04                                                      
331620        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
331630               " CVE EN TABLA-06 ", WS-MSG-N-04                               
331640               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
331650        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
331660        PERFORM 60613000-ESC-MENSAJES                                         
331670        PERFORM 70000050-MENSAJE                                              
331680        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
331690                                                                              
331700*************************************************                             
331710 50117320-ACUMULA-TAB07.                                                      
331720     SUBTRACT 600 FROM WKS-IND-TOT.                                           
331730     IF WKS-TCVE-07-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
331740        MOVE W77-CVE-COMUN                                                    
331750          TO WKS-TCVE-07-CVE(WS-IND-INST, WKS-IND-TOT).                       
331760                                                                              
331770     IF WKS-TCVE-07-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
331780        MOVE 1 TO WKS-HAY-CLAVES-07(WS-IND-INST)                              
331790        ADD W77-IMP-COMUN                                                     
331800            TO WKS-TCVE-07-IMP(WS-IND-INST, WKS-IND-TOT)                      
331810        ADD 1                                                                 
331820            TO WKS-TCVE-07-NUM(WS-IND-INST, WKS-IND-TOT)                      
331830     ELSE                                                                     
331860        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
331870        MOVE WKS-TCVE-07-CVE(WS-IND-INST, WKS-IND-TOT)                        
331880          TO WS-MSG-N-04                                                      
331890        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
331900               " CVE EN TABLA-07 ", WS-MSG-N-04                               
331910               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
331920        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
331930        PERFORM 60613000-ESC-MENSAJES                                         
331940        PERFORM 70000050-MENSAJE                                              
331950        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
331960                                                                              
331970*********************************************************                     
331980 50117330-ACUMULA-TAB08.                                                      
331990     SUBTRACT 700 FROM WKS-IND-TOT.                                           
332000     IF WKS-TCVE-08-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
332010        MOVE W77-CVE-COMUN                                                    
332020          TO WKS-TCVE-08-CVE(WS-IND-INST, WKS-IND-TOT).                       
332030                                                                              
332040     IF WKS-TCVE-08-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
332050        MOVE 1 TO WKS-HAY-CLAVES-08(WS-IND-INST)                              
332060        ADD W77-IMP-COMUN                                                     
332070            TO WKS-TCVE-08-IMP(WS-IND-INST, WKS-IND-TOT)                      
332080        ADD 1                                                                 
332090            TO WKS-TCVE-08-NUM(WS-IND-INST, WKS-IND-TOT)                      
332100     ELSE                                                                     
332130        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
332140        MOVE WKS-TCVE-08-CVE(WS-IND-INST, WKS-IND-TOT)                        
332150          TO WS-MSG-N-04                                                      
332160        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
332170               " CVE EN TABLA-08 ", WS-MSG-N-04                               
332180               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
332190        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
332200        PERFORM 60613000-ESC-MENSAJES                                         
332210        PERFORM 70000050-MENSAJE                                              
332220        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
332230                                                                              
332240*****************************************************************             
332250 50117340-ACUMULA-TAB09.                                                      
332260     SUBTRACT 800 FROM WKS-IND-TOT.                                           
332270     IF WKS-TCVE-09-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
332280        MOVE W77-CVE-COMUN                                                    
332290          TO WKS-TCVE-09-CVE(WS-IND-INST, WKS-IND-TOT).                       
332300                                                                              
332310     IF WKS-TCVE-09-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
332320        MOVE 1 TO WKS-HAY-CLAVES-09(WS-IND-INST)                              
332330        ADD W77-IMP-COMUN                                                     
332340            TO WKS-TCVE-09-IMP(WS-IND-INST, WKS-IND-TOT)                      
332350        ADD 1                                                                 
332360            TO WKS-TCVE-09-NUM(WS-IND-INST, WKS-IND-TOT)                      
332370     ELSE                                                                     
332400        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
332410        MOVE WKS-TCVE-09-CVE(WS-IND-INST, WKS-IND-TOT)                        
332420          TO WS-MSG-N-04                                                      
332430        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
332440               " CVE EN TABLA-09 ", WS-MSG-N-04                               
332450               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
332460        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
332470        PERFORM 60613000-ESC-MENSAJES                                         
332480        PERFORM 70000050-MENSAJE                                              
332490        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
332500                                                                              
332510************************************************************                  
332520 50117350-ACUMULA-TAB10.                                                      
332530     SUBTRACT 900 FROM WKS-IND-TOT.                                           
332540     IF WKS-TCVE-10-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
332550        MOVE W77-CVE-COMUN                                                    
332560          TO WKS-TCVE-10-CVE(WS-IND-INST, WKS-IND-TOT).                       
332570                                                                              
332580     IF WKS-TCVE-10-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
332590        MOVE 1 TO WKS-HAY-CLAVES-10(WS-IND-INST)                              
332600        ADD W77-IMP-COMUN                                                     
332610            TO WKS-TCVE-10-IMP(WS-IND-INST, WKS-IND-TOT)                      
332620        ADD 1                                                                 
332630            TO WKS-TCVE-10-NUM(WS-IND-INST, WKS-IND-TOT)                      
332640     ELSE                                                                     
332670        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
332680        MOVE WKS-TCVE-10-CVE(WS-IND-INST, WKS-IND-TOT)                        
332690          TO WS-MSG-N-04                                                      
332700        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
332710               " CVE EN TABLA-10 ", WS-MSG-N-04                               
332720               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
332730        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
332740        PERFORM 60613000-ESC-MENSAJES                                         
332750        PERFORM 70000050-MENSAJE                                              
332760        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
332770                                                                              
332780                                                                              
332800***********************************************************                   
332810 50116900-ACUMULA-TAB11.                                                      
332815     SUBTRACT 1000 FROM WKS-IND-TOT.                                          
332820     IF WKS-TCVE-11-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
332830        MOVE W77-CVE-COMUN                                                    
332840          TO WKS-TCVE-11-CVE(WS-IND-INST, WKS-IND-TOT).                       
332850                                                                              
332860     IF WKS-TCVE-11-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
332870        MOVE 1 TO WKS-HAY-CLAVES-11(WS-IND-INST)                              
332880        ADD W77-IMP-COMUN                                                     
332890            TO WKS-TCVE-11-IMP(WS-IND-INST, WKS-IND-TOT)                      
332900        ADD 1                                                                 
332910            TO WKS-TCVE-11-NUM(WS-IND-INST, WKS-IND-TOT)                      
332920     ELSE                                                                     
332950        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
332960        MOVE WKS-TCVE-11-CVE(WS-IND-INST, WKS-IND-TOT)                        
332970          TO WS-MSG-N-04                                                      
332980        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
332990               " CVE EN TABLA-11 ", WS-MSG-N-04                               
333000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
333010        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
333020        PERFORM 60613000-ESC-MENSAJES                                         
333030        PERFORM 70000050-MENSAJE                                              
333040        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
333050                                                                              
333060*************************************************                             
333070 50117000-ACUMULA-TAB12.                                                      
333080     SUBTRACT 1100 FROM WKS-IND-TOT.                                          
333090     IF WKS-TCVE-12-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
333100        MOVE W77-CVE-COMUN                                                    
333110          TO WKS-TCVE-12-CVE(WS-IND-INST, WKS-IND-TOT).                       
333120                                                                              
333130     IF WKS-TCVE-12-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
333140        MOVE 1 TO WKS-HAY-CLAVES-12(WS-IND-INST)                              
333150        ADD W77-IMP-COMUN                                                     
333160            TO WKS-TCVE-12-IMP(WS-IND-INST, WKS-IND-TOT)                      
333170        ADD 1                                                                 
333180            TO WKS-TCVE-12-NUM(WS-IND-INST, WKS-IND-TOT)                      
333190     ELSE                                                                     
333220        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
333230        MOVE WKS-TCVE-12-CVE(WS-IND-INST, WKS-IND-TOT)                        
333240          TO WS-MSG-N-04                                                      
333250        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
333260               " CVE EN TABLA-12 ", WS-MSG-N-04                               
333270               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
333280        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
333290        PERFORM 60613000-ESC-MENSAJES                                         
333300        PERFORM 70000050-MENSAJE                                              
333310        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
333320                                                                              
333330************************************************************                  
333340 50117100-ACUMULA-TAB13.                                                      
333350     SUBTRACT 1200 FROM WKS-IND-TOT.                                          
333360     IF WKS-TCVE-13-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
333370        MOVE W77-CVE-COMUN                                                    
333380          TO WKS-TCVE-13-CVE(WS-IND-INST, WKS-IND-TOT).                       
333390                                                                              
333400     IF WKS-TCVE-13-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
333410        MOVE 1 TO WKS-HAY-CLAVES-13(WS-IND-INST)                              
333420        ADD W77-IMP-COMUN                                                     
333430            TO WKS-TCVE-13-IMP(WS-IND-INST, WKS-IND-TOT)                      
333440        ADD 1                                                                 
333450            TO WKS-TCVE-13-NUM(WS-IND-INST, WKS-IND-TOT)                      
333460     ELSE                                                                     
333490        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
333500        MOVE WKS-TCVE-13-CVE(WS-IND-INST, WKS-IND-TOT)                        
333510          TO WS-MSG-N-04                                                      
333520        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
333530               " CVE EN TABLA-13 ", WS-MSG-N-04                               
333540               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
333550        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
333560        PERFORM 60613000-ESC-MENSAJES                                         
333570        PERFORM 70000050-MENSAJE                                              
333580        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
333590                                                                              
333600*****************************************************************             
333610 50117200-ACUMULA-TAB14.                                                      
333620     SUBTRACT 1300 FROM WKS-IND-TOT.                                          
333630     IF WKS-TCVE-14-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
333640        MOVE W77-CVE-COMUN                                                    
333650          TO WKS-TCVE-14-CVE(WS-IND-INST, WKS-IND-TOT).                       
333660                                                                              
333670     IF WKS-TCVE-14-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
333680        MOVE 1 TO WKS-HAY-CLAVES-14(WS-IND-INST)                              
333690        ADD W77-IMP-COMUN                                                     
333700            TO WKS-TCVE-14-IMP(WS-IND-INST, WKS-IND-TOT)                      
333710        ADD 1                                                                 
333720            TO WKS-TCVE-14-NUM(WS-IND-INST, WKS-IND-TOT)                      
333730     ELSE                                                                     
333760        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
333770        MOVE WKS-TCVE-14-CVE(WS-IND-INST, WKS-IND-TOT)                        
333780          TO WS-MSG-N-04                                                      
333790        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
333800               " CVE EN TABLA-14 ", WS-MSG-N-04                               
333810               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
333820        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
333830        PERFORM 60613000-ESC-MENSAJES                                         
333840        PERFORM 70000050-MENSAJE                                              
333850        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
333860                                                                              
333870************************************************************                  
333880 50117300-ACUMULA-TAB15.                                                      
333890     SUBTRACT 1400 FROM WKS-IND-TOT.                                          
333900     IF WKS-TCVE-15-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
333910        MOVE W77-CVE-COMUN                                                    
333920          TO WKS-TCVE-15-CVE(WS-IND-INST, WKS-IND-TOT).                       
333930                                                                              
333940     IF WKS-TCVE-15-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
333950        MOVE 1 TO WKS-HAY-CLAVES-15(WS-IND-INST)                              
333960        ADD W77-IMP-COMUN                                                     
333970            TO WKS-TCVE-15-IMP(WS-IND-INST, WKS-IND-TOT)                      
333980        ADD 1                                                                 
333990            TO WKS-TCVE-15-NUM(WS-IND-INST, WKS-IND-TOT)                      
334000     ELSE                                                                     
334030        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
334040        MOVE WKS-TCVE-15-CVE(WS-IND-INST, WKS-IND-TOT)                        
334050          TO WS-MSG-N-04                                                      
334060        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
334070               " CVE EN TABLA-15 ", WS-MSG-N-04                               
334080               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
334090        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
334100        PERFORM 60613000-ESC-MENSAJES                                         
334110        PERFORM 70000050-MENSAJE                                              
334120        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
334130                                                                              
334140***********************************************************                   
334150 50117310-ACUMULA-TAB16.                                                      
334160     SUBTRACT 1500 FROM WKS-IND-TOT.                                          
334170     IF WKS-TCVE-16-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
334180        MOVE W77-CVE-COMUN                                                    
334190          TO WKS-TCVE-16-CVE(WS-IND-INST, WKS-IND-TOT).                       
334200                                                                              
334210     IF WKS-TCVE-16-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
334220        MOVE 1 TO WKS-HAY-CLAVES-16(WS-IND-INST)                              
334230        ADD W77-IMP-COMUN                                                     
334240            TO WKS-TCVE-16-IMP(WS-IND-INST, WKS-IND-TOT)                      
334250        ADD 1                                                                 
334260            TO WKS-TCVE-16-NUM(WS-IND-INST, WKS-IND-TOT)                      
334270     ELSE                                                                     
334300        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
334310        MOVE WKS-TCVE-16-CVE(WS-IND-INST, WKS-IND-TOT)                        
334320          TO WS-MSG-N-04                                                      
334330        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
334340               " CVE EN TABLA-16 ", WS-MSG-N-04                               
334350               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
334360        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
334370        PERFORM 60613000-ESC-MENSAJES                                         
334380        PERFORM 70000050-MENSAJE                                              
334390        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
334400                                                                              
334410*************************************************                             
334420 50117320-ACUMULA-TAB17.                                                      
334430     SUBTRACT 1600 FROM WKS-IND-TOT.                                          
334440     IF WKS-TCVE-17-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
334450        MOVE W77-CVE-COMUN                                                    
334460          TO WKS-TCVE-17-CVE(WS-IND-INST, WKS-IND-TOT).                       
334470                                                                              
334480     IF WKS-TCVE-17-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
334490        MOVE 1 TO WKS-HAY-CLAVES-17(WS-IND-INST)                              
334500        ADD W77-IMP-COMUN                                                     
334510            TO WKS-TCVE-17-IMP(WS-IND-INST, WKS-IND-TOT)                      
334520        ADD 1                                                                 
334530            TO WKS-TCVE-17-NUM(WS-IND-INST, WKS-IND-TOT)                      
334540     ELSE                                                                     
334570        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
334580        MOVE WKS-TCVE-17-CVE(WS-IND-INST, WKS-IND-TOT)                        
334590          TO WS-MSG-N-04                                                      
334600        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
334610               " CVE EN TABLA-17 ", WS-MSG-N-04                               
334620               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
334630        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
334640        PERFORM 60613000-ESC-MENSAJES                                         
334650        PERFORM 70000050-MENSAJE                                              
334660        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
334670                                                                              
334680*********************************************************                     
334690 50117330-ACUMULA-TAB18.                                                      
334700     SUBTRACT 1700 FROM WKS-IND-TOT.                                          
334710     IF WKS-TCVE-18-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
334720        MOVE W77-CVE-COMUN                                                    
334730          TO WKS-TCVE-18-CVE(WS-IND-INST, WKS-IND-TOT).                       
334740                                                                              
334750     IF WKS-TCVE-18-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
334760        MOVE 1 TO WKS-HAY-CLAVES-18(WS-IND-INST)                              
334770        ADD W77-IMP-COMUN                                                     
334780            TO WKS-TCVE-18-IMP(WS-IND-INST, WKS-IND-TOT)                      
334790        ADD 1                                                                 
334800            TO WKS-TCVE-18-NUM(WS-IND-INST, WKS-IND-TOT)                      
334810     ELSE                                                                     
334840        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
334850        MOVE WKS-TCVE-18-CVE(WS-IND-INST, WKS-IND-TOT)                        
334860          TO WS-MSG-N-04                                                      
334870        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
334880               " CVE EN TABLA-18 ", WS-MSG-N-04                               
334890               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
334900        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
334910        PERFORM 60613000-ESC-MENSAJES                                         
334920        PERFORM 70000050-MENSAJE                                              
334930        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
334940                                                                              
334950*****************************************************************             
334960 50117340-ACUMULA-TAB19.                                                      
334970     SUBTRACT 1800 FROM WKS-IND-TOT.                                          
334980     IF WKS-TCVE-19-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
334990        MOVE W77-CVE-COMUN                                                    
335000          TO WKS-TCVE-19-CVE(WS-IND-INST, WKS-IND-TOT).                       
335010                                                                              
335020     IF WKS-TCVE-19-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
335030        MOVE 1 TO WKS-HAY-CLAVES-19(WS-IND-INST)                              
335040        ADD W77-IMP-COMUN                                                     
335050            TO WKS-TCVE-19-IMP(WS-IND-INST, WKS-IND-TOT)                      
335060        ADD 1                                                                 
335070            TO WKS-TCVE-19-NUM(WS-IND-INST, WKS-IND-TOT)                      
335080     ELSE                                                                     
335110        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
335120        MOVE WKS-TCVE-19-CVE(WS-IND-INST, WKS-IND-TOT)                        
335130          TO WS-MSG-N-04                                                      
335140        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
335150               " CVE EN TABLA-19 ", WS-MSG-N-04                               
335160               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
335170        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
335180        PERFORM 60613000-ESC-MENSAJES                                         
335190        PERFORM 70000050-MENSAJE                                              
335200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
335210                                                                              
335220************************************************************                  
335230 50117350-ACUMULA-TAB20.                                                      
335240     SUBTRACT 1900 FROM WKS-IND-TOT.                                          
335250     IF WKS-TCVE-20-CVE(WS-IND-INST, WKS-IND-TOT) = ZEROS                     
335260        MOVE W77-CVE-COMUN                                                    
335270          TO WKS-TCVE-20-CVE(WS-IND-INST, WKS-IND-TOT).                       
335280                                                                              
335290     IF WKS-TCVE-20-CVE(WS-IND-INST, WKS-IND-TOT) = W77-CVE-COMUN             
335300        MOVE 1 TO WKS-HAY-CLAVES-20(WS-IND-INST)                              
335310        ADD W77-IMP-COMUN                                                     
335320            TO WKS-TCVE-20-IMP(WS-IND-INST, WKS-IND-TOT)                      
335330        ADD 1                                                                 
335340            TO WKS-TCVE-20-NUM(WS-IND-INST, WKS-IND-TOT)                      
335350     ELSE                                                                     
335380        MOVE W77-CVE-COMUN              TO WS-MSG-CVE                         
335390        MOVE WKS-TCVE-20-CVE(WS-IND-INST, WKS-IND-TOT)                        
335400          TO WS-MSG-N-04                                                      
335410        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
335420               " CVE EN TABLA-20 ", WS-MSG-N-04                               
335430               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
335440        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
335450        PERFORM 60613000-ESC-MENSAJES                                         
335460        PERFORM 70000050-MENSAJE                                              
335470        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
335480                                                                              
335490                                                                              
335500***********************************************************                   
357100 50117400-SUMCVES-HISTORICO.                                                  
357200     IF WKS-TAB-CVE-ACT-SDO(WKS-IND-TBCVE) = 1                                
357300        ADD W77-IMP-COMUN      TO B06-RETS-DIA(WKS-DD-FBASE)                  
357400        MOVE 1                 TO WKS-SI-B06                                  
357500     ELSE                                                                     
357600     IF WKS-TAB-CVE-ACT-SDO(WKS-IND-TBCVE) = 2                                
357700        ADD W77-IMP-COMUN      TO B06-DEPS-DIA(WKS-DD-FBASE)                  
357800        MOVE 1                 TO WKS-SI-B06.                                 
357900                                                                              
358000*************************************************************                 
358100 50117700-GENERA-PUNTEO.                                                      
358200     MOVE 22                          TO WKS-I02-R01-TPOREG.                  
358300     MOVE B03-SUC-PROMOTORA           TO WKS-I02-R01-SUCTRA.                  
358400     MOVE W77-CAJA-PUENTE             TO WKS-I02-R01-CAJTRA.                  
358500     MOVE W77-MY-AUTORIZ              TO WKS-I02-R01-AUTTRA.                  
358600     MOVE B03-NUM-CONTRATO            TO WKS-I02-R01-CTO.                     
358700     MOVE B03-NUM-PRODUCTO            TO WKS-I02-R01-PROD.                    
358800     MOVE B03-NUM-INSTRUM             TO WKS-I02-R01-INST.                    
358900     MOVE B03-MONEDA                  TO WKS-I02-R01-MONEDA.                  
359000     MOVE W77-CVE-COMUN               TO WKS-I02-R01-CLAVE.                   
359100     MOVE W77-IMP-COMUN               TO WKS-I02-R01-IMPORTE.                 
359200     MOVE ZEROS                       TO WKS-I02-R01-REFE.                    
359300     MOVE W77-AUT-S151                TO WKS-I02-R01-AUTS151.                 
359400     MOVE WKS-FEC-MAQ-08              TO WKS-I02-R01-FECMAQ.                  
359500     MOVE WKS-HORA-MAQ-INI            TO WKS-I02-R01-HORAMAQ.                 
359600     MOVE 1                           TO WKS-I02-R01-TPOMOV.                  
359700     MOVE 500                         TO WKS-I02-R01-SISORIG.                 
359800     MOVE 22                          TO WKS-I02-R01-TPOPROC.                 
359900     MOVE WKS-ESQ-CONTABLE            TO WKS-I02-R01-ESQCONT.                 
360000     MOVE 002002                      TO WKS-I02-R01-BCO-DEST.                
360100     MOVE WKS-I02-R01-DATOS           TO I02-R00-PUNTEOOUT.                   
360200     PERFORM 20015600-ESCRIBE-PUNTEO.                                         
360300                                                                              
360400*********************************************************                     
360500 20015600-ESCRIBE-PUNTEO.                                                     
360600     WRITE I02-R00-PUNTEOOUT INVALID KEY                                      
360900       ADD 1 WKS-I02-R99-NUMREGS GIVING WS-MSG-N-08                           
361000       STRING "ERR WRITE PUNTEO REGS=", WS-MSG-N-08                           
361100          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
361200       MOVE WS-0101-TEXT-MSG TO WLI-R01-MENSAJE                               
361300       PERFORM 60613000-ESC-MENSAJES                                          
361400       PERFORM 70000050-MENSAJE                                               
361500       CALL SYSTEM DMTERMINATE.                                               
361600                                                                              
361700     ADD 1 TO WKS-I02-R99-NUMREGS.                                            
361710                                                                              
361720***********************************************************                   
361730 20015620-ESC-HEAD-P010.                                                      
361740     WRITE I04-FD-DISP-P010 FROM WKS-I04-R01-HEADER.                          
361750                                                                              
361760*************************************************************                 
361800                                                                              
361900*******************************************************                       
362000 50122000-ENVIA-MOVSS151.                                                     
362100     MOVE 1                   TO WS-S151-0101-FUNCION-I.                      
362200                                                                              
362300     MOVE B03-NUM-PRODUCTO    TO WS-S151-0101-PRODUCT-I.                      
362400     MOVE B03-NUM-INSTRUM     TO WS-S151-0101-INSTRUMENTO-I.                  
362500     MOVE B03-MONEDA          TO WS-S151-0101-MONEDA-I.                       
362510     MOVE B03-NUM-CLIENTE     TO WS-S151-0101-NUM-CTE-I.                      
362515     MOVE B03-NOMBRE          TO WS-S151-0101-NOMBRE-I.                       
362520     MOVE B03-SERVCITIDIREC   TO WS-S151-0101-SERVCITIDIREC-I.                
362522*INI INDICADOR BNE ME13595                                                    
362524     MOVE B03-IND-BNE-DIV     TO WS-S151-0101-IND-BNE-I.                      
362526*FIN INDICADOR BNE ME13595                                                    
362530     IF B03-SERVCITIDIREC = 4                                                 
362540        MOVE 2   TO WS-S151-0101-SERVCITIDIREC-I                              
362550     ELSE                                                                     
362560     IF B03-SERVCITIDIREC = 5                                                 
362570        MOVE 3   TO WS-S151-0101-SERVCITIDIREC-I.                             
362600                                                                              
362700     MOVE W77-CAJA-PUENTE     TO WS-S151-0101-CAJTRAN-I                       
362800                                 WS-S151-0101-CAJOPER-I                       
362900                                 WS-S151-0101-CAJS028-I.                      
363000                                                                              
363100     MOVE B03-SUC-PROMOTORA   TO WS-S151-0101-SUCPROM-I                       
363200                                 WS-S151-0101-SUCOPER-I                       
363300                                 WS-S151-0101-SUCTRAN-I                       
363400                                 WS-S151-0101-SUCS028-I.                      
363500     MOVE B03-NUM-CONTRATO    TO WS-S151-0101-CUENTA-I.                       
363600                                                                              
363700     IF B03-FEC-ULTMOV > 0                                                    
363800        MOVE B03-FEC-ULTMOV     TO WS-S151-0101-FEC-ULTMOV-I                  
363900     ELSE                                                                     
364000        MOVE B03-FEC-APERTURA   TO WS-S151-0101-FEC-ULTMOV-I.                 
364100                                                                              
364190** El campo B03-CONT-CLVDIA > 0 indica si recibiÿ en linea                    
364191** Una clave para actualizar fecha de ultimo movimiento                       
364200     IF B03-CONT-CLVDIA   > 0                                                 
364300        IF (B03-NUM-MOVS    > 0)                                              
364400        OR (B03-IMP-CGOSDIA > 0)                                              
364500        OR (B03-IMP-ABOSDIA > 0)                                              
364510        OR (B06-DEPS-DIA(WKS-DD-FBASE)) > 0                                   
364600           MOVE WKS-FEC-BASE  TO WS-S151-0101-FEC-ULTMOV-I.                   
364700                                                                              
364800     MOVE WKS-FEC-BASE        TO WS-S151-0101-FECCONT-I                       
364900                                 WS-S151-0101-FECVA-I.                        
365000     MOVE WKS-FEC-MAQ-08      TO WS-S151-0101-FECMOV-I.                       
365100     MOVE WKS-HORA-MAQ-INI    TO WS-S151-0101-HORAMOV-I.                      
365200     MOVE 22                  TO WS-S151-0101-TIPO-PROC-I.                    
365300     MOVE 1                   TO WS-S151-0101-ORIGEN-I.                       
365400     MOVE 1                   TO WS-S151-0101-IND-EDOCTA-I.                   
365500     MOVE W77-MY-AUTORIZ      TO WS-S151-0101-AUTAPL-I.                       
365600     MOVE ZEROS               TO WS-S151-0101-REFNUM-I.                       
365700     MOVE B03-SECTOR          TO WS-S151-0101-SECTOR-I.                       
365800     MOVE B03-BANCA           TO WS-S151-0101-BANCA-I.                        
365900     MOVE B03-ESTACION-LB     TO WS-S151-0101-ESTACION-LB-I.                  
365950     IF WS-DH-HOSTNAME-DAH                                                    
366000        MOVE 002              TO WS-S151-0101-BCO-ORI-I                       
366100        MOVE 002              TO WS-S151-0101-BCO-DES-I                       
366120     ELSE                                                                     
366140        MOVE 007              TO WS-S151-0101-BCO-ORI-I                       
366160        MOVE 007              TO WS-S151-0101-BCO-DES-I.                      
366200     MOVE W77-MY-CSI          TO WS-S151-0101-NODORI-I.                       
366300     MOVE W77-DATO-ADD-151    TO WS-S151-0101-IND-DATOS-ADIC-I.               
366310     MOVE 0                   TO WS-S151-0101-SERVICIO-ALERTA-I.              
366320     MOVE 0                   TO WS-S151-0101-SALDO-FINAL-I.                  
366330     MOVE B03-NUM-GPOSOCIO    TO WS-S151-0101-GRUPO-SOC-I.                    
366340     MOVE B03-MED-ACC-BIN     TO WS-S151-0101-BIN-TAR-I.                      
366400                                                                              
366500                                                                              
366600     IF WKS-SIN-LBS151 = 0                                                    
366700        PERFORM 50122050-CALL-S151MOVS                                        
366800     ELSE                                                                     
366900        PERFORM 20000151-CARGAMOV1-LIMPIA.                                    
367000                                                                              
367100     MOVE 0  TO WKS-IND-MOV W77-DATO-ADD-151.                                 
367200                                                                              
367300                                                                              
367400**********************************************************                    
367500 50122050-CALL-S151MOVS.                                                      
368400                                                                              
368500     PERFORM 20000151-CARGAMOV1.                                              
368600                                                                              
369200                                                                              
369300     IF WS-S151-0101-STATUS > 0                                               
369400        MOVE B03-NUM-CONTRATO       TO WS-MSG-CTO                             
369500        MOVE B03-NUM-PRODUCTO       TO WS-MSG-PRD                             
369600        MOVE B03-NUM-INSTRUM        TO WS-MSG-INST                            
369700        MOVE B03-MONEDA             TO WS-MSG-MDA                             
369800        MOVE WS-S151-0101-STATUS    TO WS-MSG-N-04                            
369900        STRING "ERR, CALL S151 RS=", WS-MSG-N-04                              
370000               " CTO=", WS-MSG-CTO   " PRD=", WS-MSG-PRD                      
370100               " INS=", WS-MSG-INST  " MON=", WS-MSG-MDA                      
370200               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
370300        PERFORM 60613000-ESC-MENSAJES                                         
370400        MOVE WS-S151-0101-CVETRAN1  TO WS-MSG-N-04                            
370500        MOVE WS-S151-0101-IMPORTE1  TO WS-MSG-IMP                             
370600        STRING "CV1=", WS-MSG-N-04, " IMP=", WS-MSG-IMP                       
370700               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
370800        PERFORM 60613000-ESC-MENSAJES                                         
370900        STRING "ERR, CALL S151 RS=", WS-MSG-N-04                              
371000               " CTO=", WS-MSG-CTO   " PRD=", WS-MSG-PRD                      
371100               " INS=", WS-MSG-INST  " MON=", WS-MSG-MDA                      
371200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
371300        PERFORM 70000050-MENSAJE                                              
371400        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
371500                                                                              
371600*************************************************************                 
371700 50123000-ENVIA-MOVSS408.                                                     
371800                                                                              
371900     IF WKS-TOT-ABO-S408-LC > 0                                               
372000        MOVE 4001                TO W77-CVE-COMUN                             
372100        MOVE WKS-TOT-ABO-S408-LC TO W77-IMP-COMUN                             
372200        PERFORM 50116700-LLENA-MOVS-S151.                                     
372300                                                                              
372400     IF WKS-TOT-ABO-S408-ST > 0                                               
372500        MOVE 4016                TO W77-CVE-COMUN                             
372600        MOVE WKS-TOT-ABO-S408-ST TO W77-IMP-COMUN                             
372700        PERFORM 50116700-LLENA-MOVS-S151.                                     
372800                                                                              
372900     IF WKS-IND-MOV > 0                                                       
373000        PERFORM 50122000-ENVIA-MOVSS151.                                      
373100                                                                              
373200     MOVE ZEROS            TO WKS-TOT-ABO-S408-LC                             
373300                              WKS-TOT-ABO-S408-ST.                            
373320                                                                              
373340**************************************************************                
373360 50124000-GEN-ARCH-P010.                                                      
373400     ADD  1                   TO WKS-AUT-SEQ WKS-I04-R02-SEQ.                 
373415     MOVE WKS-AUT-P010        TO WKS-I04-R02-AUTORIZ.                         
373417     MOVE B03-SUC-PROMOTORA   TO WKS-I04-R02-SUC-CTO.                         
373420     MOVE B03-NUM-CONTRATO    TO WKS-I04-R02-MDA-CTO.                         
373425     MOVE B03-MONEDA          TO WKS-I04-R02-MONEDA.                          
373430     MOVE WKS-FEC-PROX        TO WKS-I04-R02-NUM-REF.                         
373432     MOVE 0                   TO WKS-I04-R02-IMPORTE.                         
373433     MOVE 2                   TO WKS-I04-R02-TPO-MOV.                         
373434     IF B03-IND-PROTNOM > 0                                                   
373435        MOVE 1098             TO WKS-I04-R02-CVE-TRANS                        
373436     ELSE                                                                     
373437        MOVE 1004             TO WKS-I04-R02-CVE-TRANS.                       
373438                                                                              
373440     WRITE I04-FD-DISP-P010   FROM WKS-I04-R02-DATOS.                         
373445                                                                              
373446     IF WKS-I04-R02-TPO-MOV = 1                                               
373447        ADD 1                   TO WKS-I04-R09-NUMCARGOS                      
373448        ADD WKS-I04-R02-IMPORTE TO WKS-I04-R09-IMPCARGOS                      
373449     ELSE                                                                     
373450        ADD 1                   TO WKS-I04-R09-NUMABONOS                      
373452        ADD WKS-I04-R02-IMPORTE TO WKS-I04-R09-IMPABONOS.                     
373455                                                                              
373465     MOVE 1 TO WKS-SI-B03.                                                    
373470                                                                              
373475*********************************************************                     
373500                                                                              
373600**************************************************************                
373700 50125000-STORE-BASE.                                                         
373800                                                                              
373900     PERFORM 90000000-BEGIN-TRANSACTION                                       
374000     IF WS-STATUS-BASE > 0                                                    
374100        CALL SYSTEM DMTERMINATE.                                              
374200                                                                              
374300     IF WKS-SI-B03 = 1                                                        
374400        MOVE ZERO        TO WKS-SI-B03                                        
374500        PERFORM 90000003-B03CONTRATOS-STORE                                   
374600        ADD 1 TO W77-TOT-B03-STORE                                            
374700        IF WS-STATUS-BASE > 0                                                 
375000           MOVE B03-NUM-CONTRATO   TO WS-MSG-CTO                              
375100           STRING " ERR STORE CONTRATOS ", WS-STATUS-BASE                     
375200                  " CTO=", WS-MSG-CTO                                         
375300                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
375400           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
375500           PERFORM 60613000-ESC-MENSAJES                                      
375600           PERFORM 70000050-MENSAJE                                           
375800           CALL SYSTEM DMTERMINATE.                                           
375900                                                                              
376000     IF WKS-SI-B06 = 1                                                        
376100        MOVE ZERO        TO WKS-SI-B06                                        
376200        PERFORM 90000006-B06HISTORICO-STORE                                   
376300        ADD 1 TO W77-TOT-B06-STORE                                            
376400        IF WS-STATUS-BASE > 0                                                 
376700           MOVE B03-NUM-CONTRATO   TO WS-MSG-CTO                              
376800           STRING " ERR STORE B06HIST ", WS-STATUS-BASE                       
376900                  " CTO=", WS-MSG-CTO                                         
377000                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
377100           MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                          
377200           PERFORM 60613000-ESC-MENSAJES                                      
377300           PERFORM 70000050-MENSAJE                                           
377500           CALL SYSTEM DMTERMINATE.                                           
377600                                                                              
377700     PERFORM 90000000-END-TRANSACTIONNOAU                                     
377800     IF WS-STATUS-BASE > 0                                                    
377900        CALL SYSTEM DMTERMINATE.                                              
378000                                                                              
378100**************************************************                            
378200 50600000-ACTUALIZA-GLOBALES.                                                 
378210     IF W77-HAY-PAGOLC = 1                                                    
378220        PERFORM 50600010-CONT-GLOBALES.                                       
378230                                                                              
378240*****************************************************                         
378250 50600010-CONT-GLOBALES.                                                      
378300     MOVE 130               TO WS-NUM-PASO.                                   
378400     MOVE "ACTUALIZA B09 Y B14 GLOBAL " TO WKS-HI-DETALLE.                    
378500                                                                              
378600     PERFORM 90000000-BEGIN-TRANSACTION.                                      
378700     IF WS-STATUS-BASE > 0                                                    
378800        CALL SYSTEM DMTERMINATE.                                              
378900                                                                              
379000     PERFORM 50610000-INSTRUM-GLOBALES                                        
379100             VARYING WS-IND-INST FROM 1 BY 1                                  
379200                     UNTIL WS-IND-INST > 30.                                  
379300                                                                              
379400     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
379500     IF WS-STATUS-BASE > 0                                                    
379600        CALL SYSTEM DMTERMINATE.                                              
379700                                                                              
379800                                                                              
379900***********************************************************                   
380000 50610000-INSTRUM-GLOBALES.                                                   
380100     IF TB-B05-PROD(WS-IND-INST) > 0                                          
380120        PERFORM 50610100-DAME-B09CIFRAS                                       
380140        MOVE WKS-TOTAL-CVES-01    TO WKS-TOTAL-CVES-99                        
380160        PERFORM 50611000-TABXX-GLOBALES                                       
380180                                                                              
380200        MOVE WKS-TOTAL-CVES-02    TO WKS-TOTAL-CVES-99                        
380220        PERFORM 50611000-TABXX-GLOBALES                                       
380240                                                                              
380260        MOVE WKS-TOTAL-CVES-03    TO WKS-TOTAL-CVES-99                        
380280        PERFORM 50611000-TABXX-GLOBALES                                       
380300                                                                              
380320        MOVE WKS-TOTAL-CVES-04    TO WKS-TOTAL-CVES-99                        
380340        PERFORM 50611000-TABXX-GLOBALES                                       
380360                                                                              
380380        MOVE WKS-TOTAL-CVES-05    TO WKS-TOTAL-CVES-99                        
380400        PERFORM 50611000-TABXX-GLOBALES                                       
380420                                                                              
380440        MOVE WKS-TOTAL-CVES-06    TO WKS-TOTAL-CVES-99                        
380460        PERFORM 50611000-TABXX-GLOBALES                                       
380480                                                                              
380500        MOVE WKS-TOTAL-CVES-07    TO WKS-TOTAL-CVES-99                        
380520        PERFORM 50611000-TABXX-GLOBALES                                       
380540                                                                              
380560        MOVE WKS-TOTAL-CVES-08    TO WKS-TOTAL-CVES-99                        
380580        PERFORM 50611000-TABXX-GLOBALES                                       
380600                                                                              
380620        MOVE WKS-TOTAL-CVES-09    TO WKS-TOTAL-CVES-99                        
380640        PERFORM 50611000-TABXX-GLOBALES                                       
380660                                                                              
380680        MOVE WKS-TOTAL-CVES-10    TO WKS-TOTAL-CVES-99                        
380700        PERFORM 50611000-TABXX-GLOBALES                                       
380720                                                                              
380740        MOVE WKS-TOTAL-CVES-11    TO WKS-TOTAL-CVES-99                        
380750        PERFORM 50611000-TABXX-GLOBALES                                       
380760                                                                              
380770        MOVE WKS-TOTAL-CVES-12    TO WKS-TOTAL-CVES-99                        
380780        PERFORM 50611000-TABXX-GLOBALES                                       
380790                                                                              
380800        MOVE WKS-TOTAL-CVES-13    TO WKS-TOTAL-CVES-99                        
380810        PERFORM 50611000-TABXX-GLOBALES                                       
380820                                                                              
380830        MOVE WKS-TOTAL-CVES-14    TO WKS-TOTAL-CVES-99                        
380840        PERFORM 50611000-TABXX-GLOBALES                                       
380850                                                                              
380860        MOVE WKS-TOTAL-CVES-15    TO WKS-TOTAL-CVES-99                        
380870        PERFORM 50611000-TABXX-GLOBALES                                       
380880                                                                              
380890        MOVE WKS-TOTAL-CVES-16    TO WKS-TOTAL-CVES-99                        
380900        PERFORM 50611000-TABXX-GLOBALES                                       
380910                                                                              
380920        MOVE WKS-TOTAL-CVES-17    TO WKS-TOTAL-CVES-99                        
380930        PERFORM 50611000-TABXX-GLOBALES                                       
380940                                                                              
380950        MOVE WKS-TOTAL-CVES-18    TO WKS-TOTAL-CVES-99                        
380960        PERFORM 50611000-TABXX-GLOBALES                                       
380970                                                                              
380980        MOVE WKS-TOTAL-CVES-19    TO WKS-TOTAL-CVES-99                        
380990        PERFORM 50611000-TABXX-GLOBALES                                       
381000                                                                              
381010        MOVE WKS-TOTAL-CVES-20    TO WKS-TOTAL-CVES-99                        
381020        PERFORM 50611000-TABXX-GLOBALES                                       
381030                                                                              
383300        PERFORM 50610200-STORE-B09CIFRAS.                                     
383400                                                                              
383500*************************************************************                 
383600 50610100-DAME-B09CIFRAS.                                                     
383700     MOVE 002002                   TO WS-LLAVE-BANCOS.                        
383800     MOVE TB-B05-PROD(WS-IND-INST) TO WS-NUM-PRODUCTO.                        
383900                                                                              
384000     MOVE TB-B05-INST(WS-IND-INST) TO WS-NUM-INSTRUM.                         
384100     MOVE TB-B05-MONEDA(WS-IND-INST) TO WS-MONEDA.                            
384200     PERFORM 90000009-B09SXPRDINSTMON-LOCK.                                   
384300     IF WS-STATUS-BASE > 0                                                    
384600        MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                             
384700        MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                              
384800        MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                             
384900        MOVE WS-MONEDA             TO WS-MSG-MDA                              
385000        STRING "ERR LOCK B09CIFRAS STA=", WS-STATUS-BASE                      
385100               " ID=" WS-MSG-N-06, "-", WS-MSG-PRD, "-",                      
385200                      WS-MSG-INST, "-", WS-MSG-MDA                            
385300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
385400        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
385500        PERFORM 60613000-ESC-MENSAJES                                         
385600        PERFORM 70000050-MENSAJE                                              
386100        CALL SYSTEM DMTERMINATE.                                              
386200                                                                              
386300************************************************************                  
386400 50610200-STORE-B09CIFRAS.                                                    
386500                                                                              
386600     PERFORM 90000009-B09CIFRAS-STORE.                                        
386700     IF WS-STATUS-BASE > 0                                                    
387000        MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                             
387100        MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                              
387200        MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                             
387300        MOVE WS-MONEDA             TO WS-MSG-MDA                              
387400        STRING "ERR STORE B09CIFRAS STA=", WS-STATUS-BASE                     
387500            " ID=", WS-MSG-N-06,                                              
387600               " ", WS-MSG-PRD,                                               
387700               " ", WS-MSG-INST,                                              
387800               " ", WS-MSG-MDA                                                
387900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
388000        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
388100        PERFORM 60613000-ESC-MENSAJES                                         
388200        PERFORM 70000050-MENSAJE                                              
388700        CALL SYSTEM DMTERMINATE.                                              
388800                                                                              
388900**************************************************************                
389000 50611000-TABXX-GLOBALES.                                                     
389100     IF WKS-HAY-CLAVES-99(WS-IND-INST) = 1                                    
389200        MOVE ZERO TO WKS-IND-TOT                                              
389300        PERFORM 50611200-ACUMULA-GLOBALES                                     
389400                VARYING WKS-IND-TOT FROM 1 BY 1                               
389500                UNTIL WKS-IND-TOT > 100.                                      
389600                                                                              
389700********************************************************                      
389800 50611200-ACUMULA-GLOBALES.                                                   
389900     IF WKS-TCVE-99-CVE(WS-IND-INST, WKS-IND-TOT) > 0                         
390000        MOVE 002002                   TO WS-LLAVE-BANCOS                      
390100        MOVE TB-B05-PROD(WS-IND-INST) TO WS-NUM-PRODUCTO                      
390200        MOVE TB-B05-INST(WS-IND-INST) TO WS-NUM-INSTRUM                       
390300        MOVE TB-B05-MONEDA(WS-IND-INST) TO WS-MONEDA                          
390400        MOVE WKS-TCVE-99-CVE(WS-IND-INST, WKS-IND-TOT)                        
390500             TO WS-CLAVE-TRANS                                                
390600                                                                              
390700        PERFORM 90000014-B14SXPRDPASOCVE-LOCK                                 
390800        IF WS-DB-NOTERROR                                                     
390900           PERFORM 50612000-SUMA-B14CVEGLOBAL                                 
391000        ELSE                                                                  
391100        IF WS-DB-NOTFOUND                                                     
391200           PERFORM 90000014-B14TOTCVES-CREATE                                 
391300           IF WS-DB-NOTERROR                                                  
391400              MOVE WS-LLAVE-BANCOS       TO B14-LLAVE-BANCOS                  
391500              MOVE WS-NUM-PRODUCTO       TO B14-NUM-PRODUCTO                  
391600              MOVE WS-NUM-INSTRUM        TO B14-NUM-INSTRUM                   
391700              MOVE WS-MONEDA             TO B14-MONEDA                        
391800              MOVE WS-NUM-PASO           TO B14-NUM-PASO                      
391900              MOVE WS-CLAVE-TRANS        TO B14-CLAVE-TRANS                   
392000              PERFORM 50612000-SUMA-B14CVEGLOBAL                              
392100           ELSE                                                               
392400              STRING "ERR CREATE B14CVES STA=" WS-STATUS-BASE                 
392410                     DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                  
392500              MOVE WS-0101-TEXT-MSG      TO WLI-R01-MENSAJE                   
392600              PERFORM 60613000-ESC-MENSAJES                                   
392700              PERFORM 70000050-MENSAJE                                        
393200              CALL SYSTEM DMTERMINATE                                         
393300        ELSE                                                                  
393600         MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                            
393700         MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                             
393800         MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                            
393900         MOVE WS-MONEDA             TO WS-MSG-MDA                             
394000         MOVE WS-NUM-PASO           TO WS-MSG-PASO                            
394100         MOVE WS-CLAVE-TRANS        TO WS-MSG-CVE                             
394200         STRING "ERR LOCK B14CVES STA=", WS-STATUS-BASE                       
394300                 " ID=", WS-MSG-N-06,                                         
394400                    "-", WS-MSG-PRD                                           
394500                    "-", WS-MSG-INST                                          
394600                    "-", WS-MSG-MDA                                           
394700                    "-", WS-MSG-PASO                                          
394800                    "-", WS-MSG-CVE                                           
394900                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
395000         MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                            
395100         PERFORM 60613000-ESC-MENSAJES                                        
395200         PERFORM 70000050-MENSAJE                                             
395700         CALL SYSTEM DMTERMINATE.                                             
395800                                                                              
395900**************************************************************                
396000 50612000-SUMA-B14CVEGLOBAL.                                                  
396100     PERFORM 50104800-DAME-CVEFUNCION.                                        
396200                                                                              
396300     IF B17-AFECTA-S028 = 1                                                   
396400        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
396500         TO B09-S028B-CARGOS                                                  
396600     ELSE                                                                     
396700     IF B17-AFECTA-S028 = 2                                                   
396800        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
396900         TO B09-S028B-ABONOS.                                                 
397000                                                                              
397100     IF B17-AFECTA-S408 = 1                                                   
397200        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
397300         TO B09-S408B-CARGOS                                                  
397400        ADD WKS-TCVE-99-NUM(WS-IND-INST, WKS-IND-TOT)                         
397500         TO B09-S408B-NUMCAR                                                  
397600     ELSE                                                                     
397700     IF B17-AFECTA-S408 = 2                                                   
397800        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
397900         TO B09-S408B-ABONOS                                                  
398000        ADD WKS-TCVE-99-NUM(WS-IND-INST, WKS-IND-TOT)                         
398100         TO B09-S408B-NUMABO.                                                 
398200                                                                              
398300     IF B17-AFECTA-S052 = 1                                                   
398400        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
398500         TO B09-POSIB-CARGOS                                                  
398600        ADD WKS-TCVE-99-NUM(WS-IND-INST, WKS-IND-TOT)                         
398700         TO B09-POSI-NUMCAR                                                   
398800        SUBTRACT WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                    
398900         FROM B09-SDO-ACTUAL                                                  
399000     ELSE                                                                     
399100     IF B17-AFECTA-S052 = 2                                                   
399200        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
399300         TO B09-POSIB-ABONOS                                                  
399400        ADD WKS-TCVE-99-NUM(WS-IND-INST, WKS-IND-TOT)                         
399500         TO B09-POSI-NUMABO                                                   
399600        ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                         
399700         TO B09-SDO-ACTUAL.                                                   
399800                                                                              
399900                                                                              
400000     ADD WKS-TCVE-99-IMP(WS-IND-INST, WKS-IND-TOT)                            
400100         TO B14-IMPORTE                                                       
400200     ADD WKS-TCVE-99-NUM(WS-IND-INST, WKS-IND-TOT)                            
400300         TO B14-NUM-TRANS                                                     
400400     PERFORM 50612100-STORE-B14CVEGLOBAL.                                     
400500                                                                              
400600***********************************************                               
400700 50612100-STORE-B14CVEGLOBAL.                                                 
400800     PERFORM 90000014-B14TOTCVES-STORE.                                       
400900     IF WS-STATUS-BASE > 0                                                    
401200        MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                             
401300        MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                              
401400        MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                             
401500        MOVE WS-MONEDA             TO WS-MSG-MDA                              
401600        MOVE WS-NUM-PASO           TO WS-MSG-PASO                             
401700        MOVE WS-CLAVE-TRANS        TO WS-MSG-CVE                              
401800        STRING "ERR STORE B14TCVES STA=" WS-STATUS-BASE                       
401900            " ID=", WS-MSG-N-06,                                              
402000               " ", WS-MSG-PRD,                                               
402100               " ", WS-MSG-INST,                                              
402200               " ", WS-MSG-MDA,                                               
402300               " ", WS-MSG-PASO,                                              
402400               " ", WS-MSG-CVE                                                
402500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
402600        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
402700        PERFORM 60613000-ESC-MENSAJES                                         
402800        PERFORM 70000050-MENSAJE                                              
403300        CALL SYSTEM DMTERMINATE.                                              
403400                                                                              
403500*********************************************************                     
403520 51000000-BENEFICENCIA.                                                       
403522     MOVE "I03-B "         TO WKS-HI-TEX01.                                   
403524     MOVE " LEIDOS="       TO WKS-HI-TEX02.                                   
403526     MOVE " ACT="          TO WKS-HI-TEX04.                                   
403528     MOVE " RECH="         TO WKS-HI-TEX05.                                   
403530                                                                              
403540     MOVE 0       TO WKS-SI-B06.                                              
403560                                                                              
403580     STRING "  APLICO ARCHIVO " WKS-TIT-TRASPBENF                             
403600            DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE.                       
403610     MOVE WLI-R02-L07-DETALLE TO WLI-R01-MENSAJE                              
403620     PERFORM 60613000-ESC-MENSAJES.                                           
403630     PERFORM 60614000-ESC-R02 2 TIMES.                                        
403640                                                                              
403660     PERFORM 51000100-VAL-ARCH-BENF.                                          
403680                                                                              
403700     MOVE WLI-R02-L06-ENCA TO WLI-R02-L07-DETALLE.                            
403720     PERFORM 60614000-ESC-R02.                                                
403740                                                                              
403760     IF W77-HEAD-I03-OK = 1                                                   
403780        MOVE 1 TO W77-KEY-I03                                                 
403800        PERFORM 51000200-LEE-DET-BENF                                         
403820                UNTIL W77-EOF-I03 = 1.                                        
403840                                                                              
403860*************************************************************                 
403880 51000100-VAL-ARCH-BENF.                                                      
403900                                                                              
403920     MOVE ATTRIBUTE LASTRECORD OF I03-TRASPBENEF TO W77-LAST-I03.             
403940     ADD  1                                      TO W77-LAST-I03.             
403960     COMPUTE W77-REG-TPO3 = W77-LAST-I03 - 2.                                 
403980                                                                              
404000     PERFORM 51000110-VAL-HEAD-BENF.                                          
404020                                                                              
404040     IF W77-EOF-I03 = 0                                                       
404060        PERFORM 51000120-VAL-TRAL-BENF.                                       
404080                                                                              
404100*************************************************************                 
404120 51000110-VAL-HEAD-BENF.                                                      
404140     MOVE 1 TO W77-KEY-I03.                                                   
404160     READ I03-TRASPBENEF INTO WKS-I03-R01-HEADER                              
404180          INVALID KEY MOVE 1 TO W77-EOF-I03.                                  
404200                                                                              
404220     IF W77-EOF-I03 = 0                                                       
404240        IF WKS-I03-R01-TPOREG = 1                                             
404260       AND WKS-I03-R01-SEQ    = 1                                             
404280       AND WKS-I03-R01-SISDES = "S500"                                        
404300       AND WKS-I03-R01-FECHA  = WKS-FEC-BASE                                  
404320           MOVE 1 TO W77-HEAD-I03-OK                                          
404322           STRING "HEADER OK " WKS-I03-R01-DATA                               
404324                  DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                  
404326            PERFORM 60614000-ESC-R02                                          
404340        ELSE                                                                  
404360           STRING "ERROR EN HEADER " WKS-I03-R01-DATA                         
404380                  DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                  
404400            PERFORM 60614000-ESC-R02.                                         
404420                                                                              
404440****************************************************************              
404460 51000120-VAL-TRAL-BENF.                                                      
404480     COMPUTE W77-KEY-I03 = W77-LAST-I03.                                      
404500     READ I03-TRASPBENEF INTO WKS-I03-R09-TRAILER                             
404520          INVALID KEY MOVE 1 TO W77-EOF-I03.                                  
404540     IF W77-EOF-I03 = 0                                                       
404560        IF WKS-I03-R09-TPOREG = 9                                             
404580           IF WKS-I03-R09-TOTREG3 = W77-REG-TPO3                              
404590              MOVE W77-REG-TPO3  TO WS-MSG-N-08                               
404600              STRING "SI HAY TRAILER "                                        
404612                     " REGS  TRL=",  WKS-I03-R09-TOTREG3                      
404614                     ", REGS ARCH=", WS-MSG-N-08                              
404616                     DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE               
404618              PERFORM 60614000-ESC-R02                                        
404620           ELSE                                                               
404625              MOVE W77-REG-TPO3 TO WS-MSG-N-08                                
404640              STRING "ERR EN TRAILER BENEF "                                  
404660                     " REGS  TRL=",  WKS-I03-R09-TOTREG3                      
404680                     ", REGS ARCH=", WS-MSG-N-08                              
404700                     DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE               
404720              PERFORM 60614000-ESC-R02                                        
404740        ELSE                                                                  
404760           STRING "ARCHIVO BENEF SIN TRAILER "                                
404780                  "NO ESTA COMPLETO, NO SE APLICA "                           
404800                  DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                  
404820           PERFORM 60614000-ESC-R02                                           
404840           MOVE 0 TO W77-HEAD-I03-OK.                                         
404860                                                                              
404880*************************************************************                 
404900 51000200-LEE-DET-BENF.                                                       
404920     MOVE 0 TO W77-TPO-ERR.                                                   
404940     MOVE 0 TO W77-TPO-ACEPT.                                                 
404942                                                                              
404944     MOVE W77-LEIDOS-I03        TO WKS-HI-LEIDOS.                             
404946     MOVE W77-ACEPTA-I03        TO WKS-HI-REGSEL.                             
404948     MOVE W77-RECHAZO-I03       TO WKS-HI-NUMCALL.                            
404960                                                                              
405000     ADD 1  TO W77-KEY-I03.                                                   
405020     READ I03-TRASPBENEF INTO WKS-I03-R03-DATOS                               
405040          INVALID KEY MOVE 1 TO W77-EOF-I03.                                  
405060                                                                              
405080     IF W77-EOF-I03 = 0                                                       
405100        IF WKS-I03-R03-TPOREG = 3                                             
405110           ADD 1 TO W77-LEIDOS-I03                                            
405120           PERFORM 51000210-REG-03                                            
405140        ELSE                                                                  
405160        IF WKS-I03-R03-TPOREG = 9                                             
405180           PERFORM 51000600-REG-TRL                                           
405182           MOVE 1 TO W77-EOF-I03                                              
405200        ELSE                                                                  
405210           ADD  1 TO W77-LEIDOS-I03                                           
405220           MOVE 1 TO W77-TPO-ERR                                              
405240           PERFORM 51000300-RECHAZO.                                          
405260                                                                              
405280*************************************************************                 
405300 51000210-REG-03.                                                             
405320     IF WKS-I03-R03-CTO < 1000000000000                                       
405340        IF WKS-I03-R03-CALIF = 1 OR 5                                         
405345           PERFORM 51000211-VAL-FECH                                          
405350           IF W77-ERR-LOCSUP = 0                                              
405360              PERFORM 51000212-VAL-B03                                        
405370           ELSE                                                               
405372              MOVE 10 TO W77-TPO-ERR                                          
405374              PERFORM 51000300-RECHAZO                                        
405380        ELSE                                                                  
405400           MOVE 2 TO W77-TPO-ERR                                              
405420           PERFORM 51000300-RECHAZO                                           
405440     ELSE                                                                     
405445        MOVE 3 TO W77-TPO-ERR                                                 
405450        PERFORM 51000300-RECHAZO.                                             
405455                                                                              
405460********************************************************                      
405462 51000211-VAL-FECH.                                                           
405464     IF WKS-I03-R03-FECHAP > 0                                                
405466        MOVE WKS-I03-R03-FECHAP     TO WS-S006-FECHA1                         
405468        MOVE 1                      TO WS-S006-FECHA2                         
405470        MOVE 13                     TO WS-S006-FORMATO                        
405472        MOVE 20                     TO WS-S006-FUNCION                        
405474        MOVE 405480                 TO W77-LIN-ERR                            
405480        PERFORM 20040300-LLAMA-LOCSUP.                                        
405500                                                                              
405520***************************************************************               
405540 51000212-VAL-B03.                                                            
405560     MOVE 0               TO WKS-SIN-B03.                                     
405580     MOVE 0               TO WKS-SI-B03.                                      
405600     MOVE WKS-I03-R03-CTO TO WS-NUM-CONTRATO.                                 
405620     MOVE WS-NUM-CONTRATO TO WS-MSG-CTO.                                      
405640     PERFORM 90000003-B03SXCTO-LOCK.                                          
405660     IF WS-STATUS-BASE > 0                                                    
405680        IF WS-DB-NOTFOUND                                                     
405700           MOVE 1               TO WKS-SIN-B03                                
405720        ELSE                                                                  
405740           MOVE WS-NUM-CONTRATO       TO WS-MSG-CTO                           
405760           STRING "ERR LOCK  B03SXCTO CTO=", WS-MSG-CTO                       
405780                  " STA=" WS-STATUS-BASE                                      
405800                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
405820           PERFORM 70000050-MENSAJE                                           
405840           CALL SYSTEM DMTERMINATE.                                           
405860                                                                              
405862     IF B03-MARCA-CLON = 3                                                    
405864        MOVE 11 TO W77-TPO-ERR                                                
405866        PERFORM 51000300-RECHAZO                                              
405868     ELSE                                                                     
405880     IF WKS-SIN-B03 = 1 OR B03-MARCA-CLON = 2                                 
405900        MOVE 4 TO W77-TPO-ERR                                                 
405920        PERFORM 51000300-RECHAZO                                              
405940     ELSE                                                                     
405960        PERFORM 51000214-SI-B03.                                              
405980                                                                              
406000************************************************************                  
406020 51000214-SI-B03.                                                             
406040     IF WKS-I03-R03-PROD = B03-NUM-PRODUCTO                                   
406060    AND WKS-I03-R03-INST = B03-NUM-INSTRUM                                    
406080    AND WKS-I03-R03-MONE = B03-MONEDA                                         
406090        IF B03-STA-BENEF = 1                                                  
406095           IF B03-STATUS = 0 OR 5                                             
406100              IF WKS-I03-R03-CALIF = 5                                        
406110                 PERFORM 51000250-ACTB03                                      
406150                 PERFORM 50125000-STORE-BASE                                  
406160                 PERFORM 51000400-ACEPTADO                                    
406170              ELSE                                                            
406180                 MOVE 5   TO W77-TPO-ERR                                      
406190                 PERFORM 51000300-RECHAZO                                     
406192           ELSE                                                               
406194              MOVE 9   TO W77-TPO-ERR                                         
406196              PERFORM 51000300-RECHAZO                                        
406200        ELSE                                                                  
406210        IF B03-STA-BENEF = 5                                                  
406220           IF WKS-I03-R03-CALIF = 1                                           
406230              PERFORM 51000250-ACTB03                                         
406270              PERFORM 50125000-STORE-BASE                                     
406280              PERFORM 51000400-ACEPTADO                                       
406290           ELSE                                                               
406300              MOVE 6   TO W77-TPO-ERR                                         
406310              PERFORM 51000300-RECHAZO                                        
406320        ELSE                                                                  
406330           MOVE 7   TO W77-TPO-ERR                                            
406340           PERFORM 51000300-RECHAZO                                           
406350     ELSE                                                                     
406360        MOVE 8   TO W77-TPO-ERR                                               
406380        PERFORM 51000300-RECHAZO.                                             
406390************************************************************                  
406400 51000250-ACTB03.                                                             
406410     MOVE B03-STA-BENEF     TO W77-STA-ANT.                                   
406415     MOVE WKS-I03-R03-CALIF TO B03-STA-BENEF.                                 
406420     MOVE 1                 TO WKS-SI-B03.                                    
406425                                                                              
406430     IF WKS-I03-R03-CALIF = 5                                                 
406432        MOVE 1  TO W77-TPO-ACEPT                                              
406440        IF WKS-I03-R03-FECHAP > 0                                             
406442           MOVE WKS-I03-R03-FECHAP TO B03-FEC-ENTART61                        
406450        ELSE                                                                  
406452           MOVE ZERO               TO B03-FEC-ENTART61                        
406460     ELSE                                                                     
406462        MOVE 2     TO W77-TPO-ACEPT                                           
406464        MOVE ZERO  TO B03-FEC-ENTART61.                                       
406500                                                                              
406540*************************************************************                 
406560 51000300-RECHAZO.                                                            
406580                                                                              
406582     ADD 1 TO W77-RECHAZO-I03.                                                
406584                                                                              
406600     IF W77-TPO-ERR > 0 AND < 12                                              
406620        STRING "RECHAZO " WS-ERR-TB-BEBEF(W77-TPO-ERR)                        
406640               DELIMITED BY SIZE INTO WLI-R02-L07-CONCP                       
406660     ELSE                                                                     
406680        MOVE "RECHAZO ERR DESCONOCIDO " TO WLI-R02-L07-CONCP.                 
406700                                                                              
406720     PERFORM 51000500-ARMA-LIN.                                               
406740                                                                              
406760***********************************************************                   
406780 51000400-ACEPTADO.                                                           
406800                                                                              
406802     ADD 1 TO W77-ACEPTA-I03.                                                 
406804                                                                              
406820     IF W77-TPO-ACEPT = 1                                                     
406840        MOVE "ACEPTADO CALIFA TRASP MANUAL"                                   
406860          TO WLI-R02-L07-CONCP                                                
406880     ELSE                                                                     
406900        MOVE "ACEPTADO DESCALIFA TRASP MANUAL"                                
406920          TO WLI-R02-L07-CONCP.                                               
406940                                                                              
406960     PERFORM 51000500-ARMA-LIN.                                               
406980                                                                              
407000****************************************************************              
407020 51000500-ARMA-LIN.                                                           
407030     MOVE WKS-I03-R03-TPOREG     TO WLI-R02-L07-TPREG.                        
407040     MOVE WKS-I03-R03-SEQ        TO WLI-R02-L07-SEQ.                          
407060     MOVE WKS-I03-R03-PROD       TO WLI-R02-L07-PROD.                         
407080     MOVE WKS-I03-R03-INST       TO WLI-R02-L07-INST.                         
407100     MOVE WKS-I03-R03-MONE       TO WLI-R02-L07-MONE.                         
407120     MOVE WKS-I03-R03-CTO        TO WLI-R02-L07-CTO.                          
407140     MOVE WKS-I03-R03-CALIF      TO WLI-R02-L07-STAA.                         
407160***  MOVE 0                      TO WLI-R02-L07-STAB.                         
407180***  MOVE 0                      TO WLI-R02-L07-STAN.                         
407200***  MOVE 0                      TO WLI-R02-L07-SDO.                          
407220***  MOVE 0                      TO WLI-R02-L07-SUC.                          
407240                                                                              
407250     IF W88-TPO-ERR-NB03                                                      
407260        NEXT SENTENCE                                                         
407280     ELSE                                                                     
407300        MOVE B03-SUC-PROMOTORA   TO WLI-R02-L07-SUC                           
407320        ADD  B03-SDO-ACTUAL B03-SDOPROT-BLOQ                                  
407322             GIVING  WLI-R02-L07-SDO                                          
407340        IF W77-TPO-ERR = 0                                                    
407360           MOVE B03-STA-BENEF    TO WLI-R02-L07-STAN                          
407380           MOVE W77-STA-ANT      TO WLI-R02-L07-STAB                          
407400        ELSE                                                                  
407420           MOVE B03-STA-BENEF    TO WLI-R02-L07-STAB.                         
407440                                                                              
407460     PERFORM 60614000-ESC-R02.                                                
407480                                                                              
407500********************************************************                      
407600 51000600-REG-TRL.                                                            
407610     PERFORM 60614000-ESC-R02.                                                
407700     MOVE W77-LEIDOS-I03 TO WS-MSG-N-08                                       
407800     STRING "TRAILER  "                                                       
407900            " REG TRL " WKS-I03-R09-TOTREG3                                   
408100            DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                        
408200     PERFORM 60614000-ESC-R02 2 TIMES.                                        
408300                                                                              
408400*********************************************************                     
420500 59000000-ACTUALIZA-CONTROL.                                                  
420600     PERFORM 90000000-BEGIN-TRANSACTION.                                      
420700     IF WS-STATUS-BASE > 0                                                    
420800        CALL SYSTEM DMTERMINATE.                                              
420900                                                                              
420905     PERFORM 90000002-B02CONTROL-LOCK.                                        
420910     IF WS-STATUS-BASE > 0                                                    
420925        STRING "ERR LOCK B02CONTROL ", WS-STATUS-BASE                         
420930               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
420935        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
420940        PERFORM 60613000-ESC-MENSAJES                                         
420945        PERFORM 70000050-MENSAJE                                              
420950        CALL SYSTEM DMTERMINATE.                                              
420955                                                                              
421000     PERFORM 90000000-B00CTRLPASO-LOCK.                                       
421100     IF WS-STATUS-BASE > 0                                                    
421400        STRING "ERROR LOCK B00CTRLPASOS ", WS-STATUS-BASE                     
421500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
421600        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
421700        PERFORM 60613000-ESC-MENSAJES                                         
421800        PERFORM 70000050-MENSAJE                                              
421900        CALL SYSTEM DMTERMINATE.                                              
422000                                                                              
422100     MOVE 102                TO B00-NUM-PASO-01.                              
422200     MOVE ZEROS              TO B02-PGOPEND-S408.                             
422300     MOVE ZEROS              TO B02-HAY-ST2113.                               
422305                                                                              
422310     IF W77-BAN-REGS = 9                                                      
422315        MOVE W77-NUMCTO-CPY-1   TO B00-NUM-CTO-CPY (1)                        
422320        MOVE W77-NUMREG-CPY-1   TO B00-NUM-REG-CPY (1)                        
422325        MOVE W77-NUMCTO-CPY-2   TO B00-NUM-CTO-CPY (2)                        
422330        MOVE W77-NUMREG-CPY-2   TO B00-NUM-REG-CPY (2)                        
422335        MOVE W77-NUMCTO-CPY-3   TO B00-NUM-CTO-CPY (3)                        
422340        MOVE W77-NUMREG-CPY-3   TO B00-NUM-REG-CPY (3).                       
422400                                                                              
422500     PERFORM 90000002-B02CONTROL-STORE                                        
422600     IF WS-STATUS-BASE > 0                                                    
422900        STRING "ERR STORE FIN B02CONTROL ", WS-STATUS-BASE                    
423000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
423100        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
423200        PERFORM 60613000-ESC-MENSAJES                                         
423300        PERFORM 70000050-MENSAJE                                              
423400        CALL SYSTEM DMTERMINATE.                                              
423405                                                                              
423410     PERFORM 90000000-B00CTRLPASO-STORE.                                      
423415     IF WS-STATUS-BASE > 0                                                    
423430        STRING "ERROR STORE B00CTRLPASO ", WS-STATUS-BASE                     
423435               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
423440        MOVE WS-0101-TEXT-MSG  TO WLI-R01-MENSAJE                             
423445        PERFORM 60613000-ESC-MENSAJES                                         
423450        PERFORM 70000050-MENSAJE                                              
423455        CALL SYSTEM DMTERMINATE.                                              
423470                                                                              
423500     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
423600     IF WS-STATUS-BASE > 0                                                    
423700        CALL SYSTEM DMTERMINATE.                                              
424000                                                                              
424100****************************************************                          
430100*****************************************************************             
430200 59999990-FIN-PGM.                                                            
430300                                                                              
430400     ADD  1                     TO WKS-I02-R99-NUMREGS.                       
430500     MOVE WKS-I02-R99-TRAILER   TO I02-R00-PUNTEOOUT.                         
430600     PERFORM 20015600-ESCRIBE-PUNTEO.                                         
430610                                                                              
430615     WRITE I04-FD-DISP-P010   FROM WKS-I04-R09-TRAILER.                       
430700                                                                              
430800     MOVE W77-TOT-B03-CTOS TO WS-MSG-N-08                                     
430900     STRING "CONTRATOS LEIDOS EN B03 ", WS-MSG-N-08                           
431000            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
431100     PERFORM 60613000-ESC-MENSAJES.                                           
431200                                                                              
431300     MOVE W77-STOR-B03-ANT  TO WS-MSG-N-08                                    
431400     STRING "CONTRATOS STORE EN B03  " WS-MSG-N-08                            
431500            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
431600     PERFORM 60613000-ESC-MENSAJES.                                           
431700                                                                              
431800     MOVE W77-TOT-B06-STORE TO WS-MSG-N-08                                    
431900     STRING "CONTRATOS STORE EN B06  " WS-MSG-N-08                            
432000            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432100     PERFORM 60613000-ESC-MENSAJES.                                           
432110                                                                              
432120     MOVE WKS-I04-R09-NUMABONOS TO WS-MSG-N-08                                
432122     STRING "GEN ARCH P010 CON " WS-MSG-N-08 " REGS "                         
432123            WKS-TIT-I04-P010                                                  
432124            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432126     PERFORM 60613000-ESC-MENSAJES.                                           
432127                                                                              
432128     MOVE WKS-I05-R09-NUMREG    TO WS-MSG-N-08                                
432130     STRING "GEN ARCH ESQ CONT CON " WS-MSG-N-08 " REGS "                     
432132            WKS-TIT-I05-ARCHB22                                               
432134            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432136     PERFORM 60613000-ESC-MENSAJES.                                           
432137                                                                              
432200                                                                              
432220     MOVE W77-LEIDOS-I03    TO WS-MSG-N-08                                    
432240     STRING "REGS LEIDOS EN ARCH     " WS-MSG-N-08                            
432260            DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                        
432265     MOVE WLI-R02-L07-DETALLE TO WLI-R01-MENSAJE                              
432270     PERFORM 60613000-ESC-MENSAJES.                                           
432280     PERFORM 60614000-ESC-R02.                                                
432300                                                                              
432320     MOVE W77-ACEPTA-I03    TO WS-MSG-N-08                                    
432340     STRING "REGS MODIF EN B03       " WS-MSG-N-08                            
432360            DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                        
432365     MOVE WLI-R02-L07-DETALLE TO WLI-R01-MENSAJE                              
432370     PERFORM 60613000-ESC-MENSAJES.                                           
432380     PERFORM 60614000-ESC-R02.                                                
432400                                                                              
432420     MOVE W77-RECHAZO-I03   TO WS-MSG-N-08                                    
432440     STRING "REGS RECHAZADOS         " WS-MSG-N-08                            
432460            DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                        
432465     MOVE WLI-R02-L07-DETALLE TO WLI-R01-MENSAJE                              
432470     PERFORM 60613000-ESC-MENSAJES.                                           
432480     PERFORM 60614000-ESC-R02 2 TIMES.                                        
432500                                                                              
432512     STRING "INICIO COPIA 01 "                                                
432514            ", REG=" W77-NUMREG-CPY-1 ", CTO=" W77-NUMCTO-CPY-1               
432516            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432518     PERFORM 60613000-ESC-MENSAJES.                                           
432520                                                                              
432522     STRING "INICIO COPIA 02 "                                                
432524            ", REG=" W77-NUMREG-CPY-2 ", CTO=" W77-NUMCTO-CPY-2               
432526            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432528     PERFORM 60613000-ESC-MENSAJES.                                           
432530                                                                              
432532     STRING "INICIO COPIA 03 "                                                
432534            ", REG=" W77-NUMREG-CPY-3 ", CTO=" W77-NUMCTO-CPY-3               
432536            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
432538     PERFORM 60613000-ESC-MENSAJES.                                           
432540                                                                              
432600     MOVE ZERO TO WS-IND-INST.                                                
432700     PERFORM 90005000-DISP-PROD 30 TIMES.                                     
433200                                                                              
433300     CLOSE I02-PUNTEOOUT  WITH SAVE.                                          
433305     CLOSE I04-DISP-P010  WITH SAVE.                                          
433307     CLOSE I05-ARCHB22    WITH SAVE.                                          
433310                                                                              
433320     IF W77-HAY-ARCH-BENEF = 1                                                
433330        CLOSE I03-TRASPBENEF WITH SAVE.                                       
433400                                                                              
433500     ACCEPT WKS-TIME-MAQ-TEM         FROM TIME.                               
433600     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
433700                                                                              
433800     MOVE WKS-FEC-MAQ-08      TO W77-FECHA-EDIT.                              
433900     MOVE WKS-HH-MAQ-TEM      TO WKS-HH-EDIT-P.                               
433920     MOVE WKS-MM-MAQ-TEM      TO WKS-MM-EDIT-P.                               
433940     MOVE WKS-SS-MAQ-TEM      TO WKS-SS-EDIT-P.                               
433960     MOVE WKS-DD-MAQ-TEM      TO WKS-DD-EDIT-P.                               
434000     STRING "FIN DE PROCESO ",                                                
434100            "  FECHA: ",  W77-FECHA-EDIT,                                     
434200            "  HORA: ",   WKS-HORA-EDIT-P                                     
434300            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
434400     PERFORM 60613000-ESC-MENSAJES.                                           
434500                                                                              
434600     PERFORM 60613000-ESC-MENSAJES.                                           
434700     MOVE  WLI-R00-L99-FINAL  TO WLI-R01-MENSAJE.                             
434800     PERFORM 60613000-ESC-MENSAJES.                                           
434820                                                                              
434840     PERFORM 60614000-ESC-R02.                                                
434860     MOVE  WLI-R00-L99-FINAL  TO WLI-R02-L07-DETALLE                          
434880     PERFORM 60614000-ESC-R02.                                                
434900                                                                              
434950     CLOSE R02-TRPBENEF  WITH SAVE.                                           
435000     CLOSE R01-MENSAJES  WITH SAVE.                                           
435020     MOVE 0 TO W77-OPEN-R01.                                                  
435100                                                                              
435200                                                                              
435300***************************************************************               
435400 60613000-ESC-MENSAJES.                                                       
435420     IF W77-OPEN-R01 = 1                                                      
435500        ACCEPT WKS-TIME-R01           FROM TIME                               
435600        MOVE WKS-HH-TIME-R01          TO WKS-HH-EDIT-P                        
435620        MOVE WKS-MM-TIME-R01          TO WKS-MM-EDIT-P                        
435640        MOVE WKS-SS-TIME-R01          TO WKS-SS-EDIT-P                        
435660        MOVE WKS-DD-TIME-R01          TO WKS-DD-EDIT-P                        
435680        MOVE WKS-HORA-EDIT-P          TO WLI-R01-HORA                         
435700        ADD 1 TO W77-R01-NLIN                                                 
435800        IF W77-R01-NLIN > 50                                                  
435900           PERFORM 60613100-ENCA-MENSAJES.                                    
435920                                                                              
435940     IF W77-OPEN-R01 = 1                                                      
436000        WRITE R01-L00-MENSAJE FROM WLI-R01-L06-DETALLE AFTER 1.               
436050                                                                              
436100     MOVE " "  TO WLI-R01-L06-DETALLE.                                        
436200                                                                              
436300*****************************************************************             
436400 60613100-ENCA-MENSAJES.                                                      
436500     ADD 1                        TO W77-R01-NPAG.                            
436600     MOVE W77-R01-NPAG            TO WLI-R00-L03-NPAG.                        
436700     MOVE WKS-TITULO-R01          TO WLI-R00-L02-TITULO.                      
436800     MOVE " "                     TO WLI-R00-L03-SBTIT.                       
436900     MOVE "001MENSAJES"           TO WLI-R00-L01-NAME.                        
437000                                                                              
437100     IF W77-MY-CSI = 4                                                        
437200        MOVE 3667                     TO WLI-R00-L04-SUC                      
437300        MOVE "CYSAU MTY CTROL PROD"   TO WLI-R00-L05-NBSUC                    
437400     ELSE                                                                     
437500        MOVE 3084                     TO WLI-R00-L04-SUC                      
437600        MOVE "PYCP JARDINES"          TO WLI-R00-L05-NBSUC.                   
437700                                                                              
437800     WRITE R01-L00-MENSAJE    FROM WLI-R00-L01-ENCA AFTER PAGE.               
437900     WRITE R01-L00-MENSAJE    FROM WLI-R00-L02-ENCA AFTER 1.                  
438000     WRITE R01-L00-MENSAJE    FROM WLI-R00-L03-ENCA AFTER 1.                  
438100     WRITE R01-L00-MENSAJE    FROM WLI-R00-L04-ENCA AFTER 1.                  
438200     WRITE R01-L00-MENSAJE    FROM WLI-R00-L05-ENCA AFTER 1.                  
438300     MOVE " "                 TO R01-L00-MENSAJE.                             
438400     WRITE R01-L00-MENSAJE                          AFTER 1.                  
438500     MOVE 7 TO W77-R01-NLIN.                                                  
438505                                                                              
438510**********************************************************                    
438515 60614000-ESC-R02.                                                            
438520     ADD 1 TO W77-R02-NLIN.                                                   
438525     IF W77-R02-NLIN > 57                                                     
438530        PERFORM 60614100-ENCA-R02.                                            
438535                                                                              
438540     WRITE R02-L00-TRPBENEF FROM WLI-R02-L07-DETALLE AFTER 1.                 
438545     MOVE " " TO  WLI-R02-L07-DETALLE.                                        
438550                                                                              
438555**************************************************************                
438560 60614100-ENCA-R02.                                                           
438565     ADD 1                        TO W77-R02-NPAG.                            
438570     MOVE W77-R02-NPAG            TO WLI-R00-L03-NPAG.                        
438575     MOVE WKS-TITULO-R02          TO WLI-R00-L02-TITULO.                      
438580     MOVE WKS-SUBTIT-R02          TO WLI-R00-L03-SBTIT.                       
438585     MOVE "002TRASPMANUAL"        TO WLI-R00-L01-NAME.                        
438590                                                                              
438595     IF W77-MY-CSI = 4                                                        
438600        MOVE 3667                     TO WLI-R00-L04-SUC                      
438605        MOVE "CYSAU MTY CTROL PROD"   TO WLI-R00-L05-NBSUC                    
438610     ELSE                                                                     
438615        MOVE 3084                     TO WLI-R00-L04-SUC                      
438620        MOVE "PYCP JARDINES"          TO WLI-R00-L05-NBSUC.                   
438625                                                                              
438630     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L01-ENCA AFTER PAGE.               
438635     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L02-ENCA AFTER 1.                  
438640     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L03-ENCA AFTER 1.                  
438645     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L04-ENCA AFTER 1.                  
438650     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L05-ENCA AFTER 1.                  
438655     WRITE R02-L00-TRPBENEF   FROM WLI-R00-L97-ESPA AFTER 1.                  
438660     WRITE R02-L00-TRPBENEF   FROM WLI-R02-L06-ENCA AFTER 1.                  
438670     MOVE 8 TO W77-R02-NLIN.                                                  
438675                                                                              
438700**********************************************************                    
438800  70000000-INI-PGM-MAPLI.                                                     
438900      MOVE 1                TO W77-ID-NUM-COPIA-MAPLI.                        
439000      MOVE 1                TO W77-ID-TPODSP-INFO-MAPLI.                      
439100      MOVE 0                TO W77-ID-ESINI-GRUPO-MAPLI.                      
439200      MOVE 06               TO W77-ID-NUM-GRUPO-MAPLI.                        
439300      MOVE "BATCH DIARIO"   TO W77-ID-NOMB-LIB.                               
439400      PERFORM 70000950-INI-PGM-MAPLI.                                         
439450      IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                    
439500         PERFORM 70000900-ERROR-MAPLI.                                        
439700                                                                              
440300***********************************************************                   
440400 70000100-ACTI-01-INICIO.                                                     
440600     MOVE 1                      TO W77-ID-NUMREG-PROC.                       
440900     MOVE 01                     TO W77-ID-ACTXX-MAPLI                        
440920                                    W77-ID-ACT01-MAPLI.                       
441000     MOVE "OPEN Y VALIDA BASE  "                                              
441100       TO W77-ID-NOMB-LIB.                                                    
441200     MOVE "PROCESO DE INICIO DE UNICA VEZ "                                   
441300       TO W77-ID-TXTA-LIB.                                                    
441400                                                                              
441500     PERFORM 70000910-INIACT-MAPLI.                                           
441600     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
441700        PERFORM 70000900-ERROR-MAPLI.                                         
442000                                                                              
443100*************************************************************                 
443200 70000400-ACTI-02-PGOSPEND.                                                   
443400                                                                              
443700     MOVE 02                     TO W77-ID-ACTXX-MAPLI                        
443720                                    W77-ID-ACT02-MAPLI.                       
443800     MOVE "PAGOS PEND AL S408 "                                               
443900       TO W77-ID-NOMB-LIB.                                                    
444000     MOVE "PAGOS PEND AL S408 Y ACT DE CIFRAS "                               
444100       TO W77-ID-TXTA-LIB.                                                    
444200                                                                              
444300     PERFORM 70000910-INIACT-MAPLI.                                           
444320     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
444340        PERFORM 70000900-ERROR-MAPLI.                                         
444400                                                                              
444900******************************************************************            
444910 70000420-ACTI-03-BENEF.                                                      
444920     MOVE 1                      TO W77-ID-NUMREG-PROC.                       
444922     MOVE 03                     TO W77-ID-ACTXX-MAPLI                        
444924                                    W77-ID-ACT03-MAPLI.                       
444926     MOVE "BENEFICENCIA       "                                               
444928       TO W77-ID-NOMB-LIB.                                                    
444930     MOVE "APLICO ARCHIVO TARSP MANUALES      "                               
444932       TO W77-ID-TXTA-LIB.                                                    
444934                                                                              
444936     PERFORM 70000910-INIACT-MAPLI.                                           
444938     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
444940        PERFORM 70000900-ERROR-MAPLI.                                         
444942                                                                              
444950******************************************************************            
449000******************************************************************            
449100 70000700-ACTI-04-ACTCTRL.                                                    
449300     MOVE 1                      TO W77-ID-NUMREG-PROC.                       
449600     MOVE 04                     TO W77-ID-ACTXX-MAPLI                        
449620                                    W77-ID-ACT04-MAPLI.                       
449700     MOVE "ACT CTRL Y CLOSE BD "                                              
449800       TO W77-ID-NOMB-LIB.                                                    
449900     MOVE "ACTUALIZA PASO Y FIN DIA AL S408 "                                 
450000       TO W77-ID-TXTA-LIB.                                                    
450100                                                                              
450200     PERFORM 70000910-INIACT-MAPLI.                                           
450220     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
450240        PERFORM 70000900-ERROR-MAPLI.                                         
450300                                                                              
450800**************************************************************                
450900 70000900-ERROR-MAPLI.                                                        
450902     IF W77-OPEN-R01 = 1                                                      
450905        MOVE 1                   TO W77-ERR-L035-MAPLI                        
450910        MOVE WS-S038L035-RESULT  TO WS-MSG-RS                                 
450920        STRING "ERROR LIB/MAPLI "  WS-MSG-RS                                  
450930               " SUSPENDO MONITOREO "                                         
450940               DELIMITED BY SIZE INTO WLI-R01-MENSAJE                         
450950        PERFORM 60613000-ESC-MENSAJES.                                        
450960                                                                              
450990**************************************************************                
451000 90005000-DISP-PROD.                                                          
451005     ADD 1 TO WS-IND-INST.                                                    
451010                                                                              
451015     IF TB-B05-PROD(WS-IND-INST) > 0                                          
451020        IF TB-B05-IND-BENEF(WS-IND-INST) > 0                                  
451025           MOVE TB-B05-PROD  (WS-IND-INST)    TO WS-MSG-PRD                   
451030           MOVE TB-B05-INST  (WS-IND-INST)    TO WS-MSG-INST                  
451035           MOVE TB-B05-MONEDA(WS-IND-INST)    TO WS-MSG-MDA                   
451040           MOVE TB-B05-IND-BENEF(WS-IND-INST) TO WS-MSG-N-02                  
451045           STRING "PRODUCTO=" WS-MSG-PRD "-" WS-MSG-INST                      
451050                          "-" WS-MSG-MDA                                      
451055                  " IND-BENEF=" WS-MSG-N-02                                   
451060                  DELIMITED BY SIZE INTO WLI-R02-L07-DETALLE                  
451065           PERFORM 60614000-ESC-R02.                                          
451070                                                                              
451075**************************************************************                
451100 90005090-CALCULA-REGS.                                                       
451102     MOVE 0 TO W77-NUMREG-B03.                                                
451104                                                                              
451106     IF W77-ID-ERR-LIB-MAPLI = 0                                              
451108    AND W77-ID-NUMREG-PROC > 0                                                
451110        MOVE W77-ID-NUMREG-PROC  TO W77-NUMREG-B03.                           
451112                                                                              
451114     IF W77-NUMREG-B03 = 0                                                    
451116        IF W77-ES-PRODUCCION = 1                                              
451118           MOVE 1500000 TO W77-NUMREG-B03                                     
451120        ELSE                                                                  
451122        IF W77-ES-UAT = 1                                                     
451124           MOVE 750000 TO W77-NUMREG-B03                                      
451126        ELSE                                                                  
451128           MOVE 1500 TO W77-NUMREG-B03.                                       
451130                                                                              
451132     MOVE W77-NUMREG-B03 TO WS-MSG-N-08                                       
451134     STRING "UTILIZO=" WS-MSG-N-08                                            
451136            " REGS PARA CTRL DE LECTURA P130"                                 
451138            DELIMITED BY SIZE INTO WLI-R01-MENSAJE                            
451140     PERFORM 60613000-ESC-MENSAJES.                                           
451142                                                                              
451150     IF W77-NUMREG-B03 > 3                                                    
451152        COMPUTE W77-NUMREG-CPY-1 = (W77-NUMREG-B03 / 3) * 2                   
451154        COMPUTE W77-NUMREG-CPY-2 = (W77-NUMREG-B03 / 3) * 1                   
451156        COMPUTE W77-NUMREG-CPY-3 = 1                                          
451158     ELSE                                                                     
451160        MOVE 0      TO W77-NUMREG-CPY-1                                       
451162                       W77-NUMREG-CPY-2                                       
451164                       W77-NUMREG-CPY-3.                                      
451166                                                                              
451168     IF W77-NUMREG-CPY-1 > 0                                                  
451170    AND W77-NUMREG-CPY-2 > 0                                                  
451172        MOVE 2 TO W77-BAN-REGS.                                               
451174                                                                              
451190*****************************************************************             
451200                                                                              
451300                                                                              
451390***************************************************************               
451400 90005092-SELEC-REGS.                                                         
451401     IF W77-NUMCTO-CPY-3 = 0                                                  
451402        IF W77-TOT-B03-CTOS = W77-NUMREG-CPY-3                                
451404           IF WKS-ES-MENSUAL = 1                                              
451406              IF B03-STATUS = 3 OR 4                                          
451408                 ADD 1 TO W77-NUMREG-CPY-3                                    
451410              ELSE                                                            
451412                 MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-3                    
451414           ELSE                                                               
451416              MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-3.                      
451418                                                                              
451419     IF W77-NUMCTO-CPY-2 = 0                                                  
451420        IF W77-TOT-B03-CTOS = W77-NUMREG-CPY-2                                
451422           IF WKS-ES-MENSUAL = 1                                              
451424              IF B03-STATUS = 3 OR 4                                          
451426                 ADD 1 TO W77-NUMREG-CPY-2                                    
451428              ELSE                                                            
451430                 MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-2                    
451432           ELSE                                                               
451434              MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-2.                      
451436                                                                              
451437     IF W77-NUMCTO-CPY-1 = 0                                                  
451438        IF W77-TOT-B03-CTOS = W77-NUMREG-CPY-1                                
451440           IF WKS-ES-MENSUAL = 1                                              
451442              IF B03-STATUS = 3 OR 4                                          
451444                 ADD 1 TO W77-NUMREG-CPY-1                                    
451446              ELSE                                                            
451448                 MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-1                    
451450           ELSE                                                               
451452              MOVE B03-NUM-CONTRATO TO W77-NUMCTO-CPY-1.                      
451454                                                                              
451456                                                                              
451458     IF W77-NUMCTO-CPY-1 > 0                                                  
451460        MOVE 9 TO W77-BAN-REGS.                                               
451462*************************************************************                 
451464                                                                              
451466 90005094-ARCH-ESQCONT.                                                       
451468     MOVE "INICIO ARCHIVO ESQUEMAS CONTABLES  "                               
451470          TO WLI-R01-MENSAJE.                                                 
451472     PERFORM 60613000-ESC-MENSAJES.                                           
451474     STRING "GEN ARCH ESQ CONT " WKS-TIT-I05-ARCHB22                          
451476            DELIMITED BY SIZE INTO WLI-R01-MENSAJE.                           
451478     PERFORM 60613000-ESC-MENSAJES.                                           
451480     WRITE I05-FD-ARCHB22 FROM WKS-I05-R01-HEADER.                            
451490                                                                              
451492     SET S500B22ESQCONT        TO BEGINNING.                                  
451494     PERFORM 90005096-LEE-B22ESQCONT                                          
451496             UNTIL W77-EOF-B22 = 1.                                           
451497     WRITE I05-FD-ARCHB22 FROM WKS-I05-R09-TRAILER.                           
451498                                                                              
451499     MOVE "TERMINA ARCHIVO ESQUEMAS CONTABLES "                               
451500          TO WLI-R01-MENSAJE.                                                 
451502     PERFORM 60613000-ESC-MENSAJES.                                           
451504                                                                              
451506 90005096-LEE-B22ESQCONT.                                                     
451508     PERFORM 90000022-B22ESQCONT-FINDN.                                       
451514     IF WS-STATUS-BASE = 0                                                    
451515        ADD 1                  TO WKS-I05-R09-NUMREG                          
451516        MOVE B22-LLAVE-BANCOS  TO WKS-I05-R02-LLAVE-BANCOS                    
451518        MOVE B22-NUM-PRODUCTO  TO WKS-I05-R02-NUM-PRODUCTO                    
451520        MOVE B22-NUM-INSTRUM   TO WKS-I05-R02-NUM-INSTRUM                     
451522        MOVE B22-MONEDA        TO WKS-I05-R02-MONEDA                          
451524        MOVE 0                 TO WKS-I05-R02-FILLER                          
451526        MOVE B22-ESQCON-DEFLT  TO WKS-I05-R02-ESQCON-DEFLT                    
451528        MOVE B22-SECTOR(01)    TO WKS-I05-R02-SECTOR(01)                      
451530        MOVE B22-SECTOR(02)    TO WKS-I05-R02-SECTOR(02)                      
451532        MOVE B22-SECTOR(03)    TO WKS-I05-R02-SECTOR(03)                      
451534        MOVE B22-SECTOR(04)    TO WKS-I05-R02-SECTOR(04)                      
451536        MOVE B22-SECTOR(05)    TO WKS-I05-R02-SECTOR(05)                      
451538        MOVE B22-SECTOR(06)    TO WKS-I05-R02-SECTOR(06)                      
451540        MOVE B22-SECTOR(07)    TO WKS-I05-R02-SECTOR(07)                      
451542        MOVE B22-SECTOR(08)    TO WKS-I05-R02-SECTOR(08)                      
451544        MOVE B22-SECTOR(09)    TO WKS-I05-R02-SECTOR(09)                      
451546        MOVE B22-SECTOR(10)    TO WKS-I05-R02-SECTOR(10)                      
451548        MOVE B22-SECTOR(11)    TO WKS-I05-R02-SECTOR(11)                      
451550        MOVE B22-SECTOR(12)    TO WKS-I05-R02-SECTOR(12)                      
451552        MOVE B22-SECTOR(13)    TO WKS-I05-R02-SECTOR(13)                      
451554        MOVE B22-SECTOR(14)    TO WKS-I05-R02-SECTOR(14)                      
451556        MOVE B22-SECTOR(15)    TO WKS-I05-R02-SECTOR(15)                      
451558        MOVE B22-SECTOR(16)    TO WKS-I05-R02-SECTOR(16)                      
451560        MOVE B22-SECTOR(17)    TO WKS-I05-R02-SECTOR(17)                      
451562        MOVE B22-SECTOR(18)    TO WKS-I05-R02-SECTOR(18)                      
451564        MOVE B22-SECTOR(19)    TO WKS-I05-R02-SECTOR(19)                      
451566        MOVE B22-SECTOR(20)    TO WKS-I05-R02-SECTOR(20)                      
451568        MOVE B22-ESQCONT(01)   TO WKS-I05-R02-ESQCONT(01)                     
451570        MOVE B22-ESQCONT(02)   TO WKS-I05-R02-ESQCONT(02)                     
451572        MOVE B22-ESQCONT(03)   TO WKS-I05-R02-ESQCONT(03)                     
451574        MOVE B22-ESQCONT(04)   TO WKS-I05-R02-ESQCONT(04)                     
451576        MOVE B22-ESQCONT(05)   TO WKS-I05-R02-ESQCONT(05)                     
451578        MOVE B22-ESQCONT(06)   TO WKS-I05-R02-ESQCONT(06)                     
451580        MOVE B22-ESQCONT(07)   TO WKS-I05-R02-ESQCONT(07)                     
451582        MOVE B22-ESQCONT(08)   TO WKS-I05-R02-ESQCONT(08)                     
451584        MOVE B22-ESQCONT(09)   TO WKS-I05-R02-ESQCONT(09)                     
451586        MOVE B22-ESQCONT(10)   TO WKS-I05-R02-ESQCONT(10)                     
451588        MOVE B22-ESQCONT(11)   TO WKS-I05-R02-ESQCONT(11)                     
451590        MOVE B22-ESQCONT(12)   TO WKS-I05-R02-ESQCONT(12)                     
451592        MOVE B22-ESQCONT(13)   TO WKS-I05-R02-ESQCONT(13)                     
451594        MOVE B22-ESQCONT(14)   TO WKS-I05-R02-ESQCONT(14)                     
451596        MOVE B22-ESQCONT(15)   TO WKS-I05-R02-ESQCONT(15)                     
451598        MOVE B22-ESQCONT(16)   TO WKS-I05-R02-ESQCONT(16)                     
451600        MOVE B22-ESQCONT(17)   TO WKS-I05-R02-ESQCONT(17)                     
451602        MOVE B22-ESQCONT(18)   TO WKS-I05-R02-ESQCONT(18)                     
451604        MOVE B22-ESQCONT(19)   TO WKS-I05-R02-ESQCONT(19)                     
451608        MOVE B22-ESQCONT(20)   TO WKS-I05-R02-ESQCONT(20)                     
451610        WRITE I05-FD-ARCHB22 FROM WKS-I05-R02-DATOS                           
451612     ELSE                                                                     
451614        MOVE 1 TO W77-EOF-B22.                                                
451700                                                                              
451702 00002000-MENSAJE-HOSTNAME.                                       776012      
451704*=================================                                776014      
451706   IF WS-DH-HOSTNAME-PBA                                          776016      
451708      MOVE "E" TO W77-TIPO-DISP                                   776018      
451710      STRING "HOSTNAME DE EJECUCION = " WS-DH-NOM-EQUIPO          776020      
451712          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                 776022      
451714      PERFORM 70000050-MENSAJE.                                   776024      
451716                                                                              
451800 50110100-INICIALIZA-SDOBLOQ.                                                 
451802*=================================                                            
451804   IF W77-SI-DESBLOQUEO = 1                                                   
451806      MOVE B03-NUM-CONTRATO    TO WS-MSG-N-12                                 
451808      MOVE B03-SDO-BLOQ-GCE    TO WS-MSG-IMPEDIT                              
451810      STRING "EL CONTRATO "     WS-MSG-N-12                                   
451812             " TIENE SDO BLOQ GCE " WS-MSG-IMPEDIT                            
451814             " SE INICIALIZA"                                                 
451816             DELIMITED BY SIZE INTO WLI-R01-MENSAJE                           
451818             PERFORM 60613000-ESC-MENSAJES                                    
451820      MOVE              ZEROS  TO B03-SDO-BLOQ-GCE                            
451822                                  W77-SI-DESBLOQUEO.                          
451900                                                                              
452000                                                                              
452100****INCLUDE DE RUTINAS COMUNES   *************************                    
452200                                                                              
452300 COPY "S500/INC/PRO/25MTP002".                                                
452350                                                                              
452400                                                                              
452500 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
452600                                                                              
452700**********************************************************                    
