100100$SET LIST STACK XREF LINEINFO MAP FREE ERRORLIMIT=150                         
100300$SET  S500L010 S100VERSIONES  S000LIBLJ S500GCE                               
100400$SET  BDB00R01  BDB00R04  BDB00R03                                            
100500$SET  BDB00R22  BDB00R23                                                      
100600$SET  BDB02R01  BDB02R02  BDB02R03                                            
100700$SET  BDB00AR01 BDB00AR03                                                     
100800$SET  BDB01AR02 BDB01AR03 BDB01AR04                                           
100900$SET  BDB02AR02 BDB02AR03 BDB02AR04                                           
101000$SET LIBMAPLI AVISOP020                                                       
101100$SET MAPLIACTLIB012 MAPLIACTLIB013                                            
101200$SET MAPLIACTLIB060 MAPLIACTLIB055 MAPLIACTLIB056 MAPLIACTLIB092              
101210$SET S500L040 S500L040R07 S500L040R08 S006LOCSUP                              
101212*** IBM-CHARITY INI                                                           
101214$SET S000LIBFEC  S000LIBFECR14 LIBL010BAJA LIBL010AVBA                        
101300 IDENTIFICATION DIVISION.                                                     
101400 PROGRAM-ID. P005.                                                            
101500 ENVIRONMENT DIVISION.                                                        
101600 CONFIGURATION SECTION.                                                       
101700 INPUT-OUTPUT SECTION.                                                        
101800 FILE-CONTROL.                                                                
101862*** IBM-CHARITY INI                                                           
101864  SELECT FILE-DEPTEM       ASSIGN TO DISK.                                    
101866  SELECT FILE-DEPURADOS    ASSIGN TO DISK.                                    
101868  SELECT FILE-CONSULTA     ASSIGN TO DISK.                                    
101870  SELECT FILE-VALDEP       ASSIGN TO DISK.                                    
101872  SELECT FILE-VALUSO       ASSIGN TO DISK.                                    
101874*** IBM-CHARITY FIN                                                           
101900 DATA DIVISION.                                                               
101920 FILE SECTION.                                                                
101930                                                                              
101962*** IBM-CHARITY INI                                                           
101964  FD  FILE-DEPTEM                                                             
101966      DATA RECORD IS   REG-DEPTEM,                                            
101968      VALUE OF                                                                
101970      PROTECTION  IS   PROTECTED.                                             
101972                                                                              
101974  01  REG-DEPTEM.                                                             
101976      03 REG-DEPTEM-NOM          PIC X(75).                                   
101978      03 REG-DEPTEM-FILLER       PIC X(45).                                   
101980                                                                              
101982  FD  FILE-DEPURADOS                                                          
101984      DATA RECORD IS   REG-DEPURADOS,                                         
101986      VALUE OF                                                                
101988      PROTECTION  IS   PROTECTED.                                             
101990  01  REG-DEPURADOS.                                                          
101992      03 REG-DEPURADOS-ID       PIC 9(002).                                   
101994      03 REG-DEPURADOS-DES      PIC X(100).                                   
101996      03 REG-DEPURADOS-FILLER   PIC X(018).                                   
101998                                                                              
102000  FD  FILE-CONSULTA                                                           
102002*      BLOCK   CONTAINS    180    RECORDS                                     
102004*      RECORD  CONTAINS    120    CHARACTERS.                                 
102006      VALUE OF DEPENDENTSPECS IS TRUE.                                        
102008  01  REG-CONSULTA.                                                           
102010      03 REG-CONSULTA-NOM        PIC X(75).                                   
102012      03 REG-FILLER              PIC X(45).                                   
102014                                                                              
102016  FD  FILE-VALDEP                                                             
102018       VALUE OF DEPENDENTSPECS IS TRUE.                                       
102020   01  REG-VALDEP               PIC X(600).                                   
102022                                                                              
102024  FD  FILE-VALUSO                                                             
102026      VALUE OF DEPENDENTSPECS IS TRUE.                                        
102028   01  REG-VALDEP               PIC X(600).                                   
102030*** IBM-CHARITY FIN                                                           
102032                                                                              
102100 DATA-BASE SECTION.                                                           
102200                                                                              
102300 DB  S500BD01CAPTACION.                                                       
102400 01  S500B00CTRLPASO.                                                         
102500 01  S500B02CONTROL.                                                          
102600 01  S500B91REINICIO.                                                         
102700                                                                              
102800 DB  S500BD02AUXILIAR.                                                        
102900 01  S500B01ACONTROL.                                                         
103000 01  S500B02ACONTROL.                                                         
103100 01  S500B91AUXREIN.                                                          
103102*** IBM-CHARITY INI                                                           
103104 DB S500BD04TARJETAS.                                                         
103106   01  S500B07PARCHIVOS.                                                      
103108   01  S500B08PCTRARRIBO.                                                     
103110   01  S500B10PDEPURA.                                                        
103112   01  S500B91PREINICIO.                                                      
103114*** IBM-CHARITY FIN                                                           
103200                                                                              
103300 WORKING-STORAGE SECTION.                                                     
103400********** PARA USO DE LIBRERIA MAPLI *****                                   
103500 77  W77-SI-MONITOR                    PIC 9(01).                             
103600 77  W77-ID-ACT01-MAPLI                PIC 9(02).                             
103700 77  W77-ID-INIGPO-MAPLI               PIC 9(02).                             
103800                                                                              
103900 01  WKS-ACTIVIDAD-MAPLI.                                                     
104000     02 FILLER         PIC X(21) VALUE "CALL A S500L010 PARA ".               
104100     02 WKS-Q-ACTIV    PIC X(14).                                             
104200                                                                              
104300                                                                              
104400************************************************************                  
104500 77  WS-IND-ERROR                      PIC S9(02).                            
104600 77  W77-NUM-COPIA-AUX                 PIC  9(02)  VALUE 0.                   
104700 77  W77-ERR-BASE                      PIC  9(02)  VALUE 0.                   
104800                                                                              
104900 01 WS-ERRORES-L010.                                                          
105000    03 FILLER               PIC X(40) VALUE                                   
105100             "ALGUNA  DE LAS COPIAS SE ESTA LEVANTANDO".                      
105200    03 FILLER               PIC X(40) VALUE                                   
105300             "ERROR EN BASE DE DATOS                  ".                      
105400    03 FILLER               PIC X(40) VALUE                                   
105500             "EL PROCESO EN CURSO NO ES LINEA         ".                      
105600    03 FILLER               PIC X(40) VALUE                                   
105700             "INDICADOR DE DISPERSION INVALIDO        ".                      
105800    03 FILLER               PIC X(40) VALUE                                   
105900             "INDICADOR DE ELIMINACION DE DISP INVALID".                      
106000    03 FILLER               PIC X(40) VALUE                                   
106100             "NO HAY DIALOGO FORANEO                  ".                      
106200    03 FILLER               PIC X(40) VALUE                                   
106300             "ALGUNA COPIA ESTA EN WAIT O FUERA DE MZC".                      
106400    03 FILLER               PIC X(40) VALUE                                   
106500             "AUN NO ESTOY EN PREBATCH                ".                      
106600    03 FILLER               PIC X(40) VALUE                                   
106700             "OCURRIO UN ERROR EN PREBATCH            ".                      
106800    03 FILLER               PIC X(40) VALUE                                   
106900             "HRA O FEC INVALIDA PARA CORRER PREBATCH ".                      
107000    03 FILLER               PIC X(40) VALUE                                   
107100             "BASE AUXILIAR NO INICIALIZADA           ".                      
107200    03 FILLER               PIC X(40) VALUE                                   
107300             "EL PROCESO EN CURSO NO ES PRELINEA      ".                      
107400    03 FILLER               PIC X(40) VALUE                                   
107500             "EL BATCH AUN NO HA TERMINADO            ".                      
107600    03 FILLER               PIC X(40) VALUE                                   
107700             "ERROR AL INICIALIZAR BASE ORIGINAL      ".                      
107800    03 FILLER               PIC X(40) VALUE                                   
107900             "FUNCION INVALIDA                        ".                      
108000    03 FILLER               PIC X(40) VALUE                                   
108100             "ESTOY EN RECUPERACION                   ".                      
108200    03 FILLER               PIC X(40) VALUE                                   
108300             "REGISTRO INEXISTENTE EN LOG             ".                      
108400    03 FILLER               PIC X(40) VALUE                                   
108500             "SOLO LA COPIA/1 PUEDE PEDIR REGS/PRELIN ".                      
108600    03 FILLER               PIC X(40) VALUE                                   
108700             "SE ESTA EFECTUANDO UNA RECUPERACION     ".                      
108800    03 FILLER               PIC X(40) VALUE                                   
108900             "YA NO HAY MAS REGS EN ARCH DE RETRANSM  ".                      
109000    03 FILLER               PIC X(40) VALUE                                   
109100             "PROBLEMAS THECALENDAR                   ".                      
109200    03 FILLER               PIC X(40) VALUE                                   
109300             "FECHA/HORARIO NO PERMITIDO P/PROC/BATCH ".                      
109400    03 FILLER               PIC X(40) VALUE                                   
109500             "BASE S500BD01CAPTACION NO INICIALIZADA  ".                      
109600    03 FILLER               PIC X(40) VALUE                                   
109700             "YA EXISTE LA LOG QUE SE INTENTA GENERAR ".                      
109800    03 FILLER               PIC X(40) VALUE                                   
109900             "INDICADOR INVALIDO DE TABLA DE RECHAZOS ".                      
110000    03 FILLER               PIC X(40) VALUE                                   
110100             "REGISTRO DE SALIDA INSUFICIENTE         ".                      
110200    03 FILLER               PIC X(40) VALUE                                   
110300             "CONTRATO OCUPADO POR OTRO QUE ENTRO A SO".                      
110400    03 FILLER               PIC X(40) VALUE                                   
110500             "DISPERSION S500P015 DE SDO PEND NO TERMI".                      
110600 01 WS-ERRORES-L010R REDEFINES WS-ERRORES-L010.                               
110700    03 WS-ERR-L010          PIC X(40) OCCURS 28 TIMES.                        
110800                                                                              
110900 01 WS-RECHAZO            PIC X(40).                                          
110901                                                                              
110902    01 WKS-NOMBRE-APLXDISP.                                                   
110903      03 WKS-NOMBRE-APL.                                                      
110904         05 WKS-NOMAPL-F1     PIC  X(01).                                     
110905         05 WKS-NOMAPL-SIS    PIC  9(03).                                     
110906         05 WKS-NOMAPL-F2     PIC  X(06).                                     
110907         05 WKS-NOMAPL-TP     PIC  X(04).                                     
110908         05 WKS-NOMAPL-F3     PIC  X(01).                                     
110909         05 WKS-NOMAPL-BUZ    PIC  X(08).                                     
110910         05 WKS-NOMAPL-F4     PIC  X(01).                                     
110911         05 WKS-NOMAPL-NOD    PIC  9(02).                                     
110912         05 WKS-NOMAPL-F5     PIC  X(01).                                     
110913         05 WKS-NOMAPL-FEC    PIC  9(08).                                     
110914         05 WKS-NOMAPL-F6     PIC  X(01).                                     
110915         05 WKS-NOMAPL-CLI    PIC  9(12).                                     
110916         05 WKS-NOMAPL-F7     PIC  X(01).                                     
110917         05 WKS-NOMAPL-SEC    PIC  9(04).                                     
110918      03 WKS-NOMAPL-F8       PIC X(22).                                       
110919                                                                              
110920 01 WKS-NOMBRE-APPXDISP-TOT.                                                  
110921   03 WKS-NOMBRE-APPXDISP.                                                    
110922      05 WKS-NOMAPP-F1     PIC  X(10) VALUE "APLXDISP/S".                     
110923      05 WKS-NOMAPP-SIS    PIC  9(03).                                        
110924      05 WKS-NOMAPP-F2     PIC  X(06) VALUE "/FILE/".                         
110925      05 WKS-NOMAPP-TP     PIC  X(03).                                        
110926      05 WKS-NOMAPP-F3     PIC  X(01) VALUE "/".                              
110927      05 WKS-NOMAPP-BUZ    PIC  X(08).                                        
110928      05 WKS-NOMAPP-F4     PIC  X(01) VALUE "/".                              
110929      05 WKS-NOMAPP-NOD    PIC  9(02).                                        
110930      05 WKS-NOMAPP-F5     PIC  X(01) VALUE "/".                              
110931      05 WKS-NOMAPP-FEC    PIC  9(08).                                        
110932      05 WKS-NOMAPP-F6     PIC  X(01) VALUE "/".                              
110933      05 WKS-NOMAPP-CLI    PIC  9(12).                                        
110934      05 WKS-NOMAPP-F7     PIC  X(01) VALUE "/".                              
110935      05 WKS-NOMAPP-SEC    PIC  9(04).                                        
110936   03 WKS-NOMAPP-PTO    PIC  X(01) VALUE ".".                                 
110937                                                                              
110938  01 WKS-NOMBRE-INTXDISP-TOT.                                                 
110939   03 WKS-NOMBRE-INTXDISP.                                                    
110940     05 WKS-NOMINTX-F1    PIC   X(10) VALUE "APLXDISP/S".                     
110941     05 WKS-NOMINTX-SIS   PIC   9(03).                                        
110942     05 WKS-NOMINTX-F2    PIC   X(06) VALUE "/FILE/".                         
110943     05 WKS-NOMINTX-TP    PIC   X(04).                                        
110944     05 WKS-NOMINTX-F3    PIC   X(01) VALUE "/".                              
110945     05 WKS-NOMINTX-BUZ   PIC   X(08).                                        
110946     05 WKS-NOMINTX-F4    PIC   X(01) VALUE "/".                              
110947     05 WKS-NOMINTX-NOD   PIC   9(02).                                        
110948     05 WKS-NOMINTX-F5    PIC   X(01) VALUE "/".                              
110949     05 WKS-NOMINTX-FEC   PIC   9(08).                                        
110950     05 WKS-NOMINTX-F6    PIC   X(01) VALUE "/".                              
110951     05 WKS-NOMINTX-CLI   PIC   9(12).                                        
110952     05 WKS-NOMINTX-F7    PIC   X(01) VALUE "/".                              
110953     05 WKS-NOMINTX-SEC   PIC   9(04).                                        
110954   03 WKS-NOMINTX-PTO   PIC   X(01) VALUE ".".                                
110955 01 WKS-ELIM-APLXDISP     PIC   9(01).                                        
110956    88 WKS-88ELIM-APLXDISP  VALUE 1.                                          
110957 01 WKS-HAY-ARCHXDISP     PIC  9(01).                                         
111000                                                                              
111100 COPY "S500/INC/WOR/25MTP002".                                                
111200 COPY "S500/INC/L010/24MTP002" FROM 100 TO 99999.                             
111250                                                                              
111251 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
111252                                                                              
111253*** IBM-CHARITY INI                                                           
111254***==== NOMBRE DE ARCHIVOS ============================                       
111255  01 WS-NOM-DEPTEM.                                                           
111256      03 FILLER                          PIC X(17) VALUE                      
111257          "S500/FILE/DEPTEM/".                                                
111258      03 WKS-FEC-DEPTEM                  PIC 9(08).                           
111259      03 FILLER                          PIC X VALUE ".".                     
111260                                                                              
111261  01 WS-NOM-DEPURADOS.                                                        
111262      03 FILLER                          PIC X(30) VALUE                      
111263          "(S500)S500/FILE/INTS/50004S01/".                                   
111264      03 WKS-NOD-DEPFIN                  PIC 9(02) VALUE ZEROS.               
111265      03 FILLER                          PIC X(01) VALUE "/".                 
111266      03 WKS-FEC-DEPFIN                  PIC 9(08).                           
111267      03 FILLER                          PIC X(14) VALUE                      
111268          "/DEPURADOR/01.".                                                   
111269                                                                              
111270  01 WS-NOM-CONSULTA.                                                         
111271      03  WS-NOM-CONSULTA-N.                                                  
111272        05 FILLER                        PIC X(14) VALUE                      
111273          "S500/FILE/PDIR".                                                   
111274        05 WKS-FEC-CONSULTA              PIC 9(08).                           
111275        05 FILLER                        PIC X(01) VALUE "/".                 
111276        05 WKS-SEC-CONSULTA              PIC 9(06).                           
111277      03 FILLER                          PIC X(01) VALUE ".".                 
111278                                                                              
111279*** Registros de B10Depurados                                                 
111280   01  WS10-NOMBRE-ARCHIVO.                                                   
111281      03  WS10-NOMBRE-FS      PIC X(01) VALUE  "S".                           
111282      03  WS10-NOMBRE-SIS     PIC 9(03).                                      
111283      03  WS10-NOMBRE-F1      PIC X(11) VALUE                                 
111284          "/FILE/INTE/".                                                      
111285      03  WS10-NOMBRE-BUZON   PIC X(08).                                      
111286      03  WS10-NOMBRE-F2      PIC X(01) VALUE "/".                            
111287      03  WS10-NOMBRE-NODO    PIC 9(02).                                      
111288      03  WS10-NOMBRE-F3      PIC X(10) VALUE                                 
111289           "/########/".                                                      
111290      03  WS10-NOMBRE-CTE     PIC 9(12).                                      
111291      03  WS10-NOMBRE-F4      PIC X(01) VALUE "/".                            
111292      03  WS10-NOMBRE-SEC     PIC 9(04).                                      
111293                                                                              
111294  01  WS10-NOMBRE-ARCAPP.                                                     
111295      03  WS10-NOMBREAPP-FS      PIC X(01) VALUE  "S".                        
111296      03  WS10-NOMBREAPP-SIS     PIC 9(03).                                   
111297      03  WS10-NOMBREAPP-F1      PIC X(10) VALUE                              
111298          "/FILE/APP/".                                                       
111299      03  WS10-NOMBREAPP-BUZON   PIC X(08).                                   
111300      03  WS10-NOMBREAPP-F2      PIC X(01) VALUE "/".                         
111301      03  WS10-NOMBREAPP-NODO    PIC 9(02).                                   
111302      03  WS10-NOMBREAPP-F3      PIC X(10) VALUE                              
111303          "/########/".                                                       
111304      03  WS10-NOMBREAPP-CTE     PIC 9(12).                                   
111305      03  WS10-NOMBREAPP-F4      PIC X(01) VALUE "/".                         
111306      03  WS10-NOMBREAPP-SEC     PIC 9(04).                                   
111307                                                                              
111308  01  WS10-NOMBRE-ARCERR.                                                     
111309      03  WS10-NOMBREERR-FS      PIC X(01) VALUE  "S".                        
111310      03  WS10-NOMBREERR-SIS     PIC 9(03).                                   
111311      03  WS10-NOMBREERR-F1      PIC X(10) VALUE                              
111312            "/FILE/ERR/".                                                     
111313      03  WS10-NOMBREERR-BUZON   PIC X(08).                                   
111314      03  WS10-NOMBREERR-F2      PIC X(01) VALUE "/".                         
111315      03  WS10-NOMBREERR-NODO    PIC 9(02).                                   
111316      03  WS10-NOMBREERR-F3      PIC X(10) VALUE                              
111317                "/########/".                                                 
111318      03  WS10-NOMBREERR-CTE     PIC 9(12).                                   
111319      03  WS10-NOMBREERR-F4      PIC X(01) VALUE "/".                         
111320      03  WS10-NOMBREERR-SEC     PIC 9(04).                                   
111321                                                                              
111322  01  WS10-NOMBRE-ARSAL.                                                      
111323      03  WS10-NOMBRESAL-FS      PIC X(01) VALUE  "S".                        
111324      03  WS10-NOMBRESAL-SIS     PIC 9(03).                                   
111325      03  WS10-NOMBRESAL-F1      PIC X(11) VALUE                              
111326          "/FILE/INTS/".                                                      
111327      03  WS10-NOMBRESAL-BUZON   PIC X(08).                                   
111328      03  WS10-NOMBRESAL-F2      PIC X(01) VALUE "/".                         
111329      03  WS10-NOMBRESAL-NODO    PIC 9(02).                                   
111330      03  WS10-NOMBRESAL-F3      PIC X(10) VALUE                              
111331          "/########/".                                                       
111332      03  WS10-NOMBRESAL-CTE     PIC 9(12).                                   
111333      03  WS10-NOMBRESAL-F4      PIC X(01) VALUE "/".                         
111334      03  WS10-NOMBRESAL-SEC     PIC 9(04).                                   
111335***==== VARIABLES ============================                                
111336 01 WS-VARIABLES-GENERALES.                                                   
111337      05 WS-GEN-NUMSECPDIR               PIC 9(06).                           
111338      05 WS-GEN-NOM                      PIC X(75).                           
111339      05 WS-GEN-NOM-AUX                  PIC X(75).                           
111340      05 WS-GEN-SEC                      PIC 9(04).                           
111341      05 WS-GEN-VAL08                    PIC 9(02).                           
111342         88 WS88-GEN-VAL08               VALUE 02.                            
111343      05 WS-GEN-DEP                      PIC 9(02).                           
111344         88 WS88-GEN-DEP                 VALUE 01.                            
111345      05 WS-GEN-IDEDEP                   PIC 9(02).                           
111346      05 WS-GEN-SISTEMAB10               PIC 9(12).                           
111347      05 WS-GEN-NODOB10                  PIC 9(02).                           
111348      05 WS-GEN-TIPOB10                  PIC 9(02).                           
111349      05 WS-GEN-DIAS-RESP                PIC 9(03).                           
111350      05 WS-GEN-FECMOD                   PIC 9(08).                           
111351      05 WS-GEN-FECULT                   PIC 9(08).                           
111352      05 WS-REG-DEPURABLE                PIC 9.                               
111353         88 WS88-REG-NODEPURABLE         VALUE 0.                             
111354         88 WS88-REG-DEPURABLE           VALUE 1.                             
111355         88 WS88-REG-AELIMINAR           VALUE 2.                             
111356      05 WS-FEC-PROYECTADA               PIC 9(08).                           
111357      05 WS-POS-FEC                      PIC 9(03).                           
111358      05 WS-POS-SEC                      PIC 9(03).                           
111359      05 WS-POS-FIN                      PIC 9(03).                           
111360      05 WS-MAS-INFO                     PIC 9(01).                           
111361      05 WS-TER-NOM                      PIC 9(01).                           
111362      05 W77-INX                         PIC 9(03).                           
111363      05 W77-INX2                        PIC 9(03).                           
111364      05 W77-INFEC                       PIC 9(02).                           
111365      05 W77-INSEC                       PIC 9(02).                           
111366      05 WS-CNT-FEC                      PIC 9(02).                           
111367      05 WS-CNT-SEC                      PIC 9(02).                           
111368      05 WS-CNTCAR-FEC                   PIC 9(02).                           
111369      05 WS-CNTCAR-SEC                   PIC 9(02).                           
111370      05 WS-CNT-RES                      PIC 9(02).                           
111371      05 WS-HAYFILE-CONS                 PIC 9.                               
111372         88 WS88-HAYFILE-CONS            VALUE 1.                             
111373      05 WS-DEPURA-REGOK                 PIC 9.                               
111374      05 WS-ABORT-DEP                    PIC 9.                               
111375      05 WSI-DD-CONTN                    PIC 9(04).                           
111376                                                                              
111377  01  WS10-VALIDAB08                    PIC 9(02) VALUE  02.                  
111378  01  WS10-DEPUR-ACT                    PIC 9(02) VALUE  01.                  
111379  01  WS10-IDE-DEPURACION               PIC 9(02) VALUE  03.                  
111380  01  WS10-RESTO-CAMPOS.                                                      
111381      03  WS10-NOMBRE-ARC               PIC X(75).                            
111382      03  WS10-TIPO                     PIC 9(01).                            
111383      03  WS10-DIAS-RESP                PIC 9(02).                            
111384  01  WS-NOTFOUND-B07                   PIC 9(01).                            
111385  01  WS-CNTCAR-COP                     PIC 9(02).                            
111386  01  WS-CNT-COP                        PIC 9(02).                            
111387   01 WS-TIPO-PROCESO                    PIC 9(02).                           
111388   01 WS-NOEXISTE-REGCTRL                PIC 9(01).                           
111389      88 WS88-NOEXISTE-REGCTRL           VALUE 1.                             
111390      88 WS88-EXISTE-REGCTRL             VALUE 0.                             
111391   01 WS-EXISTE-REGTDEP                  PIC 9(01).                           
111392      88 WS88-EXISTE-REGTDEP             VALUE 1.                             
111393   01 WS-FEC-PROCESO                     PIC 9(08).                           
111394   01 WS-FEC-LIM-DEP                     PIC 9(08).                           
111395   01 WS-IND-FILED                       PIC 9.                               
111396   01 WS-ERR-VAL-NOM                     PIC 9.                               
111397   01 WS-CONT-PALABRA                    PIC 9.                               
111398   01 WS-CAMPO-VAL-NOM.                                                       
111399      02 WS-CAR-VN     OCCURS 75  TIMES  PIC  X.                              
111400         88 WS88-CAR-FEC          VALUE  "#".                                 
111401         88 WS88-CAR-SEC          VALUE  "?".                                 
111402         88 WS88-CAR-ESP          VALUE  " ".                                 
111403   01 WS-CAMPO-VAL-NOM-RES.                                                   
111404      02 WS-CAR-VN-RES  OCCURS 75  TIMES  PIC X.                              
111405        88 WS88-CAR-ESP-RES       VALUE  " ".                                 
111406                                                                              
111407   01 WS-CAMPO-VALUSO-NOM.                                                    
111408      02 WS-CAR-VALUSO     OCCURS 75  TIMES  PIC  X.                          
111409         88 WS88-CARUSO-ESP          VALUE  " ".                              
111410                                                                              
111411   01 WS-NOMBRE-VALIDADO.                                                     
111412      02 WS-NOMBRE-VAL    OCCURS 75  TIMES  PIC  X.                           
111413         88 WS88-NOMVAL-ESP          VALUE  " ".                              
111414         88 WS88-NOMVAL-CARINV       VALUE  "a","b","c","d","e",              
111415                                "f","g","h","i","j","k","l","m",              
111416                                "n","ù","o","p","q","r","s","t",              
111417                                "u","v","w","x","y","z",                      
111418           "`", "~", "!", "@", "$",    , "^", "&", "*", "+", "=",             
111419           "{", "}", "[", "]", "|", "\", ":", ";", , "'", "<",                
111420           ">", ",","¡","¿".                                                  
111421   01 WS-CAMPO-VAL-FECHA.                                                     
111422     02 WS-CAR-FEC    OCCURS 08   TIMES    PIC X.                             
111423                                                                              
111424   01  WS-CAMPO-FECHAB10   REDEFINES                                          
111425       WS-CAMPO-VAL-FECHA                  PIC 9(08).                         
111426                                                                              
111427   01 WS-CAMPO-VAL-SEC.                                                       
111428      02 WS-CAR-SEC OCCURS 04      TIMES PIC X.                               
111429                                                                              
111430   01  WS-CAMPO-SECB10  REDEFINES                                             
111431       WS-CAMPO-VAL-SEC                    PIC 9(04).                         
111432                                                                              
111433 01 WKS-WFL-NOM-INICIA.                                                       
111434    03 FILLER                            PIC X(49) VALUE                      
111435      "BEGIN JOB LOTE; JOBSUMMARY=UNCONDITIONAL;START ".                      
111436    03 WKS-WFL-NOM-PROCESO               PIC X(28).                           
111437*      "CHAR/WFL/DEPURACION/20MTP001".                                        
111438    03 FILLER                            PIC X(15) VALUE                      
111439       " ON CAPTACION (".                                                     
111440    03 WKS-WFL-QUOTES-INICIAL            PIC X(01).                           
111441    03 WKS-WFL-PARAMETRO1                PIC X(03).                           
111442    03 FILLER                            PIC X(01) VALUE SPACE.               
111443    03 WKS-WFL-PARAMETRO2                PIC 9(06).                           
111444    03 FILLER                            PIC X(01) VALUE SPACE.               
111445    03 WKS-WFL-PARAMETRO3                PIC 9(08).                           
111446    03 FILLER                            PIC X(01) VALUE SPACE.               
111447    03 WKS-WFL-PARAMETRO4                PIC X(75).                           
111448    03 WKS-WFL-QUOTES-FINAL              PIC X(01).                           
111449    03 FILLER                            PIC X(03) VALUE "); ".               
111450    03 FILLER                            PIC X(08) VALUE                      
111451       "END JOB ".                                                            
111452 01 WS-SEC-DIR                           PIC 9(06).                           
111453 01 WS-EXISTE-B08                        PIC 9.                               
111454 01 WS-TEMPORI                           PIC 9.                               
111455 01 WS-FIN-READ                          PIC 9.                               
111456    88 WS88-FIN-READ                     VALUE 1.                             
111457 01 WS-B08P-ESTATUS                      PIC X.                               
111458   88 WS88-B08-EST-DEP                   VALUE "D","T","U","A".               
111459                                                                              
111460***== PROYECTA FECHAS ========================                                
111461 77 WKS-LIB-FEC-IN-2K                 PIC  9(08) VALUE ZEROS.                 
111462 77 WKS-LIB-FEC-OUT-2K                PIC  9(08) VALUE ZEROS.                 
111463 77 WKS-LIB-CVE-SEM                   PIC S9(11) BINARY.                      
111464 77 WKS-LIB-DIA-FEST                  PIC S9(11) BINARY.                      
111465 77 WKS-LIB-NDIAS                     PIC S9(11) BINARY.                      
111466                                                                              
111467***== LIGA LIBRERIAS  ========================                                
111468  01 WKS-LIBRERIA                     PIC  X(12) VALUE SPACES.                
111469  01 WKS-TITULO                       PIC  X(72) VALUE SPACES.                
111470  77 WKS-RESULTADO                    PIC S9(11) BINARY.                      
111471*  77 W77-S000-MY-ID                   PIC  X(12).                            
111472*  77 W77-S000-MY-VERSION              PIC  X(08).                            
111473                                                                              
111474  01 WS-IDE-ARCH-DEPURADOS            PIC 9(01).                              
111475  01 WS-ERROR-B02                     PIC 9(01).                              
111476     88 WS88-ERROR-B02                VALUE  1.                               
111477  01 WS-HAY-ARCHIVO                   PIC 9(01).                              
111478*  01 WS-STATUS-BASE-ANT               PIC 9(02).                             
111479  01 WS-COD-ERROR                     PIC 9(03).                              
111480                                                                              
111481*  01 WS-STATUS-BASE                   PIC 9(02).                             
111482*     88 WS-DB-NOTERROR                VALUE 00.                              
111483*     88 WS-DB-ERROR                   VALUE 1 THRU 99.                       
111484*     88 WS-DB-NOTFOUND                VALUE 01.                              
111485*     88 WS-DB-DUPLICATES              VALUE 02.                              
111486*     88 WS-DB-DEADLOCK                VALUE 03.                              
111487*     88 WS-DB-DATAERROR               VALUE 04.                              
111488*     88 WS-DB-NOTLOCKED               VALUE 05.                              
111489*     88 WS-DB-KEYCHANGED              VALUE 06.                              
111490*     88 WS-DB-SYSTEMERROR             VALUE 07.                              
111491*     88 WS-DB-READONLY                VALUE 08.                              
111492*     88 WS-DB-IOERROR                 VALUE 09.                              
111493*     88 WS-DB-LIMITERROR              VALUE 10.                              
111494*     88 WS-DB-OPENERROR               VALUE 11.                              
111495*     88 WS-DB-CLOSEERROR              VALUE 12.                              
111496*     88 WS-DB-NORECORD                VALUE 13.                              
111497*     88 WS-DB-INUSE                   VALUE 14.                              
111498*     88 WS-DB-AUDITERROR              VALUE 15.                              
111499*     88 WS-DB-ABORT                   VALUE 16.                              
111500*     88 WS-DB-SECURITYERROR           VALUE 17.                              
111501*     88 WS-DB-VERSIONERROR            VALUE 18.                              
111502*     88 WS-DB-FATALERROR              VALUE 19.                              
111503*     88 WS-DB-INTEGRITYERROR          VALUE 20.                              
111504*     88 WS-DB-PARAMETERERROR          VALUE 21.                              
111505****************************                                                  
111506*** Errores                                                                   
111507****************************                                                  
111508  01 WS-TABLA-ERRORES.                                                        
111509    03 ERROR-0001.                                                            
111510       05 ERROR-0001-01                PIC X(21) VALUE                        
111511          "ERROR EN BD CODIGO : ".                                            
111512       05 ERROR-0001-02                PIC 9(02).                             
111513       05 ERROR-0001-FI                PIC X(77) VALUE SPACES.                
111514                                                                              
111515    03 ERROR-0002.                                                            
111516       05 ERROR-0002-01                PIC X(36) VALUE                        
111517       "NO ENCONTRE REGISTRO DE CONTROL B02.".                                
111518       05 ERROR-0002-FI                PIC X(64) VALUE SPACES.                
111519                                                                              
111520    03 ERROR-0003.                                                            
111521       05 ERROR-0003-01                PIC X(49) VALUE                        
111522       "NO ENCONTRE PRIMER REGISTRO PARA DEPURACION B10.".                    
111523       05 ERROR-0003-FI                PIC X(51) VALUE SPACES.                
111524                                                                              
111525    03 ERROR-0004.                                                            
111526       05 ERROR-0004-01                PIC X(25) VALUE                        
111527       "REG DE ARCH NO VALIDO:   ".                                           
111528       05 ERROR-0004-02                PIC X(75) VALUE SPACES.                
111529                                                                              
111530    03 ERROR-0005.                                                            
111531       05 ERROR-0005-01                PIC X(25) VALUE                        
111532       "ARCHIVO DIR NO CREADO:   ".                                           
111533       05 ERROR-0005-02                PIC X(75) VALUE SPACES.                
111534                                                                              
111535    03 ERROR-0006.                                                            
111536       05 ERROR-0006-01                PIC X(23) VALUE                        
111537       "ERROR EN FIND NEXT B10.".                                             
111538       05 ERROR-0006-02                PIC X(77) VALUE SPACES.                
111539                                                                              
111540    03 ERROR-0007.                                                            
111541       05 ERROR-0007-01                PIC X(25) VALUE                        
111542       "NO PUDE ACTUALIZAR B10:  ".                                           
111543       05 ERROR-0007-02                PIC X(75) VALUE SPACES.                
111544                                                                              
111545    03 ERROR-0008.                                                            
111546       05 ERROR-0008-01                PIC X(40) VALUE                        
111547       "NO ENCONTRE 1ER REGISTRO DE CONTROL B07.".                            
111548       05 ERROR-0008-FI                PIC X(60) VALUE SPACES.                
111549                                                                              
111550    03 ERROR-0009.                                                            
111551       05 ERROR-0009-01                PIC X(23) VALUE                        
111552       "ERROR EN FIND NEXT B07.".                                             
111553       05 ERROR-0009-FI                PIC X(77) VALUE SPACES.                
111554                                                                              
111555    03 ERROR-0010.                                                            
111556       05 ERROR-0010-01                PIC X(25) VALUE                        
111557       "REGISTRO ELIMINADO   :   ".                                           
111558       05 ERROR-0010-02                PIC X(75) VALUE SPACES.                
111559                                                                              
111560  01 WS-TABLA-ERRORES-R REDEFINES WS-TABLA-ERRORES.                           
111561     03 WS-TBL-ERRORES OCCURS 100 TIMES.                                      
111562        05 WS-TBL-ERROR-CON                PIC X(100).                        
111563                                                                              
111564* VARIABLES PARA EL ENVIO DE ARCHIVOS AL S022                                 
111565  01 WS-ARCH-SDOS                PIC X(73) VALUE SPACES.                      
111566  77 WS77-INTELAR-RESULT         PIC S9(11) BINARY.                           
111567* VARIABLE DEPURA CON =                                                       
111568 01 WS-DEPURO-INTELAR                      PIC 9(01).                         
111570    88 WS88-DEPURO-INTELAR                  VALUE  1.                         
111575 01 WS10P-SEC-DIR                PIC 9(06).                                   
111580* VARIABLES PARA ALMACENAR NOMBRE DE ARCHIVO  A DEPURAR                       
111582  01 IND-FILE      PIC 9(05).                                                 
111583  01 WS-GEN-NOM2   PIC X(65).                                                 
111584  01 WS-FLGPDIR    PIC 9(01).                                                 
111585  01 WFL-DEPURA.                                                              
111600    02 FILLER       PIC X(20) VALUE "BEGIN JOB DEPURA.   "   .                
111610    02 FILLER       PIC X(01) VALUE @0D@.                                     
111620    02 LINEA.                                                                 
111630       03 SENTENCIA OCCURS 800 TIMES.                                         
111650          05 FILENAM   PIC X(75).                                             
111660    02 FILLER       PIC X(20) VALUE "END JOB.".                               
111670*                                                                             
111680**************************************************************                
111685 PROCEDURE DIVISION.                                                          
111690 1000-INICIO SECTION.                                                         
111700 1010-INICIO.                                                                 
111800******************************************************                        
111805***  MANEJO DE LA LIB LJ     -ENE-08-                                         
111810     MOVE 2            TO  W77-USO-LIBLJ                                      
111815     MOVE 051010       TO  WS-0101-CODI-MSG                                   
111820     MOVE 2            TO  WS-0101-TIPO-MSG                                   
111830     MOVE "P005"       TO  WS-0101-PASO-MSG                                   
111835      MOVE "25MTP004"   TO  WS-0101-MTP-MSG                                   
111840                           W77-S000-MY-VERSION                                
111842     MOVE "S500P005"   TO  W77-S000-MY-ID.                                    
111845***                                                                           
111850                                                                              
111900     IF ATTRIBUTE TASKVALUE OF MYSELF = 1                                     
112000        MOVE "PREBATCH"  TO WKS-Q-ACTIV                                       
112100        MOVE 1           TO W77-ID-NUM-COPIA-MAPLI                            
112200        MOVE 1           TO W77-SI-MONITOR                                    
112300        MOVE 6           TO W77-ID-INIGPO-MAPLI                               
112400     ELSE                                                                     
112500     IF ATTRIBUTE TASKVALUE OF MYSELF = 2                                     
112600        MOVE "PRELINEA"  TO WKS-Q-ACTIV                                       
112700        MOVE 2           TO W77-ID-NUM-COPIA-MAPLI                            
112800        MOVE 1           TO W77-SI-MONITOR                                    
112900        MOVE 0           TO W77-ID-INIGPO-MAPLI                               
113000     ELSE                                                                     
113100     IF ATTRIBUTE TASKVALUE OF MYSELF = 3                                     
113200        MOVE "FINBATCH"  TO WKS-Q-ACTIV                                       
113300        MOVE 3           TO W77-ID-NUM-COPIA-MAPLI                            
113400        MOVE 1           TO W77-SI-MONITOR                                    
113500        MOVE 0           TO W77-ID-INIGPO-MAPLI                               
113600     ELSE                                                                     
113700     IF ATTRIBUTE TASKVALUE OF MYSELF = 5                                     
113800        MOVE "REST24HRS" TO WKS-Q-ACTIV                                       
113900        MOVE 5           TO W77-ID-NUM-COPIA-MAPLI                            
114000        MOVE 1           TO W77-SI-MONITOR                                    
114100        MOVE 0           TO W77-ID-INIGPO-MAPLI                               
114102*INI C DYR                                                                    
114104     ELSE                                                                     
114106     IF ATTRIBUTE TASKVALUE OF MYSELF = 6                                     
114108        MOVE "CARGACATP020" TO WKS-Q-ACTIV                                    
114110        MOVE 6              TO W77-ID-NUM-COPIA-MAPLI                         
114112        MOVE 1              TO W77-SI-MONITOR                                 
114114        MOVE 0              TO W77-ID-INIGPO-MAPLI                            
114116     ELSE                                                                     
114118     IF ATTRIBUTE TASKVALUE OF MYSELF = 7                                     
114120        MOVE "INILINEAP020" TO WKS-Q-ACTIV                                    
114122        MOVE 7              TO W77-ID-NUM-COPIA-MAPLI                         
114124        MOVE 1              TO W77-SI-MONITOR                                 
114126        MOVE 0              TO W77-ID-INIGPO-MAPLI                            
114128     ELSE                                                                     
114130     IF ATTRIBUTE TASKVALUE OF MYSELF = 8                                     
114132        MOVE "INIBATCHP020" TO WKS-Q-ACTIV                                    
114134        MOVE 8              TO W77-ID-NUM-COPIA-MAPLI                         
114136        MOVE 1              TO W77-SI-MONITOR                                 
114138        MOVE 0              TO W77-ID-INIGPO-MAPLI.                           
114140*FIN C DYR                                                                    
114200                                                                              
114300******************************************************                        
114400***  OBTIENE TITULO DE CTLVERS  *****                                         
114500     PERFORM 10000100-VERSIONES.                                              
114600     IF W77-SI-MONITOR = 1                                                    
114700        PERFORM 1000038-S038L035                                              
114800        MOVE 1                   TO W77-ID-TPODSP-INFO-MAPLI                  
114900        MOVE W77-ID-INIGPO-MAPLI TO W77-ID-ESINI-GRUPO-MAPLI                  
115000        MOVE 06                  TO W77-ID-NUM-GRUPO-MAPLI                    
115100        MOVE "BATCH DIARIO"      TO W77-ID-NOMB-LIB                           
115200        PERFORM 70000950-INI-PGM-MAPLI                                        
115300        MOVE 1                   TO W77-ID-NUMREG-PROC                        
115400        MOVE 01                  TO W77-ID-ACTXX-MAPLI                        
115500                                    W77-ID-ACT01-MAPLI                        
115600        MOVE WKS-ACTIVIDAD-MAPLI TO W77-ID-NOMB-LIB                           
115700        MOVE "PROCESO UNICO "    TO W77-ID-TXTA-LIB                           
115800        PERFORM 70000910-INIACT-MAPLI                                         
115900                                                                              
116000        MOVE ZEROS     TO WKS-TB-NUMACT-LIBS                                  
116100                                                                              
116200        MOVE 20        TO WKS-NUMACT-LIB(12)                                  
116300        MOVE 21        TO WKS-NUMACT-LIB(13)                                  
116400        MOVE 22        TO WKS-NUMACT-LIB(60)                                  
116500        MOVE 23        TO WKS-NUMACT-LIB(55)                                  
116600        MOVE 23        TO WKS-NUMACT-LIB(56).                                 
116700        MOVE 24        TO WKS-NUMACT-LIB(92).                                 
116800                                                                              
116900********************************************************                      
117000                                                                              
117300                                                                              
117500                                                                              
117600***  CHECA  VERSION   *****                                                   
117700     PERFORM 20000100-CHECAME-VERSION.                                        
117800     IF S000-CTR-CVEERROR < 0                                                 
118100        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
118200        PERFORM 70000050-MENSAJE                                              
118300        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
118320***  OBTIENE TITULO DE LIB LOCSUP     *****                                   
118340     PERFORM 10000006-LOCSUP.                                                 
118400                                                                              
118500***  OBTIENE TITULO DE LIB S500L010CTRL     *****                             
118600     PERFORM 10000500-L010.                                                   
118620***  OBTIENE TITULO DE LIB L040       *****                                   
118640     PERFORM 10000500-L040LIGAS.                                              
118700*                                                                             
118800     IF ATTRIBUTE TASKVALUE OF MYSELF = 1                                     
118900        PERFORM 2000-PREBATCH                                                 
119000     ELSE                                                                     
119100     IF ATTRIBUTE TASKVALUE OF MYSELF = 2                                     
119200        PERFORM 3000-PRELINEA                                                 
119300     ELSE                                                                     
119400     IF ATTRIBUTE TASKVALUE OF MYSELF = 3                                     
119500        PERFORM 4000-FINBATCH                                                 
119600     ELSE                                                                     
119700     IF ATTRIBUTE TASKVALUE OF MYSELF = 4                                     
119800        PERFORM 5000-GENERALOG                                                
119805*INI C DYR                                                                    
119810     ELSE                                                                     
119815     IF ATTRIBUTE TASKVALUE OF MYSELF = 6                                     
119820        PERFORM 7000-CARGACATP020                                             
119825     ELSE                                                                     
119830     IF ATTRIBUTE TASKVALUE OF MYSELF = 7                                     
119835        PERFORM 3550-INI-LINEA-P020                                           
119840     ELSE                                                                     
119845     IF ATTRIBUTE TASKVALUE OF MYSELF = 8                                     
119850         PERFORM 6000-INIBATCHP020                                            
119855*FIN C DYR                                                                    
119900     ELSE                                                                     
120000     IF ATTRIBUTE TASKVALUE OF MYSELF = 5                                     
120100        PERFORM 5500-REST24HRS                                                
120200     ELSE                                                                     
120300     IF ATTRIBUTE TASKVALUE OF MYSELF = 10                                    
120400        PERFORM 10000-RECUP-BASE-ORIGINAL                                     
120500     ELSE                                                                     
120600     IF ATTRIBUTE TASKVALUE OF MYSELF = 11                                    
120700        PERFORM 11000-RECUP-BASE-AUXILIAR                                     
120800     ELSE                                                                     
120820     IF ATTRIBUTE TASKVALUE OF MYSELF = 20                                    
120840        PERFORM 20000-CREA-CTRL-ARRIBOS                                       
120860     ELSE                                                                     
120865     IF ATTRIBUTE TASKVALUE OF MYSELF = 21                                    
120870        PERFORM 21000-AVISO-FIN-DIA                                           
120875     ELSE                                                                     
120880     IF ATTRIBUTE TASKVALUE OF MYSELF = 22                                    
120885        PERFORM 22000-AVISO-INI-DIA                                           
120890     ELSE                                                                     
120892*** IBM-CHARITY INI                                                           
120894     IF ATTRIBUTE TASKVALUE OF MYSELF = 23                                    
120896        PERFORM 22000-DEPURACION-ARCHIVOS                                     
120898     ELSE                                                                     
120899     IF ATTRIBUTE TASKVALUE OF MYSELF = 24                                    
120900         MOVE 1 TO WS-I-AVISO-OPC                                             
120901*        PROCESO  "BAJA LINEA"                                                
120902         PERFORM 5000-BAJA-LINEA                                              
120922     ELSE                                                                     
120923     IF ATTRIBUTE TASKVALUE OF MYSELF = 25                                    
120924         MOVE 2 TO WS-I-AVISO-OPC                                             
120925*        PROCESO "INSTALA L020"                                               
120926         PERFORM 5000-BAJA-LINEA                                              
120927    ELSE                                                                      
120928    IF ATTRIBUTE TASKVALUE OF MYSELF = 26                                     
120929        MOVE 3 TO WS-I-AVISO-OPC                                              
120930*       PROCESO "SUBE LINEA"                                                  
120931        PERFORM 5000-BAJA-LINEA                                               
120932    ELSE                                                                      
120942     IF ATTRIBUTE TASKVALUE OF MYSELF = 50                                    
120962        PERFORM 5000-BAJA-ESCALONADA                                          
121002     ELSE                                                                     
121022*** IBM-CHARITY FIN                                                           
121042        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-MSG-N-04                     
121200        STRING "VALUE ERRONEO PARA EJECUTAR P005 ", WS-MSG-N-04               
121300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
121400        PERFORM 70000050-MENSAJE                                              
121500        SET  MYSELF(STATUS) TO -1.                                            
121600                                                                              
121700                                                                              
121800******************************************************                        
121900     IF W77-SI-MONITOR = 1                                                    
122000        MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI                         
122100        MOVE " "                TO W77-ID-TXTA-LIB                            
122200        PERFORM 70000950-ACT-REGPROC                                          
122300                                                                              
122400        MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI                         
122500        PERFORM 70000910-FIN-ACTI-MAPLI                                       
122600                                                                              
122700        PERFORM 70000950-FIN-PGM-MAPLI.                                       
122800******************************************************                        
122900     STOP RUN.                                                                
123000*****************************************************************             
123100 2000-PREBATCH.                                                               
123200     PERFORM 20000500-PREBATCH-CALL                                           
123300     IF WS-L010-RESULT > 0                                                    
123400        MOVE "ERROR EN LLAMADO PREBATCH" TO                                   
123500              WS-RECHAZO                                                      
123600        PERFORM  6000-DESPLIEGA-ERROR.                                        
123700                                                                              
123800 3000-PRELINEA.                                                               
123900      PERFORM 3100-INICIO-PRELINEA.                                           
124000      PERFORM 3500-FIN-PRELINEA.                                              
124100                                                                              
124200 3100-INICIO-PRELINEA.                                                        
124300         PERFORM 20000500-PRELINEA-CALL                                       
124400         IF WS-L010-RESULT > 0                                                
124500            MOVE "ERROR EN LLAMADO INICIO PRELINEA" TO                        
124600                   WS-RECHAZO                                                 
124700            PERFORM  6000-DESPLIEGA-ERROR.                                    
124800                                                                              
124900 3500-FIN-PRELINEA.                                                           
125000         PERFORM 20000500-FPRELIN-CALL                                        
125100         IF WS-L010-RESULT > 0                                                
125200            MOVE "ERROR EN LLAMADO FIN  PRELINEA" TO                          
125300                  WS-RECHAZO                                                  
125400            PERFORM  6000-DESPLIEGA-ERROR.                                    
125500                                                                              
125600****************************************************************              
125700 4000-FINBATCH.                                                               
125800     PERFORM 20000500-FINBATCH-CALL                                           
125900     IF WS-L010-RESULT > 0                                                    
126000        MOVE "ERROR EN LLAMADO FINBATCH" TO                                   
126100              WS-RECHAZO                                                      
126200        PERFORM  6000-DESPLIEGA-ERROR.                                        
126300                                                                              
126400***************************************************************               
126500                                                                              
126600 5000-GENERALOG.                                                              
126700     PERFORM 20000500-GENERALOG-CALL                                          
126800     IF WS-L010-RESULT > 0                                                    
126900        MOVE "ERROR EN LLAMADO GENERALOG" TO                                  
127000              WS-RECHAZO                                                      
127100        PERFORM  6000-DESPLIEGA-ERROR.                                        
127200                                                                              
127300***************************************************************               
127400                                                                              
127500 5500-REST24HRS.                                                              
127600     PERFORM 20000500-REST24HRS-CALL                                          
127700     IF WS-L010-RESULT > 0                                                    
127800        MOVE "ERROR EN LLAMADO REST24HRS" TO                                  
127900              WS-RECHAZO                                                      
128000        PERFORM  6000-DESPLIEGA-ERROR.                                        
128100                                                                              
128200***************************************************************               
128300                                                                              
128400 6000-DESPLIEGA-ERROR.                                                        
128500     IF WS-L010-RESULT > 0                                                    
128600        MOVE WS-L010-RESULT    TO WS-MSG-N-04                                 
128700        IF WS-IND-ERROR > 0 AND < 29                                          
128800           COMPUTE WS-IND-ERROR = WS-L010-RESULT - 10                         
128900           STRING WS-RECHAZO, " RSLT=", WS-MSG-N-04,                          
128950                  " CAUSA: ", WS-ERR-L010(WS-IND-ERROR)                       
129000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
129100        ELSE                                                                  
129600           STRING  WS-RECHAZO, " RSLT=", WS-MSG-N-04                          
129700           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG.                           
129900                                                                              
130000     IF WS-L010-RESULT > 0                                                    
130050        PERFORM 70000050-MENSAJE                                              
130100        SET MYSELF(STATUS) TO -1.                                             
130200                                                                              
130300 9000-FIN-ANORMAL.                                                            
130400     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
130500     CALL SYSTEM DMTERMINATE.                                                 
130600                                                                              
130700 10000-RECUP-BASE-ORIGINAL.                                                   
130800     OPEN UPDATE S500BD01CAPTACION.                                           
130900                                                                              
131000     PERFORM 90000000-BEGIN-TRANSACTION.                                      
131100     IF WS-STATUS-BASE > 0                                                    
131400        STRING "ERR BEGIN-TRANSAC ", WS-STATUS-BASE                           
131500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
131600        PERFORM 70000050-MENSAJE                                              
131700        PERFORM 9000-FIN-ANORMAL.                                             
131800                                                                              
131900     PERFORM 10100-VALIDA-BASE.                                               
132000     PERFORM 10200-MODIF-CONTROL.                                             
132100                                                                              
132200     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
132300     IF WS-STATUS-BASE > 0                                                    
132600        STRING "ERR END-TRANSACIONSYNC ", WS-STATUS-BASE                      
132700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
132800        PERFORM 70000050-MENSAJE                                              
132900        PERFORM 9000-FIN-ANORMAL.                                             
133000                                                                              
133100     CLOSE S500BD01CAPTACION.                                                 
133200                                                                              
133300 10100-VALIDA-BASE.                                                           
133400     PERFORM 90000000-B00CTRLPASO-LOCK.                                       
133500     IF WS-STATUS-BASE > 0                                                    
133800        STRING "ERR LOCK B00CTRLPASO ", WS-STATUS-BASE                        
133900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
134000        PERFORM 70000050-MENSAJE                                              
134100        PERFORM 9000-FIN-ANORMAL.                                             
134200                                                                              
134300     PERFORM 90000002-B02CONTROL-LOCK.                                        
134400     IF WS-STATUS-BASE > 0                                                    
134700        STRING "ERR LOCK B02CONTROL ", WS-STATUS-BASE                         
134800               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
134900        PERFORM 70000050-MENSAJE                                              
135000        PERFORM 9000-FIN-ANORMAL.                                             
135100                                                                              
135200     IF  (B00-TIPO-PROCESO = 1)                                               
135250     AND (B00-NUM-PASO-01  = 170 AND B00-NUM-PASO-02 = 170                    
135300          AND B00-NUM-PASO-03 = 170)                                          
135400     AND (B02-STA-DISP     = 7)                                               
135500         NEXT SENTENCE                                                        
135600     ELSE                                                                     
135900        STRING "BASE ORIGINAL NO ES SALIDA DE BATCH "                         
135940               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
136100        PERFORM 70000050-MENSAJE                                              
136200        PERFORM 9000-FIN-ANORMAL.                                             
136300                                                                              
136400 10200-MODIF-CONTROL.                                                         
136500     MOVE B02-FECHA-LINEA     TO B02-FECHA-LOTE.                              
136600     MOVE 0                   TO B00-TIPO-PROCESO                             
136700                                 B02-STA-DISP.                                
136800     MOVE 10                  TO B00-NUM-PASO-01                              
136900                                 B00-NUM-PASO-02                              
136950                                 B00-NUM-PASO-03.                             
137000     MOVE 1                   TO B02-CTR-RECUPERA.                            
137100                                                                              
137200     PERFORM 90000000-B00CTRLPASO-STORE.                                      
137300     IF WS-STATUS-BASE > 0                                                    
137600        STRING "ERR STORE B00CTRLPASO ", WS-STATUS-BASE                       
137700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
137800        PERFORM 70000050-MENSAJE                                              
137900        PERFORM 9000-FIN-ANORMAL.                                             
138000                                                                              
138100     PERFORM 90000002-B02CONTROL-STORE.                                       
138200     IF WS-STATUS-BASE > 0                                                    
138500        STRING "ERR STORE B02CONTROL ", WS-STATUS-BASE                        
138600               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
138700        PERFORM 70000050-MENSAJE                                              
138800        PERFORM 9000-FIN-ANORMAL.                                             
138900                                                                              
139000 11000-RECUP-BASE-AUXILIAR.                                                   
139100     OPEN INQUIRY   S500BD01CAPTACION.                                        
139200     OPEN UPDATE    S500BD02AUXILIAR.                                         
139300                                                                              
139400     PERFORM 90000000-BEGIN-TRANSAUX.                                         
139500     IF WS-STATUS-BASE > 0                                                    
139800        STRING "ERR BEGIN-TRANSAC AUX ", WS-STATUS-BASE                       
139900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
140000        PERFORM 70000050-MENSAJE                                              
140100        PERFORM 9000-FIN-ANORMAL.                                             
140200                                                                              
140300     PERFORM 11100-FIND-CTRL-ORIGINAL.                                        
140400     PERFORM 11200-GEN-B02-AUXILIAR.                                          
140500     PERFORM 11300-GEN-B01-AUXILIAR 7 TIMES.                                  
140600                                                                              
140700     PERFORM 90000000-END-TRANSAUXSYNC.                                       
140800     IF WS-STATUS-BASE > 0                                                    
141100        STRING "ERR END-TRANSACIONSYNC AUX ", WS-STATUS-BASE                  
141200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
141300        PERFORM 70000050-MENSAJE                                              
141400        PERFORM 9000-FIN-ANORMAL.                                             
141500                                                                              
141600     CLOSE S500BD01CAPTACION.                                                 
141700     CLOSE S500BD02AUXILIAR.                                                  
141800                                                                              
141900 11100-FIND-CTRL-ORIGINAL.                                                    
142000    PERFORM 90000002-B02CONTROL-FIND.                                         
142100    IF WS-STATUS-BASE > 0                                                     
142400       STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                          
142500              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
142600       PERFORM 70000050-MENSAJE                                               
142700       PERFORM 9000-FIN-ANORMAL.                                              
142800                                                                              
142900 11200-GEN-B02-AUXILIAR.                                                      
143000     PERFORM 90000002-B02ACONTROL-LOCK.                                       
143100     IF WS-STATUS-BASE > 0                                                    
143200        IF WS-DB-NOTFOUND                                                     
143300           PERFORM 90000002-B02ACONTROL-CREATE                                
143400           IF WS-STATUS-BASE > 0                                              
143700              STRING "ERR CREATE B02ACONTROL ", WS-STATUS-BASE                
143800                     DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                  
143900              PERFORM 70000050-MENSAJE                                        
144000              PERFORM 9000-FIN-ANORMAL                                        
144100           ELSE                                                               
144200              NEXT SENTENCE                                                   
144300        ELSE                                                                  
144600           STRING "ERR LOCK  B02ACONTROL ", WS-STATUS-BASE                    
144700                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
144800           PERFORM 70000050-MENSAJE                                           
144900           PERFORM 9000-FIN-ANORMAL                                           
145000     ELSE                                                                     
145300        STRING "BASE AUXILIAR NO INICIALIZADA ", WS-STATUS-BASE               
145400               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
145500        PERFORM 70000050-MENSAJE                                              
145600        PERFORM 9000-FIN-ANORMAL.                                             
145700                                                                              
145800     MOVE B02-FECHA-LINEA  TO B02A-FECHA-LINEA.                               
145900     MOVE B02-NUM-CSI      TO B02A-NUM-CSI.                                   
146000     MOVE 1                TO B02A-CTR-RECUPERA.                              
146100                                                                              
146200     PERFORM 90000002-B02ACONTROL-STORE.                                      
146300     IF WS-STATUS-BASE > 0                                                    
146600        STRING "ERR STORE B02ACONTROL ", WS-STATUS-BASE                       
146700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
146800        PERFORM 70000050-MENSAJE                                              
146900        PERFORM 9000-FIN-ANORMAL.                                             
147000                                                                              
147100 11300-GEN-B01-AUXILIAR.                                                      
147200     ADD  1                      TO W77-NUM-COPIA-AUX.                        
147300     MOVE W77-NUM-COPIA-AUX      TO WS-NUM-COPIA.                             
147400     PERFORM 90000001-B01ACONTROL-LOCK.                                       
147500     IF WS-STATUS-BASE > 0                                                    
147600        IF WS-DB-NOTFOUND                                                     
147700           PERFORM 90000001-B01ACONTROL-CREATE                                
147800           IF WS-STATUS-BASE > 0                                              
148100              STRING "ERR CREATE B01ACONTROL ", WS-STATUS-BASE                
148200                     DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                  
148300              PERFORM 70000050-MENSAJE                                        
148400              PERFORM 9000-FIN-ANORMAL                                        
148500           ELSE                                                               
148600              NEXT SENTENCE                                                   
148700        ELSE                                                                  
149000           STRING "ERR LOCK  B01ACONTROL ", WS-STATUS-BASE                    
149100                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
149200           PERFORM 70000050-MENSAJE                                           
149300           PERFORM 9000-FIN-ANORMAL                                           
149400     ELSE                                                                     
149700        STRING "BASE AUXILIAR NO INICIALIZADA B01ACONTROL;",                  
149800               " STATUS BASE ", WS-STATUS-BASE,                               
149900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
150000        PERFORM 70000050-MENSAJE                                              
150100        PERFORM 9000-FIN-ANORMAL.                                             
150200                                                                              
150300     MOVE WS-NUM-COPIA      TO B01A-NUM-COPIA.                                
150400                                                                              
150500     PERFORM 90000001-B01ACONTROL-STORE.                                      
150600     IF WS-STATUS-BASE > 0                                                    
150900        STRING "ERR STORE B01ACONTROL;",                                      
151000               " STATUS-BASE ", WS-STATUS-BASE                                
151100               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
151200        PERFORM 70000050-MENSAJE                                              
151300        PERFORM 9000-FIN-ANORMAL.                                             
151400*                                                                             
151402 20000-CREA-CTRL-ARRIBOS.                                                     
151403*------------------------                                                     
151404    OPEN INQUIRY S500BD01CAPTACION.                                           
151406    PERFORM 90000002-B02CONTROL-FIND                                          
151408    IF WS-STATUS-BASE > 0                                                     
151410       STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                          
151412              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
151414       PERFORM 70000050-MENSAJE                                               
151416       CALL SYSTEM DMTERMINATE.                                               
151418    CLOSE S500BD01CAPTACION.                                                  
151422    MOVE B02-FECHA-LINEA        TO WS-S006-FECHA1                             
151424                                   WS-I-AD-FECLIN.                            
151428    MOVE 0                      TO WS-S006-FECHA2                             
151430    MOVE 13                     TO WS-S006-FORMATO                            
151432    MOVE 18                     TO WS-S006-FUNCION                            
151433    PERFORM 20000006-LOCSUP.                                                  
151434    IF WS-S006-FUNCION = 0                                                    
151436       IF WS-S006-FECHA1 = 1                                                  
151437          PERFORM 0000-CALL-S500L040ARCHDISP-F4                               
151438          IF WS-S500-L040-RESULT > 0                                          
151440             MOVE "ERROR EN LLAMADO F4 DE S500L040ARCHDISP" TO                
151442                   WS-RECHAZO                                                 
151446             MOVE WS-S500-L040-RESULT    TO WS-MSG-N-04                       
151448             STRING  WS-RECHAZO, " RSLT=", WS-MSG-N-04                        
151454             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
151455             PERFORM 70000050-MENSAJE                                         
151457          ELSE                                                                
151458            NEXT SENTENCE                                                     
151459       ELSE                                                                   
151460           MOVE "ERROR FECHA DE LINEA ES INHABIL" TO                          
151461               WS-RECHAZO                                                     
151462           MOVE WS-S006-FECHA1    TO WS-MSG-N-04                              
151463           STRING  WS-RECHAZO, " RSLT=", WS-MSG-N-04                          
151464           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                            
151465           PERFORM 70000050-MENSAJE                                           
151467    ELSE                                                                      
151468        MOVE "ERROR AL LLAMAR LIBRERIA CALLENDAR" TO                          
151469             WS-RECHAZO                                                       
151470         MOVE WS-S006-FUNCION    TO WS-MSG-N-04                               
151471         STRING  WS-RECHAZO, " RSLT=", WS-MSG-N-04                            
151472         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
151473         PERFORM 70000050-MENSAJE.                                            
151477 21000-AVISO-FIN-DIA.                                                         
151478*====================                                                         
151479       PERFORM 20000500-AVISO-FIN-DIA                                         
151480       IF WS-L010-RESULT > 0                                                  
151481          MOVE "ERROR EN AVISO FIN DE DIA" TO  WS-RECHAZO                     
151482          PERFORM  6000-DESPLIEGA-ERROR.                                      
151483 22000-AVISO-INI-DIA.                                                         
151484*====================                                                         
151485       PERFORM 20000500-AVISO-INI-DIA                                         
151486       IF WS-L010-RESULT > 0                                                  
151487          MOVE "ERROR EN AVISO FIN DE DIA" TO  WS-RECHAZO                     
151488          PERFORM  6000-DESPLIEGA-ERROR.                                      
151489                                                                              
151500****************************************************************              
151600 COPY "S500/INC/PRO/25MTP002".                                                
151700 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
151800****************************************************************              
166100***=========================================                                  
166200 22000-DEPURACION-ARCHIVOS.                                                   
166300***=========================================                                  
166400    PERFORM 10000-INICIO-DEPURACION.                                          
166500    IF S000-CTR-CVEERROR = 0                                                  
166600       PERFORM 10000-PROCESO-DEPURACION                                       
166700       PERFORM 10000-ENVIO-ARCDEPURACION.                                     
166800                                                                              
166900***=========================================                                  
167000 10000-INICIO-DEPURACION.                                                     
167100***=========================================                                  
167200    MOVE   ZEROS   TO  S000-CTR-CVEERROR.                                     
167300    PERFORM 10000000-S000LIBFEC.                                              
167400    PERFORM 10000000-JBATCH.                                                  
167500    IF S000-CTR-CVEERROR = 0                                                  
167600       NEXT SENTENCE                                                          
167700    ELSE                                                                      
167800       EXIT PERFORM.                                                          
167900                                                                              
168000* CHANGE A LA LIBRERIA ADMONXFER TRANSFERENCIAS VIA S022 INTELAR              
168100******************************************************************            
168200     CHANGE ATTRIBUTE LIBACCESS      OF "ADMONXFERS"                          
168300                                     TO BYFUNCTION.                           
168400     CHANGE ATTRIBUTE FUNCTIONNAME   OF "ADMONXFERS"                          
168500                                     TO "ADMONXFERS".                         
168600                                                                              
168700                                                                              
168800    MOVE    ZEROS                TO   WS-SEC-DIR                              
168900                                      WS-FEC-PROCESO.                         
169000    PERFORM   20000-ABRE-BD.                                                  
169100                                                                              
169200    PERFORM 20000-RECUPERA-FECHAPROC.                                         
169300    IF  WS88-ERROR-B02                                                        
169400        ACCEPT  WS-FEC-PROCESO   FROM DATE                                    
169500    ELSE                                                                      
169600        MOVE    B02-FECHA-LINEA  TO  WS-FEC-PROCESO                           
169700        MOVE    B02-NUM-CSI      TO  WKS-NOD-DEPFIN.                          
169800                                                                              
169900    MOVE    WS-FEC-PROCESO       TO  WKS-FEC-DEPTEM                           
170000                                     WKS-FEC-DEPFIN                           
170100                                     WKS-FEC-CONSULTA.                        
170200    PERFORM 20000-CIERRA-BDCAPTACION.                                         
170300                                                                              
170400***** TITULOS DE ARCHIVOS DE DEPURACION                                       
170500    CHANGE ATTRIBUTE TITLE OF  FILE-DEPTEM                                    
170600                           TO  WS-NOM-DEPTEM.                                 
170700                                                                              
170800    CHANGE ATTRIBUTE TITLE OF  FILE-DEPURADOS                                 
170900                           TO  WS-NOM-DEPURADOS.                              
171000                                                                              
171100***** SI LOS ARCHIVOS YA EXISTEN SE ABREN CON EXTEND                          
171200    IF ATTRIBUTE RESIDENT  OF  FILE-DEPTEM = VALUE TRUE                       
171300       OPEN EXTEND  FILE-DEPTEM                                               
171400    ELSE                                                                      
171500       OPEN OUTPUT  FILE-DEPTEM.                                              
171600                                                                              
171700                                                                              
171800    IF ATTRIBUTE RESIDENT  OF  FILE-DEPURADOS = VALUE TRUE                    
171900       OPEN EXTEND  FILE-DEPURADOS                                            
172000    ELSE                                                                      
172100       OPEN OUTPUT  FILE-DEPURADOS.                                           
172200                                                                              
172300***** VALIDA SI HUBO ERROR EN FECHA DE B02                                    
172400    IF  WS88-ERROR-B02                                                        
172500       MOVE     0001             TO  WS-COD-ERROR                             
172600       MOVE     WS-STATUS-BASE   TO  ERROR-0001-02                            
172700       PERFORM  40000-ESCRIBE-PROBLEMA                                        
172800       MOVE     0002             TO  WS-COD-ERROR                             
172900       PERFORM  40000-ESCRIBE-PROBLEMA.                                       
173000                                                                              
173100                                                                              
173200***** PROYECTA FECHA LIMITE PARA ACTUALIZAR ARCHIVOS NO DEPURADOS             
173300    MOVE WS-FEC-PROCESO   TO  WS-LIBFEC-FECHAIN.                              
173400    MOVE ZEROS            TO  WS-LIBFEC-FECHAOUT.                             
173500    MOVE 65               TO  W77-LIBFEC-CVESEM.                              
173600    MOVE 01               TO  W77-LIBFEC-CVEFEST.                             
173700    MOVE -90              TO  W77-LIBFEC-INCREM.                              
173800    PERFORM   90021000-PROYECTA-FECHA-HAB2K.                                  
173900    MOVE WS-LIBFEC-FECHAOUT TO  WS-FEC-LIM-DEP.                               
174000                                                                              
174100   MOVE QUOTES              TO  WKS-WFL-QUOTES-INICIAL                        
174200                                WKS-WFL-QUOTES-FINAL.                         
174300                                                                              
174400***=========================================                                  
174500 10000000-JBATCH.                                                             
174600***=========================================                                  
174700   MOVE   "S500JBATCH"            TO S000-CTR-LIBID.                          
174800   MOVE   SPACES                  TO S000-CTR-NOMLIB.                         
174900   MOVE     0                     TO S000-CTR-CVEERROR.                       
175000   PERFORM               2000000-CTLVERS-TITBATCH.                            
175100   IF S000-CTR-CVEERROR  =  0                                                 
175200          MOVE  S000-CTR-NOMLIB       TO  WKS-WFL-NOM-PROCESO.                
175300                                                                              
175400                                                                              
175500***=========================================                                  
175600 20000-ABRE-BD.                                                               
175700***=========================================                                  
175800  OPEN INQUIRY   S500BD01CAPTACION                                            
175900  ON EXCEPTION                                                                
176000      CALL SYSTEM DMTERMINATE.                                                
176100                                                                              
176200  OPEN UPDATE    S500BD04TARJETAS                                             
176300  ON EXCEPTION                                                                
176400      CALL SYSTEM DMTERMINATE.                                                
176500                                                                              
176600                                                                              
176700***=========================================                                  
176800 20000-RECUPERA-FECHAPROC.                                                    
176900***=========================================                                  
177000    MOVE ZEROS      TO  WS-ERROR-B02   WS-STATUS-BASE.                        
177100                                                                              
177200    FIND FIRST S500B02CONTROL                                                 
177300         ON EXCEPTION                                                         
177400            MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                      
177500                                                                              
177600    IF WS-STATUS-BASE > 0                                                     
177700       MOVE     1                TO  WS-ERROR-B02.                            
177800                                                                              
177900                                                                              
178000***=========================================                                  
178100 10000-PROCESO-DEPURACION.                                                    
178200***=========================================                                  
178300   PERFORM     20000-PROCESO-MIGRAB07.                                        
178400*****    DISPLAY "........ INICIO DEPURACION ????  ...".                      
178500*****    ACCEPT  WS-ACCEPT.                                                   
178600                                                                              
178800   PERFORM     20000-PROCESO-DEPURACION.                                      
178802   PERFORM     20000-PROCESO-VALIDACIONPDIR.                                  
179100   PERFORM     10000-CIERRABD-TARJETAS.                                       
179200                                                                              
179300   CLOSE       FILE-DEPTEM   WITH SAVE.                                       
179400   PERFORM     20000-PROC-VAL-ARCDEPURADOS.                                   
179500                                                                              
179600                                                                              
179700                                                                              
179800***=========================================                                  
179900 20000-PROCESO-DEPURACION.                                                    
180000***=========================================                                  
180100   MOVE ZEROS    TO   WS-NOEXISTE-REGCTRL   WS-STATUS-BASE.                   
180200                                                                              
180202   SET S500B10PDEPURA     TO BEGINNING.                                       
180300   PERFORM 30000-BUSCA-1ER-REGISTRO.                                          
180400   IF WS88-EXISTE-REGCTRL                                                     
180500      PERFORM 40000-VALIDA-DEPURACION UNTIL                                   
180600                                          WS88-NOEXISTE-REGCTRL.              
180602                                                                              
180604***=========================================                                  
180606 20000-PROCESO-VALIDACIONPDIR.                                                
180608***=========================================                                  
180609  SET S500B10PDEPURA     TO BEGINNING.                                        
180610  WAIT (600).                                                                 
180612  MOVE ZEROS             TO WS-NOEXISTE-REGCTRL  WS-STATUS-BASE.              
180614  PERFORM 30000-BUSCA-1ER-REGISTRO.                                           
180616  PERFORM 40000-VALIDA-GENARCHPDIR UNTIL                                      
180618                                   WS88-NOEXISTE-REGCTRL.                     
180620                                                                              
180622***=========================================                                  
180624 40000-VALIDA-GENARCHPDIR.                                                    
180626***=========================================                                  
180628  MOVE LOW-VALUES  TO   WS-VARIABLES-GENERALES.                               
180630  MOVE ZEROS       TO   WS-CAMPO-FECHAB10   WS-CAMPO-SECB10                   
180632                         WS-HAYFILE-CONS    WS-REG-DEPURABLE.                 
180634  MOVE SPACES      TO   WS-CAMPO-VAL-NOM.                                     
180636  PERFORM 50000-AMUEBLA-GENERALES.                                            
180639                                                                              
180641  IF WS-GEN-NUMSECPDIR > 0 AND (WS-GEN-IDEDEP = 1 OR 3)                       
180643      PERFORM  60000-RECNUM-FECHA-SECUENCIAL                                  
180645      MOVE     WS-GEN-NOM        TO  WS-CAMPO-VAL-NOM                         
180647      PERFORM  60000-PROCESA-CARACFECSEC                                      
180649      MOVE     WS-CAMPO-VAL-NOM  TO  WS-GEN-NOM                               
180651      PERFORM  60000-BUSCA-ARCHIVODIR                                         
180653      IF WS88-HAYFILE-CONS                                                    
180655         PERFORM 60000-PROCESA-ARCHIVODIR                                     
180657         PERFORM 60000-ACTUALIZA-B10                                          
180659      ELSE                                                                    
180661         MOVE ZEROS  TO WS10P-SEC-DIR                                         
180663         PERFORM 6000-GRABASEC-PDIR.                                          
180665                                                                              
180667  IF WS88-EXISTE-REGCTRL                                                      
180669      PERFORM 50000-BUSCA-SIG-REGISTRO.                                       
180671                                                                              
180900***=========================================                                  
181000 30000-BUSCA-1ER-REGISTRO.                                                    
181100***=========================================                                  
181200   FIND FIRST  B10PSXIDEDEP                                                   
181400        ON EXCEPTION                                                          
181500           MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                       
181600                                                                              
181700                                                                              
181800   IF  WS-STATUS-BASE > 0                                                     
181900       MOVE     0001             TO  WS-COD-ERROR                             
182000       MOVE     WS-STATUS-BASE   TO  ERROR-0001-02                            
182100       PERFORM  40000-ESCRIBE-PROBLEMA                                        
182200       MOVE     0003             TO  WS-COD-ERROR                             
182300       PERFORM  40000-ESCRIBE-PROBLEMA                                        
182400       MOVE     1                TO WS-NOEXISTE-REGCTRL.                      
182500                                                                              
182600                                                                              
182700***=========================================                                  
182800 40000-VALIDA-DEPURACION.                                                     
182900***=========================================                                  
183000   MOVE LOW-VALUES  TO   WS-VARIABLES-GENERALES.                              
183100   MOVE ZEROS       TO   WS-CAMPO-FECHAB10   WS-CAMPO-SECB10                  
183300   PERFORM 50000-AMUEBLA-GENERALES.                                           
183400   PERFORM 50000-VALIDA-REGBDB10.                                             
183500                                                                              
183600   IF WS88-REG-DEPURABLE                                                      
183700      PERFORM 50000-VALIDA-TIPODEP                                            
183800   ELSE                                                                       
183900      IF WS88-REG-AELIMINAR                                                   
184000         PERFORM  50000-DEPURA-REGISTRO.                                      
184100                                                                              
184200   IF WS88-EXISTE-REGCTRL                                                     
184300      PERFORM 50000-BUSCA-SIG-REGISTRO.                                       
184400                                                                              
184500                                                                              
184600***=========================================                                  
184700 50000-DEPURA-REGISTRO.                                                       
184800***=========================================                                  
184900   MOVE ZEROS    TO     WS-STATUS-BASE-ANT  WS-STATUS-BASE.                   
185000   PERFORM 70000-BEGIN-TRANSACTION                                            
185100   PERFORM 70000-LOCK-B010                                                    
185200   IF WS-STATUS-BASE = 0                                                      
185300      PERFORM 70000-DELETE-B010                                               
185400      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT                            
185500   ELSE                                                                       
185600      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT.                           
185700                                                                              
185800   MOVE 0                TO  WS-STATUS-BASE                                   
185900   PERFORM 70000-END-TRANSACTION.                                             
186000                                                                              
186100                                                                              
186200   IF WS-STATUS-BASE-ANT > 0                                                  
186300      MOVE     0001                 TO  WS-COD-ERROR                          
186400      MOVE     WS-STATUS-BASE-ANT   TO  ERROR-0001-02                         
186500      PERFORM  40000-ESCRIBE-PROBLEMA                                         
186600      MOVE     0007                 TO  WS-COD-ERROR                          
186700      MOVE     WS-GEN-NOM           TO  ERROR-0007-02                         
186800      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
186900                                                                              
187000                                                                              
187100                                                                              
187200***=========================================                                  
187300 50000-AMUEBLA-GENERALES.                                                     
187400***=========================================                                  
187500   MOVE B10P-NOMBRE-ARC        TO  WS-GEN-NOM.                                
187600   MOVE B10P-SECUENCIAL        TO  WS-GEN-SEC.                                
187700   MOVE B10P-VALIDAB08         TO  WS-GEN-VAL08.                              
187800   MOVE B10P-DEPUR-ACT         TO  WS-GEN-DEP.                                
187900   MOVE B10P-IDE-DEPURACION    TO  WS-GEN-IDEDEP.                             
188000   MOVE B10P-SISTEMA-CTE       TO  WS-GEN-SISTEMAB10.                         
188100   MOVE B10P-NODO              TO  WS-GEN-NODOB10.                            
188200   MOVE B10P-TIPO              TO  WS-GEN-TIPOB10.                            
188300   MOVE B10P-DIAS-RESPALDO     TO  WS-GEN-DIAS-RESP.                          
188400   MOVE B10P-FEC-MODIF         TO  WS-GEN-FECMOD.                             
188500   MOVE B10P-FEC-ULTDEP        TO  WS-GEN-FECULT.                             
188600   MOVE B10P-SEC-DIR           TO  WS-GEN-NUMSECPDIR.                         
188700                                                                              
188800                                                                              
188900***=========================================                                  
189000 50000-VALIDA-REGBDB10.                                                       
189100***=========================================                                  
189200  MOVE    1         TO  WS-REG-DEPURABLE.                                     
189300                                                                              
189400                                                                              
189500***** VALIDA SI YA SE PROCESO DURANTE EL DIA DE PROCESO                       
189600  IF  WS-GEN-FECULT  <  WS-FEC-PROCESO                                        
189700      NEXT SENTENCE                                                           
189800  ELSE                                                                        
189900      MOVE 0        TO  WS-REG-DEPURABLE                                      
190000      EXIT PERFORM.                                                           
190100                                                                              
190200                                                                              
190300***** VALIDA QUE EL ID SEA VALIDO PARA DEPURACION                             
190400  IF  WS-GEN-IDEDEP = 1 OR 3                                                  
190500      NEXT SENTENCE                                                           
190600  ELSE                                                                        
190700      MOVE     0                TO  WS-REG-DEPURABLE                          
190800      MOVE     0004             TO  WS-COD-ERROR                              
190900      MOVE     WS-GEN-NOM       TO  ERROR-0004-02                             
191000      PERFORM  40000-ESCRIBE-PROBLEMA                                         
191100      EXIT PERFORM.                                                           
191200                                                                              
191300                                                                              
191400  PERFORM 40000-VALIDA-FECHA-SECUENCIAL.                                      
191500                                                                              
191600  IF WS88-REG-DEPURABLE  AND WS-GEN-FECULT NOT > 0                            
191700     PERFORM 90000-VALIDA-NOMBREDEP.                                          
191800                                                                              
191900  IF WS88-REG-DEPURABLE                                                       
192000     NEXT SENTENCE                                                            
192100  ELSE                                                                        
192200     MOVE     0010             TO  WS-COD-ERROR                               
192300     MOVE     WS-GEN-NOM       TO  ERROR-0010-02                              
192400     PERFORM  40000-ESCRIBE-PROBLEMA.                                         
192500                                                                              
192600                                                                              
192602***=========================================                                  
192604 60000-RECNUM-FECHA-SECUENCIAL.                                               
192606***=========================================                                  
192608   MOVE       ZEROS     TO   WS-CNTCAR-FEC  WS-CNT-FEC                        
192610                             WS-CNTCAR-SEC  WS-CNT-SEC                        
192612                             WS-CNTCAR-COP  WS-CNT-COP.                       
192614                                                                              
192616   INSPECT WS-GEN-NOM TALLYING WS-CNT-FEC FOR ALL "#".                        
192618   INSPECT WS-GEN-NOM TALLYING WS-CNT-SEC FOR ALL "?".                        
192620                                                                              
192700***=========================================                                  
192800 40000-VALIDA-FECHA-SECUENCIAL.                                               
192900***=========================================                                  
193000   MOVE       ZEROS     TO   WS-CNTCAR-FEC  WS-CNT-FEC                        
193100                             WS-CNTCAR-SEC  WS-CNT-SEC                        
193200                             WS-CNTCAR-COP  WS-CNT-COP.                       
193300******** VALIDA NUMERO Y ORDEN CORRECTO DE CARACTERES DE FECHA                
193400   INSPECT WS-GEN-NOM TALLYING WS-CNT-FEC FOR ALL "#".                        
193500   IF WS-CNT-FEC = 0 OR 6 OR 8                                                
193600      NEXT SENTENCE                                                           
193700   ELSE                                                                       
193800      MOVE  2    TO  WS-REG-DEPURABLE                                         
193900      EXIT PERFORM.                                                           
194000                                                                              
194100                                                                              
194200  IF WS-CNT-FEC = 6                                                           
194300     INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-FEC FOR ALL "######"               
194400     IF WS-CNTCAR-FEC = 0                                                     
194500        MOVE  2    TO  WS-REG-DEPURABLE                                       
194600        EXIT PERFORM.                                                         
194700                                                                              
194800                                                                              
194900  IF WS-CNT-FEC = 8                                                           
195000     INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-FEC FOR ALL "########"             
195100     IF WS-CNTCAR-FEC = 0                                                     
195200        MOVE  2    TO  WS-REG-DEPURABLE                                       
195300        EXIT PERFORM.                                                         
195400                                                                              
195500                                                                              
195600                                                                              
195700** VALIDA NUMERO Y ORDEN CORRECTO DE CARACTERES DE SECUENCUENCIAL             
195800  INSPECT WS-GEN-NOM TALLYING WS-CNT-SEC FOR ALL "?".                         
195900  IF WS-CNT-SEC > 6                                                           
196000     MOVE  2    TO  WS-REG-DEPURABLE                                          
196100     EXIT PERFORM.                                                            
196200                                                                              
196300                                                                              
196400  IF WS-CNT-SEC = 2                                                           
196500    INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-SEC FOR ALL "??"                    
196600    IF WS-CNTCAR-SEC = 0                                                      
196700       MOVE  2    TO  WS-REG-DEPURABLE                                        
196800       EXIT PERFORM.                                                          
196900                                                                              
197000                                                                              
197100  IF WS-CNT-SEC = 3                                                           
197300    INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-SEC FOR ALL "???"                   
197400    IF WS-CNTCAR-SEC = 0                                                      
197500       MOVE  2    TO  WS-REG-DEPURABLE                                        
197600       EXIT PERFORM.                                                          
197700                                                                              
197800                                                                              
197900  IF WS-CNT-SEC = 4                                                           
198100    INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-SEC FOR ALL "????"                  
198200    IF WS-CNTCAR-SEC = 0                                                      
198300       MOVE  2    TO  WS-REG-DEPURABLE.                                       
198302                                                                              
198304  IF WS-CNT-SEC = 5                                                           
198308    INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-SEC FOR ALL "?????"                 
198310    IF WS-CNTCAR-SEC = 0                                                      
198312       MOVE  2    TO  WS-REG-DEPURABLE.                                       
198314                                                                              
198316  IF WS-CNT-SEC = 6                                                           
198320    INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-SEC FOR ALL "??????"                
198322    IF WS-CNTCAR-SEC = 0                                                      
198324       MOVE  2    TO  WS-REG-DEPURABLE.                                       
198326                                                                              
198328                                                                              
198330  INSPECT WS-GEN-NOM TALLYING WS-CNT-COP FOR ALL "%".                         
198332  IF WS-CNT-COP = 0 OR 2                                                      
198334      NEXT SENTENCE                                                           
198336  ELSE                                                                        
198338      MOVE  2    TO  WS-REG-DEPURABLE                                         
198340      EXIT PERFORM.                                                           
198342                                                                              
198344  IF WS-CNT-COP = 2                                                           
198346     INSPECT WS-GEN-NOM TALLYING WS-CNTCAR-COP FOR ALL "%%"                   
198348     IF WS-CNTCAR-COP = 0                                                     
198350        MOVE  2    TO  WS-REG-DEPURABLE                                       
198352        EXIT PERFORM.                                                         
198354                                                                              
198400                                                                              
198500                                                                              
198600***=========================================                                  
198700 50000-VALIDA-TIPODEP.                                                        
198800***=========================================                                  
198900   MOVE ZEROS             TO WS-ABORT-DEP.                                    
199000   PERFORM 5000-LIMPIA-ERRORES.                                               
199100                                                                              
199200*** DEPURA ARCHIVO CON FECHA O CON SECUENCIAL                                 
199300   IF ( WS-CNT-FEC > 0 )   OR                                                 
199400      ( WS-CNT-SEC > 0     OR  WS-GEN-SEC > 0 )                               
199500      MOVE     SPACES            TO  WS-CAMPO-VAL-NOM                         
199600                                     WS-CAMPO-VAL-NOM-RES                     
199700      MOVE     WS-GEN-NOM        TO  WS-CAMPO-VAL-NOM                         
199800      PERFORM  60000-PROCESA-CARACFECSEC                                      
199900      MOVE     WS-CAMPO-VAL-NOM  TO  WS-GEN-NOM                               
200000      PERFORM  60000-CAMBIA-FECHAXINT                                         
200100      PERFORM  60000-GENERA-CONSULTA                                          
200200      MOVE     WS-SEC-DIR   TO  WS10P-SEC-DIR                                 
200300      PERFORM  6000-GRABASEC-PDIR.                                            
200600                                                                              
200700                                                                              
200800*** DEPURA ARCHIVO SIN FECHA NI SECUENCIAL                                    
200900   IF ( WS-CNT-FEC = 0 ) AND                                                  
201000      ( WS-CNT-SEC = 0   AND  WS-GEN-SEC = 0 )                                
201300           PERFORM   70000-VALIDA-USO-ARCHIVO                                 
201400           IF WS-ABORT-DEP = 0                                                
201500              MOVE 1          TO  WS-IDE-ARCH-DEPURADOS                       
201600              MOVE 1          TO  WS-DEPURA-REGOK                             
201700              PERFORM 90000-ENVIA-DEPURACION-ARCH                             
201800              PERFORM 60000-ACTUALIZA-B10.                                    
202000                                                                              
202100                                                                              
203100                                                                              
203200                                                                              
203300                                                                              
203400                                                                              
203500***=========================================                                  
203600 50000-BUSCA-SIG-REGISTRO.                                                    
203700***=========================================                                  
203800   MOVE     ZEROS                       TO WS-STATUS-BASE.                    
203900   FIND NEXT B10PSXIDEDEP                                                     
204000        ON EXCEPTION                                                          
204100          MOVE DMSTATUS(DMCATEGORY)     TO WS-STATUS-BASE.                    
205000                                                                              
205100   IF WS-STATUS-BASE  > 0                                                     
205200      MOVE  1       TO      WS-NOEXISTE-REGCTRL                               
205300      IF  WS-DB-NOTFOUND                                                      
205400          NEXT SENTENCE                                                       
205500      ELSE                                                                    
205600          MOVE     0001                 TO WS-COD-ERROR                       
205700          MOVE     WS-STATUS-BASE       TO ERROR-0001-02                      
205800          PERFORM  40000-ESCRIBE-PROBLEMA                                     
205900          MOVE     0006                 TO WS-COD-ERROR                       
206000          PERFORM  40000-ESCRIBE-PROBLEMA.                                    
206100                                                                              
206200                                                                              
206300***=========================================                                  
206400 60000-PROCESA-CARACFECSEC.                                                   
206500***=========================================                                  
206600***** RECUPERA POSICION DE: FECHA, SECUENCIAL, FIN                            
206700   MOVE  ZEROS     TO  WS-POS-FEC  WS-POS-SEC  WS-TER-NOM                     
206800                       WS-POS-FIN.                                            
206900   PERFORM 60000-RECPOSI-CARAC-FEC VARYING                                    
207000           W77-INX FROM 1 BY 1 UNTIL                                          
207100           (W77-INX > 75) OR (WS-TER-NOM = 1).                                
207200                                                                              
207300                                                                              
207400                                                                              
207500***=========================================                                  
207600 60000-BUSCA-ARCHIVODIR.                                                      
207700***=========================================                                  
207800***** ESPERA QUE SE GENERE ARCHIVO DE CONSULTA                                
207900   MOVE WS-GEN-NUMSECPDIR   TO  WKS-SEC-CONSULTA.                             
208000   CHANGE ATTRIBUTE TITLE   OF  FILE-CONSULTA                                 
208100                            TO  WS-NOM-CONSULTA.                              
208102   IF ATTRIBUTE RESIDENT  OF   FILE-CONSULTA = VALUE TRUE                     
208104      MOVE   1   TO   WS-HAYFILE-CONS                                         
208106      PERFORM    80000-ABRE-ARCHIVODIR.                                       
208108                                                                              
208500                                                                              
208600   IF NOT WS88-HAYFILE-CONS                                                   
208700*********                                                                     
208800********  VALIDAR SI SE DEJA REG DE PROBLEMA                                  
208900********                                                                      
209000      MOVE     0005                  TO  WS-COD-ERROR                         
209100      MOVE     WS-GEN-NOM            TO  ERROR-0005-02                        
209200      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
209300                                                                              
209400                                                                              
209500                                                                              
209600***=========================================                                  
209700 60000-PROCESA-ARCHIVODIR.                                                    
209800***=========================================                                  
209900    MOVE     ZEROS   TO  WS-FIN-READ  WS-DEPURA-REGOK.                        
209950    MOVE SPACES TO LINEA WS-GEN-NOM2.                                         
210000    PERFORM  80000-DEPURA-ARCFECSEC UNTIL WS88-FIN-READ.                      
210005    IF IND-FILE > 0 THEN                                                      
210020        CALL SYSTEM WFL USING WFL-DEPURA                                      
210040        MOVE ZEROS TO   IND-FILE                                              
210060        MOVE SPACES TO LINEA.                                                 
210100    PERFORM  80000-CIERRA-ARCHIVODIR.                                         
210200                                                                              
210300                                                                              
210400                                                                              
210500***=========================================                                  
210600 60000-RECPOSI-CARAC-FEC.                                                     
210700***=========================================                                  
210800    IF WS88-CAR-FEC (W77-INX)  AND WS-POS-FEC = 0                             
210900       MOVE W77-INX TO WS-POS-FEC.                                            
211000                                                                              
211100    IF WS88-CAR-SEC (W77-INX)  AND WS-POS-SEC = 0                             
211200       MOVE W77-INX TO WS-POS-SEC.                                            
211300                                                                              
211400    IF WS88-CAR-ESP (W77-INX)                                                 
211500       MOVE W77-INX TO WS-POS-FIN                                             
211600       MOVE 1 TO WS-TER-NOM                                                   
211700       IF WS88-GEN-VAL08                                                      
211800          MOVE "="  TO  WS-CAR-VN (W77-INX).                                  
211900                                                                              
212000                                                                              
212100                                                                              
212200***=========================================                                  
212300 60000-CAMBIA-FECHAXINT.                                                      
212400***=========================================                                  
212500   INSPECT WS-GEN-NOM  REPLACING ALL "#" BY "?".                              
212502   INSPECT WS-GEN-NOM  REPLACING ALL "%" BY "?".                              
212600   MOVE    WS-GEN-NOM  TO  WS-CAMPO-VAL-NOM-RES.                              
212700                                                                              
212800                                                                              
212900***=========================================                                  
213000 60000-GENERA-CONSULTA.                                                       
213100***=========================================                                  
213200***** GENERA LA CONSULTA PDIR A WFL Y ENVIA EL SECUENCIAL                     
213300   ADD 1                 TO   WS-SEC-DIR.                                     
213400   IF WS-SEC-DIR > 999998                                                     
213500      MOVE 1             TO   WS-NOEXISTE-REGCTRL.                            
213600                                                                              
213700   MOVE "DIR"            TO   WKS-WFL-PARAMETRO1.                             
213800   MOVE  WS-SEC-DIR      TO   WKS-WFL-PARAMETRO2.                             
213900   MOVE  WS-FEC-PROCESO  TO   WKS-WFL-PARAMETRO3.                             
214000   MOVE  WS-GEN-NOM      TO   WKS-WFL-PARAMETRO4.                             
214100                                                                              
214200   CALL  SYSTEM WFL      USING  WKS-WFL-NOM-INICIA.                           
214300                                                                              
214400                                                                              
214500***=========================================                                  
214600 60000-ACTUALIZA-B10.                                                         
214700***=========================================                                  
214800   IF WS-DEPURA-REGOK = 1                                                     
214900       MOVE  WS-FEC-PROCESO  TO  WS-GEN-FECULT                                
215000   ELSE                                                                       
215100       IF ( WS-GEN-FECULT <  WS-FEC-LIM-DEP )  AND                            
215200          ( WS-GEN-FECULT > 0 )                                               
215300          COMPUTE WS-GEN-IDEDEP = WS-GEN-IDEDEP - 1                           
215400          MOVE 0               TO    WS-GEN-DEP                               
215500          MOVE WS-FEC-PROCESO  TO    WS-GEN-FECMOD                            
215600       ELSE                                                                   
215602           MOVE ZEROS  TO WS10P-SEC-DIR                                       
215604           PERFORM 6000-GRABASEC-PDIR                                         
215700           EXIT PERFORM.                                                      
215800                                                                              
215900                                                                              
216000   MOVE 0              TO WS-STATUS-BASE  WS-STATUS-BASE-ANT.                 
216100   PERFORM 70000-BEGIN-TRANSACTION                                            
216200   PERFORM 70000-LOCK-B010                                                    
216300   IF WS-STATUS-BASE = 0                                                      
216400      PERFORM 70000-AMUEBLA-B10                                               
216500      PERFORM 70000-STORE-B010                                                
216600      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT                            
216700   ELSE                                                                       
216800      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT.                           
216900                                                                              
217000                                                                              
217100   MOVE 0                TO  WS-STATUS-BASE.                                  
217200   PERFORM 70000-END-TRANSACTION.                                             
217300                                                                              
217400                                                                              
217500                                                                              
217600   IF WS-STATUS-BASE-ANT > 0                                                  
217700      MOVE     0001                 TO  WS-COD-ERROR                          
217800      MOVE     WS-STATUS-BASE-ANT   TO  ERROR-0001-02                         
217900      PERFORM  40000-ESCRIBE-PROBLEMA                                         
218000      MOVE     0007                 TO  WS-COD-ERROR                          
218100      MOVE     WS-GEN-NOM           TO  ERROR-0007-02                         
218200      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
218300                                                                              
218400                                                                              
218500***=========================================                                  
218600 70000-AMUEBLA-B10.                                                           
218700***=========================================                                  
218800    MOVE  WS-GEN-FECULT  TO  B10P-FEC-ULTDEP.                                 
218900    MOVE  WS-GEN-IDEDEP  TO  B10P-IDE-DEPURACION.                             
219000    MOVE  WS-GEN-DEP     TO  B10P-DEPUR-ACT.                                  
219100    MOVE  WS-GEN-FECMOD  TO  B10P-FEC-MODIF.                                  
219200    MOVE  ZEROS          TO  B10P-SEC-DIR.                                    
219300***=========================================                                  
219400 70000-LOCK-B010.                                                             
219500***=========================================                                  
219600    LOCK B10PSXIDEDEP                                                         
219700         ON EXCEPTION                                                         
219800            MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                      
219900                                                                              
220000***=========================================                                  
220100 70000-DELETE-B010.                                                           
220200***=========================================                                  
220300    DELETE B10PSXIDEDEP                                                       
220400         ON EXCEPTION                                                         
220500            MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                      
220600                                                                              
220700                                                                              
220800***=========================================                                  
220900 70000-STORE-B010.                                                            
221000***=========================================                                  
221100    STORE S500B10PDEPURA                                                      
221200          ON EXCEPTION                                                        
221300             MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                     
221400                                                                              
221500                                                                              
221600***=========================================                                  
221700 70000-END-TRANSACTION.                                                       
221800***=========================================                                  
221900   MOVE 0              TO WS-STATUS-BASE.                                     
222000   END-TRANSACTION NO-AUDIT S500B91PREINICIO                                  
222100      ON EXCEPTION                                                            
222200         MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                         
222300                                                                              
222400                                                                              
222500   IF WS-STATUS-BASE > 0                                                      
222600      CALL SYSTEM DMTERMINATE.                                                
222700                                                                              
222800***=========================================                                  
222900  70000-BEGIN-TRANSACTION.                                                    
223000***=========================================                                  
223100    MOVE 0              TO WS-STATUS-BASE.                                    
223200    BEGIN-TRANSACTION NO-AUDIT S500B91PREINICIO                               
223300          ON EXCEPTION                                                        
223400             MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                     
223500                                                                              
223600    IF WS-STATUS-BASE > 0                                                     
223700       CALL SYSTEM DMTERMINATE.                                               
223800                                                                              
223900                                                                              
225200                                                                              
225300                                                                              
225400                                                                              
225500***=========================================                                  
225600 80000-ABRE-ARCHIVODIR.                                                       
225700***=========================================                                  
225800    OPEN INPUT  FILE-CONSULTA.                                                
225900    PERFORM 90000-LEE-ARCCONSULTA.                                            
226000                                                                              
226100                                                                              
226200                                                                              
226300***=========================================                                  
226400 90000-LEE-ARCCONSULTA.                                                       
226500***=========================================                                  
226600    READ FILE-CONSULTA                                                        
226700         AT END                                                               
226800            MOVE 1  TO WS-FIN-READ.                                           
226900                                                                              
227000                                                                              
227100                                                                              
227200***=========================================                                  
227300 90000-INIZ-FECSECAUX.                                                        
227400***=========================================                                  
227500   MOVE  ZEROS             TO  WS-CAMPO-SECB10.                               
227600                                                                              
227700   IF WS-CNT-FEC = 6                                                          
227800      MOVE  WS-FEC-PROCESO TO WS-CAMPO-FECHAB10                               
227900      MOVE  3              TO  W77-INFEC                                      
228000   ELSE                                                                       
228100      IF WS-CNT-FEC = 8                                                       
228200         MOVE  1              TO  W77-INFEC.                                  
228300                                                                              
228400                                                                              
228500                                                                              
229600                                                                              
229700                                                                              
229800                                                                              
229900***=========================================                                  
230000 80000-DEPURA-ARCFECSEC.                                                      
230100***=========================================                                  
230200   PERFORM  90000-LEE-ARCCONSULTA.                                            
230300   IF  WS88-FIN-READ                                                          
230400       EXIT PERFORM.                                                          
230500                                                                              
230600   MOVE REG-CONSULTA-NOM   TO WS-GEN-NOM                                      
230700                              WS-CAMPO-VAL-NOM.                               
230800   MOVE ZEROS              TO WS-TER-NOM                                      
230900                              WS-MAS-INFO     WS-ABORT-DEP.                   
230902   MOVE ZEROS              TO WKS-ELIM-APLXDISP.                              
230904   MOVE SPACES             TO WKS-NOMBRE-APLXDISP.                            
231000                                                                              
231100                                                                              
231200***** RECUPERA LA FECHA Y EL SECUENCIAL                                       
231300   PERFORM 90000-INIZ-FECSECAUX                                               
231400   PERFORM 90000-RECUPERA-FECSEC VARYING                                      
231500   W77-INX FROM 1 BY 1 UNTIL                                                  
231600                   (W77-INX > 75) OR (WS-TER-NOM = 1).                        
231700   PERFORM 5000-LIMPIA-ERRORES.                                               
231800                                                                              
231900***** VALIDA SI HAY MAS CARACTERES                                            
232000   IF WS-MAS-INFO  = 1                                                        
232100        MOVE   1  TO   WS-ABORT-DEP                                           
232200                                                                              
232300   ELSE                                                                       
232400       IF WS-CNT-FEC > 0                                                      
232500          PERFORM 90000-VALIDA-FECSECARCHIVO                                  
232600***** VALIDA B08 PARA ARCHIVOS CON FECHA VALIDA                               
232700          IF ( WS-ABORT-DEP = 0 AND WS-GEN-IDEDEP = 3 )                       
232800              PERFORM 90000-VALIDA-REGARCHIVO.                                
232900                                                                              
233000                                                                              
233100   IF WS-ABORT-DEP = 0                                                        
233200      PERFORM  70000-VALIDA-USO-ARCHIVO                                       
233300      IF WS-ABORT-DEP = 0                                                     
233400         MOVE 1   TO WS-IDE-ARCH-DEPURADOS                                    
233500         MOVE 1   TO WS-DEPURA-REGOK                                          
233550         MOVE 1 TO WS-FLGPDIR                                                 
233600         PERFORM 90000-ENVIA-DEPURACION-ARCH                                  
233620         MOVE ZEROS TO WS-FLGPDIR                                             
233640         IF IND-FILE > 750                                                    
233660             CALL SYSTEM WFL USING WFL-DEPURA                                 
233670             MOVE SPACES TO LINEA                                             
233680             MOVE ZEROS TO   IND-FILE.                                        
233700                                                                              
233702   IF (WS-DEPURA-REGOK = 1  AND WS-GEN-IDEDEP = 3                             
233704   AND WKS-88ELIM-APLXDISP )                                                  
233706      PERFORM  90000-ELIARCH-APLXDISP.                                        
233800                                                                              
233900***=========================================                                  
234000 90000-RECUPERA-FECSEC.                                                       
234100***=========================================                                  
234200    IF    WS-POS-FEC  >  ZERO                                                 
234300    AND ( W77-INX     = WS-POS-FEC  OR  W77-INX > WS-POS-FEC)                 
234400    AND   W77-INFEC   < 9                                                     
234500          MOVE WS-CAR-VN(W77-INX)   TO  WS-CAR-FEC(W77-INFEC)                 
234600          ADD 1     TO  W77-INFEC.                                            
234700                                                                              
234800                                                                              
234900                                                                              
235400                                                                              
235500                                                                              
235600    IF  WS88-CAR-ESP (W77-INX)                                                
235700        MOVE     1    TO   WS-TER-NOM                                         
235800        IF W77-INX = WS-POS-FIN                                               
235900           NEXT SENTENCE                                                      
236000        ELSE                                                                  
236100           MOVE  1    TO   WS-MAS-INFO.                                       
236200                                                                              
236300                                                                              
236400                                                                              
236500***=========================================                                  
236600 90000-VALIDA-FECSECARCHIVO.                                                  
236700***=========================================                                  
236800* SI DIAS DE RESPALDO ES 0, SE INTENTA DEPURAR DIARIO                         
236900  IF WS-GEN-DIAS-RESP < 1                                                     
237000     EXIT PERFORM.                                                            
237100                                                                              
237200  MOVE WS-FEC-PROCESO   TO  WS-LIBFEC-FECHAIN.                                
237300  MOVE ZEROS            TO  WS-LIBFEC-FECHAOUT.                               
237400  MOVE 65               TO  W77-LIBFEC-CVESEM.                                
237500  MOVE 01               TO  W77-LIBFEC-CVEFEST.                               
237600  COMPUTE  W77-LIBFEC-INCREM = (WS-GEN-DIAS-RESP) * ( -1 ).                   
237700  PERFORM   90021000-PROYECTA-FECHA-HAB2K.                                    
237800  MOVE WS-LIBFEC-FECHAOUT TO  WS-FEC-PROYECTADA.                              
237900  IF WS-CAMPO-FECHAB10     >   WS-FEC-PROYECTADA                              
238000     MOVE  1               TO   WS-ABORT-DEP.                                 
238100                                                                              
238200                                                                              
238300***=========================================                                  
238400 90000-VALIDA-REGARCHIVO.                                                     
238500***=========================================                                  
238600                                                                              
238700     MOVE   WS-GEN-SEC     TO WS-CAMPO-SECB10.                                
238800                                                                              
238900  PERFORM 11000-FINDF-B08.                                                    
239000                                                                              
239100  IF WS-EXISTE-B08 = 1                                                        
239200     MOVE B08P-ESTATUS   TO  WS-B08P-ESTATUS                                  
239300     IF WS88-B08-EST-DEP                                                      
239400        NEXT SENTENCE                                                         
239500     ELSE                                                                     
239600        MOVE 1    TO  WS-ABORT-DEP.                                           
239700                                                                              
239800                                                                              
239900                                                                              
240000                                                                              
240100***=========================================                                  
240200 11000-FINDF-B08.                                                             
240300***=========================================                                  
240400   MOVE 1  TO  WS-EXISTE-B08.                                                 
240500   FIND FIRST  B08PSXFECSISCTESQ              AT                              
240600        B08P-FEC-PROC   = WS-CAMPO-FECHAB10  AND                              
240700        B08P-SIST-CTE   = WS-GEN-SISTEMAB10  AND                              
240800        B08P-TIPO       = WS-GEN-TIPOB10     AND                              
240900        B08P-SECUENCIAL = WS-CAMPO-SECB10    AND                              
241000        B08P-NODO       = WS-GEN-NODOB10                                      
241100        ON EXCEPTION                                                          
241200            MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE                       
241300                                                                              
241400  IF  WS-STATUS-BASE > 0                                                      
241500      MOVE 0    TO  WS-EXISTE-B08.                                            
241600                                                                              
241700                                                                              
241800                                                                              
241900***=========================================                                  
242000 90000-ENVIA-DEPURACION-ARCH.                                                 
242100***=========================================                                  
242150  IF WS-FLGPDIR = 0  OR WS-POS-FIN > 66                                       
242200   MOVE "REM"         TO     WKS-WFL-PARAMETRO1                               
242300   MOVE  ZEROS        TO     WKS-WFL-PARAMETRO2                               
242400   MOVE  ZEROS        TO     WKS-WFL-PARAMETRO3                               
242500   MOVE  WS-GEN-NOM   TO     WKS-WFL-PARAMETRO4                               
242600   CALL  SYSTEM WFL   USING  WKS-WFL-NOM-INICIA                               
242700  ELSE                                                                        
242720     ADD 1 TO IND-FILE                                                        
242730     MOVE WS-GEN-NOM TO WS-GEN-NOM2                                           
242740     STRING "REMOVE ", WS-GEN-NOM2, @0D@                                      
242760          DELIMITED BY SIZE INTO FILENAM(IND-FILE).                           
242800                                                                              
242900   IF WS-IDE-ARCH-DEPURADOS = 1                                               
243000      PERFORM 90000-ESCRIBE-DEPURADOSTEM.                                     
243100                                                                              
243200                                                                              
243300                                                                              
243400***=========================================                                  
243500 90000-ESCRIBE-DEPURADOSTEM.                                                  
243600***=========================================                                  
243700   MOVE  WS-GEN-NOM    TO   REG-DEPTEM-NOM.                                   
243800   WRITE REG-DEPTEM.                                                          
243900                                                                              
244000                                                                              
244100***=========================================                                  
244200 80000-CIERRA-ARCHIVODIR.                                                     
244300***=========================================                                  
244400   CLOSE  FILE-CONSULTA      WITH SAVE.                                       
244500   MOVE   WS-GEN-NOM         TO   WS-GEN-NOM-AUX                              
244600   MOVE   WS-NOM-CONSULTA-N  TO   WS-GEN-NOM.                                 
244700   MOVE   2                  TO   WS-IDE-ARCH-DEPURADOS.                      
244800   PERFORM 90000-ENVIA-DEPURACION-ARCH.                                       
244900   MOVE   WS-GEN-NOM-AUX     TO   WS-GEN-NOM.                                 
245000                                                                              
245100                                                                              
245200***=========================================                                  
245300 20000-PROC-VAL-ARCDEPURADOS.                                                 
245400***=========================================                                  
245402   WAIT (300).                                                                
245500   MOVE 1       TO  WS-EXISTE-REGTDEP.                                        
245600   OPEN INPUT       FILE-DEPTEM                                               
245700                                                                              
245800                                                                              
245900   PERFORM 30000-PROCESA-DEPURADOS UNTIL                                      
246000                                   NOT WS88-EXISTE-REGTDEP.                   
246100   CLOSE FILE-DEPURADOS WITH SAVE.                                            
246200                                                                              
246300***=========================================                                  
246400 30000-PROCESA-DEPURADOS.                                                     
246500***=========================================                                  
246600   PERFORM 30000-LEE-ARCTEMDEP.                                               
246700   IF NOT WS88-EXISTE-REGTDEP                                                 
246702      MOVE   9              TO  REG-DEPURADOS-ID                              
246704      MOVE  SPACES          TO  WS-CAMPO-VAL-NOM                              
246706      MOVE "FIN DE ARCHIVO" TO  WS-CAMPO-VAL-NOM                              
246708      PERFORM 40000-ESCRIBE-ARCHDEP                                           
246800      EXIT PERFORM.                                                           
246900                                                                              
247000   MOVE SPACES         TO  WS-CAMPO-VAL-NOM.                                  
247100   MOVE REG-DEPTEM-NOM TO  WS-CAMPO-VAL-NOM.                                  
247200   MOVE ZERO           TO  WS-TER-NOM  WS-IND-FILED.                          
247300   MOVE 03             TO REG-DEPURADOS-ID.                                   
247400                                                                              
247500   PERFORM 40000-VALIDAFIN-ARCH VARYING                                       
247600   W77-INX FROM 1 BY 1 UNTIL (W77-INX > 75).                                  
247700   PERFORM 40000-VALIDA-ARCH-RES.                                             
247800   IF WS-HAY-ARCHIVO = 0                                                      
247900      PERFORM 40000-ESCRIBE-ARCHDEP.                                          
248000                                                                              
248100                                                                              
248200                                                                              
248300***=========================================                                  
248400 40000-VALIDAFIN-ARCH.                                                        
248500***=========================================                                  
248600  IF WS-IND-FILED = 0                                                         
248700    IF WS88-CAR-ESP (W77-INX)                                                 
248800       MOVE "."    TO WS-CAR-VN(W77-INX)                                      
248900       MOVE 1      TO WS-IND-FILED                                            
249000       EXIT PERFORM.                                                          
249100                                                                              
249200  IF WS-IND-FILED = 1                                                         
249300    MOVE SPACE   TO WS-CAR-VN(W77-INX).                                       
249400                                                                              
249500                                                                              
249600                                                                              
249700                                                                              
249800***=========================================                                  
249900 40000-VALIDA-ARCH-RES.                                                       
250000***=========================================                                  
250100   MOVE   0  TO WS-HAY-ARCHIVO.                                               
250200   CHANGE ATTRIBUTE TITLE OF  FILE-VALDEP                                     
250300                           TO  WS-CAMPO-VAL-NOM.                              
250400                                                                              
250500   IF ATTRIBUTE RESIDENT   OF  FILE-VALDEP = VALUE TRUE                       
250600       MOVE   1  TO WS-HAY-ARCHIVO.                                           
250700                                                                              
250800                                                                              
250900***=========================================                                  
251000 40000-ESCRIBE-ARCHDEP.                                                       
251100***=========================================                                  
251200                                                                              
251300    MOVE WS-CAMPO-VAL-NOM   TO REG-DEPURADOS-DES.                             
251400    WRITE REG-DEPURADOS.                                                      
251500                                                                              
251600                                                                              
251700                                                                              
251800***=========================================                                  
251900 30000-LEE-ARCTEMDEP.                                                         
252000***=========================================                                  
252100    READ FILE-DEPTEM                                                          
252200         AT END                                                               
252300            MOVE 0  TO WS-EXISTE-REGTDEP.                                     
252400                                                                              
252500                                                                              
252600***=========================================                                  
252700  90000-VALIDA-NOMBREDEP.                                                     
252800***=========================================                                  
252900***** VALIDA QUE EL NOMBRE NO CONTENGA PALABRA RESERVADA                      
253000   MOVE   ZEROS   TO   WSI-DD-CONTN.                                          
253100   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "SOURCE".                 
253200   IF WSI-DD-CONTN > 0                                                        
253300      MOVE  2     TO  WS-REG-DEPURABLE                                        
253400      EXIT PERFORM.                                                           
253500                                                                              
253600                                                                              
253700   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "OBJECT".                 
253800   IF WSI-DD-CONTN > 0                                                        
253900      MOVE  2     TO  WS-REG-DEPURABLE                                        
254000      EXIT PERFORM.                                                           
254100                                                                              
254200                                                                              
254300   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
254400                                            FOR ALL "/WFL/".                  
254500   IF WSI-DD-CONTN > 0                                                        
254600      MOVE  2     TO  WS-REG-DEPURABLE                                        
254700      EXIT PERFORM.                                                           
254800                                                                              
254900                                                                              
255000   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "DASDL".                  
255100   IF WSI-DD-CONTN > 0                                                        
255200      MOVE  2     TO  WS-REG-DEPURABLE                                        
255300      EXIT PERFORM.                                                           
255400                                                                              
255500                                                                              
255600   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
255700                                            FOR ALL "LOADCOMS".               
255800   IF WSI-DD-CONTN > 0                                                        
255900      MOVE  2     TO  WS-REG-DEPURABLE                                        
256000      EXIT PERFORM.                                                           
256100                                                                              
256200                                                                              
256300   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "SECAS".                  
256400   IF WSI-DD-CONTN > 0                                                        
256500      MOVE  2     TO  WS-REG-DEPURABLE                                        
256600      EXIT PERFORM.                                                           
256700                                                                              
256800                                                                              
256900   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
257000                                            FOR ALL "INCLUDE".                
257100   IF WSI-DD-CONTN > 0                                                        
257200      MOVE  2     TO  WS-REG-DEPURABLE                                        
257300      EXIT PERFORM.                                                           
257400                                                                              
257500   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
257600                                         FOR ALL "DESCRIPTION".               
257700   IF WSI-DD-CONTN > 0                                                        
257800      MOVE  2     TO  WS-REG-DEPURABLE                                        
257900      EXIT PERFORM.                                                           
258000                                                                              
258100                                                                              
258200                                                                              
258300   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
258400                                            FOR ALL "TASKFILE".               
258500   IF WSI-DD-CONTN > 0                                                        
258600      MOVE  2     TO  WS-REG-DEPURABLE                                        
258700      EXIT PERFORM.                                                           
258800                                                                              
258900                                                                              
259000   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
259100                                            FOR ALL "LOADCFILE".              
259200   IF WSI-DD-CONTN > 0                                                        
259300      MOVE  2     TO  WS-REG-DEPURABLE                                        
259400      EXIT PERFORM.                                                           
259500                                                                              
259600                                                                              
259700   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
259800                                           FOR ALL "UNLOADFILE".              
259900   IF WSI-DD-CONTN > 0                                                        
260000      MOVE  2     TO  WS-REG-DEPURABLE                                        
260100      EXIT PERFORM.                                                           
260200                                                                              
260300                                                                              
260400   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "/INC/".                  
260500   IF WSI-DD-CONTN > 0                                                        
260600      MOVE  2     TO  WS-REG-DEPURABLE                                        
260700      EXIT PERFORM.                                                           
260800                                                                              
260900                                                                              
261000   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN FOR ALL "JOB".                    
261100   IF WSI-DD-CONTN > 0                                                        
261200      MOVE  2     TO  WS-REG-DEPURABLE                                        
261300      EXIT PERFORM.                                                           
261400                                                                              
261500                                                                              
261600   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
261700                                            FOR ALL "VERSIONES".              
261800   IF WSI-DD-CONTN > 0                                                        
261900      MOVE  2     TO  WS-REG-DEPURABLE                                        
262000      EXIT PERFORM.                                                           
262100                                                                              
262200                                                                              
262300   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
262400                                            FOR ALL "ROLLBACK".               
262500   IF WSI-DD-CONTN > 0                                                        
262600      MOVE  2     TO  WS-REG-DEPURABLE                                        
262700      EXIT PERFORM.                                                           
262800                                                                              
262900                                                                              
263000   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
263100                                            FOR ALL "GUARDFILE".              
263200   IF WSI-DD-CONTN > 0                                                        
263300      MOVE  2     TO  WS-REG-DEPURABLE                                        
263400      EXIT PERFORM.                                                           
263500                                                                              
263600                                                                              
263700   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
263800                                            FOR ALL "=".                      
263900   IF WSI-DD-CONTN > 0                                                        
264000      MOVE  2     TO  WS-REG-DEPURABLE                                        
264100      EXIT PERFORM.                                                           
264200                                                                              
264300                                                                              
264400  INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                    
264500                                           FOR ALL "BOL/".                    
264600  IF WSI-DD-CONTN > 0                                                         
264700     MOVE  2     TO  WS-REG-DEPURABLE                                         
264800     EXIT PERFORM.                                                            
264900                                                                              
265000                                                                              
265100  INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                    
265200                                           FOR ALL "LIST".                    
265300  IF WSI-DD-CONTN > 0                                                         
265400     MOVE  2     TO  WS-REG-DEPURABLE                                         
265500     EXIT PERFORM.                                                            
265600                                                                              
265700                                                                              
265800   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
265900                                            FOR ALL "BD".                     
266000   IF WSI-DD-CONTN > 0                                                        
266100      MOVE  2     TO  WS-REG-DEPURABLE                                        
266200      EXIT PERFORM.                                                           
266300                                                                              
266400                                                                              
266500   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
266600                                            FOR ALL "MATCH".                  
266700   IF WSI-DD-CONTN > 0                                                        
266800      MOVE  2     TO  WS-REG-DEPURABLE                                        
266900      EXIT PERFORM.                                                           
267000                                                                              
267100                                                                              
267200   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
267300                                            FOR ALL "/LOG/".                  
267400   IF WSI-DD-CONTN > 0                                                        
267500      MOVE  2     TO  WS-REG-DEPURABLE                                        
267600      EXIT PERFORM.                                                           
267700                                                                              
267800                                                                              
267900   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
268000                                            FOR ALL "DMSUPPORT".              
268100   IF WSI-DD-CONTN > 0                                                        
268200      MOVE  2     TO  WS-REG-DEPURABLE                                        
268300      EXIT PERFORM.                                                           
268400                                                                              
268500                                                                              
268600   INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                   
268700                                            FOR ALL "RECONSTRUCT".            
268800   IF WSI-DD-CONTN > 0                                                        
268900      MOVE  2     TO  WS-REG-DEPURABLE                                        
269000      EXIT PERFORM.                                                           
269100                                                                              
269200                                                                              
269300 INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                     
269400                                          FOR ALL "SENDTOCOMS".               
269500 IF WSI-DD-CONTN > 0                                                          
269600    MOVE  2     TO  WS-REG-DEPURABLE                                          
269700    EXIT PERFORM.                                                             
269800                                                                              
269900                                                                              
270000 INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                     
270100                                          FOR ALL "CONTROL".                  
270200 IF WSI-DD-CONTN > 0                                                          
270300    MOVE  2     TO  WS-REG-DEPURABLE                                          
270400    EXIT PERFORM.                                                             
270500                                                                              
270502 INSPECT WS-GEN-NOM TALLYING WSI-DD-CONTN                                     
270504                                          FOR ALL "UTILITY".                  
270506 IF WSI-DD-CONTN > 0                                                          
270508    MOVE  2     TO  WS-REG-DEPURABLE                                          
270510    EXIT PERFORM.                                                             
270600                                                                              
270700***** VALIDA EN EL NOMBRE:                                                    
270800***** SI HAY MINUSCULAS, MAS DE UNA PALABRA, INICIA EN ESPACIO                
270900  MOVE     SPACES            TO  WS-NOMBRE-VALIDADO.                          
271000  MOVE     WS-GEN-NOM        TO  WS-NOMBRE-VALIDADO.                          
271100  MOVE     ZEROS             TO  WS-ERR-VAL-NOM                               
271200                                 WS-CONT-PALABRA.                             
271300  PERFORM 60000-PROCESA-VALIDACION-NOM  VARYING                               
271400           W77-INX FROM 1 BY 1 UNTIL                                          
271500           (W77-INX > 75) OR (WS-ERR-VAL-NOM = 1).                            
271600                                                                              
271700  IF WS-ERR-VAL-NOM = 1                                                       
271800     MOVE  2     TO  WS-REG-DEPURABLE.                                        
271900                                                                              
272000                                                                              
272002***=========================================                                  
272004 6000-GRABASEC-PDIR.                                                          
272006***=========================================                                  
272008   MOVE 0              TO WS-STATUS-BASE  WS-STATUS-BASE-ANT.                 
272010   PERFORM 70000-BEGIN-TRANSACTION                                            
272012   PERFORM 70000-LOCK-B010                                                    
272014   IF WS-STATUS-BASE = 0                                                      
272016      MOVE   WS10P-SEC-DIR  TO  B10P-SEC-DIR                                  
272018      PERFORM 70000-STORE-B010                                                
272020      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT                            
272022   ELSE                                                                       
272024      MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT.                           
272026                                                                              
272028   MOVE 0                TO  WS-STATUS-BASE.                                  
272030   PERFORM 70000-END-TRANSACTION.                                             
272032                                                                              
272034   IF WS-STATUS-BASE-ANT > 0                                                  
272036      MOVE     0001                 TO  WS-COD-ERROR                          
272038      MOVE     WS-STATUS-BASE-ANT   TO  ERROR-0001-02                         
272040      PERFORM  40000-ESCRIBE-PROBLEMA                                         
272042      MOVE     0007                 TO  WS-COD-ERROR                          
272044      MOVE     WS-GEN-NOM           TO  ERROR-0007-02                         
272046      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
272048                                                                              
272200***=========================================                                  
272300 60000-PROCESA-VALIDACION-NOM.                                                
272400***=========================================                                  
272500    COMPUTE W77-INX2 = W77-INX - 1.                                           
272600                                                                              
272700    IF W77-INX = 1                                                            
272800       IF WS88-NOMVAL-ESP (1)                                                 
272900       MOVE   1  TO  WS-ERR-VAL-NOM                                           
273000       ELSE                                                                   
273100          ADD    1  TO WS-CONT-PALABRA.                                       
273200                                                                              
273300                                                                              
273400    IF (W77-INX > 1)                            AND                           
273500       (WS-NOMBRE-VAL(W77-INX) NOT = SPACES )   AND                           
273600       (WS88-NOMVAL-ESP(W77-INX2)           )                                 
273700       ADD 1  TO WS-CONT-PALABRA.                                             
273800                                                                              
273900    IF WS-CONT-PALABRA > 1                                                    
274000       MOVE   1  TO  WS-ERR-VAL-NOM.                                          
274100                                                                              
274200    IF WS88-NOMVAL-CARINV (W77-INX)                                           
274300       MOVE   1  TO  WS-ERR-VAL-NOM.                                          
274400                                                                              
274484                                                                              
274500                                                                              
274600***=========================================                                  
274700 70000-VALIDA-USO-ARCHIVO.                                                    
274800***=========================================                                  
274900    MOVE WS-GEN-NOM  TO   WS-CAMPO-VALUSO-NOM                                 
275000    PERFORM  80000-ENCUENTRA-FIN  VARYING                                     
275100    W77-INX FROM 1 BY 1 UNTIL (W77-INX > 75).                                 
275200                                                                              
275300    CHANGE ATTRIBUTE NEWFILE   OF  FILE-VALUSO TO VALUE FALSE                 
275400    CHANGE ATTRIBUTE TITLE     OF  FILE-VALUSO                                
275500                               TO  WS-CAMPO-VALUSO-NOM.                       
275600    CHANGE ATTRIBUTE EXCLUSIVE OF FILE-VALUSO                                 
275700                               TO VALUE TRUE.                                 
275800                                                                              
275900                                                                              
276000                                                                              
276100    IF ATTRIBUTE AVAILABLE OF FILE-VALUSO = VALUE TRUE                        
276200       CLOSE FILE-VALUSO WITH SAVE                                            
276300    ELSE                                                                      
276400       MOVE  1   TO  WS-ABORT-DEP.                                            
276500                                                                              
276600                                                                              
276700                                                                              
276800***=========================================                                  
276900 80000-ENCUENTRA-FIN.                                                         
277000***=========================================                                  
277100    IF WS88-CARUSO-ESP (W77-INX)                                              
277200       MOVE "."    TO WS-CAR-VALUSO(W77-INX)                                  
277300       MOVE 76     TO W77-INX.                                                
277302                                                                              
277304  IF  W77-INX  = 11                                                           
277306    IF  WS-CAR-VALUSO (W77-INX) = "I"                                         
277308    AND WS-CAR-VALUSO (12) = "N"                                              
277310    AND WS-CAR-VALUSO (13) = "T"                                              
277312    AND WS-CAR-VALUSO (14) = "S"                                              
277314    AND WS-CAR-VALUSO (21) = "E"                                              
277316      MOVE                    1 TO WKS-ELIM-APLXDISP                          
277318      MOVE  WS-CAMPO-VALUSO-NOM TO WKS-NOMBRE-APLXDISP.                       
277400                                                                              
277500                                                                              
277600                                                                              
277700***=========================================                                  
277800 40000-ESCRIBE-PROBLEMA.                                                      
277900***=========================================                                  
278000   MOVE  LOW-VALUES                      TO  REG-DEPURADOS.                   
278100   MOVE  WS-TBL-ERROR-CON (WS-COD-ERROR) TO  REG-DEPURADOS-DES.               
278200   MOVE  02                              TO  REG-DEPURADOS-ID.                
278300   WRITE REG-DEPURADOS.                                                       
278400                                                                              
278500                                                                              
278600***=========================================                                  
278700 5000-LIMPIA-ERRORES.                                                         
278800***=========================================                                  
278900    MOVE   SPACES      TO    ERROR-0004-02                                    
279000                             ERROR-0005-02                                    
279100                             ERROR-0007-02.                                   
279200                                                                              
279300                                                                              
279400***=========================================                                  
279500 20000-PROCESO-MIGRAB07.                                                      
279600***=========================================                                  
279700   MOVE  SPACES           TO   WS-CAMPO-VAL-NOM.                              
279800   MOVE  "S500/FILE/BANDERA/MOVEB07TOB10." TO                                 
279900                               WS-CAMPO-VAL-NOM.                              
280000                                                                              
280100   CHANGE ATTRIBUTE TITLE OF   FILE-VALDEP                                    
280200                          TO   WS-CAMPO-VAL-NOM.                              
280300                                                                              
280400   IF ATTRIBUTE RESIDENT  OF   FILE-VALDEP = VALUE TRUE                       
280500      PERFORM 30000-PROCESA-MIGRAB07.                                         
280600                                                                              
280700   MOVE  SPACES           TO   WS-CAMPO-VAL-NOM    WS-GEN-NOM.                
280800                                                                              
280900                                                                              
281000***=========================================                                  
281100 30000-PROCESA-MIGRAB07.                                                      
281200***=========================================                                  
281300    MOVE   ZEROS     TO   WS-NOTFOUND-B07.                                    
281400    PERFORM 40000-FF-B07.                                                     
281500    IF WS-NOTFOUND-B07 = 0                                                    
281600       PERFORM 50000-MIGRAB07-TO-B10 UNTIL WS-NOTFOUND-B07  = 1               
281700       MOVE   SPACES             TO   WS-GEN-NOM                              
281800       MOVE  "S500/FILE/BANDERA/MOVEB07TOB10"                                 
281900                                 TO   WS-GEN-NOM                              
282000       MOVE   2                  TO   WS-IDE-ARCH-DEPURADOS                   
282100       PERFORM 90000-ENVIA-DEPURACION-ARCH.                                   
282200                                                                              
282300                                                                              
282400                                                                              
282500***=========================================                                  
282600 40000-FF-B07.                                                                
282700***=========================================                                  
282800    FIND FIRST S500B07PARCHIVOS                                               
282900       ON EXCEPTION                                                           
283000          MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                        
283100                                                                              
283200    IF WS-STATUS-BASE > 0                                                     
283300       MOVE     1                TO  WS-NOTFOUND-B07                          
283400       MOVE     0001             TO  WS-COD-ERROR                             
283500       MOVE     WS-STATUS-BASE   TO  ERROR-0001-02                            
283600       PERFORM  40000-ESCRIBE-PROBLEMA                                        
283700       MOVE     0008             TO  WS-COD-ERROR                             
283800       PERFORM  40000-ESCRIBE-PROBLEMA.                                       
283900                                                                              
284000                                                                              
284100                                                                              
284200***=========================================                                  
284300  50000-MIGRAB07-TO-B10.                                                      
284400***=========================================                                  
284500    MOVE   LOW-VALUES             TO  WS10-NOMBRE-SIS                         
284600                                      WS10-NOMBREAPP-SIS                      
284700                                      WS10-NOMBREERR-SIS                      
284800                                      WS10-NOMBRESAL-SIS                      
284900                                      WS10-NOMBRE-BUZON                       
285000                                      WS10-NOMBRE-NODO                        
285100                                      WS10-NOMBRE-CTE                         
285200                                      WS10-NOMBRE-SEC                         
285300                                      WS10-NOMBREAPP-BUZON                    
285400                                      WS10-NOMBREAPP-NODO                     
285500                                      WS10-NOMBREAPP-CTE                      
285600                                      WS10-NOMBREAPP-SEC                      
285700                                      WS10-NOMBREERR-BUZON                    
285800                                      WS10-NOMBREERR-NODO                     
285900                                      WS10-NOMBREERR-CTE                      
286000                                      WS10-NOMBREERR-SEC                      
286100                                      WS10-NOMBRESAL-BUZON                    
286200                                      WS10-NOMBRESAL-NODO                     
286300                                      WS10-NOMBRESAL-CTE                      
286400                                      WS10-NOMBRESAL-SEC                      
286500                                      WS10-RESTO-CAMPOS.                      
286600                                                                              
286700    MOVE   B07P-SISTEMA           TO  WS10-NOMBRE-SIS                         
286800                                      WS10-NOMBREAPP-SIS                      
286900                                      WS10-NOMBREERR-SIS                      
287000                                      WS10-NOMBRESAL-SIS.                     
287100                                                                              
287200    MOVE   B07P-BUZON             TO  WS10-NOMBRE-BUZON                       
287300                                      WS10-NOMBREAPP-BUZON                    
287400                                      WS10-NOMBREERR-BUZON                    
287500                                      WS10-NOMBRESAL-BUZON.                   
287600                                                                              
287700                                                                              
287800    MOVE   B07P-NODO              TO  WS10-NOMBRE-NODO                        
287900                                      WS10-NOMBREAPP-NODO                     
288000                                      WS10-NOMBREERR-NODO                     
288100                                      WS10-NOMBRESAL-NODO.                    
288200                                                                              
288300    MOVE   B07P-SIST-CTE          TO  WS10-NOMBRE-CTE                         
288400                                      WS10-NOMBREAPP-CTE                      
288500                                      WS10-NOMBREERR-CTE                      
288600                                      WS10-NOMBRESAL-CTE.                     
288700                                                                              
288800    MOVE   B07P-SECUENCIAL        TO  WS10-NOMBRE-SEC                         
288900                                      WS10-NOMBREAPP-SEC                      
289000                                      WS10-NOMBREERR-SEC                      
289100                                      WS10-NOMBRESAL-SEC.                     
289200                                                                              
289300    MOVE   B07P-TIPO              TO  WS10-TIPO.                              
289400    MOVE   B07P-NUM-DIA-RESP      TO  WS10-DIAS-RESP.                         
289500    IF     WS10-DIAS-RESP = 0                                                 
289600           MOVE        7          TO  WS10-DIAS-RESP.                         
289700                                                                              
289800   MOVE    WS10-NOMBRE-ARCHIVO    TO  WS10-NOMBRE-ARC.                        
289900   MOVE    0                      TO  WS-STATUS-BASE.                         
290000                                                                              
290100   PERFORM  70000-BEGIN-TRANSACTION.                                          
290200   IF  WS-STATUS-BASE = 0                                                     
290300       PERFORM  60000-GRABA-REGB10A                                           
290400                                                                              
290500       MOVE     SPACES               TO  WS10-NOMBRE-ARC                      
290600       MOVE     WS10-NOMBRE-ARCAPP   TO  WS10-NOMBRE-ARC                      
290700       PERFORM  60000-GRABA-REGB10A                                           
290800                                                                              
290900       MOVE     SPACES               TO  WS10-NOMBRE-ARC                      
291000       MOVE     WS10-NOMBRE-ARCERR   TO  WS10-NOMBRE-ARC                      
291100       PERFORM  60000-GRABA-REGB10A                                           
291200                                                                              
291300       MOVE     SPACES               TO  WS10-NOMBRE-ARC                      
291400       MOVE     WS10-NOMBRE-ARSAL    TO  WS10-NOMBRE-ARC                      
291500       PERFORM  60000-GRABA-REGB10A                                           
291600       PERFORM  60000-CIERRA-TRANS.                                           
291700                                                                              
291800   IF WS-STATUS-BASE > 0                                                      
291900      MOVE     0001                 TO  WS-COD-ERROR                          
292000      MOVE     WS-STATUS-BASE       TO  ERROR-0001-02                         
292100      PERFORM  40000-ESCRIBE-PROBLEMA                                         
292200      MOVE     0007                 TO  WS-COD-ERROR                          
292300      MOVE     WS10-NOMBRE-ARC      TO  ERROR-0007-02                         
292400      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
292500                                                                              
292600   PERFORM  40000-FN-B07.                                                     
292700                                                                              
292800                                                                              
292900***=========================================                                  
293000 60000-GRABA-REGB10A.                                                         
293100***=========================================                                  
293200   MOVE 0                TO  WS-STATUS-BASE.                                  
293300   IF   WS-STATUS-BASE = 0                                                    
293400        PERFORM 70000-CRATE-B010                                              
293500        IF  WS-STATUS-BASE = 0                                                
293600            PERFORM 70000-AMUEBLA-B10A                                        
293700            PERFORM 70000-STORE-B010.                                         
293800                                                                              
293900                                                                              
294000   IF WS-STATUS-BASE > 0                                                      
294100      MOVE     0001                 TO  WS-COD-ERROR                          
294200      MOVE     WS-STATUS-BASE       TO  ERROR-0001-02                         
294300      PERFORM  40000-ESCRIBE-PROBLEMA                                         
294400      MOVE     0007                 TO  WS-COD-ERROR                          
294500      MOVE     WS10-NOMBRE-ARC      TO  ERROR-0007-02                         
294600      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
294700                                                                              
294800                                                                              
294900***=========================================                                  
295000 60000-CIERRA-TRANS.                                                          
295100***=========================================                                  
295200    MOVE WS-STATUS-BASE   TO  WS-STATUS-BASE-ANT.                             
295300    MOVE 0                TO  WS-STATUS-BASE.                                 
295400    PERFORM 70000-END-TRANSACTION.                                            
295500                                                                              
295600                                                                              
295700    IF WS-STATUS-BASE-ANT > 0                                                 
295800      MOVE     0001                 TO  WS-COD-ERROR                          
295900      MOVE     WS-STATUS-BASE-ANT   TO  ERROR-0001-02                         
296000      PERFORM  40000-ESCRIBE-PROBLEMA                                         
296100      MOVE     0007                 TO  WS-COD-ERROR                          
296200      MOVE     WS10-NOMBRE-ARC      TO  ERROR-0007-02                         
296300      PERFORM  40000-ESCRIBE-PROBLEMA.                                        
296400                                                                              
296500                                                                              
296600***=========================================                                  
296700  70000-CRATE-B010.                                                           
296800***=========================================                                  
296900   CREATE S500B10PDEPURA                                                      
297000          ON EXCEPTION                                                        
297100             MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                     
297200                                                                              
297300                                                                              
297400***=========================================                                  
297500  70000-AMUEBLA-B10A.                                                         
297600***=========================================                                  
297700   MOVE LOW-VALUES             TO  S500B10PDEPURA                             
297800   MOVE  WS10-NOMBRE-ARC       TO  B10P-NOMBRE-ARC.                           
297900   MOVE  WS10-NOMBRE-SEC       TO  B10P-SECUENCIAL.                           
298000   MOVE  WS10-VALIDAB08        TO  B10P-VALIDAB08.                            
298100   MOVE  WS10-DEPUR-ACT        TO  B10P-DEPUR-ACT.                            
298200   MOVE  WS10-IDE-DEPURACION   TO  B10P-IDE-DEPURACION.                       
298300   MOVE  WS10-NOMBRE-CTE       TO  B10P-SISTEMA-CTE.                          
298400   MOVE  WS10-NOMBRE-NODO      TO  B10P-NODO.                                 
298500   MOVE  WS10-TIPO             TO  B10P-TIPO.                                 
298600   MOVE  WS10-DIAS-RESP        TO  B10P-DIAS-RESPALDO.                        
298700   MOVE  WS-FEC-PROCESO        TO  B10P-FEC-MODIF.                            
298800   MOVE  ZEROS                 TO  B10P-FEC-ULTDEP.                           
298900                                                                              
299000                                                                              
299100***=========================================                                  
299200  40000-FN-B07.                                                               
299300***=========================================                                  
299400   FIND NEXT S500B07PARCHIVOS                                                 
299500      ON EXCEPTION                                                            
299600         MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                         
299700                                                                              
299800   IF WS-STATUS-BASE > 0                                                      
299900      MOVE     1                TO  WS-NOTFOUND-B07                           
300000      IF  WS-DB-NOTFOUND                                                      
300100          NEXT SENTENCE                                                       
300200      ELSE                                                                    
300300          MOVE     0001                 TO WS-COD-ERROR                       
300400          MOVE     WS-STATUS-BASE       TO ERROR-0001-02                      
300500          PERFORM  40000-ESCRIBE-PROBLEMA                                     
300600          MOVE     0009                 TO WS-COD-ERROR                       
300700          PERFORM  40000-ESCRIBE-PROBLEMA.                                    
300800                                                                              
300900                                                                              
301000***=========================================                                  
301100 20000-CIERRA-BDCAPTACION.                                                    
301200***=========================================                                  
301300  CLOSE S500BD01CAPTACION                                                     
301400  ON EXCEPTION                                                                
301500      CALL SYSTEM DMTERMINATE.                                                
301600                                                                              
301700***=========================================                                  
301800 10000-CIERRABD-TARJETAS.                                                     
301900***=========================================                                  
302000  CLOSE S500BD04TARJETAS                                                      
302100  ON EXCEPTION                                                                
302200      CALL SYSTEM DMTERMINATE.                                                
302300                                                                              
302400                                                                              
302500***=========================================                                  
302600 2000000-CTLVERS-TITBATCH.                                                    
302700***=========================================                                  
302800    CALL "DAME_TIT IN CTLVERS"                                                
302900         USING      S000-CTR-LIBID                                            
303000                    S000-CTR-NOMLIB                                           
303100         GIVING     S000-CTR-CVEERROR.                                        
303200                                                                              
303300***=========================================                                  
303400 10000-ENVIO-ARCDEPURACION.                                                   
303500***=========================================                                  
303600   MOVE SPACES                   TO WS-ARCH-SDOS.                             
303700   MOVE ZEROS                    TO WS77-INTELAR-RESULT.                      
303800   MOVE WS-NOM-DEPURADOS         TO WS-ARCH-SDOS.                             
303900   CALL "INTELARSND IN ADMONXFERS"                                            
304000                              USING WS-ARCH-SDOS                              
304100                             GIVING WS77-INTELAR-RESULT.                      
304200                                                                              
304300   IF WS77-INTELAR-RESULT NOT = 0                                             
304400      WAIT (10)                                                               
304500      MOVE SPACES                TO WS-ARCH-SDOS                              
304600      MOVE ZEROS                 TO WS77-INTELAR-RESULT                       
304700      MOVE WS-NOM-DEPURADOS      TO WS-ARCH-SDOS                              
304800      CALL "INTELARSND IN ADMONXFERS"                                         
304900                              USING WS-ARCH-SDOS                              
305000                              GIVING WS77-INTELAR-RESULT.                     
305100                                                                              
305200  IF WS77-INTELAR-RESULT NOT = 0                                              
305300     MOVE "ERROR AL ENVIAR ARCHIVO DE DEPURACION A INTELAR"                   
305400                              TO WS-0101-TEXT-MSG                             
305500     PERFORM 70000050-MENSAJE.                                                
305600*INI C DYR                                                                    
305700****************************************************************              
305800 6000-INIBATCHP020.                                                           
305900     PERFORM 20000501-INIBATCHP020-CALL.                                      
306000     IF WS-L010-RESULT > 0                                                    
306100        MOVE "ERROR EN LLAMADO INIBATCHP020" TO                               
306200              WS-RECHAZO                                                      
306300        PERFORM  6000-DESPLIEGA-ERROR.                                        
306400                                                                              
306500****************************************************************              
306600 7000-CARGACATP020.                                                           
306700     PERFORM 20000502-CARGACATP020-CALL.                                      
306800     IF WS-L010-RESULT > 0                                                    
306900        MOVE "ERROR EN LLAMADO S500L010CARGACATP020" TO                       
307000              WS-RECHAZO                                                      
307100        PERFORM  6000-DESPLIEGA-ERROR.                                        
307200                                                                              
307300****************************************************************              
307400 3550-INI-LINEA-P020.                                                         
307500     PERFORM 20000503-INILINEA-P020-CALL                                      
307600     IF WS-L010-RESULT > 0                                                    
307700        MOVE "ERROR EN LLAMADO INILINEAP020" TO                               
307800              WS-RECHAZO                                                      
307900        PERFORM  6000-DESPLIEGA-ERROR.                                        
308000*FIN C DYR                                                                    
308100                                                                              
308200***=========================================                                  
308300 90000-ELIARCH-APLXDISP.                                                      
308400***=========================================                                  
308500    MOVE WKS-NOMAPL-SIS  TO  WKS-NOMAPP-SIS   WKS-NOMINTX-SIS.                
308600    MOVE WKS-NOMAPL-BUZ  TO  WKS-NOMAPP-BUZ   WKS-NOMINTX-BUZ.                
308700    MOVE WKS-NOMAPL-NOD  TO  WKS-NOMAPP-NOD   WKS-NOMINTX-NOD.                
308800    MOVE WKS-NOMAPL-FEC  TO  WKS-NOMAPP-FEC   WKS-NOMINTX-FEC.                
308900    MOVE WKS-NOMAPL-CLI  TO  WKS-NOMAPP-CLI   WKS-NOMINTX-CLI.                
309000    MOVE WKS-NOMAPL-SEC  TO  WKS-NOMAPP-SEC   WKS-NOMINTX-SEC.                
309100    MOVE "INTE"          TO  WKS-NOMINTX-TP.                                  
309200    MOVE "APP"           TO  WKS-NOMAPP-TP.                                   
309300    PERFORM 01000-DEPURA-ARCHIVOXDISP.                                        
309400                                                                              
309500    MOVE "INTS"          TO  WKS-NOMINTX-TP.                                  
309600    MOVE "ERR"           TO  WKS-NOMAPP-TP.                                   
309700    PERFORM 01000-DEPURA-ARCHIVOXDISP.                                        
309800                                                                              
309900***=========================================                                  
310000  01000-DEPURA-ARCHIVOXDISP.                                                  
310100***=========================================                                  
310200    MOVE  WKS-NOMBRE-INTXDISP-TOT TO   WS-CAMPO-VALUSO-NOM.                   
310300    PERFORM  01000-VALIDA-ARCHIVOXDISP.                                       
310400    IF  WKS-HAY-ARCHXDISP = 1                                                 
310500         MOVE 1                    TO WS-IDE-ARCH-DEPURADOS                   
310600         MOVE SPACES               TO WS-GEN-NOM                              
310700         MOVE WKS-NOMBRE-INTXDISP  TO WS-GEN-NOM                              
310800         PERFORM 90000-ENVIA-DEPURACION-ARCH.                                 
310900                                                                              
311000    MOVE  WKS-NOMBRE-APPXDISP-TOT TO   WS-CAMPO-VALUSO-NOM.                   
311100    PERFORM  01000-VALIDA-ARCHIVOXDISP.                                       
311200    IF  WKS-HAY-ARCHXDISP = 1                                                 
311300         MOVE 1                    TO WS-IDE-ARCH-DEPURADOS                   
311400         MOVE SPACES               TO WS-GEN-NOM                              
311500         MOVE WKS-NOMBRE-APPXDISP  TO WS-GEN-NOM                              
311600         PERFORM 90000-ENVIA-DEPURACION-ARCH.                                 
311700                                                                              
311800***=========================================                                  
311900  01000-VALIDA-ARCHIVOXDISP.                                                  
312000***=========================================                                  
312100    MOVE 1                     TO  WKS-HAY-ARCHXDISP.                         
312200    CHANGE ATTRIBUTE NEWFILE   OF  FILE-VALUSO TO VALUE FALSE                 
312300    CHANGE ATTRIBUTE TITLE     OF  FILE-VALUSO                                
312400                               TO  WS-CAMPO-VALUSO-NOM.                       
312500    CHANGE ATTRIBUTE EXCLUSIVE OF FILE-VALUSO                                 
312600                               TO VALUE TRUE.                                 
312700                                                                              
312800    IF ATTRIBUTE AVAILABLE OF FILE-VALUSO = VALUE TRUE                        
312900       CLOSE FILE-VALUSO WITH SAVE                                            
313000    ELSE                                                                      
313100       MOVE  0   TO  WKS-HAY-ARCHXDISP.                                       
313200                                                                              
313300 5000-BAJA-ESCALONADA.                                                        
313320     STRING "INICIA BAJA ESCALONADA"                                          
313340     DELIMITED BY SIZE INTO WS-0101-TEXT-MSG.                                 
313390     PERFORM 70000050-MENSAJE                                                 
313400     PERFORM 20000500-BAJAESCALON-CALL.                                       
313410     IF WS-L010-RESULT = 0                                                    
313420        STRING "TERMINA BAJA ESCALONADA DE MANERA CORRECTA"                   
313430        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
313431        PERFORM 70000050-MENSAJE                                              
313432     ELSE                                                                     
313434      IF WS-L010-RESULT = 1                                                   
313440         STRING "TERMINA BAJA ESCALONADA POR RECUPERACION"                    
313442                " VERIFICAR COPIAS DEL P010"                                  
313445         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
313450      ELSE                                                                    
313500         IF WS-L010-RESULT > 1                                                
313600            MOVE "ERROR EN LLAMADO BAJA ESCALONADA" TO WS-RECHAZO             
313700            PERFORM  6000-DESPLIEGA-ERROR                                     
313800            SET MYSELF(STATUS) TO -1.                                         
313900                                                                              
314000 5000-BAJA-LINEA.                                                             
314100*====================                                                         
314150  IF  WS-I-AVISO-OPC = 1                                                      
314200       STRING "INICIO AVISO BAJA DE LINEA"                                    
314210       DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                
314220   ELSE                                                                       
314230   IF  WS-I-AVISO-OPC = 2                                                     
314240       STRING "INICIO AVISO INSTALA L020"                                     
314250       DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                
314260   ELSE                                                                       
314270   IF  WS-I-AVISO-OPC = 3                                                     
314280      STRING "INICIO AVISO SUBE LINEA"                                        
314300      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG.                                
314400  PERFORM 70000050-MENSAJE                                                    
314500  PERFORM 5000-AVISO-DISABLE                                                  
314520  IF WS-I-AVISO-OPC = 1                                                       
314600     IF WS-L010-RESULT = 0                                                    
314700          STRING "TERMINA AVISO BAJA DE LINEA"                                
314800          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
314900          PERFORM 70000050-MENSAJE                                            
315000     ELSE                                                                     
315100          STRING "ERROR EN AVISO BAJA DE LINEA "                              
315200          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
315300          PERFORM 70000050-MENSAJE.                                           
315400                                                                              
315500  IF WS-I-AVISO-OPC = 2                                                       
315700     IF WS-L010-RESULT = 0                                                    
315800          STRING "TERMINA AVISO INSTALA LO20"                                 
315900          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
316000          PERFORM 70000050-MENSAJE                                            
316100     ELSE                                                                     
316200        STRING "ERROR EN AVISO INSTALA L020 "                                 
316300        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
316400        PERFORM 70000050-MENSAJE  .                                           
316500  IF WS-I-AVISO-OPC = 3                                                       
316700     IF WS-L010-RESULT = 0                                                    
316800          STRING "TERMINA AVISO SUBE LINEA"                                   
316900          DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                             
317000          PERFORM 70000050-MENSAJE                                            
317100     ELSE                                                                     
317200        STRING "ERROR EN AVISO SUBE LINEA "                                   
317300        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
317400        PERFORM 70000050-MENSAJE  .                                           
