001000$SET LIST                                                                     
001010$SET LINEINFO                                                                 
001600$SET ERRORLIMIT = 1000                                                        
002100$SET BDB00R21                                                                 
002200$SET BDB02R01                                                                 
002800$SET BDB03R02                                                                 
002840$SET BDB04R19                                                                 
003410$SET BDB05R07                                                                 
004000$SET BDB06R11                                                                 
004005$SET BDB91                                                                    
004010$SET S006LOCSUP                                                               
004015$SET S000LIBLJ                                                                
004020$SET S100VERSIONES                                                            
004030$SET S080L700 S080IVA                                                         
004032$SET S080CATALOGOS S080L100                                                   
004034$SET S080DATOS                                                                
004040$SET FECHA2000                                                                
004600*****************************************************************             
005200*  PROGRAMA S500P315.                                                         
005800*  CODIGO DE BATCH "S500P315".                                                
006400*  SISTEMA CAPTACION.                                                         
007000*  VERSION : OCT/2007 CUENTA BASICA.                                          
007600*                                                                             
008200*****************************************************************             
008800* I D E N T I F I C A T I O N     D I V I S I O N.                            
009400*****************************************************************             
010000 IDENTIFICATION DIVISION.                                                     
010600 PROGRAM-ID. CAPAHO.                                                          
011200                                                                              
011800*****************************************************************             
012400* E N V I R O N M E N T    D I V I S I O N.                                   
013000*****************************************************************             
013600 ENVIRONMENT DIVISION.                                                        
014200 CONFIGURATION SECTION.                                                       
014800 INPUT-OUTPUT SECTION.                                                        
015400                                                                              
016000*****************************************************************             
016600* F I L E    C O N T R O L.                                                   
017200*****************************************************************             
017800 FILE-CONTROL.                                                                
018400                                                                              
019000*****************************************************************             
019600* DECLARACION DEL ARCHIVO QUE SE ENVIA AL CIG EN FORMA MENSUAL.               
020200* DE AHORROS.                                                                 
020800*****************************************************************             
021400     SELECT  GERENCIA ASSIGN TO DISK.                                         
022000                                                                              
026200*****************************************************************             
026800* DECLARACION DEL ARCHIVO DE IMPRESION DE LA CAPITALIZACION DE                
027400* AHORROS.                                                                    
028000*****************************************************************             
028600     SELECT FILE-CAPAHO ASSIGN TO PRINTER.                                    
029200                                                                              
029210*****************************************************************             
029220* DECLARACION DEL ARCHIVO DE IMPRESION DE CTOS. CANCELADOS EN                 
029230* FORMA AUTOMATICA.                                                           
029240*****************************************************************             
029250     SELECT FILE-CANCEL ASSIGN TO PRINTER.                                    
029260                                                                              
029800*****************************************************************             
030400* DECLARACION DEL ARCHIVO DONDE SERAN SORTEADOS LOS CTO. DE                   
031000* INVERSIONES DE AHORROS Y LOS CONTRATOS CANCELADOS.                          
031600*****************************************************************             
032200     SELECT SORT-INVE ASSIGN  TO SORT DISK.                                   
032300                                                                              
032400*****************************************************************             
032410* DECLARACION DE ARCHIVOS CON INFORMACION DE CONTRATOS QUE                    
032420* ESTAN DENTRO DE ART. 61                                                     
032430*****************************************************************             
032440     SELECT FILE-ART61 ASSIGN TO DISK.                                        
032450     SELECT SORT-ART61 ASSIGN TO SORT DISK.                                   
032800                                                                              
037600*****************************************************************             
038200* D A T A    D I V I S I O N.                                                 
038800*****************************************************************             
039400 DATA DIVISION.                                                               
040000                                                                              
040600*****************************************************************             
041200* F I L E    S E C T I O N.                                                   
041800*****************************************************************             
042400 FILE SECTION.                                                                
043000                                                                              
043600*****************************************************************             
044200*     DESCRIPCION DEL ARCHIVO QUE SE ENVIA AL CIG                             
044800*****************************************************************             
045400 FD GERENCIA                                                                  
046000      BLOCK CONTAINS  30 RECORDS                                              
046600      VALUE OF TITLE IS WS-ETIQ-GER.                                          
047200 01  REG-GERENCIA.                                                            
047800      02 GER-TIPO-REG          PIC  9(01).                                    
048400      02 GER-CONTROL .                                                        
049000          03 GER-NUM-SISTEMA   PIC X(4).                                      
049600          03 GER-NOM-SISTEMA   PIC X(19).                                     
050200          03 GER-FEC-PROCESO   PIC 9(08) COMP.                                
050800          03 GER-FEC-OPE       PIC 9(08) COMP.                                
051400          03 FILLER            PIC X(28).                                     
052000      02 GER-INFORMACION REDEFINES GER-CONTROL.                               
052600          03 GER-NUM-CTA       PIC 9(12) COMP.                                
053200          03 GER-NUM-CTE       PIC 9(12) COMP.                                
053800          03 GER-FEC-ULMOV     PIC 9(08) COMP.                                
054400          03 GER-MONEDA        PIC 9(02) COMP.                                
055000          03 GER-PERSONA       PIC 9(02) COMP.                                
055600          03 GER-SDO-ACTUAL    PIC 9(12)V99    COMP.                          
056200          03 GER-SDO-PROM      PIC 9(12)V99    COMP.                          
056800          03 GER-TASA          PIC 9(03)V9(03) COMP.                          
057400          03 GER-SUC           PIC 9(04)       COMP.                          
057410          03 FILLER            PIC X(22).                                     
058000      02 GER-MOVIMIENTOS REDEFINES GER-CONTROL.                               
058600          03 GER-MOV-CONTRATO  PIC 9(12) COMP.                                
059200          03 GER-MOV-FECHA     PIC 9(08) COMP.                                
059800          03 GER-MOV-FECVAL    PIC 9(08) COMP.                                
060400          03 GER-MOV-SUCTRANS  PIC 9(04) COMP.                                
061000          03 GER-MOV-SUCPROM   PIC 9(04) COMP.                                
061600          03 GER-MOV-CVETRAN   PIC 9(04) COMP.                                
062200          03 GER-MOV-IMPORTE   PIC 9(12)V99 COMP.                             
062800          03 GER-MOV-MONEDA    PIC 9(02)    COMP.                             
063400          03 GER-MOV-INTCAN    PIC 9(12)V99 COMP.                             
064000          03 GER-MOV-TIPDEP    PIC 9(02)    COMP.                             
064600          03 FILLER            PIC X(23).                                     
065200      02  GER-TRAILER REDEFINES GER-CONTROL  .                                
065800          03 GER-NUM-REG       PIC 9(10)    COMP.                             
066400          03 GER-IMPO          PIC 9(16)V99 COMP.                             
067000          03 FILLER            PIC X(45).                                     
067600                                                                              
068200*****************************************************************             
086200* DESCRIPCION DEL ARCHIVO DE IMPRESION DE LA CAPITALIZACION                   
086800* MENSUAL DE AHORROS.                                                         
087400****************************************************************              
088000 FD FILE-CAPAHO                                                               
088600    VALUE OF TITLE IS WS-ETIQ-CAPAHO.                                         
089200                                                                              
089800 01 REG-CAPAHO     PIC X(132).                                                
090400                                                                              
090410*****************************************************************             
090420* DESCRIPCION DEL ARCHIVO DE IMPRESION DE LOS CONTRATOS CANCELADOS            
090430* EN FORMA AUTOMATICA.                                                        
090440****************************************************************              
090450 FD FILE-CANCEL                                                               
090460    VALUE OF TITLE IS WS-ETIQ-CANCEL.                                         
090470                                                                              
090480 01 REG-CANCEL     PIC X(132).                                                
090490                                                                              
091000****************************************************************              
091600* DESCRIPCION DEL ARCHIVO DONDE SERAN SORTEADAS TODAS LAS INVER.              
092200* DE AHORROS POR NODO PARA GENERAR EL LISTADO DE CAPITALIZACION.              
092800****************************************************************              
093400 SD SORT-INVE.                                                                
094000 01 INVERSION-REG.                                                            
094600    02 INV-SUCPRO-S            PIC 9(04).                                     
094605    02 INV-INDCAN-S            PIC 9(02).                                     
094610    02 INV-PRODUCTO-S          PIC 9(04).                                     
094620    02 INV-INSTRUMENTO-S       PIC 9(04).                                     
094630    02 INV-MONEDA-S            PIC 9(03).                                     
095200    02 INV-NUMCTO-S            PIC 9(12).                                     
095210    02 INV-NUMCTE-S            PIC 9(12).                                     
095800    02 INV-SDOPRO-S            PIC 9(12)V99.                                  
095810    02 INV-NOMBRE-S            PIC X(36).                                     
096400    02 INV-DIASCAP-S           PIC 9(02).                                     
096410    02 INV-FECULTM-S           PIC 9(08).                                     
097000    02 INV-TASA-S              PIC 9(04)V9(03).                               
097600    02 INV-INTSCAP-S           PIC S9(10)V99.                                 
098200    02 INV-NODO-S              PIC 9(02).                                     
098800    02 INV-SUBNODO-S           PIC 9(02).                                     
099400    02 INV-SUCNOM-S            PIC X(40).                                     
099405    02 INV-CANCELO-S           PIC 9(01).                                     
099410    02 FILLER                  PIC X(02).                                     
100000                                                                              
100100*************************************************************                 
100110** ARCHIVO PARA TRANSFERIR AL USUARIO VIA INTELAR                             
100120** CON INFORMACION DE CONTRATOS DENTRO DE ART.61                              
100130*************************************************************                 
100140 FD  FILE-ART61                                                               
100150     BLOCK   CONTAINS 180 RECORDS                                             
100160     RECORD  CONTAINS 180 CHARACTERS                                          
100170     VALUE OF                                                                 
100180            AREAS        IS 1000                                              
100190            AREASIZE     IS 7200                                              
100200            SECURITYTYPE IS PUBLIC                                            
100210            TITLE        IS WKS-TIT-ART61.                                    
100220                                                                              
100230     01 FD-R00-ART61     PIC X(180).                                          
100240*****************************************************************             
100250 SD  SORT-ART61                                                               
100260     BLOCK   CONTAINS 180 RECORDS                                             
100270     RECORD  CONTAINS 180 CHARACTERS.                                         
100280                                                                              
100290     01 SD-ART-REG.                                                           
100292        02 SD-ART-TPREG        PIC 9(02).                                     
100300        02 SD-ART-PROD         PIC 9(04).                                     
100310        02 SD-ART-INST         PIC 9(04).                                     
100320        02 SD-ART-MONE         PIC 9(02).                                     
100330        02 SD-ART-CONT         PIC 9(12).                                     
100340        02 SD-ART-CTE          PIC 9(12).                                     
100350        02 SD-ART-SUCP         PIC 9(04).                                     
100360        02 SD-ART-TPOP         PIC 9(02).                                     
100370        02 SD-ART-STA          PIC 9(02).                                     
100380        02 SD-ART-SECT         PIC 9(02).                                     
100390        02 SD-ART-INLC         PIC 9(01).                                     
100400        02 SD-ART-SDO          PIC 9(12)V99.                                  
100405        02 SD-ART-SDO-CONG     PIC 9(12)V99.                                  
100410        02 SD-ART-FEULTM       PIC 9(08).                                     
100420        02 SD-ART-FECTE        PIC 9(08).                                     
100430        02 SD-ART-FECAPE       PIC 9(08).                                     
100440        02 SD-ART-NOMBRE       PIC X(36).                                     
100450        02 SD-ART-STBENF       PIC X(02).                                     
100460        02 SD-ART-LEYBENF      PIC X(27).                                     
100470        02 SD-ART-FTRSBEN      PIC 9(08).                                     
100480        02 SD-ART-FILLER       PIC X(08).                                     
100490                                                                              
108400****************************************************************              
109000* D A T A     B A S E      S E C T I O N.                                     
109600****************************************************************              
110200 DATA-BASE SECTION.                                                           
110800 DB S500BD01CAPTACION.                                                        
110900 01 S500B00CTRLPASO.                                                          
111400 01 S500B02CONTROL.                                                           
112600 01 S500B03CONTRATOS.                                                         
112610 01 S500B04MOVIMIENTO.                                                        
113800 01 S500B05INSTRUMEN.                                                         
114400 01 S500B06HISTORICO.                                                         
122200 01 S500B91REINICIO.                                                          
122800                                                                              
123400****************************************************************              
124000*               W O R K I N G       S T O R A G E                             
124600****************************************************************              
125200 WORKING-STORAGE SECTION.                                                     
125800                                                                              
126400****************************************************************              
127000* VARIABLE UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                   
127600* ACCESO A LA BASE DE DATOS.                                                  
128200****************************************************************              
128800 COPY "S500/INC/WOR/25MTP002".                                                
128810 COPY "S500/INC/WOR/DAS/25MTP005".                                            
129400                                                                              
130000****************************************************************              
130600* BANDERAS UTILIZADAS PARA LA ACTUALIZACION DE ESTRUCTURAS.                   
131200****************************************************************              
131800 77 WS-BAN-B02      PIC 9 VALUE 0.                                            
133000 77 WS-BAN-B03      PIC 9 VALUE 0.                                            
133600 77 WS-BAN-B04      PIC 9 VALUE 0.                                            
134200 77 WS-BAN-B05      PIC 9 VALUE 0.                                            
134800 77 WS-BAN-B06      PIC 9 VALUE 0.                                            
135400 77 WS-BAN-B07      PIC 9 VALUE 0.                                            
136000 77 WS-BAN-B08      PIC 9 VALUE 0.                                            
136600 77 WS-BAN-B09      PIC 9 VALUE 0.                                            
137200 77 WS-BAN-B10      PIC 9 VALUE 0.                                            
137800 77 WS-BAN-B11      PIC 9 VALUE 0.                                            
138400 77 WS-BAN-B12      PIC 9 VALUE 0.                                            
139000 77 WS-BAN-B13      PIC 9 VALUE 0.                                            
139600 77 WS-BAN-B14      PIC 9 VALUE 0.                                            
139610 77 WS-BAN-SIAHO    PIC 9 VALUE 0.                                            
139620 77 WS-BAN-SICAN    PIC 9 VALUE 0.                                            
140200                                                                              
140800******************************************************************            
141400* VARIABLE UTILIZADAS EN EL PROGRAMA.                                         
142000******************************************************************            
142590 77 W77-SDO-TOT             PIC S9(13)V99       COMP.                         
142600 77 WS-CTE                  PIC 9(12).                                        
143200 77 WS-TIPOPER              PIC 9(02).                                        
143800 77 WS-NOM-CTE              PIC X(30).                                        
144400 77 WS-SORT-ESPACIO         PIC 9(12)           COMP.                         
144410 77 WS-SORT-ESPACIO1        PIC 9(12)           COMP.                         
144412 77 WS-SORT-MEN             PIC 9(12)           COMP.                         
144414 77 WS-SORT-DKS             PIC 9(12)           COMP.                         
145000 77 WS-NODO-ANT             PIC 9(02).                                        
145010 77 WS-NODO-ANT1            PIC 9(02).                                        
145600 77 WS-SUC-ANT              PIC 9(04).                                        
145610 77 WS-SUC-ANT1             PIC 9(04).                                        
145620 77 WS-INDCAN-ANT           PIC 9.                                            
145640 77 WS-CANCELO-ANT          PIC 9.                                            
146200 77 WS-1VEZ                 PIC 9.                                            
146800 77 WS-2VEZ                 PIC 9.                                            
147400 77 WS-3VEZ                 PIC 9.                                            
148000 77 WS-4VEZ                 PIC 9.                                            
148600 77 WS-5VEZ                 PIC 9.                                            
148610 77 WS-6VEZ                 PIC 9.                                            
148620 77 WS-7VEZ                 PIC 9.                                            
148630 77 WS-8VEZ                 PIC 9.                                            
148640 77 WS-9VEZ                 PIC 9.                                            
148650 77 WS-10VEZ                PIC 9.                                            
148652 77 W77-FEC-OK              PIC 9.                                            
149200 77 WS-LINEA                PIC 9(02).                                        
149800 77 WS-LINEA1               PIC 9(02).                                        
150400 77 WS-PAGINA               PIC 9(04).                                        
151000 77 WS-PAGINA1              PIC 9(04).                                        
151010 77 WS-CSITEM               PIC 9(02).                                        
151020 77 WS-NOMSUC1              PIC X(20) VALUE SPACES.                           
151030 77 WS-NUMSUC1              PIC 9(02) VALUE 0.                                
151600                                                                              
152200****************************************************************              
152800*  VARIABLES PARA ACUMULAR TOTALES                                            
153400****************************************************************              
154000 77 WS-TOT-TOT-SUC          PIC 9(14)V99 COMP VALUE 0.                        
154600 77 WS-NUM-TOT-SUC          PIC 9(06)    COMP VALUE 0.                        
155200 77 WS-TOT-TOT-NODO         PIC 9(14)V99 COMP VALUE 0.                        
155800 77 WS-NUM-TOT-NODO         PIC 9(06)    COMP VALUE 0.                        
156400 77 WS-TOT-TOT-CSI          PIC 9(14)V99 COMP VALUE 0.                        
157000 77 WS-NUM-TOT-CSI          PIC 9(06)    COMP VALUE 0.                        
157600 77 WS-TOT-TOT-DOL          PIC 9(14)V99 COMP VALUE 0.                        
158200 77 WS-NUM-TOT-DOL          PIC 9(06)    COMP VALUE 0.                        
158800 77 WS-TOT-TOT-NAL          PIC 9(14)V99 COMP VALUE 0.                        
159400 77 WS-NUM-TOT-NAL          PIC 9(06)    COMP VALUE 0.                        
160000 77 WS-TOT-SDOACT           PIC 9(14)V99 COMP VALUE 0.                        
160600 77 WS-TOT-SDOACT1          PIC 9(14)V99 COMP VALUE 0.                        
161200 77 WS-NUM                  PIC 9(06)    COMP VALUE 0.                        
161800 77 WS-NUM1                 PIC 9(06)    COMP VALUE 0.                        
162400 77 WS-REG-ART61            PIC 9(10)    COMP VALUE 0.                        
162420 77 W77-IMP-300-SMVDF       PIC 9(10)V99 COMP.                                
163000                                                                              
163600                                                                              
169000****************************************************************              
169600* ETIQUETA PARA LEER EL ARCHIVO DEL CIG.                                      
170200****************************************************************              
170800 01 WS-ETIQ-GER.                                                              
171400      02 WS-GER-TIT              PIC X(21) VALUE                              
172000                                 "S500/FILE/X/GERENCIA/".                     
172600      02 WS-GER-CSI              PIC XXX.                                     
173200      02 WS-GER-COR              PIC X(5) VALUE "/COR/".                      
173800      02 WS-GER-FECHA            PIC 9(6).                                    
174400      02 FILLER                  PIC X VALUE ".".                             
175000                                                                              
175100****************************************************************              
175105***  TITULO ARCHIVO CONTRATOS EN ART.61                      ***              
175110****************************************************************              
175115 01  WKS-TIT-ART61.                                                           
175120     02 FILLER              PIC X(24) VALUE                                   
175125                            "S500/FILE/INTS/50013S01/".                       
175130     02 WKS-TIT-ART-CSI     PIC 9(02).                                        
175135     02 FILLER              PIC X(01) VALUE "/".                              
175140     02 WKS-TIT-ART-FEC     PIC 9(08).                                        
175145     02 FILLER              PIC X(11) VALUE                                   
175150                            "/S500_ART61".                                    
175155     02 FILLER              PIC X(01) VALUE ".".                              
175160                                                                              
175165********************************************************                      
175170** REGISTRO HEADER                                   ***                      
175172********************************************************                      
175180 01 WS-ART-REG-HED.                                                           
175182    02 WS-TPO-REG-00       PIC 9(02)    VALUE 01.                             
175184    02 WS-FEC-REG-00       PIC 9(08).                                         
175186    02 WS-CSI-REG-00       PIC 9(02).                                         
175188    02 FILLER              PIC X(168)   VALUE " ".                            
175190********************************************************                      
175270** REGISTRO DE CONTRATOS DENTRO DE ART.61            ***                      
175275********************************************************                      
175280 01 WS-ART-REG.                                                               
175282    02 WS-ART-TREG         PIC 9(02)       VALUE 03.                          
175285    02 WS-ART-PROD         PIC 9(04).                                         
175290    02 WS-ART-INST         PIC 9(04).                                         
175295    02 WS-ART-MONE         PIC 9(02).                                         
175300    02 WS-ART-CONT         PIC 9(12).                                         
175305    02 WS-ART-CTE          PIC 9(12).                                         
175310    02 WS-ART-SUCP         PIC 9(04).                                         
175315    02 WS-ART-TPOP         PIC 9(02).                                         
175320    02 WS-ART-STA          PIC 9(02).                                         
175325    02 WS-ART-SECT         PIC 9(02).                                         
175330    02 WS-ART-INLC         PIC 9(01).                                         
175335    02 WS-ART-SDO          PIC 9(12)V99.                                      
175337    02 WS-ART-SDO-CONG     PIC 9(12)V99.                                      
175340    02 WS-ART-FEULTM       PIC 9(08).                                         
175345    02 WS-ART-FECTE        PIC 9(08).                                         
175350    02 WS-ART-FECAPE       PIC 9(08).                                         
175355    02 WS-ART-NOMBRE       PIC X(36).                                         
175360    02 WS-ART-STBENF       PIC 9(02).                                         
175365    02 WS-ART-LEYBENF      PIC X(27).                                         
175367    02 WS-ART-FECART61     PIC X(08).                                         
175370    02 WS-ART-FTRSBEN      PIC 9(08).                                         
175372    02 WS-ART-FTRSBEN-X REDEFINES WS-ART-FTRSBEN PIC X(08).                   
175375    02 WS-ART-FILLER       PIC X(05).                                         
175380                                                                              
175390********************************************************                      
175392** REGISTRO TRAILER                                  ***                      
175394********************************************************                      
175396 01 WS-ART-REG-TRL.                                                           
175398    02 WS-TPO-REG-99       PIC 9(02)    VALUE 09.                             
175400    02 WS-TOT-REG-99       PIC 9(08)    VALUE 0.                              
175402    02 FILLER              PIC X(170)   VALUE " ".                            
175406                                                                              
175410*************************************************************                 
175420 01  WKS-TAB-ART61.                                                           
175440     02 FILLER         PIC X(26) VALUE                                        
175460                       "DENTRO DE ART.61          ".                          
175480     02 FILLER         PIC X(26) VALUE                                        
175500                       "ENTRADA ART.61            ".                          
175520     02 FILLER         PIC X(26) VALUE                                        
175540                       "ENTRADA ART.61 X DES-BLOQ ".                          
175560     02 FILLER         PIC X(26) VALUE                                        
175580                       "SALIDA ART.61 REACTIVACION".                          
175600     02 FILLER         PIC X(26) VALUE                                        
175620                       "SALIDA ART.61 X BLOQUEO   ".                          
175640     02 FILLER         PIC X(26) VALUE                                        
175642                       "EN ART.61 C/SDO>300 SMVDF ".                          
175650     02 FILLER         PIC X(26) VALUE                                        
175660                       "                          ".                          
175680 01  WKS-TAB-ART61-R   REDEFINES WKS-TAB-ART61.                               
175700     02 WKS-TB-ART61   PIC X(26) OCCURS 7 TIMES.                              
175720                                                                              
175740************************************************************                  
175760                                                                              
175780                                                                              
175800                                                                              
175820                                                                              
182200****************************************************************              
189400* TABLA DE LOS NOMBRES DEL CSI PARA ARMAR LA ETIQUETA P/EL CIG.               
190000****************************************************************              
190600 01 WS-TABCSI-01.                                                             
191200   02 WS-TABCSI.                                                              
191800      03 FILLER                 PIC X(3) VALUE "HER".                         
192400      03 FILLER                 PIC X(3) VALUE "   ".                         
193000      03 FILLER                 PIC X(3) VALUE "   ".                         
193600      03 FILLER                 PIC X(3) VALUE "MTY".                         
194200      03 FILLER                 PIC X(3) VALUE "   ".                         
194800      03 FILLER                 PIC X(3) VALUE "LEO".                         
195400      03 FILLER                 PIC X(3) VALUE "VER".                         
196000      03 FILLER                 PIC X(3) VALUE "   ".                         
196600      03 FILLER                 PIC X(3) VALUE "MOR".                         
197200      03 FILLER                 PIC X(3) VALUE "VDM".                         
197800   02 WS-TAB-CSI REDEFINES WS-TABCSI OCCURS 10 TIMES PIC X(3).                
198400                                                                              
199000***************************************************************               
199600 01 WS-RESIDUO        PIC 99 .                                                
200200 01 WS-RESULTADO      PIC 99 .                                                
200800                                                                              
201400******************************************************************            
202000* CARATULA DE IMPRESION DEL LISTADO DE CAPITALIZACION DE AHORROS.             
202600******************************************************************            
203200 01 WS-ETIQ-CAPAHO.                                                           
203800    03  FILLER         PIC X(15) VALUE "S500/LIST/P315/".                     
204400    03  WS-CAP-CI      PIC 99.                                                
205000    03  WS-CAP-SUBNODO PIC 99.                                                
205600    03  FILLER         PIC X     VALUE "/".                                   
206200    03  WS-CAP-CIFRA   PIC X     VALUE "R".                                   
206800    03  WS-CAP-NUM     PIC 9(3).                                              
207400    03  FILLER         PIC X     VALUE "/".                                   
208000    03  WS-CAP-FECHA   PIC 9(6).                                              
208600    03  FILLER         PIC X     VALUE "/".                                   
209200    03  WS-CAP-MIX     PIC 9(7).                                              
209800    03  FILLER         PIC X(18)  VALUE "/001CAPITALIZA.   ".                 
210400                                                                              
210405******************************************************************            
210410* CARATULA DE IMPRESION DEL LISTADO DE CONTRATOS CANCELADOS.                  
210415******************************************************************            
210420 01 WS-ETIQ-CANCEL.                                                           
210425    03  FILLER         PIC X(15) VALUE "S500/LIST/P315/".                     
210430    03  WS-CAN-CI      PIC 99.                                                
210435    03  WS-CAN-SUBNODO PIC 99.                                                
210440    03  FILLER         PIC X     VALUE "/".                                   
210445    03  WS-CAN-CIFRA   PIC X     VALUE "R".                                   
210450    03  WS-CAN-NUM     PIC 9(3).                                              
210455    03  FILLER         PIC X     VALUE "/".                                   
210460    03  WS-CAN-FECHA   PIC 9(6).                                              
210465    03  FILLER         PIC X     VALUE "/".                                   
210470    03  WS-CAN-MIX     PIC 9(7).                                              
210475    03  FILLER         PIC X(18)  VALUE "/002CANCELAUTOMAT.".                 
210480                                                                              
211000****************************************************************              
211600*  REGISTROS UTILIZADOS EN LA CAPTURA DE HORA Y FECHAS.                       
212200****************************************************************              
212800 01 WS-FECHA-CAL                            PIC 9(08).                        
213400 01 WS-FECHA-CAL-R REDEFINES WS-FECHA-CAL.                                    
214000    02 WS-CAL-AA                            PIC 9(04).                        
214600    02 WS-CAL-MM                            PIC 9(02).                        
215200    02 WS-CAL-DD                            PIC 9(02).                        
215800                                                                              
216400 01 WS-FECHA-MDA                            PIC 9(08).                        
217000 01 WS-FECHA-MDA-R REDEFINES WS-FECHA-MDA.                                    
217600    02 WS-DIA-MM1                           PIC 9(02).                        
218200    02 WS-DIA-DD1                           PIC 9(02).                        
218800    02 WS-DIA-AA1                           PIC 9(04).                        
219400                                                                              
220000 01 WS-DIA-AMD                              PIC 9(08).                        
220600 01 WS-DIA-AMD-R   REDEFINES WS-DIA-AMD.                                      
221200    02 WS-DIA-AA2                           PIC 9(04).                        
221800    02 WS-DIA-MM2                           PIC 9(02).                        
222400    02 WS-DIA-DD2                           PIC 9(02).                        
223000                                                                              
223600 01 WS-FECVAL-AMD                           PIC 9(08).                        
224200 01 WS-FECVAL-AMD-R REDEFINES WS-FECVAL-AMD.                                  
224800    02 WS-FEC-VAL-AA                        PIC 9(04).                        
225400    02 WS-FEC-VAL-MM                        PIC 99.                           
226000    02 WS-FEC-VAL-DD                        PIC 99.                           
226600                                                                              
227200 01 WS-FECHA-DIA                        PIC 9(08).                            
227800 01 WS-FECHA-DIA-DMA REDEFINES WS-FECHA-DIA.                                  
228400    02 WS-DIA-AA                        PIC 9(04).                            
229000    02 WS-DIA-MM                        PIC 99.                               
229600    02 WS-DIA-DD                        PIC 99.                               
230200                                                                              
230800 01 WS-FECHA-PRO                        PIC 9(08).                            
231400 01 WS-FECHA-PRO-DMA REDEFINES WS-FECHA-PRO.                                  
232000    02 WS-PRO-AA                        PIC 9(04).                            
232600    02 WS-PRO-MM                        PIC 99.                               
233200    02 WS-PRO-DD                        PIC 99.                               
233800                                                                              
233810 01 WS-FECHA-PASO                       PIC 9(08).                            
233820 01 WS-PASO-AMD REDEFINES WS-FECHA-PASO.                                      
233830    02 WS-PASO-AA                       PIC 9(04).                            
233840    02 WS-PASO-MM                       PIC 99.                               
233850    02 WS-PASO-DD                       PIC 99.                               
233860                                                                              
234400 01 WS-HORA-HMSC-01.                                                          
235000    03 WS-HORA-HMSC-N           PIC 9(8).                                     
235600    03 WS-HORA-HMSC REDEFINES   WS-HORA-HMSC-N.                               
236200       05 WS-HORA-HMS-N         PIC 9(6).                                     
236800       05 WS-HORA-HMS REDEFINES WS-HORA-HMS-N.                                
237400          07 WS-HORA-HH-N       PIC 9(2).                                     
238000          07 WS-HORA-MM-N       PIC 9(2).                                     
238600          07 WS-HORA-SS-N       PIC 9(2).                                     
239200       05 FILLER                   PIC 9(2).                                  
239300                                                                              
239310 01 WS-FEC-1ER-VIE             PIC 9(08).                                     
239312 01 WS-FEC-1ER-VIE-RD          REDEFINES WS-FEC-1ER-VIE.                      
239314    02 WS-AA-1ER-VIE           PIC 9(04).                                     
239316    02 WS-MM-1ER-VIE           PIC 99.                                        
239318    02 WS-DD-1ER-VIE           PIC 99.                                        
239320                                                                              
239324 01 WS-FEC-3600-ANT            PIC 9(08).                                     
239325 01 WS-FEC-3600-ANT-RD         REDEFINES WS-FEC-3600-ANT.                     
239326    02 WS-AA-FEC3600           PIC 9(04).                                     
239327    02 WS-MM-FEC3600           PIC 99.                                        
239328    02 WS-DD-FEC3600           PIC 99.                                        
239329                                                                              
239330 01 WS-FEC-TRS-BENF            PIC 9(08).                                     
239332 01 WS-FEC-TRS-BENF-RD         REDEFINES WS-FEC-TRS-BENF.                     
239334    02 WS-AA-TRPBENF           PIC 9(04).                                     
239336    02 WS-MM-TRPBENF           PIC 99.                                        
239338    02 WS-DD-TRPBENF           PIC 99.                                        
239340                                                                              
239350 01 WS-FECH-BENF               PIC 9(08).                                     
239352 01 WS-FECH-BENF-RD            REDEFINES WS-FECH-BENF.                        
239354    02 WS-AA-BENF              PIC 9(04).                                     
239356    02 WS-MM-BENF              PIC 99.                                        
239358    02 WS-DD-BENF              PIC 99.                                        
239360                                                                              
239370                                                                              
239400                                                                              
239800                                                                              
244000****************************************************************              
244600****************************************************************              
245200* A R E A       D E       E  N  C  A  B  E  Z  A  D  O  S .                   
245800****************************************************************              
246400****************************************************************              
247000                                                                              
247010****************************************************************              
247020* LINEA UTILIZAFA PARA IMPRIMIR UNA LINEA EN BLANCO.                          
247030****************************************************************              
247040 01 WS-BLANCOS.                                                               
247050   02 FILLER                             PIC X(132) VALUE SPACES.             
247060                                                                              
247600****************************************************************              
248200* PROMER ENCABEZADO GENERAL DE LOS REPORTE GENERADOS.                         
248800****************************************************************              
249400 01  WS-ENCABEZADO.                                                           
250000   02 FILLER                             PIC X(51) VALUE SPACES.              
250600   02 FILLER                             PIC X(29) VALUE                      
251200        "BANCO NACIONAL DE MEXICO S.A.".                                      
251800                                                                              
252400****************************************************************              
253000* SEGUNDO ENCABEZADO GENERAL DE LOS REPORTES GENERADOS.                       
253600****************************************************************              
254200 01  WS-ENCABEZADO1.                                                          
254800   02 FILLER                             PIC X(56) VALUE SPACES.              
255400   02 FILLER                             PIC X(20) VALUE                      
256000        "DEPOSITOS A LA VISTA".                                               
256600                                                                              
257200****************************************************************              
257800*   TERCER  ENCABEZADO PARA EL DE CAPITALIZACION DE AHORROS.                  
258400****************************************************************              
259000 01  WS-03-CAPAH.                                                             
259600     05 FILLER                        PIC X(18)                               
260200        VALUE "S500-P315-CAPAHO  ".                                           
260800     05 FILLER                        PIC X(36) VALUE SPACES.                 
261400     05 WS-CAPAH-NOMBRE               PIC X(40).                              
262000     05 WS-CAPAH-PRD                  PIC ZZZ9.                               
262600     05 FILLER                        PIC X     VALUE SPACES.                 
263200     05 WS-CAPAH-INS                  PIC ZZZ9.                               
263800     05 FILLER                        PIC X     VALUE SPACES.                 
264400     05 WS-CAPAH-MON                  PIC ZZ9.                                
265000     05 FILLER                        PIC X     VALUE SPACES.                 
265600     05 FILLER                        PIC X(01) VALUE SPACES.                 
266200     05 FILLER                        PIC X(06)                               
266800        VALUE "FECHA ".                                                       
267400     05 WS-CAPAH-DIA                  PIC 99.                                 
268000     05 FILLER                        PIC X VALUE "/".                        
268600     05 WS-CAPAH-MES                  PIC 9(02).                              
269200     05 FILLER                        PIC X VALUE "/".                        
269800     05 WS-CAPAH-ANO                  PIC 9(04).                              
270400                                                                              
270405****************************************************************              
270410*   TERCER  ENCABEZADO PARA EL LISTADO DE CALCELACIONES AUT.                  
270415****************************************************************              
270420 01  WS-03-CANCE.                                                             
270425     05 FILLER                        PIC X(18)                               
270430        VALUE "S500-P315-CTOSMOVS".                                           
270435     05 FILLER                        PIC X(91) VALUE SPACES.                 
270480     05 FILLER                        PIC X(06)                               
270485        VALUE "FECHA ".                                                       
270490     05 WS-CANCE-DIA                  PIC 99.                                 
270495     05 FILLER                        PIC X VALUE "/".                        
270500     05 WS-CANCE-MES                  PIC 9(02).                              
270505     05 FILLER                        PIC X VALUE "/".                        
270510     05 WS-CANCE-ANO                  PIC 9(04).                              
270520                                                                              
271000******************************************************************            
271600*  CUARTO  ENCABEZADO PARA EL REPORTE DE CAPITALIZACION DE AHO.               
272200******************************************************************            
272800 01  WS-04-CAPAHO.                                                            
273400     05 FILLER                          PIC X(10) VALUE                       
274000        "PROCESO   ".                                                         
274600     05 WS-CAPAH-DIA1                   PIC 9(02).                            
275200     05 FILLER                          PIC X VALUE "/".                      
275800     05 WS-CAPAH-MES1                   PIC 9(02).                            
276400     05 FILLER                          PIC X VALUE "/".                      
277000     05 WS-CAPAH-ANO1                   PIC 9(04).                            
277600     05 FILLER                          PIC X(30) VALUE SPACES.               
278200     05 FILLER                          PIC X(32) VALUE                       
278800           " CAPITALIZACION MENSUAL AHORROS ".                                
279400     05 FILLER                          PIC X(36) VALUE SPACES.               
280000     05 FILLER                          PIC X(05) VALUE "HOJA ".              
280600     05 WS-CAPAH-HOJA                   PIC ZZ9.                              
281200                                                                              
281205******************************************************************            
281210*  CUARTO  ENCABEZADO PARA EL REPORTE DE CANCELACIONES AUTOMATICAS            
281215******************************************************************            
281220 01  WS-04-CANCEL.                                                            
281225     05 FILLER                          PIC X(10) VALUE                       
281230        "PROCESO   ".                                                         
281235     05 WS-CANCE-DIA1                   PIC 9(02).                            
281240     05 FILLER                          PIC X VALUE "/".                      
281245     05 WS-CANCE-MES1                   PIC 9(02).                            
281250     05 FILLER                          PIC X VALUE "/".                      
281255     05 WS-CANCE-ANO1                   PIC 9(04).                            
281260     05 FILLER                          PIC X(30) VALUE SPACES.               
281262     05 FILLER                          PIC X(32) VALUE                       
281264           " RESUMEN DE CONTRATOS SIN MOV.  ".                                
281266     05 FILLER                          PIC X(36) VALUE SPACES.               
281270     05 FILLER                          PIC X(05) VALUE "HOJA ".              
281275     05 WS-CANCE-HOJA                   PIC ZZ9.                              
281280                                                                              
281800****************************************************************              
282400* ENCABEZADO PARA LOS TITULOS DE LA CAPITALIZACION DE AHO.                    
283000****************************************************************              
283600 01 WS-TIT-CAP.                                                               
284200     02 FILLER                            PIC X(13) VALUE                     
284800        "  CONTRATO   ".                                                      
285400     02 FILLER                            PIC X(18) VALUE                     
286000        "   SDO. PROMEDIO  ".                                                 
286600     02 FILLER                            PIC X(20) VALUE                     
287200        "DIAS CAPITALIZADOS  ".                                               
287800     02 FILLER                            PIC X(09) VALUE                     
288400        "INTERESES".                                                          
289000                                                                              
289005****************************************************************              
289010* ENCABEZADO PARA LOS TITULOS DE CTOS. CANCELADOS AUTOMATICAMENTE.            
289015****************************************************************              
289020 01 WS-TIT-CAN.                                                               
289025     02 FILLER                            PIC X(13) VALUE                     
289030        "  CONTRATO   ".                                                      
289035     02 FILLER                            PIC X(05) VALUE SPACES.             
289040     02 FILLER                            PIC X(13) VALUE                     
289045        "  CLIENTE    ".                                                      
289050     02 FILLER                            PIC X(05) VALUE SPACES.             
289055     02 FILLER                            PIC X(40) VALUE                     
289060        "                NOMBRE                  ".                           
289065     02 FILLER                            PIC X(05) VALUE SPACES.             
289075     02 FILLER                            PIC X(18) VALUE                     
289080        " FECHA ULTIMO MOV.".                                                 
289085     02 FILLER                            PIC X(05) VALUE SPACES.             
289090     02 FILLER                            PIC X(03) VALUE "PRD".              
289095     02 FILLER                            PIC X(05) VALUE SPACES.             
289100     02 FILLER                            PIC X(03) VALUE "INS".              
289110     02 FILLER                            PIC X(05) VALUE SPACES.             
289120     02 FILLER                            PIC X(03) VALUE "MON".              
289130                                                                              
289600****************************************************************              
290200*     ENCABEZADO PARA LA IMPRESION DE LA HORA EN LOS LISTADOS.                
290800****************************************************************              
291400 01 WS-IMP-HORA  .                                                            
292000   02 FILLER                              PIC X(8) VALUE                      
292600       "HORA :".                                                              
293200   02 WS-IMP-HH                           PIC Z9.                             
293800   02 FILLER                              PIC X VALUE ":".                    
294400   02 WS-IMP-MM                           PIC 9(002).                         
295000   02 FILLER                              PIC X VALUE ":".                    
295600   02 WS-IMP-SS                           PIC 9(002).                         
296200                                                                              
296800****************************************************************              
297400* ENCABEZADO PARA LA SUCURSAL Y NOMBRE DE ESTA PARA EL REPORTE DE             
298000* CAPITALIZACION MENSUAL DE AHORROS.                                          
298600****************************************************************              
299200 01 WS-CAPI-SUCURSAL.                                                         
299800    02 FILLER                             PIC X(12) VALUE                     
300400                                          "SUCURSAL:   ".                     
301000    02 WS-NUMSUC                          PIC ZZZ9.                           
301600    02 FILLER                             PIC X(04) VALUE SPACES.             
302200    02 WS-NOMSUC                          PIC X(40) VALUE SPACES.             
302210                                                                              
302220****************************************************************              
302230* ENCABEZADO PARA LA SUCURSAL Y NOMBRE DE ESTA PARA EL REPORTE DE             
302240* CANCELACIONES AUTOMATICAS.                                                  
302250****************************************************************              
302260 01 WS-CANC-SUCURSAL.                                                         
302270    02 FILLER                             PIC X(12) VALUE                     
302280                                          "SUCURSAL:   ".                     
302290    02 WS-NUMSUC-A                        PIC ZZZ9.                           
302300    02 FILLER                             PIC X(04) VALUE SPACES.             
302310    02 WS-NOMSUC-A                        PIC X(40) VALUE SPACES.             
302800                                                                              
302810****************************************************************              
302820* ENCABEZADO PARA EL TIPO DE CANCELACION PARA EL REPORTE DE CTOS.             
302830* CANCELADOS EN FORMA AUTOMATICA.                                             
302840****************************************************************              
302850 01 WS-CAN-TIPCAN.                                                            
302860    02 FILLER                             PIC X(31) VALUE                     
302870        "      ESTADO ACTUAL DEL CTO. : ".                                    
302872    02 WS-CAN-MC                          PIC 9(02).                          
302874    02 FILLER                             PIC X(02) VALUE SPACES.             
302880    02 WS-CAN-LEY                         PIC X(40) VALUE SPACES.             
302890                                                                              
303400****************************************************************              
304000* ENCABEZADO PARA LA TASA UTILIZADA EN LA CAPITALIZACION MENSUAL              
304600* DE AHORROS.                                                                 
305200****************************************************************              
305800 01 WS-CAPI-TASA.                                                             
306400    02 FILLER                             PIC X(12) VALUE                     
307000                                          "TASA:       ".                     
307600    02 WS-TASA                            PIC ZZZ9.999.                       
308200                                                                              
308800******************************************************************            
309400* CAMPOS UTILIZADOS PARA IMPRIMIR EL DETALLE DE LISTADO DE                    
310000* CAPITALIZACION MENSUAL DE AHORROS.                                          
310600******************************************************************            
311200 01 WS-DET-CAP.                                                               
311800    02 WS-DET-CTO                  PIC 9(12).                                 
312400    02 WS-DET-SDOPROM              PIC ZZ,ZZZ,ZZZ,ZZ9.99.                     
313000    02 FILLER                      PIC X(10) VALUE SPACES.                    
313600    02 WS-DET-DIAS                 PIC 99.                                    
314200    02 FILLER                      PIC X(05) VALUE SPACES.                    
314800    02 WS-DET-INT                  PIC Z,ZZZ,ZZZ,ZZ9.99.                      
315400                                                                              
315405******************************************************************            
315410* CAMPOS UTILIZADOS PARA IMPRIMIR EL DETALLE DE LISTADO DE                    
315415* CANCELACIONES AUTOMATICAS.                                                  
315420******************************************************************            
315425 01 WS-DET-CAN.                                                               
315435    02 WS-CAN-CTO                  PIC 9(12).                                 
315440    02 FILLER                      PIC X(06) VALUE SPACES.                    
315445    02 WS-CAN-CTE                  PIC 9(12).                                 
315450    02 FILLER                      PIC X(06) VALUE SPACES.                    
315455    02 WS-CAN-NOM                  PIC X(40).                                 
315460    02 FILLER                      PIC X(09) VALUE SPACES.                    
315465    02 WS-CAN-DD                   PIC 99.                                    
315470    02 FILLER                      PIC X VALUE "/".                           
315475    02 WS-CAN-MM                   PIC 99.                                    
315480    02 FILLER                      PIC X VALUE "/".                           
315485    02 WS-CAN-AA                   PIC 9999.                                  
315490    02 FILLER                      PIC X(06) VALUE SPACES.                    
315495    02 WS-CAN-PRD                  PIC ZZ9.                                   
315500    02 FILLER                      PIC X(06) VALUE SPACES.                    
315510    02 WS-CAN-INS                  PIC ZZ9.                                   
315520    02 FILLER                      PIC X(06) VALUE SPACES.                    
315530    02 WS-CAN-MON                  PIC ZZ9.                                   
315540                                                                              
316000******************************************************************            
316600* TITULOS PARA IMPRESION DE TOTALES DEL LISTADO DE CAPITALIZACION             
317200* MENSUAL DE AHORROS.                                                         
317800******************************************************************            
318400 01  WS-TOTALES.                                                              
319000     03 WS-TITULO-TOT  PIC X(33).                                             
319600     03 WS-NUMERO-TOT PIC ZZZZZZ9BBBBB.                                       
320200     03 WS-IMPORTE-TOT PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                             
320800*                                                                             
355000***************************************************************               
399400*          VARIABLES PARA CALCULO DE CAPITALIZACION AL DIA     *              
400000****************************************************************              
400600 77  WS-I                    PIC S9(11) BINARY .                              
401200 77  WS-CAPI-CONT      PIC 9(06).                                             
401800 77  WS-CAPI-INT       PIC S9(12)V99.                                         
402400 77  WS-CAPI-INT-MN    PIC S9(12)V99.                                         
403000 77  WS-CAPI-SDOACT    PIC S9(12)V99.                                         
403600 77  WS-CAPI-IMPDIA    PIC S9(12)V99.                                         
404200 77  WS-CAPI-DIAS      PIC 99.                                                
404800 77  WS-CAPI-SDOACUM   PIC S9(16)V99.                                         
405400 77  WS-CAPI-PROM      PIC S9(16)V99.                                         
406000 77  WS-CAPI-PROM-MN   PIC S9(16)V99.                                         
406600 77  WS-CAPI-SDODIA    PIC S9(16)V99.                                         
407200 77  WS-CANCE-SDODIA   PIC S9(16)V99.                                         
407800 77  WS-151-RESULTADO     PIC S9(11) BINARY.                                  
413200                                                                              
413800****************************************************************              
414400*                P R O C E D U R E        D I V I S I O N.                    
415000****************************************************************              
415600 PROCEDURE DIVISION.                                                          
416200********************                                                          
416800                                                                              
417400                                                                              
418000                                                                              
418600                                                                              
419200****************************************************************              
419800****************************************************************              
420400*          S E C T I O N             P R I N C I P A L.                       
421000****************************************************************              
421600****************************************************************              
422200                                                                              
422800 00000000-INICIO SECTION.                                                     
423400 00000000-PRINCIPAL.                                                          
423410                                                                              
423415     MOVE ATTRIBUTE HOSTNAME OF MYSELF TO WKS-NAME-HOST.                      
423420     MOVE 2             TO W77-USO-LIBLJ.                                     
423430     MOVE "P315"        TO WS-0101-PASO-MSG B91-IDPROG.                       
423440     MOVE "25MTP004"    TO WS-0101-MTP-MSG  W77-S000-MY-VERSION.              
423450     MOVE "S500P315"    TO W77-S000-MY-ID.                                    
423460                                                                              
424000     PERFORM 10000000-LIBRERIAS THRU 10000000-EXIT.                           
424600     PERFORM 20000000-OPEN      THRU 20000000-EXIT.                           
425200     PERFORM 50000000-PROCESOS  THRU 50000000-EXIT.                           
425800     PERFORM 70000000-CIERRO    THRU 70000000-EXIT.                           
426400     STOP RUN.                                                                
427000                                                                              
427600                                                                              
428200****************************************************************              
428800****************************************************************              
429400*                                                                             
430000* REALIZO EL CHANGE A LAS LIBRERIAS Y VERIFICO EL CONTROL DE                  
430600* VERSIONES.                                                                  
431200*                                                                             
431800****************************************************************              
432400****************************************************************              
433000                                                                              
433600 10000000-LIBRERIAS.                                                          
434200****************************************************************              
434800* CHANGE A LA LIBRERIA DE CONTROL DE VERSIONES.                               
434810****************************************************************              
434830     PERFORM 10000100-VERSIONES.                                              
434840                                                                              
435400****************************************************************              
435410* ACCESO LA LIBRERIA DE ESTRUCTURA POR MEDIO DEL CONTROL DE                   
435420* VERSIONES PARA OBTENER NODOS, CSI Y NOMBRE DE SUCURSALES.                   
435430******************************************************************            
435440     PERFORM 10000080-S080IVA.                                                
435442     PERFORM 10000080-S080L700.                                               
435450                                                                              
435460******************************************************************            
435480* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
435490******************************************************************            
435500     PERFORM 10000006-LOCSUP.                                                 
449800 10000000-EXIT.                                                               
450400    EXIT.                                                                     
451000                                                                              
451600                                                                              
452200                                                                              
452800                                                                              
453400                                                                              
454000*****************************************************************             
454600*****************************************************************             
455200*                                                                             
455800*                       O  P  E  N.                                           
456400*     R U T I N A S   P A R A   A P E R T U R A   D E                         
457000*                B A S E   Y   A R C H I V O S.                               
457600*****************************************************************             
458200*****************************************************************             
458800                                                                              
459400 20000000-OPEN.                                                               
460000    COMPUTE WS-SORT-ESPACIO =  (3000000 + 1) * 28 * 2.5.                      
460040    COMPUTE WS-SORT-ESPACIO1 = 500000.                                        
460050    PERFORM 20000050-CHECO-VER     THRU 20000050-EXIT.                        
460600    PERFORM 20000100-ABRO-BASE     THRU 20000100-EXIT.                        
461200    PERFORM 20000200-FECHA-PRO     THRU 20000200-EXIT.                        
461800    PERFORM 20000300-HORA          THRU 20000300-EXIT.                        
462400    PERFORM 20000400-FECHA-DIA     THRU 20000400-EXIT.                        
462405    PERFORM 20000410-FECHA-BENEF   THRU 20000410-EXIT.                        
462410    PERFORM 20000450-CARGO-SUCS    THRU 20000450-EXIT.                        
463000    PERFORM 20000500-OPEN-ARC      THRU 20000500-EXIT.                        
463100    PERFORM 20000600-HEADER        THRU 20000600-EXIT.                        
464200 20000000-EXIT.                                                               
464800    EXIT.                                                                     
464810                                                                              
465410******************************************************************            
465420* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
465430******************************************************************            
465440 20000050-CHECO-VER.                                                          
465450     PERFORM 20000100-CHECAME-VERSION.                                        
465460     IF S000-CTR-CVEERROR < 0                                                 
465490        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
465500        PERFORM 70000050-MENSAJE                                              
465510        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
465520 20000050-EXIT.                                                               
465530    EXIT.                                                                     
465540                                                                              
466000******************************************************************            
466600* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
467200******************************************************************            
467800 20000100-ABRO-BASE.                                                          
468400     OPEN INQUIRY  S500BD01CAPTACION                                          
469000     ON EXCEPTION                                                             
470800        MOVE "ERROR AL ABRIR LA BASE         " TO WS-0101-TEXT-MSG            
471400        PERFORM 70000050-MENSAJE                                              
472000        CALL SYSTEM DMTERMINATE.                                              
472600                                                                              
473200    SET S500B02CONTROL        TO BEGINNING.                                   
473800    SET S500B03CONTRATOS      TO BEGINNING.                                   
473810    SET S500B04MOVIMIENTO     TO BEGINNING.                                   
473820    SET B04SXFECCTOAUT        TO BEGINNING.                                   
474400    SET S500B05INSTRUMEN      TO BEGINNING.                                   
475000    SET S500B06HISTORICO      TO BEGINNING.                                   
475600 20000100-EXIT.                                                               
476200    EXIT.                                                                     
476800                                                                              
477400******************************************************************            
478000* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
478600******************************************************************            
479200 20000200-FECHA-PRO.                                                          
479800   PERFORM 90000002-B02CONTROL-FIND                                           
480400   IF WS-STATUS-BASE > 0                                                      
481000      IF WS-STATUS-BASE = 1                                                   
482800         MOVE "NO EXISTE B02 EN BASE "      TO WS-0101-TEXT-MSG               
483400         PERFORM 70000050-MENSAJE                                             
484000         CALL SYSTEM DMTERMINATE                                              
484600      ELSE                                                                    
486400         STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                  
487000         DELIMITED BY SIZE INTO             WS-0101-TEXT-MSG                  
487600         PERFORM 70000050-MENSAJE                                             
488200         CALL SYSTEM DMTERMINATE.                                             
488800                                                                              
489400     PERFORM 20000210-PROY-FEC                THRU 20000210-EXIT.             
490600     MOVE WS-FECHA-PRO   TO WS-CAP-FECHA    WS-GER-FECHA                      
491200                            WS-FECHA-PASO   GER-FEC-OPE                       
491205                            WS-CAN-FECHA    WKS-TIT-ART-FEC                   
491206                            WS-FEC-REG-00.                                    
491210                                                                              
492400     MOVE WS-TAB-CSI(B02-NUM-CSI) TO WS-GER-CSI.                              
493010     MOVE B02-NUM-CSI    TO WS-CSITEM.                                        
493020     MOVE B02-NUM-CSI    TO WKS-TIT-ART-CSI WS-CSI-REG-00.                    
493600     MOVE WS-PRO-DD      TO WS-CAPAH-DIA1 WS-CANCE-DIA1.                      
494200     MOVE WS-PRO-MM      TO WS-CAPAH-MES1 WS-CANCE-MES1.                      
494800     MOVE WS-PRO-AA      TO WS-CAPAH-ANO1 WS-CANCE-ANO1.                      
494810     MOVE 01             TO WS-PASO-DD.                                       
494820                                                                              
494830     PERFORM 90000000-B00CTRLPASO-FIND.                                       
494832                                                                              
494834     IF WS-STATUS-BASE > 0                                                    
494836        MOVE "NO EXISTE B00 EN BASE "      TO WS-0101-TEXT-MSG                
494838        PERFORM 70000050-MENSAJE                                              
494840        CALL SYSTEM DMTERMINATE.                                              
494845                                                                              
494850     MOVE B00-FECH-ART61      TO WS-FEC-TRS-BENF.                             
494852     MOVE B00-IMP-300SMDF     TO W77-IMP-300-SMVDF.                           
494853                                                                              
494854*** Modificar el importe cuando cambie SMVDF (67.20 * 300)                    
494855     IF W77-IMP-300-SMVDF > 0                                                 
494856        NEXT SENTENCE                                                         
494857     ELSE                                                                     
494858        MOVE 20187.00  TO W77-IMP-300-SMVDF.                                  
494860                                                                              
494862     MOVE WS-FEC-TRS-BENF TO WS-MSG-N-08.                                     
494864     STRING "FECHA PARA TRSP BENEF (B00)" WS-MSG-N-08                         
494868             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
494870     PERFORM 70000050-MENSAJE.                                                
494880                                                                              
495400 20000200-EXIT.                                                               
496000    EXIT.                                                                     
496600                                                                              
497200******************************************************************            
497800* PROYECTO LA FECHA DE LA BASE UN DIA HACIA ATRAS YA QUE EN EL                
498400* MOMENTO DE LA CORRIDA DE ESTE PASO LAS FECHAS YA CORRESPONDEN               
499000* AL SIGUIENTE DIA. POR LA PROYECCION DE LA PRELINEA.                         
499600******************************************************************            
500200 20000210-PROY-FEC.                                                           
500220    MOVE B02-FECHA-LINEA         TO    WS-S006-FECHA1                         
500230    MOVE 1                       TO    WS-S006-FECHA2                         
500240    MOVE 12                      TO    WS-S006-FORMATO                        
500250    MOVE 15                      TO    WS-S006-FUNCION                        
500260    PERFORM 40000000-CALL-FECHAS THRU  40000000-EXIT.                         
500270    MOVE WS-S006-FECHA1          TO    WS-FECHA-PRO.                          
503800 20000210-EXIT.                                                               
504400    EXIT.                                                                     
505000                                                                              
505600******************************************************************            
506200* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
506800******************************************************************            
507400 20000300-HORA.                                                               
508000        ACCEPT  WS-HORA-HMSC-N    FROM TIME.                                  
508600        MOVE WS-HORA-HH-N     TO  WS-IMP-HH                                   
509200        MOVE WS-HORA-MM-N     TO  WS-IMP-MM                                   
509800        MOVE WS-HORA-SS-N     TO  WS-IMP-SS.                                  
510400 20000300-EXIT.                                                               
511000    EXIT.                                                                     
511600                                                                              
512200******************************************************************            
512800* OBTENGO LA FECHA DEL LA MAQUINA PARA LA GENERACION DE REPORTES.             
513400******************************************************************            
514000 20000400-FECHA-DIA.                                                          
514600        PERFORM 90000000-DAME-FEC-MAQUINA.                                    
515200        MOVE WKS-DD-MAQ           TO    WS-DIA-DD.                            
515800        MOVE WKS-MM-MAQ           TO    WS-DIA-MM.                            
516400        MOVE WKS-AAAA-MAQ         TO    WS-DIA-AA.                            
516410                                                                              
517000        MOVE WS-DIA-DD            TO    WS-CAPAH-DIA WS-CANCE-DIA.            
517600        MOVE WS-DIA-MM            TO    WS-CAPAH-MES WS-CANCE-MES.            
518200        MOVE WS-DIA-AA            TO    WS-CAPAH-ANO WS-CANCE-ANO.            
518210        MOVE WS-FECHA-DIA         TO    GER-FEC-PROCESO.                      
519400 20000400-EXIT.                                                               
520000    EXIT.                                                                     
520010                                                                              
520090*****************************************************************             
520100**Busca primer Viernes habil del proximo aùo ********************             
520110 20000410-FECHA-BENEF.                                                        
520112     MOVE WS-FECHA-PRO      TO WS-FEC-1ER-VIE.                                
520114     ADD  1                 TO WS-AA-1ER-VIE.                                 
520116     MOVE 1                 TO WS-MM-1ER-VIE.                                 
520118     MOVE 1                 TO WS-DD-1ER-VIE.                                 
520120     MOVE 0                 TO W77-FEC-OK.                                    
520122                                                                              
520124     PERFORM 20000411-1ER-VIER THRU 20000411-EXIT                             
520126             UNTIL W77-FEC-OK = 1.                                            
520128                                                                              
520130     MOVE ZERO            TO W77-FEC-OK.                                      
520132*** Verifica 1er viernes del aùo h¾bil **************                         
520134     PERFORM 20000412-DIA-HAB-VIER THRU 20000412-EXIT                         
520135             UNTIL W77-FEC-OK = 1.                                            
520136                                                                              
520138** En el campo WS-FEC-1ER-VIE esta la fecha del                               
520140** Primer viernes del proximo aùo *****                                       
520142     MOVE WS-FEC-1ER-VIE  TO WS-MSG-N-08.                                     
520144     STRING "PRIMER VIERNES PROX-AµO=", WS-MSG-N-08                           
520146             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
520148     PERFORM 70000050-MENSAJE.                                                
520150                                                                              
520152**LLAMADO PARA OBTENER LOS 36 MESES ATRAS PARA EL               **            
520153**EN BASE A LA FECHA 36 MESES 90 DIAS QUE DEJA EL P130          **            
520154**TRASPASO A BENEFICENCIA Y PINTAR PRIMER VIERNES HABIL.        **            
520156     IF WS-FEC-TRS-BENF > 0                                                   
520158        MOVE WS-FEC-TRS-BENF        TO WS-S006-FECHA1                         
520160        MOVE 0090                   TO WS-S006-FECHA2                         
520162        MOVE 13                     TO WS-S006-FORMATO                        
520164        MOVE 08                     TO WS-S006-FUNCION                        
520166        PERFORM 40000000-CALL-FECHAS THRU  40000000-EXIT                      
520168        MOVE WS-S006-FECHA1         TO WS-FEC-3600-ANT.                       
520170                                                                              
520172     MOVE WS-FEC-3600-ANT TO WS-MSG-N-08.                                     
520174     STRING "FEC-3600-ANT 1ER VIER-PROX-ANH=" WS-MSG-N-08                     
520176             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
520178     PERFORM 70000050-MENSAJE.                                                
520200                                                                              
520250 20000410-EXIT.                                                               
520255     EXIT.                                                                    
520260                                                                              
520300*****************************************************************             
520400 20000411-1ER-VIER.                                                           
520410     MOVE WS-FEC-1ER-VIE         TO WS-S006-FECHA1.                           
520412     MOVE 0                      TO WS-S006-FECHA2.                           
520414     MOVE 12                     TO WS-S006-FORMATO.                          
520416     MOVE 6                      TO WS-S006-FUNCION.                          
520418     PERFORM 40000000-CALL-FECHAS THRU  40000000-EXIT.                        
520420                                                                              
520422     IF WS-S006-FECHA1 = 5                                                    
520424        MOVE 1   TO W77-FEC-OK                                                
520426     ELSE                                                                     
520428        ADD  1  TO WS-DD-1ER-VIE.                                             
520430                                                                              
520440 20000411-EXIT.                                                               
520442     EXIT.                                                                    
520450                                                                              
520500**************************************************************                
520510 20000412-DIA-HAB-VIER.                                                       
520512     IF W77-FEC-OK = 0                                                        
520514        MOVE WS-FEC-1ER-VIE         TO WS-S006-FECHA1                         
520516        MOVE 0                      TO WS-S006-FECHA2                         
520518        MOVE 13                     TO WS-S006-FORMATO                        
520520        MOVE 18                     TO WS-S006-FUNCION                        
520522        PERFORM 40000000-CALL-FECHAS THRU  40000000-EXIT                      
520524        IF WS-S006-FECHA1 = 1                                                 
520526           MOVE 1  TO W77-FEC-OK                                              
520528        ELSE                                                                  
520530           ADD 7 TO WS-DD-1ER-VIE.                                            
520532                                                                              
520560 20000412-EXIT.                                                               
520562     EXIT.                                                                    
520600                                                                              
520610*****************************************************************             
520620* CARGO ESTRUCTURA EN UNA TABLA.                                              
520630*****************************************************************             
520640 20000450-CARGO-SUCS.                                                         
520650    PERFORM 40000300-CARGO-TABLA       THRU 40000300-EXIT.                    
520660    CANCEL "CTLVERS".                                                         
520670    CANCEL "S080TARIFAS".                                                     
520680    CANCEL "S080BD01CON".                                                     
520690 20000450-EXIT.                                                               
520700    EXIT.                                                                     
520710                                                                              
521200******************************************************************            
521800* ABRO LOS ARCHIVOS DEL DEL CIG.                                              
522400******************************************************************            
523000 20000500-OPEN-ARC.                                                           
524200       OPEN OUTPUT               GERENCIA.                                    
525400       MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WS-CAP-MIX                      
525410                                              WS-CAN-MIX.                     
526000       MOVE 0                              TO WS-CAP-NUM                      
526010                                              WS-CAN-NUM.                     
526020       OPEN OUTPUT   FILE-ART61.                                              
526022       MOVE " "      TO WS-ART-REG.                                           
526024                                                                              
526026       WRITE FD-R00-ART61 FROM WS-ART-REG-HED.                                
526030                                                                              
526600 20000500-EXIT.                                                               
527200    EXIT.                                                                     
527210                                                                              
527220******************************************************************            
527230*  RUTINA QUE IMPRIME EL HEADER DEL EL ARCHIVO GERENCIA.                      
527250******************************************************************            
527260 20000600-HEADER.                                                             
527270     MOVE "S500"                      TO GER-NUM-SISTEMA.                     
527280     MOVE "SISTEMA CAPTACION"         TO GER-NOM-SISTEMA.                     
527290     MOVE 1                           TO GER-TIPO-REG.                        
527300     WRITE REG-GERENCIA   INVALID KEY                                         
527330           MOVE "ERROR AL GRABAR HEA. GER." TO WS-0101-TEXT-MSG               
527340           PERFORM 70000050-MENSAJE                                           
527350           CALL SYSTEM DMTERMINATE.                                           
527360 20000600-EXIT.                                                               
527370     EXIT.                                                                    
527380                                                                              
527800                                                                              
538000                                                                              
538600                                                                              
539200                                                                              
539800                                                                              
540400                                                                              
541000                                                                              
541600                                                                              
542200                                                                              
542800******************************************************************            
543400******************************************************************            
544000*                                                                             
544600* R U T I N A S   D E   L L A M A D O S   A   L I B R E R I A S.              
545200*                 D E   L A   S E C T I O N   I.                              
545800*                                                                             
546400******************************************************************            
547000******************************************************************            
547600                                                                              
548200                                                                              
548800                                                                              
549400                                                                              
550000******************************************************************            
550600* LLAMADO A LA LIBRERIA DE FECHAS PARA OBTENER EL DIA HABIL                   
551200* ANTERIOR EN BASE A LA FECHA DE LA BASE.                                     
551800******************************************************************            
552400 40000000-CALL-FECHAS.                                                        
552410     PERFORM 20000006-LOCSUP.                                                 
552420     IF WS-S006-FUNCION > 0                                                   
552430        MOVE WS-S006-FUNCION              TO WS-MSG-RS                        
552460        STRING "ERROR AL ACCESAR LOCSUP", WS-MSG-RS                           
552475        DELIMITED BY SIZE INTO            WS-0101-TEXT-MSG                    
552480        PERFORM 70000050-MENSAJE                                              
552490        CALL SYSTEM DMTERMINATE.                                              
556000 40000000-EXIT.                                                               
556600     EXIT.                                                                    
556610                                                                              
556620******************************************************************            
556630* CARGO EN UNA TABLA TODOS LOS VALORES NECESARIOS DE STRUCTURA.               
556640******************************************************************            
557200 40000300-CARGO-TABLA.                                                        
557210    PERFORM 40000080-CARGA-DATOS-S080.                                        
557220    IF WKS-S080-RS-CARGA = 0 OR 1                                             
557222       NEXT SENTENCE                                                          
557224    ELSE                                                                      
557230       MOVE WKS-S080-RS-CARGA                TO WS-MSG-RS                     
557260       STRING "ERROR EN CARGA S080 RS=", WS-MSG-RS                            
557270              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
557280       PERFORM 70000050-MENSAJE                                               
557290       CALL SYSTEM DMTERMINATE.                                               
557300 40000300-EXIT.                                                               
557310    EXIT.                                                                     
557320                                                                              
557800******************************************************************            
558400* LLAMADO A LA LIBRERIA "LIBEST" PARA OBTENER EL NOMBRE DE LA                 
559000* SUCURSAL EN BASE A SU NUMERO.                                               
559600******************************************************************            
560200 41000000-CALL-SUCNOM.                                                        
560210     PERFORM 42000080-DATOS-S080.                                             
560220     IF WKS-S080-STA-DATO = 0                                                 
560230        MOVE WKS-S080-NOMCORTO        TO WS-NOMSUC1                           
560240     ELSE                                                                     
560250        MOVE "SUCURSAL SIN NOMBRE"    TO WS-NOMSUC1.                          
565000 41000000-EXIT.                                                               
565600     EXIT.                                                                    
566200                                                                              
566800******************************************************************            
567400* LLAMADO A LA LIBRERIA "LIBEST" PARA OBTENER EL NODO EN BASE A               
568000* EL NUMERO DE SUCURSAL.                                                      
568600******************************************************************            
569200 42000000-CALL-NODO.                                                          
569210     PERFORM 42000080-DATOS-S080.                                             
569220     IF (WKS-S080-STA-DATO = 0) AND (WKS-S080-NODO-IMP > 0)                   
569230        MOVE WKS-S080-NODO-IMP       TO WS-NUMSUC1                            
569240     ELSE                                                                     
569250        MOVE WS-CSITEM               TO WS-NUMSUC1.                           
574000 42000000-EXIT.                                                               
574600     EXIT.                                                                    
575200                                                                              
579400                                                                              
580000                                                                              
580600                                                                              
581200                                                                              
583600******************************************************************            
584200******************************************************************            
584800*                                                                             
585400*       P  R  O  C  E  S  O  S   D E  L A  S E C T I O N  I.                  
586000*     E J E C U C I O N  D E  T O D O S  L O S  P R O C E S O S               
586600*                      D E L    P R O G R A M A.                              
587200*                                                                             
587800******************************************************************            
588400******************************************************************            
589000                                                                              
589600 50000000-PROCESOS.                                                           
590200   PERFORM 51000000-LEOMOV  THRU 51000000-EXIT UNTIL WS-6VEZ = 1.             
590800   PERFORM 52000000-ORDINV  THRU 52000000-EXIT.                               
590840   PERFORM 53050000-ORDART  THRU 53050000-EXIT.                               
592000 50000000-EXIT.                                                               
592600    EXIT.                                                                     
593200                                                                              
593800******************************************************************            
594400* LEO LOS MOVIMIENTOS DE AHORROS MENSUALES Y LOS GRABO EN EL                  
595000* ARCHIVO GERENCIAL.                                                          
596200******************************************************************            
596800 51000000-LEOMOV.                                                             
596810     PERFORM 90000004-B04SXFECCTOAUT-FINDN                                    
596815     IF WS-STATUS-BASE > 0                                                    
596820      IF WS-STATUS-BASE = 1                                                   
596825        MOVE 1 TO WS-6VEZ                                                     
596830        MOVE 0 TO WS-STATUS-BASE                                              
596835      ELSE                                                                    
596850        STRING "ERROR AL HACER LOCK A B04 ",WS-STATUS-BASE                    
596855        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
596860        PERFORM 70000050-MENSAJE                                              
596865        CALL SYSTEM DMTERMINATE.                                              
596870                                                                              
596875     IF  WS-6VEZ = 0                                                          
596880          IF B04-STATUS-MOVTO = 1                                             
596885             NEXT SENTENCE                                                    
596890          ELSE                                                                
596895             IF (B04-FEC-MOVTO = WS-FECHA-PASO) OR                            
596900                (B04-FEC-MOVTO > WS-FECHA-PASO)                               
596905                PERFORM 51100000-DET-GER    THRU 51100000-EXIT.               
596910 51000000-EXIT.                                                               
596915     EXIT.                                                                    
596920                                                                              
596925****************************************************************              
596930* GRABO EL ARCHIVO GERENCIAL CON TODOS AQUELLOS MOVIMIENTOS QUE               
596935* CUMPLIERON CON LA FECHA ESPECIFICA.                                         
596940****************************************************************              
596945 51100000-DET-GER.                                                            
596950    MOVE 3                          TO GER-TIPO-REG                           
596955    MOVE B04-NUM-CONTRATO           TO GER-MOV-CONTRATO                       
596960    MOVE B04-FEC-MOVTO              TO GER-MOV-FECHA                          
596965    MOVE B04-FEC-VALOR              TO GER-MOV-FECVAL                         
596970    MOVE B04-SUC-TRANSMITE          TO GER-MOV-SUCTRANS                       
596975    MOVE B04-SUC-PROMOTORA          TO GER-MOV-SUCPROM                        
596980    MOVE B04-CLAVE-MOVTO            TO GER-MOV-CVETRAN                        
596985    MOVE B04-IMPORTE                TO GER-MOV-IMPORTE                        
596990    MOVE B04-MONEDA                 TO GER-MOV-MONEDA                         
596995    MOVE B04-INTS-CANCEL            TO GER-MOV-INTCAN                         
597000    MOVE 0                          TO GER-MOV-TIPDEP                         
597005    ADD  1                          TO WS-NUM                                 
597010    ADD  B04-IMPORTE                TO WS-TOT-SDOACT.                         
597015    WRITE REG-GERENCIA INVALID KEY                                            
597030        MOVE "ERROR AL GRABAR MOV. GER." TO WS-0101-TEXT-MSG                  
597035        PERFORM 70000050-MENSAJE                                              
597040        CALL SYSTEM DMTERMINATE.                                              
597045 51100000-EXIT.                                                               
597050     EXIT.                                                                    
611800                                                                              
612400****************************************************************              
613000* ORDENO EL DATASET DE INVERSIONES POR NODO PARA AQUELLOS CTOS QUE            
613600* SON DE AHORROS PARA GENERAR LOS LISTADOS ORDENADOS POR NODO Y               
614200* POR SUCURSAL.                                                               
614800****************************************************************              
615400 52000000-ORDINV.                                                             
616000    SORT SORT-INVE ON ASCENDING KEY                                           
616600         INV-NODO-S INV-SUCPRO-S INV-INDCAN-S INV-CANCELO-S                   
616610         INV-NUMCTO-S                                                         
617200         INPUT  PROCEDURE 52100000-ORDENO                                     
617800         OUTPUT PROCEDURE 52200000-LEO                                        
617810                MEMORY SIZE WS-SORT-ESPACIO1 WORDS                            
618400                DISK   SIZE WS-SORT-ESPACIO WORDS.                            
619000 52000000-EXIT.                                                               
619600    EXIT.                                                                     
620200                                                                              
620300****************************************************************              
621000 53050000-ORDART.                                                             
621020                                                                              
621022     WRITE FD-R00-ART61 FROM WS-ART-REG-TRL.                                  
621024                                                                              
621030     CLOSE FILE-ART61 WITH SAVE.                                              
621031     WAIT (05).                                                               
621050                                                                              
621110     COMPUTE WS-SORT-DKS = (WS-REG-ART61 + 12) * 33 * 3.5.                    
621120     COMPUTE WS-SORT-MEN = ((WS-REG-ART61 / 16) * 33) + 1500.                 
621130                                                                              
621140     IF WS-SORT-MEN < 400000                                                  
621150        MOVE 400000 TO WS-SORT-MEN                                            
621160     ELSE                                                                     
621170     IF WS-SORT-MEN > 258435000                                               
621180        MOVE 25843500 TO WS-SORT-MEN.                                         
621190                                                                              
621200     MOVE WS-SORT-DKS  TO WS-MSG-N-14.                                        
621210     MOVE WS-SORT-MEN  TO WS-MSG-N-12.                                        
621220     STRING "DISK-SIZE =" WS-MSG-N-14                                         
621230            ", MEMORY-SIZE =" WS-MSG-N-12                                     
621240            ", PARA SORT FILE-ART61 "                                         
621250            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
621260     PERFORM 70000050-MENSAJE.                                                
621270                                                                              
621280     SORT SORT-ART61 ON ASCENDING KEY SD-ART-TPREG                            
621282                                      SD-ART-STBENF                           
621284                                      SD-ART-CONT                             
621290                                                                              
621380          USING  FILE-ART61                                                   
621390         GIVING  FILE-ART61  SAVE                                             
621400                 MEMORY SIZE WS-SORT-MEN WORDS                                
621410                 DISK   SIZE WS-SORT-DKS WORDS.                               
621420                                                                              
621460 53050000-EXIT.                                                               
621462     EXIT.                                                                    
621470                                                                              
621500**************************************************************                
626200                                                                              
629200                                                                              
632200                                                                              
632800                                                                              
633400                                                                              
635800******************************************************************            
636400*     S E C C I O N    D E    O R D E N A M I E N T O.                        
637000*   R U T I N A S   P A R A   L A   S E C T I O N    I I.                     
637600******************************************************************            
638200                                                                              
638800                                                                              
639400                                                                              
640000                                                                              
640600                                                                              
641200******************************************************************            
641800* ORDENO EL ARCHIVO POR NODO, SUCURSAL Y CONTRATO DE TODOS LOS                
642400* CONTRATOS CUYO PRODUCTO PERTENECE A AHORROS.                                
643000******************************************************************            
643600 52100000-ORDENO SECTION.                                                     
644200 52110000-LEO-INVER.                                                          
644800   PERFORM 52111000-SEL THRU 52111000-EXIT UNTIL WS-2VEZ = 1.                 
645400   GO TO   52100000-EXIT.                                                     
646000 52110000-EXIT.                                                               
646600   EXIT.                                                                      
647200                                                                              
647800******************************************************************            
648400******************************************************************            
649000*                                                                             
649600* R U T I N A S   D E   L L A M A D O S   A   L I B R E R I A S.              
650200*                                                                             
650800******************************************************************            
651400******************************************************************            
652000                                                                              
652600                                                                              
653200                                                                              
653800                                                                              
654400******************************************************************            
655000* LEO EL DATASET DE INVERSIONES PARA SORTEARLO.                               
655600******************************************************************            
656200 52111000-SEL.                                                                
656800  PERFORM 90000003-B03CONTRATOS-FINDN                                         
657400  IF WS-STATUS-BASE > 0                                                       
658000      IF WS-STATUS-BASE = 1                                                   
658600         PERFORM 52114000-TRAILER THRU 52114000-EXIT                          
659200         MOVE 1 TO WS-2VEZ                                                    
659800      ELSE                                                                    
661600         STRING "ERROR AL HACER FINDN A B03 ",WS-STATUS-BASE                  
662200         DELIMITED BY SIZE INTO             WS-0101-TEXT-MSG                  
662800         PERFORM 70000050-MENSAJE                                             
663400         CALL SYSTEM DMTERMINATE.                                             
664000                                                                              
664600  IF WS-2VEZ = 0                                                              
664610     IF  B03-NUM-PRODUCTO = 500 AND B03-NUM-INSTRUM = 6                       
664620         IF B03-STATUS = 2                                                    
664630            NEXT SENTENCE                                                     
664640         ELSE                                                                 
664650           PERFORM 52112100-GERENCIAL  THRU 52112100-EXIT                     
664655           MOVE 0                      TO   INV-INDCAN-S                      
664657           MOVE 0                      TO   INV-CANCELO-S                     
664660           MOVE 1                      TO   WS-BAN-SIAHO                      
664665           PERFORM 52112200-LLENO-SORT THRU 52112200-EXIT                     
664670     ELSE                                                                     
664675     IF B03-STA-CANCEL > 0                                                    
664680        MOVE B03-STA-CANCEL            TO   INV-INDCAN-S                      
664690        MOVE 1                         TO   WS-BAN-SICAN                      
664800        IF (B03-STATUS = 0 OR 1 OR 5)  AND                                    
664900           B03-MIGR-S111 NOT = 1                                              
665225           MOVE 1                      TO   INV-CANCELO-S                     
665800           PERFORM 52112200-LLENO-SORT THRU 52112200-EXIT                     
665810        ELSE                                                                  
665820        IF (B03-STATUS = 4 ) AND (B03-SDO-ACTUAL = 0)  AND                    
665825            B03-MIGR-S111 NOT = 1                                             
665830            MOVE 2                  TO   INV-CANCELO-S                        
665840            PERFORM 52112200-LLENO-SORT THRU 52112200-EXIT                    
665850        ELSE                                                                  
665860            NEXT SENTENCE                                                     
665870     ELSE                                                                     
665880        NEXT SENTENCE.                                                        
665900                                                                              
666000     IF WS-2VEZ = 0                                                           
666100       IF B03-STATUS = 0 OR 1 OR 5                                            
666110         IF B03-STA-BENEF = 3 OR 6 OR 7 OR 8                                  
666115            PERFORM 52112300-LLENO-ART61 THRU 52112300-EXIT.                  
666180                                                                              
667600 52111000-EXIT.                                                               
668200    EXIT.                                                                     
668800                                                                              
677200*****************************************************************             
677800* MUEVO LOS DATOS A GRABAR EN EL ARCHIVO GERENCIAL.                           
678400*****************************************************************             
679000 52112100-GERENCIAL.                                                          
679600      MOVE B03-NUM-CONTRATO       TO GER-NUM-CTA                              
680200      MOVE B03-NUM-CLIENTE        TO GER-NUM-CTE                              
680800      MOVE B03-FEC-ULTMOV         TO GER-FEC-ULMOV                            
681400      MOVE B03-MONEDA             TO GER-MONEDA                               
682000      MOVE B03-TIPO-PERSONA       TO GER-PERSONA                              
682600      MOVE B03-SDO-ACTUAL         TO GER-SDO-ACTUAL                           
683200      MOVE B03-SUC-PROMOTORA      TO GER-SUC                                  
683800      MOVE B03-NUM-CONTRATO       TO WS-NUM-CONTRATO                          
684400      MOVE B03-NUM-CONTRATO       TO WS-MSG-CTO                               
685000      PERFORM 52112110-LEOHIS     THRU 52112110-EXIT                          
685600      MOVE B06-SDOPROM-FINAN      TO GER-SDO-PROM                             
686200      MOVE B03-TASA-ANTERIOR      TO GER-TASA                                 
686800      ADD  B03-SDO-ACTUAL         TO WS-TOT-SDOACT                            
687400      ADD  1                      TO WS-NUM                                   
688000      MOVE 2                      TO GER-TIPO-REG                             
688600      WRITE REG-GERENCIA          INVALID KEY                                 
690400            MOVE "ERROR WRITE SDO GERAHO" TO WS-0101-TEXT-MSG                 
691000            PERFORM 70000050-MENSAJE                                          
691600            CALL SYSTEM DMTERMINATE.                                          
692200 52112100-EXIT.                                                               
692800    EXIT.                                                                     
693400                                                                              
694000******************************************************************            
694600* MUEVO LOS DATOS CON QUE SERA LLENADO EL ARCHIVO SORT.                       
695200******************************************************************            
695800 52112200-LLENO-SORT.                                                         
695810      MOVE B03-NUM-PRODUCTO             TO INV-PRODUCTO-S                     
695820      MOVE B03-NUM-INSTRUM              TO INV-INSTRUMENTO-S                  
695830      MOVE B03-MONEDA                   TO INV-MONEDA-S                       
696400      MOVE B03-NUM-CONTRATO             TO INV-NUMCTO-S                       
696410      MOVE B03-NUM-CLIENTE              TO INV-NUMCTE-S                       
697000      MOVE B03-SUC-PROMOTORA            TO INV-SUCPRO-S                       
697600      MOVE B03-TASA-ANTERIOR            TO INV-TASA-S                         
698200      MOVE B06-SDOPROM-FINAN            TO INV-SDOPRO-S                       
698800      MOVE B06-DIAS-CICLO               TO INV-DIASCAP-S                      
699400      MOVE B03-INTS-CAPIT               TO INV-INTSCAP-S                      
699410      MOVE B03-NOMBRE                   TO INV-NOMBRE-S                       
699420      MOVE B03-FEC-ULTACT               TO INV-FECULTM-S                      
700000      PERFORM 52112210-SUCNOM           THRU 52112210-EXIT                    
700600      MOVE  WS-NOMSUC1                  TO INV-SUCNOM-S                       
701200      PERFORM 52112220-NODO             THRU 52112220-EXIT                    
701800      MOVE  WS-NUMSUC1                  TO INV-NODO-S                         
702400      MOVE 0                            TO INV-SUBNODO-S                      
703000      RELEASE INVERSION-REG.                                                  
703600 52112200-EXIT.                                                               
704200    EXIT.                                                                     
704800                                                                              
704900***********************************************************                   
704950 52112300-LLENO-ART61.                                                        
705000     COMPUTE W77-SDO-TOT  = B03-SDO-ACTUAL + B03-SDOPROT-BLOQ.                
705002     MOVE B03-NUM-CONTRATO            TO WS-NUM-CONTRATO.                     
705005     PERFORM 52112110-LEOHIS   THRU 52112110-EXIT.                            
705007     MOVE 03                          TO WS-ART-TREG.                         
705010     MOVE B03-NUM-PRODUCTO            TO WS-ART-PROD.                         
705020     MOVE B03-NUM-INSTRUM             TO WS-ART-INST.                         
705030     MOVE B03-MONEDA                  TO WS-ART-MONE.                         
705040     MOVE B03-NUM-CONTRATO            TO WS-ART-CONT.                         
705050     MOVE B03-NUM-CLIENTE             TO WS-ART-CTE.                          
705060     MOVE B03-SUC-PROMOTORA           TO WS-ART-SUCP.                         
705070     MOVE B03-TIPO-PERSONA            TO WS-ART-TPOP.                         
705080     MOVE B03-STATUS                  TO WS-ART-STA.                          
705090     MOVE B03-SECTOR                  TO WS-ART-SECT.                         
705100     MOVE B03-IND-LINCREDIT           TO WS-ART-INLC.                         
705110     MOVE W77-SDO-TOT                 TO WS-ART-SDO.                          
705115     MOVE B03-SDO-CONGBENE            TO WS-ART-SDO-CONG.                     
705120     MOVE B03-FEC-ULTMOV              TO WS-ART-FEULTM.                       
705130     MOVE B06-FECH-XCTE               TO WS-ART-FECTE.                        
705140     MOVE B03-FEC-APERTURA            TO WS-ART-FECAPE.                       
705150     MOVE B03-NOMBRE                  TO WS-ART-NOMBRE.                       
705160     MOVE B03-FECH-BENEF              TO WS-ART-FECART61.                     
705162     MOVE B03-FECH-BENEF              TO WS-FECH-BENF.                        
705200                                                                              
705210     IF B03-STA-BENEF = 7                                                     
705212        MOVE 05   TO WS-ART-STBENF                                            
705214     ELSE                                                                     
705216     IF B03-STA-BENEF = 6                                                     
705218        MOVE 04   TO WS-ART-STBENF                                            
705220     ELSE                                                                     
705222     IF B03-STA-BENEF = 8                                                     
705224        MOVE 03   TO WS-ART-STBENF                                            
705226     ELSE                                                                     
705228     IF WS-MM-BENF = WS-PRO-MM  AND                                           
705229        WS-AA-BENF = WS-PRO-AA                                                
705230        MOVE 02   TO WS-ART-STBENF                                            
705232     ELSE                                                                     
705234        MOVE 01   TO WS-ART-STBENF.                                           
705250                                                                              
705252     IF WS-ART-STBENF > 0 AND < 8                                             
705254        MOVE WKS-TB-ART61(WS-ART-STBENF)                                      
705256          TO WS-ART-LEYBENF                                                   
705258     ELSE                                                                     
705260        MOVE "XXX "  TO WS-ART-LEYBENF.                                       
705262                                                                              
705264     MOVE " "  TO WS-ART-FTRSBEN-X.                                           
705266                                                                              
705268     IF WS-ART-STBENF < 4                                                     
705270        IF WS-FECH-BENF > WS-FEC-3600-ANT                                     
705272           NEXT SENTENCE                                                      
705274        ELSE                                                                  
705276        IF W77-SDO-TOT > W77-IMP-300-SMVDF                                    
705278           NEXT SENTENCE                                                      
705280        ELSE                                                                  
705281        IF WS-AA-BENF = WS-AA-FEC3600                                         
705282           MOVE WS-FEC-1ER-VIE  TO WS-ART-FTRSBEN.                            
705284                                                                              
705286     PERFORM 52112320-ESC-ART61  THRU 52112320-EXIT.                          
705288                                                                              
705290 52112300-EXIT.                                                               
705292     EXIT.                                                                    
705298                                                                              
705300********************************************************                      
705310 52112320-ESC-ART61.                                                          
705315                                                                              
705320     WRITE FD-R00-ART61 FROM WS-ART-REG INVALID KEY                           
705322           MOVE "ERROR WRITE ART61 " TO WS-0101-TEXT-MSG                      
705324           PERFORM 70000050-MENSAJE                                           
705326           CALL SYSTEM DMTERMINATE.                                           
705328                                                                              
705330     ADD 1 TO WS-REG-ART61 WS-TOT-REG-99.                                     
705332                                                                              
705340 52112320-EXIT.                                                               
705342     EXIT.                                                                    
705350                                                                              
705400****************************************************************              
706000* ACCESO EL DATASET HISTORICO PARA OBTENER UNOS CAMPOS ADICIONALES            
706600* PARA EL ARCHIVO DEL CIG. Y PARA EL SORTEO DE LOS CTOS DE CAPIT.             
707200****************************************************************              
707800 52112110-LEOHIS.                                                             
708400    PERFORM 90000006-B06SXCTO-LOCK                                            
709000    IF WS-STATUS-BASE > 0                                                     
709600       IF WS-STATUS-BASE = 1                                                  
711400          STRING  "CTO INEXISTENTE EN B06 ",WS-MSG-CTO                        
712000                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
712600          PERFORM 70000050-MENSAJE                                            
713200          CALL SYSTEM DMTERMINATE                                             
713800       ELSE                                                                   
715600        STRING "ERROR AL HACER LOCK  A B06 ",WS-STATUS-BASE                   
716200        DELIMITED BY SIZE INTO               WS-0101-TEXT-MSG                 
716800        PERFORM 70000050-MENSAJE                                              
717400        CALL SYSTEM DMTERMINATE.                                              
718000 52112110-EXIT.                                                               
718600    EXIT.                                                                     
719200                                                                              
719800******************************************************************            
720400* ACCESO LA LIBRERIA L700      PARA OBTENER EL NOMBRE DE LA SUC.              
721000* EN BASE AL NUMERO DE ESTA.                                                  
721600******************************************************************            
722200 52112210-SUCNOM.                                                             
722210     MOVE 315               TO WKS-S080-NUMPASO.                              
722220     MOVE B03-SUC-PROMOTORA TO WKS-S080-NUMSUC.                               
722223     MOVE WS-FECHA-PRO      TO WKS-S080-FECHA.                                
722230     PERFORM 41000000-CALL-SUCNOM  THRU 41000000-EXIT.                        
724600 52112210-EXIT.                                                               
725200    EXIT.                                                                     
725800                                                                              
726400******************************************************************            
727000* ACCESO LA LIBRERIA L700      PARA OBTENER EL NODO Y SUBNODO DEL             
727600* CONTRATO EN BASE AL NUMERO DE LA SUCURSAL A LA QUE PERTENECE.               
728200******************************************************************            
728800 52112220-NODO.                                                               
728810     MOVE B03-SUC-PROMOTORA      TO WKS-S080-NUMSUC.                          
728820     MOVE 315                    TO WKS-S080-NUMPASO.                         
728830     MOVE WS-FECHA-PRO           TO WKS-S080-FECHA.                           
730600     PERFORM 42000000-CALL-NODO      THRU 42000000-EXIT.                      
731200 52112220-EXIT.                                                               
731800    EXIT.                                                                     
748600                                                                              
749200****************************************************************              
749800* GRABO EL TRAILER DEL ARCHIVO GERENCIAL TANTO DE AHORROS COMO                
750400* DEL RESTO DE PRODUCTOS.                                                     
751000****************************************************************              
751600 52114000-TRAILER.                                                            
751640     MOVE SPACES            TO REG-GERENCIA                                   
752200     MOVE          4        TO GER-TIPO-REG.                                  
753400     MOVE WS-NUM            TO GER-NUM-REG.                                   
754600     MOVE WS-TOT-SDOACT     TO GER-IMPO.                                      
755800     WRITE REG-GERENCIA     INVALID KEY                                       
757600         MOVE "ERROR WRITE TRAILER GERAHO" TO WS-0101-TEXT-MSG                
758200         PERFORM 70000050-MENSAJE                                             
758800         CALL SYSTEM DMTERMINATE.                                             
763000 52114000-EXIT.                                                               
763600    EXIT.                                                                     
764200                                                                              
782800****************************************************************              
783400* ME SALGO DE LA SECCION DE ORDENAMIENTO.                                     
784000****************************************************************              
784600 52100000-EXIT.                                                               
785200     EXIT.                                                                    
785800                                                                              
786400                                                                              
787000                                                                              
787600                                                                              
788200                                                                              
788800******************************************************************            
789400*     S E C C I O N    D E    L E C T U R A    D E L                          
790000* A R C H I V O   O R D E N A D O   S E C T I O N    I I I.                   
790600******************************************************************            
791200                                                                              
791800                                                                              
792400                                                                              
793000                                                                              
793600                                                                              
794200******************************************************************            
794800* LEO EL ARCHIVO ORDENADO POR NODO,SUC,PRD,INS,MON CONTRATO PARA              
795400* GENERAR EL LISTADO DE CAPITALIZACION DE AHORROS Y DE CONTRATOS              
795410* CANCELADOS EN FORMA AUTOMATICA.                                             
796000******************************************************************            
796600 52200000-LEO SECTION.                                                        
797200 52210000-LEO-INV.                                                            
797800   PERFORM 52211000-LEO THRU 52211000-EXIT UNTIL WS-3VEZ = 1.                 
798400   GO TO   52200000-EXIT.                                                     
799000 52210000-EXIT.                                                               
799600   EXIT.                                                                      
800200                                                                              
800800******************************************************************            
801400* LEO EL ARCHIVO ORDENADO PARA GENERAR EL REPORTE.                            
802000******************************************************************            
802600 52211000-LEO.                                                                
803200   RETURN SORT-INVE   AT END                                                  
803210      IF WS-BAN-SIAHO = 1                                                     
803800         PERFORM 52211420-TOT-SUC   THRU 52211420-EXIT                        
804400         PERFORM 52211600-TOT-NODO  THRU 52211600-EXIT                        
805000         PERFORM 52211700-TOT-CSI   THRU 52211700-EXIT                        
805600         MOVE 1    TO  WS-3VEZ.                                               
806200                                                                              
806800   IF WS-3VEZ = 0                                                             
806810      IF INV-PRODUCTO-S = 500 AND INV-INSTRUMENTO-S = 6                       
807400         PERFORM 52211100-INIAHO  THRU 52211100-EXIT                          
808000         PERFORM 52211400-DETALLE THRU 52211400-EXIT                          
808010      ELSE                                                                    
808020         PERFORM 52211150-INICAN  THRU 52211150-EXIT                          
808030         PERFORM 52211405-DETALLE THRU 52211405-EXIT.                         
808600 52211000-EXIT.                                                               
809200    EXIT.                                                                     
809800                                                                              
810400******************************************************************            
811000* PROCESO QUE SOLO SE EJECUTA LA PRIMERA VEZ.                                 
811600******************************************************************            
812200 52211100-INIAHO.                                                             
812800    IF WS-4VEZ = 0                                                            
813400       MOVE INV-TASA-S            TO WS-TASA                                  
814000       MOVE INV-SUCPRO-S          TO WS-SUC-ANT WS-NUMSUC                     
814600       MOVE INV-NODO-S            TO WS-NODO-ANT                              
815200       MOVE INV-SUCNOM-S          TO WS-NOMSUC                                
815800       MOVE INV-PRODUCTO-S        TO WS-NUM-PRODUCTO                          
816400       MOVE INV-INSTRUMENTO-S     TO WS-NUM-INSTRUM                           
817000       MOVE INV-MONEDA-S          TO WS-MONEDA                                
817600       PERFORM 52211310-BUSCO-PRD THRU 52211310-EXIT                          
818200       MOVE B05-NOMBRE-PROD       TO WS-CAPAH-NOMBRE                          
818800       MOVE B05-NUM-PRODUCTO      TO WS-CAPAH-PRD                             
819400       MOVE B05-NUM-INSTRUM       TO WS-CAPAH-INS                             
820000       MOVE B05-MONEDA            TO WS-CAPAH-MON                             
820600       PERFORM 52211200-VAL-NODO   THRU 52211200-EXIT                         
821200       PERFORM 52211300-ENCABEZADO THRU 52211300-EXIT                         
821800       MOVE 1                     TO WS-4VEZ.                                 
822400 52211100-EXIT.                                                               
823000    EXIT.                                                                     
823600                                                                              
823605******************************************************************            
823610* PROCESO QUE SOLO SE EJECUTA LA PRIMERA VEZ EN EL REP DE CANCELA.            
823615******************************************************************            
823620 52211150-INICAN.                                                             
823625    IF WS-7VEZ = 0                                                            
823630       MOVE INV-SUCPRO-S          TO WS-SUC-ANT1 WS-NUMSUC-A                  
823635       MOVE INV-NODO-S            TO WS-NODO-ANT1                             
823640       MOVE INV-SUCNOM-S          TO WS-NOMSUC-A                              
823642       MOVE INV-INDCAN-S          TO WS-INDCAN-ANT                            
823643       MOVE INV-CANCELO-S         TO WS-CANCELO-ANT                           
823645       PERFORM 52211250-VAL-NODO   THRU 52211250-EXIT                         
823650       PERFORM 52211350-ENCABEZADO THRU 52211350-EXIT                         
823655       MOVE 1                     TO WS-7VEZ.                                 
823660 52211150-EXIT.                                                               
823665    EXIT.                                                                     
823670                                                                              
824200******************************************************************            
824800* VALIDO EL NODO PARA LA SEPARACION DE BACKUPS DEL REPORTE DE AHO.            
825400******************************************************************            
826000 52211200-VAL-NODO.                                                           
826600    IF WS-5VEZ = 0                                                            
827200       MOVE INV-NODO-S      TO WS-CAP-CI                                      
827800       MOVE INV-SUBNODO-S   TO WS-CAP-SUBNODO                                 
828400       SET FILE-CAPAHO(USERBACKUPNAME)  TO VALUE TRUE                         
829000       CHANGE ATTRIBUTE TITLE OF FILE-CAPAHO TO WS-ETIQ-CAPAHO                
829600       OPEN OUTPUT FILE-CAPAHO                                                
830200       MOVE 1 TO WS-5VEZ.                                                     
830800                                                                              
831400    IF INV-NODO-S NOT = WS-NODO-ANT                                           
832000       PERFORM 52211600-TOT-NODO      THRU 52211600-EXIT                      
832600       CLOSE FILE-CAPAHO                                                      
833200       MOVE 0                        TO WS-PAGINA                             
833800       MOVE INV-NODO-S               TO WS-NODO-ANT                           
834400       MOVE INV-NODO-S               TO WS-CAP-CI                             
835000       MOVE INV-SUBNODO-S            TO WS-CAP-SUBNODO                        
835600       SET FILE-CAPAHO(USERBACKUPNAME)  TO VALUE TRUE                         
836200       CHANGE ATTRIBUTE TITLE OF FILE-CAPAHO TO WS-ETIQ-CAPAHO                
836800       OPEN OUTPUT FILE-CAPAHO.                                               
837400 52211200-EXIT.                                                               
838000    EXIT.                                                                     
838600                                                                              
838605******************************************************************            
838610* VALIDO EL NODO PARA LA SEPARACION DE BACKUPS. DEL REPORTE DE CAN            
838615******************************************************************            
838620 52211250-VAL-NODO.                                                           
838625    IF WS-8VEZ = 0                                                            
838630       MOVE INV-NODO-S      TO WS-CAN-CI                                      
838635       MOVE INV-SUBNODO-S   TO WS-CAN-SUBNODO                                 
838640       SET FILE-CANCEL(USERBACKUPNAME)  TO VALUE TRUE                         
838645       CHANGE ATTRIBUTE TITLE OF FILE-CANCEL TO WS-ETIQ-CANCEL                
838650       OPEN OUTPUT FILE-CANCEL                                                
838655       MOVE 1 TO WS-8VEZ.                                                     
838660                                                                              
838665    IF INV-NODO-S NOT = WS-NODO-ANT1                                          
838670       CLOSE FILE-CANCEL                                                      
838675       MOVE 0                        TO WS-PAGINA1                            
838680       MOVE INV-NODO-S               TO WS-NODO-ANT1                          
838685       MOVE INV-NODO-S               TO WS-CAN-CI                             
838690       MOVE INV-SUBNODO-S            TO WS-CAN-SUBNODO                        
838695       SET FILE-CANCEL(USERBACKUPNAME)  TO VALUE TRUE                         
838700       CHANGE ATTRIBUTE TITLE OF FILE-CANCEL TO WS-ETIQ-CANCEL                
838705       OPEN OUTPUT FILE-CANCEL.                                               
838710 52211250-EXIT.                                                               
838715     EXIT.                                                                    
838720                                                                              
839200******************************************************************            
839800* IMPRIMO LOS ENCABEZADOS DEL LISTADO DE CAPITALIZACION MENSUAL               
840400* DE AHORROS.                                                                 
841000******************************************************************            
841600 52211300-ENCABEZADO.                                                         
841610        MOVE 0                   TO    WS-LINEA.                              
842200        MOVE SPACES              TO REG-CAPAHO.                               
842800        WRITE REG-CAPAHO         AFTER CHANNEL 1.                             
843400        WRITE REG-CAPAHO         FROM  WS-ENCABEZADO    BEFORE 1.             
844000        WRITE REG-CAPAHO         FROM  WS-ENCABEZADO1   BEFORE 1.             
844600        WRITE REG-CAPAHO         FROM  WS-03-CAPAH      BEFORE 1.             
845200        ADD   1                  TO    WS-PAGINA.                             
845800        MOVE  WS-PAGINA          TO    WS-CAPAH-HOJA                          
846400        WRITE REG-CAPAHO         FROM  WS-04-CAPAHO     BEFORE 1.             
847000        WRITE REG-CAPAHO         FROM  WS-IMP-HORA      BEFORE 2.             
847600        WRITE REG-CAPAHO         FROM  WS-CAPI-TASA     BEFORE 2.             
848200        WRITE REG-CAPAHO         FROM  WS-CAPI-SUCURSAL BEFORE 2.             
848800        WRITE REG-CAPAHO         FROM  WS-TIT-CAP       BEFORE 2.             
849400        MOVE 20                  TO    WS-LINEA.                              
850000 52211300-EXIT.                                                               
850600     EXIT.                                                                    
851200                                                                              
851205******************************************************************            
851210* IMPRIMO LOS ENCABEZADOS DEL LISTADO DE CANCELACIONES AUTOMATICAS            
851215******************************************************************            
851220 52211350-ENCABEZADO.                                                         
851225        MOVE 0                   TO    WS-LINEA1.                             
851230        MOVE SPACES              TO REG-CANCEL.                               
851235        WRITE REG-CANCEL         AFTER CHANNEL 1.                             
851240        WRITE REG-CANCEL         FROM  WS-ENCABEZADO    BEFORE 1.             
851245        WRITE REG-CANCEL         FROM  WS-ENCABEZADO1   BEFORE 1.             
851250        WRITE REG-CANCEL         FROM  WS-03-CANCE      BEFORE 1.             
851255        ADD   1                  TO    WS-PAGINA1.                            
851260        MOVE  WS-PAGINA1         TO    WS-CANCE-HOJA                          
851265        WRITE REG-CANCEL         FROM  WS-04-CANCEL     BEFORE 1.             
851270        WRITE REG-CANCEL         FROM  WS-IMP-HORA      BEFORE 2.             
851275        WRITE REG-CANCEL         FROM  WS-CANC-SUCURSAL BEFORE 2.             
851280        MOVE 18                  TO    WS-LINEA1.                             
851285 52211350-EXIT.                                                               
851290     EXIT.                                                                    
851295                                                                              
851800******************************************************************            
852400* ACCESO EL DATASET DE PRODUCTOS EN BASE AL PRD, INST Y MON.                  
853000* PARA OBTENER EL NOMBRE DEL PRODUCTO PARA LOS REPORTES.                      
853600***************************************************************               
854200 52211310-BUSCO-PRD.                                                          
854800     PERFORM 90000005-B05SXPRDINSTMON-FIND                                    
855400     IF WS-STATUS-BASE > 0                                                    
856000      IF WS-STATUS-BASE = 1                                                   
857800        MOVE "ERROR REG. NO EXISTE EN B05 "  TO WS-0101-TEXT-MSG              
858400        PERFORM 70000050-MENSAJE                                              
859000        MOVE WS-NUM-PRODUCTO                  TO WS-MSG-PRD                   
859600        MOVE WS-NUM-INSTRUM                   TO WS-MSG-INST                  
860200        MOVE WS-MONEDA                        TO WS-MSG-MDA                   
860800        PERFORM 52211320-DIS-PIM THRU         52211320-EXIT                   
861400        CALL SYSTEM DMTERMINATE                                               
862000      ELSE                                                                    
863800        STRING "ERROR AL HACER FIND A B05 " , WS-STATUS-BASE                  
864400        DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG                
865000        PERFORM 70000050-MENSAJE                                              
865600        CALL SYSTEM DMTERMINATE.                                              
866200 52211310-EXIT.                                                               
866800     EXIT.                                                                    
867400                                                                              
868000******************************************************************            
868600* DESPLIEGA EL PRODUCTO, INSTRUMENTO Y MONEDA DESEADO, YA SEA COMO            
869200* UN MSG. INFORMATIVO O COMO UN MSG. DE ERROR.                                
869800******************************************************************            
870400 52211320-DIS-PIM.                                                            
872200     STRING "PROD-INST-MONEDA ", WS-MSG-PRD                                   
872800                            "-", WS-MSG-INST                                  
873400                            "-", WS-MSG-MDA                                   
874000            DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                           
874600     PERFORM 70000050-MENSAJE.                                                
875200                                                                              
875800                                                                              
876400                                                                              
877000                                                                              
877600                                                                              
878200                                                                              
878800                                                                              
879400                                                                              
880000 52211320-EXIT.                                                               
880600     EXIT.                                                                    
881200                                                                              
881800******************************************************************            
882400* IMPRIME EL DETALLE DEL LISTADO DE CAPITALIZACION MENSUAL DE AHO.            
883000******************************************************************            
883600 52211400-DETALLE.                                                            
884200   IF WS-LINEA > 50                                                           
885400      IF INV-SUCPRO-S = WS-SUC-ANT                                            
886000        PERFORM 52211300-ENCABEZADO THRU 52211300-EXIT                        
886600        PERFORM 52211410-DATOS      THRU 52211410-EXIT                        
887200      ELSE                                                                    
887800        PERFORM 52211420-TOT-SUC    THRU 52211420-EXIT                        
888400        PERFORM 52211200-VAL-NODO   THRU 52211200-EXIT                        
889000        MOVE INV-SUCPRO-S           TO   WS-SUC-ANT WS-NUMSUC                 
889600        MOVE INV-SUCNOM-S           TO   WS-NOMSUC                            
890200        PERFORM 52211300-ENCABEZADO THRU 52211300-EXIT                        
890800        PERFORM 52211410-DATOS      THRU 52211410-EXIT                        
891400   ELSE                                                                       
892000      IF INV-SUCPRO-S = WS-SUC-ANT                                            
892600        PERFORM 52211410-DATOS      THRU 52211410-EXIT                        
893200      ELSE                                                                    
893800        PERFORM 52211420-TOT-SUC    THRU 52211420-EXIT                        
894400        PERFORM 52211200-VAL-NODO   THRU 52211200-EXIT                        
895000        MOVE INV-SUCPRO-S           TO   WS-SUC-ANT WS-NUMSUC                 
895600        MOVE INV-SUCNOM-S           TO   WS-NOMSUC                            
896200        PERFORM 52211300-ENCABEZADO THRU 52211300-EXIT                        
896800        PERFORM 52211410-DATOS      THRU 52211410-EXIT.                       
897400 52211400-EXIT.                                                               
898000    EXIT.                                                                     
898600                                                                              
898605******************************************************************            
898610* IMPRIME EL DETALLE DEL LISTADO DE CONTRATOS CANCELADOS AUTOMAT.             
898615******************************************************************            
898620 52211405-DETALLE.                                                            
898625   IF WS-LINEA1 > 60                                                          
898630      IF INV-SUCPRO-S = WS-SUC-ANT1                                           
898640        PERFORM 52211350-ENCABEZADO THRU 52211350-EXIT                        
898650        PERFORM 52211450-DATOS      THRU 52211450-EXIT                        
898660      ELSE                                                                    
898680        PERFORM 52211250-VAL-NODO   THRU 52211250-EXIT                        
898690        MOVE INV-SUCPRO-S           TO   WS-SUC-ANT1 WS-NUMSUC-A              
898700        MOVE INV-SUCNOM-S           TO   WS-NOMSUC-A                          
898710        PERFORM 52211350-ENCABEZADO THRU 52211350-EXIT                        
898720        PERFORM 52211450-DATOS      THRU 52211450-EXIT                        
898730   ELSE                                                                       
898740      IF INV-SUCPRO-S = WS-SUC-ANT1                                           
898750        PERFORM 52211450-DATOS      THRU 52211450-EXIT                        
898760      ELSE                                                                    
898780        PERFORM 52211250-VAL-NODO   THRU 52211250-EXIT                        
898790        MOVE INV-SUCPRO-S           TO   WS-SUC-ANT1 WS-NUMSUC-A              
898800        MOVE INV-SUCNOM-S           TO   WS-NOMSUC-A                          
898810        PERFORM 52211350-ENCABEZADO THRU 52211350-EXIT                        
898820        PERFORM 52211450-DATOS      THRU 52211450-EXIT.                       
898830 52211405-EXIT.                                                               
898840    EXIT.                                                                     
898850                                                                              
899200******************************************************************            
899800* IMPRIMO EL DETALLE DE LISTADO DE CAPITALIZACION.                            
900400******************************************************************            
901000 52211410-DATOS.                                                              
901600        MOVE INV-NUMCTO-S         TO   WS-DET-CTO                             
902200        MOVE INV-SDOPRO-S         TO   WS-DET-SDOPROM                         
902800        MOVE INV-DIASCAP-S        TO   WS-DET-DIAS                            
903400        MOVE INV-INTSCAP-S        TO   WS-DET-INT                             
904000        ADD  1                    TO   WS-NUM-TOT-SUC                         
904600        ADD  INV-INTSCAP-S        TO   WS-TOT-TOT-SUC                         
905200        WRITE REG-CAPAHO          FROM WS-DET-CAP    BEFORE 1                 
905800        ADD  1                    TO   WS-LINEA.                              
906400 52211410-EXIT.                                                               
907000     EXIT.                                                                    
907600                                                                              
908200******************************************************************            
908800* IMPRIMO EL CORTE POR SUCURSAL.                                              
909400******************************************************************            
910000 52211420-TOT-SUC.                                                            
910600        MOVE SPACES TO REG-CAPAHO                                             
911200        WRITE REG-CAPAHO BEFORE 3                                             
911800        MOVE "TOTAL GENERAL POR SUCURSAL" TO WS-TITULO-TOT                    
912400        MOVE WS-NUM-TOT-SUC TO WS-NUMERO-TOT                                  
913000        MOVE WS-TOT-TOT-SUC TO WS-IMPORTE-TOT                                 
913600        WRITE REG-CAPAHO    FROM WS-TOTALES BEFORE 1                          
914200                                                                              
914800        ADD  WS-NUM-TOT-SUC TO WS-NUM-TOT-NODO                                
915400        ADD  WS-TOT-TOT-SUC TO WS-TOT-TOT-NODO                                
916000        MOVE 0              TO WS-NUM-TOT-SUC                                 
916600        MOVE 0              TO WS-TOT-TOT-SUC.                                
917200 52211420-EXIT.                                                               
917800     EXIT.                                                                    
918400                                                                              
918410******************************************************************            
918420* IMPRIMO EL DETALLE DE LISTADO DE CANCELACIONES AUTOMATICAS.                 
918430******************************************************************            
918432 52211450-DATOS.                                                              
918436  MOVE INV-INDCAN-S                                 TO WS-CAN-MC              
918438                                                                              
918440  IF INV-CANCELO-S = 1                                                        
918442     MOVE " MESES SIN MOVIMIENTO Y SALDO 0        " TO WS-CAN-LEY             
918444  ELSE                                                                        
918508     MOVE " MESES SIN MOV. CTO CANCELADO Y SDO. 0 " TO WS-CAN-LEY.            
918528                                                                              
918530  MOVE INV-NUMCTO-S               TO   WS-CAN-CTO                             
918540  MOVE INV-NUMCTE-S               TO   WS-CAN-CTE                             
918550  MOVE INV-PRODUCTO-S             TO   WS-CAN-PRD                             
918560  MOVE INV-INSTRUMENTO-S          TO   WS-CAN-INS                             
918570  MOVE INV-MONEDA-S               TO   WS-CAN-MON                             
918580  MOVE INV-NOMBRE-S               TO   WS-CAN-NOM                             
918590  MOVE INV-FECULTM-S              TO   WS-DIA-AMD                             
918600  MOVE WS-DIA-DD2                 TO   WS-CAN-DD                              
918610  MOVE WS-DIA-MM2                 TO   WS-CAN-MM                              
918620  MOVE WS-DIA-AA2                 TO   WS-CAN-AA                              
918630  PERFORM 52211460-VALIND THRU 52211460-EXIT.                                 
918640  52211450-EXIT.                                                              
918650     EXIT.                                                                    
918660                                                                              
918800******************************************************************            
918810* VALIDO EL TIPO DE CANCELACION.                                              
918820******************************************************************            
918830 52211460-VALIND.                                                             
918840    IF WS-9VEZ = 0                                                            
918850       WRITE REG-CANCEL          FROM WS-CAN-TIPCAN BEFORE 2                  
918855       WRITE REG-CANCEL          FROM WS-TIT-CAN    BEFORE 2.                 
918860       ADD   4                   TO WS-LINEA1                                 
918870       MOVE  1                   TO WS-9VEZ.                                  
918880                                                                              
918890   IF INV-INDCAN-S = WS-INDCAN-ANT                                            
918893       IF INV-CANCELO-S = WS-CANCELO-ANT                                      
918900          WRITE REG-CANCEL       FROM WS-DET-CAN    BEFORE 1                  
918902          ADD 1                  TO WS-LINEA1                                 
918904       ELSE                                                                   
918906          WRITE REG-CANCEL       FROM WS-BLANCOS    BEFORE 2                  
918908          WRITE REG-CANCEL       FROM WS-CAN-TIPCAN BEFORE 2                  
918909          WRITE REG-CANCEL       FROM WS-TIT-CAN    BEFORE 2                  
918910          WRITE REG-CANCEL       FROM WS-DET-CAN    BEFORE 1                  
918912          ADD 7                  TO WS-LINEA1                                 
918914          MOVE INV-CANCELO-S     TO WS-CANCELO-ANT                            
918916   ELSE                                                                       
918918       IF INV-CANCELO-S = WS-CANCELO-ANT                                      
918920          WRITE REG-CANCEL       FROM WS-BLANCOS    BEFORE 2                  
918922          WRITE REG-CANCEL       FROM WS-CAN-TIPCAN BEFORE 2                  
918923          WRITE REG-CANCEL       FROM WS-TIT-CAN    BEFORE 2                  
918924          WRITE REG-CANCEL       FROM WS-DET-CAN    BEFORE 1                  
918926          ADD 7                  TO WS-LINEA1                                 
918928          MOVE INV-INDCAN-S      TO WS-INDCAN-ANT                             
918929       ELSE                                                                   
918930          WRITE REG-CANCEL       FROM WS-BLANCOS    BEFORE 2                  
918932          WRITE REG-CANCEL       FROM WS-CAN-TIPCAN BEFORE 2                  
918936          WRITE REG-CANCEL       FROM WS-TIT-CAN    BEFORE 2                  
918940          WRITE REG-CANCEL       FROM WS-DET-CAN    BEFORE 1                  
918950          ADD 7                  TO WS-LINEA1                                 
918960          MOVE INV-INDCAN-S      TO WS-INDCAN-ANT                             
918962          MOVE INV-CANCELO-S     TO WS-CANCELO-ANT.                           
918970 52211460-EXIT.                                                               
918980   EXIT.                                                                      
918990                                                                              
919000******************************************************************            
919600* IMPRIMO EL CORTE P¡R NODO.                                                  
920200******************************************************************            
920800 52211600-TOT-NODO.                                                           
921400        MOVE SPACES                   TO REG-CAPAHO.                          
922000        WRITE REG-CAPAHO              BEFORE 3.                               
922600        MOVE "TOTAL GENERAL POR NODO" TO WS-TITULO-TOT                        
923200        MOVE WS-NUM-TOT-NODO TO WS-NUMERO-TOT                                 
923800        MOVE WS-TOT-TOT-NODO TO WS-IMPORTE-TOT                                
924400        WRITE REG-CAPAHO     FROM WS-TOTALES BEFORE 1.                        
925000                                                                              
925600        ADD WS-NUM-TOT-NODO           TO WS-NUM-TOT-CSI.                      
926200        ADD WS-TOT-TOT-NODO           TO WS-TOT-TOT-CSI.                      
926800        MOVE 0                        TO WS-NUM-TOT-NODO                      
927400                                         WS-TOT-TOT-NODO.                     
927410 52211600-EXIT.                                                               
927420     EXIT.                                                                    
927430                                                                              
928000******************************************************************            
928600* IMPRIMO EL CORTE POR CSI.                                                   
929200******************************************************************            
929800 52211700-TOT-CSI.                                                            
930400     MOVE SPACES                      TO REG-CAPAHO.                          
931000     WRITE REG-CAPAHO                 BEFORE 3.                               
931600     MOVE "TOTAL GENERAL DEL CSI"     TO WS-TITULO-TOT                        
932200     MOVE WS-NUM-TOT-CSI              TO WS-NUMERO-TOT                        
932800     MOVE WS-TOT-TOT-CSI              TO WS-IMPORTE-TOT.                      
933400 52211700-EXIT.                                                               
934000    EXIT.                                                                     
934600                                                                              
935200******************************************************************            
935800* SALGO DE  LA SECTION DE LECTURA DE ARCHIVO SORT.                            
936400******************************************************************            
937000 52200000-EXIT.                                                               
937600    EXIT.                                                                     
937610                                                                              
937620                                                                              
937630                                                                              
937640                                                                              
937650                                                                              
937660                                                                              
937670******************************************************************            
937680* SECTION DE RUTINAS FINALES.                                                 
937690******************************************************************            
937700 70000000-FIN SECTION.                                                        
937710                                                                              
937720                                                                              
937730                                                                              
937740                                                                              
937750                                                                              
937760******************************************************************            
937770*    R U T I N A S   D E   C L O S E .                                        
937780******************************************************************            
937790                                                                              
937800                                                                              
937810                                                                              
937820                                                                              
937830                                                                              
938200******************************************************************            
938800* RUTINAS PARA CERRADO DE BASE Y ARCHIVOS.                                    
939400******************************************************************            
940000 70000000-CIERRO.                                                             
940600     CLOSE GERENCIA      WITH SAVE.                                           
941800     CLOSE FILE-CAPAHO.                                                       
941810     IF WS-BAN-SICAN = 1                                                      
941820        CLOSE FILE-CANCEL.                                                    
942400     CLOSE S500BD01CAPTACION                                                  
943000     ON EXCEPTION                                                             
944800        MOVE "ERROR AL CERRAR LA BASE "     TO WS-0101-TEXT-MSG               
945400        PERFORM 70000050-MENSAJE                                              
946000        CALL SYSTEM DMTERMINATE.                                              
946600 70000000-EXIT.                                                               
947200    EXIT.                                                                     
947800                                                                              
948400                                                                              
949000                                                                              
949600                                                                              
950200                                                                              
953200******************************************************************            
953800*    R U T I N A S   D E   D E S P L I E G U E   D E   M S G.                 
954400*        P A R A   L A   P R I M E R A   S E C T I O N.                       
955000******************************************************************            
955600                                                                              
956200                                                                              
956800                                                                              
957400                                                                              
958000                                                                              
971200******************************************************************            
971800* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
972400******************************************************************            
973600 COPY "S500/INC/PRO/25MTP002".                                                
