     A*=================================================================
     A* LOGICAL FILE : POLACT  -  Polizas ACTIVAS sobre POLMAST
     A* [DEFECTO PLANTADO] El SELECT/OMIT encapsula una regla de negocio:
     A* "poliza activa" = estado VI (vigente) Y suma asegurada > 0.
     A* Esta logica vive en el LF, no en ningun programa -> RE debe cazarla.
     A*=================================================================
     A          R POLMASTR                  PFILE(POLMAST)
     A          K POLNUM
     A          S POLESTADO                  COMP(EQ 'VI')
     A          O POLSUMASEG                 COMP(LE 0)