     A*=================================================================
     A* PHYSICAL FILE : SINIEST  -  Siniestros (Claims)
     A*=================================================================
     A          R SINIESTR
     A            SINNUM        10P 0       TEXT('Numero de siniestro')
     A            SINPOL        10P 0       TEXT('Numero de poliza')
     A            SINMONTO      13P 2       TEXT('Monto reclamado')
     A            SINANIO        2S 0       TEXT('Anio 2 digitos')
     A            SINESTADO      2A         TEXT('AB/CE/PA/RE')
     A          K SINNUM