     A*=================================================================
     A* PHYSICAL FILE : TARIFA  -  Tabla de Tarifas por Cobertura
     A*=================================================================
     A          R TARIFAR
     A            TARTIPO        2A         TEXT('Cobertura: AM/LI/RC')
     A            TARBASE       13P 2       TEXT('Prima base')
     A            TARMINIMO     13P 2       TEXT('Prima minima')
     A            TARVIGENTE     1A         TEXT('Vigente S/N')
     A          K TARTIPO