000100$SET LIST$                                                                    
000200$SUPRESS                                                                      
000400$SET ERRORLIST                                                                
000500*$SET TADS                                                                    
000600$SET LIST STACK  LINEINFO FREE                                                
000700$ERRORLIMIT = 10                                                              
000800*****************************************************************             
000900*        PARA MANEJO DE INCLUDE  BASE DE DATOS                  *             
001000*****************************************************************             
001100$SET S000LIBLJ                                                                
001200$SET BDB02R01                                                                 
001300$SET BD4B08R02 BD4B07R10                                                      
001400*****************************************************************             
001500*        PARA INCLUDE MANEJO DE LIBRERIAS                       *             
001600*****************************************************************             
001700$SET S100VERSIONES                                                            
001800$SET S006LOCSUP S000LIBFEC                                                    
001900$SET FECHA2000 S000LIBFECR14 S000LIBFECR13                                    
002000$SET DIALOGO S500L02NR16                                                      
002100$SET S500L02N HOSTNAME                                                        
002102*** IBM-CHARITY-2002 INI                                                      
002104$SET BD4B00R01  BD4B00R04  BD4B08R03                                          
002106*** IBM-CHARITY-2002 FIN                                                      
002200*****************************************************************             
002300*    PARA INCLUDE  PROCESO BATCH                                *             
002400*****************************************************************             
002500                                                                              
002600$RESET LIST$                                                                  
002700*****************************************************************             
002800* P187  P187  P187  P187  P187  P187  P187  P187  P187  P187    *             
002900*****************************************************************             
003000* FUNCIONES PRINCIPALES:                                        *             
003100* - GENERAR REPORTES DE PROCESADOS, RECHAZADOS Y PENDIENTES     *             
003200*                                                               *             
003300* - LLAMAR AL P188 PARA LA GENERACION DE LOS REPORTES DE DETALLE*             
003400*   QUE ASI LO HAYAN SOLICITADO.                                *             
003500*                                                               *             
003600*                                                               *             
003700*****************************************************************             
003800 IDENTIFICATION DIVISION.                                                     
003900*****************************************************************             
004000 PROGRAM-ID.    P187.                                                         
004100 AUTHOR.        ROBERTO CARLOS.                                               
004200 DATE-WRITTEN.  JUNIO/2013.                                                   
004300*****************************************************************             
004400 ENVIRONMENT DIVISION.                                                        
004500*****************************************************************             
004600 INPUT-OUTPUT  SECTION.                                                       
004700 FILE-CONTROL.                                                                
004800     SELECT REP-PROCESADO   ASSIGN TO PRINTER.                                
004900     SELECT REP-PENDIENTE   ASSIGN TO PRINTER.                                
005000     SELECT REP-RECHAZADO   ASSIGN TO PRINTER.                                
005100     SELECT A01-PROC        ASSIGN TO DISK.                                   
005200     SELECT A02-PEND        ASSIGN TO DISK.                                   
005300     SELECT A03-RECH        ASSIGN TO DISK.                                   
005400                                                                              
005500     SELECT A01-SORT        ASSIGN TO SORT DISK.                              
005600     SELECT A02-SORT        ASSIGN TO SORT DISK.                              
005700     SELECT A03-SORT        ASSIGN TO SORT DISK.                              
005800                                                                              
005900     SELECT A04-PROCDET     ASSIGN TO DISK                                    
006000                            ACCESS MODE  IS RANDOM                            
006100                            ACTUAL KEY   IS W77-KEY-DET.                      
006200                                                                              
006300     SELECT A05-ENTRADA     ASSIGN TO DISK.                                   
006400     SELECT A06-SALIDA      ASSIGN TO DISK.                                   
006500                                                                              
006600*****************************************************************             
006700 DATA DIVISION.                                                               
006800*****************************************************************             
006900 FILE                            SECTION.                                     
007000                                                                              
007100  FD REP-PROCESADO          REPORT IS REPORTE-PROC                            
007200    VALUE OF USERBACKUPNAME IS TRUE.                                          
007300  FD REP-PENDIENTE          REPORT IS REPORTE-PEND                            
007400    VALUE OF USERBACKUPNAME IS TRUE.                                          
007500  FD REP-RECHAZADO          REPORT IS REPORTE-RECH                            
007600    VALUE OF USERBACKUPNAME IS TRUE.                                          
007700                                                                              
007800  FD A01-PROC                                                                 
007900     BLOCK   CONTAINS   180 RECORDS                                           
008000     RECORD  CONTAINS   180 CHARACTERS                                        
008100     VALUE OF TITLE IS "S500/FILE/P187/PROCESADOS".                           
008200                                                                              
008300     01 A01-DETALLE.                                                          
008400        03 A01-SIST-CTE         PIC 9(12).                                    
008500        03 A01-FEC-ARRIBO       PIC 9(08).                                    
008600        03 A01-HORA-ARRIBO      PIC 9(06).                                    
008650        03 A01-HORA-ARRIBO-R REDEFINES A01-HORA-ARRIBO.                       
008700           05 A01-HORA-ARR-HH   PIC 9(02).                                    
008800           05 A01-HORA-ARR-MM   PIC 9(02).                                    
008900           05 A01-HORA-ARR-SS   PIC 9(02).                                    
009000        03 A01-HORA-INI-APL     PIC 9(06).                                    
009050        03 A01-HORA-INI-APL-R REDEFINES A01-HORA-INI-APL.                     
009100           05 A01-HORA-INI-HH   PIC 9(02).                                    
009200           05 A01-HORA-INI-MM   PIC 9(02).                                    
009300           05 A01-HORA-INI-SS   PIC 9(02).                                    
009400        03 A01-HORA-FIN-APL     PIC 9(06).                                    
009450        03 A01-HORA-FIN-APL-R REDEFINES A01-HORA-FIN-APL.                     
009500           05 A01-HORA-FIN-HH   PIC 9(02).                                    
009600           05 A01-HORA-FIN-MM   PIC 9(02).                                    
009700           05 A01-HORA-FIN-SS   PIC 9(02).                                    
009800        03 A01-TRNXSEG          PIC 9(06).                                    
009900        03 A01-NUM-COPIA        PIC 9(02).                                    
010000        03 A01-TOT-REG          PIC 9(08).                                    
010100        03 A01-REG-PROC         PIC 9(08).                                    
010200        03 A01-REG-OK           PIC 9(08).                                    
010300        03 A01-REG-RECH         PIC 9(08).                                    
010400        03 A01-REG-FOR          PIC 9(08).                                    
010500        03 A01-USER             PIC 9(03).                                    
010600        03 A01-SISTEMA          PIC 9(03).                                    
010700        03 A01-BUZON            PIC X(08).                                    
010800        03 A01-NODO             PIC 9(02).                                    
010900        03 A01-FEC-PROC         PIC 9(08).                                    
011000        03 A01-SECUENCIAL       PIC 9(04).                                    
011100        03 A01-PACK             PIC X(12).                                    
011102*** IBM-CHARITY-2002 INI                                                      
011104        03 A01-ESTATUS          PIC X(01).                                    
011106        03 A01-LEYENDA          PIC X(50).                                    
011108        03 A01-REINTENTOS       PIC 9(02).                                    
011110        03 A01-FILLER           PIC X(01).                                    
011112*** IBM-CHARITY-2002 FIN                                                      
011200                                                                              
011300  FD A02-PEND                                                                 
011400     BLOCK   CONTAINS   180 RECORDS                                           
011500     RECORD  CONTAINS   180 CHARACTERS                                        
011600     VALUE OF TITLE IS "S500/FILE/P187/PENDIENTES".                           
011700                                                                              
011800     01 A02-DETALLE.                                                          
011900        03 A02-SIST-CTE         PIC 9(12).                                    
012000        03 A02-USER             PIC 9(03).                                    
012100        03 A02-SISTEMA          PIC 9(03).                                    
012200        03 A02-BUZON            PIC X(08).                                    
012300        03 A02-NODO             PIC 9(02).                                    
012400        03 A02-FEC-PROC         PIC 9(08).                                    
012500        03 A02-SECUENCIAL       PIC 9(04).                                    
012600        03 A02-PACK             PIC X(12).                                    
012700        03 A02-ESTATUS          PIC X(01).                                    
012800        03 A02-LEYENDA          PIC X(50).                                    
012900        03 A02-TOT-REG          PIC 9(08).                                    
013000        03 A02-REG-PROC         PIC 9(08).                                    
013100        03 A02-REG-OK           PIC 9(08).                                    
013200        03 A02-REG-RECH         PIC 9(08).                                    
013300        03 A02-REG-FOR          PIC 9(08).                                    
013304        03 A02-REINTENTOS       PIC 9(02).                                    
013400        03 FILLER               PIC X(35).                                    
013500                                                                              
013600  FD A03-RECH                                                                 
013700     BLOCK   CONTAINS   180 RECORDS                                           
013800     RECORD  CONTAINS   180 CHARACTERS                                        
013900     VALUE OF TITLE IS "S500/FILE/P187/RECHAZADOS".                           
014000                                                                              
014100     01 A03-DETALLE.                                                          
014200        03 A03-SIST-CTE         PIC 9(12).                                    
014300        03 A03-USER             PIC 9(03).                                    
014400        03 A03-SISTEMA          PIC 9(03).                                    
014500        03 A03-BUZON            PIC X(08).                                    
014600        03 A03-NODO             PIC 9(02).                                    
014700        03 A03-FEC-PROC         PIC 9(08).                                    
014800        03 A03-SECUENCIAL       PIC 9(04).                                    
014900        03 A03-PACK             PIC X(12).                                    
015000        03 A03-ESTATUS          PIC X(01).                                    
015100        03 A03-LEYENDA          PIC X(50).                                    
015200        03 A03-TOT-REG          PIC 9(08).                                    
015300        03 A03-REG-PROC         PIC 9(08).                                    
015400        03 A03-REG-OK           PIC 9(08).                                    
015500        03 A03-REG-RECH         PIC 9(08).                                    
015600        03 A03-REG-FOR          PIC 9(08).                                    
015604        03 A03-REINTENTOS       PIC 9(02).                                    
015700        03 FILLER               PIC X(35).                                    
015800                                                                              
015900   SD A01-SORT.                                                               
016000     01 S01-DETALLE.                                                          
016100        03 S01-SIST-CTE         PIC 9(12).                                    
016200        03 S01-FEC-ARRIBO       PIC 9(08).                                    
016300        03 S01-HORA-ARRIBO      PIC 9(06).                                    
016400        03 S01-HORA-INI-APL     PIC 9(06).                                    
016500        03 S01-HORA-FIN-APL     PIC 9(06).                                    
016600        03 S01-TRNXSEG          PIC 9(06).                                    
016700        03 S01-NUM-COPIA        PIC 9(02).                                    
016800        03 S01-TOT-REG          PIC 9(08).                                    
016900        03 S01-REG-PROC         PIC 9(08).                                    
017000        03 S01-REG-OK           PIC 9(08).                                    
017100        03 S01-REG-RECH         PIC 9(08).                                    
017200        03 S01-REG-FOR          PIC 9(08).                                    
017300        03 S01-USER             PIC 9(03).                                    
017400        03 S01-SISTEMA          PIC 9(03).                                    
017500        03 S01-BUZON            PIC X(08).                                    
017600        03 S01-NODO             PIC 9(02).                                    
017700        03 S01-FEC-PROC         PIC 9(08).                                    
017800        03 S01-SECUENCIAL       PIC 9(04).                                    
017900        03 S01-PACK             PIC X(12).                                    
017902*** IBM-CHARITY-2002 INI                                                      
017904        03 S01-ESTATUS          PIC X(01).                                    
017906        03 S01-DESCRIPCION      PIC X(50).                                    
017908        03 S01-REINTENTOS       PIC 9(02).                                    
017910        03 S01-FILLER           PIC X(01).                                    
017912*** IBM-CHARITY-2002 FIN                                                      
018000                                                                              
018100   SD A02-SORT.                                                               
018200     01 S02-DETALLE.                                                          
018300        03 S02-SIST-CTE         PIC 9(12).                                    
018400        03 S02-USER             PIC 9(03).                                    
018500        03 S02-SISTEMA          PIC 9(03).                                    
018600        03 S02-BUZON            PIC X(08).                                    
018700        03 S02-NODO             PIC 9(02).                                    
018800        03 S02-FEC-PROC         PIC 9(08).                                    
018900        03 S02-SECUENCIAL       PIC 9(04).                                    
019000        03 S02-PACK             PIC X(12).                                    
019100        03 S02-ESTATUS          PIC X(01).                                    
019200        03 S02-LEYENDA          PIC X(50).                                    
019300        03 S02-TOT-REG          PIC 9(08).                                    
019400        03 S02-REG-PROC         PIC 9(08).                                    
019500        03 S02-REG-OK           PIC 9(08).                                    
019600        03 S02-REG-RECH         PIC 9(08).                                    
019700        03 S02-REG-FOR          PIC 9(08).                                    
019704        03 S02-REINTENTOS       PIC 9(02).                                    
019800        03 FILLER               PIC X(35).                                    
019900                                                                              
020000  SD A03-SORT.                                                                
020100     01 S03-DETALLE.                                                          
020200        03 S03-SIST-CTE         PIC 9(12).                                    
020300        03 S03-USER             PIC 9(03).                                    
020400        03 S03-SISTEMA          PIC 9(03).                                    
020500        03 S03-BUZON            PIC X(08).                                    
020600        03 S03-NODO             PIC 9(02).                                    
020700        03 S03-FEC-PROC         PIC 9(08).                                    
020800        03 S03-SECUENCIAL       PIC 9(04).                                    
020900        03 S03-PACK             PIC X(12).                                    
021000        03 S03-ESTATUS          PIC X(01).                                    
021100        03 S03-LEYENDA          PIC X(50).                                    
021200        03 S03-TOT-REG          PIC 9(08).                                    
021300        03 S03-REG-PROC         PIC 9(08).                                    
021400        03 S03-REG-OK           PIC 9(08).                                    
021500        03 S03-REG-RECH         PIC 9(08).                                    
021600        03 S03-REG-FOR          PIC 9(08).                                    
021604        03 S03-REINTENTOS       PIC 9(02).                                    
021700        03 FILLER               PIC X(35).                                    
021800                                                                              
021900  FD A04-PROCDET                                                              
022000     BLOCK   CONTAINS   50 RECORDS                                            
022100     VALUE OF PROTECTION           IS PROTECTED.                              
022200     01 REG-ARCHDET.                                                          
022300          03 A04-DET-INDI        PIC 9(01).                                   
022400          03 A04-DET-NOMARCH     PIC X(76).                                   
022500          03 A04-DET-NOMARCH-R REDEFINES A04-DET-NOMARCH.                     
022600             05 FILLER           PIC X(02).                                   
022700             05 A04-DET-TITUSER  PIC X(03).                                   
022800             05 FILLER           PIC X(01).                                   
022900             05 A04-DET-TITSIST  PIC X(04).                                   
023000             05 FILLER           PIC X(11).                                   
023100             05 A04-DET-TITBUZO  PIC X(08).                                   
023200             05 FILLER           PIC X(01).                                   
023300             05 A04-DET-TITNODO  PIC X(02).                                   
023400             05 FILLER           PIC X(01).                                   
023500             05 A04-DET-TITFPRC  PIC X(08).                                   
023600             05 FILLER           PIC X(01).                                   
023700             05 A04-DET-TITSCTE  PIC X(12).                                   
023800             05 FILLER           PIC X(01).                                   
023900             05 A04-DET-TITSEC   PIC X(04).                                   
024000             05 FILLER           PIC X(04).                                   
024100             05 A04-DET-TITPACK  PIC X(12).                                   
024200             05 FILLER           PIC X(01).                                   
024300          03 A04-DET-AA          PIC 9(04).                                   
024400          03 A04-DET-MM          PIC 9(02).                                   
024500          03 A04-DET-DD          PIC 9(02).                                   
024600          03 A04-DET-TOTREG      PIC 9(10).                                   
024700          03 A04-DET-TOTPROC     PIC 9(10).                                   
024800          03 A04-DET-TOTOK       PIC 9(10).                                   
024900          03 A04-DET-TOTRECH     PIC 9(10).                                   
025000          03 A04-DET-TOTFORAN    PIC 9(10).                                   
025100          03 A04-DET-CSI         PIC 9(02).                                   
025200          03 A04-DET-TIPO        PIC 9(01).                                   
025300          03 A04-DET-MIX         PIC 9(07).                                   
025302*** IBM-CHARITY-2002 INI                                                      
025304          03 A04-ESTATUS         PIC X(01).                                   
025306          03 A04-SUBESTATUS      PIC X(01).                                   
025308          03 A04-CONT-REINT      PIC 9(02).                                   
025400          03 FILLER              PIC X(31).                                   
025402*** IBM-CHARITY-2002 FIN                                                      
025500                                                                              
025600 FD A05-ENTRADA                                                               
025700    VALUE OF DEPENDENTSPECS IS TRUE.                                          
025800                                                                              
025900 01 A05-REGISTRO                PIC X(880).                                   
026000                                                                              
026100 FD A06-SALIDA                                                                
026200    VALUE OF DEPENDENTSPECS IS TRUE.                                          
026300                                                                              
026400 01 A06-REGISTRO                PIC X(130).                                   
026500                                                                              
026600*****************************************************************             
026700 DATA-BASE SECTION.                                                           
026800 DB S500BD01CAPTACION.                                                        
026900  01 S500B02CONTROL.                                                          
027000 DB S500BD04TARJETAS.                                                         
027004  01 S500B91PREINICIO.                                                        
027100  01 S500B07PARCHIVOS.                                                        
027200  01 S500B08PCTRARRIBO.                                                       
027300                                                                              
027400*****************************************************************             
027500 WORKING-STORAGE SECTION.                                                     
027600                                                                              
027700********* INCLUDE DE WORKING PARA RUTINAS COMUNES ***************             
027800  COPY "S500/INC/WOR/25MTP002".                                               
027900                                                                              
028000***** VARIABLE USADAS POR LOS REPORTES                                        
028100 01 WKS-EDIT-FECMAQ              PIC X(10).                                   
028200 01 WKS-EDIT-FECMAQ-X      REDEFINES WKS-EDIT-FECMAQ.                         
028300    03 WKS-FECMAQ-DD             PIC 9(02).                                   
028400    03 FILLER                    PIC X(01).                                   
028500    03 WKS-FECMAQ-MM             PIC 9(02).                                   
028600    03 FILLER                    PIC X(01).                                   
028700    03 WKS-FECMAQ-AA             PIC 9(04).                                   
028800 01 WKS-EDIT-FECPROC             PIC X(10).                                   
028900 01 WKS-EDIT-FECPROC-X     REDEFINES WKS-EDIT-FECPROC.                        
029000    03 WKS-FECPROC-DD            PIC 9(02).                                   
029100    03 FILLER                    PIC X(01).                                   
029200    03 WKS-FECPROC-MM            PIC 9(02).                                   
029300    03 FILLER                    PIC X(01).                                   
029400    03 WKS-FECPROC-AA            PIC 9(04).                                   
029500 01 WKS-EDIT-TIME                PIC X(08).                                   
029600 01 WKS-EDIT-TIME-X              REDEFINES WKS-EDIT-TIME.                     
029700    03 WKS-TIME-HH               PIC 9(02).                                   
029800    03 FILLER                    PIC X(01).                                   
029900    03 WKS-TIME-MIN              PIC 9(02).                                   
030000    03 FILLER                    PIC X(01).                                   
030100    03 WKS-TIME                  PIC 9(02).                                   
030200                                                                              
030300 77 W77-KEY-DET                  PIC 9(16) VALUE ZEROS.                       
030400 77 WKS-CSI                      PIC 9(02) VALUE ZEROS.                       
030500 77 WKS-NOM-ARCHENT              PIC X(76) VALUE SPACES.                      
030600 77 WKS-R1-REGXARCH              PIC 9(10) VALUE ZEROS.                       
030700 77 WKS-R1-PROCXARCH             PIC 9(10) VALUE ZEROS.                       
030800 77 WKS-R1-OKXARCH               PIC 9(10) VALUE ZEROS.                       
030900 77 WKS-R1-RECHXARCH             PIC 9(10) VALUE ZEROS.                       
031000 77 WKS-R1-FORANXARCH            PIC 9(10) VALUE ZEROS.                       
031100 77 WKS-R1-ARCHPROC              PIC 9(10) VALUE ZEROS.                       
031200 77 WKS-R1-TOTARCH               PIC 9(05) VALUE ZEROS.                       
031300 77 WKS-R1-TOTREG                PIC 9(10) VALUE ZEROS.                       
031400 77 WKS-R1-TOTPROC               PIC 9(10) VALUE ZEROS.                       
031500 77 WKS-R1-TOTOK                 PIC 9(10) VALUE ZEROS.                       
031600 77 WKS-R1-TOTRECH               PIC 9(10) VALUE ZEROS.                       
031700 77 WKS-R1-TOTFORAN              PIC 9(10) VALUE ZEROS.                       
031800 77 WKS-R2-LEYENDA               PIC X(75) VALUE SPACES.                      
031900 77 WKS-R2-TOTARCH               PIC 9(10) VALUE ZEROS.                       
032000 77 WKS-R2-TOTALPEND             PIC 9(10) VALUE ZEROS.                       
032100 77 WKS-R3-LEYENDA               PIC X(50) VALUE SPACES.                      
032200 77 WKS-R3-TOTARCH               PIC 9(10) VALUE ZEROS.                       
032300 77 WKS-R3-TOTALPEND             PIC 9(10) VALUE ZEROS.                       
032400 77 WKS-R3-TOTALRECH             PIC 9(10) VALUE ZEROS.                       
032500 77 W88-FEC-OK                   PIC 9(08) VALUE ZEROS.                       
032600 01 WKS-ESTATUS                  PIC X(01).                                   
032602*** IBM-CHARITY-2002 INI                                                      
032700   88 W88-STA-PROCESADO        VALUE "D","T","H".                             
032800   88 W88-STA-RECHAZADO        VALUE "G",    "I","J","K",                     
032900                                     "L","M","N","O","P","Q",                 
032902                                     "R","S","U".                             
033000   88 W88-STA-PENDIENTE        VALUE "A","B","C","E","F","V","W".             
033002                                                                              
033004 77  WS-REG-NPROCESADOS          PIC 9(08) VALUE ZEROS.                       
033006 77  WKS-R1-NOPROCESADOS         PIC 9(10) VALUE ZEROS.                       
033008 77  WKS-R1-TOTNOPROCE           PIC 9(10) VALUE ZEROS.                       
033010*** IBM-CHARITY-2002 FIN                                                      
033100                                                                              
033200 77  W77-MY-CSI                  PIC 9(02) COMP.                              
033300 77  W77-MY-PASO                 PIC 9(04) COMP.                              
033400 01 WS-HORA-MAQ                  PIC 9(11).                                   
033500 01 WS-HORA-MAQ-R          REDEFINES WS-HORA-MAQ.                             
033600    02 WS-HORA-MAQ-0             PIC 9(03).                                   
033700    02 WS-HORA-MAQ-HH            PIC 9(02).                                   
033800    02 WS-HORA-MAQ-MM            PIC 9(02).                                   
033900    02 WS-HORA-MAQ-SS            PIC 9(02).                                   
034000    02 WS-HORA-MAQ-CS            PIC 9(02).                                   
034100 01 WKS-TIT-P188                 PIC X(50).                                   
034110 01 WKS-TIT-P188-R     REDEFINES WKS-TIT-P188.                                
034120    02 FILLER                    PIC X(23).                                   
034130    02 WKS-TIT-MTP               PIC X(08).                                   
034140    02 FILLER                    PIC X(19).                                   
034150                                                                              
034200 77 WKS-P188-UP                  PIC 9(05) VALUE ZEROS.                       
034300 77 WKS-P188-ACTIVOS             PIC 9(05) VALUE ZEROS.                       
034400 77 WKS-P188-FIN                 PIC 9(01) VALUE ZERO.                        
034500 77 WKS-MAX-ARCH                 PIC 9(04) VALUE ZEROS.                       
034600 77 WKS-FIN-ESP                  PIC 9(01) VALUE ZERO.                        
034700 77  W77-ES-PRODUCCION           PIC 9(02) COMP  VALUE 0.                     
034800 77  W77-ES-UAT                  PIC 9(02) COMP  VALUE 0.                     
034900 77  W77-ES-DESARROLLO           PIC 9(02) COMP  VALUE 0.                     
035000 01 WKS-FIN                      PIC 9(01) VALUE ZERO.                        
035100 01 WKS-LASTREC                  PIC 9(08) VALUE ZEROS.                       
035200 77  W77-TOT-DISKSIZE            PIC 9(10) COMP  VALUE 0.                     
035300 77  W77-TOT-MEMSIZE             PIC 9(10) COMP  VALUE 0.                     
035400                                                                              
035500  01  WS-TIT-REPORTES.                                                        
035600      03 FILLER                  PIC X(15) VALUE                              
035700                                 "S500/LIST/P187/".                           
035800      03 WS-TIT-CE-NODO          PIC 99    VALUE 04.                          
035900      03 WS-TIT-CE-SBNODO        PIC 99    VALUE ZEROS.                       
036000      03 FILLER                  PIC X(06) VALUE "/R000/".                    
036100      03 WS-TIT-CE-FEC           PIC 9(06).                                   
036200      03 FILLER                  PIC X     VALUE "/".                         
036300      03 WS-TIT-CE-MIX           PIC 9(07).                                   
036400      03 FILLER                  PIC X     VALUE "/".                         
036500      03 WS-TIT-CE-NAME          PIC X(13) VALUE SPACES.                      
036600      03 FILLER                  PIC X     VALUE ".".                         
036700                                                                              
036800  01 WS-TIT-A04.                                                              
036900     03 FILLER                   PIC X(21)                                    
037000        VALUE "(S500)S500/FILE/P187/".                                        
037100     03 WS-A04-CSI               PIC 9(02).                                   
037200     03 FILLER                   PIC X(08) VALUE "/IMPDET/".                  
037300     03 WS-A04-FEC               PIC 9(08).                                   
037400     03 WS-A04-FECX        REDEFINES WS-A04-FEC.                              
037500        05 WS-A04-AA             PIC 9(04).                                   
037600        05 WS-A04-MM             PIC 9(02).                                   
037700        05 WS-A04-DD             PIC 9(02).                                   
037800     03 FILLER                   PIC X(01) VALUE "/".                         
037900     03 WS-A04-SEC               PIC 9(04) VALUE ZEROES.                      
038000     03 WS-A04-PUNTO             PIC X(01) VALUE ".".                         
038100                                                                              
038200 01  WKS-HI-TEXTO.                                                            
038300     02 WKS-HI-TEX01             PIC X(03) VALUE "HI=".                       
038400     02 WKS-HI-NUMHI             PIC 9(03).                                   
038500     02 FILLER                   PIC X(07) VALUE " COPIA=".                   
038600     02 WKS-HI-NCOPIA            PIC 99.                                      
038700     02 FILLES                   PIC X     VALUE " ".                         
038800     02 WKS-HI-DETALLE.                                                       
038900        04 WKS-HI-TEX02          PIC X(08).                                   
039000        04 WKS-HI-LEIDOS         PIC 9(08).                                   
039100        04 WKS-HI-TEX04          PIC X(12).                                   
039200        04 WKS-HI-PROCESA        PIC 9(08).                                   
039300        04 WKS-HI-TEX05          PIC X(07).                                   
039400        04 WKS-HI-TOTALBD        PIC 9(08).                                   
039500                                                                              
039600 01 A01-SIST-CTEANT              PIC 9(12) VALUE ZEROS.                       
039700 01 A02-SIST-CTEANT              PIC 9(12) VALUE ZEROS.                       
039800 01 A03-SIST-CTEANT              PIC 9(12) VALUE ZEROS.                       
039900 01 SW-IMP-DET                   PIC 9(01) VALUE ZERO.                        
040000 01 WKS-PARAM188                 PIC 9(06) VALUE ZEROS.                       
040100 01 WKS-ID-OK                    PIC 9(01) VALUE ZERO.                        
040102*** IBM-CHARITY-2002 INI                                                      
040104*     VARIABLES PARA EL CALCULO DINAMICO DE ESPACIO PARA SORT    *            
040106*----------------------------------------------------------------*            
040108 77  W77-FRAMESIZE                PIC  9(002) COMP.                           
040110 77  W77-LASTRECORD               PIC  9(012) COMP.                           
040112 77  W77-MAXRECSIZE               PIC  9(012) COMP.                           
040114 77  W77-DISK-SIZE                PIC  9(018) COMP.                           
040116 77  W77-MEMORY-SIZE              PIC  9(018) COMP.                           
040118 77  W77-MEMORY-65K               PIC  9(018) COMP.                           
040120 01  WS-CALC-WORD                 PIC  9(012)V99.                             
040122 01  WS-CALC-WORD-RED   REDEFINES WS-CALC-WORD.                               
040124     02 WS-WORD-ENT               PIC  9(012).                                
040126     02 WS-WORD-RES               PIC  9(002).                                
040128*** IBM-CHARITY-2002 FIN                                                      
040200                                                                              
040300                                                                              
040400 01 WKS-FEC-VAL                  PIC 9(01).                                   
040500    88 WKS-FEC-OK              VALUE 1.                                       
040600    88 WKS-FEC-NOK             VALUE 0.                                       
040700                                                                              
040800 01 WKS-TIT-SALIDA.                                                           
040900  03 FILLER                      PIC X(02) VALUE "(S".                        
041000  03 WS-TIT-USER                 PIC X(03).                                   
041100  03 FILLER                      PIC X(02) VALUE ")S".                        
041200  03 WS-TIT-SIST                 PIC X(03).                                   
041300  03 FILLER                      PIC X(11) VALUE "/FILE/INTS/".               
041400  03 WS-TIT-BUZO                 PIC X(08).                                   
041500  03 FILLER                      PIC X(01) VALUE "/".                         
041600  03 WS-TIT-NODO                 PIC X(02).                                   
041700  03 FILLER                      PIC X(01) VALUE "/".                         
041800  03 WS-TIT-FPRC                 PIC X(08).                                   
041900  03 FILLER                      PIC X(01) VALUE "/".                         
042000  03 WS-TIT-SISCTE               PIC X(12).                                   
042100  03 FILLER                      PIC X(01) VALUE "/".                         
042200  03 WS-TIT-SEC                  PIC X(04).                                   
042300  03 FILLER                      PIC X(04) VALUE " ON ".                      
042400  03 WS-TIT-PACK                 PIC X(12).                                   
042500  03 FILLER                      PIC X(01) VALUE ".".                         
042600 01 WKS-TIT-SALIDA-R     REDEFINES WKS-TIT-SALIDA.                            
042620  03 WS-TIT-USER-R               PIC X(06).                                   
042640  03 WS-TIT-ARCHIVO              PIC X(70).                                   
042642  03 WS-TIT-ARCHIVO-R    REDEFINES WS-TIT-ARCHIVO.                            
042644     05 WS-TIT-SISTUSER          PIC X(04).                                   
042646     05 FILLER                   PIC X(66).                                   
042648                                                                              
042660                                                                              
042700 01 WS-TIT-RENOMB                PIC X(79) VALUE SPACES.                      
042800 01 WKS-RUN-P188.                                                             
042900    02 FILLER                    PIC X(50) VALUE                              
043000 " BEGIN JOB ;".                                                              
043100    02 FILLER                    PIC X(50) VALUE                              
043200 " FAMILY DISK = CAPTACION OTHERWISE DISK;".                                  
043300    02 FILLER                    PIC X(50) VALUE                              
043400 " STRING HNAME;".                                                            
043405    02 FILLER                    PIC X(50) VALUE                              
043410 "                                          ".                                
043415    02 FILLER                    PIC X(50) VALUE                              
043420 "HNAME        := MYSELF(HOSTNAME);".                                         
043425*   02 FILLER                    PIC X(50) VALUE                              
043430*"  IF HNAME = 'ACYPBETA'  THEN    ".                                         
043435*   02 FILLER                    PIC X(50) VALUE                              
043440*"     ACCESSCODE:= 90222458/PETERCB3; ".                                     
043445    02 FILLER                    PIC X(50) VALUE                              
043450 "START ".                                                                    
043455    02 WKS-LOTE-NAME             PIC X(41).                                   
043460    02 FILLER                    PIC X(01) VALUE "(".                         
043465    02 FILLER                    PIC X(01) VALUE QUOTES.                      
043467    02 FILLER                    PIC X(09) VALUE "ESPECIAL ".                 
043470    02 FILLER                    PIC X(05) VALUE "P188/".                     
043475    02 WKS-MTP-P188              PIC X(08) VALUE ZEROS.                       
043477    02 FILLER                    PIC X(01) VALUE SPACE.                       
043479    02 WKS-WFL-P188              PIC X(31) VALUE "    ".                      
043480    02 FILLER                    PIC X(01) VALUE QUOTES.                      
043481    02 FILLER                    PIC X(02) VALUE ");".                        
043483    02 FILLER                    PIC X(10) VALUE "END JOB.".                  
043485                                                                              
051900                                                                              
052000 01 WKS-WFL-PARAM.                                                            
052100    03 WKS-WFL-SISCTE PIC 9(12).                                              
052200    03 WKS-WFL-NODO   PIC 9(02).                                              
052300    03 WKS-WFL-SEC    PIC 9(04).                                              
052400    03 WKS-WFL-FEC    PIC 9(08).                                              
052500    03 WKS-WFL-REG    PIC 9(04).                                              
052600                                                                              
052700 01 WS-TAB-LEYENDA.                                                           
052800       03 FILLER            PIC X(046) VALUE                                  
052900          "A=POR RECIBIRSE".                                                  
053000       03 FILLER            PIC X(046) VALUE                                  
053100          "B=RECIBIDO".                                                       
053200       03 FILLER            PIC X(046) VALUE                                  
053300          "C=EN PROCESO".                                                     
053400       03 FILLER            PIC X(046) VALUE                                  
053500          "D=PROCESADO-TERMINADO                         ".                   
053600       03 FILLER            PIC X(046) VALUE                                  
053700          "E=BLOQUEADO POR RECIBIRSE".                                        
053800       03 FILLER            PIC X(046) VALUE                                  
053900          "F=BLOQUEADO RECIBIDO".                                             
054000       03 FILLER            PIC X(046) VALUE                                  
054100          "G=SUSPENDIDO".                                                     
054200       03 FILLER            PIC X(046) VALUE                                  
054300          "H=SUSPENDIDO POR INICIO DE BATCH".                                 
054400       03 FILLER            PIC X(046) VALUE                                  
054500          "I=RECIBIDO FUERA DE HORARIO".                                      
054600       03 FILLER            PIC X(046) VALUE                                  
054700          "J=SUSPENDIDO POR ERROR DE LECTURA".                                
054800       03 FILLER            PIC X(046) VALUE                                  
054900          "K=SUSPENDIDO POR ERROR DE LECTURA-NOTIFICADO".                     
055000       03 FILLER            PIC X(046) VALUE                                  
055100          "L=SUSPENDIDO POR ERROR DE ESCRITURA".                              
055200       03 FILLER            PIC X(046) VALUE                                  
055300          "M=SUSPENDIDO POR ERROR DE ESCRITURA-NOTIFICADO".                   
055400       03 FILLER            PIC X(046) VALUE                                  
055500          "N=SUSPENDIDO POR ERROR DE HEADER".                                 
055600       03 FILLER            PIC X(046) VALUE                                  
055700          "O=SUSPENDIDO POR ERROR DE TRAILER".                                
055800       03 FILLER            PIC X(046) VALUE                                  
055900          "P=ERROR ARCHIVO DE ENTRADA REMOVIDO".                              
056000       03 FILLER            PIC X(046) VALUE                                  
056100          "Q=ERROR ARCHIVO DE ENTRADA REMOVIDO-NOTIFICADO".                   
056102*** IBM-CHARITY-2002 INI                                                      
056104       03 FILLER            PIC X(046) VALUE                                  
056106          "R=ARCHIVO SIN INTEGRIDAD                      ".                   
056108       03 FILLER            PIC X(046) VALUE                                  
056110          "S=EXCEDIO REGISTROS PERMITIDOS                ".                   
056112       03 FILLER            PIC X(046) VALUE                                  
056114          "T=TERMINADO PARCIAL                           ".                   
056116       03 FILLER            PIC X(046) VALUE                                  
056118          "U=ARCHIVO NO RECIBIDO                         ".                   
056120       03 FILLER            PIC X(046) VALUE                                  
056122          "V=VALIDANDO                                   ".                   
056124       03 FILLER            PIC X(046) VALUE                                  
056126          "W=DISPERSANDO                                 ".                   
056200 01 WS-TAB-LEYENDA-X  REDEFINES WS-TAB-LEYENDA.                               
056300    03 WKS-TAB-LEYOCC       OCCURS 23 TIMES                                   
056302*** IBM-CHARITY-2002 FIN                                                      
056400                            INDEXED BY INDICE.                                
056500       05 WKS-ID-LEY        PIC X(001).                                       
056600       05 FILLER            PIC X(001).                                       
056700       05 WKS-LEYENDA       PIC X(044).                                       
056702                                                                              
056704*** IBM-CHARITY-2002 INI                                                      
056706 01 WS-TAB-LEYENDA-SUBEST.                                                    
056708       03 FILLER            PIC X(026) VALUE                                  
056710          " - OK                     ".                                       
056712       03 FILLER            PIC X(026) VALUE                                  
056714          "J-ERROR DE LECTURA        ".                                       
056716       03 FILLER            PIC X(026) VALUE                                  
056718          "K-ERROR DE LECTURA        ".                                       
056720       03 FILLER            PIC X(026) VALUE                                  
056722          "L-ERROR DE ESCRITURA      ".                                       
056724       03 FILLER            PIC X(026) VALUE                                  
056726          "M-ERROR DE ESCRITURA      ".                                       
056728       03 FILLER            PIC X(026) VALUE                                  
056730          "N-ERROR DE HEADER         ".                                       
056732       03 FILLER            PIC X(026) VALUE                                  
056734          "O-ERROR DE TRAILER        ".                                       
056736       03 FILLER            PIC X(026) VALUE                                  
056738          "P-ARCHIVO REMOVIDO        ".                                       
056740       03 FILLER            PIC X(026) VALUE                                  
056742          "Q-ARCHIVO REMOVIDO        ".                                       
056744       03 FILLER            PIC X(026) VALUE                                  
056746          "R-ERROR DE INTEGRIDAD     ".                                       
056748       03 FILLER            PIC X(026) VALUE                                  
056750          "S-EXCEDIO LIMITE REGISTROS".                                       
056752                                                                              
056754                                                                              
056756                                                                              
056758                                                                              
056760                                                                              
056762                                                                              
056764                                                                              
056766                                                                              
056768                                                                              
056770                                                                              
056772 01 WS-TAB-LEYENDA-ARRAYSUB REDEFINES WS-TAB-LEYENDA-SUBEST.                  
056774    03 WKS-TAB-LEYOCC-SUB   OCCURS 11 TIMES                                   
056776                            INDEXED BY INDICE-SUB.                            
056778       05 WKS-ID-LEY-SUB        PIC X(001).                                   
056780       05 WKS-LEYENDA-SUB       PIC X(025).                                   
056782*** IBM-CHARITY-2002 FIN                                                      
056800                                                                              
056900 01 WKS-SEC-ARCCTRL         PIC 9(04) VALUE ZEROS.                            
057000                                                                              
057100 01 WS-SIST-CTE             PIC 9(12) VALUE ZEROS.                            
057200 01 WS-TIPO                 PIC 9(02) VALUE ZEROS.                            
057300 01 WS-SECUENCIAL           PIC 9(04) VALUE ZEROS.                            
057400 01 WS-NODO                 PIC 9(02) VALUE ZEROS.                            
057500 01 WKS-HORARIO-MAQ         PIC 9(06).                                        
057600 01 WKS-TIME-MAQ REDEFINES  WKS-HORARIO-MAQ.                                  
057700    03 WKS-TIME-MAQ-H       PIC 9(02).                                        
057800    03 WKS-TIME-MAQ-M       PIC 9(02).                                        
057900    03 WKS-TIME-MAQ-S       PIC 9(02).                                        
058000 01 WKS-TIME-MAX            PIC 9(06) VALUE 100000.                           
058100 01 WKS-TIME-INI            PIC 9(06) VALUE 190000.                           
058200 01 WKS-FEC-TERMINO         PIC 9(08) VALUE ZEROS.                            
058300                                                                              
058400                                                                              
058500******************************************************************            
058600 REPORT SECTION.                                                              
058700******************************************************************            
058800************    REPORTE DE ARCHIVOS PROCESADOS                                
058900******************************************************************            
059000 RD REPORTE-PROC                                                              
059100          PAGE LIMIT  40 LINES                                                
059200          HEADING      1                                                      
059300          FIRST DETAIL 9                                                      
059400          LAST  DETAIL 40.                                                    
059500 01 R01-ENC-PROC TYPE PH.                                                     
059600    02 LINE 1.                                                                
059700       03 COLUMN  051     PIC X(30) VALUE                                     
059800          "BANCO NACIONAL DE MEXICO, S.A.".                                   
059900*---------                                                                    
060000    02 LINE 2.                                                                
060100       03 COLUMN  055     PIC X(20) VALUE                                     
060200          "DEPOSITOS A LA VISTA".                                             
060300*---------                                                                    
060400    02 LINE 3.                                                                
060500       03 COLUMN  001     PIC X(23) VALUE                                     
060600          "S500-P187-001PROCESADOS".                                          
060700       03 COLUMN  055     PIC X(50) VALUE                                     
060800          "ARCHIVOS PROCESADOS".                                              
060900       03 COLUMN  115     PIC X(06) VALUE  "FECHA ".                          
061000       03 COLUMN  122     PIC X(10) SOURCE WKS-EDIT-FECMAQ.                   
061100*---------                                                                    
061200    02 LINE 4.                                                                
061300       03 COLUMN  001     PIC X(08) VALUE  "PROCESO ".                        
061400       03 COLUMN  009     PIC X(10) SOURCE WKS-EDIT-FECPROC.                  
061500       03 COLUMN  115     PIC X(06) VALUE  "HOJA  ".                          
061600       03 COLUMN  122     PIC 9(05) SOURCE PAGE-COUNTER.                      
061700*----------                                                                   
061800    02 LINE 5.                                                                
061900       03 COLUMN  001     PIC X(05) VALUE  "HORA ".                           
062000       03 COLUMN  009     PIC X(08) SOURCE WKS-EDIT-TIME.                     
062100       03 COLUMN  024     PIC X(04) VALUE  "CSI:".                            
062200       03 COLUMN  030     PIC X(02) SOURCE WKS-CSI.                           
062300*----------                                                                   
062400    02 LINE 6.                                                                
062500       03 COLUMN  001     PIC X(90) VALUE  SPACES.                            
062600*----------                                                                   
062700    02 LINE 7.                                                                
062800       03 COLUMN  016     PIC X(08) VALUE  "ARCHIVO".                         
062900       03 COLUMN  035     PIC X(24) VALUE                                     
063000          "FECHA   SIST/CLIENTE/SEC".                                         
063002*** IBM-CHARITY-2002 INI                                                      
063004       03 COLUMN  080     PIC X(07) VALUE "ESTATUS".                          
063006       03 COLUMN  116     PIC X(10) VALUE "REINTENTOS".                       
063008*** IBM-CHARITY-2002 FIN                                                      
063100*----------                                                                   
063200    02 LINE 8.                                                                
063300       03 COLUMN  001     PIC X(35) VALUE                                     
063400          "FECHA/HORA ARRIBO   HORA INICIO/FIN".                              
063500       03 COLUMN  038     PIC X(37) VALUE                                     
063600          "TRNXSEG COPIA  TOTAL REG.  PROCESADOS".                            
063700       03 COLUMN  083     PIC X(49) VALUE                                     
063800          "OK        RECHAZADOS     FORANEOS   NO PROCESADOS".                
063900                                                                              
064000*---------                                                                    
064100 01 R01-DET-PROC             TYPE DETAIL.                                     
064200    02 LINE PLUS 1.                                                           
064300       03 COLUMN  001     PIC X(30) VALUE  SPACES.                            
064400    02 LINE PLUS 1.                                                           
064500       03 COLUMN  001     PIC X(76) SOURCE WKS-NOM-ARCHENT.                   
064502*** IBM-CHARITY-2002 INI                                                      
064504       03 COLUMN  080     PIC X(01) SOURCE A01-ESTATUS.                       
064506       03 COLUMN  081     PIC X(01) VALUE "=".                                
064508       03 COLUMN  082     PIC X(50) SOURCE A01-LEYENDA.                       
064510       03 COLUMN  124     PIC Z9    SOURCE A01-REINTENTOS.                    
064511       03 COLUMN  126     PIC X(06) VALUE "      ".                           
064512*** IBM-CHARITY-2002 FIN                                                      
064600    02 LINE PLUS 1.                                                           
064700       03 COLUMN  001     PIC 9(08)  SOURCE A01-FEC-ARRIBO.                   
064800       03 COLUMN  010     PIC 9(02)  SOURCE A01-HORA-ARR-HH.                  
064900       03 COLUMN  012     PIC X(01)  VALUE ":".                               
065000       03 COLUMN  013     PIC 9(02)  SOURCE A01-HORA-ARR-MM.                  
065100       03 COLUMN  015     PIC X(01)  VALUE ":".                               
065200       03 COLUMN  016     PIC 9(02)  SOURCE A01-HORA-ARR-SS.                  
065300       03 COLUMN  020     PIC 9(02)  SOURCE A01-HORA-INI-HH.                  
065400       03 COLUMN  022     PIC X(01)  VALUE ":".                               
065500       03 COLUMN  023     PIC 9(02)  SOURCE A01-HORA-INI-MM.                  
065600       03 COLUMN  025     PIC X(01)  VALUE ":".                               
065700       03 COLUMN  026     PIC 9(02)  SOURCE A01-HORA-INI-SS.                  
065800       03 COLUMN  029     PIC 9(02)  SOURCE A01-HORA-FIN-HH.                  
065900       03 COLUMN  031     PIC X(01)  VALUE ":".                               
066000       03 COLUMN  032     PIC 9(02)  SOURCE A01-HORA-FIN-MM.                  
066100       03 COLUMN  034     PIC X(01)  VALUE ":".                               
066200       03 COLUMN  035     PIC 9(02)  SOURCE A01-HORA-FIN-SS.                  
066300       03 COLUMN  039 PIC ZZZ,ZZ9    SOURCE A01-TRNXSEG.                      
066400       03 COLUMN  048     PIC 9(02)  SOURCE A01-NUM-COPIA.                    
066500       03 COLUMN  052 PIC ZZ,ZZZ,ZZ9 SOURCE A01-TOT-REG.                      
066600       03 COLUMN  066 PIC ZZ,ZZZ,ZZ9 SOURCE A01-REG-PROC.                     
066700       03 COLUMN  080 PIC ZZ,ZZZ,ZZ9 SOURCE A01-REG-OK.                       
066800       03 COLUMN  094 PIC ZZ,ZZZ,ZZ9 SOURCE A01-REG-RECH.                     
066900       03 COLUMN  108 PIC ZZ,ZZZ,ZZ9 SOURCE A01-REG-FOR.                      
066904       03 COLUMN  122 PIC ZZ,ZZZ,ZZ9 SOURCE WS-REG-NPROCESADOS.               
067000                                                                              
067100 01 R01-DET-PARCIAL1           TYPE DETAIL.                                   
067200    02 LINE PLUS 1.                                                           
067300       03 COLUMN 052      PIC X(38) VALUE                                     
067400          "-----------  -----------   -----------".                           
067500       03 COLUMN 093      PIC X(39) VALUE                                     
067600          "-----------   -----------   -----------".                          
067700                                                                              
067800 01 R01-DET-PARCIAL2           TYPE DETAIL.                                   
067900    02 LINE PLUS 1.                                                           
068000       03 COLUMN 001      PIC X(32) VALUE                                     
068100          "TOTAL ARCHIVOS SISTEMA/CLIENTE: ".                                 
068200       03 COLUMN 039  PIC ZZ,ZZ9        SOURCE WKS-R1-TOTARCH.                
068300       03 COLUMN 049  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-REGXARCH.               
068400       03 COLUMN 063  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-PROCXARCH.              
068500       03 COLUMN 077  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-OKXARCH.                
068600       03 COLUMN 091  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-RECHXARCH.              
068700       03 COLUMN 105  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-FORANXARCH.             
068704       03 COLUMN 119  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE                                
068706                                             WKS-R1-NOPROCESADOS.             
068800                                                                              
068900*---------                                                                    
069000 01 R01-DET-PROC-VACIO         TYPE DETAIL.                                   
069100    02 LINE PLUS 1.                                                           
069200       03 COLUMN  001     PIC X(30) VALUE SPACES.                             
069300       03 COLUMN  035     PIC X(47) VALUE                                     
069400          "********       NO HAY INFORMACION       *******".                  
069500                                                                              
069600*---------                                                                    
069700 01 R01-DET-PROC-TOTAL         TYPE DETAIL.                                   
069800    02 LINE PLUS 2.                                                           
069900       03 COLUMN 001      PIC X(28)  VALUE                                    
070000          "TOTAL ARCHIVOS PROCESADOS:  ".                                     
070100       03 COLUMN 032  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-ARCHPROC.               
070200    02 LINE PLUS 1.                                                           
070300       03 COLUMN 001      PIC X(28)  VALUE                                    
070400          "TOTAL REGISTROS          :  ".                                     
070500       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTREG.                
070600    02 LINE PLUS 1.                                                           
070700       03 COLUMN 001      PIC X(28)  VALUE                                    
070800          "PROCESADOS               :  ".                                     
070900       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTPROC.               
071000    02 LINE PLUS 1.                                                           
071100       03 COLUMN 001      PIC X(28)  VALUE                                    
071200          "OK                       :  ".                                     
071300       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTOK.                 
071400    02 LINE PLUS 1.                                                           
071500       03 COLUMN 001      PIC X(28)  VALUE                                    
071600          "RECHAZADOS               :  ".                                     
071700       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTRECH.               
071800    02 LINE PLUS 1.                                                           
071900       03 COLUMN 001      PIC X(28)  VALUE                                    
072000          "FORANEOS                 :  ".                                     
072100       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTFORAN.              
072102*** IBM-CHARITY-2002 INI                                                      
072104    02 LINE PLUS 1.                                                           
072106       03 COLUMN 001      PIC X(28)  VALUE                                    
072108          "NO PROCESADOS            :  ".                                     
072110       03 COLUMN 029   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R1-TOTNOPROCE.            
072112*** IBM-CHARITY-2002 FIN                                                      
072200                                                                              
072300******************************************************************            
072400************    REPORTE DE ARCHIVOS PENDIENTES                                
072500******************************************************************            
072600 RD REPORTE-PEND                                                              
072700          PAGE LIMIT  40 LINES                                                
072800          HEADING      1                                                      
072900          FIRST DETAIL 8                                                      
073000          LAST  DETAIL 40.                                                    
073100                                                                              
073200 01 R02-ENC-PROC TYPE PH.                                                     
073300    02 LINE 1.                                                                
073400       03 COLUMN  051     PIC X(30) VALUE                                     
073500          "BANCO NACIONAL DE MEXICO, S.A.".                                   
073600*---------                                                                    
073700    02 LINE 2.                                                                
073800       03 COLUMN  055     PIC X(20) VALUE                                     
073900          "DEPOSITOS A LA VISTA".                                             
074000*---------                                                                    
074100    02 LINE 3.                                                                
074200       03 COLUMN  001     PIC X(23) VALUE                                     
074300          "S500-P187-002PENDXAPLIC".                                          
074400       03 COLUMN  052     PIC X(50) VALUE                                     
074500          "ARCHIVOS PENDIENTES DE APLICAR".                                   
074600       03 COLUMN  115     PIC X(06) VALUE  "FECHA ".                          
074700       03 COLUMN  122     PIC X(10) SOURCE WKS-EDIT-FECMAQ.                   
074800*---------                                                                    
074900    02 LINE 4.                                                                
075000       03 COLUMN  001     PIC X(08) VALUE                                     
075100          "PROCESO ".                                                         
075200       03 COLUMN  009     PIC X(10) SOURCE WKS-EDIT-FECPROC.                  
075300       03 COLUMN  115     PIC X(06) VALUE  "HOJA  ".                          
075400       03 COLUMN  122     PIC 9(05) SOURCE PAGE-COUNTER.                      
075500*----------                                                                   
075600    02 LINE 5.                                                                
075700       03 COLUMN  001     PIC X(05) VALUE  "HORA ".                           
075800       03 COLUMN  009     PIC X(08) SOURCE WKS-EDIT-TIME.                     
075900       03 COLUMN  024     PIC X(04) VALUE  "CSI:".                            
076000       03 COLUMN  030     PIC X(02) SOURCE WKS-CSI.                           
076100*----------                                                                   
076200    02 LINE 6.                                                                
076300       03 COLUMN  001     PIC X(90) VALUE  SPACES.                            
076400*----------                                                                   
076500    02 LINE 7.                                                                
076600       03 COLUMN  016     PIC X(08) VALUE  "ARCHIVO".                         
076700       03 COLUMN  035     PIC X(51) VALUE                                     
076800          "FECHA   SIST/CLIENTE/SEC                   ESTATUS".               
076900       03 COLUMN  085     PIC X(12) VALUE "/DESCRIPCION".                     
076904       03 COLUMN  102     PIC X(10) VALUE "REINTENTOS".                       
077000*---------                                                                    
077100*---------                                                                    
077200 01 R02-DET-PROC             TYPE DETAIL.                                     
077300    02 LINE PLUS 1.                                                           
077400       03 COLUMN  001     PIC X(02) VALUE  "(S".                              
077500       03 COLUMN  003     PIC X(03) SOURCE A02-USER.                          
077600       03 COLUMN  006     PIC X(02) VALUE  ")S".                              
077700       03 COLUMN  008     PIC X(04) SOURCE A02-SISTEMA.                       
077800       03 COLUMN  011     PIC X(11) VALUE  "/FILE/INTE/".                     
077900       03 COLUMN  022     PIC X(08) SOURCE A02-BUZON.                         
078000       03 COLUMN  030     PIC X(01) VALUE  "/".                               
078100       03 COLUMN  031     PIC X(02) SOURCE A02-NODO.                          
078200       03 COLUMN  033     PIC X(01) VALUE  "/".                               
078300       03 COLUMN  034     PIC X(08) SOURCE A02-FEC-PROC.                      
078400       03 COLUMN  042     PIC X(01) VALUE  "/".                               
078500       03 COLUMN  043     PIC X(12) SOURCE A02-SIST-CTE.                      
078600       03 COLUMN  055     PIC X(01) VALUE  "/".                               
078700       03 COLUMN  056     PIC X(04) SOURCE A02-SECUENCIAL.                    
078800       03 COLUMN  060     PIC X(04) VALUE  " ON ".                            
078900       03 COLUMN  064     PIC X(12) SOURCE A02-PACK.                          
079000       03 COLUMN  078     PIC X(01) SOURCE A02-ESTATUS.                       
079100       03 COLUMN  079     PIC X(01) VALUE  "=".                               
079200       03 COLUMN  080     PIC X(50) SOURCE A02-LEYENDA.                       
079204       03 COLUMN  110     PIC   Z9   SOURCE A02-REINTENTOS.                   
079300                                                                              
079400*---------                                                                    
079500 01 R02-DET-PROC-VACIO         TYPE DETAIL.                                   
079600    02 LINE PLUS 1.                                                           
079700       03 COLUMN  001     PIC X(30) VALUE SPACES.                             
079800       03 COLUMN  035     PIC X(47) VALUE                                     
079900          "********       NO HAY INFORMACION       *******".                  
080000*---------                                                                    
080100 01 R02-DET-PROC-TOT           TYPE DETAIL.                                   
080200    02 LINE PLUS 1.                                                           
080300       03 COLUMN 001      PIC X(30) VALUE SPACES.                             
080400    02 LINE PLUS 2.                                                           
080500       03 COLUMN 001      PIC X(33) VALUE                                     
080600          "TOTAL ARCHIVOS SISTEMA/CLIENTE:".                                  
080700       03 COLUMN 033   PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R2-TOTARCH.               
080800                                                                              
080900*---------                                                                    
081000 01 R02-DET-PROC-TOTAL         TYPE DETAIL.                                   
081100    02 LINE PLUS 1.                                                           
081200       03 COLUMN 001      PIC X(30) VALUE SPACES.                             
081300    02 LINE PLUS 2.                                                           
081400       03 COLUMN 001      PIC X(28)  VALUE                                    
081500          "TOTAL ARCHIVOS PENDIENTES:  ".                                     
081600       03 COLUMN 033  PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R2-TOTALPEND.              
081700******************************************************************            
081800************    REPORTE DE ARCHIVOS RECHAZADOS                                
081900******************************************************************            
082000 RD REPORTE-RECH                                                              
082100          PAGE LIMIT  40 LINES                                                
082200          HEADING      1                                                      
082300          FIRST DETAIL 8                                                      
082400          LAST  DETAIL 40.                                                    
082500                                                                              
082600 01 R03-ENC-PROC TYPE PH.                                                     
082700    02 LINE 1.                                                                
082800       03 COLUMN  051     PIC X(30) VALUE                                     
082900          "BANCO NACIONAL DE MEXICO, S.A.".                                   
083000*---------                                                                    
083100    02 LINE 2.                                                                
083200       03 COLUMN  055     PIC X(21) VALUE                                     
083300          "DEPOSITOS A LA VISTA".                                             
083400*---------                                                                    
083500    02 LINE 3.                                                                
083600       03 COLUMN  001     PIC X(23) VALUE                                     
083700          "S500-P187-003RECHAZADOS".                                          
083800       03 COLUMN  055     PIC X(50) VALUE                                     
083900          "ARCHIVOS RECHAZADOS".                                              
084000       03 COLUMN  115     PIC X(06) VALUE  "FECHA ".                          
084100       03 COLUMN  122     PIC X(10) SOURCE WKS-EDIT-FECMAQ.                   
084200*---------                                                                    
084300    02 LINE 4.                                                                
084400       03 COLUMN  001     PIC X(08) VALUE                                     
084500          "PROCESO ".                                                         
084600       03 COLUMN  009     PIC X(10) SOURCE WKS-EDIT-FECPROC.                  
084700       03 COLUMN  115     PIC X(06) VALUE  "HOJA  ".                          
084800       03 COLUMN  122     PIC 9(05) SOURCE PAGE-COUNTER.                      
084900*----------                                                                   
085000    02 LINE 5.                                                                
085100       03 COLUMN  001     PIC X(05) VALUE  "HORA ".                           
085200       03 COLUMN  009     PIC X(08) SOURCE WKS-EDIT-TIME.                     
085300       03 COLUMN  024     PIC X(04) VALUE  "CSI:".                            
085400       03 COLUMN  030     PIC X(02) SOURCE WKS-CSI.                           
085500*----------                                                                   
085600    02 LINE 6.                                                                
085700       03 COLUMN  001     PIC X(90) VALUE  SPACES.                            
085800    02 LINE 7.                                                                
085900       03 COLUMN  016     PIC X(08) VALUE  "ARCHIVO".                         
086000       03 COLUMN  035     PIC X(51) VALUE                                     
086100          "FECHA   SIST/CLIENTE/SEC                   ESTATUS".               
086200       03 COLUMN  085     PIC X(12) VALUE "/DESCRIPCION".                     
086204       03 COLUMN  122     PIC X(10) VALUE "REINTENTOS".                       
086300*---------                                                                    
086400*---------                                                                    
086500 01 R03-DET-PROC             TYPE DETAIL.                                     
086600    02 LINE PLUS 1.                                                           
086700       03 COLUMN  001     PIC X(02) VALUE  "(S".                              
086800       03 COLUMN  003     PIC X(03) SOURCE A03-USER.                          
086900       03 COLUMN  006     PIC X(02) VALUE  ")S".                              
087000       03 COLUMN  008     PIC X(04) SOURCE A03-SISTEMA.                       
087100       03 COLUMN  011     PIC X(11) VALUE  "/FILE/INTE/".                     
087200       03 COLUMN  022     PIC X(08) SOURCE A03-BUZON.                         
087300       03 COLUMN  030     PIC X(01) VALUE  "/".                               
087400       03 COLUMN  031     PIC X(02) SOURCE A03-NODO.                          
087500       03 COLUMN  033     PIC X(01) VALUE  "/".                               
087600       03 COLUMN  034     PIC X(08) SOURCE A03-FEC-PROC.                      
087700       03 COLUMN  042     PIC X(01) VALUE  "/".                               
087800       03 COLUMN  043     PIC X(12) SOURCE A03-SIST-CTE.                      
087900       03 COLUMN  055     PIC X(01) VALUE  "/".                               
088000       03 COLUMN  056     PIC X(04) SOURCE A03-SECUENCIAL.                    
088100       03 COLUMN  060     PIC X(04) VALUE  " ON ".                            
088200       03 COLUMN  064     PIC X(12) SOURCE A03-PACK.                          
088300       03 COLUMN  078     PIC X(01) SOURCE A03-ESTATUS.                       
088400       03 COLUMN  079     PIC X(01) VALUE  "=".                               
088500       03 COLUMN  080     PIC X(50) SOURCE A03-LEYENDA.                       
088504       03 COLUMN  130     PIC   Z9  SOURCE A03-REINTENTOS.                    
088600                                                                              
088700*---------                                                                    
088800 01 R03-DET-PROC-VACIO         TYPE DETAIL.                                   
088900    02 LINE PLUS 1.                                                           
089000       03 COLUMN  001     PIC X(30) VALUE SPACES.                             
089100       03 COLUMN  035     PIC X(47) VALUE                                     
089200          "********       NO HAY INFORMACION       *******".                  
089300*---------                                                                    
089400 01 R03-DET-PROC-TOT           TYPE DETAIL.                                   
089500    02 LINE PLUS 1.                                                           
089600       03 COLUMN 001      PIC X(30) VALUE SPACES.                             
089700    02 LINE PLUS 2.                                                           
089800       03 COLUMN 001      PIC X(33) VALUE                                     
089900          "TOTAL ARCHIVOS SISTEMA/CLIENTE:".                                  
090000       03 COLUMN 033 PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R3-TOTARCH.                 
090100                                                                              
090200*---------                                                                    
090300 01 R03-DET-PROC-TOTAL         TYPE DETAIL.                                   
090400    02 LINE PLUS 1.                                                           
090500       03 COLUMN 001      PIC X(30) VALUE SPACES.                             
090600    02 LINE PLUS 2.                                                           
090700       03 COLUMN 001      PIC X(28)  VALUE                                    
090800          "TOTAL ARCHIVOS RECHAZADOS:  ".                                     
090900       03 COLUMN 033 PIC Z,ZZZ,ZZZ,ZZ9 SOURCE WKS-R3-TOTALRECH.               
091000                                                                              
091100*****************************************************************             
091200 PROCEDURE DIVISION.                                                          
091300*****************************************************************             
091400 DECLARATIVES.                                                                
091500 INTERRUPT-SECCION        SECTION.                                            
091600     USE AS INTERRUPT PROCEDURE.                                              
091700 INTERRUPT-BY-HI.                                                             
091800     DISALLOW  INTERRUPT.                                                     
091900                                                                              
092100     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI-NUMHI                       
092200     IF WKS-HI-NUMHI = 1                                                      
092250        MOVE "I" TO W77-TIPO-DISP                                             
092300        STRING "# DE P188 ACTIVOS AL MOMENTO: " WKS-P188-UP                   
092400        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
092500        PERFORM 70000050-MENSAJE                                              
092600     ELSE                                                                     
092700     IF WKS-HI-NUMHI = 4                                                      
092900        STRING "PROCESO DETENIDO POR INTERRUPCION CON HI-4,",                 
093000        "# DE P188 ACTIVOS AL MOMENTO: ", WKS-P188-UP                         
093300        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
093400        PERFORM 70000050-MENSAJE                                              
093500     ELSE                                                                     
093600        STRING "NUM HI ERRONEO ", WKS-HI-NUMHI                                
093700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
093800        PERFORM 70000050-MENSAJE.                                             
093900     MOVE "E" TO W77-TIPO-DISP                                                
094000     SET MYSELF (TASKVALUE)  TO ZERO.                                         
094100     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
094200     OF MYSELF                                                                
094300     ALLOW INTERRUPT.                                                         
094400     IF WKS-HI-NUMHI = 4                                                      
094500        STOP RUN.                                                             
094600 END DECLARATIVES.                                                            
094700                                                                              
094800*****************************************************************             
094900 00000000-CONTROL  SECTION  01.                                               
095000*****************************************************************             
095100 00000000-CONTROL-PROGRAMA.                                                   
095200*****************************************************************             
095300                                                                              
095400    PERFORM 40000000-INICIO.                                                  
095500    PERFORM 50000000-PROCESO.                                                 
095600    MOVE 0 TO WKS-FIN                                                         
095700    PERFORM 60000000-FIN.                                                     
095800    STOP RUN.                                                                 
095900                                                                              
096000*================                                                             
096100 40000000-INICIO.                                                             
096200*================                                                             
096220                                                                              
096240    MOVE "E" TO W77-TIPO-DISP                                                 
096300    PERFORM 10000100-VERSIONES.                                               
096305    MOVE "S500JBATCH"    TO  S000-CTR-LIBID                                   
096310    PERFORM 20000100-DAME-TIT-VERS                                            
096315    MOVE S000-CTR-NOMLIB TO  WKS-LOTE-NAME                                    
096325                                                                              
096330    MOVE "S500P188"      TO  S000-CTR-LIBID                                   
096335    PERFORM 20000100-DAME-TIT-VERS                                            
096340    MOVE S000-CTR-NOMLIB TO  WKS-TIT-P188                                     
096355    MOVE WKS-TIT-MTP   TO WKS-MTP-P188                                        
096360                                                                              
096365                                                                              
096400    MOVE 2            TO  W77-USO-LIBLJ                                       
096500    MOVE "P187"       TO  WS-0101-PASO-MSG                                    
096600                          W77-MY-PASO                                         
096700     MOVE "25MTP004"   TO  WS-0101-MTP-MSG                                    
096800                          W77-S000-MY-VERSION                                 
096900    MOVE "S500P187"   TO  W77-S000-MY-ID.                                     
097000    MOVE ALL "/"      TO  WKS-EDIT-FECMAQ WKS-EDIT-FECPROC                    
097100    MOVE ALL ":"      TO  WKS-EDIT-TIME                                       
097200                                                                              
097300    PERFORM 10000100-VERSIONES.                                               
097400    PERFORM 00001000-INICIO-PGM.                                              
097500    PERFORM 10000000-TITLE-LIBRERIAS.                                         
097600    PERFORM 20000000-ABRE-BASE.                                               
097700    PERFORM 10000050-HORA-INI.                                                
097800*****************************************************************             
097900                                                                              
098000 10000050-HORA-INI.                                                           
098100*==================                                                           
098200    ACCEPT WKS-TIME-MAQ FROM TIME                                             
098300    PERFORM 90000000-DAME-FEC-MAQUINA                                         
098400    MOVE WKS-FEC-MAQ-08    TO WS-A04-FEC                                      
098500    IF WKS-TIME-MAQ > WKS-TIME-INI                                            
098600       MOVE 8              TO WS-S006-FUNCION                                 
098700       MOVE WS-A04-FEC     TO WS-S006-FECHA1                                  
098800       MOVE 1              TO WS-S006-FECHA2                                  
098900       MOVE 12             TO WS-S006-FORMATO                                 
099000       PERFORM 20000006-LOCSUP                                                
099100       MOVE WS-S006-FECHA1 TO WKS-FEC-TERMINO                                 
099200    ELSE                                                                      
099300       MOVE WS-A04-FEC     TO WKS-FEC-TERMINO.                                
099400                                                                              
099500 00001000-INICIO-PGM.                                                         
099600*====================                                                         
099700     PERFORM 00000000-CHANGE-SOPCOMS.                                         
099800     PERFORM 0000-CALL-HOSTNAME.                                              
099900     IF WS-DH-HOSTNAME-VDM                                                    
100000        MOVE 10 TO WS-TIT-CE-NODO                                             
100100     ELSE                                                                     
100200        MOVE 04 TO WS-TIT-CE-NODO.                                            
100300                                                                              
100400                                                                              
100500*****************************************************************             
100600 10000000-TITLE-LIBRERIAS.                                                    
100700*************************** LIBRERIA DE VERSIONES ***************             
100800                                                                              
100900     MOVE "S500P187"     TO W77-S000-MY-ID                                    
101000     PERFORM 20000100-CHECAME-VERSION.                                        
101100     IF S000-CTR-CVEERROR < 0                                                 
101200        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
101300        PERFORM 70000050-MENSAJE                                              
101400        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
101500                                                                              
101600     PERFORM 10000006-LOCSUP.                                                 
101700                                                                              
101800     MOVE "S500L021SDOS"          TO S000-CTR-LIBID.                          
101900     PERFORM 10000500-L02N.                                                   
102000                                                                              
103300                                                                              
103400 20000000-ABRE-BASE.                                                          
103500*===================                                                          
103502*** IBM-CHARITY-2002 INI                                                      
103600*     OPEN INQUIRY S500BD04TARJETAS.                                          
103602     OPEN UPDATE  S500BD04TARJETAS.                                           
103604*** IBM-CHARITY-2002 FIN                                                      
103700     OPEN INQUIRY S500BD01CAPTACION.                                          
103900     MOVE 0 TO WS-STATUS-BASE                                                 
104000     PERFORM 90000002-B02CONTROL-FIND                                         
104100     IF WS-STATUS-BASE > 0                                                    
104200        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
104300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
104400        PERFORM 70000050-MENSAJE                                              
104500        CALL SYSTEM DMTERMINATE.                                              
104600     CLOSE S500BD01CAPTACION.                                                 
104700                                                                              
104800*=================                                                            
104900 50000000-PROCESO.                                                            
105000*=================                                                            
105100                                                                              
105200  ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT OF MYSELF.             
105300  ALLOW INTERRUPT.                                                            
105400      MOVE B02-FECHA-LINEA          TO WS-TIT-CE-FEC W88-FEC-OK               
105500                                       WS-LIBFEC-FECHAIN                      
105600                                       WS-A04-FEC                             
105700      ACCEPT A01-REG-PROC FROM TIME                                           
105800      PERFORM 50000100-VALIDA-ARCH                                            
105900      ACCEPT A01-REG-PROC FROM TIME                                           
106000      PERFORM 50000100-INITIATE-REPORTES                                      
106100      MOVE 0 TO WS-STATUS-BASE                                                
106200      SET S500B08PCTRARRIBO TO BEGINNING                                      
106300      PERFORM 50000100-GENERA-ARCHIVOS UNTIL WS-STATUS-BASE > 0               
106400      PERFORM 50000100-GENERA-REPORTES                                        
106500      PERFORM 50000100-TERMINATE-REPORTES.                                    
106600                                                                              
106700*=====================                                                        
106800 50000100-VALIDA-ARCH.                                                        
106900*=====================                                                        
107000                                                                              
107100   MOVE 0                     TO WKS-FIN                                      
107200                                                                              
107300* PROYECTA UN DIA ATRAS A LA FECHA OBTENIDA DE LA BD                          
107400* PARA OBTENER LA FECHA DE PROCESO (1 DIA HABIL ATRAS)                        
107500   MOVE 15                    TO WS-S006-FUNCION                              
107600   MOVE B02-FECHA-LINEA       TO WS-S006-FECHA1                               
107700   MOVE 1                     TO WS-S006-FECHA2                               
107800   MOVE 12                    TO WS-S006-FORMATO                              
107900   PERFORM 20000006-LOCSUP                                                    
108000   MOVE WS-S006-FECHA1        TO W88-FEC-OK                                   
108100                                                                              
108200   MOVE WS-TIT-CE-NODO        TO WS-A04-CSI                                   
108300*OBTIENE FECHA T-2                                                            
108400   MOVE  10                   TO WS-S006-FUNCION                              
108500   MOVE W88-FEC-OK            TO WS-S006-FECHA1                               
108600   MOVE 2                     TO WS-S006-FECHA2                               
108700   MOVE 12                    TO WS-S006-FORMATO                              
108800   PERFORM 20000006-LOCSUP                                                    
108900   MOVE WS-S006-FECHA1        TO WS-A04-FEC                                   
109000   MOVE 0                     TO WS-A04-SEC WKS-SEC-ARCCTRL                   
109100   PERFORM 50000100-CALL-P188 UNTIL WKS-SEC-ARCCTRL > 998.                    
109102                                                                              
109104   MOVE 0                     TO WS-A04-SEC WKS-SEC-ARCCTRL.                  
109106   IF WS-TIT-CE-NODO = 10                                                     
109108      MOVE   04  TO  WS-A04-CSI                                               
109110   ELSE                                                                       
109112      MOVE   10  TO  WS-A04-CSI.                                              
109114   PERFORM 50000100-CALL-P188 UNTIL WKS-SEC-ARCCTRL > 998.                    
109116   MOVE WS-TIT-CE-NODO        TO WS-A04-CSI.                                  
109118                                                                              
109200                                                                              
109300   MOVE -1                    TO W77-LIBFEC-INCREM                            
109400*OBTIENE FECHA T-1                                                            
109500   MOVE  10                   TO WS-S006-FUNCION                              
109600   MOVE W88-FEC-OK            TO WS-S006-FECHA1                               
109700   MOVE 1                     TO WS-S006-FECHA2                               
109800   MOVE 12                    TO WS-S006-FORMATO                              
109900   PERFORM 20000006-LOCSUP                                                    
110000   MOVE WS-S006-FECHA1        TO WS-A04-FEC                                   
110100   MOVE 0                     TO WS-A04-SEC WKS-SEC-ARCCTRL                   
110200   PERFORM 50000100-CALL-P188 UNTIL WKS-SEC-ARCCTRL > 998.                    
110202                                                                              
110204   MOVE 0                     TO WS-A04-SEC WKS-SEC-ARCCTRL.                  
110206   IF WS-TIT-CE-NODO = 10                                                     
110208      MOVE   04  TO  WS-A04-CSI                                               
110210   ELSE                                                                       
110212      MOVE   10  TO  WS-A04-CSI.                                              
110214   PERFORM 50000100-CALL-P188 UNTIL WKS-SEC-ARCCTRL > 998.                    
110216   MOVE WS-TIT-CE-NODO        TO WS-A04-CSI.                                  
110218                                                                              
110300   MOVE 0                     TO WKS-SEC-ARCCTRL.                             
110400*===================                                                          
110500 50000100-CALL-P188.                                                          
110600*===================                                                          
110700  MOVE 2                    TO WKS-FIN                                        
110800  ADD  1                    TO WKS-SEC-ARCCTRL                                
110900  MOVE WKS-SEC-ARCCTRL      TO WS-A04-SEC                                     
111000  CHANGE ATTRIBUTE TITLE    OF A04-PROCDET TO WS-TIT-A04                      
111100                                                                              
111200  IF ATTRIBUTE RESIDENT     OF A04-PROCDET IS= VALUE TRUE                     
111300     MOVE WS-A04-FEC      TO WKS-WFL-FEC                                      
111400     MOVE 999999999999    TO WKS-WFL-SISCTE                                   
111500     MOVE WS-A04-CSI      TO WKS-WFL-NODO                                     
111600     MOVE 0               TO WKS-WFL-SEC                                      
111700     MOVE WS-A04-SEC      TO WKS-WFL-REG                                      
111800     MOVE WKS-WFL-PARAM   TO WKS-WFL-P188                                     
111900     DISALLOW INTERRUPT                                                       
112000     CALL SYSTEM WFL   USING WKS-RUN-P188                                     
112100     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
112200     OF MYSELF                                                                
112300     ALLOW INTERRUPT.                                                         
112400                                                                              
112500 50000100-INITIATE-REPORTES.                                                  
112600*---------------------------                                                  
112700                                                                              
112800   PERFORM 90000000-DAME-FEC-MAQUINA                                          
112900   MOVE WKS-FEC-MAQ-08    TO WS-A04-FEC                                       
113000   MOVE WS-A04-AA                TO WKS-FECMAQ-AA                             
113100   MOVE WS-A04-MM                TO WKS-FECMAQ-MM                             
113200   MOVE WS-A04-DD                TO WKS-FECMAQ-DD                             
113300   ACCEPT  WS-HORA-MAQ           FROM TIME                                    
113400   MOVE WS-HORA-MAQ-HH           TO WKS-TIME-HH                               
113500   MOVE WS-HORA-MAQ-MM           TO WKS-TIME-MIN                              
113600   MOVE WS-HORA-MAQ-SS           TO WKS-TIME                                  
113700   MOVE WS-TIT-CE-NODO           TO WKS-CSI                                   
113800   MOVE W88-FEC-OK               TO WS-TIT-CE-FEC WS-A04-FEC                  
113900   MOVE WS-A04-AA                TO WKS-FECPROC-AA WKS-FECMAQ-AA              
114000   MOVE WS-A04-MM                TO WKS-FECPROC-MM                            
114100   MOVE WS-A04-DD                TO WKS-FECPROC-DD                            
114200   MOVE ATTRIBUTE MIXNUMBER      OF MYSELF                                    
114300                                 TO WS-TIT-CE-MIX                             
114400                                                                              
114500   MOVE "001PROCESADOS"          TO WS-TIT-CE-NAME                            
114600   CHANGE ATTRIBUTE TITLE        OF REP-PROCESADO                             
114700                                 TO WS-TIT-REPORTES                           
114800   OPEN OUTPUT REP-PROCESADO                                                  
114900                                                                              
115000   MOVE "002PENDIENTES"          TO WS-TIT-CE-NAME                            
115100   CHANGE ATTRIBUTE TITLE        OF REP-PENDIENTE                             
115200                                 TO WS-TIT-REPORTES                           
115300   OPEN OUTPUT REP-PENDIENTE                                                  
115400                                                                              
115500   MOVE "003RECHAZADOS"          TO WS-TIT-CE-NAME                            
115600   CHANGE ATTRIBUTE TITLE        OF REP-RECHAZADO                             
115700                                 TO WS-TIT-REPORTES                           
115800   OPEN OUTPUT REP-RECHAZADO                                                  
115900                                                                              
116000   OPEN OUTPUT A01-PROC                                                       
116100   OPEN OUTPUT A02-PEND                                                       
116200   OPEN OUTPUT A03-RECH.                                                      
116300                                                                              
116400 50000100-GENERA-ARCHIVOS.                                                    
116500*-------------------------                                                    
116600                                                                              
116700   PERFORM 90400008-B08PCTRA-FINDN                                            
116800   IF WS-STATUS-BASE = 0                                                      
116900      MOVE  B08P-ESTATUS TO WKS-ESTATUS                                       
117000      IF (B08P-FEC-APL = W88-FEC-OK AND W88-STA-PROCESADO) OR                 
117100         (B08P-FEC-APL = W88-FEC-OK AND W88-STA-RECHAZADO) OR                 
117200          W88-STA-PENDIENTE                                                   
117300          MOVE B08P-SIST-CTE   TO WS-SIST-CTE                                 
117400          MOVE B08P-TIPO       TO WS-TIPO                                     
117500          MOVE B08P-SECUENCIAL TO WS-SECUENCIAL                               
117600          MOVE B08P-NODO       TO WS-NODO                                     
117700          MOVE B08P-ESTATUS    TO WKS-ESTATUS                                 
117750          SET B07PSXSISCTESEC  TO BEGINNING                                   
117800          PERFORM 90400007-B07PSXSISCTESEC-F                                  
117900          IF WS-STATUS-BASE > 0                                               
118000             MOVE 0            TO WS-STATUS-BASE                              
118100          ELSE                                                                
118200             PERFORM 50000100-GRABA-ARCHIVOS                                  
118202*** IBM-CHARITY-2002 INI                                                      
118300             IF (B07P-LISTADOS = 1 OR 2 OR 3 OR 4 )                           
118302             AND (B08P-ENVIO-INTE = 1 )                                       
118400*                PERFORM 50000500-RENOMB-ARCH-ENT                             
118500                PERFORM 50000100-REPORTE-DETALLE                              
118502                PERFORM 202002-ACTUALIZA-B08.                                 
118600*             ELSE                                                            
118700*                PERFORM 50000500-RENOMB-ARCH-ENT                             
118800*                PERFORM 50000500-RENOMB-ARCH-SAL.                            
118900*** IBM-CHARITY-2002 FIN                                                      
119000                                                                              
119100 50000100-GENERA-REPORTES.                                                    
119200*-------------------------                                                    
119300                                                                              
119400   CLOSE S500BD04TARJETAS.                                                    
119500   PERFORM 50000100-SORT-ARCHIVOS.                                            
119600                                                                              
119700   OPEN INPUT A01-PROC                                                        
119800   OPEN INPUT A02-PEND                                                        
119900   OPEN INPUT A03-RECH                                                        
120000                                                                              
120100   INITIATE   REPORTE-PROC.                                                   
120200   MOVE 0 TO WKS-FIN                                                          
120300   PERFORM 50000100-REPORTE-PROCESADOS UNTIL WKS-FIN = 1.                     
120400   INITIATE   REPORTE-PEND.                                                   
120500   MOVE 0 TO WKS-FIN                                                          
120600   PERFORM 50000100-REPORTE-PENDIENTES UNTIL WKS-FIN = 1.                     
120700   INITIATE   REPORTE-RECH.                                                   
120800   MOVE 0 TO WKS-FIN                                                          
120900   PERFORM 50000100-REPORTE-RECHAZADOS UNTIL WKS-FIN = 1.                     
121000                                                                              
121100   CLOSE A01-PROC WITH PURGE                                                  
121200   CLOSE A02-PEND WITH PURGE                                                  
121300   CLOSE A03-RECH WITH PURGE.                                                 
121400                                                                              
121500 50000100-SORT-ARCHIVOS.                                                      
121600*-----------------------                                                      
121602*** IBM-CHARITY-2002 INI                                                      
121800*   MOVE ATTRIBUTE LASTRECORD OF A01-PROC TO WKS-LASTREC.                     
121900*   CLOSE A01-PROC WITH SAVE                                                  
122000*   COMPUTE W77-TOT-MEMSIZE  =                                                
122100*           ( ((WKS-LASTREC + 10) / 16) * 24) + 1500.                         
122200*   COMPUTE W77-TOT-DISKSIZE =(WKS-LASTREC + 10) * (21 * 3.5).                
122300*                                                                             
122400*        IF W77-TOT-MEMSIZE < 400000                                          
122500*           MOVE 400000 TO W77-TOT-MEMSIZE                                    
122600*        ELSE                                                                 
122700*        IF W77-TOT-MEMSIZE > 258435000                                       
122800*           MOVE 25843500 TO W77-TOT-MEMSIZE.                                 
122900*                                                                             
122902     COMPUTE W77-FRAMESIZE =                                                  
122904          (ATTRIBUTE FRAMESIZE OF  A01-PROC)                                  
122906     COMPUTE W77-MAXRECSIZE =                                                 
122908          (ATTRIBUTE MAXRECSIZE OF A01-PROC)                                  
122910     COMPUTE W77-LASTRECORD =                                                 
122912          (ATTRIBUTE LASTRECORD OF A01-PROC + 1)                              
122914     CLOSE A01-PROC WITH SAVE.                                                
122916     PERFORM  70000-CALCULA-ESPACIO.                                          
122918                                                                              
123000        MOVE W77-DISK-SIZE     TO WS-MSG-N-14.                                
123100        MOVE W77-MEMORY-SIZE   TO WS-MSG-N-12.                                
123200        STRING "DISK-SIZE =" WS-MSG-N-14                                      
123300               ", MEMORY-SIZE =" WS-MSG-N-12                                  
123400               ", PARA SORT A01-PROC "                                        
123500               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
123600        PERFORM 70000050-MENSAJE.                                             
123700                                                                              
123800   SORT A01-SORT  ON ASCENDING KEY S01-SIST-CTE                               
123900                                   S01-FEC-PROC S01-SECUENCIAL                
124000        USING   A01-PROC                                                      
124100        GIVING  A01-PROC                                                      
124200        MEMORY SIZE W77-MEMORY-SIZE  WORDS                                    
124300        DISK   SIZE W77-DISK-SIZE    WORDS.                                   
124400                                                                              
124500*   MOVE ATTRIBUTE LASTRECORD OF A02-PEND TO WKS-LASTREC.                     
124600*   CLOSE A02-PEND WITH SAVE                                                  
124700*   COMPUTE W77-TOT-MEMSIZE  =                                                
124800*           ( ((WKS-LASTREC + 10) / 16) * 27) + 1500.                         
124900*   COMPUTE W77-TOT-DISKSIZE =(WKS-LASTREC + 10) * (24 * 3.5).                
125000*                                                                             
125100*        IF W77-TOT-MEMSIZE < 400000                                          
125200*           MOVE 400000 TO W77-TOT-MEMSIZE                                    
125300*        ELSE                                                                 
125400*        IF W77-TOT-MEMSIZE > 258435000                                       
125500*           MOVE 25843500 TO W77-TOT-MEMSIZE.                                 
125600                                                                              
125602     PERFORM 70000-INICIALIZA-FORM.                                           
125604     COMPUTE W77-FRAMESIZE =                                                  
125606          (ATTRIBUTE FRAMESIZE OF  A02-PEND)                                  
125608     COMPUTE W77-MAXRECSIZE =                                                 
125610          (ATTRIBUTE MAXRECSIZE OF A02-PEND)                                  
125612     COMPUTE W77-LASTRECORD =                                                 
125614          (ATTRIBUTE LASTRECORD OF A02-PEND + 1)                              
125616     CLOSE A02-PEND WITH SAVE.                                                
125618     PERFORM  70000-CALCULA-ESPACIO.                                          
125620                                                                              
125700        MOVE W77-DISK-SIZE     TO WS-MSG-N-14.                                
125800        MOVE W77-MEMORY-SIZE   TO WS-MSG-N-12.                                
125900        STRING "DISK-SIZE =" WS-MSG-N-14                                      
126000               ", MEMORY-SIZE =" WS-MSG-N-12                                  
126100               ", PARA SORT A02-PEND "                                        
126200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
126300        PERFORM 70000050-MENSAJE.                                             
126400                                                                              
126500   SORT A02-SORT  ON ASCENDING KEY S02-SIST-CTE                               
126600                                   S02-FEC-PROC S02-SECUENCIAL                
126700        USING   A02-PEND                                                      
126800        GIVING  A02-PEND                                                      
126900        MEMORY SIZE W77-MEMORY-SIZE  WORDS                                    
127000        DISK   SIZE W77-DISK-SIZE    WORDS.                                   
127100                                                                              
127200*   MOVE ATTRIBUTE LASTRECORD OF A03-RECH TO WKS-LASTREC.                     
127300*   CLOSE A03-RECH WITH SAVE                                                  
127400*   COMPUTE W77-TOT-MEMSIZE  =                                                
127500*           ( ((WKS-LASTREC + 10) / 16) * 27) + 1500.                         
127600*   COMPUTE W77-TOT-DISKSIZE =(WKS-LASTREC + 10) * (24 * 3.5).                
127700*                                                                             
127800*        IF W77-TOT-MEMSIZE < 400000                                          
127900*           MOVE 400000 TO W77-TOT-MEMSIZE                                    
128000*        ELSE                                                                 
128100*        IF W77-TOT-MEMSIZE > 258435000                                       
128200*           MOVE 25843500 TO W77-TOT-MEMSIZE.                                 
128202     PERFORM 70000-INICIALIZA-FORM.                                           
128204     COMPUTE W77-FRAMESIZE =                                                  
128206          (ATTRIBUTE FRAMESIZE OF  A03-RECH)                                  
128208     COMPUTE W77-MAXRECSIZE =                                                 
128210          (ATTRIBUTE MAXRECSIZE OF A03-RECH)                                  
128212     COMPUTE W77-LASTRECORD =                                                 
128214          (ATTRIBUTE LASTRECORD OF A03-RECH + 1)                              
128216     CLOSE A03-RECH WITH SAVE.                                                
128218     PERFORM  70000-CALCULA-ESPACIO.                                          
128300                                                                              
128400        MOVE W77-DISK-SIZE     TO WS-MSG-N-14.                                
128500        MOVE W77-MEMORY-SIZE   TO WS-MSG-N-12.                                
128600        STRING "DISK-SIZE =" WS-MSG-N-14                                      
128700               ", MEMORY-SIZE =" WS-MSG-N-12                                  
128800               ", PARA SORT A03-RECH "                                        
128900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
129000        PERFORM 70000050-MENSAJE.                                             
129100                                                                              
129200   SORT A03-SORT  ON ASCENDING KEY S03-SIST-CTE                               
129300                                   S03-FEC-PROC S03-SECUENCIAL                
129400        USING   A03-RECH                                                      
129500        GIVING  A03-RECH                                                      
129600        MEMORY SIZE W77-MEMORY-SIZE  WORDS                                    
129700        DISK   SIZE W77-DISK-SIZE    WORDS.                                   
129702*** IBM-CHARITY-2002 FIN                                                      
129800                                                                              
129900 50000100-GRABA-ARCHIVOS.                                                     
130000*------------------------                                                     
130100                                                                              
130200  IF B08P-FEC-APL = W88-FEC-OK AND W88-STA-PROCESADO                          
130300     MOVE B08P-SIST-CTE        TO A01-SIST-CTE                                
130400     MOVE B08P-FEC-ARRIBO      TO A01-FEC-ARRIBO                              
130500     MOVE B08P-HORA-ARRIBO     TO A01-HORA-ARRIBO                             
130600     MOVE B08P-HORA-INI-APL    TO A01-HORA-INI-APL                            
130700     MOVE B08P-HORA-FIN-APL    TO A01-HORA-FIN-APL                            
130800     MOVE B07P-TRNXSEG         TO A01-TRNXSEG                                 
130900     MOVE B08P-NUM-COPIA       TO A01-NUM-COPIA                               
131000     MOVE B08P-TOT-REG         TO A01-TOT-REG                                 
131100     MOVE B08P-REG-PROC        TO A01-REG-PROC                                
131200     MOVE B08P-REG-OK          TO A01-REG-OK                                  
131300     MOVE B08P-REG-RECH        TO A01-REG-RECH                                
131400     MOVE B08P-REG-FOR         TO A01-REG-FOR                                 
131500     MOVE B08P-USER            TO A01-USER                                    
131600     MOVE B08P-SISTEMA         TO A01-SISTEMA                                 
131700     MOVE B08P-BUZON           TO A01-BUZON                                   
131800     MOVE B08P-NODO            TO A01-NODO                                    
131900     MOVE B08P-FEC-PROC        TO A01-FEC-PROC                                
132000     MOVE B08P-SECUENCIAL      TO A01-SECUENCIAL                              
132100     MOVE B08P-PACK            TO A01-PACK                                    
132102*** IBM-CHARITY-2002 INI                                                      
132104     MOVE B08P-CONT-REINTENTOS TO A01-REINTENTOS                              
132106     MOVE B08P-ESTATUS         TO A01-ESTATUS                                 
132108                                  A02-ESTATUS                                 
132110     PERFORM 202002-VALIDA-SUBESTATUS                                         
132112     MOVE A02-LEYENDA          TO A01-LEYENDA                                 
132114*** IBM-CHARITY-2002 FIN                                                      
132200     WRITE A01-DETALLE                                                        
132300  ELSE                                                                        
132400  IF(B08P-FEC-APL = W88-FEC-OK AND W88-STA-RECHAZADO)                         
132500                               OR W88-STA-PENDIENTE                           
132600     MOVE B08P-SIST-CTE        TO A02-SIST-CTE   A03-SIST-CTE                 
132700     MOVE B08P-USER            TO A02-USER       A03-USER                     
132800     MOVE B08P-SISTEMA         TO A02-SISTEMA    A03-SISTEMA                  
132900     MOVE B08P-BUZON           TO A02-BUZON      A03-BUZON                    
133000     MOVE B08P-NODO            TO A02-NODO       A03-NODO                     
133100     MOVE B08P-FEC-PROC        TO A02-FEC-PROC   A03-FEC-PROC                 
133200     MOVE B08P-SECUENCIAL      TO A02-SECUENCIAL A03-SECUENCIAL               
133300     MOVE B08P-PACK            TO A02-PACK       A03-PACK                     
133400     MOVE B08P-ESTATUS         TO A02-ESTATUS    A03-ESTATUS                  
133500     MOVE B08P-TOT-REG         TO A02-TOT-REG    A03-TOT-REG                  
133600     MOVE B08P-REG-PROC        TO A02-REG-PROC   A03-REG-PROC                 
133700     MOVE B08P-REG-OK          TO A02-REG-OK     A03-REG-OK                   
133800     MOVE B08P-REG-RECH        TO A02-REG-RECH   A03-REG-RECH                 
133900     MOVE B08P-REG-FOR         TO A02-REG-FOR    A03-REG-FOR                  
133902*** IBM-CHARITY-2002 INI                                                      
133904     MOVE B08P-CONT-REINTENTOS TO A02-REINTENTOS A03-REINTENTOS               
133908*** IBM-CHARITY-2002 FIN                                                      
134000     PERFORM 00-BUSCA-LEYENDA                                                 
134100     MOVE A02-LEYENDA          TO A03-LEYENDA                                 
134200     IF W88-STA-PENDIENTE                                                     
134300        WRITE A02-DETALLE                                                     
134400     ELSE                                                                     
134500        WRITE A03-DETALLE.                                                    
134600                                                                              
134700 00-BUSCA-LEYENDA.                                                            
134800*-----------------                                                            
134900      SET INDICE          TO 1                                                
135000      SEARCH                  WKS-TAB-LEYOCC                                  
135100       AT END                                                                 
135102*** IBM-CHARITY-2002 INI                                                      
135200          STRING "ESTATUS INVALIDO : ", A02-ESTATUS                           
135300          DELIMITED BY SIZE INTO A02-LEYENDA                                  
135400       WHEN                                                                   
135500        WKS-ID-LEY(INDICE) = A02-ESTATUS                                      
135502*** IBM-CHARITY-2002 FIN                                                      
135600        MOVE WKS-LEYENDA(INDICE)  TO A02-LEYENDA.                             
135700                                                                              
135800 50000100-TERMINATE-REPORTES.                                                 
135900*----------------------------                                                 
136000       TERMINATE REPORTE-PROC                                                 
136100       TERMINATE REPORTE-PEND                                                 
136200       TERMINATE REPORTE-RECH                                                 
136300       CLOSE REP-PROCESADO WITH SAVE                                          
136400       CLOSE REP-PENDIENTE WITH SAVE                                          
136500       CLOSE REP-RECHAZADO WITH SAVE.                                         
136600                                                                              
136700 50000100-REPORTE-RECHAZADOS.                                                 
136800*----------------------------                                                 
136900    READ A03-RECH                                                             
137000         AT END MOVE 1 TO WKS-FIN.                                            
137100                                                                              
137200    IF WKS-FIN = 0                                                            
137300       IF A03-SIST-CTE = A03-SIST-CTEANT                                      
137400          NEXT SENTENCE                                                       
137500       ELSE                                                                   
137600       IF A03-SIST-CTEANT = 0                                                 
137700          MOVE A03-SIST-CTE     TO A03-SIST-CTEANT                            
137800       ELSE                                                                   
137900          GENERATE R03-DET-PROC-TOT                                           
138000          MOVE 0 TO   WKS-R3-TOTARCH                                          
138100          MOVE A03-SIST-CTE     TO A03-SIST-CTEANT.                           
138200                                                                              
138300    IF WKS-FIN = 0                                                            
138400       ADD 1 TO WKS-R3-TOTARCH WKS-R3-TOTALRECH                               
138500       GENERATE R03-DET-PROC.                                                 
138600                                                                              
138700    IF WKS-FIN = 1                                                            
138800       IF WKS-R3-TOTALRECH > 0                                                
138900          GENERATE R03-DET-PROC-TOT                                           
139000          GENERATE R03-DET-PROC-TOTAL                                         
139100       ELSE                                                                   
139200          GENERATE R03-DET-PROC-VACIO.                                        
139300                                                                              
139400 50000100-REPORTE-PENDIENTES.                                                 
139500*----------------------------                                                 
139600    READ A02-PEND                                                             
139700         AT END MOVE 1 TO WKS-FIN.                                            
139800                                                                              
139900    IF WKS-FIN = 0                                                            
140000       IF A02-SIST-CTE = A02-SIST-CTEANT                                      
140100          NEXT SENTENCE                                                       
140200       ELSE                                                                   
140300       IF A02-SIST-CTEANT = 0                                                 
140400          MOVE A02-SIST-CTE     TO A02-SIST-CTEANT                            
140500       ELSE                                                                   
140600          GENERATE R02-DET-PROC-TOT                                           
140700          MOVE 0 TO   WKS-R2-TOTARCH                                          
140800          MOVE A02-SIST-CTE     TO A02-SIST-CTEANT.                           
140900                                                                              
141000    IF WKS-FIN = 0                                                            
141100       ADD 1 TO WKS-R2-TOTARCH WKS-R2-TOTALPEND                               
141200       GENERATE R02-DET-PROC.                                                 
141300                                                                              
141400    IF WKS-FIN = 1                                                            
141500       IF WKS-R2-TOTALPEND > 0                                                
141600          GENERATE R02-DET-PROC-TOT                                           
141700          GENERATE R02-DET-PROC-TOTAL                                         
141800       ELSE                                                                   
141900          GENERATE R02-DET-PROC-VACIO.                                        
142000                                                                              
142100 50000100-REPORTE-PROCESADOS.                                                 
142200*----------------------------                                                 
142300                                                                              
142400     READ A01-PROC                                                            
142500          AT END MOVE 1 TO WKS-FIN.                                           
142600                                                                              
142700     IF WKS-FIN = 0                                                           
142800        IF A01-SIST-CTE = A01-SIST-CTEANT                                     
142900           NEXT SENTENCE                                                      
143000        ELSE                                                                  
143100        IF A01-SIST-CTEANT = 0                                                
143200           MOVE A01-SIST-CTE     TO A01-SIST-CTEANT                           
143300        ELSE                                                                  
143400           GENERATE R01-DET-PARCIAL1                                          
143500           GENERATE R01-DET-PARCIAL2                                          
143600           MOVE A01-SIST-CTE     TO A01-SIST-CTEANT                           
143700           MOVE ZEROS            TO WKS-R1-REGXARCH                           
143800           WKS-R1-PROCXARCH         WKS-R1-OKXARCH                            
143900           WKS-R1-RECHXARCH         WKS-R1-FORANXARCH                         
143904           WKS-R1-NOPROCESADOS                                                
144000           WKS-R1-TOTARCH.                                                    
144100                                                                              
144200     IF WKS-FIN = 0                                                           
144300        ADD  1              TO WKS-R1-ARCHPROC  WKS-R1-TOTARCH                
144400        ADD  A01-TOT-REG    TO WKS-R1-TOTREG    WKS-R1-REGXARCH               
144500        ADD  A01-REG-PROC   TO WKS-R1-TOTPROC   WKS-R1-PROCXARCH              
144600        ADD  A01-REG-OK     TO WKS-R1-TOTOK     WKS-R1-OKXARCH                
144700        ADD  A01-REG-RECH   TO WKS-R1-TOTRECH   WKS-R1-RECHXARCH              
144800        ADD  A01-REG-FOR    TO WKS-R1-TOTFORAN  WKS-R1-FORANXARCH             
144802*** IBM-CHARITY-2002 INI                                                      
144804        COMPUTE WS-REG-NPROCESADOS = A01-TOT-REG - A01-REG-PROC               
144806        ADD  WS-REG-NPROCESADOS TO  WKS-R1-TOTNOPROCE                         
144808                                    WKS-R1-NOPROCESADOS                       
144810*** IBM-CHARITY-2002 FIN                                                      
144900        MOVE A01-USER       TO WS-TIT-USER                                    
145000        MOVE A01-SISTEMA    TO WS-TIT-SIST                                    
145100        MOVE A01-BUZON      TO WS-TIT-BUZO                                    
145200        MOVE A01-NODO       TO WS-TIT-NODO                                    
145300        MOVE A01-FEC-PROC   TO WS-TIT-FPRC                                    
145400        MOVE A01-SIST-CTE   TO WS-TIT-SISCTE                                  
145500        MOVE A01-SECUENCIAL TO WS-TIT-SEC                                     
145600        MOVE A01-PACK       TO WS-TIT-PACK                                    
145700        MOVE WKS-TIT-SALIDA TO WKS-NOM-ARCHENT                                
145800        GENERATE R01-DET-PROC.                                                
145900                                                                              
146000     IF WKS-FIN = 1                                                           
146100        IF WKS-R1-ARCHPROC > 0                                                
146200           GENERATE R01-DET-PARCIAL1                                          
146300           GENERATE R01-DET-PARCIAL2                                          
146400           GENERATE R01-DET-PROC-TOTAL                                        
146500        ELSE                                                                  
146600           GENERATE R01-DET-PROC-VACIO.                                       
146700                                                                              
146800 50000100-REPORTE-DETALLE.                                                    
146900*----------------------------                                                 
147000    IF WKS-SEC-ARCCTRL = 9999                                                 
147100       MOVE 0 TO WKS-SEC-ARCCTRL.                                             
147200                                                                              
147300    MOVE 0 TO SW-IMP-DET                                                      
147400    MOVE W88-FEC-OK        TO WS-TIT-CE-FEC                                   
147500    IF B08P-FEC-APL = W88-FEC-OK AND                                          
147600       (W88-STA-RECHAZADO OR W88-STA-PROCESADO)                               
147700*       MOVE WS-TIT-CE-NODO TO WS-A04-CSI                                     
147750       MOVE  B08P-NODO     TO WS-A04-CSI                                      
147800       MOVE W88-FEC-OK     TO WS-A04-FEC                                      
147900       ADD 1               TO WKS-SEC-ARCCTRL                                 
148000       MOVE WKS-SEC-ARCCTRL TO WS-A04-SEC                                     
148100       CHANGE ATTRIBUTE TITLE OF  A04-PROCDET TO WS-TIT-A04                   
148200       IF ATTRIBUTE RESIDENT OF A04-PROCDET IS= VALUE TRUE                    
148300          MOVE 0 TO WKS-ID-OK                                                 
148400          PERFORM 50000100-BUSCAID UNTIL WKS-ID-OK = 1                        
148500                                   OR WKS-SEC-ARCCTRL = 9999                  
148600       ELSE                                                                   
148700         MOVE 1 TO SW-IMP-DET.                                                
148800                                                                              
148900    IF SW-IMP-DET = 1                                                         
149000       OPEN OUTPUT A04-PROCDET                                                
149100       MOVE 0 TO WKS-PARAM188, W77-KEY-DET                                    
149200       IF W88-STA-PROCESADO                                                   
149300          MOVE A01-USER         TO WS-TIT-USER                                
149400          MOVE A01-SISTEMA      TO WS-TIT-SIST                                
149500          MOVE A01-BUZON        TO WS-TIT-BUZO                                
149600          MOVE A01-NODO         TO WS-TIT-NODO                                
149700          MOVE A01-FEC-PROC     TO WS-TIT-FPRC                                
149800          MOVE A01-SIST-CTE     TO WS-TIT-SISCTE                              
149900          MOVE A01-SECUENCIAL   TO WS-TIT-SEC                                 
150000          MOVE A01-PACK         TO WS-TIT-PACK                                
150100          MOVE A01-TOT-REG      TO A04-DET-TOTREG                             
150200          MOVE A01-REG-PROC     TO A04-DET-TOTPROC                            
150300          MOVE A01-REG-OK       TO A04-DET-TOTOK                              
150400          MOVE A01-REG-RECH     TO A04-DET-TOTRECH                            
150500          MOVE A01-REG-FOR      TO A04-DET-TOTFORAN                           
150600       ELSE                                                                   
150700          MOVE A03-USER         TO WS-TIT-USER                                
150800          MOVE A03-SISTEMA      TO WS-TIT-SIST                                
150900          MOVE A03-BUZON        TO WS-TIT-BUZO                                
151000          MOVE A03-NODO         TO WS-TIT-NODO                                
151100          MOVE A03-FEC-PROC     TO WS-TIT-FPRC                                
151200          MOVE A03-SIST-CTE     TO WS-TIT-SISCTE                              
151300          MOVE A03-SECUENCIAL   TO WS-TIT-SEC                                 
151400          MOVE A03-PACK         TO WS-TIT-PACK                                
151500          MOVE A03-TOT-REG      TO A04-DET-TOTREG                             
151600          MOVE A03-REG-PROC     TO A04-DET-TOTPROC                            
151700          MOVE A03-REG-OK       TO A04-DET-TOTOK                              
151800          MOVE A03-REG-RECH     TO A04-DET-TOTRECH                            
151900          MOVE A03-REG-FOR      TO A04-DET-TOTFORAN.                          
152000                                                                              
152100   IF SW-IMP-DET = 1                                                          
152200       MOVE WKS-TIT-SALIDA      TO A04-DET-NOMARCH                            
152300       MOVE B07P-LISTADOS       TO A04-DET-INDI                               
152400       MOVE B07P-TIPO           TO A04-DET-TIPO                               
152500       MOVE WS-A04-AA           TO A04-DET-AA                                 
152600       MOVE WS-A04-MM           TO A04-DET-MM                                 
152700       MOVE WS-A04-DD           TO A04-DET-DD                                 
152800       MOVE WS-TIT-CE-NODO      TO A04-DET-CSI WKS-WFL-NODO                   
152802*** IBM-CHARITY-2002 INI                                                      
152804       MOVE B08P-ESTATUS         TO  A04-ESTATUS                              
152806       MOVE B08P-CONT-REINTENTOS TO  A04-CONT-REINT                           
152808       MOVE B08P-SUB-ESTATUS     TO  A04-SUBESTATUS                           
152810*** IBM-CHARITY-2002 FIN                                                      
152900       MOVE W88-FEC-OK          TO WKS-WFL-FEC                                
153000       MOVE ZEROES              TO WKS-WFL-SEC                                
153100       MOVE 999999999999        TO WKS-WFL-SISCTE                             
153200       ADD  1                   TO W77-KEY-DET                                
153300       MOVE WS-A04-SEC          TO WKS-WFL-REG                                
153400       MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO A04-DET-MIX                      
153500       WRITE REG-ARCHDET                                                      
153600       CLOSE A04-PROCDET WITH REMOVE                                          
153700       WAIT(1)                                                                
153800       OPEN I-O A04-PROCDET                                                   
153900       CLOSE A04-PROCDET WITH REMOVE                                          
154000       WAIT(1)                                                                
154100       MOVE WKS-WFL-PARAM TO WKS-WFL-P188                                     
154200       DISALLOW INTERRUPT                                                     
154300       CALL SYSTEM WFL USING WKS-RUN-P188                                     
154400       ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                   
154500       OF MYSELF                                                              
154600       ALLOW INTERRUPT.                                                       
154700                                                                              
154800 50000100-BUSCAID.                                                            
154900*=================                                                            
155000                                                                              
155100   ADD 1                TO WKS-SEC-ARCCTRL                                    
155200   MOVE WKS-SEC-ARCCTRL TO WS-A04-SEC                                         
155300   CHANGE ATTRIBUTE TITLE OF  A04-PROCDET TO WS-TIT-A04                       
155400   IF ATTRIBUTE RESIDENT OF A04-PROCDET IS= VALUE FALSE                       
155500      MOVE 1 TO SW-IMP-DET WKS-ID-OK.                                         
155600                                                                              
155700 50000500-RENOMB-ARCH-ENT.                                                    
155800*=========================                                                    
155900   MOVE LOW-VALUES              TO WS-TIT-RENOMB.                             
156000   IF W88-STA-PROCESADO OR W88-STA-RECHAZADO                                  
156100      PERFORM 50000500-ARMA-NOMARCH                                           
156140      IF WS-TIT-USER = "500" AND WS-TIT-PACK = "CAPTACION   "                 
156200        MOVE WKS-TIT-SALIDA       TO WS-TIT-RENOMB                            
156300        INSPECT WS-TIT-RENOMB  REPLACING ALL "INTS" BY "INTE"                 
156400        CHANGE ATTRIBUTE TITLE    OF A05-ENTRADA TO WS-TIT-RENOMB             
156500        IF ATTRIBUTE RESIDENT     OF A05-ENTRADA IS= VALUE TRUE               
156600          OPEN I-O A05-ENTRADA                                                
156700          STRING "APLXDISP/",    WS-TIT-ARCHIVO                               
156800          DELIMITED BY SIZE INTO WS-TIT-RENOMB                                
156900          INSPECT WS-TIT-RENOMB  REPLACING ALL "INTS" BY "INTE"               
157000          CHANGE ATTRIBUTE TITLE OF A05-ENTRADA TO WS-TIT-RENOMB              
157100          CLOSE A05-ENTRADA      WITH REMOVE.                                 
157200                                                                              
157300 50000500-RENOMB-ARCH-SAL.                                                    
157400*=========================                                                    
157500   MOVE LOW-VALUES              TO WS-TIT-RENOMB.                             
157600   IF W88-STA-PROCESADO OR W88-STA-RECHAZADO                                  
157700      PERFORM 50000500-ARMA-NOMARCH                                           
157720      MOVE "(S500)"             TO WS-TIT-USER-R                              
157790      MOVE "CAPTACION"          TO WS-TIT-PACK                                
157800      CHANGE ATTRIBUTE TITLE    OF A06-SALIDA  TO WKS-TIT-SALIDA              
157900      IF ATTRIBUTE RESIDENT     OF A06-SALIDA  IS= VALUE TRUE                 
158000         OPEN I-O A06-SALIDA                                                  
158100         STRING "APLXDISP/",    WS-TIT-ARCHIVO                                
158200         DELIMITED BY SIZE INTO WS-TIT-RENOMB                                 
158300         CHANGE ATTRIBUTE TITLE OF A06-SALIDA  TO WS-TIT-RENOMB               
158400         CLOSE A06-SALIDA       WITH REMOVE.                                  
158500                                                                              
158600 50000500-ARMA-NOMARCH.                                                       
158700*======================                                                       
158800    IF W88-STA-PROCESADO                                                      
158900       MOVE A01-USER         TO WS-TIT-USER                                   
159000       MOVE A01-SISTEMA      TO WS-TIT-SIST                                   
159100       MOVE A01-BUZON        TO WS-TIT-BUZO                                   
159200       MOVE A01-NODO         TO WS-TIT-NODO                                   
159300       MOVE A01-FEC-PROC     TO WS-TIT-FPRC                                   
159400       MOVE A01-SIST-CTE     TO WS-TIT-SISCTE                                 
159500       MOVE A01-SECUENCIAL   TO WS-TIT-SEC                                    
159600       MOVE A01-PACK         TO WS-TIT-PACK                                   
159700    ELSE                                                                      
159800    IF W88-STA-RECHAZADO                                                      
159900       MOVE A03-USER         TO WS-TIT-USER                                   
160000       MOVE A03-SISTEMA      TO WS-TIT-SIST                                   
160100       MOVE A03-BUZON        TO WS-TIT-BUZO                                   
160200       MOVE A03-NODO         TO WS-TIT-NODO                                   
160300       MOVE A03-FEC-PROC     TO WS-TIT-FPRC                                   
160400       MOVE A03-SIST-CTE     TO WS-TIT-SISCTE                                 
160500       MOVE A03-SECUENCIAL   TO WS-TIT-SEC                                    
160600       MOVE A03-PACK         TO WS-TIT-PACK.                                  
160700                                                                              
160800*=============                                                                
160900 60000000-FIN.                                                                
161000*=============                                                                
161100   IF WKS-SEC-ARCCTRL > 0                                                     
161200      MOVE WKS-SEC-ARCCTRL TO WKS-MAX-ARCH                                    
161300      MOVE 0               TO WKS-SEC-ARCCTRL WKS-P188-FIN                    
161400      PERFORM 60000000-VALIDA-ARCHIVOS                                        
161500                        UNTIL WKS-P188-FIN = 1.                               
161600                                                                              
161700 60000000-VALIDA-ARCHIVOS.                                                    
161800*=========================                                                    
161900                                                                              
162000  ADD 1                TO WKS-SEC-ARCCTRL                                     
162100  MOVE WKS-SEC-ARCCTRL TO WS-A04-SEC                                          
162200                                                                              
162300  CHANGE ATTRIBUTE TITLE OF  A04-PROCDET TO WS-TIT-A04                        
162400                                                                              
162500  IF ATTRIBUTE RESIDENT OF A04-PROCDET IS= VALUE TRUE                         
162600     ADD 1 TO WKS-P188-ACTIVOS.                                               
162700                                                                              
162800  IF WKS-SEC-ARCCTRL > WKS-MAX-ARCH                                           
162900     IF WKS-P188-ACTIVOS > 0                                                  
163000        MOVE WKS-P188-ACTIVOS TO WKS-P188-UP                                  
163100        MOVE 0  TO WKS-SEC-ARCCTRL WKS-P188-ACTIVOS                           
163200        WAIT(10)                                                              
163300        PERFORM 60000000-VAL-FINXHORARIO                                      
163400     ELSE                                                                     
163500        MOVE 1 TO WKS-P188-FIN.                                               
163600                                                                              
163700*===========================                                                  
163800 60000000-VAL-FINXHORARIO.                                                    
163900*===========================                                                  
164000                                                                              
164200   PERFORM 90000000-DAME-FEC-MAQUINA                                          
164300   MOVE WKS-FEC-MAQ-08    TO WS-A04-FEC                                       
164400   IF WS-A04-FEC = WKS-FEC-TERMINO                                            
164500      ACCEPT WKS-TIME-MAQ FROM TIME                                           
164600      IF WKS-TIME-MAQ > WKS-TIME-MAX                                          
164700         STRING "HORARIO MAX DEL P187 SUPERADO ",                             
164800                "LAS COPIAS DEL P188 SE DARAN DE BAJA"                        
165100         DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                             
165200         PERFORM 70000050-MENSAJE                                             
165300         WAIT(1)                                                              
165400         STOP RUN.                                                            
165500                                                                              
165600  COPY "S500/INC/PRO/25MTP002".                                               
165700                                                                              
165800*** IBM-CHARITY-2002 INI                                                      
165900*----------------------------                                                 
166000 70000-CALCULA-ESPACIO.                                                       
166100*----------------------------                                                 
166200  IF W77-FRAMESIZE = 8                                                        
166300       COMPUTE WS-CALC-WORD = W77-MAXRECSIZE / 6                              
166400       IF WS-WORD-RES   >   ZEROS                                             
166500           COMPUTE W77-MAXRECSIZE = WS-WORD-ENT + 1                           
166600       ELSE                                                                   
166700           COMPUTE W77-MAXRECSIZE = WS-WORD-ENT.                              
166800  COMPUTE W77-MEMORY-65K = 66000 * W77-MAXRECSIZE.                            
166900                                                                              
167000  COMPUTE W77-MEMORY-SIZE ROUNDED                                             
167100       = (W77-MAXRECSIZE + 3) * (W77-LASTRECORD / 16)                         
167200       + 1500.                                                                
167300                                                                              
167400  IF W77-MEMORY-SIZE > 258435000                                              
167500       MOVE 258435000   TO W77-MEMORY-SIZE                                    
167600  ELSE                                                                        
167700       IF W77-MEMORY-SIZE < 400000                                            
167800             MOVE W77-MEMORY-65K TO W77-MEMORY-SIZE.                          
167900                                                                              
168000  COMPUTE W77-DISK-SIZE ROUNDED                                               
168100        =  (W77-MAXRECSIZE + 3) * W77-LASTRECORD * 3.5 .                      
168200                                                                              
168300*----------------------------                                                 
168400 70000-INICIALIZA-FORM.                                                       
168500*----------------------------                                                 
168600        MOVE ZEROS   TO   W77-FRAMESIZE    W77-MAXRECSIZE                     
168700                          WS-CALC-WORD     W77-MEMORY-65K                     
168800                          W77-TOT-MEMSIZE  W77-TOT-DISKSIZE                   
168900                          W77-LASTRECORD.                                     
169000                                                                              
169100*----------------------------                                                 
169200 202002-VALIDA-SUBESTATUS.                                                    
169300*----------------------------                                                 
169400    IF A01-ESTATUS  = "T"                                                     
169500       NEXT SENTENCE                                                          
169600    ELSE                                                                      
169700       PERFORM 00-BUSCA-LEYENDA                                               
169800       EXIT PERFORM.                                                          
169900                                                                              
170000    SET INDICE-SUB      TO 1                                                  
170100    SEARCH          WKS-TAB-LEYOCC-SUB                                        
170200    AT END                                                                    
170300       MOVE "TERMINADO PARCIAL S/SUB-ESTATUS" TO A02-LEYENDA                  
170400    WHEN                                                                      
170500       WKS-ID-LEY-SUB(INDICE-SUB) = B08P-SUB-ESTATUS                          
170600       STRING "TERMINADO PARCIAL", WKS-LEYENDA-SUB(INDICE-SUB)                
170700       DELIMITED BY SIZE INTO A02-LEYENDA.                                    
170800                                                                              
170900*----------------------------                                                 
171000 202002-ACTUALIZA-B08.                                                        
171100*----------------------------                                                 
171200   PERFORM  90400000-BEGIN-TRANSAC-NOAUD.                                     
171300   PERFORM  202002-LOCKB08.                                                   
171400   MOVE ZEROS  TO    B08P-ENVIO-INTE.                                         
171500   IF WS-STATUS-BASE = 0                                                      
171600      PERFORM  90400008-B08PCTRA-STORE.                                       
171700   PERFORM  90400000-END-TRANSAC-NOAUD.                                       
171800                                                                              
171900  MOVE ZEROS TO WS-STATUS-BASE-ANT                                            
172000                WS-STATUS-BASE.                                               
172100                                                                              
172200*----------------------------                                                 
172300 202002-LOCKB08.                                                              
172400*----------------------------                                                 
172500   MOVE WS-STATUS-BASE TO WS-STATUS-BASE-ANT.                                 
172600   MOVE 0              TO WS-STATUS-BASE.                                     
172700   LOCK S500B08PCTRARRIBO                                                     
172800        ON EXCEPTION                                                          
172900           MOVE DMSTATUS(DMCATEGORY) TO WS-STATUS-BASE.                       
173000*** IBM-CHARITY-2002 FIN                                                      
