000100$SET LIST                                                                     
000110$SET LINEINFO                                                                 
000600$SET ERRORLIMIT = 1000                                                        
001600$SET BDB02R01 S000LIBLJ                                                       
002100$SET BDB91                                                                    
002110$SET S006LOCSUP                                                               
002120$SET S100VERSIONES                                                            
002130$SET FECHA2000                                                                
002600******************************************************************            
003100* SISTEMA: S500 CAPTACION.                                                    
003600* ARCHIVO: S500P420.                                                          
004100* CONCENTRADOR DE SALDOS PARA TARJETAS.(UNION DE LOS FILE/SALDOTB)            
004600* ULTIMA ACT:   FEB/2006 CUENTA MAX 2DA. ETAPA.                               
005100                                                                              
005600******************************************************************            
006100* I D E N T I F I C A T I O N     D I V I S I O N.                            
006600******************************************************************            
007100 IDENTIFICATION DIVISION.                                                     
007600 PROGRAM-ID. CONCENTRADOR-SALDOSTB.                                           
008100                                                                              
008600******************************************************************            
009100* E N V I R O N M E N T           D I V I S I O N.                            
009600******************************************************************            
010100 ENVIRONMENT DIVISION.                                                        
010600 CONFIGURATION SECTION.                                                       
011100 INPUT-OUTPUT SECTION.                                                        
011600 FILE-CONTROL.                                                                
012100                                                                              
014100     SELECT SALDOSTBM     ASSIGN TO DISK.                                     
014600     SELECT SALDOSTBV     ASSIGN TO DISK.                                     
015100     SELECT SALDOSTBTM    ASSIGN TO DISK.                                     
015600     SELECT SALDOSTBTV    ASSIGN TO DISK.                                     
016100     SELECT CINTACM       ASSIGN TO DISK.                                     
016600     SELECT CINTACH       ASSIGN TO DISK.                                     
017100                                                                              
017600     SELECT REPORTE       ASSIGN TO PRINTER.                                  
019100                                                                              
019600                                                                              
020100******************************************************************            
020600* D A T A     D I V I S I O N.                                                
021100******************************************************************            
021600 DATA DIVISION.                                                               
022100 FILE SECTION.                                                                
022600                                                                              
031100******************************************************************            
042600* ARCHIVO SALDOSTB QUE CONTIENE LA INFORMACION DE CTAMAE. MTY.                
043100******************************************************************            
043600 FD SALDOSTBM                                                                 
044100    RECORD CONTAINS 90 CHARACTERS                                             
044600    BLOCK CONTAINS 180 RECORDS                                                
045100    VALUE OF TITLE WS-ETIQ-SDOTBM.                                            
045600 01 REG-SDOTBM                PIC X(90).                                      
046100                                                                              
046600******************************************************************            
047100* ARCHIVO SALDOSTB QUE CONTIENE LA INFORMACION DE CTAMAE. VDM.                
047600******************************************************************            
048100 FD SALDOSTBV                                                                 
048600    RECORD CONTAINS 90 CHARACTERS                                             
049100    BLOCK CONTAINS 180 RECORDS                                                
049600    VALUE OF TITLE WS-ETIQ-SDOTBV.                                            
050100 01 REG-SDOTBV                PIC X(90).                                      
050600                                                                              
051100******************************************************************            
051600* ARCHIVO SALDOSTB QUE CONTIENE LA INFORMACION DE CHEQUES. MTY.               
052100******************************************************************            
052600 FD SALDOSTBTM                                                                
053100    RECORD CONTAINS 90 CHARACTERS                                             
053600    BLOCK CONTAINS 180 RECORDS                                                
054100    VALUE OF TITLE WS-ETIQ-SDOTBTM.                                           
054600 01 REG-SDOTBTM               PIC X(90).                                      
055100                                                                              
055600******************************************************************            
056100* ARCHIVO SALDOSTB QUE CONTIENE LA INFORMACION DE CHEQUES. VDM.               
056600******************************************************************            
057100 FD SALDOSTBTV                                                                
057600    RECORD CONTAINS 90 CHARACTERS                                             
058100    BLOCK CONTAINS 180 RECORDS                                                
058600    VALUE OF TITLE WS-ETIQ-SDOTBTV.                                           
059100 01 REG-SDOTBTV               PIC X(90).                                      
059600                                                                              
060100******************************************************************            
060600* FORMATO DE LA CINTA QUE SE ENVIA A TARJETAS CON LOS SALDOS DE               
061100* LOS ARCHIVOS SALDOS TB DE CUENTA MAESTRA.                                   
061600******************************************************************            
062100 FD CINTACM                                                                   
062600    RECORD CONTAINS 90 CHARACTERS                                             
063100    BLOCK CONTAINS 180 RECORDS                                                
063200    VALUE AREASIZE IS 2160                                                    
063300          AREAS    IS 15000                                                   
063600    VALUE OF TITLE WS-ETIQ-CINTACM.                                           
064100 01 REG-CINTACM               PIC X(90).                                      
064600                                                                              
065100******************************************************************            
065600* FORMATO DE LA CINTA QUE SE ENVIA A TARJETAS CON LOS SALDOS DE               
066100* LOS ARCHIVOS SALDOS TB DE CHEQUES.                                          
066600******************************************************************            
067100 FD CINTACH                                                                   
067600    RECORD CONTAINS 90 CHARACTERS                                             
068100    BLOCK CONTAINS 180 RECORDS                                                
068600    VALUE OF TITLE WS-ETIQ-CINTACH.                                           
069100 01 REG-CINTACH               PIC X(90).                                      
069600                                                                              
070100******************************************************************            
070600* REGISTRO DEL IMPORTE DE LOS ARCHIVOS LEIDOS TANTO DE CTAMAE COMO            
071100* DE CHEQUES.                                                                 
071600******************************************************************            
072100 FD REPORTE.                                                                  
072600 01 REG-IMP                   PIC X(132).                                     
073100                                                                              
073600******************************************************************            
074100*    D A T A     B A S E     S E C T I O N.                                   
074600******************************************************************            
075100 DATA-BASE SECTION.                                                           
075600 DB S500BD01CAPTACION.                                                        
076100 01 S500B02CONTROL.                                                           
076600 01 S500B91REINICIO.                                                          
077100                                                                              
077600******************************************************************            
078100* W O R K I N G   S T O R A G E   S E C T I O N                               
078600******************************************************************            
079100 WORKING-STORAGE SECTION.                                                     
079600                                                                              
080100******************************************************************            
080600* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                  
081100* ACCESO A LA BASE DE DATOS.                                                  
081600******************************************************************            
082100 COPY "S500/INC/WOR/25MTP002".                                                
082600                                                                              
083100******************************************************************            
083600* VARIABLES UTILIZADAS EN EL PROGRAMA.                                        
084100******************************************************************            
085600 77 WS-1VEZ                    PIC 9.                                         
086100 77 WS-2VEZ                    PIC 9.                                         
086600 77 WS-3VEZ                    PIC 9.                                         
087100 77 WS-4VEZ                    PIC 9.                                         
087600 77 WS-5VEZ                    PIC 9.                                         
087610 77 WS-6VEZ                    PIC 9.                                         
087620 77 WS-7VEZ                    PIC 9.                                         
087630 77 WS-8VEZ                    PIC 9.                                         
087640 77 WS-9VEZ                    PIC 9.                                         
087650 77 WS-10VEZ                   PIC 9.                                         
088110 77 WS-HOJA1                   PIC 9(03).                                     
088120 77 WS-HOJA2                   PIC 9(03).                                     
088130 77 WS-HOJA3                   PIC 9(03).                                     
088600                                                                              
089100******************************************************************            
089600* NOMBRE DEL BACKUP DE IMPRESION DEL LISTADO.                                 
090100******************************************************************            
090600 01 WS-ETIQ-TOT420.                                                           
091100    02 FILLER           PIC X(15) VALUE  "S500/LIST/P420/".                   
091600    02 WS-TOT-CI        PIC 9(02) VALUE 10.                                   
092100    02 WS-TOT-SUBNODO   PIC 9(02) VALUE 0.                                    
092600    02 FILLER           PIC X(01) VALUE "/".                                  
093100    02 WS-TOT-CIFRA     PIC X(01) VALUE "C".                                  
093600    02 FILLER           PIC X(04) VALUE "000/".                               
094100    02 WS-TOT-FECHA     PIC 9(6).                                             
094600    02 FILLER           PIC X(01) VALUE "/".                                  
095100    02 WS-TOT-MIX       PIC 9(07).                                            
095600    02 FILLER           PIC X(18) VALUE "/001SALDOSTAR.".                     
096100                                                                              
096600******************************************************************            
097100* CAMPOS QUE SERAN UTILIZADOS PARA LEER EL ARCHIVO SALDOSTB.                  
097600******************************************************************            
098100 01 WS-REGTB.                                                                 
098600   02 WS-TB-TIPO-REG             PIC X(01).                                   
099100   02 WS-REGTB-HEADER.                                                        
099600       03 WS-TBHE-SISO           PIC X(4).                                    
100100       03 WS-TBHE-SISD           PIC X(4).                                    
100600       03 WS-TBHE-FECPRO         PIC 9(08).                                   
101100       03 WS-TBHE-FECBASE        PIC 9(08).                                   
101110       03 WS-TBHE-TIPCAM         PIC 9(04)V9(04).                             
101600       03 FILLER                 PIC X(57).                                   
102100   02 WS-REGTB-DETALLE REDEFINES WS-REGTB-HEADER.                             
102600       03 WS-TBDE-NUMCTO        PIC 9(12).                                    
103100       03 WS-TBDE-NUMPRD        PIC 9(04).                                    
103600       03 WS-TBDE-NUMINS        PIC 9(04).                                    
104100       03 WS-TBDE-NUMMON        PIC 9(03).                                    
104600       03 WS-TBDE-SIGSDO        PIC X.                                        
105100       03 WS-TBDE-SDOMN         PIC 9(12)V99.                                 
105600       03 WS-TBDE-LIMCRE        PIC 9(3).                                     
106100       03 WS-TBDE-CSI           PIC 99.                                       
106600       03 WS-TBDE-SUCPRO        PIC 9(04).                                    
107100       03 WS-TBDE-AUTPENMN      PIC 9(08)V99.                                 
107600       03 WS-TBDE-STATUS        PIC 9.                                        
107610       03 WS-TBDE-SDODL         PIC 9(12)V99.                                 
107620       03 WS-TBDE-AUTPENDL      PIC 9(08)V99.                                 
108100       03 FILLER                PIC X(7).                                     
108600   02 WS-REGTB-TRAILER REDEFINES WS-REGTB-HEADER.                             
109100       03 WS-TBTR-NUMREG        PIC 9(08).                                    
109600       03 WS-TBTR-TOTSDOMN      PIC 9(16)V99.                                 
109610       03 WS-TBTR-TOTSDODL      PIC 9(16)V99.                                 
110100       03 FILLER                PIC X(45).                                    
110600                                                                              
111600****************************************************************              
112100*    ETIQUETA DEL NOMBRE CON QUE SERA LEIDO EL ARCHIVO DE CM                  
112600*    PARA TARJETAS QUE PROVIENE DE VDM.                                       
113100****************************************************************              
113600 01 WS-ETIQ-SDOTBM.                                                           
114100      02 FILLER       PIC X(30) VALUE                                         
114600                      "S500/FILE/S500/04/10/SALDOSTB/".                       
117600      02 WS-TB-FECHA1 PIC 9(6).                                               
118100      02 FILLER       PIC X VALUE ".".                                        
118600                                                                              
119100****************************************************************              
119600*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO EL ARCHIVO DE CM.                
120100*    PARA TARJETAS QUE PROVIENE DE MTY.                                       
120600****************************************************************              
121100 01 WS-ETIQ-SDOTBV.                                                           
121600      02 FILLER       PIC X(30) VALUE                                         
122100                      "S500/FILE/S500/10/10/SALDOSTB/".                       
125100      02 WS-TB-FECHA2 PIC 9(6).                                               
125600      02 FILLER       PIC X VALUE ".".                                        
126100                                                                              
126600****************************************************************              
127100*    ETIQUETA DEL NOMBRE CON QUE SERA LEIDO EL ARCHIVO DE CHEQUES             
127600*    PARA TARJETAS QUE PROVIENE DE VDM.                                       
128100****************************************************************              
128600 01 WS-ETIQ-SDOTBTM.                                                          
129100      02 FILLER       PIC X(30) VALUE                                         
129600                      "S001/FILE/S500/04/10/SALDOSTB/".                       
132600      02 WS-TB-FECHA3  PIC 9(6).                                              
133100      02 FILLER        PIC X VALUE ".".                                       
133600                                                                              
134100****************************************************************              
134600*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO EL ARCHIVO DE CHEQUES            
135100*    PARA TARJETAS QUE PROVIENE DE MTY.                                       
135600****************************************************************              
136100 01 WS-ETIQ-SDOTBTV.                                                          
136600      02 FILLER        PIC X(30) VALUE                                        
137100                       "S001/FILE/S500/10/10/SALDOSTB/".                      
140100      02 WS-TB-FECHA4   PIC 9(6).                                             
140150      02 FILLER         PIC X VALUE ".".                                      
140200****************************************************************              
140210*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO LA CINTA DE CHEQUES              
140220*    PARA TARJETAS QUE PROVIENE DE VDM Y MTY.                                 
140230****************************************************************              
140240 01 WS-ETIQ-CINTACH.                                                          
140250      02 FILLER       PIC X(29) VALUE                                         
140260                      "S001/FILE/S500/10/10/CINTACH/".                        
140270      02 WS-TB-FECHA5  PIC 9(6).                                              
140280      02 FILLER        PIC X VALUE ".".                                       
140290                                                                              
140300****************************************************************              
140310*    ETIQUETA DEL NOMBRE CON QUE SERA CREADO EL ARCHIVO DE CHEQUES            
140320*    PARA TARJETAS QUE PROVIENE DE MTY.                                       
140330****************************************************************              
140340 01 WS-ETIQ-CINTACM.                                                          
140350      02 FILLER        PIC X(29) VALUE                                        
140360                       "S500/FILE/S500/10/10/CINTACM/".                       
140370      02 WS-TB-FECHA6   PIC 9(6).                                             
140380      02 FILLER         PIC X VALUE ".".                                      
140610                                                                              
140620******************************************************************            
140630* VARIABLES UTILIZADAS PARA EL MANEJO DE FECHAS Y HORA.                       
140640******************************************************************            
141105 01 WS-FECVAL-AMD                    PIC 9(08).                               
141110 01 WS-FECVAL-AMD-R REDEFINES WS-FECVAL-AMD.                                  
141115    02 WS-FEC-VAL-AA                 PIC 9(04).                               
141120    02 WS-FEC-VAL-MM                 PIC 99.                                  
141125    02 WS-FEC-VAL-DD                 PIC 99.                                  
141130                                                                              
141135 01 WS-FECHA-DIA-DMA                 PIC 9(08).                               
141140 01 WS-FECHA-DIA-DMA-R REDEFINES WS-FECHA-DIA-DMA.                            
141145    02 WS-DIA-DD                     PIC 99.                                  
141150    02 WS-DIA-MM                     PIC 99.                                  
141155    02 WS-DIA-AA                     PIC 9(04).                               
141160                                                                              
141165 01 WS-FECHA-DIA-MDA                 PIC 9(08).                               
141170 01 WS-FECHA-DIA-MDA-R REDEFINES WS-FECHA-DIA-MDA.                            
141175    02 WS-DIA-MM1                    PIC 99.                                  
141180    02 WS-DIA-DD1                    PIC 99.                                  
141185    02 WS-DIA-AA1                    PIC 9(04).                               
141190                                                                              
141195 01 WS-FECHA-DIA-AMD                 PIC 9(08).                               
141200 01 WS-FECHA-DIA-AMD-R REDEFINES WS-FECHA-DIA-AMD.                            
141205    02 WS-DIA-AA2                    PIC 9(04).                               
141210    02 WS-DIA-MM2                    PIC 99.                                  
141215    02 WS-DIA-DD2                    PIC 99.                                  
141220                                                                              
141225 01 WS-FECHA-PRO                     PIC 9(08).                               
141230 01 WS-FECHA-PRO-R REDEFINES WS-FECHA-PRO.                                    
141235    02 WS-PRO-AA                     PIC 9(04).                               
141240    02 WS-PRO-MM                     PIC 99.                                  
141245    02 WS-PRO-DD                     PIC 99.                                  
141250                                                                              
141255 01 WS-INVEN-PRO-AMD                  PIC 9(08).                              
141260 01 WS-INVEN-PRO-AMD-R REDEFINES WS-INVEN-PRO-AMD.                            
141265    02 WS-INV-PRO-AA                  PIC 9(04).                              
141270    02 WS-INV-PRO-MM                  PIC 99.                                 
141275    02 WS-INV-PRO-DD                  PIC 99.                                 
141280                                                                              
141285 01 WS-FEC-CALCULADA-AMD             PIC 9(08).                               
141290 01 WS-FEC-CAL-AMD REDEFINES WS-FEC-CALCULADA-AMD.                            
141295    02 WS-CALCULADA-AA                PIC 9(04).                              
141300    02 WS-CALCULADA-MM                PIC 99.                                 
141305    02 WS-CALCULADA-DD                PIC 99.                                 
141310                                                                              
141315 01 WS-FECHA-PRO-DMA                 PIC 9(08).                               
141320 01 WS-FECHA-PRO-DMA-R REDEFINES WS-FECHA-PRO-DMA.                            
141325    02 WS-PRO-DD1                    PIC 99.                                  
141330    02 WS-PRO-MM1                    PIC 99.                                  
141335    02 WS-PRO-AA1                    PIC 9(04).                               
141340                                                                              
141345 01 WS-FEC-PUENTE-AMD              PIC 9(08).                                 
141350 01 WS-FEC-PUEN-AMD REDEFINES WS-FEC-PUENTE-AMD.                              
141355    02 WS-PUENTE-AA                PIC 9(04).                                 
141360    02 WS-PUENTE-MM                PIC 99.                                    
141365    02 WS-PUENTE-DD                PIC 99.                                    
141370                                                                              
141375 01 WS-HORA-HMSC-01.                                                          
141380    03 WS-HORA-HMSC-N           PIC 9(8).                                     
141385    03 WS-HORA-HMSC REDEFINES   WS-HORA-HMSC-N.                               
141390       05 WS-HORA-HMS-N         PIC 9(6).                                     
141395       05 WS-HORA-HMS REDEFINES WS-HORA-HMS-N.                                
141400          07 WS-HORA-HH-N       PIC 9(2).                                     
141405          07 WS-HORA-MM-N       PIC 9(2).                                     
141410          07 WS-HORA-SS-N       PIC 9(2).                                     
141415       05 FILLER                   PIC X(2).                                  
141420                                                                              
141425****************************************************************              
141430*          A R E A       D E       E N C A B E Z A D O S.                     
141435****************************************************************              
141440                                                                              
141441****************************************************************              
141442*              ENCABEZADO PARA EL TITULO DE CTAMAESTRA.                       
141443****************************************************************              
141444 01  WS-ENCABEZADOCM.                                                         
141445   02 FILLER       PIC X(51)  VALUE SPACES.                                   
141446   02 FILLER       PIC X(29)  VALUE                                           
141447        "C U E N T A     M A E S T R A".                                      
141448                                                                              
141449****************************************************************              
141450*              ENCABEZADO PARA EL TITULO DE CTAMAESTRA.                       
141451****************************************************************              
141452 01  WS-ENCABEZADOCH.                                                         
141453   02 FILLER       PIC X(51)  VALUE SPACES.                                   
141454   02 FILLER       PIC X(29)  VALUE                                           
141455        "        C H E Q U E S        ".                                      
141456                                                                              
141457****************************************************************              
141458*              ENCABEZADO INICIAL DE LOS REPORTES.                            
141459****************************************************************              
141460 01  WS-ENCABEZADO.                                                           
141465   02 FILLER       PIC X(51)  VALUE SPACES.                                   
141470   02 FILLER       PIC X(29)  VALUE                                           
141475        "BANCO NACIONAL DE MEXICO S.A.".                                      
141480                                                                              
141485****************************************************************              
141490*            SEGUNDO ENCABEZADO INICIAL DE LOS REPORTES.                      
141495****************************************************************              
141500 01  WS-ENCABEZADO1.                                                          
141505     05 FILLER                             PIC X(56)                          
141510        VALUE SPACES.                                                         
141515     05 FILLER                             PIC X(20)                          
141520        VALUE "DEPOSITOS A LA VISTA".                                         
141525                                                                              
141530****************************************************************              
141535*  TERCER ENCABEZADO PARA EL REPORTE DE SALDOS DEL SDOSTB                     
141540****************************************************************              
141545 01  WS-03-SDOTB.                                                             
141550     05 FILLER                        PIC X(18)                               
141555        VALUE "S500-P420-SDOTB   ".                                           
141560     05 FILLER                        PIC X(86) VALUE SPACES.                 
141595     05 FILLER                        PIC X(08)                               
141600        VALUE "  FECHA ".                                                     
141605     05 WS-SDOTB-DIA                  PIC 99.                                 
141610     05 FILLER                        PIC X VALUE "/".                        
141615     05 WS-SDOTB-MES                  PIC 9(02).                              
141620     05 FILLER                        PIC X VALUE "/".                        
141625     05 WS-SDOTB-ANO                  PIC 9(04).                              
141630                                                                              
141640****************************************************************              
141645* CUARTO  ENCABEZADO PARA EL REPORTE DE SALDOS DE SDOSTB.                     
141650****************************************************************              
141655 01  WS-04-SDOTB.                                                             
141660     05 FILLER                          PIC X(10) VALUE                       
141665        "PROCESO   ".                                                         
141670     05 WS-SDOTB-DIA1                   PIC 9(02).                            
141675     05 FILLER                          PIC X VALUE "/".                      
141680     05 WS-SDOTB-MES1                   PIC 9(02).                            
141685     05 FILLER                          PIC X VALUE "/".                      
141690     05 WS-SDOTB-ANO1                   PIC 9(04).                            
141695     05 FILLER                          PIC X(30) VALUE SPACES.               
141700     05 FILLER                          PIC X(31) VALUE                       
141705           "SALDOS DEL LOS ARCHIVOS SDOSTB.".                                 
141710     05 FILLER                          PIC X(36) VALUE SPACES.               
141715     05 FILLER                          PIC X(05) VALUE "HOJA ".              
141720     05 WS-SDOTB-HOJA                   PIC ZZ9.                              
141725                                                                              
141730****************************************************************              
141735* ENCABEZADO PARA LA HORA DE TODOS LOS REPORTES.                              
141740****************************************************************              
141745 01 WS-ENCA-HORA .                                                            
141750    05 FILLER                          PIC X(8) VALUE                         
141755        "HORA :  ".                                                           
141760    05 WS-H-HORA                       PIC Z9.                                
141765    05 FILLER                          PIC X VALUE ":".                       
141770    05 WS-H-MINUTO                     PIC 9(02).                             
141775    05 FILLER                          PIC X VALUE ":".                       
141780    05 WS-H-SEGUNDO                    PIC 9(02).                             
141785                                                                              
141790****************************************************************              
141800* DETALLE DE LOS ENCABEZADOS DE LOS LISTADOS.                                 
141810****************************************************************              
158100 01 WS-ENC-SDOTB.                                                             
158600     03 FILLER       PIC X(20) VALUE "       C.S.I.       ".                  
159600     03 FILLER       PIC X(20) VALUE "  NUM. DE CLIENTES  ".                  
160100     03 FILLER       PIC X(22) VALUE "   IMPORTE TOTAL MN.  ".                
160110     03 FILLER       PIC X(22) VALUE "   IMPORTE TOTAL DL.  ".                
160600                                                                              
160610*****************************************************************             
160620* DETALLE PARA EL LISTADO DE SALDOS DEL ARCHIVO SALDOSTB.                     
160630*****************************************************************             
160640 01 WS-DET-SDOTB.                                                             
164100    03 WS-NOMCSI           PIC X(20).                                         
168100    03 FILLER              PIC X(05) VALUE SPACES.                            
168600    03 WS-NUMCTES          PIC ZZZ,ZZZ,ZZZ.                                   
169100    03 FILLER              PIC X(05) VALUE SPACES.                            
169600    03 WS-IMPTOTMN         PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                         
169602    03 FILLER              PIC X(01) VALUE SPACES.                            
169604    03 WS-IMPTOTDL         PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.                         
169610                                                                              
169620******************************************************************            
169630* VARIABLE UTILIZADAS EN EL PROGRAMA PARA EL MANEJO DE TOTALES.               
169640******************************************************************            
214100 77  WS-TOT-SDOSMN       PIC  9(13)V99.                                       
214110 77  WS-TOT-SDOSDL       PIC  9(13)V99.                                       
214600 77  WS-TOT-CTES         PIC  9(07).                                          
215100 77  WS-TOTCTES-REG      PIC  9(06).                                          
215600 77  WS-IMPCTESMN-REG    PIC  9(12)V99.                                       
215610 77  WS-IMPCTESDL-REG    PIC  9(12)V99.                                       
218110                                                                              
263100*****************************************************************             
263110*     P R O C E D U R E     D I V I S I O N.                                  
263120*****************************************************************             
266600 PROCEDURE DIVISION.                                                          
266610********************                                                          
266620                                                                              
266630                                                                              
266640******************************************************************            
266650******************************************************************            
266660*           R U T I N A      P R I N C I P A L.                               
266670******************************************************************            
266680******************************************************************            
266690                                                                              
267100 00000000-INICIO SECTION.                                                     
267600 00000000-PRINCIPAL.                                                          
267700     MOVE 2            TO  W77-USO-LIBLJ                                      
267800     MOVE "P420"       TO  WS-0101-PASO-MSG                                   
267900     MOVE "25MTP004"   TO  WS-0101-MTP-MSG                                    
268000                           W77-S000-MY-VERSION                                
268100                           B91-IDPROG                                         
268200     MOVE "S500P420"   TO  W77-S000-MY-ID.                                    
268300                                                                              
268600     PERFORM 10000000-LIBRERIAS           THRU 10000000-EXIT.                 
268610     PERFORM 20000000-OPEN                THRU 20000000-EXIT.                 
269100     PERFORM 50000000-PROCESOS            THRU 50000000-EXIT.                 
269600     PERFORM 70000000-CIERRO              THRU 70000000-EXIT.                 
270100     STOP RUN.                                                                
270102                                                                              
270104                                                                              
270106                                                                              
270108                                                                              
270110                                                                              
270120******************************************************************            
270125******************************************************************            
270130*         R U T I N A S  D E   S E L E C C I O N   D E                        
270135*    L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S              
270140*                  P O R   E L   P R O G R A M A.                             
270145******************************************************************            
270150******************************************************************            
270155                                                                              
270160 10000000-LIBRERIAS.                                                          
270165                                                                              
270170******************************************************************            
270175* CHANGE A LA LIBRERIA DE VERSIONES.                                          
270180******************************************************************            
270185     PERFORM 10000100-VERSIONES.                                              
270190                                                                              
270255******************************************************************            
270260* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
270265******************************************************************            
270270     PERFORM 10000006-LOCSUP.                                                 
270305 10000000-EXIT.                                                               
270310    EXIT.                                                                     
270315                                                                              
270320                                                                              
270325                                                                              
270330                                                                              
270335                                                                              
270340******************************************************************            
270345******************************************************************            
270350*                             O P E N.                                        
270355*  R U T I N A S   P A R A   A P E R T U R A   D E   B A S E   Y              
270360*                            A R C H I V O S.                                 
270365******************************************************************            
270370******************************************************************            
270375                                                                              
270380 20000000-OPEN.                                                               
270393     PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT.                        
270395     PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT.                        
270400     PERFORM 20002000-FECHA-PRO    THRU 20002000-EXIT.                        
270405     PERFORM 20004000-HORA         THRU 20004000-EXIT.                        
270410     PERFORM 20005000-FECHA-DIA    THRU 20005000-EXIT.                        
270415     PERFORM 20007000-OPEN-ARC     THRU 20007000-EXIT.                        
270420     PERFORM 20008000-CLOSE-BASE   THRU 20008000-EXIT.                        
270430 20000000-EXIT.                                                               
270435     EXIT.                                                                    
270436                                                                              
270437******************************************************************            
270438* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
270439******************************************************************            
270440 20000050-CHECO-VER.                                                          
270441     PERFORM 20000100-CHECAME-VERSION.                                        
270442     IF S000-CTR-CVEERROR < 0                                                 
270445        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
270446        PERFORM 70000050-MENSAJE                                              
270447        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
270448 20000050-EXIT.                                                               
270449    EXIT.                                                                     
270450                                                                              
270453******************************************************************            
270454* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
270455******************************************************************            
270460 20001000-ABRO-BASE.                                                          
270465     OPEN INQUIRY S500BD01CAPTACION                                           
270470     ON EXCEPTION                                                             
270485        MOVE "ERROR AL ABRIR LA BASE      " TO WS-0101-TEXT-MSG               
270490        PERFORM 70000050-MENSAJE                                              
270495        CALL SYSTEM DMTERMINATE.                                              
270500                                                                              
270505    SET S500B02CONTROL        TO BEGINNING.                                   
270535 20001000-EXIT.                                                               
270540    EXIT.                                                                     
270545                                                                              
270550******************************************************************            
270555* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
270560******************************************************************            
270565 20002000-FECHA-PRO.                                                          
270570  PERFORM 90000002-B02CONTROL-FIND                                            
270575  IF WS-STATUS-BASE > 0                                                       
270580    IF WS-STATUS-BASE = 1                                                     
270595       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
270600       PERFORM 70000050-MENSAJE                                               
270605       CALL SYSTEM DMTERMINATE                                                
270610    ELSE                                                                      
270625       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
270630       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
270635       PERFORM 70000050-MENSAJE                                               
270637       CALL SYSTEM DMTERMINATE.                                               
270640                                                                              
270643     PERFORM 20002100-PROY-FEC        THRU  20002100-EXIT.                    
270655     MOVE WS-FECHA-PRO   TO WS-TOT-FECHA      WS-TB-FECHA1                    
270660                            WS-TB-FECHA2      WS-TB-FECHA3                    
270665                            WS-TB-FECHA4      WS-TB-FECHA5                    
270670                            WS-TB-FECHA6.                                     
270740     MOVE WS-PRO-DD      TO WS-SDOTB-DIA1                                     
270770     MOVE WS-PRO-MM      TO WS-SDOTB-MES1                                     
270800     MOVE WS-PRO-AA      TO WS-SDOTB-ANO1.                                    
270860 20002000-EXIT.                                                               
270865    EXIT.                                                                     
270870                                                                              
270875******************************************************************            
270935* PROYECTO LA FECHA LINEA UN DIA HACIA ATRAS PARA OBTENER LA                  
270940* FECHA DE PROCESO, PUES AL CORRER ESTE PASO LAS FECHAS YA FUERON             
270945* PROYECTADAS AL SIGUIENTE DIA.                                               
270950******************************************************************            
270955 20002100-PROY-FEC.                                                           
270965    MOVE B02-FECHA-LINEA         TO    WS-S006-FECHA1                         
270970    MOVE 1                       TO    WS-S006-FECHA2                         
270975    MOVE 12                      TO    WS-S006-FORMATO                        
270980    MOVE 15                      TO    WS-S006-FUNCION                        
270985    PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT.                         
270990    MOVE WS-S006-FECHA1          TO    WS-FECHA-PRO.                          
271005 20002100-EXIT.                                                               
271010    EXIT.                                                                     
271015                                                                              
271255******************************************************************            
271260* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
271265******************************************************************            
271270 20004000-HORA.                                                               
271275        ACCEPT  WS-HORA-HMSC-N    FROM TIME.                                  
271280        MOVE WS-HORA-HH-N     TO  WS-H-HORA                                   
271290        MOVE WS-HORA-MM-N     TO  WS-H-MINUTO                                 
271300        MOVE WS-HORA-SS-N     TO  WS-H-SEGUNDO.                               
271310 20004000-EXIT.                                                               
271315    EXIT.                                                                     
271320                                                                              
271325******************************************************************            
271330* OBTENGO LA FECHA DEL LA MAQUINA PARA LA GENERACION DE REPORTES.             
271335******************************************************************            
271340 20005000-FECHA-DIA.                                                          
271345        PERFORM 90000000-DAME-FEC-MAQUINA.                                    
271365                                                                              
271380        MOVE WKS-DD-MAQ           TO    WS-SDOTB-DIA                          
271400        MOVE WKS-MM-MAQ           TO    WS-SDOTB-MES                          
271420        MOVE WKS-AAAA-MAQ         TO    WS-SDOTB-ANO.                         
271440 20005000-EXIT.                                                               
271445    EXIT.                                                                     
271450                                                                              
271455******************************************************************            
271460* ABRO LOS ARCHIVOS DE DATOS SALDOSTB TANTO DE MONTERREY COMO DE              
271465* VALLE ASI COMO LOS ARCHIVOS DE IMPRESION.                                   
271490******************************************************************            
271495 20007000-OPEN-ARC.                                                           
271510   OPEN OUTPUT CINTACM                                                        
271515   OPEN OUTPUT CINTACH.                                                       
271520                                                                              
271530   OPEN INPUT  SALDOSTBM.                                                     
271535   OPEN INPUT  SALDOSTBV.                                                     
271540   OPEN INPUT  SALDOSTBTM.                                                    
271545   OPEN INPUT  SALDOSTBTV.                                                    
271550                                                                              
271555   MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WS-TOT-MIX.                         
271560   SET REPORTE(USERBACKUPNAME) TO VALUE TRUE                                  
271565   CHANGE ATTRIBUTE TITLE OF REPORTE TO WS-ETIQ-TOT420                        
271570   OPEN OUTPUT REPORTE.                                                       
271590 20007000-EXIT.                                                               
271595    EXIT.                                                                     
271600                                                                              
271605******************************************************************            
271610* UNA VEZ QUE OBTUVE LA FECHA DE LA BASE CIERRO ESTA PARA PODER               
271612* LIBERAR LA BASE YA QYE YA NO SERA UTILIZADA EN EL PROGRAMA.                 
271615******************************************************************            
271620 20008000-CLOSE-BASE.                                                         
271625       CLOSE  S500BD01CAPTACION ON EXCEPTION                                  
271640       MOVE "ERROR AL CERRAR LA BASE"    TO WS-0101-TEXT-MSG                  
271645       PERFORM 70000050-MENSAJE                                               
271650       CALL SYSTEM DMTERMINATE.                                               
271655 20008000-EXIT.                                                               
271660     EXIT.                                                                    
271665                                                                              
271840                                                                              
271845                                                                              
271850                                                                              
271855                                                                              
271860                                                                              
271865                                                                              
271870                                                                              
271875******************************************************************            
271880******************************************************************            
271885*                                                                             
271890* R U T I N A S    D E   L L A M A D O S   A   L I B R E R I A S.             
271895*                                                                             
271900******************************************************************            
271905******************************************************************            
271910                                                                              
271920******************************************************************            
271930* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
271940* DE PROCESO RESTANDOLE UN DIA A LA FECHA QUE YA HABIA SIDO PROY.             
271950******************************************************************            
271960 40000000-CALL-FECPRO.                                                        
271970     PERFORM 20000006-LOCSUP.                                                 
271980     IF WS-S006-FUNCION > 0                                                   
271990        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
272020        STRING "ERROR AL ACCESAR LOCSUP; RSLT: ", WS-MSG-RS                   
272030        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
272040        PERFORM 70000050-MENSAJE                                              
272050        CALL SYSTEM DMTERMINATE.                                              
272060 40000000-EXIT.                                                               
272070     EXIT.                                                                    
272080                                                                              
272090                                                                              
272100                                                                              
272110                                                                              
272120                                                                              
272130******************************************************************            
272140******************************************************************            
272150*                                                                             
272160*                        P R O C E S O S.                                     
272170*          E J E C U C I O N   D E   L A S   R U T I N A S                    
272180*           P R I N C I P A L E S   D E L   P R O C E S O.                    
272190*                                                                             
272200******************************************************************            
272210******************************************************************            
272220 50000000-PROCESOS.                                                           
272230   PERFORM 50001000-REPORTE THRU 50001000-EXIT                                
272240   PERFORM 50002000-LEOCMM  THRU 50002000-EXIT UNTIL WS-1VEZ = 1              
272250   PERFORM 50003000-LEOCMV  THRU 50003000-EXIT UNTIL WS-2VEZ = 1              
272260   PERFORM 50004000-LEOCHM  THRU 50004000-EXIT UNTIL WS-3VEZ = 1              
272270   PERFORM 50005000-LEOCHV  THRU 50005000-EXIT UNTIL WS-4VEZ = 1.             
272280 50000000-EXIT.                                                               
272290    EXIT.                                                                     
272300                                                                              
398000******************************************************************            
398010* IMPRIMO LOS ENCABEZADOS DEL REPORTE DE CIFRAS DE LOS ARCHIVOS               
398015* DE SALDOS SALDOSTB.                                                         
398020******************************************************************            
398030 50001000-REPORTE.                                                            
398040     MOVE  SPACES                 TO    REG-IMP.                              
398050     WRITE REG-IMP                AFTER CHANNEL 1.                            
398060     WRITE REG-IMP                FROM  WS-ENCABEZADO   BEFORE 3.             
398070     WRITE REG-IMP                FROM  WS-ENCABEZADO1  BEFORE 3.             
398080     WRITE REG-IMP                FROM  WS-03-SDOTB     BEFORE 2.             
398090     ADD 1                        TO    WS-HOJA1                              
398100     MOVE  WS-HOJA1               TO    WS-SDOTB-HOJA                         
398110     WRITE REG-IMP                FROM  WS-04-SDOTB     BEFORE 2.             
398120     WRITE REG-IMP                FROM  WS-ENCA-HORA    BEFORE 2.             
398125     WRITE REG-IMP                FROM  WS-ENCABEZADOCM BEFORE 2.             
398130     WRITE REG-IMP                FROM  WS-ENC-SDOTB    BEFORE 2.             
398132 50001000-EXIT.                                                               
398134    EXIT.                                                                     
398140                                                                              
398150******************************************************************            
398160* LEO EL ARCHIVO DE CM DE MONTERREY.                                          
398170******************************************************************            
398180 50002000-LEOCMM.                                                             
398190     READ SALDOSTBM INTO WS-REGTB AT END                                      
398200          MOVE 1 TO WS-1VEZ.                                                  
398210                                                                              
398220     IF WS-1VEZ = 0                                                           
398230        PERFORM 50008000-CHECO-REGCM  THRU 50008000-EXIT.                     
398240 50002000-EXIT.                                                               
398250    EXIT.                                                                     
398260                                                                              
398280******************************************************************            
398290* LEO EL ARCHIVO DE CM DE VALLE DE MEXICO.                                    
398300******************************************************************            
398310 50003000-LEOCMV.                                                             
398320     READ SALDOSTBV  INTO WS-REGTB AT END                                     
398330          MOVE 1 TO WS-2VEZ.                                                  
398340                                                                              
398350     IF WS-2VEZ = 0                                                           
398360        PERFORM 50008000-CHECO-REGCM  THRU 50008000-EXIT.                     
398370 50003000-EXIT.                                                               
398380    EXIT.                                                                     
398390                                                                              
398400******************************************************************            
398410* LEO EL ARCHIVO DE CM DE MONTERREY.                                          
398420******************************************************************            
398430 50004000-LEOCHM.                                                             
398440     READ SALDOSTBTM INTO WS-REGTB AT END                                     
398450          MOVE 1 TO WS-3VEZ.                                                  
398460                                                                              
398470     IF WS-3VEZ = 0                                                           
398480        PERFORM 50009000-CHECO-REGCH  THRU 50009000-EXIT.                     
398490 50004000-EXIT.                                                               
398500    EXIT.                                                                     
398510                                                                              
398520******************************************************************            
398530* LEO EL ARCHIVO DE CM DE VALLE DE MEXICO.                                    
398540******************************************************************            
398550 50005000-LEOCHV.                                                             
398560     READ SALDOSTBTV INTO WS-REGTB AT END                                     
398570          MOVE 1 TO WS-4VEZ.                                                  
398580                                                                              
398590     IF WS-4VEZ = 0                                                           
398600        PERFORM 50009000-CHECO-REGCH  THRU 50009000-EXIT.                     
398610 50005000-EXIT.                                                               
398620    EXIT.                                                                     
398630                                                                              
398640*****************************************************************             
398650* VERIFICO EL DETALLE DE LOS ARCHIVOS DE CUENTA MAESTRA.                      
398660*****************************************************************             
398670 50008000-CHECO-REGCM.                                                        
398680     IF WS-TB-TIPO-REG = 0                                                    
398690        PERFORM 50008010-HEADER-CINTACM  THRU 50008010-EXIT.                  
398700                                                                              
398710     IF WS-TB-TIPO-REG = 1                                                    
398720        PERFORM 50008020-GRABO-DETALLE   THRU 50008020-EXIT.                  
398730                                                                              
398740     IF WS-TB-TIPO-REG = 9                                                    
398750        PERFORM 50008030-TRAILER         THRU 50008030-EXIT.                  
398810 50008000-EXIT.                                                               
398820     EXIT.                                                                    
398830                                                                              
398840*****************************************************************             
398850* GRABO EL HEADER EN LA CINTA.                                                
398860*****************************************************************             
398870 50008010-HEADER-CINTACM.                                                     
398890   IF WS-TBHE-FECBASE = WS-FECHA-PRO                                          
398892      NEXT SENTENCE                                                           
398920   ELSE                                                                       
398950      STRING "FECEXT Y FECINT ARCH SDOTB CM DIFIEREN;"                        
398952             "EXT: "  WS-FECHA-PRO " INT: " WS-TBHE-FECBASE                   
398954             DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                         
398960      PERFORM 70000050-MENSAJE                                                
398965      CALL SYSTEM DMTERMINATE.                                                
398970                                                                              
398972   IF WS-6VEZ = 0                                                             
398974        WRITE REG-CINTACM FROM WS-REGTB                                       
398976        MOVE 1 TO WS-6VEZ.                                                    
398980 50008010-EXIT.                                                               
398990   EXIT.                                                                      
399000                                                                              
399010******************************************************************            
399020* GRABA EL DETALLE DE LOS ARCHIVOS  DE MTY A LA CINTA.                        
399030******************************************************************            
399040 50008020-GRABO-DETALLE.                                                      
399050     WRITE REG-CINTACM      FROM WS-REGTB                                     
399060     ADD 1                  TO   WS-TOTCTES-REG                               
399062     IF WS-TBDE-NUMMON = 1                                                    
399070        ADD WS-TBDE-SDOMN   TO   WS-IMPCTESMN-REG                             
399075     ELSE                                                                     
399077        ADD WS-TBDE-SDODL   TO   WS-IMPCTESDL-REG.                            
399080 50008020-EXIT.                                                               
399090    EXIT.                                                                     
399100                                                                              
399110******************************************************************            
399120* VERIFICA EL TRAILER DE LOS ARCHIVO SADOSTB DE MONTERREY.                    
399130******************************************************************            
399140 50008030-TRAILER.                                                            
399160     IF (WS-TBTR-TOTSDOMN = WS-IMPCTESMN-REG)  AND                            
399165        (WS-TBTR-TOTSDODL = WS-IMPCTESDL-REG)  AND                            
399170        (WS-TBTR-NUMREG = WS-TOTCTES-REG)                                     
399180         NEXT SENTENCE                                                        
399190     ELSE                                                                     
399195         NEXT SENTENCE.                                                       
399200*       MOVE 010201                           TO WS-0101-CODI-MSG             
399210*       MOVE 02                               TO WS-0101-TIPO-MSG             
399220*       MOVE "TRA.DIF. A SUMA DE REG. DE CM." TO WS-0101-TEXT-MSG             
399230*       PERFORM 70000050-MENSAJE                                              
399240*       CALL SYSTEM DMTERMINATE.                                              
399242                                                                              
399244     IF WS-7VEZ = 0                                                           
399246        MOVE "M O N T E R R E Y   " TO   WS-NOMCSI                            
399248        MOVE WS-TOTCTES-REG         TO   WS-NUMCTES                           
399250        MOVE WS-IMPCTESMN-REG       TO   WS-IMPTOTMN                          
399251        MOVE WS-IMPCTESDL-REG       TO   WS-IMPTOTDL                          
399252        WRITE REG-IMP               FROM WS-DET-SDOTB BEFORE 2                
399280        ADD WS-IMPCTESMN-REG        TO WS-TOT-SDOSMN                          
399285        ADD WS-IMPCTESDL-REG        TO WS-TOT-SDOSDL                          
399290        ADD WS-TOTCTES-REG          TO WS-TOT-CTES                            
399300        MOVE 0                      TO WS-IMPCTESMN-REG                       
399305        MOVE 0                      TO WS-IMPCTESDL-REG                       
399310        MOVE 0                      TO WS-TOTCTES-REG                         
399315        MOVE 1                      TO WS-7VEZ                                
399320     ELSE                                                                     
399330        MOVE "V A L L E  D/ M E X." TO   WS-NOMCSI                            
399340        MOVE WS-TOTCTES-REG         TO   WS-NUMCTES                           
399350        MOVE WS-IMPCTESMN-REG       TO   WS-IMPTOTMN                          
399352        MOVE WS-IMPCTESDL-REG       TO   WS-IMPTOTDL                          
399360        WRITE REG-IMP               FROM WS-DET-SDOTB BEFORE 2                
399370        ADD WS-IMPCTESMN-REG        TO WS-TOT-SDOSMN                          
399372        ADD WS-IMPCTESDL-REG        TO WS-TOT-SDOSDL                          
399380        ADD WS-TOTCTES-REG          TO WS-TOT-CTES                            
399382        MOVE 9                      TO WS-TB-TIPO-REG                         
597600        MOVE WS-TOT-SDOSMN          TO WS-TBTR-TOTSDOMN                       
597605        MOVE WS-TOT-SDOSDL          TO WS-TBTR-TOTSDODL                       
597610        MOVE WS-TOT-CTES            TO WS-TBTR-NUMREG                         
597620        WRITE REG-CINTACM           FROM WS-REGTB                             
597622        MOVE 0                      TO WS-IMPCTESMN-REG                       
597623        MOVE 0                      TO WS-IMPCTESDL-REG                       
597624        MOVE 0                      TO WS-TOTCTES-REG                         
597626        MOVE 0                      TO WS-TOT-SDOSMN                          
597627        MOVE 0                      TO WS-TOT-SDOSDL                          
597628        MOVE 0                      TO WS-TOT-CTES.                           
597630 50008030-EXIT.                                                               
597640    EXIT.                                                                     
597650                                                                              
597660*****************************************************************             
597670* VERIFICO EL DETALLE DE LOS ARCHIVOS DE CHEQUES.                             
597680*****************************************************************             
597690 50009000-CHECO-REGCH.                                                        
597700     IF WS-TB-TIPO-REG = 0                                                    
597710        PERFORM 50009010-HEADER-CINTACH  THRU 50009010-EXIT.                  
597720                                                                              
597730     IF WS-TB-TIPO-REG = 1                                                    
597740        PERFORM 50009020-GRABO-DETALLE   THRU 50009020-EXIT.                  
597750                                                                              
597760     IF WS-TB-TIPO-REG = 9                                                    
597770        PERFORM 50009030-TRAILER         THRU 50009030-EXIT.                  
597780 50009000-EXIT.                                                               
597790     EXIT.                                                                    
597800                                                                              
597810*****************************************************************             
597820* GRABO EL HEADER EN LA CINTA DE CHEQUES.                                     
597830*****************************************************************             
597840 50009010-HEADER-CINTACH.                                                     
597850   IF WS-TBHE-FECBASE = WS-FECHA-PRO                                          
597860      NEXT SENTENCE                                                           
597870   ELSE                                                                       
597880      STRING "FECEXT Y FECINT ARCH SDOTB CH DIFIEREN;"                        
597890             "EXT: "  WS-FECHA-PRO " INT: " WS-TBHE-FECBASE                   
597900             DELIMITED BY SIZE INTO  WS-0101-TEXT-MSG                         
597910      PERFORM 70000050-MENSAJE                                                
597920      CALL SYSTEM DMTERMINATE.                                                
597930                                                                              
597940   IF WS-8VEZ = 0                                                             
597950        WRITE REG-CINTACH FROM WS-REGTB                                       
597960        MOVE 1 TO WS-8VEZ.                                                    
597970 50009010-EXIT.                                                               
597980   EXIT.                                                                      
597990                                                                              
598000******************************************************************            
598010* GRABA EL DETALLE DE LOS ARCHIVOS  DE MTY A LA CINTA DE CHEQUES.             
598020******************************************************************            
598030 50009020-GRABO-DETALLE.                                                      
598040     WRITE REG-CINTACH    FROM WS-REGTB                                       
598050     ADD 1                TO   WS-TOTCTES-REG                                 
598052     IF WS-TBDE-NUMMON = 1                                                    
598060        ADD WS-TBDE-SDOMN TO   WS-IMPCTESMN-REG                               
598062     ELSE                                                                     
598064        ADD WS-TBDE-SDODL TO   WS-IMPCTESDL-REG.                              
598070 50009020-EXIT.                                                               
598080    EXIT.                                                                     
598090                                                                              
598100******************************************************************            
598110* VERIFICA EL TRAILER DE LOS ARCHIVO SADOSTB DE MONTERREY.                    
598120******************************************************************            
598130 50009030-TRAILER.                                                            
598140     IF (WS-TBTR-TOTSDOMN = WS-IMPCTESMN-REG)  AND                            
598142        (WS-TBTR-TOTSDODL = WS-IMPCTESDL-REG)  AND                            
598150        (WS-TBTR-NUMREG = WS-TOTCTES-REG)                                     
598160         NEXT SENTENCE                                                        
598170     ELSE                                                                     
598175         NEXT SENTENCE.                                                       
598180*       MOVE 010201                           TO WS-0101-CODI-MSG             
598190*       MOVE 02                               TO WS-0101-TIPO-MSG             
598200*       MOVE "TRA.DIF. A SUMA DE REG. DE CH." TO WS-0101-TEXT-MSG             
598210*       PERFORM 70000050-MENSAJE                                              
598220*       CALL SYSTEM DMTERMINATE.                                              
598230                                                                              
598240     IF WS-9VEZ = 0                                                           
598250        MOVE "M O N T E R R E Y   " TO   WS-NOMCSI                            
598260        MOVE WS-TOTCTES-REG         TO   WS-NUMCTES                           
598270        MOVE WS-IMPCTESMN-REG       TO   WS-IMPTOTMN                          
598272        MOVE WS-IMPCTESDL-REG       TO   WS-IMPTOTDL                          
598275        WRITE REG-IMP               FROM WS-ENCABEZADOCH BEFORE 2             
598277        WRITE REG-IMP               FROM WS-ENC-SDOTB BEFORE 2                
598280        WRITE REG-IMP               FROM WS-DET-SDOTB BEFORE 2                
598290        ADD WS-IMPCTESMN-REG        TO WS-TOT-SDOSMN                          
598292        ADD WS-IMPCTESDL-REG        TO WS-TOT-SDOSDL                          
598300        ADD WS-TOTCTES-REG          TO WS-TOT-CTES                            
598310        MOVE 0                      TO WS-IMPCTESMN-REG                       
598312        MOVE 0                      TO WS-IMPCTESDL-REG                       
598320        MOVE 0                      TO WS-TOTCTES-REG                         
598330        MOVE 1                      TO WS-9VEZ                                
598340     ELSE                                                                     
598350        MOVE "V A L L E  D/ M E X." TO   WS-NOMCSI                            
598360        MOVE WS-TOTCTES-REG         TO   WS-NUMCTES                           
598370        MOVE WS-IMPCTESMN-REG       TO   WS-IMPTOTMN                          
598372        MOVE WS-IMPCTESDL-REG       TO   WS-IMPTOTDL                          
598380        WRITE REG-IMP               FROM WS-DET-SDOTB BEFORE 2                
598390        ADD WS-IMPCTESMN-REG        TO WS-TOT-SDOSMN                          
598392        ADD WS-IMPCTESDL-REG        TO WS-TOT-SDOSDL                          
598400        ADD WS-TOTCTES-REG          TO WS-TOT-CTES                            
598402        MOVE 9                      TO WS-TB-TIPO-REG                         
598410        MOVE WS-TOT-CTES            TO WS-TBTR-NUMREG                         
598420        MOVE WS-TOT-SDOSMN          TO WS-TBTR-TOTSDOMN                       
598422        MOVE WS-TOT-SDOSDL          TO WS-TBTR-TOTSDODL                       
598430        WRITE REG-CINTACH           FROM WS-REGTB                             
598440        MOVE 0                      TO WS-IMPCTESMN-REG                       
598442        MOVE 0                      TO WS-IMPCTESDL-REG                       
598450        MOVE 0                      TO WS-TOTCTES-REG                         
598460        MOVE 0                      TO WS-TOT-SDOSMN                          
598462        MOVE 0                      TO WS-TOT-SDOSDL                          
598470        MOVE 0                      TO WS-TOT-CTES.                           
598480 50009030-EXIT.                                                               
598490    EXIT.                                                                     
598500                                                                              
598510******************************************************************            
598520* CIERRO LOS ARCHIVOS SALDOSTB Y EL DE IMPRESION.                             
598530******************************************************************            
598540 70000000-CIERRO.                                                             
598550     CLOSE  SALDOSTBM             WITH SAVE.                                  
598552     CLOSE  SALDOSTBTM            WITH SAVE.                                  
598560     CLOSE  SALDOSTBV             WITH SAVE.                                  
598562     CLOSE  SALDOSTBTV            WITH SAVE.                                  
598570     CLOSE  REPORTE               WITH SAVE                                   
598580     CLOSE  CINTACM               WITH SAVE.                                  
598590     CLOSE  CINTACH               WITH SAVE.                                  
598830 70000000-EXIT.                                                               
598840     EXIT.                                                                    
598850                                                                              
598860                                                                              
598870                                                                              
598880                                                                              
598890                                                                              
635700******************************************************************            
635800*    R U T I N A S   D E   D E S P L I E G U E   D E   M S G.                 
635900*        P A R A   L A   P R I M E R A   S E C T I O N.                       
636000******************************************************************            
636100                                                                              
636200                                                                              
636300                                                                              
636400                                                                              
636500                                                                              
636600                                                                              
636700******************************************************************            
636800* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
636900******************************************************************            
637000 COPY "S500/INC/PRO/25MTP002".                                                
