100100***********************************************************                   
100200* SISTEMA: S500 CAPTACION                                 *                   
100300* PASO   : S500P181                                       *                   
100400                                                                              
102300$SET LIST                                                                     
102400$SET LINEINFO                                                                 
102500$SET ERRORLIMIT = 1000                                                        
102650$SET BDB00R01 BDB00R02 BDB00R21                                               
102700$SET BDB02R01 BDB02R02 BDB02R03                                               
102800$SET BDB03R01 BDB03R02 BDB03R04 BDB03R08 BDB03R09 BDB03R15                    
102900$SET BDB05R01 BDB05R02                                                        
103000$SET BDB44R08                                                                 
103300**$SET TADS (FREQUENCY)                                                       
103600                                                                              
103700                                                                              
103800$SET S006LOCSUP                                                               
103900$SET S000LIBLJ                                                                
103950$SET MAPLIACTLIB                                                              
103960$SET LIBMAPLI                                                                 
104000$SET LIBMAPLIDISP                                                             
104600$SET S100VERSIONES                                                            
104800$SET FECHA2000                                                                
105100***********************************************************                   
105200*       I D E N T I F I C A T I O N      D I V I S I O N.                     
105300***********************************************************                   
105400 IDENTIFICATION DIVISION.                                                     
105500 PROGRAM-ID.    P108.                                                         
105600 AUTHOR.        .                                                             
105700 DATE-WRITTEN.  AGOSTO/2021.                                                  
105800                                                                              
105900***********************************************************                   
106000*       E N V I R O N M E N T           D I V I S I O N.                      
106100***********************************************************                   
106200 ENVIRONMENT DIVISION.                                                        
106300 CONFIGURATION SECTION.                                                       
106400 INPUT-OUTPUT SECTION.                                                        
106500 FILE-CONTROL.                                                                
106600                                                                              
108700***********************************************************                   
108710* ARCHIVOS PARA EL ENVIO DE SALDOS A GBNP                                     
108720***********************************************************                   
108730     SELECT ARC-GBNP          ASSIGN TO DISK.                                 
108740     SELECT R01-MENSAJES      ASSIGN TO PRINTER.                              
127500                                                                              
127600***********************************************************                   
127602* ARCHIVOS PARA EL ENVIO DE SALDOS A GBNP                                     
127604***********************************************************                   
127606DATA DIVISION.                                                                
127608FILE SECTION.                                                                 
127610FD ARC-GBNP                                                                   
127612     RECORD CONTAINS 98 CHARACTERS                                            
127614     BLOCK  CONTAINS 120 RECORDS                                              
127616     VALUE OF                                                                 
127618           AREAS    8820                                                      
127620           AREASIZE 90                                                        
127622           SECURITYTYPE IS PUBLIC                                             
127624           TITLE IS WKS-ETIQ-GBNP.                                            
127626                                                                              
127628 01 REG-GBNP             PIC X(98).                                           
127630 FD R01-MENSAJES.                                                             
127648 01 R01-L00-MENSAJE      PIC X(132).                                          
127650                                                                              
127670                                                                              
127700                                                                              
127800***********************************************************                   
127900*           D A T A       B A S E      S E C T I O N.                         
128000***********************************************************                   
128100 DATA-BASE SECTION.                                                           
128200 DB S500BD01CAPTACION.                                                        
128250 01 S500B00CTRLPASO.                                                          
128300 01 S500B02CONTROL.                                                           
128400 01 S500B03CONTRATOS.                                                         
128500 01 S500B05INSTRUMEN.                                                         
128600 01 S500B44CTOSEVOL.                                                          
128800 01 S500B91REINICIO.                                                          
129000***********************************************************                   
129100*           W O R K I N G           S T O R A G E.                            
129200***********************************************************                   
129300 WORKING-STORAGE SECTION.                                                     
129400 77  WS-CNODO               PIC 9(04)        COMP.                            
129500 77  WS-MY-CSI              PIC 9(04)        COMP.                            
129600 77  WS-DIAS-ANO            PIC 9(06)        COMP.                            
129700 77  WS-B06-FECREAL-CORTE   PIC 9(08).                                        
129800 77  WS-B06-SDOPROM-FINAN   PIC 9(14)V99.                                     
129900 77  WS-SDO-PROMANUAL       PIC S9(14)V99.                                    
130000 77  WS-SORT-ESPACIO        PIC 9(10)      COMP.                              
130100 77  W77-TOT-REGINVE        PIC 9(08)      COMP.                              
130200 77  W77-MEMSIZE            PIC 9(08)      COMP.                              
130300 77  WS-VAL-FEC             PIC 9(08).                                        
130400 77  WS-EOF-B03             PIC 9          COMP.                              
130500 77  WS-NO-B06              PIC 9          COMP.                              
130600 77  WS-EOF-INVE            PIC 9          COMP.                              
130700 77  WS-EOF-B05             PIC 9          COMP.                              
130800 77  WS-IND-CH              PIC 99         COMP.                              
130900 77  WS-IND-CM              PIC 99         COMP.                              
131000 77  WS-ES-SEMANAL          PIC 9          COMP.                              
131100 77  WS-ES-MENSUAL          PIC 9          COMP.                              
131200 77  WS-DIASEM-HOY          PIC 9          COMP.                              
131300 77  WS-DIASEM-PROX         PIC 9          COMP.                              
131400 77  WS-IND-B05             PIC 9(02)      COMP.                              
131500 77  WS-IND-TB05            PIC 9(02)      COMP.                              
131550 77  WS-TB05-FIN            PIC 9.                                            
131600 77  WS-IND-TCH             PIC 9(02)      COMP.                              
131700 77  WS-IND-TCM             PIC 9(02)      COMP.                              
131800 77  WS-NUMREG-CHE          PIC 9(10)      COMP.                              
131900 77  W77-NUMREG-CHQ-AD      PIC 9(10)      COMP.                              
132000 77  WS-NUMREG-CMA          PIC 9(10)      COMP.                              
132100 77  W77-NUMREG-CMA-AD      PIC 9(10)      COMP.                              
132200 77  W77-FECHA-EDIT         PIC 9999/99/99.                                   
133400 77  W77-FECHA-EDIT2        PIC 9999/99/99.                                   
133450 77  W77-R01-NLIN           PIC 9(02)      COMP   VALUE 70.                   
133460 77  W77-R01-NPAG           PIC 9(06)      COMP   VALUE 0.                    
133500***********************************************************                   
133600                                                                              
133700***********************************************************                   
133800* TABLA PARA CARGAR LOS INSTRUMENTOS.                                         
133900***********************************************************                   
134000 01 WS-CARGA-INSTR.                                                           
134100  02 WS-INSTR-PRD OCCURS 30 TIMES.                                            
134200    04 WS-TB05-PRD      PIC 9(04)   COMP.                                     
134300    04 WS-TB05-INS      PIC 9(04)   COMP.                                     
134350    04 WS-TB05-MON      PIC 9(03)   COMP.                                     
134400    04 WS-TB05-DIAC     PIC 9(02)   COMP.                                     
134500    04 WS-TB05-RENDIA   PIC 9(01)   COMP.                                     
134550    04 WS-TB05-PAGOREN  PIC 9(01)   COMP.                                     
134600                                                                              
134700                                                                              
137200                                                                              
137300***********************************************************                   
149600* ETIQUETA DEL NOMBRE DEL ARCHIVO DE SALDOS GBNP                              
149650**********************************************************                    
149700 01 WKS-ETIQ-GBNP.                                                            
149750    02 FILLER                    PIC X(15) VALUE                              
149800       "S500/FILE/INTS/".                                                     
149850    02 WKS-E-GBNP-BUZON          PIC X(09) VALUE                              
149900       "50025S01/".                                                           
149950    02 WKS-E-GBNP-CSI            PIC 9(02).                                   
150000    02 FILLER                    PIC X(01) VALUE                              
150050       "/".                                                                   
150100    02 WKS-E-GBNP-FEC            PIC 9(08).                                   
150150    02 FILLER                    PIC X(10) VALUE                              
150200       "/GBNPSDOS/".                                                          
150250    02 WKS-E-GBNP-SEC            PIC 9(04).                                   
150300    02 FILLER                    PIC X VALUE                                  
150350       ".".                                                                   
150400                                                                              
150450***********************************************************                   
150500* ETIQUETA DEL NOMBRE DEL LISTADO DE MENSAJES                                 
150550**********************************************************                    
150600 01 WKS-TITULO-R01.                                                           
150650    02 FILLER                    PIC X(15) VALUE                              
150700       "S500/LIST/P109/".                                                     
150750    02 WKS-TIT-R01-NODO          PIC 9(02).                                   
150800    02 WKS-TIT-R01-SNDO          PIC 9(02) VALUE 00.                          
150850    02 FILLER                    PIC X(06) VALUE                              
150900       "/R000/".                                                              
150950    02 WKS-TIT-R01-FEC           PIC 9(06).                                   
151000    02 FILLER                    PIC X(01) VALUE "/".                         
151050    02 WKS-TIT-R01-MIX           PIC 9(07).                                   
151100    02 FILLER                    PIC X(01) VALUE "/".                         
151150    02 WKS-TIT-R01-MSG           PIC X(14).                                   
151200    02 FILLER                    PIC X(01) VALUE ".".                         
151300                                                                              
152300***********************************************************                   
152350* LAYOUT ARCHIVO GBNP                                                         
152400**********************************************************                    
152450 01 WKS-HDR-GBNP.                                                             
152500    02 WKS-HDR-GBNP-ID              PIC X(03) VALUE "HDR".                    
152520    02 WKS-HDR-FILLER-1             PIC X VALUE "~".                          
152550    02 WKS-HDR-GBNP-HAN             PIC X(05) VALUE "VDBAL".                  
152555    02 WKS-HDR-FILLER-2             PIC X VALUE "~".                          
152560    02 WKS-HDR-GBNP-FEC             PIC 9(08).                                
152580    02 WKS-HDR-FILLER-3             PIC X VALUE "~".                          
152600    02 WKS-HDR-GBNP-SEC             PIC 9(03).                                
152620    02 WKS-HDR-FILLER-5             PIC X VALUE "~".                          
152640    02 WKS-HDR-GBNP-CSI             PIC X(04).                                
152650    02 WKS-HDR-FILLER-4             PIC X VALUE "~".                          
152700    02 WKS-HDR-GBNP-SIS             PIC X(03) VALUE "MX ".                    
152715    02 WKS-HDR-FILLER-6             PIC X VALUE "~".                          
152720    02 WKS-HDR-GBNP-BRCO            PIC 9(03) VALUE 485.                      
152750 01 WKS-DET-GBNP.                                                             
152800    02 WKS-DET-GBNP-ID              PIC X(03).                                
152820    02 WKS-DET-FILLER-1             PIC X.                                    
152850    02 WKS-DET-GBNP-BRCO            PIC 9(03).                                
152855    02 WKS-DET-FILLER-2             PIC X.                                    
152860    02 WKS-DET-GBNP-CTOS            PIC 9(20).                                
152862    02 WKS-DET-GBNP-CTO-R           REDEFINES WKS-DET-GBNP-CTOS.              
152864       03 WKS-FILLER-CTO            PIC 9(04).                                
152866       03 WKS-DET-GBNP-SUC          PIC 9(04).                                
152868       03 WKS-DET-GBNP-CTO          PIC 9(12).                                
152870    02 WKS-DET-FILLER-3             PIC X.                                    
152880    02 WKS-DET-GBNP-FECAP           PIC 9(08).                                
152882    02 WKS-DET-FILLER-4             PIC X.                                    
152885    02 WKS-DET-GBNP-SDO             PIC ZZZZZZZZZZZZZZZZZZZZ9.99.             
152910    02 WKS-DET-FILLER-5             PIC X.                                    
152920    02 WKS-DET-GBNP-MON             PIC X(03).                                
152922    02 WKS-DET-FILLER-6             PIC X.                                    
152925    02 WKS-DET-GBNP-LOBAL           PIC ZZZZZZZZZZZZZZZZZZZZ9.99.             
152950    02 WKS-DET-FILLER-7             PIC X.                                    
152960    02 WKS-DET-GBNP-DICOR           PIC X(03).                                
152980    02 WKS-DET-FILLER-8             PIC X.                                    
153000    02 WKS-DET-GBNP-STAT            PIC X.                                    
153750 01 WKS-TRL-GBNP.                                                             
153800    02 WKS-TRL-GBNP-ID              PIC X(03) VALUE "TRL".                    
153900    02 WKS-TRL-FILLER-1             PIC X VALUE "~".                          
154000    02 WKS-TRL-GBNP-TOTRE           PIC 9(10).                                
154050***********************************************************                   
154100* LISTADO DE MENSAJES                                                         
154150**********************************************************                    
154160 01 WKS-R01-L01-ENCA.                                                         
154180    02 FILLER                       PIC X(19) VALUE                           
154200      "S500/P108/25MTP004/".                                                  
154220    02 WKS-R01-L01-MSG              PIC X(24).                                
154240    02 FILLER                       PIC X(61) VALUE                           
154260      "GENERACION DE ARCHIVO DE SALDOS PARA GBNP".                            
154280    02 FILLER                       PIC X(07) VALUE                           
154300       "FECHA: ".                                                             
154320    02 WKS-R01-L01-FEC              PIC X(13).                                
154340    02 FILLER                       PIC X(08) VALUE " ".                      
154360 01 WKS-R01-L02-ENCA.                                                         
154380    02 FILLER                       PIC X(15) VALUE                           
154400       "FECHA PROCESO: ".                                                     
154420    02 WKS-R01-L02-FEC              PIC X(11).                                
154440    02 FILLER                       PIC X(16) VALUE " ".                      
154460    02 WKS-R01-L02-TIT              PIC X(62).                                
154480    02 FILLER                       PIC X(28) VALUE                           
154500       "TIPO DE PROCESO: DIARIO".                                             
154520 01 WKS-R01-L03-ENCA.                                                         
154540    02 FILLER                       PIC X(17) VALUE                           
154560       "HORA DE PROCESO: ".                                                   
154580    02 WKS-R01-L03-HH               PIC 9(02).                                
154600    02 FILLER                       PIC X VALUE ":".                          
154620    02 WKS-R01-L03-MM               PIC 9(02).                                
154640    02 FILLER                       PIC X VALUE ":".                          
154660    02 WKS-R01-L03-SS               PIC 9(02).                                
154700    02 WKS-R01-L03-STIT             PIC X(79).                                
154720    02 FILLER                       PIC X(14) VALUE                           
154740       "HOJA NUM    : ".                                                      
154760    02 WKS-R01-L03-NUMH             PIC ZZZZZ.                                
154780    02 FILLER                       PIC X(09) VALUE " ".                      
154800 01 WKS-R01-L04-ENCA.                                                         
154820    02 WKS-R01-L04-SUC              PIC X(04).                                
154840    02 FILLER                       PIC X(128) VALUE " ".                     
154860 01 WKS-R01-L05-ENCA.                                                         
154880    02 WKS-R01-L05-LEY              PIC X(60).                                
154900    02 WKS-R01-L05-LEY2             PIC X(72).                                
154920                                                                              
154940 01 WKS-R01-L06-DET.                                                          
154960    02 WKS-R01-L06-HR               PIC X(11).                                
154980    02 FILLER                       PIC X.                                    
155000    02 WKS-R01-L06-MSN              PIC X(120).                               
155020                                                                              
155040                                                                              
155060 01 WS-TABLA-MESES               PIC X(36)                                    
155080                     VALUE "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".            
155100 01 WS-TABLA-MESES-R REDEFINES WS-TABLA-MESES.                                
155120    02 WKS-TB-MES                PIC X(03) OCCURS 13 TIMES.                   
155140                                                                              
155200 01 WKS-SEC2                        PIC 9 VALUE 0.                            
155300 01 WKS-RESUL-MAP                   PIC 9(02).                                
155400 01 WKS-CSI-BASE                    PIC 9(02).                                
155600 01 WKS-CSI                         PIC X(03).                                
155800 01 WKS-SEC-ARC                     PIC 9(04).                                
155900 01 WKS-ACTI                        PIC 9(04).                                
156000 01 WKS-NUN-CONTRATO                PIC 9(14).                                
156040 01 WKS-CONTADOR                    PIC 9(10).                                
156060 01 WKS-DIA-C                       PIC 9(02).                                
156080 01 WKS-TIP-CORT                    PIC X.                                    
156081 01 WKS-TIP-CORT-ANT                PIC X.                                    
156082 01 WKS-NOTF                        PIC 9(02).                                
156084 01 WKS-BAND                        PIC 9.                                    
156086 01 WKS-FIN                         PIC 9.                                    
156088 01 WKS-MAPLI                       PIC 9 VALUE 0.                            
156090 01 WS-MAPLI-RESULT-FMT                   PIC 9(11).                          
156092 01 WS-MAPLI-AUTORIZACION-FMT             PIC 9(14).                          
156094 01 WS-MAPLI-ERROR99-1RA-VEZ-VA           PIC 9(01).                          
156096    88 WS-MAPLI-ERROR99-1RA-VEZ           VALUE 0.                            
156098 01 WS-MAPLI-CALL-INICIO-VA               PIC 9(01).                          
156100    88 WS-MAPLI-CALL-INICIO-OK            VALUE 0.                            
156102    88 WS-MAPLI-SI-REINTENTO-CALLINI      VALUE 1.                            
156104    88 WS-MAPLI-NO-REINTENTO-CALLINI      VALUE 2.                            
156106 01 WS-INDLIB                             PIC 9(04).                          
156108 01 WS-MONI-MAPLI                         PIC 9(01).                          
156110   88 WS-88-MONI-MAPLI                    VALUE 1.                            
156112 01 WS-NUM-PRODUCT                  PIC 9(04).                                
156114 01 WS-NUM-INSTRUME                 PIC 9(04).                                
156116 01 WS-MON                          PIC 9(03).                                
156118 01  WKS-TB-FEC-HOYCORT.                                                      
156120     02 WKS-FEC-HOY-CORTA     OCCURS 6 TIMES.                                 
156122        04 WKS-FEC-HOY-PCORT  PIC 9(08) COMP.                                 
156124 01 WS-HAY-B44                      PIC 9.                                    
156126 01 WKS-SALDO-GBNP                  PIC 9(14)V99.                             
156128 01 WKS-SALDO-PEND                  PIC 9(14)V99.                             
156130 01 WS-IND-DIAINH                   PIC 9(02)       COMP.                     
156132 01 WS-SUM-SDO-INHAB                PIC S9(14)V99   COMP.                     
156140 01 WS-DIAS-INHAXCTO                PIC 9(02)       COMP.                     
156142 01 WS-WFLP197.                                                               
156144   02 FILLER                   PIC X(11) VA "BEGIN JOB; ".                    
156146   02 FILLER                   PIC X(06) VA "START ".                         
156148   02 WS-WFLP197-LOTE          PIC X(41) VA SPACES.                           
156150   02 FILLER                   PIC X(1) VA "(".                               
156152   02 FILLER                   PIC X VALUE QUOTES.                            
156154   02 WS-WFLP197-PARAM         PIC X(13).                                     
156156   02 FILLER                   PIC X(01) VA " ".                              
156158   02 WS-WFLP197-FECHA         PIC 9(08).                                     
156160   02 FILLER                   PIC X(01) VA " ".                              
156162   02 WS-WFLP197-SEC           PIC 9(04).                                     
156164   02 FILLER                   PIC X VALUE QUOTES.                            
156166   02 FILLER                   PIC X(12) VA "); END JOB.".                    
156170                                                                              
156180 01 WS-NAME-LIB-S038MAPLI      PIC X(72).                                     
156190***********************************************************                   
156200*  REGISTROS UTILIZADOS EN LA CAPTURA DE HORA Y FECHAS.                       
156300***********************************************************                   
156400                                                                              
156500 01 WS-FEC-TEMPORAL                  PIC 9(08).                               
156600 01 WS-FEC-EDIT.                                                              
156610    02 WS-FEC-ED-AAAA                PIC 9(04).                               
156620    02 FILLER                        PIC X VALUE "/".                         
156630    02 WS-FEC-ED-MM                  PIC 9(02).                               
156640    02 FILLER                        PIC X VALUE "/".                         
156650    02 WS-FEC-ED-DD                  PIC 9(02).                               
156700 01 WS-FECVAL-AMD                    PIC 9(08).                               
156800 01 WS-FECVAL-AMD-R REDEFINES WS-FECVAL-AMD.                                  
156900    02 WS-FEC-VAL-AA                 PIC 9(04).                               
156920    02 WS-FEC-VAL-AA-R  REDEFINES WS-FEC-VAL-AA.                              
156940       03 WS-FEC-SS                  PIC 99.                                  
156960       03 WS-FEC-AA                  PIC 99.                                  
157000    02 WS-FEC-VAL-MM                 PIC 99.                                  
157100    02 WS-FEC-VAL-DD                 PIC 99.                                  
157150 01 WS-FEC-LIN                 PIC  9(08).                                    
157160 01 WKS-FECHA                  PIC  9(08).                                    
157200 01 WS-FECHA                   PIC  9(08).                                    
157205 01 WS-FECHA-R1 REDEFINES WS-FECHA.                                           
157210    02 WS-FECHA1-AA            PIC  9(02).                                    
157215    02 WS-FECHA1-AMD           PIC  9(06).                                    
157220 01 WS-FECHA-R2 REDEFINES WS-FECHA.                                           
157225    02 WS-FECHA2-AAAA          PIC  9(04).                                    
157230    02 WS-FECHA2-MM            PIC  9(02).                                    
157235    02 WS-FECHA2-DD            PIC  9(02).                                    
157240 01 WS-FECHA-AAAAMMDD.                                                        
157245    02 WS-FECHA3-AAAA          PIC  9(04).                                    
157250    02 WS-FECHA3-DIA1          PIC  X(01) VALUE "/".                          
157255    02 WS-FECHA3-MM            PIC  9(02).                                    
157260    02 WS-FECHA3-DIA2          PIC  X(01) VALUE "/".                          
157265    02 WS-FECHA3-DD            PIC  9(02).                                    
157266  01 WS-FECHA-DDMMAAAA.                                                       
157268    02 WS-FECHA4-DD            PIC  9(02).                                    
157270    02 WS-FECHA4-DIA1          PIC  X(01) VALUE "/".                          
157272    02 WS-FECHA4-MM            PIC  X(03).                                    
157274    02 WS-FECHA4-DIA2          PIC  X(01) VALUE "/".                          
157276    02 WS-FECHA4-AAAA          PIC  9(04).                                    
157278 01 WS-FECHAS-MSG.                                                            
157280    02 WS-MSG-A-1              PIC X(12).                                     
157282    02 WS-MSG-A-2              PIC X(12).                                     
157285    02 WS-MSG-A-3              PIC X(12).                                     
157300 01 WS-FECHA-DIA-DMA                 PIC 9(08).                               
157400 01 WS-FECHA-DIA-DMA-R REDEFINES WS-FECHA-DIA-DMA.                            
157500    02 WS-DIA-DD                     PIC 99.                                  
157600    02 WS-DIA-MM                     PIC 99.                                  
157700    02 WS-DIA-AA                     PIC 9(04).                               
157800                                                                              
157900 01 WS-FECHA-DIA-MDA                 PIC 9(08).                               
158000 01 WS-FECHA-DIA-MDA-R REDEFINES WS-FECHA-DIA-MDA.                            
158100    02 WS-DIA-MM1                    PIC 99.                                  
158200    02 WS-DIA-DD1                    PIC 99.                                  
158300    02 WS-DIA-AA1                    PIC 9(04).                               
158400                                                                              
158500 01 WS-FECHA-MAQ                 PIC 9(08).                                   
158600 01 WS-FECHA-MAQ-R REDEFINES WS-FECHA-MAQ.                                    
158750    02 WS-DIA-AA2                    PIC 99.                                  
158760    02 WS-DIA-AA22                   PIC 99.                                  
158800    02 WS-DIA-MM2                    PIC 99.                                  
158900    02 WS-DIA-DD2                    PIC 99.                                  
159000                                                                              
159100 01 WS-FECHA-PRO                     PIC 9(08).                               
159200 01 WS-FECHA-PRO-R REDEFINES WS-FECHA-PRO.                                    
159300    02 WS-PRO-AA                     PIC 9(04).                               
159400    02 WS-PRO-MM                     PIC 99.                                  
159500    02 WS-PRO-DD                     PIC 99.                                  
159600                                                                              
159700 01 WS-INVEN-PRO-AMD                  PIC 9(08).                              
159800 01 WS-INVEN-PRO-AMD-R REDEFINES WS-INVEN-PRO-AMD.                            
159900    02 WS-INV-PRO-AA                  PIC 9(04).                              
160000    02 WS-INV-PRO-MM                  PIC 99.                                 
160100    02 WS-INV-PRO-DD                  PIC 99.                                 
160200                                                                              
160300 01 WS-FEC-PROX-AMD             PIC 9(08).                                    
160400 01 WS-FEC-CAL-AMD REDEFINES WS-FEC-PROX-AMD.                                 
160500    02 WS-FEC-PROX-AA                PIC 9(04).                               
160600    02 WS-FEC-PROX-MM                PIC 99.                                  
160700    02 WS-FEC-PROX-DD                PIC 99.                                  
160800                                                                              
160900 01 WS-FEC-PROX-AMD1            PIC 9(08).                                    
161000 01 WS-FEC-CAL-AMD1 REDEFINES WS-FEC-PROX-AMD1.                               
161100    02 WS-FEC-PROX-AA1               PIC 9(04).                               
161200    02 WS-FEC-PROX-MM1               PIC 99.                                  
161300    02 WS-FEC-PROX-DD1               PIC 99.                                  
161400                                                                              
161500 01 WS-FECHA-PRO-DMA                 PIC 9(08).                               
161600 01 WS-FECHA-PRO-DMA-R REDEFINES WS-FECHA-PRO-DMA.                            
161700    02 WS-PRO-DD1                    PIC 99.                                  
161800    02 WS-PRO-MM1                    PIC 99.                                  
161900    02 WS-PRO-AA1                    PIC 9(04).                               
161905 01 WS-FEC-GBNP                      PIC 9(08).                               
161910 01 WS-FEC-GBNP-R REDEFINES WS-FEC-GBNP.                                      
161915    02 WS-F-GBNP-MM                  PIC 9(02).                               
161920    02 WS-F-GBNP-DD                  PIC 9(02).                               
161925    02 WS-F-GBNP-YYYY                PIC 9(04).                               
161930 01  WKS-VARIABLES-FECHAS.                                                    
161966     02 WKS-TIME-OPEN-BD         PIC 9(08)      COMP.                         
161968     02 RD-WKS-TIME-OPEN-BD      REDEFINES WKS-TIME-OPEN-BD.                  
161970        04 WKS-HH-OPEN-BD        PIC 9(02)      COMP.                         
161972        04 WKS-MM-OPEN-BD        PIC 9(02)      COMP.                         
161974        04 WKS-SS-OPEN-BD        PIC 9(02)      COMP.                         
161976        04 WKS-DS-OPEN-BD        PIC 9(02)      COMP.                         
161978                                                                              
161980     02 WKS-TIME-R06             PIC 9(08)      COMP.                         
161982     02 RD-WKS-TIME-R06          REDEFINES WKS-TIME-R06.                      
161984        04 WKS-HH-TIME-R06       PIC 9(02)      COMP.                         
161986        04 WKS-MM-TIME-R06       PIC 9(02)      COMP.                         
161988        04 WKS-SS-TIME-R06       PIC 9(02)      COMP.                         
161990        04 WKS-DS-TIME-R06       PIC 9(02)      COMP.                         
161992                                                                              
161994     02 WKS-TIME-MAQ-INI         PIC 9(08)      COMP.                         
161996     02 WKS-RD-TIME-MAQ-INI      REDEFINES WKS-TIME-MAQ-INI.                  
161998        04 WKS-HORA-MAQ-INI      PIC 9(06)      COMP.                         
162000        04 WKS-DSSS-MAQ-INI      PIC 9(02)      COMP.                         
162002     02 WKS-RD1-TIME-MAQ-INI     REDEFINES WKS-TIME-MAQ-INI.                  
162004        04 WKS-HH-MAQ-INI        PIC 9(02)      COMP.                         
162006        04 WKS-MM-MAQ-INI        PIC 9(02)      COMP.                         
162008        04 WKS-SS-MAQ-INI        PIC 9(02)      COMP.                         
162010        04 WKS-DS-MAQ-INI        PIC 9(02)      COMP.                         
162012                                                                              
162014     02 WKS-TIME-MAQ-TEM         PIC 9(08)      COMP.                         
162016     02 WKS-RD-TIME-MAQ-TEM      REDEFINES WKS-TIME-MAQ-TEM.                  
162018        04 WKS-HORA-MAQ-TEM      PIC 9(06)      COMP.                         
162020        04 WKS-DSSS-MAQ-TEM      PIC 9(02)      COMP.                         
162022     02 WKS-RD1-TIME-MAQ-TEM     REDEFINES WKS-TIME-MAQ-TEM.                  
162024        04 WKS-HH-MAQ-TEM        PIC 9(02)      COMP.                         
162026        04 WKS-MM-MAQ-TEM        PIC 9(02)      COMP.                         
162028        04 WKS-SS-MAQ-TEM        PIC 9(02)      COMP.                         
162030        04 WKS-DS-MAQ-TEM        PIC 9(02)      COMP.                         
162032                                                                              
162034     02 WKS-FEC-BASE             PIC 9(08)      COMP.                         
162036     02 WKS-RD1-FEC-BASE         REDEFINES WKS-FEC-BASE.                      
162038        04 WKS-AAAA-FBASE        PIC 9(04)      COMP.                         
162040        04 WKS-MM-BASEF          PIC 9(02)      COMP.                         
162042        04 WKS-DD-BASEF          PIC 9(02)      COMP.                         
162044     02 WKS-RD2-FEC-BASE         REDEFINES WKS-FEC-BASE.                      
162046        04 WKS-SS-FBASE          PIC 9(02)      COMP.                         
162048        04 WKS-FEC-BASE-06       PIC 9(06)      COMP.                         
162050        04 WKS-RD-FEC-BASE-06    REDEFINES WKS-FEC-BASE-06.                   
162052           06 WKS-AA-FBASE       PIC 9(02)      COMP.                         
162054           06 WKS-MM-FBASE       PIC 9(02)      COMP.                         
162056           06 WKS-DD-FBASE       PIC 9(02)      COMP.                         
162058           88 W88-DD-05-11       VALUE 5 THRU 11.                             
162060                                                                              
162062     02 WKS-FEC-BASE-UMA         PIC 9(08)      COMP.                         
162064     02 WKS-RD3-FEC-BASE-UMA     REDEFINES WKS-FEC-BASE-UMA.                  
162066        04 WKS-SS-FBASE-UMA      PIC 9(02)      COMP.                         
162068        04 WKS-FEC-BASE-06-UMA   PIC 9(06)      COMP.                         
162070        04 WKS-RD-FEC-BASE-06-UMA REDEFINES WKS-FEC-BASE-06-UMA.              
162072           06 WKS-AA-FBASE-UMA   PIC 9(02)      COMP.                         
162074           06 WKS-MMDD-FBASE-UMA PIC 9(04)      COMP.                         
162076                                                                              
162078     02 WKS-FBAS-DMA             PIC 9(08)      COMP.                         
162080     02 WKS-RD1-FBAS-DMA         REDEFINES WKS-FBAS-DMA.                      
162082        04 WKS-DD-FBAS-DMA       PIC 9(02)      COMP.                         
162084        04 WKS-MM-FBAS-DMA       PIC 9(02)      COMP.                         
162086        04 WKS-AAAA-FBAS-DMA     PIC 9(04)      COMP.                         
162088        04 RD1-WKS-AAAA-FBAS-DMA REDEFINES WKS-AAAA-FBAS-DMA.                 
162090           06 WKS-SS-FBAS-DMA    PIC 9(02)      COMP.                         
162092           06 WKS-AA-FBAS-DMA    PIC 9(02)      COMP.                         
162094                                                                              
162096     02 WKS-FEC-PTE-B            PIC 9(08)      COMP.                         
162098     02 WKS-RD1-FEC-PTE-B        REDEFINES WKS-FEC-PTE-B.                     
162100        04 WKS-AAAA-PTE-B        PIC 9(04)      COMP.                         
162102        04 FILLER                PIC 9(04)      COMP.                         
162104     02 WKS-RD2-FEC-PTE-B        REDEFINES WKS-FEC-PTE-B.                     
162106        04 WKS-SS-PTE-B          PIC 9(02)      COMP.                         
162108        04 WKS-FEC-PTE-B-06      PIC 9(06)      COMP.                         
162110        04 WKS-RD-FEC-PTE-B-06   REDEFINES WKS-FEC-PTE-B-06.                  
162112           06 WKS-AA-PTE-B       PIC 99         COMP.                         
162114           06 WKS-MM-PTE-B       PIC 99         COMP.                         
162116           06 WKS-DD-PTE-B       PIC 99         COMP.                         
162118                                                                              
162120     02 WKS-FECORTE-DANT       PIC 9(08)      COMP.                           
162122     02 RD-WKS-FECORTE-DANT    REDEFINES WKS-FECORTE-DANT.                    
162124        04 WKS-AA-CORT-DANT    PIC 9(04)      COMP.                           
162126        04 WKS-MM-CORT-DANT    PIC 99         COMP.                           
162128        04 WKS-DD-CORT-DANT    PIC 99         COMP.                           
162130                                                                              
162132     02 WKS-FECORTE-DNVO       PIC 9(08)      COMP.                           
162134     02 RD-WKS-FECORTE-DNVO    REDEFINES WKS-FECORTE-DNVO.                    
162136        04 WKS-AA-CORT-DNVO    PIC 9(04)      COMP.                           
162138        04 WKS-MM-CORT-DNVO    PIC 99         COMP.                           
162140        04 WKS-DD-CORT-DNVO    PIC 99         COMP.                           
162142                                                                              
162144     02 WKS-FEC-INIANH           PIC 9(08)      COMP.                         
162146     02 WKS-RD1-FEC-INIANH       REDEFINES WKS-FEC-INIANH.                    
162148        04 WKS-AAAA-INIANH       PIC 9(04)      COMP.                         
162150        04 FILLER                PIC 9(04)      COMP.                         
162152     02 WKS-RD2-FEC-INIANH       REDEFINES WKS-FEC-INIANH.                    
162154        04 WKS-SS-INIANH         PIC 9(02)      COMP.                         
162156        04 WKS-FEC-INIANH-06     PIC 9(06)      COMP.                         
162158        04 WKS-RD-FEC-INIANH-06  REDEFINES WKS-FEC-INIANH-06.                 
162160           06 WKS-AA-INIANH      PIC 99         COMP.                         
162162           06 WKS-MM-INIANH      PIC 99         COMP.                         
162164           06 WKS-DD-INIANH      PIC 99         COMP.                         
162166                                                                              
162168     02 WKS-FEC-FINANH           PIC 9(08)      COMP.                         
162170     02 WKS-RD1-FEC-FINANH       REDEFINES WKS-FEC-FINANH.                    
162172        04 WKS-AAAA-FINANH       PIC 9(04)      COMP.                         
162174        04 WKS-MM-FINANH         PIC 99         COMP.                         
162176        04 WKS-DD-FINANH         PIC 99         COMP.                         
162178                                                                              
162180     02 WKS-FEC-INIMES           PIC 9(08)      COMP.                         
162182     02 WKS-RD1-FEC-INIMES       REDEFINES WKS-FEC-INIMES.                    
162184        04 WKS-AAAA-INIMES       PIC 9(04)      COMP.                         
162186        04 WKS-MM-INIMES         PIC 99         COMP.                         
162188        04 WKS-DD-INIMES         PIC 99         COMP.                         
162190                                                                              
162192     02 WKS-FEC-FINMES           PIC 9(08)      COMP.                         
162194     02 WKS-RD1-FEC-FINMES       REDEFINES WKS-FEC-FINMES.                    
162196        04 WKS-AAAA-FINMES       PIC 9(04)      COMP.                         
162198        04 WKS-MM-FINMES         PIC 99         COMP.                         
162200        04 WKS-DD-FINMES         PIC 99         COMP.                         
162202                                                                              
162204     02 WKS-FEC-CIERRE-SUC       PIC 9(08)      COMP.                         
162206     02 RD-WKS-FEC-CIERRE-SUC    REDEFINES WKS-FEC-CIERRE-SUC.                
162208        04 WKS-AAAA-CIERRE-SUC   PIC 9(04)      COMP.                         
162210        04 WKS-MM-CIERRE-SUC     PIC 99         COMP.                         
162212        04 WKS-DD-CIERRE-SUC     PIC 99         COMP.                         
162214                                                                              
162216     02 WKS-FEC-1ERVIE-ANH       PIC 9(08)      COMP.                         
162218     02 RD-WKS-FEC-1ERVIE-ANH    REDEFINES WKS-FEC-1ERVIE-ANH.                
162220        04 WKS-AAAA-1ERVIE-ANH   PIC 9(04)      COMP.                         
162222        04 WKS-MM-1ERVIE-ANH     PIC 99         COMP.                         
162224        04 WKS-DD-1ERVIE-ANH     PIC 99         COMP.                         
162226                                                                              
162228     02 WKS-FEC-TRASP-BEN        PIC 9(08)      COMP.                         
162230     02 RD-WKS-FEC-TRASP-BEN     REDEFINES WKS-FEC-TRASP-BEN.                 
162232        04 WKS-SS-TRASP-BEN      PIC 9(02)      COMP.                         
162234        04 WKS-AAMM-TRASP-BEN    PIC 9(04)      COMP.                         
162236        04 WKS-DD-TRASP-BEN      PIC 99         COMP.                         
162238                                                                              
162240     02 WKS-FEC-TRASP-UMA        PIC 9(08)      COMP.                         
162242     02 RD-WKS-FEC-TRASP-UMA REDEFINES WKS-FEC-TRASP-UMA.                     
162244        04 WKS-SSAA-TRASP-UMA    PIC 9(04)      COMP.                         
162246        04 WKS-MM-TRASP-UMA      PIC 9(02)      COMP.                         
162248        04 WKS-DD-TRASP-UMA      PIC 99         COMP.                         
162250                                                                              
162252     02 WKS-FEC-CTO-BENEF        PIC 9(08)      COMP.                         
162254     02 WKS-RD1-FEC-CTO-BF       REDEFINES WKS-FEC-CTO-BENEF.                 
162256        04 WKS-AAAA-FCTOBF       PIC 9(04)      COMP.                         
162258        04 FILLER                PIC 9(04)      COMP.                         
162260                                                                              
162262     02 WKS-FEC-VAL-TRASPBF      PIC 9(08)      COMP.                         
162264     02 WKS-RD1-FEC-VAL-TBF      REDEFINES WKS-FEC-VAL-TRASPBF.               
162266        04 WKS-AAAA-FVALTBF      PIC 9(04)      COMP.                         
162268        04 FILLER                PIC 9(04)      COMP.                         
162270                                                                              
162272     02 WKS-FEC-PROX             PIC 9(08)      COMP.                         
162274     02 WKS-RD1-FEC-PROX         REDEFINES WKS-FEC-PROX.                      
162276        04 WKS-AAAA-FPROX        PIC 9(04)      COMP.                         
162278        04 FILLER                PIC 9(04)      COMP.                         
162280     02 WKS-RD2-FEC-PROX         REDEFINES WKS-FEC-PROX.                      
162282        04 WKS-SS-FPROX          PIC 9(02)      COMP.                         
162284        04 WKS-FEC-PROX-06       PIC 9(06)      COMP.                         
162286        04 WKS-RD-FEC-PROX-06    REDEFINES WKS-FEC-PROX-06.                   
162288           06 WKS-AA-FPROX       PIC 9(02)      COMP.                         
162290           06 WKS-MM-FPROX       PIC 9(02)      COMP.                         
162292           06 WKS-DD-FPROX       PIC 9(02)      COMP.                         
162294                                                                              
162296     02 WKS-FEC-PROX2            PIC 9(08)      COMP.                         
162298     02 WKS-RD1-FEC-PROX2        REDEFINES WKS-FEC-PROX2.                     
162300        04 WKS-AAAA-FPROX2       PIC 9(04)      COMP.                         
162302        04 WKS-MM-FPROX2         PIC 9(02)      COMP.                         
162304        04 WKS-DD-FPROX2         PIC 9(02)      COMP.                         
162306                                                                              
162308     02 WKS-FEC-ANTE             PIC 9(08)      COMP.                         
162310     02 WKS-RD1-FEC-ANTE         REDEFINES WKS-FEC-ANTE.                      
162312        04 WKS-AAAA-FANTE        PIC 9(04)      COMP.                         
162314        04 FILLER                PIC 9(04)      COMP.                         
162316     02 WKS-RD2-FEC-ANTE         REDEFINES WKS-FEC-ANTE.                      
162318        04 WKS-SS-FANTE          PIC 9(02)      COMP.                         
162320        04 WKS-FEC-ANTE-06       PIC 9(06)      COMP.                         
162322        04 WKS-RD-FEC-ANTE-06    REDEFINES WKS-FEC-ANTE-06.                   
162324           06 WKS-AA-FANTE       PIC 9(02)      COMP.                         
162326           06 WKS-MM-FANTE       PIC 9(02)      COMP.                         
162328           06 WKS-DD-FANTE       PIC 9(02)      COMP.                         
162330                                                                              
162332     02 WKS-FEC-APERT            PIC 9(08)      COMP.                         
162334     02 WKS-RD1-FEC-APERT        REDEFINES WKS-FEC-APERT.                     
162336        04 WKS-AAAA-FEC-APERT    PIC 9(04)      COMP.                         
162338        04 WKS-MM-FEC-APERT      PIC 99         COMP.                         
162340        04 WKS-DD-FEC-APERT      PIC 99         COMP.                         
162342 01 WS-FECHA-PTE           PIC 9(08)          COMP.                           
162344 01 RD1-FECHA-PTE          REDEFINES WS-FECHA-PTE.                            
162346        04 WS-AAAA-PTE         PIC 9(04)          COMP.                       
162348        04 WS-MM-PTE           PIC 99             COMP.                       
162350        04 WS-DD-PTE           PIC 99             COMP.                       
162352  01  WKS-TABLA-NUM-DIAS.                                                     
162355     02 FILLER                   PIC X(12) VALUE "312831303130".              
162360     02 FILLER                   PIC X(12) VALUE "313130313031".              
162365 01  WKS-RD-TABLA-NUM-DIAS       REDEFINES WKS-TABLA-NUM-DIAS.                
162370     02 WKS-TAB-DIAS-MES         PIC 99    OCCURS 12.                         
162375 01 WS-FEC-PUENTE-AMD              PIC 9(08).                                 
162380 01 WS-FEC-PUEN-AMD REDEFINES WS-FEC-PUENTE-AMD.                              
162385    02 WS-PUENTE-AA                PIC 9(04).                                 
162400    02 WS-PUENTE-MM                PIC 99.                                    
162500    02 WS-PUENTE-DD                PIC 99.                                    
162600 01 WS-HORA                        PIC 9(06).                                 
162605 01 WS-HORA-HHMMSSCC                        .                                 
162610    02 WS-HORA2-HH             PIC  9(02)   .                                 
162615    02 WS-HORA2-DOS1           PIC  X(01) VALUE ":".                          
162620    02 WS-HORA2-MM             PIC  9(02)   .                                 
162625    02 WS-HORA2-DOS2           PIC  X(01) VALUE ":".                          
162630    02 WS-HORA2-SS             PIC  9(02)   .                                 
162635    02 WS-HORA2-DOS3           PIC  X(01) VALUE ":".                          
162640    02 WS-HORA2-CC             PIC  9(02)   .                                 
162645 01 WS-HORA-MAQ                    PIC  9(08).                                
162650 01 WS-HORA-MAQ-R  REDEFINES WS-HORA-MAQ.                                     
162655    02 WS-HORA-MAQ-HH              PIC  9(02).                                
162660    02 WS-HORA-MAQ-MM              PIC  9(02).                                
162665    02 WS-HORA-MAQ-SS              PIC  9(02).                                
162700    02 WS-HORA-MAQ-CC              PIC  9(02).                                
163510 01 WKS-HOR-PRB                  PIC X(08).                                   
163515 01 WKS-HOR-PRB-R  REDEFINES WKS-HOR-PRB.                                     
163520    02 WKS-HR-PR-HH              PIC X(02).                                   
163530    02 FILLER                    PIC X.                                       
163540    02 WKS-HR-PR-MM              PIC X(02).                                   
163550    02 FILLER                    PIC X.                                       
163560    02 WKS-HR-PR-SS              PIC X(02).                                   
163672 01 WKS-PARAMETRO.                                                            
163680    02 WKS-PARAM                 PIC 9(02).                                   
163685    02 WKS-PARAM-FEC             PIC 9(08).                                   
163690    02 WKS-PARAM-SEC             PIC 9(02).                                   
163695 01 WS-CANCE-DIAS-INHANT         PIC 9(02)       COMP.                        
163696                                                                              
163784                                                                              
163786 01 WKS-B05-NUM-PRODUCTO                  PIC 9(04).                          
163788 01 WKS-B05-NUM-INSTRUM                   PIC 9(04).                          
163790 01 WKS-B05-IND-PAGOREND                  PIC 9(01).                          
163792 01 WKS-B05-IND-DIACORTE                  PIC 9(02).                          
163794 01 WKS-B05-IND-RENDDIA                   PIC 9(01).                          
163796***********************************************************                   
163800* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                  
163900* ACCESO A LA BASE DE DATOS.                                                  
164000***********************************************************                   
164100 COPY "S500/INC/WOR/25MTP002".                                                
164200 COPY "S500/INC/WOR/DAS/25MTP003".                                            
164300 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
164400***********************************************************                   
164410 01 WKS-AUX-1                   PIC X(24).                                    
164420 01 WKS-AUX-1-RED       REDEFINES WKS-AUX-1.                                  
164430    02 WKS-AUX-1-DIG            PIC X OCCURS 24 TIMES.                        
164440 01 WKS-AUX-2                   PIC X(24).                                    
164450 01 WKS-AUX-2-RED       REDEFINES WKS-AUX-2.                                  
164460    02 WKS-AUX-2-DIG            PIC X OCCURS 24 TIMES.                        
164500 01 WKS-DIA-CORTE               PIC 9(02)      COMP.                          
164505 77 W77-J                       PIC 9(11)      BINARY.                        
164510 77 W77-II                      PIC 9(11)      BINARY.                        
164520 77 W77-HOY-CORTA               PIC 9(02)      COMP.                          
164540 77  W77-OK-INDCORT             PIC 9(01)      COMP   VALUE 0.                
164560 77  W77-IND-FCOR               PIC 9(02)      BINARY VALUE 0.                
164562 77 W77-PARAM-WFL               PIC X(12) RECEIVED BY CONTENT.                
164564 77  W77-NUM-MIX                PIC 9(07)      COMP.                          
164565 01  WKS-NAME-HOST.                                                           
164570     02 WKS-MY-HOST             PIC X(20).                                    
164575     02 WKS-MY-HOST-RD          REDEFINES WKS-MY-HOST.                        
164580        04 WKS-MY-HOST-03       PIC X(04).                                    
164585        04 WKS-MY-HOST-17       PIC X(16).                                    
164590 01  WKS-HI-TEXTO.                                                            
164595     02 WKS-HI-TEX00         PIC X(04) VALUE "HI= ".                          
164600     02 WKS-HI-NUMHI         PIC 9(03).                                       
164605     02 WKS-HI-TEX01         PIC X(13) VALUE                                  
164610        " HORA INI= ".                                                        
164615     02 WKS-HI-HRIN          PIC X(11).                                       
164620     02 WKS-HI-TEX-02        PIC X(12) VALUE                                  
164625        " HORA ACTU= ".                                                       
164630     02 WKS-HI-HR            PIC 9(11).                                       
164635     02 WKS-HI-TEX03         PIC X(09) VALUE                                  
164640        " LEIDOS= ".                                                          
164645     02 WKS-HI-LEIDOS        PIC 9(08).                                       
164650     02 WKS-HI-TEX04         PIC X(13) VALUE                                  
164655        " SERV. GBNP= ".                                                      
164660     02 WKS-HI-PROCE         PIC 9(08).                                       
164665     02 WKS-HI-TEX05         PIC X(13) VALUE                                  
164670        " CAMB.PROD.= ".                                                      
164675     02 WKS-HI-CAMP          PIC 9(08).                                       
164680***********************************************************                   
164700*  P R O C E D U R E    D I V I S I O N.                                      
164800***********************************************************                   
164900 PROCEDURE DIVISION USING W77-PARAM-WFL.                                      
165000********************                                                          
165005 DECLARATIVES.                                                                
165010 0000000-INTERUP-SECTION SECTION.                                             
165015     USE AS INTERRUPT PROCEDURE.                                              
165020 000000-INTERRUPT.                                                            
165025     DISALLOW  INTERRUPT.                                                     
165030     MOVE "I" TO W77-TIPO-DISP.                                               
165035     IF ATTRIBUTE  TASKVALUE OF MYSELF = 1                                    
165040        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI-NUMHI                    
165042        PERFORM 20004000-HORA-MAQ                                             
165044        MOVE WS-HORA-HHMMSSCC  TO WKS-HI-HR                                   
165045        MOVE WKS-HI-TEXTO      TO WS-0101-TEXT-MSG                            
165046        PERFORM 20004000-HORA-MAQ                                             
165048        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
165050        MOVE WS-0101-TEXT-MSG  TO WKS-R01-L06-MSN                             
165052        PERFORM 20004001-ESCRIBE-MSN                                          
165060        PERFORM 70000050-MENSAJE.                                             
165065                                                                              
165070     SET MYSELF (TASKVALUE)  TO ZERO.                                         
165075     MOVE "E" TO W77-TIPO-DISP.                                               
165080     ALLOW INTERRUPT.                                                         
165085 END DECLARATIVES.                                                            
165090                                                                              
165100***********************************************************                   
165200*    R U T I N A    P R I N C I P A L.                                        
165300***********************************************************                   
165350 00000000-PRINCIPAL SECTION 01.                                               
165400 00000000-RUTINA-PRINCIPAL.                                                   
165500                                                                              
165600     MOVE ATTRIBUTE HOSTNAME  OF MYSELF TO WKS-NAME-HOST.                     
165700     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO W77-NUM-MIX.                       
165750     MOVE W77-PARAM-WFL       TO WKS-PARAMETRO.                               
165800     MOVE "P108"              TO WS-0101-PASO-MSG.                            
165900     MOVE "25MTP004"          TO WS-0101-MTP-MSG.                             
166000     MOVE "S500P108"          TO W77-S000-MY-ID.                              
166100     MOVE "25MTP004"          TO W77-S000-MY-VERSION.                         
166200     MOVE 2                   TO W77-USO-LIBLJ.                               
166300     MOVE 0                   TO WKS-FIN.                                     
166350                                                                              
166360     PERFORM 10000000-OPEN       THRU 10000000-EXIT.                          
166600     PERFORM 50000000-PROCESOS THRU 50000000-EXIT                             
166650                   UNTIL WKS-FIN = 2.                                         
166700     PERFORM 70000000-CIERRO     THRU 70000000-EXIT.                          
166800     STOP RUN.                                                                
166900                                                                              
167000                                                                              
167100***********************************************************                   
167200*         R U T I N A S  D E   S E L E C C I O N   D E                        
167300*    L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S              
167400*                  P O R   E L   P R O G R A M A.                             
167500***********************************************************                   
167600 20000000-LIBRERIAS.                                                          
167700***********************************************************                   
167800* LIBRERIA DE VERSIONES.                                                      
167900***********************************************************                   
168000     PERFORM 10000100-VERSIONES.                                              
168100                                                                              
168200***********************************************************                   
168300* LIBRERIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.                        
168400***********************************************************                   
168500     PERFORM 10000006-LOCSUP.                                                 
168600     PERFORM 20000000-VERS-P197.                                              
169800     PERFORM 10000080-MAPLI.                                                  
169900***********************************************************                   
170000                                                                              
170100 20000000-EXIT.                                                               
170200    EXIT.                                                                     
170300                                                                              
170400                                                                              
170500                                                                              
170600                                                                              
170700                                                                              
170800***********************************************************                   
170900*  RUTINAS PARA  APERTURA DE  BASE Y ARCHIVOS.                                
171000***********************************************************                   
171100 10000000-OPEN.                                                               
171200                                                                              
171300                                                                              
171400     PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT.                        
171420     PERFORM 20000000-LIBRERIAS    THRU 20000000-EXIT.                        
171440     PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT.                        
171500     PERFORM 20002000-FECHA-PRO    THRU 20002000-EXIT.                        
171550     PERFORM 20003000-ABRE-REPORT  THRU 20003000-EXIT.                        
171600     PERFORM 20004000-HORA-MAQ     THRU 20004000-EXIT.                        
171650     PERFORM 20004001-INI-REPORT   THRU 20004001-EXIT.                        
171700     PERFORM 20005000-CARGA-B05    THRU 20005000-EXIT.                        
171750     PERFORM 20006000-VALIDA-SERV  THRU 20006000-EXIT.                        
171760     IF WKS-FIN = 2                                                           
171770        EXIT PERFORM                                                          
171780     ELSE                                                                     
171800******************************************************************            
171810*                ACTIVIDADES PARA LIBRERIA MAPLI                 *            
171820*           #ACT              OCCURS                             *            
171830******************************************************************            
171840***************************S500L081*******************************            
171850        MOVE  01       TO       WKS-NUMACT-LIB(106)                           
171860        MOVE  02       TO       WKS-NUMACT-LIB(107)                           
171870        MOVE  03       TO       WKS-NUMACT-LIB(108)                           
171880        MOVE  04       TO       WKS-NUMACT-LIB(109)                           
171885        PERFORM 20006000-INICIA-MAPLI                                         
171890        PERFORM 20007000-OPEN-ARC     THRU 20007000-EXIT                      
171900        PERFORM 20008000-HEADERS      THRU 20008000-EXIT.                     
172000                                                                              
172100 10000000-EXIT.                                                               
172200     EXIT.                                                                    
172300                                                                              
172400***********************************************************                   
172500                                                                              
172600***********************************************************                   
172700* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
172800***********************************************************                   
172900 20000050-CHECO-VER.                                                          
173000     IF WKS-MY-HOST = "ACYPBETA.           "                                  
173100        NEXT SENTENCE                                                         
173200     ELSE                                                                     
173300        PERFORM 20000100-CHECAME-VERSION                                      
173400        IF S000-CTR-CVEERROR < 0                                              
173500           MOVE "ERROR EN VERSION DEL PASO" TO WS-0101-TEXT-MSG               
173600           PERFORM 70000050-MENSAJE                                           
173700           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
173800 20000050-EXIT.                                                               
173900    EXIT.                                                                     
174000                                                                              
174100                                                                              
174250                                                                              
174300                                                                              
174400***********************************************************                   
174500* ABRO LA BASE DE DATOS DE INQUIRY YA QUE NO SE ACTUALIZA.                    
174600***********************************************************                   
174700 20001000-ABRO-BASE.                                                          
174800     OPEN UPDATE S500BD01CAPTACION                                            
174900     ON EXCEPTION                                                             
175000        MOVE "ERROR AL ABRIR LA BASE      " TO WS-0101-TEXT-MSG               
175020        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
175040        MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                        
175100        PERFORM 70000050-MENSAJE                                              
175200        CALL SYSTEM DMTERMINATE.                                              
175300                                                                              
175400    SET S500B02CONTROL        TO BEGINNING.                                   
175600                                                                              
175800                                                                              
175900 20001000-EXIT.                                                               
176000    EXIT.                                                                     
176100                                                                              
176200***********************************************************                   
176300* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
176400***********************************************************                   
176500 20002000-FECHA-PRO.                                                          
176600  PERFORM 90000002-B02CONTROL-FIND                                            
176700  IF WS-STATUS-BASE > 0                                                       
176800    IF WS-STATUS-BASE = 1                                                     
176900       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
176920       INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                     
176940       MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                         
177000       PERFORM 70000050-MENSAJE                                               
177100       CALL SYSTEM DMTERMINATE                                                
177200    ELSE                                                                      
177300       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
177400       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
177420       INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                     
177440       MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                         
177500       PERFORM 70000050-MENSAJE                                               
177600       CALL SYSTEM DMTERMINATE.                                               
177700     MOVE B02-NUM-CSI       TO WKS-CSI-BASE.                                  
178300     PERFORM 20006030-PROY-FEC.                                               
178350     MOVE WKS-FEC-BASE    TO WS-S006-FECHA1.                                  
178400     MOVE WKS-FEC-ANTE    TO WS-S006-FECHA2.                                  
178450     MOVE 12              TO WS-S006-FORMATO.                                 
178500     MOVE 2               TO WS-S006-FUNCION.                                 
178550     PERFORM 20040300-LLAMA-LOCSUP.                                           
178600     MOVE WS-S006-FECHA1  TO WS-DIAS-INHAXCTO.                                
178650     MOVE WS-S006-FECHA1  TO WS-MSG-N-02.                                     
179300                                                                              
179400 20002000-EXIT.                                                               
179500    EXIT.                                                                     
179502                                                                              
179504 20003000-ABRE-REPORT.                                                        
179506     SET  R01-MENSAJES     (USERBACKUPNAME)  TO VALUE TRUE.                   
179508     MOVE WKS-FEC-BASE     TO WKS-TIT-R01-FEC.                                
179510     MOVE W77-NUM-MIX      TO WKS-TIT-R01-MIX                                 
179512     MOVE WKS-CSI-BASE     TO WKS-TIT-R01-NODO.                               
179514     IF WKS-PARAM = 01                                                        
179516        MOVE "010MENSAJES003"    TO WKS-TIT-R01-MSG                           
179518     ELSE                                                                     
179520     IF WKS-PARAM = 02                                                        
179522        MOVE "011MENSAJES004"    TO WKS-TIT-R01-MSG                           
179524     ELSE                                                                     
179526     IF WKS-PARAM-SEC = 01 OR 02                                              
179528        MOVE "010MENSAJES003"    TO WKS-TIT-R01-MSG                           
179530     ELSE                                                                     
179532        MOVE "011MENSAJES004"    TO WKS-TIT-R01-MSG.                          
179534     SET  R01-MENSAJES      (TITLE)  TO WKS-TITULO-R01.                       
179536     OPEN OUTPUT R01-MENSAJES.                                                
179538     PERFORM 0004001-ESC-ENCA.                                                
179540                                                                              
179560 20003000-EXIT.                                                               
179580     EXIT.                                                                    
179600 20040300-LLAMA-LOCSUP.                                                       
179602     MOVE WS-S006-FORMATO  TO WS-MSG-N-02.                                    
179604     MOVE WS-S006-FUNCION  TO WS-MSG-N-04.                                    
179606     MOVE WS-S006-FECHA1   TO W77-FECHA-EDIT.                                 
179608     MOVE WS-S006-FECHA2   TO W77-FECHA-EDIT2.                                
179610     PERFORM 20000006-LOCSUP.                                                 
179612                                                                              
179614     IF WS-S006-FUNCION > 0                                                   
179616        MOVE WS-S006-FUNCION  TO WS-MSG-RS                                    
179618        STRING "ERR CALL LOCSUP ",                                            
179620               " FUNC-E ", WS-MSG-N-04                                        
179622               " FMTO-E ", WS-MSG-N-02                                        
179624               " FEC1-E ", W77-FECHA-EDIT                                     
179626               " FEC2-E ", W77-FECHA-EDIT2                                    
179628               " FUNC-S ", WS-MSG-RS                                          
179632               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
179634        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
179636        MOVE WS-0101-TEXT-MSG  TO WKS-R01-L06-MSN                             
179638        PERFORM 20004000-HORA-MAQ                                             
179640        PERFORM 20004001-ESCRIBE-MSN                                          
179642        PERFORM 70000050-MENSAJE                                              
179644        CALL SYSTEM DMTERMINATE.                                              
179646                                                                              
179648  20000000-VERS-P197.                                                         
179650   MOVE "S500JBATCH"    TO  S000-CTR-LIBID.                                   
179655                                                                              
179660   CALL "DAME_TIT IN CTLVERS"                                                 
179665        USING      S000-CTR-LIBID                                             
179670                   S000-CTR-NOMLIB                                            
179675        GIVING     S000-CTR-CVEERROR.                                         
179680                                                                              
179685   MOVE S000-CTR-NOMLIB TO WS-WFLP197-LOTE.                                   
179690                                                                              
179700 10000080-MAPLI.                                                              
179705     MOVE ZEROS              TO S000-CTR-CVEERROR.                            
179710     MOVE "S500L035"         TO S000-CTR-LIBID.                               
179715                                                                              
179720     CALL "DAME_TIT IN CTLVERS"                                               
179725           USING      S000-CTR-LIBID                                          
179730                      S000-CTR-NOMLIB                                         
179735           GIVING     S000-CTR-CVEERROR.                                      
179740                                                                              
179745     IF S000-CTR-CVEERROR = 0                                                 
179750        CHANGE ATTRIBUTE TITLE OF "S500L035"                                  
179755                               TO S000-CTR-NOMLIB                             
179756       MOVE S000-CTR-NOMLIB     TO WS-NAME-LIB-S038MAPLI                      
179758       INSPECT WS-NAME-LIB-S038MAPLI REPLACING ALL @00@ BY " "                
179760     ELSE                                                                     
179765        MOVE S000-CTR-CVEERROR TO WS-MSG-N-02                                 
179770        STRING  "ERROR EN CALL CTLVERS MAPLI (S500L035)",                     
179775                " RESULT=", WS-MSG-N-02                                       
179780                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
179782        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
179784        MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                        
179790        PERFORM 70000050-MENSAJE.                                             
179792                                                                              
179794 20006030-PROY-FEC.                                                           
179800     MOVE B02-FECHA-LINEA        TO WS-S006-FECHA1                            
180000                                    WS-FEC-LIN.                               
180200     MOVE 1                      TO WS-S006-FECHA2.                           
180400     MOVE 12                     TO WS-S006-FORMATO.                          
180600     MOVE 15                     TO WS-S006-FUNCION.                          
180800     PERFORM 20040300-LLAMA-LOCSUP.                                           
181000     MOVE WS-S006-FECHA1      TO WKS-FEC-BASE                                 
181200                                 W77-FECHA-EDIT                               
181300                                 WKS-FEC-BASE.                                
181400                                                                              
181500     MOVE WKS-FEC-BASE           TO WS-S006-FECHA1                            
181600     MOVE 1                      TO WS-S006-FECHA2.                           
182000     MOVE 12                     TO WS-S006-FORMATO.                          
182500     MOVE 15                     TO WS-S006-FUNCION.                          
183000     PERFORM 20040300-LLAMA-LOCSUP.                                           
183500     MOVE WS-S006-FECHA1         TO WKS-FEC-ANTE.                             
184000                                                                              
184900***********************************************************                   
185000                                                                              
185100***********************************************************                   
185200* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
185300***********************************************************                   
185400 20004000-HORA-MAQ.                                                           
185500     ACCEPT  WS-HORA-MAQ FROM TIME.                                           
185520     MOVE WS-HORA-MAQ-HH   TO WS-HORA2-HH.                                    
185540     MOVE WS-HORA-MAQ-MM   TO WS-HORA2-MM.                                    
185560     MOVE WS-HORA-MAQ-SS   TO WS-HORA2-SS.                                    
185580     MOVE WS-HORA-MAQ-CC   TO WS-HORA2-CC.                                    
185600                                                                              
185700 20004000-EXIT.                                                               
185800    EXIT.                                                                     
185810 20004001-INI-REPORT.                                                         
185820      MOVE SPACES TO WKS-R01-L06-MSN                                          
185830      PERFORM 20004000-HORA-MAQ.                                              
185840      STRING "INICIO PROCESO",                                                
185850          " FECHA: ", W77-FECHA-EDIT,                                         
185860          " HORA: ",  WS-HORA-HHMMSSCC                                        
185870          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
185880      PERFORM 20004001-ESCRIBE-MSN.                                           
185890                                                                              
185900      IF WKS-MY-HOST = "ACYPBETA.           " OR                              
185910                       "VDMBETA.            "                                 
185920         STRING "MIXNUMBER ="    , WKS-TIT-R01-MIX                            
185930             " PARAMETRO ="       , WKS-PARAM                                 
185940             " PRUEBA EN "    , WKS-MY-HOST                                   
185950             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
185960      ELSE                                                                    
185970         STRING "MIXNUMBER ="    , WKS-TIT-R01-MIX                            
185980             " PARAMETRO ="       , WKS-PARAM                                 
185990             " PRODUCCION EN "    , WKS-MY-HOST                               
186000             DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                          
186010     PERFORM 20004001-ESCRIBE-MSN.                                            
186020                                                                              
186030     PERFORM 20004000-HORA-MAQ.                                               
186040     STRING "*** ABRO BASE DEL S500 ", WS-HORA-HHMMSSCC                       
186050          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
186060     PERFORM 20004001-ESCRIBE-MSN.                                            
186070                                                                              
186080     PERFORM 20004000-HORA-MAQ.                                               
186090     MOVE WS-FEC-LIN                TO WS-FECHA                               
186100     MOVE WS-FECHA2-DD              TO WS-FECHA4-DD                           
186110     MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM                           
186120     MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA                         
186130     MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-1                             
186140                                                                              
186150     MOVE WKS-FEC-BASE              TO WS-FECHA                               
186160     MOVE WS-FECHA2-DD              TO WS-FECHA4-DD                           
186170     MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM                           
186180     MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA                         
186190     MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-2                             
186200     MOVE 20                        TO WS-DIA-AA2                             
186210     MOVE WS-FECHA-MAQ              TO WS-FECHA                               
186220     MOVE WS-FECHA2-AAAA            TO WS-FECHA4-AAAA                         
186230     MOVE WKS-TB-MES(WS-FECHA2-MM)  TO WS-FECHA4-MM                           
186240     MOVE WS-FECHA2-DD              TO WS-FECHA4-DD                           
186250     MOVE WS-FECHA-DDMMAAAA         TO WS-MSG-A-3                             
186260                                                                              
186270     STRING "FECHA LINEA   : " , WS-MSG-A-1                                   
186280            "FECHA ARCHIVO : " , WS-MSG-A-2                                   
186290            "FECHA MAQUINA : " , WS-MSG-A-3                                   
186300          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
186310     PERFORM 20004001-ESCRIBE-MSN.                                            
186320     STRING "LB S500L035       " , WS-NAME-LIB-S038MAPLI                      
186330          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
186340     PERFORM 20004001-ESCRIBE-MSN.                                            
186350                                                                              
186360 20004001-EXIT.                                                               
186370     EXIT.                                                                    
186380                                                                              
186390 20004001-ESCRIBE-MSN.                                                        
186400     PERFORM 20004000-HORA-MAQ.                                               
186410     MOVE WS-HORA-HHMMSSCC TO WKS-R01-L06-HR.                                 
186420     ADD 1    TO W77-R01-NLIN.                                                
186430     IF W77-R01-NLIN > 50                                                     
186440        PERFORM 0004001-ESC-ENCA.                                             
186450                                                                              
186460     WRITE R01-L00-MENSAJE FROM WKS-R01-L06-DET AFTER 1.                      
186470     MOVE " " TO WKS-R01-L06-DET.                                             
186480 0004001-ESC-ENCA.                                                            
186482     MOVE SPACES              TO WKS-R01-L02-TIT                              
186484                                 WKS-R01-L03-STIT                             
186490     MOVE WKS-TIT-R01-MSG     TO WKS-R01-L01-MSG.                             
186500     MOVE WKS-AAAA-FBASE      TO WS-FEC-ED-AAAA.                              
186510     MOVE WKS-MM-FBASE        TO WS-FEC-ED-MM.                                
186520     MOVE WKS-DD-FBASE        TO WS-FEC-ED-DD.                                
186530     MOVE WS-FEC-EDIT         TO WKS-R01-L01-FEC.                             
186540     ACCEPT WS-FECHA-MAQ FROM DATE.                                           
186545     MOVE 20                  TO WS-DIA-AA2.                                  
186550     MOVE WS-FECHA-MAQ        TO W77-FECHA-EDIT.                              
186560     MOVE W77-FECHA-EDIT      TO WKS-R01-L02-FEC.                             
186570     PERFORM 20004000-HORA-MAQ.                                               
186580     MOVE WS-HORA-MAQ-HH      TO WKS-R01-L03-HH                               
186590     MOVE WS-HORA-MAQ-MM      TO WKS-R01-L03-MM                               
186600     MOVE WS-HORA-MAQ-SS      TO WKS-R01-L03-SS.                              
186610     IF WKS-CSI-BASE = 10                                                     
186620        MOVE 3084                     TO WKS-R01-L04-SUC                      
186630        MOVE "PYCP JARDINES"          TO WKS-R01-L05-LEY                      
186640        MOVE "C.S.I. MEXICO   "       TO WKS-R01-L05-LEY2                     
186650     ELSE                                                                     
186660        MOVE 3667                     TO WKS-R01-L04-SUC                      
186670        MOVE "CYSAU MTY CTROL PROD"   TO WKS-R01-L05-LEY                      
186680        MOVE "C.S.I. MONTERREY"       TO WKS-R01-L05-LEY2.                    
186690     ADD 1                            TO W77-R01-NPAG.                        
186700     MOVE W77-R01-NPAG                TO WKS-R01-L03-NUMH.                    
186710     MOVE 6                           TO W77-R01-NLIN.                        
186720     WRITE R01-L00-MENSAJE    FROM WKS-R01-L01-ENCA AFTER PAGE.               
186730     WRITE R01-L00-MENSAJE    FROM WKS-R01-L02-ENCA AFTER 1  .                
186740     WRITE R01-L00-MENSAJE    FROM WKS-R01-L03-ENCA AFTER 1  .                
186750     WRITE R01-L00-MENSAJE    FROM WKS-R01-L04-ENCA AFTER 1  .                
186760     WRITE R01-L00-MENSAJE    FROM WKS-R01-L05-ENCA AFTER 1  .                
186770     MOVE " "              TO R01-L00-MENSAJE.                                
186780     WRITE R01-L00-MENSAJE     AFTER 1  .                                     
186790                                                                              
186800                                                                              
187200***********************************************************                   
187202* VALIDA SI EL SERVICIO GBNP ESTA ACTIVO                                      
187204***********************************************************                   
187206 20006000-VALIDA-SERV.                                                        
187208     PERFORM 90000002-B02CONTROL-FIND.                                        
187212     MOVE B02-NUM-CSI       TO WKS-CSI-BASE.                                  
187215     IF WKS-CSI-BASE = 10                                                     
187220        MOVE "VDM"         TO WKS-CSI                                         
187225     ELSE                                                                     
187230        MOVE "QRO"         TO WKS-CSI.                                        
187235     IF WKS-PARAM   = 2                                                       
187250        MOVE 1                  TO WKS-FIN                                    
187252     ELSE                                                                     
187254     IF WKS-PARAM = 3                                                         
187256        MOVE WKS-PARAM-FEC       TO WKS-FEC-BASE                              
187258        MOVE WKS-FEC-BASE           TO WS-S006-FECHA1                         
187260        MOVE 1                      TO WS-S006-FECHA2                         
187262        MOVE 12                     TO WS-S006-FORMATO                        
187264        MOVE 15                     TO WS-S006-FUNCION                        
187266        PERFORM 20040300-LLAMA-LOCSUP                                         
187268        MOVE WS-S006-FECHA1         TO WKS-FEC-ANTE                           
187270        MOVE WKS-FEC-BASE    TO WS-S006-FECHA1                                
187272        MOVE WKS-FEC-ANTE    TO WS-S006-FECHA2                                
187274        MOVE 12              TO WS-S006-FORMATO                               
187276        MOVE 2               TO WS-S006-FUNCION                               
187278        PERFORM 20040300-LLAMA-LOCSUP                                         
187280        MOVE WS-S006-FECHA1  TO WS-DIAS-INHAXCTO                              
187282        MOVE WS-S006-FECHA1  TO WS-MSG-N-02                                   
187284        MOVE 1                   TO WKS-FIN.                                  
187286     IF B02-GBNP-SALDOS-FEC = WKS-FEC-BASE                                    
187288        PERFORM 20004000-HORA-MAQ                                             
187290        STRING "ENTRA A PROCESO DE VALIDAR REENVIOS"                          
187292               DELIMITED BY SIZE INTO WKS-R01-L06-MSN                         
187294        PERFORM 20004001-ESCRIBE-MSN                                          
187296        PERFORM 20006100-REENVIA-ARC.                                         
187298 20006000-EXIT.                                                               
187300     EXIT.                                                                    
187302                                                                              
187304 20006100-REENVIA-ARC.                                                        
187306     MOVE WKS-FEC-BASE        TO WS-WFLP197-FECHA                             
187308     MOVE "ENVIAGBNPSDOS"     TO WS-WFLP197-PARAM                             
187310     IF B02-GBNP-SALDOS-SEC = 1 AND WKS-PARAM = 1                             
187312        MOVE 0001                TO WS-WFLP197-SEC                            
187314        CALL SYSTEM WFL USING WS-WFLP197                                      
187316        PERFORM 20004000-HORA-MAQ                                             
187318        STRING "REENVIO ARCHIVO SECUENCIAL 001 "                              
187320              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187322        PERFORM 20004001-ESCRIBE-MSN                                          
187324        IF WKS-PARAM = 1                                                      
187326           MOVE 1                TO WKS-SEC2                                  
187328                                    WKS-FIN                                   
187330        ELSE                                                                  
187332           NEXT SENTENCE                                                      
187334     ELSE                                                                     
187336     IF B02-GBNP-SALDOS-SEC = 2 AND WKS-PARAM = 1                             
187338        MOVE 0001                TO WS-WFLP197-SEC                            
187340        CALL SYSTEM WFL USING WS-WFLP197                                      
187342        PERFORM 20004000-HORA-MAQ                                             
187344        STRING "REENVIO ARCHIVO SECUENCIAL 001 "                              
187346              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187348        PERFORM 20004001-ESCRIBE-MSN                                          
187350        WAIT(5)                                                               
187352        MOVE 0002                TO WS-WFLP197-SEC                            
187354        CALL SYSTEM WFL USING WS-WFLP197                                      
187356        PERFORM 20004000-HORA-MAQ                                             
187358        STRING "REENVIO ARCHIVO SECUENCIAL 002 "                              
187360              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187362        PERFORM 20004001-ESCRIBE-MSN                                          
187365        MOVE 2                   TO WKS-FIN                                   
187370     ELSE                                                                     
187375     IF B02-GBNP-SALDOS-SEC = 3                                               
187380        MOVE 0001                TO WS-WFLP197-SEC                            
187385        CALL SYSTEM WFL USING WS-WFLP197                                      
187390        PERFORM 20004000-HORA-MAQ                                             
187395        STRING "REENVIO ARCHIVO SECUENCIAL 001 "                              
187400              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187405        PERFORM 20004001-ESCRIBE-MSN                                          
187410        WAIT(5)                                                               
187415        MOVE 0002                TO WS-WFLP197-SEC                            
187420        CALL SYSTEM WFL USING WS-WFLP197                                      
187425                PERFORM 20004000-HORA-MAQ                                     
187430        STRING "REENVIO ARCHIVO SECUENCIAL 002 "                              
187435              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187440        PERFORM 20004001-ESCRIBE-MSN                                          
187445        WAIT(5)                                                               
187450        MOVE 0003                TO WS-WFLP197-SEC                            
187455        CALL SYSTEM WFL USING WS-WFLP197                                      
187460         PERFORM 20004000-HORA-MAQ                                            
187465        STRING "REENVIO ARCHIVO SECUENCIAL 003 "                              
187470              DELIMITED BY SIZE INTO WKS-R01-L06-MSN                          
187475        PERFORM 20004001-ESCRIBE-MSN                                          
187480        MOVE 2                   TO WKS-FIN.                                  
187485***********************************************************                   
187490* ABRO LOS ARCHIVOS DE DATOS .                                                
187500* DIARIAMENTE SE GENERA DE SALDOS                                             
187600***********************************************************                   
187700 20007000-OPEN-ARC.                                                           
187800   IF WKS-PARAM  = 1                                                          
187805      MOVE 0001            TO WKS-E-GBNP-SEC                                  
187812                              WKS-SEC-ARC                                     
187820                                                                              
187822     IF WKS-SEC2 = 1                                                          
187824        MOVE 0002          TO WKS-E-GBNP-SEC                                  
187828                              WKS-SEC-ARC                                     
187832     ELSE                                                                     
187834       NEXT SENTENCE                                                          
187836   ELSE                                                                       
187838   IF WKS-PARAM  = 2                                                          
187840      MOVE 0003            TO WKS-E-GBNP-SEC                                  
187846                              WKS-SEC-ARC                                     
187848   ELSE                                                                       
187850      MOVE WKS-PARAM-SEC   TO WKS-E-GBNP-SEC                                  
187856                              WKS-SEC-ARC.                                    
187858   MOVE WKS-FEC-BASE       TO WKS-E-GBNP-FEC                                  
187862   MOVE WKS-CSI-BASE       TO WKS-E-GBNP-CSI                                  
187866   MOVE 0                  TO WKS-CONTADOR                                    
187870                              WKS-HI-CAMP                                     
187872                              WKS-HI-PROCE                                    
187874                              WKS-HI-LEIDOS.                                  
187875   CHANGE ATTRIBUTE TITLE OF ARC-GBNP TO WKS-ETIQ-GBNP.                       
187880   CHANGE ATTRIBUTE NEWFILE OF ARC-GBNP TO VALUE FALSE.                       
187900   OPEN OUTPUT ARC-GBNP.                                                      
188000   PERFORM 20004000-HORA-MAQ.                                                 
188020   STRING "INICIA GENERACION DE ARCHIVO DE SALDOS SECUENCIAL : ",             
188040           WKS-SEC-ARC                                                        
188060          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
188080   PERFORM 20004001-ESCRIBE-MSN.                                              
188100                                                                              
188400                                                                              
188500 20007000-EXIT.                                                               
188600    EXIT.                                                                     
188700                                                                              
188800***********************************************************                   
188900* GRABO LOS HEADERS DE LOS ARCHIVOS QUE SE VAN A GENERAR                      
189000***********************************************************                   
189100 20008000-HEADERS.                                                            
189200   IF WKS-SEC-ARC = 0001                                                      
189300      MOVE "Gen. Arch. De Sdos GBNP #1"  TO W77-ID-TXTA-LIB                   
189400      MOVE "Gen. Arch. De Sdos GBNP #1"  TO W77-ID-NOMB-LIB                   
189500      MOVE WKS-NUMACT-LIB(106)           TO W77-ID-ACTXX-MAPLI                
189600   ELSE                                                                       
189700   IF WKS-SEC-ARC = 0002                                                      
189800      MOVE "Gen. Arch. De Sdos GBNP #2"  TO W77-ID-TXTA-LIB                   
189900      MOVE "Gen. Arch. De Sdos GBNP #2"  TO W77-ID-NOMB-LIB                   
190000      MOVE WKS-NUMACT-LIB(108)           TO W77-ID-ACTXX-MAPLI                
190100   ELSE                                                                       
190200      MOVE "Gen. Arch. De Sdos GBNP #3"  TO W77-ID-TXTA-LIB                   
190300      MOVE "Gen. Arch. De Sdos GBNP #3"  TO W77-ID-NOMB-LIB                   
190400      MOVE WKS-NUMACT-LIB(109)           TO W77-ID-ACTXX-MAPLI.               
190500   PERFORM 70000910-INIACT-MAPLI.                                             
190510   PERFORM 20004000-HORA-MAQ.                                                 
190512   IF WS-S038L035-RESULT > 0                                                  
190514      INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                      
190516      MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                          
190518   ELSE                                                                       
190520      STRING "INICIA ACTIVIDAD EN MAPLI : ", W77-ID-ACTXX-MAPLI,              
190530         " DEL ARCHIVO SECUENCIAL : ", WKS-SEC-ARC                            
190540          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
190550   PERFORM 20004001-ESCRIBE-MSN.                                              
190600   MOVE WKS-CSI                  TO  WKS-HDR-GBNP-CSI.                        
191000   MOVE WKS-SEC-ARC              TO  WKS-HDR-GBNP-SEC.                        
191010   MOVE WKS-FEC-BASE             TO  WS-FECVAL-AMD.                           
191020   MOVE WS-FEC-VAL-AA            TO  WS-F-GBNP-YYYY                           
191030   MOVE WS-FEC-VAL-MM            TO  WS-F-GBNP-MM.                            
191040   MOVE WS-FEC-VAL-DD            TO  WS-F-GBNP-DD.                            
191050   MOVE WKS-FEC-BASE            TO  WKS-HDR-GBNP-FEC                          
191060   WRITE REG-GBNP FROM WKS-HDR-GBNP.                                          
191200 20008000-EXIT.                                                               
191300    EXIT.                                                                     
191400                                                                              
191500***********************************************************                   
192500***********************************************************                   
192600* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
192700* DE PROCESO RESTANDOLE UN DIA A LA FECHA QUE YA HABIA SIDO PROY.             
192800***********************************************************                   
192900 40000000-CALL-FECPRO.                                                        
193000     PERFORM 20000006-LOCSUP.                                                 
193100     IF WS-S006-FUNCION > 0                                                   
193200        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
193300        STRING "ERROR AL ACCESAR LOCSUP",   WS-MSG-RS                         
193400        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
193500        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
193600        MOVE WS-0101-TEXT-MSG          TO WKS-R01-L06-MSN                     
193620        PERFORM 70000050-MENSAJE                                              
193650        PERFORM 20004000-HORA-MAQ                                             
193660        PERFORM 20004001-ESCRIBE-MSN.                                         
193700 40000000-EXIT.                                                               
193800     EXIT.                                                                    
193900                                                                              
194000***********************************************************                   
196000                                                                              
196100***********************************************************                   
196200*     EJECUCION  DE  LAS  RUTINAS                                             
196300*     PRINCIPALES  DEL PROCESO.                                               
196400***********************************************************                   
196500 50000000-PROCESOS.                                                           
196600     PERFORM 20004000-HORA-MAQ                                                
196700     MOVE WS-HORA-HHMMSSCC  TO WKS-HI-HRIN                                    
196750                                                                              
196820     SET S500B03CONTRATOS TO BEGINNING.                                       
196840     PERFORM 50001000-GENERA-A-GBNP THRU 50001000-EXIT.                       
197100     PERFORM 50002000-GENERA-TRA.                                             
197500     PERFORM 50003000-ENVIA-ARCHIVOS.                                         
197600     PERFORM 50004000-VA-SEC2 UNTIL WKS-BAND = 1.                             
197700 50000000-EXIT.                                                               
197800     EXIT.                                                                    
197900                                                                              
198000***********************************************************                   
198100* GENERACION DEL ARCHIVO DE GBNP                                              
198200***********************************************************                   
198205 50001000-GENERA-A-GBNP.                                                      
198210     PERFORM  90000003-B03CONTRATOS-FINDF.                                    
198212     MOVE WS-STATUS-BASE      TO WKS-NOTF                                     
198215     IF WS-DB-NOTFOUND                                                        
198226        MOVE 1            TO WKS-NOTF                                         
198228        STRING "NO HAY REGISTROS EN B03 "                                     
198230          DELIMITED BY SIZE INTO WKS-R01-L06-MSN                              
198232        PERFORM 20004001-ESCRIBE-MSN                                          
198234     ELSE                                                                     
198236        ADD 1              TO WKS-HI-LEIDOS                                   
198238        PERFORM 50002000-VALIDA-CTO UNTIL WKS-NOTF = 1.                       
198240        MOVE 0                   TO WKS-BAND.                                 
198245 50001000-EXIT.                                                               
198250     EXIT.                                                                    
198260                                                                              
198270 50002000-GENERA-TRA.                                                         
198280     MOVE WKS-CONTADOR        TO WKS-TRL-GBNP-TOTRE                           
198290     WRITE REG-GBNP FROM WKS-TRL-GBNP.                                        
198292     PERFORM 20004000-HORA-MAQ                                                
198294     STRING "TERMINA GENERACION DE ARCHIVO SECUENCIAL: ",                     
198296               WKS-SEC-ARC                                                    
198298          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
198300     PERFORM 20004001-ESCRIBE-MSN.                                            
198302     IF WKS-SEC-ARC = 0001                                                    
198304        MOVE WKS-NUMACT-LIB(106)         TO W77-ID-ACTXX-MAPLI                
198306     ELSE                                                                     
198308     IF WKS-SEC-ARC = 0002                                                    
198310        MOVE WKS-NUMACT-LIB(108)         TO W77-ID-ACTXX-MAPLI                
198312     ELSE                                                                     
198314        MOVE WKS-NUMACT-LIB(109)         TO W77-ID-ACTXX-MAPLI.               
198316     MOVE W77-ID-ACTXX-MAPLI             TO WKS-ACTI.                         
198318     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
198320     PERFORM 20004000-HORA-MAQ                                                
198322     IF WS-S038L035-RESULT > 0                                                
198324        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
198326        MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                        
198328     ELSE                                                                     
198330       STRING "TERMINA ACTIVIDAD EN MAPLI : ", WKS-ACTI,                      
198332            " DEL ARCHIVO SECUENCIAL : ", WKS-SEC-ARC                         
198334          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
198336     PERFORM 20004001-ESCRIBE-MSN.                                            
198338                                                                              
198340     PERFORM 50000200-ACT-B02.                                                
198342                                                                              
198344     PERFORM 20004000-HORA-MAQ                                                
198346     MOVE WS-HORA-HHMMSSCC     TO WKS-HI-HR.                                  
198348     MOVE "INF"                TO  WKS-HI-TEX00.                              
198350                                                                              
198352     MOVE WKS-HI-TEXTO         TO WKS-R01-L06-MSN                             
198354     PERFORM 20004000-HORA-MAQ.                                               
198356     PERFORM 20004001-ESCRIBE-MSN.                                            
198358     CLOSE ARC-GBNP     WITH SAVE.                                            
198360                                                                              
198362                                                                              
198364 50003000-ENVIA-ARCHIVOS.                                                     
198366     MOVE WKS-FEC-BASE        TO WS-WFLP197-FECHA.                            
198368     MOVE WKS-E-GBNP-SEC      TO WS-WFLP197-SEC.                              
198370     MOVE "ENVIAGBNPSDOS"     TO WS-WFLP197-PARAM.                            
198372     CALL SYSTEM WFL USING WS-WFLP197.                                        
198374                                                                              
198376     PERFORM 20004000-HORA-MAQ.                                               
198378     STRING "SE ENVIA ARCHIVO CON FECHA: ", WS-WFLP197-FECHA,                 
198380            " SECUENCIAL: ", WS-WFLP197-SEC,                                  
198382            " PARAMETRO: ", WS-WFLP197-PARAM                                  
198384          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
198386     PERFORM 20004001-ESCRIBE-MSN.                                            
198388                                                                              
198472 50002400-FNDNEXT.                                                            
198480     PERFORM  90000003-B03CONTRATOS-FINDN.                                    
198500     IF WS-DB-NOTFOUND                                                        
198510       PERFORM 20004000-HORA-MAQ                                              
198520       STRING "NO HAY MAS REGISTROS EN B03 "                                  
198540            DELIMITED BY SIZE INTO WKS-R01-L06-MSN                            
198560       PERFORM 20004001-ESCRIBE-MSN                                           
198580         MOVE 1            TO WKS-NOTF                                        
198585     ELSE                                                                     
198590        ADD 1              TO WKS-HI-LEIDOS.                                  
198600 50002000-VALIDA-CTO.                                                         
198620     MOVE LOW-VALUES       TO REG-GBNP                                        
198640                              WKS-DET-GBNP.                                   
198650     MOVE 0                TO WKS-TIP-CORT-ANT.                               
198652     IF B03-MARCA-CLON = 2 OR 3                                               
198654        NEXT SENTENCE                                                         
198656     ELSE                                                                     
198660     IF B03-GBNP-SERV-IND > 0                                                 
198680        PERFORM 50002100-MUEV-DET                                             
198700        MOVE B03-NUM-PRODUCTO        TO WS-NUM-PRODUCT                        
198720        MOVE B03-NUM-INSTRUM         TO WS-NUM-INSTRUME                       
198725        MOVE B03-MONEDA              TO WS-MON                                
198730        MOVE 0                       TO WS-IND-TB05                           
198735                                        WS-TB05-FIN                           
198740        PERFORM 50002220-BUSCA-PRODINST VARYING WS-IND-TB05                   
198750                FROM 1 BY 1 UNTIL WS-IND-TB05 > 30 OR                         
198755                WS-TB05-FIN =1                                                
198760        PERFORM 50002205-VALIDA-DIA-CORTE                                     
198780        PERFORM 50002200-RECORD-STAT                                          
198800        PERFORM 50002300-CALCULA-SALDO                                        
198820        ADD 1                    TO WKS-HI-PROCE                              
198830                                    WKS-CONTADOR                              
198840        WRITE REG-GBNP FROM WKS-DET-GBNP.                                     
198860                                                                              
198880     PERFORM 50002400-FNDNEXT.                                                
198900                                                                              
198920 50002100-MUEV-DET.                                                           
198940     MOVE "DET"               TO WKS-DET-GBNP-ID.                             
199000     MOVE 485                 TO WKS-DET-GBNP-BRCO.                           
199020     MOVE WKS-FEC-BASE        TO WS-FECHA-PRO-DMA                             
199060     MOVE WS-PRO-DD1          TO WS-F-GBNP-DD                                 
199080     MOVE WS-PRO-MM1          TO WS-F-GBNP-MM                                 
199100     MOVE WS-PRO-AA1          TO WS-F-GBNP-YYYY                               
199120     MOVE WS-FECHA-PRO-DMA    TO WKS-DET-GBNP-FECAP.                          
199130     MOVE 0000                TO WKS-FILLER-CTO                               
199131                                 WKS-DET-GBNP-SUC.                            
199132     MOVE "~"                 TO WKS-DET-FILLER-1                             
199134                                 WKS-DET-FILLER-2                             
199136                                 WKS-DET-FILLER-3                             
199138                                 WKS-DET-FILLER-4                             
199140                                 WKS-DET-FILLER-5                             
199142                                 WKS-DET-FILLER-6                             
199144                                 WKS-DET-FILLER-7                             
199146                                 WKS-DET-FILLER-8.                            
199150                                                                              
199152     IF B03-MONEDA = 01                                                       
199160        MOVE "MXN"            TO WKS-DET-GBNP-MON                             
199180     ELSE                                                                     
199200     IF B03-MONEDA = 05                                                       
199220        MOVE "USD"            TO WKS-DET-GBNP-MON.                            
199240     MOVE B03-NUM-CONTRATO    TO WKS-DET-GBNP-CTO.                            
199260*     MOVE B03-SUC-PROMOTORA   TO WKS-DET-GBNP-SUC.                           
199270                                                                              
199280 50002200-RECORD-STAT.                                                        
199300     IF B03-STATUS = 0 OR 1 OR 5                                              
199320        MOVE "N"              TO WKS-DET-GBNP-STAT                            
199340     ELSE                                                                     
199360     IF B03-STATUS = 2 OR 3 OR 4                                              
199380        MOVE "C"              TO WKS-DET-GBNP-STAT                            
199385     ELSE                                                                     
199390        MOVE " "              TO WKS-DET-GBNP-STAT.                           
199400     PERFORM 50002210-VALIDA-CAM-PROD.                                        
199420                                                                              
199440 50002205-VALIDA-DIA-CORTE.                                                   
199700     MOVE ZERO     TO W77-HOY-CORTA.                                          
199720                                                                              
199740     IF B03-DIA-CORTE-ANT  > 0                                                
199760        MOVE B03-DIA-CORTE-ANT TO WKS-DIA-CORTE                               
199780        PERFORM 50114100-ARMA-FEC-CORTE                                       
199800        MOVE WS-FECHA-PTE   TO WKS-FEC-PTE-B                                  
199820        MOVE WS-FECHA-PTE   TO WKS-FECORTE-DANT                               
199840     ELSE                                                                     
199860        MOVE 99999999       TO WKS-FEC-PTE-B                                  
199880                               WKS-FECORTE-DANT.                              
199900                                                                              
199920     MOVE B03-DIA-CORTE  TO WKS-DIA-CORTE                                     
199940     PERFORM 50114100-ARMA-FEC-CORTE.                                         
199960     MOVE WS-FECHA-PTE   TO WKS-FECORTE-DNVO.                                 
199980                                                                              
200000     IF WKS-FEC-PTE-B < WS-FECHA-PTE                                          
200020        MOVE WKS-FEC-PTE-B       TO WS-FECHA-PTE                              
200040        MOVE B03-DIA-CORTE-ANT   TO WKS-DIA-C                                 
200060     ELSE                                                                     
200080        MOVE B03-DIA-CORTE       TO WKS-DIA-C.                                
200100                                                                              
200120     IF WS-FECHA-PTE = WKS-FEC-BASE                                           
200140        MOVE 1                 TO W77-HOY-CORTA                               
200160     ELSE                                                                     
200180     IF WS-FECHA-PTE > WKS-FEC-BASE AND < WKS-FEC-PROX                        
200200        MOVE 1                 TO W77-HOY-CORTA.                              
200205                                                                              
200210     MOVE 1                TO WKS-TIP-CORT.                                   
200220     IF WKS-B05-IND-DIACORTE = 1                                              
200240        MOVE "M"              TO WKS-DET-GBNP-DICOR                           
200260        MOVE 1                TO WKS-TIP-CORT                                 
200280     ELSE                                                                     
200282     IF WKS-B05-IND-RENDDIA = 0                                               
200284        IF WKS-DIA-C = 0 OR WKS-DIA-C= 29 OR WKS-DIA-C = 30 OR                
200286            WKS-DIA-C > 30                                                    
200288           MOVE "M"            TO WKS-DET-GBNP-DICOR                          
200290        ELSE                                                                  
200292           IF B03-DIAC-GBNP > 0                                               
200294              IF B03-DIAC-GBNP = 29 OR B03-DIAC-GBNP =30                      
200296                 OR  B03-DIAC-GBNP > 30                                       
200298                 MOVE "M"            TO WKS-DET-GBNP-DICOR                    
200300              ELSE                                                            
200302                MOVE B03-DIAC-GBNP TO WKS-DET-GBNP-DICOR                      
200304           ELSE                                                               
200306               MOVE WKS-DIA-C        TO WKS-DET-GBNP-DICOR.                   
200308                                                                              
200310     IF WKS-B05-IND-RENDDIA = 1                                               
200320        MOVE "D"              TO WKS-DET-GBNP-DICOR                           
200340        MOVE 2                TO WKS-TIP-CORT.                                
200360                                                                              
200380                                                                              
200400                                                                              
200420                                                                              
200440 50114005-BUSCA-IND-CORTE.                                                    
200460     IF WS-FECHA-PTE = WKS-FEC-HOY-PCORT(W77-IND-FCOR)                        
200480        MOVE 1 TO W77-OK-INDCORT                                              
200500     ELSE                                                                     
200520     IF W77-IND-FCOR = 6                                                      
200540        MOVE 1 TO W77-OK-INDCORT  W77-IND-FCOR                                
200560     ELSE                                                                     
200580        ADD 1 TO W77-IND-FCOR.                                                
200600                                                                              
200620 50114100-ARMA-FEC-CORTE.                                                     
200640     MOVE WKS-AAAA-FBASE       TO WS-AAAA-PTE.                                
200660     MOVE WKS-MM-FBASE         TO WS-MM-PTE.                                  
200680                                                                              
200700     IF WKS-DIA-CORTE = 30 OR 38                                              
200720        MOVE WKS-TAB-DIAS-MES(WKS-MM-FBASE) TO WS-DD-PTE                      
200740     ELSE                                                                     
200760        MOVE WKS-DIA-CORTE        TO WS-DD-PTE.                               
200780                                                                              
200800     IF WS-DD-PTE < WKS-DD-FBASE                                              
200820        ADD 1               TO WS-MM-PTE                                      
200840        IF WS-MM-PTE > 12                                                     
200860           MOVE 1           TO WS-MM-PTE                                      
200880           ADD  1           TO WS-AAAA-PTE.                                   
200900                                                                              
200920 50002210-VALIDA-CAM-PROD.                                                    
201000     IF  B03-PRODUCTO-NVO > 0 AND B03-INSTRUM-NVO  > 0                        
201020         MOVE B03-PRODUCTO-NVO        TO WS-NUM-PRODUCT                       
201040         MOVE B03-INSTRUM-NVO         TO WS-NUM-INSTRUME                      
201045         MOVE B03-MONEDA              TO WS-MON                               
201050         MOVE 0                       TO WS-IND-TB05                          
201055                                         WS-TB05-FIN                          
201060         PERFORM 50002220-BUSCA-PRODINST VARYING WS-IND-TB05                  
201070                FROM 1 BY 1 UNTIL WS-IND-TB05 > 30 OR                         
201075                WS-TB05-FIN =1                                                
201080         IF B03-PRODUCTO-NVO = B03-NUM-PRODUCTO  AND                          
201100            B03-INSTRUM-NVO  = B03-NUM-INSTRUM                                
201120            NEXT SENTENCE                                                     
201140         ELSE                                                                 
201160         IF W77-HOY-CORTA = 1                                                 
201180            NEXT SENTENCE                                                     
201200         ELSE                                                                 
201220         IF B03-PRODUCTO-NVO = 9999 AND                                       
201240             B03-INSTRUM-NVO  = 9999                                          
201260             NEXT SENTENCE                                                    
201280         ELSE                                                                 
201300         IF B03-NUM-PRODUCTO = 66 AND B03-NUM-INSTRUM = 17 AND                
201320            B03-MONEDA= 1                                                     
201340            MOVE B03-NUM-CONTRATO      TO WS-NUM-CONTRATO                     
201360            PERFORM 50114003-VALIDA-B44                                       
201380             IF WS-HAY-B44 = 0                                                
201400                MOVE "P"               TO  WKS-DET-GBNP-STAT                  
201410                ADD 1                  TO  WKS-HI-CAMP                        
201420             ELSE                                                             
201440               NEXT SENTENCE                                                  
201460         ELSE                                                                 
201480         IF WKS-B05-IND-PAGOREND = 1                                          
201500            MOVE "P"                    TO  WKS-DET-GBNP-STAT                 
201510            ADD 1                       TO  WKS-HI-CAMP                       
201520         ELSE                                                                 
201540            MOVE "R"                    TO  WKS-DET-GBNP-STAT                 
201542            ADD 1                       TO  WKS-HI-CAMP .                     
201544         IF WKS-DET-GBNP-STAT = "P" OR "R"                                    
201545            MOVE WKS-TIP-CORT            TO WKS-TIP-CORT-ANT                  
201546            IF WKS-B05-IND-RENDDIA = 1                                        
201548               MOVE "D"              TO WKS-DET-GBNP-DICOR                    
201550               MOVE 2                TO WKS-TIP-CORT                          
201552            ELSE                                                              
201554              MOVE 1                TO WKS-TIP-CORT                           
201556              IF WKS-B05-IND-DIACORTE = 1                                     
201558                 MOVE "M"              TO WKS-DET-GBNP-DICOR                  
201560                                                                              
201562              ELSE                                                            
201564                IF WKS-DIA-C = 0 OR WKS-DIA-C= 29 OR                          
201566                   WKS-DIA-C = 30 OR  WKS-DIA-C > 30                          
201568                   MOVE "M"            TO WKS-DET-GBNP-DICOR                  
201570                ELSE                                                          
201572                 IF B03-DIAC-GBNP > 0                                         
201574                   IF B03-DIAC-GBNP = 29 OR                                   
201576                      B03-DIAC-GBNP =30 OR                                    
201578                       B03-DIAC-GBNP > 30                                     
201580                   MOVE "M"            TO WKS-DET-GBNP-DICOR                  
201582                  ELSE                                                        
201584                   MOVE B03-DIAC-GBNP TO WKS-DET-GBNP-DICOR                   
201586                   ELSE                                                       
201588                 MOVE WKS-DIA-C        TO WKS-DET-GBNP-DICOR.                 
201590                                                                              
201592 50114003-VALIDA-B44.                                                         
201600*====================                                                         
201620  PERFORM 90000044-B44SXCTOSEVOL-FIND.                                        
201640  IF WS-STATUS-BASE > 0                                                       
201660     IF WS-STATUS-BASE = 1                                                    
201680        MOVE 1   TO  WS-HAY-B44                                               
201700        MOVE 0   TO  WS-STATUS-BASE                                           
201720     ELSE                                                                     
201740        STRING "ERROR AL HACER FIND A B44 ",   WS-STATUS-BASE                 
201760        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
201780        PERFORM 70000050-MENSAJE                                              
201790        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
201800        MOVE WS-0101-TEXT-MSG          TO WKS-R01-L06-MSN                     
201810        PERFORM 20004000-HORA-MAQ                                             
201820        PERFORM 20004001-ESCRIBE-MSN.                                         
205000                                                                              
212100 50002220-BUSCA-PRODINST.                                                     
212200     IF WS-TB05-PRD(WS-IND-TB05) = WS-NUM-PRODUCT AND                         
212300        WS-TB05-INS(WS-IND-TB05) = WS-NUM-INSTRUME  AND                       
212350        WS-TB05-MON(WS-IND-TB05) = WS-MON                                     
212400        MOVE WS-TB05-DIAC(WS-IND-TB05)    TO WKS-B05-IND-DIACORTE             
212500        MOVE WS-TB05-RENDIA(WS-IND-TB05)  TO WKS-B05-IND-RENDDIA              
212600        MOVE WS-TB05-PAGOREN(WS-IND-TB05) TO WKS-B05-IND-PAGOREND             
212700        MOVE  1               TO WS-TB05-FIN.                                 
212800                                                                              
213000 50002300-CALCULA-SALDO.                                                      
214000      MOVE ZEROS                      TO WKS-SALDO-GBNP.                      
215000      IF WKS-SEC-ARC = 0001 OR 0002                                           
216000         IF B03-SDO-PENDIENTE > 0                                             
217000            ADD B03-SDO-PENDIENTE      TO B03-SDO-ACTUAL.                     
218000      IF (WKS-TIP-CORT = 2  OR WKS-TIP-CORT-ANT = 2 ) AND                     
218500         WKS-PARAM = 1                                                        
219000        MOVE ZERO                  TO WS-IND-DIAINH                           
220000                                      WS-SUM-SDO-INHAB                        
221000        PERFORM  20520205-SUMA-SDOINHAB                                       
222000                 WS-DIAS-INHAXCTO  TIMES                                      
223000        COMPUTE WKS-SALDO-GBNP =                                              
224000              ((B03-SDO-ACTUAL + B03-SDOPROT-BLOQ) +                          
225000                WS-SUM-SDO-INHAB) / WS-DIAS-INHAXCTO                          
225500                MOVE WKS-SALDO-GBNP    TO WKS-SALDO-PEND                      
226000      ELSE                                                                    
227000        COMPUTE WKS-SALDO-GBNP =                                              
228000              (B03-SDO-ACTUAL + B03-SDOPROT-BLOQ)                             
228100               MOVE WKS-SALDO-GBNP    TO WKS-SALDO-PEND.                      
228200                                                                              
230000      MOVE WKS-SALDO-GBNP        TO WKS-DET-GBNP-SDO                          
231000                                    WKS-DET-GBNP-LOBAL.                       
231500      INSPECT WKS-DET-GBNP-SDO   REPLACING LEADING SPACES BY "0".             
232000      INSPECT WKS-DET-GBNP-LOBAL REPLACING LEADING SPACES BY "0".             
232200                                                                              
233000 20520205-SUMA-SDOINHAB.                                                      
234000    ADD 1 TO WS-IND-DIAINH.                                                   
235000    IF WS-DIAS-INHAXCTO = WS-IND-DIAINH                                       
236000       NEXT SENTENCE                                                          
237000    ELSE                                                                      
238000       ADD B03-SDOFIN-INHAB(WS-IND-DIAINH)                                    
239000       TO WS-SUM-SDO-INHAB.                                                   
240000                                                                              
286200 70000000-CIERRO.                                                             
287100     CLOSE  S500BD01CAPTACION ON EXCEPTION                                    
287200            MOVE "ERROR CLOSE BASE" TO WS-0101-TEXT-MSG                       
287300       PERFORM 70000050-MENSAJE                                               
287310       INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                     
287320       MOVE WS-0101-TEXT-MSG        TO WKS-R01-L06-MSN                        
287340       PERFORM 20004001-ESCRIBE-MSN.                                          
287400    IF WS-MAPLI-CALL-INICIO-VA = 9                                            
287500       PERFORM 7000000-FIN-MAPLI.                                             
287510         PERFORM 20004000-HORA-MAQ                                            
287520     STRING "FIN PROCESO",                                                    
287530          " FECHA: ", W77-FECHA-EDIT,                                         
287540          " HORA: ",  WS-HORA-HHMMSSCC                                        
287550          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
287560      PERFORM 20004001-ESCRIBE-MSN.                                           
287600                                                                              
287700 70000000-EXIT.                                                               
287800     EXIT.                                                                    
287900 50004000-VA-SEC2.                                                            
287902     IF WKS-FIN = 0                                                           
287904        IF WKS-MAPLI = 0                                                      
287905          PERFORM 20004000-HORA-MAQ                                           
287910          STRING "INICIA VALIDACION DE TERMINO P105"                          
287915             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
287920          PERFORM 20004001-ESCRIBE-MSN                                        
287925          MOVE "Termina P105              "  TO W77-ID-TXTA-LIB               
287930          MOVE "Termina P105              "  TO W77-ID-NOMB-LIB               
287935          MOVE WKS-NUMACT-LIB(107)           TO W77-ID-ACTXX-MAPLI            
287940          MOVE 1                             TO WKS-MAPLI                     
287945          PERFORM 70000910-INIACT-MAPLI                                       
287950          PERFORM 20004000-HORA-MAQ                                           
287955          IF WS-S038L035-RESULT > 0                                           
287960             INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "               
287965             MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                   
287970             PERFORM 20004001-ESCRIBE-MSN                                     
287975         ELSE                                                                 
287980           STRING "INICIA MONITOREO MAPLI DE TERMINO P105, ACTI:",            
287985                 W77-ID-ACTXX-MAPLI                                           
287990             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
287995          PERFORM 20004001-ESCRIBE-MSN.                                       
288000                                                                              
288005     IF WKS-FIN = 0                                                           
288010       PERFORM 90000000-B00CTRLPASO-FIND                                      
288015       IF B00-NUM-PASO-01 = 105 AND B00-NUM-PASO-02 = 105 AND                 
288020          B00-NUM-PASO-03 = 105                                               
288025          PERFORM 20004000-HORA-MAQ                                           
288030          STRING "TERMINA VALIDACION DE TERMINO P105",                        
288035             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
288040          PERFORM 20004001-ESCRIBE-MSN                                        
288045          MOVE 1                 TO WKS-SEC2                                  
288050                                    WKS-BAND                                  
288055          ADD 1                  TO WKS-FIN                                   
288060          MOVE WKS-NUMACT-LIB(107)         TO W77-ID-ACTXX-MAPLI              
288065          PERFORM 70000910-FIN-ACTI-MAPLI                                     
288070          PERFORM 20007000-OPEN-ARC     THRU 20007000-EXIT                    
288075          PERFORM 20008000-HEADERS      THRU 20008000-EXIT                    
288080          PERFORM 20004000-HORA-MAQ                                           
288085          IF WS-S038L035-RESULT > 0                                           
288090             INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "               
288095             MOVE WS-0101-TEXT-MSG       TO WKS-R01-L06-MSN                   
288100             PERFORM 20004001-ESCRIBE-MSN                                     
288105         ELSE                                                                 
288110          STRING "FIN MONITOREO MAPLI DE TERMINO P105, ACTI:",                
288115                 W77-ID-ACTXX-MAPLI                                           
288120             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
288125          PERFORM 20004001-ESCRIBE-MSN                                        
288240       ELSE                                                                   
288260        WAIT(30)                                                              
288280     ELSE                                                                     
288300        MOVE 1                   TO WKS-BAND                                  
288400        ADD 1                    TO WKS-FIN.                                  
295700                                                                              
295702 20006000-INICIA-MAPLI.                                                       
295704     MOVE 1                       TO W77-ID-NUM-COPIA-MAPLI.                  
295706     MOVE 2                       TO W77-ID-TPODSP-INFO-MAPLI.                
295708     MOVE 3                       TO W77-ID-ESINI-GRUPO-MAPLI.                
295710     MOVE 3                       TO W77-ID-NUM-GRUPO-MAPLI.                  
295712     MOVE "INICIA MONITOREO DE SALDOS GBNP  "                                 
295714                                  TO W77-ID-NOMB-LIB.                         
295716     PERFORM 70000950-INI-PGM-MAPLI.                                          
295718     IF WS-S038L035-RESULT > 0                                                
295720        IF WS-S038L035-RESULT = 99                                            
295722           MOVE 1         TO WS-MAPLI-CALL-INICIO-VA                          
295724           IF WS-MAPLI-ERROR99-1RA-VEZ                                        
295726              MOVE 1      TO WS-MAPLI-ERROR99-1RA-VEZ-VA                      
295728              MOVE WS-S038L035-RESULT   TO WS-MAPLI-RESULT-FMT                
295730              STRING "(PROGRAMA INICIO) LIBRERIA MAPLI EN CAMBIO "            
295732                     "DE VERSIONES O EN CONTINGENCIA, RESULT : "              
295734                     WS-MAPLI-RESULT-FMT                                      
295736                     " <" WS-S038L035-01-ENTRADA ">"                          
295738                     DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                  
295740              MOVE WS-0101-TEXT-MSG TO WKS-R01-L06-MSN                        
295742              PERFORM 70000050-MENSAJE                                        
295744              PERFORM 20004000-HORA-MAQ                                       
295746              PERFORM 20004001-ESCRIBE-MSN                                    
295748           ELSE                                                               
295750              NEXT SENTENCE                                                   
295752        ELSE                                                                  
295754           MOVE 2                    TO WS-MAPLI-CALL-INICIO-VA               
295756           MOVE WS-S038L035-RESULT   TO WS-MAPLI-RESULT-FMT                   
295758           STRING "(PROGRAMA INICIO) ERROR CALL MAPLI RESULT: "               
295760                  WS-MAPLI-RESULT-FMT                                         
295762                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
295764           INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                 
295766           MOVE WS-0101-TEXT-MSG TO WKS-R01-L06-MSN                           
295768           PERFORM 70000050-MENSAJE                                           
295770           PERFORM 20004000-HORA-MAQ                                          
295772           PERFORM 20004001-ESCRIBE-MSN                                       
295774     ELSE                                                                     
295776        MOVE 9    TO WS-MAPLI-CALL-INICIO-VA                                  
295778        PERFORM 20004000-HORA-MAQ                                             
295780        STRING "LIBRERIA MAPLI INCIALIZADA"                                   
295782                DELIMITED BY SIZE INTO WKS-R01-L06-MSN                        
295784        PERFORM 20004001-ESCRIBE-MSN.                                         
295786                                                                              
295788 7000000-FIN-MAPLI.                                                           
295790     PERFORM 70000950-FIN-PGM-MAPLI.                                          
295792     IF WS-S038L035-RESULT > 0                                                
295794        MOVE WS-S038L035-RESULT   TO WS-MAPLI-RESULT-FMT                      
295796        STRING "(PROGRAMA FIN) ERROR CALL MAPLI RESULT: "                     
295798               WS-MAPLI-RESULT-FMT                                            
295800               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
295802        PERFORM 70000050-MENSAJE                                              
295804        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
295806        MOVE WS-0101-TEXT-MSG    TO WKS-R01-L06-MSN                           
295808        PERFORM 20004000-HORA-MAQ                                             
295810        PERFORM 20004001-ESCRIBE-MSN                                          
295812     ELSE                                                                     
295814        STRING "FINALIZA MAPLI"                                               
295816               DELIMITED BY SIZE INTO WKS-R01-L06-MSN                         
295818        PERFORM 20004000-HORA-MAQ                                             
295820        PERFORM 20004001-ESCRIBE-MSN.                                         
295822 50000200-ACT-B02.                                                            
295824     PERFORM 90000000-BEGIN-TRANSACTION.                                      
295826     IF WS-STATUS-BASE > 0                                                    
295828        STRING "NO SE PUDO HACER BEGIN TRANSACTION"                           
295830               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
295832        PERFORM 70000050-MENSAJE                                              
295834        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
295836        MOVE WS-0101-TEXT-MSG    TO WKS-R01-L06-MSN                           
295838        PERFORM 20004000-HORA-MAQ                                             
295840        PERFORM 20004001-ESCRIBE-MSN                                          
295842        EXIT PERFORM.                                                         
295844                                                                              
295846     PERFORM 90000002-B02CONTROL-LOCK.                                        
295848     IF B02-GBNP-SALDOS-FEC =  WKS-FEC-BASE                                   
295850        NEXT SENTENCE                                                         
295852     ELSE                                                                     
295854        MOVE WKS-FEC-BASE        TO B02-GBNP-SALDOS-FEC                       
295856                                    WKS-FECHA.                                
295858     MOVE WKS-SEC-ARC            TO B02-GBNP-SALDOS-SEC.                      
295860     PERFORM 90000002-B02CONTROL-STORE.                                       
295865     IF WS-STATUS-BASE > 0                                                    
295870        STRING "ERR STORE FIN B02CONTROL ",                                   
295875               " STA DB=" WS-STATUS-BASE                                      
295880               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
295882        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
295885        MOVE WS-0101-TEXT-MSG    TO WKS-R01-L06-MSN                           
295890        PERFORM 20004000-HORA-MAQ                                             
295895        PERFORM 20004001-ESCRIBE-MSN                                          
295900        PERFORM 70000050-MENSAJE.                                             
295905     PERFORM 90000000-END-TRANSACTION.                                        
295910     IF WS-STATUS-BASE > 0                                                    
295915        STRING "NO SE PUDO HACER END TRANSACTION"                             
295920               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
295925        PERFORM 70000050-MENSAJE                                              
295926        INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                    
295930        MOVE WS-0101-TEXT-MSG    TO WKS-R01-L06-MSN                           
295935        PERFORM 20004000-HORA-MAQ                                             
295940        PERFORM 20004001-ESCRIBE-MSN.                                         
295945     IF WS-STATUS-BASE = 0                                                    
295950        PERFORM 20004000-HORA-MAQ                                             
295955        STRING "SE ACTUALIZA B02 CON FECHA = ", WKS-FECHA                     
295960               " SECUENCIAL =", WKS-SEC-ARC                                   
295965          DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                             
295970        PERFORM 20004001-ESCRIBE-MSN.                                         
295975                                                                              
295980                                                                              
295985                                                                              
296036 20005000-CARGA-B05.                                                          
296038     SET S500B05INSTRUMEN      TO BEGINNING.                                  
296040     MOVE 0                    TO WS-EOF-B05                                  
296042                                  WS-IND-B05.                                 
296044     PERFORM 20004000-HORA-MAQ.                                               
296048     STRING "INICIA CARGA DE PRODUCTOS/INSTRUMENTOS"                          
296050           DELIMITED BY SIZE INTO WKS-R01-L06-MSN.                            
296052     PERFORM 20004001-ESCRIBE-MSN.                                            
296054     PERFORM 90000005-B05INSTRUMEN-FINDF.                                     
296056     IF WS-STATUS-BASE > 0                                                    
296058       MOVE "ERROR NO HAY INFORMACION EN B05" TO WS-0101-TEXT-MSG             
296060       PERFORM 70000050-MENSAJE                                               
296062       PERFORM 20004000-HORA-MAQ                                              
296064       INSPECT WS-0101-TEXT-MSG REPLACING ALL @00@ BY " "                     
296066       MOVE WS-0101-TEXT-MSG  TO WKS-R01-L06-MSN                              
296068       PERFORM 20004001-ESCRIBE-MSN                                           
296070     ELSE                                                                     
296072       PERFORM 20005100-LLENA-B05 UNTIL WS-EOF-B05 =1                         
296074       PERFORM 20004000-HORA-MAQ                                              
296076       STRING "TERMINA CARGA DE PRODUCTOS/INSTRUMENTOS"                       
296078             DELIMITED BY SIZE INTO WKS-R01-L06-MSN                           
296080       PERFORM 20004001-ESCRIBE-MSN.                                          
296082 20005000-EXIT.                                                               
296084      EXIT.                                                                   
296086 20005100-LLENA-B05.                                                          
296088     ADD 1                    TO WS-IND-B05.                                  
296090     IF WS-IND-B05 > 30                                                       
296092       MOVE "MAS DE 30 REGISTROS EN B05" TO WS-0101-TEXT-MSG                  
296094       PERFORM 70000050-MENSAJE                                               
296096       MOVE 1             TO WS-EOF-B05                                       
296098     ELSE                                                                     
296100       MOVE B05-NUM-PRODUCTO     TO WS-TB05-PRD(WS-IND-B05)                   
296105       MOVE B05-NUM-INSTRUM      TO WS-TB05-INS(WS-IND-B05)                   
296106       MOVE B05-MONEDA           TO WS-TB05-MON(WS-IND-B05)                   
296110       MOVE B05-IND-PAGOREND     TO WS-TB05-PAGOREN(WS-IND-B05)               
296115       MOVE B05-IND-DIACORTE     TO WS-TB05-DIAC(WS-IND-B05)                  
296120       MOVE B05-IND-RENDDIA      TO WS-TB05-RENDIA(WS-IND-B05)                
296125       PERFORM 90000005-B05INSTRUMEN-FINDN                                    
296130       IF WS-STATUS-BASE > 0                                                  
296135         IF WS-DB-NOTFOUND                                                    
296140           MOVE 1             TO WS-EOF-B05                                   
296145         ELSE                                                                 
296150          MOVE "ERROR EN FIND NEXT B05" TO WS-0101-TEXT-MSG                   
296155          PERFORM 70000050-MENSAJE                                            
296160          MOVE 1              TO WS-EOF-B05.                                  
296165                                                                              
296170***********************************************************                   
296175* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
296180***********************************************************                   
296200 COPY "S500/INC/PRO/25MTP002".                                                
296300 COPY "S500/INC/MAPLI/PRO/15MTP001 ".                                         
296400***********************************************************                   
