000100                                                                              
000200******************************************************************            
000300*                                                                *            
000400*                  INFORME DE CAMBIO DE DIA                      *            
000500*      ====================================================      *            
000600*                                                                *            
000700*      OBJETIVO : ENVIAR NOTIFICACION DE CAMBIO DE DIA AL P080   *            
000800*                 POR MEDIO DE LA LIBRERIA L080                  *            
000900*                                                                *            
001000******************************************************************            
001100*                                                                             
001200 IDENTIFICATION DIVISION.                                                     
001300*========================                                                     
001400 PROGRAM-ID. P075.                                                            
001500                                                                              
001600*                                                                             
001700 ENVIRONMENT DIVISION.                                                        
001800*=====================                                                        
001900                                                                              
002000*                                                                             
002100 DATA DIVISION.                                                               
002200*==============                                                               
002300                                                                              
002400*                                                                             
002500 WORKING-STORAGE SECTION.                                                     
002600*------------------------                                                     
002700                                                                              
002800*****************************************************************             
002900*                         LIBRERIA L080                         *             
003000*                                                               *             
003100*    (S500)S500/OBJECT/L080/XXXXXXX/21MTP001 ON CAPTACION       *             
003200*                                                               *             
003300* ENTRYPOINTS:                                                  *             
003400* - INIBATCH: REALIZA EL PROCESO DE CAMBIO DE DIA               *             
003500*                                                               *             
003600*   * DATOS DE ENTRADA :                                        *             
003700*   * DATOS DE SALIDA  :                                        *             
003800*     > WS-S500-RESULTADO                                       *             
003900*****************************************************************             
004000 77 WKS-88-S500L080               PIC 99 COMP VALUE 0.                        
004100 77 WKS-L080-RESULT               PIC 9(02).                                  
004200                                                                              
004300 77 W77-PARAM-WFL                 PIC 9(01) RECEIVED BY CONTENT.              
004400 01 WS-HORA-MAQUINA               PIC 9(08).                                  
004500 01 WS-HORA-MAQUINA-R REDEFINES WS-HORA-MAQUINA.                              
004600    02 WS-HORA-MAQ-HMS            PIC 9(06).                                  
004700    02 WS-HORA-MAQ-HMS-R REDEFINES WS-HORA-MAQ-HMS.                           
004800       03 WS-HORA-MAQ-HM          PIC 9(04).                                  
004900       03 WS-HORA-MAQ-HM-R REDEFINES WS-HORA-MAQ-HM.                          
005000          04 WS-HORA-MAQ-HH       PIC 99.                                     
005100          04 WS-HORA-MAQ-MM       PIC 99.                                     
005200       03 WS-HORA-MAQ-SS          PIC 99.                                     
005300    02 WS-HORA-MAQ-CC             PIC 99.                                     
005400 77 WS-HORA-MAQ-SSS               PIC 9(05).                                  
005500 77 W77-USO-LIBLJ              PIC 9      VALUE 0.                            
005600 01 WS-0101-MENSAJE.                                                          
005700     02 WS-0101-CODI-MSG    PIC 9(06)  VALUE 051010.                          
005800     02 FILLER              PIC X      VALUE "-".                             
005900     02 WS-0101-TIPO-MSG    PIC 9(02)  VALUE 02.                              
006000     02 FILLER              PIC X      VALUE "-".                             
006100     02 WS-0101-SYST-MSG    PIC X(04)  VALUE "S500".                          
006200     02 FILLER              PIC X      VALUE "-".                             
006300     02 WS-0101-PASO-MSG    PIC X(04)  VALUE "PXXX".                          
006400     02 FILLER              PIC X      VALUE "-".                             
006500     02 WS-0101-MTP-MSG     PIC X(08)  VALUE "XXMTPXXX".                      
006600     02 RD-WS-0101-MTP-MSG  REDEFINES WS-0101-MTP-MSG.                        
006700        04 FILLER           PIC X(05).                                        
006800        04 WS-0101-NUM-MTP  PIC 9(03).                                        
006900     02 FILLER              PIC X      VALUE " ".                             
007000    02 WS-0101-TEXT-MSG    PIC X(200).                                        
007100 01 WS-VARIALBES-MSG.                                                         
007200    02 WS-MSG-N-01         PIC 9(01).                                         
007300    02 WS-MSG-N-01-2       PIC 9(01).                                         
007400    02 WS-MSG-N-02         PIC 9(02).                                         
007500    02 WS-MSG-N-02-2       PIC 9(02).                                         
007600    02 WS-MSG-N-04         PIC 9(04).                                         
007700    02 WS-MSG-N-06         PIC 9(06).                                         
007800    02 WS-MSG-N-08         PIC 9(08).                                         
007900    02 WS-MSG-N-10         PIC 9(10).                                         
008000    02 WS-MSG-N-12         PIC 9(12).                                         
008100    02 WS-MSG-N-14         PIC 9(14).                                         
008200    02 WS-MSG-N-16         PIC 9(16).                                         
008300    02 WS-MSG-CTO          PIC 9(12).                                         
008400    02 WS-MSG-CTA          PIC 9(12).                                         
008500    02 WS-MSG-IMP          PIC 9(10)V99.                                      
008600    02 WS-MSG-IMPEDIT      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                            
008700    02 WS-MSG-NUMEDIT      PIC ZZZ,ZZZ,ZZZ.                                   
008800    02 WS-MSG-PORCEDIT     PIC ZZ9.99.                                        
008900    02 WS-MSG-PRD          PIC 9(04).                                         
009000    02 WS-MSG-SUC          PIC 9(04).                                         
009100    02 WS-MSG-INST         PIC 9(04).                                         
009200    02 WS-MSG-MDA          PIC 9(03).                                         
009300    02 WS-MSG-PERS         PIC 9(02).                                         
009400    02 WS-MSG-TARIF        PIC 9(04).                                         
009500    02 WS-MSG-PASO         PIC 9(03).                                         
009600    02 WS-MSG-CVE          PIC 9(04).                                         
009700    02 WS-MSG-RS           PIC 9(04)-.                                        
009800    02 WS-MSG-X15          PIC X(15).                                         
009900                                                                              
010000*****************************************************************             
010100*                                                               *             
010200*       PARAMETROS PARA LA LIBRERIA DE CONTROL DE VERSIONES     *             
010300*                                                               *             
010400*****************************************************************             
010500 77  WKS-88-CTLVERS        PIC 99      COMP  VALUE 0.                         
010600 77  W77-S000-MY-ID        PIC X(12).                                         
010700 77  W77-S000-MY-VERSION   PIC X(08).                                         
010800 01  S000-CTR-LIBID     PIC X(12).                                            
010900 01  S000-CTR-NOMLIB    PIC X(72).                                            
011000 01  S000-CTR-CVEERROR  PIC S9(11)  BINARY.                                   
011100*****************************************************************             
011200**   Tipos de displays segun el campo W77-TIPO-DISP             *             
011300**   "I" = a pantalla y Log  no acumula mensajes                *             
011400**   "O" = a pantalla y Log  no acumula mensajes  se va a STOP  *             
011500**   "E" = solo a log        si acumula mensajes                *             
011600**   "X" = solo a log        si acumula mensajes                *             
011700**   "X" puede ser cualquier otro valor incluso espacio         *             
011800**   por default tiene "E" para enviar solo a log               *             
011900*****************************************************************             
012000 77 W77-TIPO-DISP     PIC X     VALUE "E".                                    
012100 77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                               
012200 01 MENSAJE-LJ.                                                               
012300    02 SISTEMA-LJ     PIC X(04).                                              
012400    02 FILLER         PIC X VALUE "/".                                        
012500    02 PASO-LJ        PIC X(04).                                              
012600    02 FILLER         PIC X VALUE "/".                                        
012700    02 MTP-LJ         PIC 9(03).                                              
012800    02 FILLER         PIC X VALUE ":".                                        
012900    02 TIPO-LJ        PIC X.                                                  
013000    02 FILLER         PIC X VALUE ">".                                        
013100    02 CODIGO-LJ      PIC 9(06).                                              
013200    02 FILLER         PIC X VALUE "<".                                        
013300    02 TEXTO-LJ       PIC X(200).                                             
013400*                                                                             
013500 PROCEDURE DIVISION USING W77-PARAM-WFL.                                      
013600*===================                                                          
013700                                                                              
013800*                                                                             
013900 000000-MODULO-CONTROL-PROGRAMA SECTION.                                      
014000*--------------------                                                         
014100                                                                              
014200 000000-MODULO-DE-CONTROL.                                                    
014300***  MANEJO DE LA LIB LJ                                                      
014400     MOVE 2            TO W77-USO-LIBLJ                                       
014500     MOVE 051010       TO WS-0101-CODI-MSG                                    
014600     MOVE 2            TO WS-0101-TIPO-MSG                                    
014700     MOVE "P075"       TO WS-0101-PASO-MSG                                    
014800      MOVE "25MTP003"   TO WS-0101-MTP-MSG                                    
014900                          W77-S000-MY-VERSION                                 
015000     MOVE "S500P075"   TO W77-S000-MY-ID.                                     
015100                                                                              
015200     PERFORM 10000100-VERSIONES.                                              
015300     PERFORM 20000100-CHECAME-VERSION.                                        
015400     IF S000-CTR-CVEERROR < 0                                                 
015500        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
015600        PERFORM 70000050-MENSAJE                                              
015700        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
015800                                                                              
015900     PERFORM 100000-L080.                                                     
016000     IF S000-CTR-CVEERROR = 0                                                 
016100        IF W77-PARAM-WFL = 1                                                  
016200           PERFORM 200000-INIBATCH                                            
016300        ELSE                                                                  
016400           MOVE W77-PARAM-WFL TO WS-MSG-N-04                                  
016500           STRING "VALUE ERRONEO PARA EJECUTAR P075 ", WS-MSG-N-04            
016600                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
016700           PERFORM 70000050-MENSAJE                                           
016800           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
016900     STOP RUN.                                                                
017000                                                                              
017100 100000-L080.                                                                 
017200     MOVE ZEROS              TO S000-CTR-CVEERROR.                            
017300     MOVE "S500L080CTRL"     TO S000-CTR-LIBID.                               
017400                                                                              
017500     PERFORM 20000100-DAME-TIT-VERS.                                          
017600                                                                              
017700     IF S000-CTR-CVEERROR = 0                                                 
017800          CHANGE ATTRIBUTE TITLE OF "S500L080CTRL"                            
017900                                 TO S000-CTR-NOMLIB                           
018000     ELSE                                                                     
018100        MOVE S000-CTR-CVEERROR TO WS-MSG-N-02                                 
018200        STRING  "ERROR EN CALL CTLVERS S500L080 "                             
018300                " RESULT=", WS-MSG-N-02                                       
018400                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
018500        PERFORM 70000050-MENSAJE.                                             
018600                                                                              
018700 200000-INIBATCH.                                                             
018800     PERFORM 205000-INIBATCH-CALL                                             
018900     IF WKS-L080-RESULT > 0                                                   
019000        MOVE "ERROR EN LLAMADO INIBATCH" TO WS-0101-TEXT-MSG                  
019100        PERFORM 70000050-MENSAJE                                              
019200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
019300                                                                              
019400 205000-INIBATCH-CALL.                                                        
019500     CALL "S500L080INIBATCHP080 IN S500L080CTRL"                              
019600           GIVING WKS-L080-RESULT.                                            
019700                                                                              
019800 10000100-VERSIONES.                                                          
019900     CHANGE ATTRIBUTE LIBACCESS OF "CTLVERS" TO BYFUNCTION.                   
020000     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVERS" TO "CTLVERS".                 
020100     MOVE 1 TO WKS-88-CTLVERS.                                                
020200                                                                              
020300 20000100-CHECAME-VERSION.                                                    
020400     CALL "CHECAME IN CTLVERS"                                                
020500           USING   W77-S000-MY-ID                                             
020600                   W77-S000-MY-VERSION                                        
020700           GIVING  S000-CTR-CVEERROR.                                         
020800                                                                              
020900 70000050-MENSAJE.                                                            
021000     IF W77-USO-LIBLJ = 0                                                     
021100        DISPLAY WS-0101-MENSAJE                                               
021200     ELSE                                                                     
021300        PERFORM 70000050-MENSAJE-LJ.                                          
021400     MOVE " " TO WS-0101-TEXT-MSG.                                            
021500                                                                              
021600 70000050-MENSAJE-LJ.                                                         
021700     IF W77-USO-LIBLJ NOT = 1                                                 
021800        PERFORM 00000000-LINK-LIBLJ.                                          
021900                                                                              
022000     MOVE WS-0101-SYST-MSG  TO SISTEMA-LJ.                                    
022100     MOVE WS-0101-PASO-MSG  TO PASO-LJ.                                       
022200     MOVE WS-0101-NUM-MTP   TO MTP-LJ.                                        
022300     MOVE W77-TIPO-DISP     TO TIPO-LJ.                                       
022400     MOVE WS-0101-CODI-MSG  TO CODIGO-LJ.                                     
022500     MOVE WS-0101-TEXT-MSG  TO TEXTO-LJ.                                      
022600     CALL "LJ IN LIBLJ" USING CONTADOR-LJ, MENSAJE-LJ.                        
022700     MOVE " "               TO TEXTO-LJ.                                      
022800                                                                              
022900 20000100-DAME-TIT-VERS.                                                      
023000     CALL "DAME_TIT IN CTLVERS"                                               
023100           USING      S000-CTR-LIBID                                          
023200                      S000-CTR-NOMLIB                                         
023300           GIVING     S000-CTR-CVEERROR.                                      
023400                                                                              
023500 00000000-LINK-LIBLJ.                                                         
023600     CHANGE ATTRIBUTE TITLE OF "LIBLJ" TO                                     
023700            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK.".                  
023800     MOVE 1 TO W77-USO-LIBLJ.                                                 
