100100$SET LIST$                                                                    
100200$SET ERRORLIST                                                                
100300$SET LIST STACK XREF LINEINFO FREE                                            
100400$ERRORLIMIT = 100                                                             
100500*****************************************************************             
100600*        PARA MANEJO DE INCLUDE  BASE DE DATOS                  *             
100700*****************************************************************             
100800$SET BDB00R01 BDB00R03 BDB00R04                                               
100805$SET BDB00R22 BDB00R23                                                        
100810$SET BDB02R01                                                                 
100820$SET BDB03R08 BDB03R12                                                        
100830$SET BDB05R02                                                                 
100840$SET BDB06R06 BDB06R11                                                        
100850$SET BDB14R03 BDB14R05 BDB14R09                                               
100900$SET BDB17R02 BDB17R06                                                        
100910$SET BDB22R05                                                                 
100920$SET BDB91                                                                    
100970$SET S080IVA                                                                  
101000*****************************************************************             
101100*        PARA INCLUDE MANEJO DE LIBRERIAS                       *             
101200*****************************************************************             
101300$SET S006LOCSUP   S000LIBLJ                                                   
101400$SET S100VERSIONES                                                            
101700$SET S151REGISTRA S151REGISTRA2                                               
101702*$SET S151REGISTRA S151REGISTRA1                                              
101710$SET FECHA2000                                                                
101720$SET HOSTNAME                                                                 
101800***** IDENTIFICADORES PARA USO DE MAPLI ********                              
101820***                                                                           
101840$SET LIBMAPLI                                                                 
101860$SET MAPLIACTLIB012 MAPLIACTLIB013 MAPLIACTLIB015                             
101862$SET MAPLIACTLIB049                                                           
101880***                                                                           
101900                                                                              
102000$RESET LIST$                                                                  
102100****************************************************************              
102200* P127 P127 P127 P127 P127 P127 P127 P127 P127 P127 P127 P127  *              
102300****************************************************************              
102310                                                                              
102400 IDENTIFICATION DIVISION.                                                     
102500 PROGRAM-ID.  P127.                                                           
102600 AUTHOR.                                                                      
102700 DATE-WRITTEN.  ABRIL/1996.                                                   
102800 INSTALLATION.                                                                
102900 SECURITY.                                                                    
102910                                                                              
102920****************************************************************              
102930* SE ELIMINA LA APLICACION DEL MOVSTBINTERSEM  FEB/97          *              
102950*                                                              *              
102970*                                                              *              
102990*                                                              *              
102998****************************************************************              
102999                                                                              
103000 ENVIRONMENT DIVISION.                                                        
103100 CONFIGURATION SECTION.                                                       
103200 SOURCE-COMPUTER.   SERIES-A.                                                 
103300 OBJECT-COMPUTER.   SERIES-A.                                                 
103400 INPUT-OUTPUT  SECTION.                                                       
103500 FILE-CONTROL.                                                                
104100     SELECT OPTIONAL E01-MOVS408      ASSIGN TO DISK.                         
104200     SELECT          I03-PUNTEOIN     ASSIGN TO DISK.                         
104300     SELECT          I04-PUNTEOOUT    ASSIGN TO DISK.                         
104500     SELECT          S02-SORTMVS408   ASSIGN TO SORT DISK.                    
104900     SELECT          R04-CANCS408     ASSIGN TO PRINTER.                      
105000     SELECT          R05-MENSAJES     ASSIGN TO PRINTER.                      
105100                                                                              
105200************************************************************                  
105300 DATA DIVISION.                                                               
105400 FILE SECTION.                                                                
105500********************************************************                      
113500 FD  E01-MOVS408                                                              
113600***  BLOCK   CONTAINS    75  RECORDS                                          
113700***  RECORD  CONTAINS    24  CHARACTERS                                       
113800     VALUE OF                                                                 
113810             DEPENDENTSPECS IS TRUE                                           
113900             TITLE          IS WKS-TIT-S408.                                  
114000                                                                              
114100 01  E01-R00-MOVS408      PIC X(24).                                          
114200                                                                              
114300*****************************************************************             
114400 FD  I03-PUNTEOIN                                                             
114500     BLOCK   CONTAINS   300 RECORDS                                           
114600     RECORD  CONTAINS    60 CHARACTERS                                        
114700     VALUE OF                                                                 
114800             AREAS       IS 1000                                              
114900             AREASIZE    IS 2400                                              
115000             TITLE       IS WKS-TIT-PUNTEOIN.                                 
115100                                                                              
115200 01  I03-R00-PUNTEOIN    PIC X(60).                                           
115300                                                                              
115400*****************************************************************             
115500 FD  I04-PUNTEOOUT                                                            
115600     BLOCK   CONTAINS   300 RECORDS                                           
115700     RECORD  CONTAINS    60 CHARACTERS                                        
115800     VALUE OF                                                                 
115900             AREAS       IS 1000                                              
116000             AREASIZE    IS 2400                                              
116100             TITLE       IS WKS-TIT-PUNTEOOUT.                                
116200                                                                              
116300 01  I04-R00-PUNTEOOUT   PIC X(60).                                           
116400                                                                              
116500************************************************************                  
116600 SD  S02-SORTMVS408.                                                          
116700 01  S02-R00-SORTS408.                                                        
116800     02 S02-R00-TPO-REG          PIC 9(02).                                   
116900     02 S02-R00-CLAVE            PIC 9(02).                                   
117000     02 S02-R00-PREF-CTA         PIC 9(04)      COMP.                         
117100     02 S02-R00-CONTRATO         PIC 9(12)      COMP.                         
117200     02 S02-R00-SUC-PROM         PIC 9(04)      COMP.                         
117300     02 S02-R00-IMPORTE          PIC 9(10)V99   COMP.                         
117400     02 FILLER                   PIC X(04).                                   
117500                                                                              
118800***********************************************************                   
118900 FD  R04-CANCS408.                                                            
119000 01  R04-L00-CANCS408       PIC X(132).                                       
119100                                                                              
119200***********************************************************                   
119300 FD  R05-MENSAJES.                                                            
119400 01  R05-L00-MENSAJE        PIC X(132).                                       
119500                                                                              
119600***********************************************************                   
119700 DATA-BASE SECTION.                                                           
119800 DB  S500BD01CAPTACION.                                                       
119820 01  S500B00CTRLPASO.                                                         
119900 01  S500B02CONTROL.                                                          
120000 01  S500B03CONTRATOS.                                                        
120100 01  S500B05INSTRUMEN.                                                        
120200 01  S500B06HISTORICO.                                                        
120300 01  S500B14TOTCVES.                                                          
120400 01  S500B17CVESXFUN.                                                         
120450 01  S500B22ESQCONT.                                                          
120500 01  S500B91REINICIO.                                                         
120600                                                                              
120700*************************************************************                 
120800/                                                                             
120900*************************************************************                 
121000 WORKING-STORAGE SECTION.                                                     
121005*************   VARIABLES  LIB/MAPLI ***********                              
121010 77 W77-ID-ACT01-MAPLI       PIC 9(04).                                       
121015 77 W77-ID-ACT02-MAPLI       PIC 9(04).                                       
121020 77 W77-ID-ACT03-MAPLI       PIC 9(04).                                       
121022 77 W77-ERR-L035-MAPLI       PIC 9(01)   VALUE 0.                             
121023 77 W77-ERR-L035-DATO        PIC X(20).                                       
121025                                                                              
121030 77 W77-ID-NOMB-ACT          PIC X(25).                                       
121040 77 W77-REGS-A-PROC          PIC 9(08).                                       
121050                                                                              
121100 77  W77-TPO-PROC                PIC 99         VALUE 0.                      
121700 77  W77-FECHA-EDIT              PIC 9999/99/99.                              
121800 77  W77-FECHA-06-EDIT           PIC 99/99/99.                                
121900 77  W77-IMP-EDIT                PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ.ZZ.                  
122000 77  W77-IMP-EDIT2               PIC ZZZ,ZZZ,ZZZ,ZZZ,ZZZ.ZZ.                  
122050 77  W77-SEC-ESQCONT             PIC 9(04)      COMP.                         
122100 77  W77-SET-MAXCARDS            PIC 9(02)      COMP   VALUE 9.               
122300 77  W77-TPO-CANCEL              PIC 9(02)      COMP   VALUE 0.               
122400 77  W77-MY-CSI                  PIC 9(02)      COMP.                         
122500 77  W77-MY-AUTORIZ              PIC 9(06)      COMP.                         
122600 77  W77-NUM-MIX                 PIC 9(07)      COMP.                         
122700 77  W77-EOF-INST                PIC 9(02)      COMP   VALUE 0.               
122800 77  W77-EOF-CVES                PIC 9(02)      COMP   VALUE 0.               
123000 77  W77-EOF-BASE                PIC 9(02)      COMP   VALUE 0.               
123100 77  W77-EOF-S408                PIC 9(02)      COMP   VALUE 0.               
123300 77  W77-EOF-I03                 PIC 9(02)      COMP   VALUE 0.               
123400 77  W77-EOF-I04                 PIC 9(02)      COMP   VALUE 0.               
123500 77  W77-NOHAY-S408              PIC 9(02)      COMP   VALUE 0.               
123700 77  W77-SW-BEGINTRAN            PIC 9(02)      COMP   VALUE 0.               
123800 77  W77-SW-GLOBAL               PIC 9(02)      COMP   VALUE 0.               
123900 77  W77-TOT-DSKSIZE             PIC 9(10)      COMP.                         
124000 77  W77-TOT-MEMSIZE             PIC 9(10)      COMP.                         
124200 77  W77-LASTREC-S408            PIC 9(08)             VALUE 0.               
125100 77  W77-NPAG-04                 PIC 9(06)      COMP   VALUE 0.               
125200 77  W77-NPAG-05                 PIC 9(06)      COMP   VALUE 0.               
125600 77  W77-NLIN-04                 PIC 9(02)      COMP   VALUE 70.              
125700 77  W77-NLIN-05                 PIC 9(02)      COMP   VALUE 70.              
125720 77  W77-OPEN-R05                PIC 9(02)      COMP   VALUE 0.               
125800 77  W77-HAY-MOVBATCH            PIC 9(02)      COMP   VALUE 0.               
125805 77  W77-ES-PRUEBA               PIC 9(02)      COMP   VALUE 0.               
125810                                                                              
125820*******************************************************                       
125830 01  WKS-VAR-TASKVALUE.                                                       
125840     02 WKS-TASKVALUE-PBA    PIC 9(01) VALUE 0.                               
125850     02 RD-WKS-TASKVALUE-PBA REDEFINES WKS-TASKVALUE-PBA.                     
125860        04 WKS-SIN-LBS151    PIC 9(01).                                       
125870                                                                              
125872******************************************************                        
125874*01  WKS-NAME-HOST.                                                           
125876*    02 WKS-MY-HOST         PIC X(20).                                        
125878*    02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
125880*       04 WKS-MY-HOST-03   PIC X(04).                                        
125882*       04 WKS-MY-HOST-17   PIC X(16).                                        
125884*                                                                             
125900****************************************************************              
125904 01  WKS-TABLA-MESES.                                                         
125906     02 FILLER          PIC X(18) VALUE "ENEFEBMARABRMAYJUN".                 
125908     02 FILLER          PIC X(18) VALUE "JULAGOSEPOCTNOVDIC".                 
125910 01  RD-WKS-TABLA-MESES REDEFINES WKS-TABLA-MESES.                            
125912     02 WKS-TBX-MES     PIC X(03) OCCURS 12 TIMES.                            
125914                                                                              
125916 01  WKS-FECPROC-EDIT.                                                        
125918     02 WKS-DD-FPRC-EDIT    PIC 99.                                           
125920     02 FILLER              PIC X       VALUE "/".                            
125922     02 WKS-MM-FPRC-EDIT    PIC X(03).                                        
125924     02 FILLER              PIC X       VALUE "/".                            
125926     02 WKS-AAAA-FPRC-EDIT  PIC 9(04).                                        
125928                                                                              
125930 01  WKS-FECMAQ-EDIT.                                                         
125932     02 WKS-DD-FMAQ-EDIT    PIC 99.                                           
125934     02 FILLER              PIC X       VALUE "/".                            
125936     02 WKS-MM-FMAQ-EDIT    PIC X(03).                                        
125938     02 FILLER              PIC X       VALUE "/".                            
125940     02 WKS-AAAA-FMAQ-EDIT  PIC 9(04).                                        
125942                                                                              
126000***************************************************************               
126100 01  WKS-TABLA-DIASEM.                                                        
126200     02 FILLER                   PIC X(10) VALUE "DOMINGO   ".                
126300     02 FILLER                   PIC X(10) VALUE "LUNES     ".                
126400     02 FILLER                   PIC X(10) VALUE "MARTES    ".                
126500     02 FILLER                   PIC X(10) VALUE "MIERCOLES ".                
126600     02 FILLER                   PIC X(10) VALUE "JUEVES    ".                
126700     02 FILLER                   PIC X(10) VALUE "VIERNES   ".                
126800     02 FILLER                   PIC X(10) VALUE "SABADO    ".                
126900 01  WKS-RD-TABLA-DIASEM         REDEFINES WKS-TABLA-DIASEM.                  
127000     02 WKS-TB-QDIASEM           PIC X(10) OCCURS 7 TIMES.                    
127100                                                                              
127200****************************************************************              
127300 01  WKS-TABLA-CVES-VAL.                                                      
127400     02 WKS-TAB-CVESVAL          OCCURS 2000 TIMES.                           
127500        04 WKS-TB-CVEVAL         PIC 9(04)   COMP.                            
127600                                                                              
127700***************************************************                           
127800 01  WKS-TABLA-INSTRUMENT.                                                    
127900     02 WKS-TAB-B05-INSTRUM       OCCURS 30 TIMES.                            
128000        04 WKS-TB-B05-PROD        PIC 9(04)    COMP.                          
128100        04 WKS-TB-B05-INST        PIC 9(04)    COMP.                          
128200        04 WKS-TB-B05-MONEDA      PIC 9(03)    COMP.                          
128300        04 WKS-TB-B05-PGOREND     PIC 9(01)    COMP.                          
128400        04 WKS-TB-B05-NOMBRE      PIC X(40).                                  
128900        04 WKS-TB-B05-FEC-ALTA    PIC 9(08)    COMP.                          
129000        04 WKS-TB-B05-FEC-ULTMD   PIC 9(08)    COMP.                          
129100        04 WKS-TB-B05-CVRETIMP    PIC 9(04)    COMP.                          
129200        04 WKS-TB-B05-INDIACORT   PIC 9(02)    COMP.                          
129300        04 WKS-TB-B05-MED-ACC.                                                
129400           06 WKS-TB-B05-CHQRA    PIC 9(01)    COMP.                          
129500           06 WKS-TB-B05-TARJ     PIC 9(01)    COMP.                          
129600        04 WKS-TB-B05-DIAS-FVAL   PIC 9(02)    COMP.                          
129700        04 WKS-TB-B05-CAMBPRODT   OCCURS 6 TIMES.                             
129800           06 WKS-TB-B05-PRODVAL  PIC 9(04)    COMP.                          
129900        04 WKS-TB-B05-CAMBINSTR   OCCURS 6 TIMES.                             
130000           06 WKS-TB-B05-INSTVAL  PIC 9(04)    COMP.                          
130100        04 WKS-TB-B05-QCENTRAL    OCCURS 6 TIMES.                             
130200           06 WKS-TB-B05-CENTR    PIC 9(04)    COMP.                          
130300        04 WKS-TB-B05-COMISION.                                               
130400           06 WKS-TB-B05-CVTARIF  PIC 9(03) COMP OCCURS 60 TIMES.             
130500           06 WKS-TB-B05-COMIS    PIC 9(04) COMP OCCURS 60 TIMES.             
130600        04 WKS-TB-B05-PERS-F      PIC 9     COMP.                             
130700        04 WKS-TB-B05-PERS-M      PIC 9     COMP.                             
130710        04 WKS-TB-B05-ESQ-COMIS   PIC 9     COMP.                             
130720        04 WKS-TB-B05-MES-CANCEL  PIC 9     COMP.                             
130730        04 WKS-TB-B05-CVE-AVISO   PIC 9(04) COMP OCCURS  9 TIMES.             
130740        04 WKS-TB-B05-PORC-RENTA  PIC 9(03) COMP OCCURS 12 TIMES.             
130742        04 WKS-TB-B05-PROC-COPIA  PIC 9(01) COMP.                             
130744        04 WKS-TB-B05-MESINACTEF  PIC 9(01) COMP.                             
130746        04 WKS-TB-B05-CVEAVISTEF  PIC 9(04) COMP OCCURS 9 TIMES.              
130748        04 WKS-TB-B05-VAL-EDOCTA  PIC 9(01) COMP.                             
130750        04 WKS-TB-B05-ENVSDOS084  PIC 9(01) COMP.                             
130752        04 WKS-TB-B05-SDOSINTEGRA      OCCURS 2 TIMES.                        
130754           06 WKS-TB-B05-SI-SDOSINT    PIC 9(01) COMP.                        
130756           06 WKS-TB-B05-USO-INVINTE   PIC 9(01) COMP.                        
130758           06 WKS-TB-B05-USO-INVPLAZ   PIC 9(01) COMP.                        
130760           06 WKS-TB-B05-USO-INVCPE    PIC 9(01) COMP.                        
130762           06 WKS-TB-B05-USO-BCAINV    PIC 9(01) COMP.                        
130764           06 WKS-TB-B05-USO-OTRAINV   PIC 9(01) COMP.                        
130766        04 WKS-TB-B05-BIMES-CANC  PIC 9(01) COMP.                             
130768        04 WKS-TB-B05-BICVE-AVI   PIC 9(04) COMP OCCURS 9 TIMES.              
130770        04 WKS-TB-B05-MESBLQ-6614 PIC 9(01) COMP.                             
130772        04 WKS-TB-B05-CVAVIS-BLQ  PIC 9(04) COMP OCCURS 9 TIMES.              
130774        04 WKS-TB-B05-MESEXE-DEP  PIC 9(01) COMP.                             
130776        04 WKS-TB-B05-INDRENDIF   PIC 9(01) COMP.                             
130778        04 WKS-TB-B05-GPOCVECONTD      OCCURS 40 TIMES.                       
130780           06 WKS-TB-B05-CONTDCVETRAN  PIC 9(04) COMP.                        
130782           06 WKS-TB-B05-CONTDCVEGEN   PIC 9(04) COMP.                        
130784           06 WKS-TB-B05-CONTDSIRHGEN  PIC 9(04) COMP.                        
130785           06 WKS-TB-B05-CONTD-PORGEN   PIC 9(03) COMP.                       
130786           06 WKS-TB-B05-CONTD-SIRHGEN2 PIC 9(04) COMP.                       
130787           06 WKS-TB-B05-CONTD-PORGEN2  PIC 9(03) COMP.                       
130788           06 WKS-TB-B05-CONTD-SIRHGEN3 PIC 9(04) COMP.                       
130789           06 WKS-TB-B05-CONTD-PORGEN3  PIC 9(03) COMP.                       
130790           06 WKS-TB-B05-CONTD-USO-F    PIC 9(01) COMP.                       
130791        04 WKS-TB-B05-IND-PRDNOMI   PIC 9(01) COMP.                           
130792        04 WKS-TB-B05-IND-BENEF     PIC 9(01) COMP.                           
130793        04 WKS-TB-B05-VAL-CHQSALT   PIC 9(01) COMP.                           
130794        04 WKS-TB-B05-IND-RENDDIA   PIC 9(01) COMP.                           
130795        04 WKS-TB-B05-MESES-NOCOMI  PIC 9(02) COMP.                           
130796        04 WKS-TB-B05-RENDI-BRACK   PIC 9(02) COMP.                           
130797        04 WKS-TB-B05-RENDI-CURVAS  PIC 9(02) COMP.                           
130798        04 WKS-TB-B05-RENDI-GRUPOS  PIC 9(02) COMP.                           
130799        04 WKS-TB-B05-IMP-AJUSTE-P160   PIC S9(15)V99 COMP.                   
130800        04 WKS-TB-B05-SIN-LIM-DEP   PIC 9(02) COMP.                           
130880        04 WKS-TB-B05-USO-FUTIMP-01 PIC 9(12)V99  COMP.                       
130882        04 WKS-TB-B05-USO-FUTURO-01 PIC 9(08) COMP.                           
130884        04 WKS-TB-B05-USO-FUTURO-02 PIC 9(06) COMP.                           
130886        04 WKS-TB-B05-USO-FUTURO-03 PIC 9(06) COMP.                           
130888        04 WKS-TB-B05-USO-FUTURO-04 PIC 9(02) COMP.                           
130890        04 WKS-TB-B05-USO-FUTURO-05 PIC 9(04) COMP.                           
130892        04 WKS-TB-B05-USO-FUTURO-06 PIC 9(04) COMP.                           
130894                                                                              
130900*************************************************************                 
131000 01 WKS-TOTAL-CVES-01.                                                        
131020    02 WKS-TCVES-INST-01         OCCURS  30  TIMES.                           
131040       04 WKS-TCVES-CVES-01      OCCURS 100  TIMES.                           
131060          06 WKS-TCVE-01-IMP     PIC 9(12)V99  COMP.                          
131080          06 WKS-TCVE-01-NUM     PIC 9(06)     COMP.                          
131100          06 WKS-TCVE-01-CVE     PIC 9(04)     COMP.                          
131120*****************************************************************             
131140 01 WKS-TOTAL-CVES-02.                                                        
131160    02 WKS-TCVES-INST-02         OCCURS  30  TIMES.                           
131180       04 WKS-TCVES-CVES-02      OCCURS 100  TIMES.                           
131200          06 WKS-TCVE-02-IMP     PIC 9(12)V99  COMP.                          
131220          06 WKS-TCVE-02-NUM     PIC 9(06)     COMP.                          
131240          06 WKS-TCVE-02-CVE     PIC 9(04)     COMP.                          
131260******************************************************************            
131280 01 WKS-TOTAL-CVES-03.                                                        
131300    02 WKS-TCVES-INST-03         OCCURS  30  TIMES.                           
131320       04 WKS-TCVES-CVES-03      OCCURS 100  TIMES.                           
131340          06 WKS-TCVE-03-IMP     PIC 9(12)V99  COMP.                          
131360          06 WKS-TCVE-03-NUM     PIC 9(06)     COMP.                          
131380          06 WKS-TCVE-03-CVE     PIC 9(04)     COMP.                          
131400*****************************************************************             
131420 01 WKS-TOTAL-CVES-04.                                                        
131440    02 WKS-TCVES-INST-04         OCCURS  36  TIMES.                           
131460       04 WKS-TCVES-CVES-04      OCCURS 100  TIMES.                           
131480          06 WKS-TCVE-04-IMP     PIC 9(12)V99  COMP.                          
131500          06 WKS-TCVE-04-NUM     PIC 9(06)     COMP.                          
131520          06 WKS-TCVE-04-CVE     PIC 9(04)     COMP.                          
131540**************************************************************                
131560 01 WKS-TOTAL-CVES-05.                                                        
131580    02 WKS-TCVES-INST-05         OCCURS  30  TIMES.                           
131600       04 WKS-TCVES-CVES-05      OCCURS 100  TIMES.                           
131620          06 WKS-TCVE-05-IMP     PIC 9(12)V99  COMP.                          
131640          06 WKS-TCVE-05-NUM     PIC 9(06)     COMP.                          
131660          06 WKS-TCVE-05-CVE     PIC 9(04)     COMP.                          
131680**************************************************************                
131700 01 WKS-TOTAL-CVES-06.                                                        
131720    02 WKS-TCVES-INST-06         OCCURS  30  TIMES.                           
131740       04 WKS-TCVES-CVES-06      OCCURS 100  TIMES.                           
131760          06 WKS-TCVE-06-IMP     PIC 9(12)V99  COMP.                          
131780          06 WKS-TCVE-06-NUM     PIC 9(06)     COMP.                          
131800          06 WKS-TCVE-06-CVE     PIC 9(04)     COMP.                          
131820**************************************************************                
131840 01 WKS-TOTAL-CVES-07.                                                        
131860    02 WKS-TCVES-INST-07         OCCURS  30  TIMES.                           
131880       04 WKS-TCVES-CVES-07      OCCURS 100  TIMES.                           
131900          06 WKS-TCVE-07-IMP     PIC 9(12)V99  COMP.                          
131920          06 WKS-TCVE-07-NUM     PIC 9(06)     COMP.                          
131940          06 WKS-TCVE-07-CVE     PIC 9(04)     COMP.                          
131960**************************************************************                
131980 01 WKS-TOTAL-CVES-08.                                                        
132000    02 WKS-TCVES-INST-08         OCCURS  30  TIMES.                           
132020       04 WKS-TCVES-CVES-08      OCCURS 100  TIMES.                           
132040          06 WKS-TCVE-08-IMP     PIC 9(12)V99  COMP.                          
132060          06 WKS-TCVE-08-NUM     PIC 9(06)     COMP.                          
132080          06 WKS-TCVE-08-CVE     PIC 9(04)     COMP.                          
132100**************************************************************                
132120 01 WKS-TOTAL-CVES-09.                                                        
132140    02 WKS-TCVES-INST-09         OCCURS  30  TIMES.                           
132160       04 WKS-TCVES-CVES-09      OCCURS 100  TIMES.                           
132180          06 WKS-TCVE-09-IMP     PIC 9(12)V99  COMP.                          
132200          06 WKS-TCVE-09-NUM     PIC 9(06)     COMP.                          
132220          06 WKS-TCVE-09-CVE     PIC 9(04)     COMP.                          
132240**************************************************************                
132260 01 WKS-TOTAL-CVES-10.                                                        
132280    02 WKS-TCVES-INST-10         OCCURS  30  TIMES.                           
132300       04 WKS-TCVES-CVES-10      OCCURS 100  TIMES.                           
132320          06 WKS-TCVE-10-IMP     PIC 9(12)V99  COMP.                          
132340          06 WKS-TCVE-10-NUM     PIC 9(06)     COMP.                          
132360          06 WKS-TCVE-10-CVE     PIC 9(04)     COMP.                          
132380************************************************************                  
132400 01 WKS-TOTAL-CVES-11.                                                        
132410    02 WKS-TCVES-INST-11         OCCURS  30  TIMES.                           
132420       04 WKS-TCVES-CVES-11      OCCURS 100  TIMES.                           
132430          06 WKS-TCVE-11-IMP     PIC 9(12)V99  COMP.                          
132440          06 WKS-TCVE-11-NUM     PIC 9(06)     COMP.                          
132450          06 WKS-TCVE-11-CVE     PIC 9(04)     COMP.                          
132460*****************************************************************             
132470 01 WKS-TOTAL-CVES-12.                                                        
132480    02 WKS-TCVES-INST-12         OCCURS  30  TIMES.                           
132490       04 WKS-TCVES-CVES-12      OCCURS 100  TIMES.                           
132500          06 WKS-TCVE-12-IMP     PIC 9(12)V99  COMP.                          
132510          06 WKS-TCVE-12-NUM     PIC 9(06)     COMP.                          
132520          06 WKS-TCVE-12-CVE     PIC 9(04)     COMP.                          
132530******************************************************************            
132540 01 WKS-TOTAL-CVES-13.                                                        
132550    02 WKS-TCVES-INST-13         OCCURS  30  TIMES.                           
132560       04 WKS-TCVES-CVES-13      OCCURS 100  TIMES.                           
132570          06 WKS-TCVE-13-IMP     PIC 9(12)V99  COMP.                          
132580          06 WKS-TCVE-13-NUM     PIC 9(06)     COMP.                          
132590          06 WKS-TCVE-13-CVE     PIC 9(04)     COMP.                          
132600*****************************************************************             
132610 01 WKS-TOTAL-CVES-14.                                                        
132620    02 WKS-TCVES-INST-14         OCCURS  36  TIMES.                           
132630       04 WKS-TCVES-CVES-14      OCCURS 100  TIMES.                           
132640          06 WKS-TCVE-14-IMP     PIC 9(12)V99  COMP.                          
132650          06 WKS-TCVE-14-NUM     PIC 9(06)     COMP.                          
132660          06 WKS-TCVE-14-CVE     PIC 9(04)     COMP.                          
132670**************************************************************                
132680 01 WKS-TOTAL-CVES-15.                                                        
132690    02 WKS-TCVES-INST-15         OCCURS  30  TIMES.                           
132700       04 WKS-TCVES-CVES-15      OCCURS 100  TIMES.                           
132710          06 WKS-TCVE-15-IMP     PIC 9(12)V99  COMP.                          
132720          06 WKS-TCVE-15-NUM     PIC 9(06)     COMP.                          
132730          06 WKS-TCVE-15-CVE     PIC 9(04)     COMP.                          
132740**************************************************************                
132750 01 WKS-TOTAL-CVES-16.                                                        
132760    02 WKS-TCVES-INST-16         OCCURS  30  TIMES.                           
132770       04 WKS-TCVES-CVES-16      OCCURS 100  TIMES.                           
132780          06 WKS-TCVE-16-IMP     PIC 9(12)V99  COMP.                          
132790          06 WKS-TCVE-16-NUM     PIC 9(06)     COMP.                          
132800          06 WKS-TCVE-16-CVE     PIC 9(04)     COMP.                          
132810**************************************************************                
132820 01 WKS-TOTAL-CVES-17.                                                        
132830    02 WKS-TCVES-INST-17         OCCURS  30  TIMES.                           
132840       04 WKS-TCVES-CVES-17      OCCURS 100  TIMES.                           
132850          06 WKS-TCVE-17-IMP     PIC 9(12)V99  COMP.                          
132860          06 WKS-TCVE-17-NUM     PIC 9(06)     COMP.                          
132870          06 WKS-TCVE-17-CVE     PIC 9(04)     COMP.                          
132880**************************************************************                
132890 01 WKS-TOTAL-CVES-18.                                                        
132900    02 WKS-TCVES-INST-18         OCCURS  30  TIMES.                           
132910       04 WKS-TCVES-CVES-18      OCCURS 100  TIMES.                           
132920          06 WKS-TCVE-18-IMP     PIC 9(12)V99  COMP.                          
132930          06 WKS-TCVE-18-NUM     PIC 9(06)     COMP.                          
132940          06 WKS-TCVE-18-CVE     PIC 9(04)     COMP.                          
132950**************************************************************                
132960 01 WKS-TOTAL-CVES-19.                                                        
132970    02 WKS-TCVES-INST-19         OCCURS  30  TIMES.                           
132980       04 WKS-TCVES-CVES-19      OCCURS 100  TIMES.                           
132990          06 WKS-TCVE-19-IMP     PIC 9(12)V99  COMP.                          
133000          06 WKS-TCVE-19-NUM     PIC 9(06)     COMP.                          
133010          06 WKS-TCVE-19-CVE     PIC 9(04)     COMP.                          
133020**************************************************************                
133030 01 WKS-TOTAL-CVES-20.                                                        
133040    02 WKS-TCVES-INST-20         OCCURS  30  TIMES.                           
133050       04 WKS-TCVES-CVES-20      OCCURS 100  TIMES.                           
133060          06 WKS-TCVE-20-IMP     PIC 9(12)V99  COMP.                          
133070          06 WKS-TCVE-20-NUM     PIC 9(06)     COMP.                          
133080          06 WKS-TCVE-20-CVE     PIC 9(04)     COMP.                          
133090************************************************************                  
134500 01 WKS-TOTAL-CVES-99.                                                        
134600    02 WKS-TCVES-INST-99         OCCURS  30  TIMES.                           
134700       04 WKS-TCVES-CVES-99      OCCURS 100  TIMES.                           
134800          06 WKS-TCVE-99-IMP     PIC 9(12)V99  COMP.                          
134900          06 WKS-TCVE-99-NUM     PIC 9(06)     COMP.                          
135000          06 WKS-TCVE-99-CVE     PIC 9(04)     COMP.                          
135100                                                                              
135200****************************************************************              
135300 01  VARIABLES-INDICES.                                                       
135400     02 WKS-SI-B02               PIC 9(02)      COMP  VALUE 0.                
135500     02 WKS-SI-B03               PIC 9(02)      COMP  VALUE 0.                
135600     02 WKS-SI-B06               PIC 9(02)      COMP  VALUE 0.                
135700     02 WKS-IND-ITA              PIC 9(04)      COMP.                         
135800     02 WKS-IND-ITB              PIC 9(04)      COMP.                         
135900     02 WKS-IND-ITC              PIC 9(04)      COMP.                         
136000     02 WKS-HAY-CVE              PIC 9(02)      COMP.                         
136100     02 WKS-IND-99               PIC 9(04)      COMP.                         
136200     02 WKS-IND-MOV              PIC 9(04)      COMP.                         
136300     02 WKS-IND-TBCVE            PIC 9(04)      COMP.                         
136400     02 WKS-NUM-MXCVE            PIC 9(04)      COMP.                         
136500     02 WKS-NUM-TOT              PIC 9(04)      COMP.                         
136600     02 WKS-IND-INST             PIC 9(02)      COMP.                         
136700     02 WKS-INST-MEM             PIC 9(02)      COMP  VALUE 0.                
136800     02 WKS-IND-ESQ              PIC 9(04)      COMP.                         
136900     02 WKS-HAY-ESQ              PIC 9(02)      COMP.                         
137000     02 WKS-ESQ-CONTABLE         PIC 9(04)      COMP.                         
137300                                                                              
137400***************************************************                           
137500 01  WKS-VARIABLES-FECHAS.                                                    
137600     02 WKS-TIME-MAQ             PIC 9(08)      COMP.                         
137700     02 WKS-RD-TIME-MAQ          REDEFINES WKS-TIME-MAQ.                      
137800        04 WKS-HORA-MAQ          PIC 9(06)      COMP.                         
137900        04 FILLER                PIC 9(02)      COMP.                         
137910     02 RD-WKS-TIME-MAQ          REDEFINES WKS-TIME-MAQ.                      
137920        04 WKS-HRMAQ-HH          PIC 9(02)      COMP.                         
137930        04 WKS-HRMAQ-MM          PIC 9(02)      COMP.                         
137940        04 WKS-HRMAQ-SS          PIC 9(02)      COMP.                         
137950        04 WKS-HRMAQ-DC          PIC 9(02)      COMP.                         
138000                                                                              
138010     02 WKS-FEC-BASE-08          PIC 9(08)      COMP.                         
138020     02 RD-WKS-FEC-BASE-08       REDEFINES WKS-FEC-BASE-08.                   
138030        04 WKS-AAAA-FBASE        PIC 9(04)      COMP.                         
138040        04 FILLER                PIC 9(04)      COMP.                         
138050     02 RD2-WKS-FEC-BASE-08      REDEFINES WKS-FEC-BASE-08.                   
138060        04 WKS-AA1-FBASE         PIC 9(02)      COMP.                         
138100        04 WKS-FEC-BASE          PIC 9(06)      COMP.                         
138200        04 WKS-RD-FEC-BASE       REDEFINES WKS-FEC-BASE.                      
138300           06 WKS-AA-FBASE       PIC 9(02)      COMP.                         
138400           06 WKS-MM-FBASE       PIC 9(02)      COMP.                         
138500           06 WKS-DD-FBASE       PIC 9(02)      COMP.                         
138505                                                                              
138510     02 WKS-FBAS-DMA             PIC 9(08)      COMP.                         
138515     02 RD-WKS-FBAS-DMA          REDEFINES WKS-FBAS-DMA.                      
138520        04 WKS-DD-FBAS-DMA       PIC 9(02)      COMP.                         
138525        04 WKS-MM-FBAS-DMA       PIC 9(02)      COMP.                         
138530        04 WKS-AAAA-FBAS-DMA     PIC 9(04)      COMP.                         
138535        04 RD1-WKS-AAAA-FBAS-DMA REDEFINES WKS-AAAA-FBAS-DMA.                 
138540           06 WKS-SS-FBAS-DMA    PIC 9(02)      COMP.                         
138545           06 WKS-AA-FBAS-DMA    PIC 9(02)      COMP.                         
138550                                                                              
138600                                                                              
138700     02 WKS-FEC-PROX-08          PIC 9(08)      COMP.                         
138800     02 RD1-WKS-FEC-PROX-08      REDEFINES WKS-FEC-PROX-08.                   
138900        04 WKS-AAAA-FPROX        PIC 9(04)      COMP.                         
139000        04 FILLER                PIC 9(04)      COMP.                         
139100     02 RD2-WKS-FEC-PROX-08      REDEFINES WKS-FEC-PROX-08.                   
139200        04 WKS-AA1-FPROX         PIC 9(02)      COMP.                         
139300        04 WKS-FEC-PROX          PIC 9(06)      COMP.                         
139400        04 WKS-RD-FEC-PROX       REDEFINES WKS-FEC-PROX.                      
139500           06 WKS-AA-FPROX       PIC 9(02)      COMP.                         
139600           06 WKS-MM-FPROX       PIC 9(02)      COMP.                         
139700           06 WKS-DD-FPROX       PIC 9(02)      COMP.                         
139800                                                                              
139810     02 WKS-FEC-ANT-08           PIC 9(08)      COMP.                         
139820     02 RD1-WKS-FEC-ANT-08       REDEFINES WKS-FEC-ANT-08.                    
139830        04 WKS-AAAA-FANT         PIC 9(04)      COMP.                         
139840        04 FILLER                PIC 9(04)      COMP.                         
139850     02 RD2-WKS-FEC-ANT-08       REDEFINES WKS-FEC-ANT-08.                    
139860        04 WKS-AA1-FANT          PIC 9(02)      COMP.                         
139900        04 WKS-FEC-ANT           PIC 9(06)      COMP.                         
140000        04 WKS-RD-FEC-ANT        REDEFINES WKS-FEC-ANT.                       
140100           06 WKS-AA-FANT        PIC 9(02)      COMP.                         
140200           06 WKS-MM-FANT        PIC 9(02)      COMP.                         
140300           06 WKS-DD-FANT        PIC 9(02)      COMP.                         
140400                                                                              
140600     02 WKS-DIA-SEMHOY           PIC 9(02)      COMP.                         
140700     02 WKS-DIA-SEMPROX          PIC 9(02)      COMP.                         
140800     02 WKS-ES-SEMANAL           PIC 9(02)      COMP  VALUE 0.                
141400                                                                              
141500     02 WS-CVE-COMUN             PIC 9(04)      COMP.                         
141600     02 WS-IMP-COMUN             PIC 9(12)V99   COMP.                         
141700     02 WS-REF-COMUN             PIC 9(10)      COMP.                         
141800                                                                              
149600***************************************************************               
149700 01  WKS-TIT-S408.                                                            
149800     02 FILLER              PIC X(30) VALUE                                   
149900                            "(S408)S408/FILE/S500/MOVNOCON/".                 
150100     02 WKS-TIT-S408-CSI    PIC 9(02).                                        
150200     02 FILLER              PIC X       VALUE "/".                            
150300     02 WKS-TIT-S408-FEC    PIC 9(06).                                        
150400     02 FILLER              PIC X(11)   VALUE " ON CREDITO".                  
150600     02 FILLER              PIC X       VALUE ".".                            
150700                                                                              
150800 01  WKS-E01-R00-MOVS408.                                                     
150900     02 WKS-E01-R00-TPO-REG      PIC 9(02).                                   
151000     02 WKS-E01-R00-FEC-PRO      PIC 9(06).                                   
151100     02 WKS-E01-R00-SISORI       PIC X(04).                                   
151200     02 WKS-E01-R00-SISDES       PIC X(04).                                   
151300     02 FILLER                   PIC X(08).                                   
151400                                                                              
151500 01  WKS-E01-R01-MOVS408.                                                     
151600     02 WKS-E01-R01-TPO-REG      PIC 9(02).                                   
151700     02 WKS-E01-R01-CVE-SOB      PIC 9(02).                                   
151800     02 WKS-E01-R01-PRF-CTA      PIC 9(04)         COMP.                      
151900     02 WKS-E01-R01-CONTRATO     PIC 9(12)         COMP.                      
152000     02 WKS-E01-R01-SUC-PROM     PIC 9(04)         COMP.                      
152100     02 WKS-E01-R01-IMPORTE      PIC 9(10)V99      COMP.                      
152200     02 FILLER                   PIC X(04).                                   
152300                                                                              
152400 01  WKS-E01-R99-MOVS408.                                                     
152500     02 WKS-E01-R99-TPO-REG      PIC 9(02).                                   
152600     02 WKS-E01-R99-NUM-REG      PIC 9(10)         COMP.                      
152700     02 FILLER                   PIC X(17).                                   
152800                                                                              
152900****** CAMPOS DEL ARCHIVO I02-PUNTEO   ***********************                
153000 01  WKS-TIT-PUNTEOIN.                                                        
153100     02 FILLER              PIC X(22) VALUE                                   
153200                            "S500/FILE/P120/PUNTEO/".                         
153300     02 WKS-TIT-CSI-I03     PIC 99.                                           
153400     02 FILLER              PIC X     VALUE "/".                              
153500     02 WKS-TIT-FEC-I03     PIC 9(06).                                        
153600     02 FILLER              PIC X     VALUE ".".                              
153700                                                                              
153800 01  WKS-TIT-PUNTEOOUT.                                                       
153900     02 FILLER              PIC X(22) VALUE                                   
154000                            "S500/FILE/P127/PUNTEO/".                         
154100     02 WKS-TIT-CSI-I04     PIC 99.                                           
154200     02 FILLER              PIC X     VALUE "/".                              
154300     02 WKS-TIT-FEC-I04     PIC 9(06).                                        
154400     02 FILLER              PIC X     VALUE ".".                              
154500                                                                              
154600 01  WKS-I04-R00-HEADER.                                                      
154700     02 WKS-I04-R00-TPOREG       PIC 99         VALUE 00.                     
154800     02 WKS-I04-R00-SISORI       PIC 9(04)      VALUE 0500.                   
154900     02 WKS-I04-R00-SISDES       PIC 9(04)      VALUE 0500.                   
155000     02 WKS-I04-R00-FEC-MOVTO    PIC 9(08).                                   
155100     02 WKS-I04-R00-CSI-ORIG     PIC 9(02).                                   
155200     02 WKS-I04-R00-FEC-MAQ      PIC 9(08).                                   
155300     02 WKS-I04-R00-HOR-MAQ      PIC 9(06).                                   
155400     02 WKS-I04-R00-PASO         PIC X(04).                                   
155420     02 WKS-I04-R00-COPIA        PIC 9(02).                                   
155500     02 FILLER                   PIC X(20).                                   
155600                                                                              
155700 01  WKS-I04-R01-DATOS.                                                       
155800     02 WKS-I04-R01-TPOREG       PIC 9(02).                                   
155900     02 WKS-I04-R01-LLAVE        PIC 9(12)      COMP.                         
156000     02 WKS-RD-I04-R01-LLAVE     REDEFINES WKS-I04-R01-LLAVE.                 
156100        04 WKS-I04-R01-SUCTRA    PIC 9(04)      COMP.                         
156200        04 WKS-I04-R01-CAJTRA    PIC 9(02)      COMP.                         
156300        04 WKS-I04-R01-AUTTRA    PIC 9(06)      COMP.                         
156400     02 WKS-I04-R01-CTO          PIC 9(12)      COMP.                         
156500     02 WKS-I04-R01-PROD         PIC 9(04)      COMP.                         
156600     02 WKS-I04-R01-INST         PIC 9(04)      COMP.                         
156700     02 WKS-I04-R01-MONEDA       PIC 9(04)      COMP.                         
156800     02 WKS-I04-R01-CLAVE        PIC 9(04)      COMP.                         
156900     02 WKS-I04-R01-IMPORTE      PIC 9(10)V99   COMP.                         
157000     02 WKS-I04-R01-REFE         PIC 9(12)      COMP.                         
157100     02 WKS-I04-R01-AUTS151      PIC 9(08)      COMP.                         
157200     02 WKS-I04-R01-FECMAQ       PIC 9(08)      COMP.                         
157300     02 WKS-I04-R01-HORAMAQ      PIC 9(06)      COMP.                         
157400     02 WKS-I04-R01-TPOMOV       PIC 9(02)      COMP.                         
157500     02 WKS-I04-R01-SISORIG      PIC 9(04)      COMP.                         
157600     02 WKS-I04-R01-TPOPROC      PIC 9(02)      COMP.                         
157605     02 WKS-I04-R01-ESQCONT      PIC 9(04)      COMP.                         
157610     02 WKS-I04-R01-BCO-DEST     PIC 9(06)      COMP.                         
157615**      BANCO-ORIGEN  (03)                                                    
157620**      BANCO-DESTINO (03)                                                    
157700     02 FILLER                   PIC X(05).                                   
157710     02 WKS-I04-R01-MEDIOEN      PIC 9(02)      COMP.                         
157800                                                                              
157900 01  WKS-I04-R99-TRAILER.                                                     
158000     02 WKS-I04-R99-TPOREG        PIC 99            VALUE 99.                 
158100     02 WKS-I04-R99-NUMREGS       PIC 9(08)   COMP  VALUE 0.                  
158200     02 FILLER                    PIC X(54).                                  
158300                                                                              
158400*****************************************************************             
158500 01  WKS-TITULO-R00.                                                          
158600     04 FILLER                   PIC X(15) VALUE                              
158700                                 "S500/LIST/P127/".                           
158800     04 WKS-TIT-R-NODO           PIC 99.                                      
158900     04 WKS-TIT-R-SBNODO         PIC 99    VALUE 0.                           
159000     04 FILLER                   PIC X     VALUE "/".                         
159100     04 WKS-TIT-R-TPO            PIC X     VALUE "R".                         
159200     04 FILLER                   PIC X(4)  VALUE "000/".                      
159300     04 WKS-TIT-R-FEC            PIC 9(6).                                    
159400     04 FILLER                   PIC X     VALUE "/".                         
159500     04 WKS-TIT-R-MIX            PIC 9(07).                                   
159600     04 FILLER                   PIC X     VALUE "/".                         
159700     04 WKS-TIT-R-NAME           PIC X(17).                                   
159800     04 FILLER                   PIC X     VALUE ".".                         
159900                                                                              
160000***************************************************************               
160100**** LINEAS DE IMPRESION   ********************                               
160200 01  WLI-R00-L01-ENCA.                                                        
160300     02 FILLER              PIC X(19) VALUE                                   
160400                             "S500/P127/25MTP003/".                           
160500     02 WLI-R00-L01-NAME    PIC X(35) VALUE " ".                              
160600     02 FILLER              PIC X(51) VALUE                                   
160700                            "DEPOSITOS A LA VISTA".                           
160800     02 FILLER              PIC X(14) VALUE                                   
160900                            "FECHA MOVTOS: ".                                 
161000     02 WLI-R00-L01-FPROC   PIC X(13).                                        
161100     02 FILLER              PIC X(03) VALUE " ".                              
161200                                                                              
161300 01  WLI-R00-L02-ENCA.                                                        
161400     02 FILLER              PIC X(15) VALUE                                   
161500                            "FECHA PROCESO: ".                                
161600     02 WLI-R00-L02-FMAQ    PIC X(11).                                        
161700     02 FILLER              PIC X(16) VALUE " ".                              
161800     02 WLI-R00-L02-TITULO  PIC X(63) VALUE " ".                              
161900     02 FILLER              PIC X(14) VALUE                                   
162000                            "TIPO PROCESO: ".                                 
162100     02 WLI-R00-L02-TPROC   PIC X(13) VALUE "DIARIO".                         
162200                                                                              
162300 01  WLI-R00-L03-ENCA.                                                        
162400     02 FILLER              PIC X(15) VALUE                                   
162500                            "HORA  PROCESO: ".                                
162600     02 WLI-R00-L03-HR-HH   PIC 99.                                           
162620     02 FILLER              PIC X(01) VALUE ":".                              
162640     02 WLI-R00-L03-HR-MM   PIC 99.                                           
162660     02 FILLER              PIC X(01) VALUE ":".                              
162680     02 WLI-R00-L03-HR-SS   PIC 99.                                           
162700     02 FILLER              PIC X(19) VALUE " ".                              
162800     02 WLI-R00-L03-SBTIT   PIC X(63) VALUE " ".                              
162900     02 FILLER              PIC X(14) VALUE                                   
163000                            "HOJA NUM    : ".                                 
163100     02 WLI-R00-L03-NPAG    PIC ZZZZZ.                                        
163200     02 FILLER              PIC X(08) VALUE " ".                              
163300                                                                              
163400 01  WLI-R00-L04-ENCA.                                                        
163500     02 WLI-R00-L04-SUC     PIC 9(04)  VALUE 0511.                            
163600     02 FILLER              PIC X(128) VALUE " ".                             
163700                                                                              
163800 01  WLI-R00-L05-ENCA.                                                        
163900     02 WLI-R00-L05-NBSUC   PIC X(54) VALUE                                   
164000                            "CTO PROC DE VALORES".                            
164050     02 WLI-R01-L05-NCSI    PIC X(78) VALUE " ".                              
164100                                                                              
170100 01  WLI-R04-L06-ENCA.                                                        
170200     02 FILLER                   PIC X(22) VALUE                              
170300                                 "      CONTRATO  SUC ".                      
170400     02 FILLER                   PIC X(32) VALUE                              
170500                                 "N O M B R E ".                              
170600     02 FILLER                   PIC X(21) VALUE                              
170700                                 "FECHA APER ".                               
170800     02 FILLER                   PIC X(41) VALUE                              
170900                                 "S A L D O  SITUACION ".                     
171000     02 FILLER                   PIC X(16) VALUE                              
171100                                 "PROD INST MDA ".                            
171200                                                                              
171300 01  WLI-R04-L07-DETALLE.                                                     
171400     02 WLI-R04-L07-DATO.                                                     
171500        03 FILLER                   PIC X(02).                                
171600        03 WLI-R04-L07-CONTRATO     PIC Z(12).                                
171700        03 FILLER                   PIC X(02).                                
171800        03 WLI-R04-L07-SUC          PIC Z999.                                 
171900     02 WLI-R04-L07-ARCHIVO.                                                  
172000        03 FILLER                   PIC X(02).                                
172100        03 WLI-R04-L07-NOMBRE       PIC X(30).                                
172200        03 WLI-RD-R04-L07-NOMBRE    REDEFINES WLI-R04-L07-NOMBRE.             
172300           04 WLI-R04-L07-TPO-TOT   PIC X(22).                                
172400           04 FILLER                PIC X.                                    
172500           04 WLI-R04-L07-NUM-TOT   PIC ZZZ,ZZZ.                              
172600        03 FILLER                   PIC X(02).                                
172700        03 WLI-R04-L07-FEC-APE      PIC 9999/99/99.                           
172800        03 FILLER                   PIC X(01).                                
172900        03 WLI-R04-L07-SALDO        PIC ZZZ,ZZZ,ZZZ,ZZZ.ZZ-.                  
173000        03 FILLER                   PIC XX.                                   
173100        03 WLI-R04-L07-TPO-MOV      PIC X(25).                                
173200        03 WLI-R04-L07-CLAVE        PIC ZZZ.                                  
173300        03 FILLER                   PIC X(02).                                
173400        03 WLI-R04-L07-PROD         PIC Z(04).                                
173500        03 WLI-R04-L07-INST         PIC Z(05).                                
173600        03 WLI-R04-L07-MONEDA       PIC Z(04).                                
173700        03 FILLER                   PIC X(04).                                
173800                                                                              
173900**************************************************************                
174000 01  WLI-R05-DETALLE.                                                         
174100     02 FILLER               PIC X(12)    VALUE " ".                          
174200     02 WLI-R05-MENSAJE      PIC X(120).                                      
174300                                                                              
174400**********************************************************                    
174500 01  WLI-R00-L98-SININF.                                                      
174600     02 FILLER                   PIC X(30)  VALUE " ".                        
174700     02 FILLER                   PIC X(25)  VALUE                             
174800                                 "*** SIN INFORMACION ***".                   
174900 01  WLI-R00-L99-FINAL.                                                       
175000     02 FILLER                   PIC X(30)  VALUE " ".                        
175100     02 FILLER                   PIC X(25)  VALUE                             
175200                                 "*** FIN DE REPORTE ***".                    
175300                                                                              
175400***** TITULOS DE REPORTES ***********                                         
175500 01  WKS-TITULOS-R00.                                                         
177700                                                                              
177800     02 WKS-TITULO-R04.                                                       
177900        03 FILLER                PIC X(06) VALUE " ".                         
178000        03 FILLER                PIC X(22) VALUE                              
178100                                 "DETALLE DE CANCELADOS ".                    
178200        03 FILLER                PIC X(22) VALUE                              
178300                                 "POR EL SISTEMA S408 ".                      
178400                                                                              
178500     02 WKS-TITULO-R05.                                                       
178600        03 FILLER                PIC X(16)  VALUE " ".                        
178700        03 FILLER                PIC X(20)  VALUE                             
178800                                 "MENSAJES DEL PROCESO".                      
178900        03 FILLER                PIC X(14)  VALUE " ".                        
179000                                                                              
179100****************************************************************              
179200 01  WKS-TABLA-TPO-CANC.                                                      
179300     02 FILLER                   PIC X(25) VALUE                              
179400                                 "CANCELADO                ".                 
179500     02 FILLER                   PIC X(25) VALUE                              
179600                                 "APERTURA LINEA CREDITO   ".                 
179700     02 FILLER                   PIC X(25) VALUE                              
179800                                 "PROXIMA A CANCELAR       ".                 
179900     02 FILLER                   PIC X(25) VALUE                              
180000                                 "RECHAZO (SOCIO FUNDADOR) ".                 
180100     02 FILLER                   PIC X(25) VALUE                              
180200                                 "RECHAZO (NO EXISTE CTO)  ".                 
180300     02 FILLER                   PIC X(25) VALUE                              
180400                                 "RECHAZO (ERROR EN CVE)   ".                 
180500     02 FILLER                   PIC X(25) VALUE                              
180600                                 "RECHAZO (CTO CON SALDO)  ".                 
180620     02 FILLER                   PIC X(25) VALUE                              
180640                                 "APERTURA L.C. EN LINEA   ".                 
180642     02 FILLER                   PIC X(25) VALUE                              
180644                                 "RECHAZO (POR BLOQUEO)    ".                 
180646*    02 FILLER                   PIC X(25) VALUE                              
180648*                                "CANCELADO            ATM ".                 
180650*    02 FILLER                   PIC X(25) VALUE                              
180652*                                "PROXIMA A CANCELAR   ATM ".                 
180700 01  WKS-RD-TABLA-TPO-CANC       REDEFINES WKS-TABLA-TPO-CANC.                
180800     02 WKS-TB-TPO-CANC          PIC X(25) OCCURS 09 TIMES.                   
180900                                                                              
181000*********************************************************                     
182000 01 WKS-TOTAL-CANCELADOS.                                                     
182100    02 WKS-TOT-NUM-SICANC        PIC 9(06)      COMP.                         
182200    02 WKS-TOT-NUM-PRXCAN        PIC 9(06)      COMP.                         
182300    02 WKS-TOT-NUM-NOCANC        PIC 9(06)      COMP.                         
182400    02 WKS-TOT-NUM-NVALIC        PIC 9(06)      COMP.                         
182420    02 WKS-TOT-NUM-NVALCLINEA    PIC 9(06)      COMP.                         
182422*   02 WKS-TOT-NUM-SICANC-ATM    PIC 9(06)      COMP.                         
182424*   02 WKS-TOT-NUM-PRXCAN-ATM    PIC 9(06)      COMP.                         
182500                                                                              
182600***********************************************************                   
182700/                                                                             
182800********* INCLUDE DE WORKING PARA RUTINAS COMUNES *************               
182900 COPY "S500/INC/WOR/25MTP002".                                                
183000 COPY "S500/INC/WOR/DAS/25MTP006".                                            
183020                                                                              
183050 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
183100/                                                                             
183110*************************************************                             
183120*  VALUE = 1  SIN LIB S151.                                                   
183130*                                                                             
183140*  EN PRODUCCION NO CORRE CON VALUE > 0                                       
183150*                                                                             
183200************************************************************                  
183300 PROCEDURE DIVISION.                                                          
183400************************************************************                  
183500 DECLARATIVES.                                                                
183600 INTERRUPT-SECCION        SECTION  00.                                        
183700     USE AS INTERRUPT PROCEDURE.                                              
183800 INTERRUPT-BY-HI.                                                             
183900     DISALLOW  INTERRUPT.                                                     
184110     MOVE "I" TO W77-TIPO-DISP.                                               
184200     IF W77-TPO-PROC = 1                                                      
184300        MOVE " SORT ARCHIVO S408"  TO WS-0101-TEXT-MSG                        
184400     ELSE                                                                     
185310     IF W77-TPO-PROC = 3                                                      
185400        MOVE " PROCESO ARCHIVO S408" TO WS-0101-TEXT-MSG                      
185405     ELSE                                                                     
185410        MOVE " VALIDO BASE Y ARCHIVOS" TO WS-0101-TEXT-MSG.                   
185420                                                                              
185440     PERFORM 70000050-MENSAJE.                                                
185450     MOVE "E" TO W77-TIPO-DISP.                                               
185500 END-INTERRUPT-BY-HI.                                                         
185600     ALLOW INTERRUPT.                                                         
185700 END DECLARATIVES.                                                            
185800*************************************                                         
185900 00000000-CONTROL  SECTION.                                                   
186000 00000000-CONTROL-PROGRAMA.                                                   
186002                                                                              
186004     MOVE 2            TO W77-USO-LIBLJ.                                      
186006     MOVE "S500P127"   TO W77-S000-MY-ID.                                     
186010     MOVE "P127"       TO WS-0101-PASO-MSG.                                   
186012     MOVE "P127"       TO B91-IDPROG.                                         
186014     MOVE "25MTP003"   TO WS-0101-MTP-MSG W77-S000-MY-VERSION.                
186016                                                                              
186040     PERFORM 10000100-VERSIONES.                                              
186050     PERFORM 1000038-S038L035.                                                
186051     MOVE 1                    TO W77-ID-NUM-COPIA-MAPLI.                     
186052     MOVE 1                    TO W77-ID-TPODSP-INFO-MAPLI.                   
186053     MOVE 0                    TO W77-ID-ESINI-GRUPO-MAPLI.                   
186054     MOVE 06                   TO W77-ID-NUM-GRUPO-MAPLI.                     
186055     MOVE "BATCH DIARIO"       TO W77-ID-NOMB-LIB.                            
186060     PERFORM 70000950-INI-PGM-MAPLI.                                          
186063                                                                              
186064     MOVE 1                                TO W77-ID-ACTXX-MAPLI              
186065                                              W77-ID-ACT01-MAPLI.             
186066     MOVE "ABRE Y VALIDA BASE  "           TO W77-ID-NOMB-ACT.                
186068     MOVE "PROCESO DE INICIO DE UNICA VEZ" TO W77-ID-TXTA-LIB.                
186070     MOVE 1                                TO W77-ID-NUMREG-PROC.             
186072     PERFORM 70099998-INIACT-MAPLI.                                           
186076                                                                              
186100     PERFORM 00000010-INICIO-PGM.                                             
186200     PERFORM 10000000-TITLE-LIBRERIAS.                                        
186300     PERFORM 20000000-ABRE-BASE.                                              
186310                                                                              
186320     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186322     MOVE " "                TO W77-ID-TXTA-LIB.                              
186330     PERFORM 70099998-ACT-REGPROC.                                            
186340     MOVE W77-ID-ACT01-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186350     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
186360                                                                              
186365     MOVE 2                                TO W77-ID-ACTXX-MAPLI              
186367                                              W77-ID-ACT02-MAPLI.             
186370     MOVE "APLICA ARCH S408    "           TO W77-ID-NOMB-ACT.                
186375     MOVE "BLOQUEO DE CTOS DEL ARCH S408 " TO W77-ID-TXTA-LIB.                
186380     MOVE 1                                TO W77-ID-NUMREG-PROC.             
186385     PERFORM 70099998-INIACT-MAPLI.                                           
186390                                                                              
186400     PERFORM 50000000-PROCESO-PRINCIPAL.                                      
186402                                                                              
186404     MOVE W77-ID-ACT02-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186405     MOVE " "                TO W77-ID-TXTA-LIB.                              
186406     PERFORM 70099998-ACT-REGPROC.                                            
186408     MOVE W77-ID-ACT02-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186410     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
186412                                                                              
186429     MOVE 3                              TO W77-ID-ACTXX-MAPLI                
186430                                            W77-ID-ACT03-MAPLI.               
186431     MOVE "ACT CIFRAS Y FINAL "          TO W77-ID-NOMB-ACT.                  
186440     MOVE "ACTUALIZACION FINAL Y CLOSE " TO W77-ID-TXTA-LIB.                  
186450     MOVE 1                              TO W77-ID-NUMREG-PROC.               
186460     PERFORM 70099998-INIACT-MAPLI.                                           
186480                                                                              
186500     PERFORM 59000000-ACTUALIZA-CONTROL.                                      
186600     PERFORM 59999990-FIN-PGM.                                                
186605                                                                              
186610     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186612     MOVE " "                TO W77-ID-TXTA-LIB.                              
186615     PERFORM 70099998-ACT-REGPROC.                                            
186620     MOVE W77-ID-ACT03-MAPLI TO W77-ID-ACTXX-MAPLI.                           
186625     PERFORM 70099998-FIN-ACTI-MAPLI.                                         
186630                                                                              
186650     PERFORM 70000950-FIN-PGM-MAPLI.                                          
186690     STOP RUN.                                                                
186700                                                                              
186710*******************************************************                       
186800 00000010-INICIO-PGM.                                                         
187330                                                                              
187350     MOVE ZEROS     TO WKS-TB-NUMACT-LIBS.                                    
187352     MOVE 20        TO WKS-NUMACT-LIB(12).                                    
187354     MOVE 21        TO WKS-NUMACT-LIB(13).                                    
187356     MOVE 22        TO WKS-NUMACT-LIB(15).                                    
187360     MOVE 23        TO WKS-NUMACT-LIB(49).                                    
187400                                                                              
187405     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-TASKVALUE-PBA.                 
187410                                                                              
187415     PERFORM 00000000-CHANGE-SOPCOMS.                                         
187420     PERFORM 0000-CALL-HOSTNAME.                                              
187425     MOVE WS-DH-NOM-EQUIPO TO WKS-NAME-HOST                                   
187430                                                                              
187435     IF WS-DH-HOSTNAME-PBA OR WS-DH-HOSTNAME-SIT OR                           
187440        WS-DH-HOSTNAME-UAT                                                    
187455        MOVE 1 TO W77-ES-PRUEBA.                                              
187500                                                                              
187505     IF W77-ES-PRUEBA = 0                                                     
187510        IF WKS-TASKVALUE-PBA > 0                                              
187525           STRING  "EN PRODUCCION NO CORRE CON VALUE > 0 ",                   
187530                   " VALUE=", WKS-TASKVALUE-PBA                               
187535             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
187540           PERFORM 70000050-MENSAJE                                           
187545           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
187600                                                                              
187800                                                                              
187900     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
188000            OF MYSELF.                                                        
188100     ALLOW INTERRUPT.                                                         
188200                                                                              
188210*************************************************************                 
188300 10000000-TITLE-LIBRERIAS.                                                    
188500*************************** LIBRERIA DE VERSIONES ***********                 
188600***  PERFORM 10000100-VERSIONES.                                              
188610     PERFORM 20000100-CHECAME-VERSION.                                        
188620     IF S000-CTR-CVEERROR < 0                                                 
188650        MOVE "ERROR DE VERSION "    TO WS-0101-TEXT-MSG                       
188660        PERFORM 70000050-MENSAJE                                              
188670        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
188700                                                                              
188800*************************** LIBRERIA DE FECHAS  ***************               
188900     PERFORM 10000006-LOCSUP.                                                 
189000                                                                              
189400*************** LIBRERIA MOVIMIENTOS Y SALDOS  AL(S151)  *****                
189500     PERFORM 10000151-REGISTRA.                                               
189600                                                                              
190000**************************************************************                
190100 20000000-ABRE-BASE.                                                          
190200     OPEN UPDATE S500BD01CAPTACION.                                           
190300     PERFORM 20001000-VALIDA-BASE.                                            
190400                                                                              
190500     PERFORM 20003000-INICIA-WORKING.                                         
190600                                                                              
190700     MOVE ALL @00@          TO WKS-TABLA-CVES-VAL                             
190800                               WKS-TABLA-INSTRUMENT.                          
190900     MOVE ZEROS             TO WKS-IND-TBCVE                                  
191000                               WKS-IND-INST.                                  
191100                                                                              
191200     SET S500B17CVESXFUN    TO BEGINNING.                                     
191300     SET S500B05INSTRUMEN   TO BEGINNING.                                     
191400     PERFORM 20001080-CARGA-CLAVES-VAL   UNTIL W77-EOF-CVES = 1.              
191500     PERFORM 20002000-CARGA-INSTRUMENTOS UNTIL W77-EOF-INST = 1.              
191600     PERFORM 20004000-VALIDA-ARCHIVOS.                                        
191700                                                                              
191800     IF W77-NOHAY-S408 = 0                                                    
191900        MOVE 1  TO W77-TPO-PROC                                               
192000        PERFORM 20004800-CLASI-S408.                                          
192600                                                                              
192700     PERFORM 20005000-ABRE-ARCHIVOS.                                          
192800                                                                              
192900*************************************************************                 
193000 20001000-VALIDA-BASE.                                                        
193010     PERFORM 90000000-B00CTRLPASO-LOCK.                                       
193020     IF WS-STATUS-BASE > 0                                                    
193050        STRING "ERR LOCK B00CTRLPASO (01) ", WS-STATUS-BASE                   
193060               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
193070        PERFORM 70000050-MENSAJE                                              
193080        CALL SYSTEM DMTERMINATE.                                              
193090                                                                              
193100     PERFORM 90000002-B02CONTROL-FIND.                                        
193200     IF WS-STATUS-BASE > 0                                                    
193500        STRING "ERR FIND B02CONTROL ", WS-STATUS-BASE                         
193600               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
193700        PERFORM 70000050-MENSAJE                                              
193800        CALL SYSTEM DMTERMINATE.                                              
193900                                                                              
194000      IF B00-NUM-PASO-01 = 120                                                
194100     AND B00-NUM-PASO-02 = 120                                                
194150     AND B00-NUM-PASO-03 = 120                                                
194200         NEXT SENTENCE                                                        
194300      ELSE                                                                    
194600         MOVE B00-NUM-PASO-01   TO WS-MSG-PASO                                
194700         MOVE B00-NUM-PASO-02   TO WS-MSG-MDA                                 
194750         MOVE B00-NUM-PASO-03   TO WS-MSG-CVE                                 
194800         STRING "ERROR SEQ PROCESO"                                           
194900                " B00-NUM-PASO-01=" WS-MSG-PASO                               
195000                " B00-NUM-PASO-02=" WS-MSG-MDA                                
195050                " B00-NUM-PASO-03=" WS-MSG-CVE                                
195100                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
195200         PERFORM 70000050-MENSAJE                                             
195300         CALL SYSTEM DMTERMINATE.                                             
195900                                                                              
196000     MOVE B02-NUM-CSI       TO W77-MY-CSI.                                    
196100     MOVE B02-FECHA-LOTE    TO WKS-FEC-BASE-08.                               
196110     MOVE WKS-DD-FBASE      TO WKS-DD-FBAS-DMA                                
196112                               WKS-DD-FPRC-EDIT.                              
196115     MOVE WKS-MM-FBASE      TO WKS-MM-FBAS-DMA.                               
196120     MOVE WKS-AAAA-FBASE    TO WKS-AAAA-FBAS-DMA                              
196140                               WKS-AAAA-FPRC-EDIT.                            
196160     MOVE WKS-TBX-MES(WKS-MM-FBASE) TO WKS-MM-FPRC-EDIT.                      
196200     MOVE ZERO              TO W77-MY-AUTORIZ.                                
196800                                                                              
196900     MOVE 0                     TO B00-NUM-PASO-01.                           
197000     MOVE 127                   TO B00-NUM-PASO-02 B00-NUM-PASO-03            
197100                                                                              
197200     PERFORM 90000000-BEGIN-TRANSACTION.                                      
197300     IF WS-STATUS-BASE > 0                                                    
197400        CALL SYSTEM DMTERMINATE.                                              
197500     PERFORM 90000000-B00CTRLPASO-STORE.                                      
197600     IF WS-STATUS-BASE > 0                                                    
197900        STRING "ERR STORE B00CTRLPASO (01) ", WS-STATUS-BASE                  
198000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
198100        PERFORM 70000050-MENSAJE                                              
198200        CALL SYSTEM DMTERMINATE.                                              
198300                                                                              
198400     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
198600                                                                              
198700     CHANGE ATTRIBUTE MAXCARDS OF MYSELF TO W77-SET-MAXCARDS.                 
198800                                                                              
198900*********************************************************                     
199000 20001080-CARGA-CLAVES-VAL.                                                   
199100     PERFORM 90000017-B17CVESXFUN-FINDN.                                      
199200     IF WS-STATUS-BASE = 0                                                    
199300        PERFORM 20001090-SUBE-CVE-VAL                                         
199400     ELSE                                                                     
199500     IF WS-DB-NOTFOUND                                                        
199600        MOVE 1 TO W77-EOF-CVES                                                
199700     ELSE                                                                     
200000       STRING "ERR B17CVESXFUN-FINDN ", WS-STATUS-BASE                        
200100              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
200200       MOVE WS-0101-TEXT-MSG   TO WLI-R05-MENSAJE                             
200300       PERFORM 60003000-ESC-MENSAJE                                           
200400       PERFORM 70000050-MENSAJE                                               
200500       CALL SYSTEM DMTERMINATE.                                               
200600                                                                              
200700*********************************************************                     
200800 20001090-SUBE-CVE-VAL.                                                       
200900     ADD 1 TO WKS-IND-TBCVE.                                                  
201000     IF WKS-IND-TBCVE > 2000                                                  
201300        MOVE "MAS DE 2000 CVES X FUN EN BASE" TO WS-0101-TEXT-MSG             
201400        MOVE WS-0101-TEXT-MSG   TO WLI-R05-MENSAJE                            
201500        PERFORM 60003000-ESC-MENSAJE                                          
201600        PERFORM 70000050-MENSAJE                                              
201700        CALL SYSTEM DMTERMINATE.                                              
201800     MOVE B17-CLAVE-TRANS      TO WKS-TB-CVEVAL(WKS-IND-TBCVE).               
201900     MOVE WKS-IND-TBCVE        TO WKS-NUM-MXCVE.                              
202000                                                                              
202100*******************************************************                       
202200 20002000-CARGA-INSTRUMENTOS.                                                 
202300     PERFORM 90000005-B05INSTRUMEN-FINDN.                                     
202400     IF WS-STATUS-BASE = 0                                                    
202500        PERFORM 20002100-CARGA-INSTR                                          
202600     ELSE                                                                     
202700     IF WS-DB-NOTFOUND                                                        
202800        MOVE 1 TO W77-EOF-INST                                                
202900     ELSE                                                                     
203200       STRING "ERR B05FINDNEXT ", WS-STATUS-BASE                              
203300              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
203400       MOVE WS-0101-TEXT-MSG   TO WLI-R05-MENSAJE                             
203500       PERFORM 60003000-ESC-MENSAJE                                           
203600       PERFORM 70000050-MENSAJE                                               
203700       CALL SYSTEM DMTERMINATE.                                               
203800                                                                              
203900************************************************************                  
204000 20002100-CARGA-INSTR.                                                        
204100     ADD  1                    TO WKS-IND-INST.                               
204200     IF WKS-IND-INST > 30                                                     
204500        MOVE "MAS DE 30 INST. EN LA BASE" TO WS-0101-TEXT-MSG                 
204600        MOVE WS-0101-TEXT-MSG   TO WLI-R05-MENSAJE                            
204700        PERFORM 60003000-ESC-MENSAJE                                          
204800        PERFORM 70000050-MENSAJE                                              
204900        CALL SYSTEM DMTERMINATE.                                              
204910                                                                              
205000     MOVE B05INSTRUMEN  TO WKS-TAB-B05-INSTRUM (WKS-IND-INST).                
205100                                                                              
205200**************************************************************                
205300 20003000-INICIA-WORKING.                                                     
205400     ACCEPT WKS-TIME-MAQ        FROM TIME.                                    
205500     PERFORM 90000000-DAME-FEC-MAQUINA.                                       
205510                                                                              
205520     MOVE WKS-AAAA-MAQ             TO WKS-AAAA-FMAQ-EDIT.                     
205530     MOVE WKS-DD-MAQ               TO WKS-DD-FMAQ-EDIT.                       
205540     MOVE WKS-TBX-MES(WKS-MM-MAQ)  TO WKS-MM-FMAQ-EDIT.                       
205550                                                                              
205600     MOVE   WKS-FEC-BASE-08     TO WKS-TIT-S408-FEC                           
205700                                   WKS-TIT-FEC-I03                            
205800                                   WKS-TIT-FEC-I04.                           
205810                                                                              
205900     MOVE   W77-MY-CSI          TO WKS-TIT-S408-CSI                           
206000                                   WKS-TIT-CSI-I03                            
206100                                   WKS-TIT-CSI-I04.                           
206110                                                                              
206200     MOVE ATTRIBUTE MIXNUMBER   OF MYSELF TO W77-NUM-MIX.                     
206300     MOVE   W77-MY-CSI          TO WKS-TIT-R-NODO.                            
206400     MOVE   W77-NUM-MIX         TO WKS-TIT-R-MIX.                             
206500     MOVE   WKS-FEC-BASE-08     TO WKS-TIT-R-FEC.                             
206600     MOVE   WKS-FECPROC-EDIT    TO WLI-R00-L01-FPROC.                         
206700     MOVE   WKS-FECMAQ-EDIT     TO WLI-R00-L02-FMAQ.                          
206720                                                                              
206740     MOVE WKS-HRMAQ-HH          TO WLI-R00-L03-HR-HH.                         
206760     MOVE WKS-HRMAQ-MM          TO WLI-R00-L03-HR-MM.                         
206780     MOVE WKS-HRMAQ-SS          TO WLI-R00-L03-HR-SS.                         
206800                                                                              
206900                                                                              
207200     MOVE   " "                 TO WLI-R04-L07-DETALLE                        
207300                                   WLI-R05-DETALLE.                           
207400                                                                              
207500     MOVE ALL @00@              TO WKS-TOTAL-CVES-01                          
207520                                   WKS-TOTAL-CVES-02                          
207540                                   WKS-TOTAL-CVES-03                          
207560                                   WKS-TOTAL-CVES-04                          
207580                                   WKS-TOTAL-CVES-05                          
207600                                   WKS-TOTAL-CVES-06                          
207620                                   WKS-TOTAL-CVES-07                          
207640                                   WKS-TOTAL-CVES-08                          
207660                                   WKS-TOTAL-CVES-09                          
207680                                   WKS-TOTAL-CVES-10                          
207700                                   WKS-TOTAL-CVES-11                          
207720                                   WKS-TOTAL-CVES-12                          
207740                                   WKS-TOTAL-CVES-13                          
207760                                   WKS-TOTAL-CVES-14                          
207780                                   WKS-TOTAL-CVES-15                          
207800                                   WKS-TOTAL-CVES-16                          
207820                                   WKS-TOTAL-CVES-17                          
207840                                   WKS-TOTAL-CVES-18                          
207860                                   WKS-TOTAL-CVES-19                          
207880                                   WKS-TOTAL-CVES-20                          
208100                                   WKS-TOTAL-CANCELADOS.                      
208200                                                                              
208220     IF W77-MY-CSI = 4                                                        
208240        MOVE "C.S.I. MONTERREY"       TO WLI-R01-L05-NCSI                     
208260     ELSE                                                                     
208280        MOVE "C.S.I. MEXICO   "       TO WLI-R01-L05-NCSI.                    
208300                                                                              
208400     PERFORM 20003500-ABRE-REPORTES.                                          
208500                                                                              
208600     PERFORM 20003100-FECHAS.                                                 
208700                                                                              
208800**********************************************************                    
208900 20003100-FECHAS.                                                             
209000********  PIDE QUE DIA DE LA SEMANA ES HOY ********                           
209100     MOVE WKS-FEC-BASE-08        TO WS-S006-FECHA1.                           
209200     MOVE 1                      TO WS-S006-FECHA2.                           
209300     MOVE 12                     TO WS-S006-FORMATO.                          
209400     MOVE 6                      TO WS-S006-FUNCION.                          
209500     PERFORM 20003150-LLAMA-LOCSUP.                                           
209600     MOVE WS-S006-FECHA1           TO WKS-DIA-SEMHOY.                         
209700                                                                              
209800     COMPUTE WKS-IND-99 = WKS-DIA-SEMHOY + 1.                                 
209900     MOVE WKS-FEC-BASE-08        TO W77-FECHA-EDIT.                           
210000     IF WKS-IND-99 > 0 AND < 8                                                
210100        STRING "HOY ES              ", WKS-FECPROC-EDIT                       
210200               " ", WKS-TB-QDIASEM(WKS-IND-99)                                
210300               DELIMITED BY SIZE INTO WLI-R05-MENSAJE                         
210400     ELSE                                                                     
210500        MOVE WKS-DIA-SEMHOY  TO WS-MSG-N-02                                   
210600        STRING " EL DIA DE HOY ES ", WS-MSG-N-02                              
210700               " ", W77-FECHA-EDIT                                            
210800               DELIMITED BY SIZE INTO WLI-R05-MENSAJE.                        
210900                                                                              
211000     PERFORM 60003000-ESC-MENSAJE.                                            
211100                                                                              
211200********  PIDE SIGUIENTE FECHA HABIL  ********                                
211300     MOVE WKS-FEC-BASE-08        TO WS-S006-FECHA1.                           
211400     MOVE 1                      TO WS-S006-FECHA2.                           
211500     MOVE 12                     TO WS-S006-FORMATO.                          
211600     MOVE 13                     TO WS-S006-FUNCION.                          
211700     PERFORM 20003150-LLAMA-LOCSUP.                                           
211800     MOVE WS-S006-FECHA1      TO WKS-FEC-PROX-08                              
212000                                 W77-FECHA-EDIT.                              
212100***  STRING "SIGUIENTE FECHA HABIL ", W77-FECHA-EDIT                          
212200***         DELIMITED BY SIZE INTO WLI-R05-MENSAJE.                           
212300***  PERFORM 60003000-ESC-MENSAJE.                                            
212400                                                                              
212500********  PIDE DIA DE LA SEMANA SIGUIENTE FECHA HABIL **                      
212600     MOVE WKS-FEC-PROX-08        TO WS-S006-FECHA1.                           
212700     MOVE 1                      TO WS-S006-FECHA2.                           
212800     MOVE 12                     TO WS-S006-FORMATO.                          
212900     MOVE 6                      TO WS-S006-FUNCION.                          
213000     PERFORM 20003150-LLAMA-LOCSUP.                                           
213100     MOVE WS-S006-FECHA1           TO WKS-DIA-SEMPROX.                        
213200                                                                              
213300     COMPUTE WKS-IND-99 = WKS-DIA-SEMPROX + 1.                                
213400     IF WKS-IND-99 > 0 AND < 8                                                
213500        STRING "PROXIMO DIA HABIL   ", W77-FECHA-EDIT                         
213600               "  ", WKS-TB-QDIASEM(WKS-IND-99)                               
213700               DELIMITED BY SIZE INTO WLI-R05-MENSAJE                         
213800     ELSE                                                                     
213900        MOVE WKS-DIA-SEMPROX  TO WS-MSG-N-02                                  
214000        STRING "SIGUIENTE DIA HABIL ES ", WS-MSG-N-02                         
214100               DELIMITED BY SIZE INTO WLI-R05-MENSAJE.                        
214200                                                                              
214300     PERFORM 60003000-ESC-MENSAJE.                                            
214400                                                                              
214500********  PIDE DIA HABIL ANTERIOR   ******************                        
214600     MOVE WKS-FEC-BASE-08        TO WS-S006-FECHA1.                           
214700     MOVE 1                      TO WS-S006-FECHA2.                           
214800     MOVE 12                     TO WS-S006-FORMATO.                          
214900     MOVE 15                     TO WS-S006-FUNCION.                          
215000     PERFORM 20003150-LLAMA-LOCSUP.                                           
215100     MOVE WS-S006-FECHA1      TO WKS-FEC-ANT-08.                              
215200                                                                              
215300**** VERIFICA SI ES FIN DE SEMANA *************                               
215400     IF WKS-DIA-SEMHOY > WKS-DIA-SEMPROX                                      
215500        MOVE " ES PROCESO SEMANAL " TO WLI-R05-MENSAJE                        
215600        PERFORM 60003000-ESC-MENSAJE                                          
215700        MOVE 1                      TO WKS-ES-SEMANAL                         
216000     ELSE                                                                     
216100        MOVE 0                      TO WKS-ES-SEMANAL.                        
216105                                                                              
216110*************************************************************                 
216115 20003150-LLAMA-LOCSUP.                                                       
216120     PERFORM 20000006-LOCSUP.                                                 
216125                                                                              
216130     IF WS-S006-FUNCION > 0                                                   
216135        MOVE WS-S006-FORMATO  TO WS-MSG-N-02                                  
216140        MOVE WS-S006-FUNCION  TO WS-MSG-N-04                                  
216145        STRING "ERR CALL LOCSUP ",                                            
216150               " FUNC ", WS-MSG-N-04                                          
216155               " FMTO ", WS-MSG-N-02                                          
216160               " FEC1 ", WS-S006-FECHA1                                       
216165               " FEC2 ", WS-S006-FECHA2                                       
216170               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
216175        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
216180        PERFORM 60003000-ESC-MENSAJE                                          
216185        PERFORM 70000050-MENSAJE                                              
216190        CALL SYSTEM DMTERMINATE.                                              
216200                                                                              
216300**************************************************************                
216400 20003500-ABRE-REPORTES.                                                      
216800     SET  R04-CANCS408  (USERBACKUPNAME)  TO VALUE TRUE.                      
216900     SET  R05-MENSAJES  (USERBACKUPNAME)  TO VALUE TRUE.                      
218100                                                                              
218200     MOVE "004CANCELAS408"       TO WKS-TIT-R-NAME.                           
218300     SET  R04-CANCS408  (TITLE)  TO WKS-TITULO-R00.                           
218400                                                                              
218500     MOVE "005MENSAJES"          TO WKS-TIT-R-NAME.                           
218600     SET  R05-MENSAJES  (TITLE)  TO WKS-TITULO-R00.                           
218700                                                                              
219100     OPEN OUTPUT   R04-CANCS408.                                              
219200     OPEN OUTPUT   R05-MENSAJES.                                              
219220     MOVE 1 TO W77-OPEN-R05.                                                  
219300                                                                              
219400************************************************************                  
219500 20004000-VALIDA-ARCHIVOS.                                                    
223100***  CHANGE ATTRIBUTE FILETYPE OF E01-MOVS408 TO 7.                           
223200     OPEN INPUT E01-MOVS408.                                                  
223300     PERFORM 20004700-VALIDA-S408.                                            
223400     CLOSE E01-MOVS408 WITH SAVE.                                             
223500                                                                              
223600     OPEN INPUT  I03-PUNTEOIN.                                                
223700     OPEN OUTPUT I04-PUNTEOOUT.                                               
223800                                                                              
223900     PERFORM 20004720-VALIDA-PUNTEO.                                          
224000     PERFORM 20004730-PASA-PUNTEOIN.                                          
224100                                                                              
224200     CLOSE I03-PUNTEOIN WITH SAVE.                                            
224300                                                                              
224400*******************************************************                       
231800 20004700-VALIDA-S408.                                                        
231900     MOVE ATTRIBUTE LASTRECORD OF E01-MOVS408                                 
232000       TO W77-LASTREC-S408.                                                   
232100     ADD 10         TO W77-LASTREC-S408.                                      
232200                                                                              
232300     READ E01-MOVS408 INTO WKS-E01-R00-MOVS408 AT END                         
232400          MOVE "ARCHIVO S408 VACIO " TO WLI-R05-MENSAJE                       
232500          PERFORM 60003000-ESC-MENSAJE                                        
232600          MOVE 1   TO W77-NOHAY-S408.                                         
232700                                                                              
232800     IF W77-NOHAY-S408 = 0                                                    
232900        IF WKS-E01-R00-FEC-PRO NOT = WKS-FEC-BASE                             
233000           MOVE WKS-E01-R00-FEC-PRO  TO W77-FECHA-06-EDIT                     
233100           STRING "ERR FECHA E01-MOVS408 ", W77-FECHA-06-EDIT                 
233200                  DELIMITED BY SIZE INTO WLI-R05-MENSAJE                      
233300           PERFORM 60003000-ESC-MENSAJE                                       
233400           MOVE 1   TO W77-NOHAY-S408.                                        
233500                                                                              
233600     IF W77-NOHAY-S408 = 0                                                    
233700        IF  WKS-E01-R00-SISORI = "S408"                                       
233800        AND WKS-E01-R00-SISDES = "S500"                                       
233900            MOVE "HEADER ARCH  S408 MOVNOCONT OK "                            
234000              TO WLI-R05-MENSAJE                                              
234100            PERFORM 60003000-ESC-MENSAJE                                      
234200            STRING "SE APLICO ARCH: " WKS-TIT-S408                            
234300                   DELIMITED BY SIZE INTO WLI-R05-MENSAJE                     
234400            PERFORM 60003000-ESC-MENSAJE                                      
234500        ELSE                                                                  
234600          STRING "ERR E01-MOVS408 NUM-SISTEMAS "                              
234700                 " SISORIG =" WKS-E01-R00-SISORI                              
234800                 " SISDEST =" WKS-E01-R00-SISDES                              
234900                 DELIMITED BY SIZE INTO WLI-R05-MENSAJE                       
235000            PERFORM 60003000-ESC-MENSAJE                                      
235100            MOVE 1 TO W77-NOHAY-S408.                                         
235200                                                                              
235300**************************************************************                
235400 20004720-VALIDA-PUNTEO.                                                      
235500     READ I03-PUNTEOIN INTO WKS-I04-R00-HEADER AT END                         
235800          MOVE "ARCH PUNTEO VACIO "      TO WS-0101-TEXT-MSG                  
235900          MOVE WS-0101-TEXT-MSG          TO WLI-R05-MENSAJE                   
236000          PERFORM 60003000-ESC-MENSAJE                                        
236100          PERFORM 70000050-MENSAJE                                            
236200          CALL SYSTEM DMTERMINATE.                                            
236300                                                                              
236400     IF  WKS-I04-R00-TPOREG    = 0                                            
236500     AND WKS-I04-R00-SISORI    = 500                                          
236600     AND WKS-I04-R00-SISDES    = 500                                          
236700     AND WKS-I04-R00-FEC-MOVTO = WKS-FEC-BASE-08                              
236800     AND WKS-I04-R00-CSI-ORIG  = W77-MY-CSI                                   
236900     AND WKS-I04-R00-PASO      = "P120"                                       
236910     AND WKS-I04-R00-COPIA     = 01                                           
237000         MOVE WKS-FEC-MAQ-08  TO WKS-I04-R00-FEC-MAQ                          
237100         MOVE WKS-HORA-MAQ    TO WKS-I04-R00-HOR-MAQ                          
237200         MOVE "P127"          TO WKS-I04-R00-PASO                             
237220         MOVE 01              TO WKS-I04-R00-COPIA                            
237300     ELSE                                                                     
237600         MOVE   "ERR HEADER PUNTEO " TO WS-0101-TEXT-MSG                      
237700         STRING "ERR HEADER PUNTEO ", WKS-I04-R00-HEADER                      
237800                DELIMITED BY SIZE INTO WLI-R05-MENSAJE                        
237900         PERFORM 60003000-ESC-MENSAJE                                         
238000         PERFORM 70000050-MENSAJE                                             
238100         CALL SYSTEM DMTERMINATE.                                             
238200                                                                              
238210***********************************************************                   
238300 20004730-PASA-PUNTEOIN.                                                      
238400     MOVE WKS-I04-R00-HEADER  TO I04-R00-PUNTEOOUT.                           
238500     PERFORM 20004760-ESCRIBE-PUNTEO.                                         
238600     PERFORM 20004740-LEE-ESC-PUNTEO  UNTIL W77-EOF-I03 = 1.                  
238700                                                                              
238710*********************************************************                     
238800 20004740-LEE-ESC-PUNTEO.                                                     
238900     READ I03-PUNTEOIN INTO WKS-I04-R01-DATOS AT END                          
239000          MOVE 1 TO W77-EOF-I03.                                              
239100                                                                              
239200     IF WKS-I04-R01-TPOREG = 99                                               
239300        MOVE 1   TO W77-EOF-I03.                                              
239400                                                                              
239500     IF W77-EOF-I03 = 0                                                       
239600        MOVE WKS-I04-R01-DATOS TO I04-R00-PUNTEOOUT                           
239700        PERFORM 20004760-ESCRIBE-PUNTEO.                                      
239800                                                                              
239810************************************************************                  
239900 20004760-ESCRIBE-PUNTEO.                                                     
240000     WRITE I04-R00-PUNTEOOUT INVALID KEY                                      
240300       MOVE "ERR WRITE PUNTEO I04 " TO WS-0101-TEXT-MSG                       
240400       STRING "ERR WRITE PUNTEO I04 ", WKS-I04-R01-DATOS                      
240500          DELIMITED BY SIZE INTO WLI-R05-MENSAJE                              
240600       PERFORM 60003000-ESC-MENSAJE                                           
240700       PERFORM 70000050-MENSAJE                                               
240800       CALL SYSTEM DMTERMINATE.                                               
240900                                                                              
241000     ADD 1 TO WKS-I04-R99-NUMREGS.                                            
241100                                                                              
241200***********************************************************                   
241300 20004800-CLASI-S408.                                                         
241400     COMPUTE W77-TOT-DSKSIZE = W77-LASTREC-S408 * 06 * 3.5.                   
241500***  COMPUTE W77-TOT-MEMSIZE = (09 * 2000) + 1500.                            
241510                                                                              
241520     COMPUTE W77-TOT-MEMSIZE  =                                               
241530             ((W77-LASTREC-S408 / 16) * 09) + 1500.                           
241540     IF W77-TOT-MEMSIZE < 400000                                              
241550        MOVE 400000 TO W77-TOT-MEMSIZE                                        
241560     ELSE                                                                     
241570     IF W77-TOT-MEMSIZE > 258435000                                           
241580        MOVE 258435000 TO W77-TOT-MEMSIZE.                                    
241581                                                                              
241582     MOVE  W77-TOT-DSKSIZE  TO WS-MSG-N-14.                                   
241583     MOVE  W77-TOT-MEMSIZE  TO WS-MSG-N-12.                                   
241584     STRING "DISK-SIZE =" WS-MSG-N-14                                         
241585            ", MEMORY-SIZE =" WS-MSG-N-12                                     
241586            ", PARA SORT MOVS-S408 "                                          
241587                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
241588     MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                                
241589     PERFORM 60003000-ESC-MENSAJE                                             
241590     PERFORM 70000050-MENSAJE.                                                
241591                                                                              
241600     SORT S02-SORTMVS408 ON ASCENDING KEY  S02-R00-TPO-REG                    
241700                                     S02-R00-CONTRATO                         
241800                                     S02-R00-CLAVE                            
241900          USING  E01-MOVS408                                                  
242000          GIVING E01-MOVS408                                                  
242100          MEMORY SIZE W77-TOT-MEMSIZE WORDS                                   
242200          DISK   SIZE W77-TOT-DSKSIZE WORDS.                                  
242300                                                                              
242400**********************************************************                    
243500 20005000-ABRE-ARCHIVOS.                                                      
243600     IF W77-NOHAY-S408 = 0                                                    
243700***     CHANGE ATTRIBUTE FILETYPE OF E01-MOVS408 TO 7                         
243800        OPEN INPUT E01-MOVS408.                                               
243900                                                                              
244300************************************************************                  
244400 40004900-S151-INICIO.                                                        
244500     MOVE 11                 TO WS-S151-0101-FUNCION-I.                       
244600     MOVE WKS-FEC-BASE-08    TO WS-S151-0101-FECCONT-I                        
244700                                WS-S151-0101-FECMOV-I.                        
244800     MOVE WKS-HORA-MAQ       TO WS-S151-0101-HORAMOV-I.                       
244900     MOVE 27                 TO WS-S151-0101-TIPO-PROC-I.                     
244920                                                                              
244940     IF WKS-SIN-LBS151 = 1                                                    
244960        MOVE ZERO  TO WS-S151-0101-STATUS                                     
244980     ELSE                                                                     
245000        PERFORM 20000151-CARGAMOV1.                                           
245010                                                                              
245100     IF WS-S151-0101-STATUS > 0                                               
245400        MOVE WS-S151-0101-STATUS         TO WS-MSG-N-04                       
245500        STRING " ERROR EN INICIO LIB S151 ", WS-MSG-N-04                      
245600               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
245700        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
245800        PERFORM 60003000-ESC-MENSAJE                                          
245900        PERFORM 70000050-MENSAJE                                              
246000        CALL SYSTEM DMTERMINATE.                                              
246100                                                                              
246200***************************************************************               
246300 40005000-S151-DELMOV1.                                                       
246400     MOVE 21                 TO WS-S151-0101-FUNCION-I.                       
246500     MOVE WKS-FEC-BASE-08    TO WS-S151-0101-FECCONT-I                        
246600                                WS-S151-0101-FECMOV-I.                        
246700     MOVE ZEROS              TO WS-S151-0101-PRODUCT-I                        
246800                                WS-S151-0101-INSTRUMENTO-I.                   
246900     MOVE WKS-HORA-MAQ       TO WS-S151-0101-HORAMOV-I.                       
247000     MOVE 27                 TO WS-S151-0101-TIPO-PROC-I.                     
247020                                                                              
247040     IF WKS-SIN-LBS151 = 1                                                    
247100        MOVE ZERO  TO WS-S151-0101-STATUS                                     
247120     ELSE                                                                     
247140        PERFORM 20000151-CARGAMOV1.                                           
247200                                                                              
247300     IF WS-S151-0101-STATUS > 0                                               
247600        MOVE WS-S151-0101-STATUS         TO WS-MSG-RS                         
247700        STRING "ERR CALL S151 ELIM MOVS ",  WS-MSG-RS                         
247800               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
247900        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
248000        PERFORM 60003000-ESC-MENSAJE                                          
248100        PERFORM 70000050-MENSAJE                                              
248200        CALL SYSTEM DMTERMINATE.                                              
248210                                                                              
248220     MOVE ZERO TO WKS-IND-MOV.                                                
248300                                                                              
248400*************************************************************                 
248500 40005010-S151-FIN.                                                           
248600     MOVE 12                 TO WS-S151-0101-FUNCION-I.                       
248700     MOVE WKS-FEC-BASE-08    TO WS-S151-0101-FECCONT-I                        
248800                                WS-S151-0101-FECMOV-I.                        
248900     MOVE WKS-HORA-MAQ       TO WS-S151-0101-HORAMOV-I.                       
249000     MOVE 27                 TO WS-S151-0101-TIPO-PROC-I.                     
249020                                                                              
249040     IF WKS-SIN-LBS151 = 1                                                    
249100        MOVE ZERO  TO WS-S151-0101-STATUS                                     
249120     ELSE                                                                     
249140        PERFORM 20000151-CARGAMOV1.                                           
249160                                                                              
249200     IF WS-S151-0101-STATUS > 0                                               
249500        MOVE WS-S151-0101-STATUS         TO WS-MSG-N-04                       
249600        STRING " ERROR EN FINAL  LIB S151 ", WS-MSG-N-04                      
249700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
249800        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
249900        PERFORM 60003000-ESC-MENSAJE                                          
250000        PERFORM 70000050-MENSAJE                                              
250100        CALL SYSTEM DMTERMINATE.                                              
250200                                                                              
250300********************************************************                      
252800 50000000-PROCESO-PRINCIPAL.                                                  
253000     IF W77-NOHAY-S408  = 0                                                   
253100        PERFORM 40004900-S151-INICIO                                          
253200        PERFORM 40005000-S151-DELMOV1                                         
253500        MOVE 3  TO W77-TPO-PROC                                               
253600        PERFORM 50003300-CANCELA-XS408                                        
253700     ELSE                                                                     
253800        MOVE WLI-R00-L98-SININF  TO WLI-R04-L07-DETALLE                       
253900        PERFORM 60002250-ESC-CANCELADOS.                                      
254000                                                                              
255400     IF W77-NOHAY-S408  = 0                                                   
255500        PERFORM 50097000-ACTUALIZA-GLOBALES                                   
255600        PERFORM 40005010-S151-FIN.                                            
255800                                                                              
255900*************************************************************                 
256000 50003300-CANCELA-XS408.                                                      
256100     MOVE ZERO  TO W77-EOF-S408.                                              
256200     PERFORM 50003310-LEE-ARCH-S408                                           
256300             UNTIL W77-EOF-S408 = 1.                                          
256400                                                                              
256500     PERFORM 50003400-TOTAL-CANCELADOS.                                       
256600                                                                              
256700************************************************************                  
256800 50003310-LEE-ARCH-S408.                                                      
256900     READ E01-MOVS408 INTO WKS-E01-R01-MOVS408 AT END                         
257000          MOVE 999999999999   TO WKS-E01-R01-CONTRATO                         
257100          MOVE 1              TO W77-EOF-S408.                                
257200                                                                              
257300     IF W77-EOF-S408 = 0                                                      
257400        IF WKS-E01-R01-TPO-REG = 00 OR 99                                     
257500           NEXT SENTENCE                                                      
257600        ELSE                                                                  
257700           MOVE WKS-E01-R01-CONTRATO  TO WS-NUM-CONTRATO                      
257800           MOVE ZERO                  TO W77-EOF-BASE                         
257900           PERFORM  50002020-DAME-BDCONTRATO                                  
258000           IF W77-EOF-BASE  = 0                                               
258100              ADD 1  TO W77-MY-AUTORIZ                                        
258200              PERFORM 50003320-VALIDA-CANCELACION                             
258300              PERFORM 50090000-STORE-BASE                                     
258400           ELSE                                                               
258500              MOVE 5           TO W77-TPO-CANCEL                              
258600              PERFORM 50003340-RECHAZO-CANCELADA.                             
258700                                                                              
258800***********************************************************                   
258900 50003320-VALIDA-CANCELACION.                                                 
259000     IF WKS-E01-R01-CVE-SOB = 88                                              
259100        MOVE 2           TO W77-TPO-CANCEL                                    
259200        MOVE 1           TO B03-IND-LINCREDIT                                 
259300        MOVE 1           TO WKS-SI-B03                                        
259400        ADD  1           TO WKS-TOT-NUM-NVALIC                                
259500        PERFORM 60002000-ARMALIN-CANDELADOS                                   
259510     ELSE                                                                     
259520     IF WKS-E01-R01-CVE-SOB = 89                                              
259530        MOVE 8           TO W77-TPO-CANCEL                                    
259540        MOVE 3           TO B03-IND-LINCREDIT                                 
259550        MOVE 1           TO WKS-SI-B03                                        
259560        ADD  1           TO WKS-TOT-NUM-NVALCLINEA                            
259570        PERFORM 60002000-ARMALIN-CANDELADOS                                   
259600     ELSE                                                                     
259700     IF WKS-E01-R01-CVE-SOB = 01                                              
259710*       PERFORM 50003321-AVISO-PROX-CANCE-ATM                                 
259800        PERFORM 50003321-AVISO-PROX-CANCE                                     
259900     ELSE                                                                     
260000     IF WKS-E01-R01-CVE-SOB = 02                                              
260100        IF WS03-88-TC-SOCFUN                                                  
260200           MOVE 4           TO W77-TPO-CANCEL                                 
260300           PERFORM 50003340-RECHAZO-CANCELADA                                 
260400        ELSE                                                                  
260420        IF (B03-STATUS = 1 AND B03-TIPO-BLOQUEO  = 66)                        
260422        OR (B03-STATUS = 1 AND B03-TIPO-BLOQUEO  = 14)                        
260440            MOVE 9           TO W77-TPO-CANCEL                                
260460        ELSE                                                                  
260462*          PERFORM 50003322-AVISO-CANCELACION-ATM                             
260500           PERFORM 50003322-AVISO-CANCELACION                                 
260600     ELSE                                                                     
260700        MOVE 6              TO W77-TPO-CANCEL                                 
260800        PERFORM 50003340-RECHAZO-CANCELADA.                                   
260900                                                                              
261000     IF WKS-IND-MOV > 0                                                       
261100        PERFORM 50008190-ENVIA-MOVSS151.                                      
261200                                                                              
261300**************************************************                            
261310*50003321-AVISO-PROX-CANCE-ATM.                                               
261312*    IF ( WS03-NUM-PRODUCTO = 66  AND                                         
261314*         WS03-NUM-INSTRUM  = 6 OR 7 OR 8 OR 9 ) OR                           
261316*       ( WS03-NUM-PRODUCTO = 500 AND                                         
261318*         WS03-NUM-INSTRUM  = 1 )                                             
261320*       MOVE 11             TO W77-TPO-CANCEL                                 
261322*       ADD  1              TO WKS-TOT-NUM-PRXCAN-ATM                         
261324*       PERFORM 60002000-ARMALIN-CANDELADOS                                   
261326*    ELSE                                                                     
261328*       PERFORM 50003321-AVISO-PROX-CANCE.                                    
261330                                                                              
261400 50003321-AVISO-PROX-CANCE.                                                   
261500     MOVE WKS-E01-R01-IMPORTE  TO WS-IMP-COMUN.                               
261600     MOVE 503             TO WS-CVE-COMUN.                                    
261700     MOVE ZERO            TO WS-REF-COMUN.                                    
261800     PERFORM 50010000-LLENA-MOVS-S151.                                        
261900     MOVE 3               TO W77-TPO-CANCEL.                                  
262000     ADD  1               TO WKS-TOT-NUM-PRXCAN.                              
262100     PERFORM 60002000-ARMALIN-CANDELADOS.                                     
262200                                                                              
262300*****************************************************                         
262302*50003322-AVISO-CANCELACION-ATM.                                              
262304*   IF ( WS03-NUM-PRODUCTO = 66  AND                                          
262306*        WS03-NUM-INSTRUM  = 6 OR 7 OR 8 OR 9 ) OR                            
262308*      ( WS03-NUM-PRODUCTO = 500 AND                                          
262310*        WS03-NUM-INSTRUM  = 1 )                                              
262312*      MOVE 10             TO W77-TPO-CANCEL                                  
262314*      ADD  1              TO WKS-TOT-NUM-SICANC-ATM                          
262316*      PERFORM 60002000-ARMALIN-CANDELADOS                                    
262318*   ELSE                                                                      
262320*      PERFORM 50003322-AVISO-CANCELACION.                                    
262322                                                                              
262400 50003322-AVISO-CANCELACION.                                                  
262500     IF  B03-SDO-ACTUAL      = 0                                              
262510     AND B03-SDOPROT-BLOQ    = 0                                              
262600     AND B03-SDO-PENDIENTE   = 0                                              
262700     AND B03-SDO-SBC         = 0                                              
262702     AND B03-SBC-1DIA        = 0                                              
262800         PERFORM 50002040-DAME-BDHISTORICO                                    
262900         MOVE WKS-E01-R01-IMPORTE TO WS-IMP-COMUN                             
263000         MOVE 504            TO WS-CVE-COMUN                                  
263100         MOVE ZERO           TO WS-REF-COMUN                                  
263200         PERFORM 50010000-LLENA-MOVS-S151                                     
263300         MOVE 1              TO B03-STATUS                                    
263400         MOVE 15             TO B03-TIPO-BLOQUEO                              
263500         MOVE 1              TO B03-IND-LC-CANCEL                             
263600         MOVE 1              TO WKS-SI-B03                                    
263700         MOVE WKS-FEC-BASE-08 TO B06-FEC-BLOQUEO                              
263800         MOVE 1              TO WKS-SI-B06                                    
263900         MOVE 1              TO W77-TPO-CANCEL                                
264000         ADD  1              TO WKS-TOT-NUM-SICANC                            
264100         PERFORM 60002000-ARMALIN-CANDELADOS                                  
264200     ELSE                                                                     
264300         MOVE 7             TO W77-TPO-CANCEL                                 
264400         PERFORM 50003340-RECHAZO-CANCELADA.                                  
264500                                                                              
264600**********************************************************                    
264700 50003340-RECHAZO-CANCELADA.                                                  
264800     ADD 1            TO WKS-TOT-NUM-NOCANC.                                  
264900     PERFORM 60002000-ARMALIN-CANDELADOS.                                     
265000                                                                              
265100*************************************************************                 
265200 50003400-TOTAL-CANCELADOS.                                                   
265300     PERFORM 60002250-ESC-CANCELADOS.                                         
265400                                                                              
265500     MOVE "TOTAL CANCELADOS      "  TO WLI-R04-L07-TPO-TOT.                   
265600     MOVE WKS-TOT-NUM-SICANC        TO WLI-R04-L07-NUM-TOT.                   
265700     PERFORM 60002250-ESC-CANCELADOS.                                         
265800                                                                              
265900     MOVE "TOTAL PROX-CANELACION "  TO WLI-R04-L07-TPO-TOT.                   
266000     MOVE WKS-TOT-NUM-PRXCAN        TO WLI-R04-L07-NUM-TOT.                   
266100     PERFORM 60002250-ESC-CANCELADOS.                                         
266200                                                                              
266300     MOVE "TOTAL APERTURAS L.C.  "  TO WLI-R04-L07-TPO-TOT.                   
266400     MOVE WKS-TOT-NUM-NVALIC        TO WLI-R04-L07-NUM-TOT.                   
266500     PERFORM 60002250-ESC-CANCELADOS.                                         
266510                                                                              
266520     MOVE "TOTAL APERT LC LINEA  "  TO WLI-R04-L07-TPO-TOT.                   
266530     MOVE WKS-TOT-NUM-NVALCLINEA    TO WLI-R04-L07-NUM-TOT.                   
266540     PERFORM 60002250-ESC-CANCELADOS.                                         
266550                                                                              
266552*    MOVE "TOTAL CANCELADO   ATM "  TO WLI-R04-L07-TPO-TOT.                   
266554*    MOVE WKS-TOT-NUM-SICANC-ATM    TO WLI-R04-L07-NUM-TOT.                   
266556*    PERFORM 60002250-ESC-CANCELADOS.                                         
266558                                                                              
266560*    MOVE "TOTAL PROX-CAN    ATM "  TO WLI-R04-L07-TPO-TOT.                   
266562*    MOVE WKS-TOT-NUM-PRXCAN-ATM    TO WLI-R04-L07-NUM-TOT.                   
266564*    PERFORM 60002250-ESC-CANCELADOS.                                         
266566                                                                              
266600                                                                              
266700     MOVE "TOTAL RECHAZADOS      "  TO WLI-R04-L07-TPO-TOT.                   
266800     MOVE WKS-TOT-NUM-NOCANC        TO WLI-R04-L07-NUM-TOT.                   
266900     PERFORM 60002250-ESC-CANCELADOS 2 TIMES.                                 
267000                                                                              
267100     MOVE "          ARCHIVO"      TO WLI-R04-L07-DATO.                       
267200     MOVE WKS-TIT-S408             TO WLI-R04-L07-ARCHIVO.                    
267300     PERFORM 60002250-ESC-CANCELADOS.                                         
267400                                                                              
267500***********************************************************                   
279700 50002020-DAME-BDCONTRATO.                                                    
279800     PERFORM 90000003-B03SXCTO-LOCK.                                          
279900     IF WS-STATUS-BASE > 0                                                    
280000        IF WS-DB-NOTFOUND                                                     
280100           MOVE 1                     TO  W77-EOF-BASE                        
280200        ELSE                                                                  
280500           MOVE "ERR LOCK  B03SXCTO " TO WS-0101-TEXT-MSG                     
280600           MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                          
280700           PERFORM 60003000-ESC-MENSAJE                                       
280800           PERFORM 70000050-MENSAJE                                           
280900           CALL SYSTEM DMTERMINATE.                                           
281000                                                                              
281100     IF W77-EOF-BASE = 0                                                      
281200        PERFORM 50002040-MUEVE-B03-WKS                                        
281300        PERFORM 50002080-DAME-INSTRUMENTO.                                    
281400                                                                              
281500********************************************************                      
281600 50002040-MUEVE-B03-WKS.                                                      
281700     MOVE B03-SUC-PROMOTORA   TO WS03-SUC-PROMOTORA.                          
281800     MOVE B03-NUM-CONTRATO    TO WS03-NUM-CONTRATO.                           
281900     MOVE B03-NUM-CLIENTE     TO WS03-NUM-CLIENTE.                            
282000     MOVE B03-NUM-PRODUCTO    TO WS03-NUM-PRODUCTO.                           
282100     MOVE B03-NUM-INSTRUM     TO WS03-NUM-INSTRUM.                            
282200     MOVE B03-MONEDA          TO WS03-MONEDA.                                 
282220     MOVE B03-CTA-CONCENT     TO WS03-CTA-CONCENT.                            
282400     MOVE B03-FEC-APERTURA    TO WS03-FEC-APERTURA.                           
282500     MOVE B03-DIA-CORTE       TO WS03-DIA-CORTE.                              
284000     MOVE B03-TIPO-PERSONA    TO WS03-TIPO-PERSONA.                           
284500     MOVE B03-STATUS          TO WS03-STATUS.                                 
284600     MOVE B03-TIPO-BLOQUEO    TO WS03-TIPO-BLOQUEO.                           
285500     MOVE B03-SDO-FINCORTE    TO WS03-SDO-FINCORTE.                           
286600     MOVE B03-TIPO-CUENTA     TO WS03-TIPO-CUENTA.                            
287200     MOVE B03-IMP-CGOSDIA     TO WS03-IMP-CGOSDIA.                            
287300     MOVE B03-IMP-ABOSDIA     TO WS03-IMP-ABOSDIA.                            
287310                                                                              
287320     IF B03-CTA-CONCENT = 8                                                   
287330        MOVE 99               TO W77-SEC-ESQCONT                              
287340     ELSE                                                                     
287350        MOVE B03-SECTOR       TO W77-SEC-ESQCONT.                             
287900                                                                              
288000********************************************************                      
288100 50002080-DAME-INSTRUMENTO.                                                   
288200     PERFORM 50002082-DAME-INDICE-INSTR                                       
288300        VARYING WKS-IND-INST FROM 1 BY 1                                      
288350        UNTIL  (WKS-IND-INST > 30)                                            
288400           OR (WKS-TB-B05-PROD(WKS-IND-INST) = B03-NUM-PRODUCTO               
288500          AND  WKS-TB-B05-INST(WKS-IND-INST) = B03-NUM-INSTRUM                
288600          AND  WKS-TB-B05-MONEDA(WKS-IND-INST) = B03-MONEDA).                 
288700                                                                              
288800                                                                              
288900     IF WKS-IND-INST > 30                                                     
289200        MOVE B03-NUM-PRODUCTO    TO WS-MSG-PRD                                
289300        MOVE B03-NUM-INSTRUM     TO WS-MSG-INST                               
289400        MOVE B03-MONEDA          TO WS-MSG-MDA                                
289500        STRING "NO HAY INSTR ", WS-MSG-PRD                                    
289600                           " ", WS-MSG-INST                                   
289700                           " ", WS-MSG-MDA                                    
289800               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
289900        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
290000        PERFORM 60003000-ESC-MENSAJE                                          
290100        PERFORM 70000050-MENSAJE                                              
290200        CALL SYSTEM DMTERMINATE.                                              
290400                                                                              
290800        PERFORM 50002083-LEE-ESQCONT.                                         
290900        IF W77-SEC-ESQCONT = 0                                                
291000           MOVE B22-ESQCON-DEFLT    TO WKS-ESQ-CONTABLE                       
291100        ELSE                                                                  
291200           MOVE ZERO TO WKS-HAY-ESQ                                           
291300           PERFORM 50002085-DAME-ESQ-CONT                                     
291400                   VARYING WKS-IND-ESQ  FROM 1 BY 1                           
291500                   UNTIL   (WKS-IND-ESQ > 20)                                 
291600                   OR      (WKS-HAY-ESQ = 1)                                  
291700           IF WKS-HAY-ESQ = 0                                                 
291800              MOVE B22-ESQCON-DEFLT   TO WKS-ESQ-CONTABLE.                    
291900                                                                              
292000***********************************************************                   
292100 50002082-DAME-INDICE-INSTR.                                                  
292200                                                                              
292202**************************************************************                
292204 50002083-LEE-ESQCONT.                                                        
292206     MOVE 002002            TO WS-LLAVE-BANCOS  WS-MSG-N-06.                  
292208     MOVE B03-NUM-PRODUCTO  TO WS-NUM-PRODUCTO  WS-MSG-PRD.                   
292210     MOVE B03-NUM-INSTRUM   TO WS-NUM-INSTRUM   WS-MSG-INST.                  
292212     MOVE B03-MONEDA        TO WS-MONEDA        WS-MSG-MDA.                   
292214     PERFORM 90000022-B22SXESQCONTXPRD-FIND.                                  
292216                                                                              
292218     IF WS-STATUS-BASE > 0                                                    
292224        STRING "ERR FIND B22SXESQCONTXPROD ", WS-STATUS-BASE                  
292226               " BCOS=" WS-MSG-N-06                                           
292228               " PROD=" WS-MSG-PRD                                            
292230               " INST=" WS-MSG-INST                                           
292232               " MONE=" WS-MSG-MDA                                            
292234               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
292236        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
292238        PERFORM 60003000-ESC-MENSAJE                                          
292240        PERFORM 70000050-MENSAJE                                              
292242        CALL SYSTEM DMTERMINATE.                                              
292300*************************************************************                 
292400 50002085-DAME-ESQ-CONT.                                                      
292500     IF B22-SECTOR(WKS-IND-ESQ) = W77-SEC-ESQCONT                             
292600        MOVE B22-ESQCONT(WKS-IND-ESQ)  TO WKS-ESQ-CONTABLE                    
292700        MOVE 1                         TO WKS-HAY-ESQ.                        
292900                                                                              
293000**************************************************************                
293100 50002040-DAME-BDHISTORICO.                                                   
293200     MOVE B03-NUM-CONTRATO         TO WS-NUM-CONTRATO.                        
293300     PERFORM 90000006-B06SXCTO-LOCK.                                          
293400     IF WS-STATUS-BASE > 0                                                    
293700        MOVE B03-NUM-CONTRATO      TO WS-MSG-CTO                              
293800        STRING "ERR LOCK B06SXCTO ", WS-MSG-CTO                               
293900               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
294000        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
294100        PERFORM 60003000-ESC-MENSAJE                                          
294200        PERFORM 70000050-MENSAJE                                              
294300        CALL SYSTEM DMTERMINATE.                                              
294400                                                                              
294500*************************************************************                 
294600 50002090-DAME-CVEFUNCION.                                                    
294700     IF B17-CLAVE-TRANS NOT = WS-CLAVE-TRANS                                  
294800        PERFORM 90000017-B17AXCLAVE-FIND                                      
294900        IF WS-STATUS-BASE > 0                                                 
295200           MOVE WS-CLAVE-TRANS    TO WS-MSG-N-04                              
295300           STRING "ERR FIND B17XCVE ", WS-MSG-N-04                            
295400                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
295500           MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                          
295600           PERFORM 60003000-ESC-MENSAJE                                       
295700           PERFORM 70000050-MENSAJE                                           
295800           IF W77-SW-BEGINTRAN = 1                                            
295900              PERFORM 90000000-END-TRANSACTIONNOAU                            
296000              CALL SYSTEM DMTERMINATE                                         
296100           ELSE                                                               
296200              CALL SYSTEM DMTERMINATE.                                        
296300                                                                              
296400     IF W77-SW-GLOBAL = 0                                                     
296500        PERFORM 50002092-VE-CVEFUNCION.                                       
296600                                                                              
296700****************************************************************              
296800 50002092-VE-CVEFUNCION.                                                      
296900     MOVE ZEROS                 TO WKS-HAY-CVE.                               
297000     IF WS-CLAVE-TRANS NOT = WKS-TB-CVEVAL(WKS-IND-TBCVE)                     
297100        PERFORM 50002093-DAME-INDTBCVE                                        
297200        IF WKS-HAY-CVE = 9                                                    
297500           MOVE WS-CLAVE-TRANS    TO WS-MSG-N-04                              
297600           STRING  "NO HAY EN TABLA CVE ", WS-MSG-N-04                        
297700                   DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                    
297800           MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                          
297900           PERFORM 60003000-ESC-MENSAJE                                       
298000           PERFORM 70000050-MENSAJE                                           
298100           CALL SYSTEM DMTERMINATE.                                           
298200                                                                              
298300*******************************************************                       
298400 50002093-DAME-INDTBCVE.                                                      
298500     MOVE 1                  TO WKS-IND-ITB.                                  
298600     MOVE WKS-NUM-MXCVE      TO WKS-IND-ITA.                                  
298700     IF WKS-TB-CVEVAL(WKS-IND-ITB) = WS-CLAVE-TRANS                           
298800        MOVE WKS-IND-ITB          TO WKS-IND-TBCVE                            
298900        MOVE 1               TO WKS-HAY-CVE                                   
299000     ELSE                                                                     
299100     IF WKS-TB-CVEVAL(WKS-IND-ITB) > WS-CLAVE-TRANS                           
299200        MOVE 9               TO WKS-HAY-CVE                                   
299300     ELSE                                                                     
299400     IF WKS-TB-CVEVAL(WKS-IND-ITA) = WS-CLAVE-TRANS                           
299500        MOVE WKS-IND-ITA          TO WKS-IND-TBCVE                            
299600        MOVE 1               TO WKS-HAY-CVE                                   
299700     ELSE                                                                     
299800     IF WKS-TB-CVEVAL(WKS-IND-ITA) < WS-CLAVE-TRANS                           
299900        MOVE 9               TO WKS-HAY-CVE                                   
300000     ELSE                                                                     
300100        PERFORM 50002094-BUSCA-BIN-CVE UNTIL WKS-HAY-CVE > 0.                 
300200                                                                              
300300*************************************************************                 
300400 50002094-BUSCA-BIN-CVE.                                                      
300500     SUBTRACT WKS-IND-ITB FROM WKS-IND-ITA  GIVING WKS-IND-ITC.               
300600     IF WKS-IND-ITC  < 2                                                      
300700        MOVE 9   TO WKS-HAY-CVE                                               
300800     ELSE                                                                     
300900        COMPUTE WKS-IND-ITC = (WKS-IND-ITB + WKS-IND-ITA) / 2                 
301000        IF WKS-TB-CVEVAL(WKS-IND-ITC) = WS-CLAVE-TRANS                        
301100           MOVE WKS-IND-ITC          TO WKS-IND-TBCVE                         
301200           MOVE 1                    TO WKS-HAY-CVE                           
301300        ELSE                                                                  
301400        IF WKS-TB-CVEVAL(WKS-IND-ITC) > WS-CLAVE-TRANS                        
301500           MOVE WKS-IND-ITC          TO WKS-IND-ITA                           
301600        ELSE                                                                  
301700           MOVE WKS-IND-ITC          TO WKS-IND-ITB.                          
301800                                                                              
301900***********************************************************                   
304600 50090000-STORE-BASE.                                                         
304700***  IF W77-HAY-MOVBATCH = 1                                                  
304800***     MOVE ZERO           TO W77-HAY-MOVBATCH                               
304900***     MOVE WKS-FEC-BASE-08 TO B03-FEC-ULTACT                                
305000***     MOVE 1              TO WKS-SI-B03.                                    
305100                                                                              
305200     PERFORM 90000000-BEGIN-TRANSACTION.                                      
305300     IF WS-STATUS-BASE > 0                                                    
305400        CALL SYSTEM DMTERMINATE.                                              
305500                                                                              
305600     IF WKS-SI-B03 = 1                                                        
305700        PERFORM 90000003-B03CONTRATOS-STORE                                   
305800        IF WS-STATUS-BASE > 0                                                 
306100           MOVE B03-NUM-CONTRATO   TO WS-MSG-CTO                              
306200           STRING " ERR STORE CONTRATOS ", WS-STATUS-BASE                     
306300                  " CTO=", WS-MSG-CTO                                         
306400                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
306500           MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                          
306600           PERFORM 60003000-ESC-MENSAJE                                       
306700           PERFORM 70000050-MENSAJE                                           
306800           PERFORM 90000000-END-TRANSACTIONNOAU                               
306900           CALL SYSTEM DMTERMINATE.                                           
307000                                                                              
307100     IF WKS-SI-B06 = 1                                                        
307200        PERFORM 90000006-B06HISTORICO-STORE                                   
307300        IF WS-STATUS-BASE > 0                                                 
307600           MOVE B03-NUM-CONTRATO   TO WS-MSG-CTO                              
307700           STRING " ERR STORE B06HIST ", WS-STATUS-BASE                       
307800                  " CTO=", WS-MSG-CTO                                         
307900                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
308000           MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                          
308100           PERFORM 60003000-ESC-MENSAJE                                       
308200           PERFORM 70000050-MENSAJE                                           
308300           PERFORM 90000000-END-TRANSACTIONNOAU                               
308400           CALL SYSTEM DMTERMINATE.                                           
308500                                                                              
308600     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
308700     IF WS-STATUS-BASE > 0                                                    
308800        CALL SYSTEM DMTERMINATE.                                              
308900                                                                              
309000     MOVE ZEROS TO WKS-SI-B03 WKS-SI-B06.                                     
309100                                                                              
309200**********************************************************                    
309300 50010000-LLENA-MOVS-S151.                                                    
309400     ADD 1   TO WKS-IND-MOV.                                                  
309500     IF WKS-IND-MOV > 30                                                      
309600        PERFORM 50008190-ENVIA-MOVSS151                                       
309700        ADD  1    TO W77-MY-AUTORIZ                                           
309800        MOVE 1    TO WKS-IND-MOV.                                             
309900                                                                              
310000     MOVE WS-CVE-COMUN    TO WS-S151-0101-CVETRAN-I(WKS-IND-MOV)              
310100                             WS-CLAVE-TRANS.                                  
310200     MOVE WS-IMP-COMUN    TO WS-S151-0101-IMPORTE-I(WKS-IND-MOV).             
310300     MOVE WKS-ESQ-CONTABLE TO WS-S151-0101-ESQCON-I(WKS-IND-MOV).             
310400     IF WS-REF-COMUN > 0                                                      
310500        MOVE WS-REF-COMUN TO WS-S151-0101-REFLEY-I(WKS-IND-MOV)               
310600        MOVE 1            TO WS-S151-0101-INDLEY-I(WKS-IND-MOV).              
310700                                                                              
310800     MOVE 1 TO W77-HAY-MOVBATCH.                                              
310900                                                                              
311000     PERFORM 50008500-GENERA-PUNTEO.                                          
311100     PERFORM 50007200-ACUMULA-CLAVES.                                         
311200                                                                              
311300********************************************************                      
311400 50007200-ACUMULA-CLAVES.                                                     
311500     PERFORM 50002090-DAME-CVEFUNCION.                                        
311600                                                                              
311700     IF WKS-IND-TBCVE < 1                                                     
311800     OR WKS-IND-TBCVE > 2000                                                  
312100        MOVE WKS-IND-TBCVE     TO WS-MSG-N-04                                 
312200        STRING "ERR EN WKS-IND-TBCVE ", WS-MSG-N-04                           
312300               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
312400        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
312500        PERFORM 60003000-ESC-MENSAJE                                          
312600        PERFORM 70000050-MENSAJE                                              
312700        CALL SYSTEM DMTERMINATE.                                              
312800                                                                              
312900     MOVE WKS-IND-TBCVE         TO WKS-NUM-TOT.                               
313000                                                                              
313100     IF WKS-NUM-TOT < 101                                                     
313110        PERFORM 50007205-ACUMULA-TAB01                                        
313120     ELSE                                                                     
313130     IF WKS-NUM-TOT < 201                                                     
313140        PERFORM 50007210-ACUMULA-TAB02                                        
313150     ELSE                                                                     
313160     IF WKS-NUM-TOT < 301                                                     
313170        PERFORM 50007215-ACUMULA-TAB03                                        
313180     ELSE                                                                     
313190     IF WKS-NUM-TOT < 401                                                     
313200        PERFORM 50007220-ACUMULA-TAB04                                        
313210     ELSE                                                                     
313220     IF WKS-NUM-TOT < 501                                                     
313230        PERFORM 50007225-ACUMULA-TAB05                                        
313240     ELSE                                                                     
313250     IF WKS-NUM-TOT < 601                                                     
313260        PERFORM 50007230-ACUMULA-TAB06                                        
313270     ELSE                                                                     
313280     IF WKS-NUM-TOT < 701                                                     
313290        PERFORM 50007235-ACUMULA-TAB07                                        
313300     ELSE                                                                     
313310     IF WKS-NUM-TOT < 801                                                     
313320        PERFORM 50007240-ACUMULA-TAB08                                        
313330     ELSE                                                                     
313340     IF WKS-NUM-TOT < 901                                                     
313350        PERFORM 50007245-ACUMULA-TAB09                                        
313360     ELSE                                                                     
313370     IF WKS-NUM-TOT < 1001                                                    
313380        PERFORM 50007250-ACUMULA-TAB10                                        
313390     ELSE                                                                     
313400     IF WKS-NUM-TOT < 1101                                                    
313410        PERFORM 50007205-ACUMULA-TAB11                                        
313420     ELSE                                                                     
313430     IF WKS-NUM-TOT < 1201                                                    
313440        PERFORM 50007210-ACUMULA-TAB12                                        
313450     ELSE                                                                     
313460     IF WKS-NUM-TOT < 1301                                                    
313470        PERFORM 50007215-ACUMULA-TAB13                                        
313480     ELSE                                                                     
313490     IF WKS-NUM-TOT < 1401                                                    
313500        PERFORM 50007220-ACUMULA-TAB14                                        
313510     ELSE                                                                     
313520     IF WKS-NUM-TOT < 1501                                                    
313530        PERFORM 50007225-ACUMULA-TAB15                                        
313540     ELSE                                                                     
313550     IF WKS-NUM-TOT < 1601                                                    
313560        PERFORM 50007230-ACUMULA-TAB16                                        
313570     ELSE                                                                     
313580     IF WKS-NUM-TOT < 1701                                                    
313590        PERFORM 50007235-ACUMULA-TAB17                                        
313600     ELSE                                                                     
313610     IF WKS-NUM-TOT < 1801                                                    
313620        PERFORM 50007240-ACUMULA-TAB18                                        
313630     ELSE                                                                     
313640     IF WKS-NUM-TOT < 1901                                                    
313650        PERFORM 50007245-ACUMULA-TAB19                                        
313660     ELSE                                                                     
313680        PERFORM 50007250-ACUMULA-TAB20.                                       
314400                                                                              
314500***********************************************************                   
314510 50007205-ACUMULA-TAB01.                                                      
314520     IF WKS-TCVE-01-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
314530        MOVE WS-CVE-COMUN                                                     
314540          TO WKS-TCVE-01-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
314550                                                                              
314560     IF WKS-TCVE-01-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
314570        ADD WS-IMP-COMUN                                                      
314580            TO WKS-TCVE-01-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
314590        ADD 1                                                                 
314600            TO WKS-TCVE-01-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
314610     ELSE                                                                     
314640        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
314650        MOVE WKS-TCVE-01-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
314660          TO WS-MSG-N-04                                                      
314670        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
314680               " CVE EN TABLA-01 ", WS-MSG-N-04                               
314690               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
314700        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
314710        PERFORM 60003000-ESC-MENSAJE                                          
314720        PERFORM 70000050-MENSAJE                                              
314730        CALL SYSTEM DMTERMINATE.                                              
314740                                                                              
314750***************************************************************               
314760 50007210-ACUMULA-TAB02.                                                      
314770     SUBTRACT 100 FROM WKS-NUM-TOT.                                           
314780     IF WKS-TCVE-02-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
314790        MOVE WS-CVE-COMUN                                                     
314800          TO WKS-TCVE-02-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
314810     IF WKS-TCVE-02-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
314820        ADD WS-IMP-COMUN                                                      
314830            TO WKS-TCVE-02-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
314840        ADD 1                                                                 
314850            TO WKS-TCVE-02-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
314860     ELSE                                                                     
314890        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
314900        MOVE WKS-TCVE-02-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
314910          TO WS-MSG-N-04                                                      
314920        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
314930               " CVE EN TABLA-02 ", WS-MSG-N-04                               
314940               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
314950        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
314960        PERFORM 60003000-ESC-MENSAJE                                          
314970        PERFORM 70000050-MENSAJE                                              
314980        CALL SYSTEM DMTERMINATE.                                              
314990                                                                              
315000********************************************************                      
315010 50007215-ACUMULA-TAB03.                                                      
315020     SUBTRACT 200 FROM WKS-NUM-TOT.                                           
315030     IF WKS-TCVE-03-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
315040        MOVE WS-CVE-COMUN                                                     
315050          TO WKS-TCVE-03-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
315060     IF WKS-TCVE-03-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
315070        ADD WS-IMP-COMUN                                                      
315080            TO WKS-TCVE-03-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
315090        ADD 1                                                                 
315100            TO WKS-TCVE-03-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
315110     ELSE                                                                     
315140        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
315150        MOVE WKS-TCVE-03-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
315160          TO WS-MSG-N-04                                                      
315170        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
315180               " CVE EN TABLA-03 ", WS-MSG-N-04                               
315190               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
315200        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
315210        PERFORM 60003000-ESC-MENSAJE                                          
315220        PERFORM 70000050-MENSAJE                                              
315230        CALL SYSTEM DMTERMINATE.                                              
315240                                                                              
315250******************************************************                        
315260 50007220-ACUMULA-TAB04.                                                      
315270     SUBTRACT 300 FROM WKS-NUM-TOT.                                           
315280     IF WKS-TCVE-04-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
315290        MOVE WS-CVE-COMUN                                                     
315300          TO WKS-TCVE-04-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
315310     IF WKS-TCVE-04-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
315320        ADD WS-IMP-COMUN                                                      
315330            TO WKS-TCVE-04-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
315340        ADD 1                                                                 
315350            TO WKS-TCVE-04-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
315360     ELSE                                                                     
315390        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
315400        MOVE WKS-TCVE-04-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
315410          TO WS-MSG-N-04                                                      
315420        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
315430               " CVE EN TABLA-04 ", WS-MSG-N-04                               
315440               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
315450        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
315460        PERFORM 60003000-ESC-MENSAJE                                          
315470        PERFORM 70000050-MENSAJE                                              
315480        CALL SYSTEM DMTERMINATE.                                              
315490                                                                              
315500*************************************************************                 
315510 50007225-ACUMULA-TAB05.                                                      
315520     SUBTRACT 400 FROM WKS-NUM-TOT.                                           
315530     IF WKS-TCVE-05-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
315540        MOVE WS-CVE-COMUN                                                     
315550          TO WKS-TCVE-05-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
315560     IF WKS-TCVE-05-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
315570        ADD WS-IMP-COMUN                                                      
315580            TO WKS-TCVE-05-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
315590        ADD 1                                                                 
315600            TO WKS-TCVE-05-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
315610     ELSE                                                                     
315640        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
315650        MOVE WKS-TCVE-05-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
315660          TO WS-MSG-N-04                                                      
315670        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
315680               " CVE EN TABLA-05 ", WS-MSG-N-04                               
315690               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
315700        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
315710        PERFORM 60003000-ESC-MENSAJE                                          
315720        PERFORM 70000050-MENSAJE                                              
315730        CALL SYSTEM DMTERMINATE.                                              
315740                                                                              
315750***********************************************************                   
315760 50007230-ACUMULA-TAB06.                                                      
315770     SUBTRACT 500 FROM WKS-NUM-TOT.                                           
315780     IF WKS-TCVE-06-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
315790        MOVE WS-CVE-COMUN                                                     
315800          TO WKS-TCVE-06-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
315810                                                                              
315820     IF WKS-TCVE-06-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
315830        ADD WS-IMP-COMUN                                                      
315840            TO WKS-TCVE-06-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
315850        ADD 1                                                                 
315860            TO WKS-TCVE-06-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
315870     ELSE                                                                     
315900        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
315910        MOVE WKS-TCVE-06-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
315920          TO WS-MSG-N-04                                                      
315930        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
315940               " CVE EN TABLA-06 ", WS-MSG-N-04                               
315950               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
315960        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
315970        PERFORM 60003000-ESC-MENSAJE                                          
315980        PERFORM 70000050-MENSAJE                                              
315990        CALL SYSTEM DMTERMINATE.                                              
316000                                                                              
316010***************************************************************               
316020 50007235-ACUMULA-TAB07.                                                      
316030     SUBTRACT 600 FROM WKS-NUM-TOT.                                           
316040     IF WKS-TCVE-07-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
316050        MOVE WS-CVE-COMUN                                                     
316060          TO WKS-TCVE-07-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
316070     IF WKS-TCVE-07-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
316080        ADD WS-IMP-COMUN                                                      
316090            TO WKS-TCVE-07-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
316100        ADD 1                                                                 
316110            TO WKS-TCVE-07-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
316120     ELSE                                                                     
316150        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
316160        MOVE WKS-TCVE-07-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
316170          TO WS-MSG-N-04                                                      
316180        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
316190               " CVE EN TABLA-07 ", WS-MSG-N-04                               
316200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
316210        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
316220        PERFORM 60003000-ESC-MENSAJE                                          
316230        PERFORM 70000050-MENSAJE                                              
316240        CALL SYSTEM DMTERMINATE.                                              
316250                                                                              
316260********************************************************                      
316270 50007240-ACUMULA-TAB08.                                                      
316280     SUBTRACT 700 FROM WKS-NUM-TOT.                                           
316290     IF WKS-TCVE-08-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
316300        MOVE WS-CVE-COMUN                                                     
316310          TO WKS-TCVE-08-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
316320     IF WKS-TCVE-08-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
316330        ADD WS-IMP-COMUN                                                      
316340            TO WKS-TCVE-08-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
316350        ADD 1                                                                 
316360            TO WKS-TCVE-08-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
316370     ELSE                                                                     
316400        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
316410        MOVE WKS-TCVE-08-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
316420          TO WS-MSG-N-04                                                      
316430        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
316440               " CVE EN TABLA-08 ", WS-MSG-N-04                               
316450               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
316460        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
316470        PERFORM 60003000-ESC-MENSAJE                                          
316480        PERFORM 70000050-MENSAJE                                              
316490        CALL SYSTEM DMTERMINATE.                                              
316500                                                                              
316510******************************************************                        
316520 50007245-ACUMULA-TAB09.                                                      
316530     SUBTRACT 800 FROM WKS-NUM-TOT.                                           
316540     IF WKS-TCVE-09-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
316550        MOVE WS-CVE-COMUN                                                     
316560          TO WKS-TCVE-09-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
316570     IF WKS-TCVE-09-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
316580        ADD WS-IMP-COMUN                                                      
316590            TO WKS-TCVE-09-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
316600        ADD 1                                                                 
316610            TO WKS-TCVE-09-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
316620     ELSE                                                                     
316650        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
316660        MOVE WKS-TCVE-09-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
316670          TO WS-MSG-N-04                                                      
316680        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
316690               " CVE EN TABLA-09 ", WS-MSG-N-04                               
316700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
316710        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
316720        PERFORM 60003000-ESC-MENSAJE                                          
316730        PERFORM 70000050-MENSAJE                                              
316740        CALL SYSTEM DMTERMINATE.                                              
316750                                                                              
316760*************************************************************                 
316770 50007250-ACUMULA-TAB10.                                                      
316780     SUBTRACT 900 FROM WKS-NUM-TOT.                                           
316790     IF WKS-TCVE-10-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
316800        MOVE WS-CVE-COMUN                                                     
316810          TO WKS-TCVE-10-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
316820     IF WKS-TCVE-10-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
316830        ADD WS-IMP-COMUN                                                      
316840            TO WKS-TCVE-10-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
316850        ADD 1                                                                 
316860            TO WKS-TCVE-10-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
316870     ELSE                                                                     
316900        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
316910        MOVE WKS-TCVE-10-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
316920          TO WS-MSG-N-04                                                      
316930        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
316940               " CVE EN TABLA-10 ", WS-MSG-N-04                               
316950               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
316960        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
316970        PERFORM 60003000-ESC-MENSAJE                                          
316980        PERFORM 70000050-MENSAJE                                              
316990        CALL SYSTEM DMTERMINATE.                                              
317000                                                                              
317010***********************************************************                   
317020 50007205-ACUMULA-TAB11.                                                      
317025     SUBTRACT 1000 FROM WKS-NUM-TOT.                                          
317030     IF WKS-TCVE-11-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
317040        MOVE WS-CVE-COMUN                                                     
317050          TO WKS-TCVE-11-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
317070     IF WKS-TCVE-11-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
317080        ADD WS-IMP-COMUN                                                      
317090            TO WKS-TCVE-11-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
317100        ADD 1                                                                 
317110            TO WKS-TCVE-11-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
317120     ELSE                                                                     
317150        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
317160        MOVE WKS-TCVE-11-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
317170          TO WS-MSG-N-04                                                      
317180        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
317190               " CVE EN TABLA-11 ", WS-MSG-N-04                               
317200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
317210        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
317220        PERFORM 60003000-ESC-MENSAJE                                          
317230        PERFORM 70000050-MENSAJE                                              
317240        CALL SYSTEM DMTERMINATE.                                              
317250                                                                              
317260***************************************************************               
317270 50007210-ACUMULA-TAB12.                                                      
317280     SUBTRACT 1100 FROM WKS-NUM-TOT.                                          
317290     IF WKS-TCVE-12-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
317300        MOVE WS-CVE-COMUN                                                     
317310          TO WKS-TCVE-12-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
317320     IF WKS-TCVE-12-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
317330        ADD WS-IMP-COMUN                                                      
317340            TO WKS-TCVE-12-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
317350        ADD 1                                                                 
317360            TO WKS-TCVE-12-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
317370     ELSE                                                                     
317400        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
317410        MOVE WKS-TCVE-12-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
317420          TO WS-MSG-N-04                                                      
317430        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
317440               " CVE EN TABLA-12 ", WS-MSG-N-04                               
317450               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
317460        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
317470        PERFORM 60003000-ESC-MENSAJE                                          
317480        PERFORM 70000050-MENSAJE                                              
317490        CALL SYSTEM DMTERMINATE.                                              
317500                                                                              
317510********************************************************                      
317520 50007215-ACUMULA-TAB13.                                                      
317530     SUBTRACT 1200 FROM WKS-NUM-TOT.                                          
317540     IF WKS-TCVE-13-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
317550        MOVE WS-CVE-COMUN                                                     
317560          TO WKS-TCVE-13-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
317570     IF WKS-TCVE-13-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
317580        ADD WS-IMP-COMUN                                                      
317590            TO WKS-TCVE-13-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
317600        ADD 1                                                                 
317610            TO WKS-TCVE-13-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
317620     ELSE                                                                     
317650        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
317660        MOVE WKS-TCVE-13-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
317670          TO WS-MSG-N-04                                                      
317680        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
317690               " CVE EN TABLA-13 ", WS-MSG-N-04                               
317700               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
317710        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
317720        PERFORM 60003000-ESC-MENSAJE                                          
317730        PERFORM 70000050-MENSAJE                                              
317740        CALL SYSTEM DMTERMINATE.                                              
317750                                                                              
317760******************************************************                        
317770 50007220-ACUMULA-TAB14.                                                      
317780     SUBTRACT 1300 FROM WKS-NUM-TOT.                                          
317790     IF WKS-TCVE-14-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
317800        MOVE WS-CVE-COMUN                                                     
317810          TO WKS-TCVE-14-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
317820     IF WKS-TCVE-14-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
317830        ADD WS-IMP-COMUN                                                      
317840            TO WKS-TCVE-14-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
317850        ADD 1                                                                 
317860            TO WKS-TCVE-14-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
317870     ELSE                                                                     
317900        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
317910        MOVE WKS-TCVE-14-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
317920          TO WS-MSG-N-04                                                      
317930        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
317940               " CVE EN TABLA-14 ", WS-MSG-N-04                               
317950               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
317960        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
317970        PERFORM 60003000-ESC-MENSAJE                                          
317980        PERFORM 70000050-MENSAJE                                              
317990        CALL SYSTEM DMTERMINATE.                                              
318000                                                                              
318010*************************************************************                 
318020 50007225-ACUMULA-TAB15.                                                      
318030     SUBTRACT 1400 FROM WKS-NUM-TOT.                                          
318040     IF WKS-TCVE-15-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
318050        MOVE WS-CVE-COMUN                                                     
318060          TO WKS-TCVE-15-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
318070     IF WKS-TCVE-15-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
318080        ADD WS-IMP-COMUN                                                      
318090            TO WKS-TCVE-15-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
318100        ADD 1                                                                 
318110            TO WKS-TCVE-15-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
318120     ELSE                                                                     
318150        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
318160        MOVE WKS-TCVE-15-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
318170          TO WS-MSG-N-04                                                      
318180        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
318190               " CVE EN TABLA-15 ", WS-MSG-N-04                               
318200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
318210        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
318220        PERFORM 60003000-ESC-MENSAJE                                          
318230        PERFORM 70000050-MENSAJE                                              
318240        CALL SYSTEM DMTERMINATE.                                              
318250                                                                              
318260***********************************************************                   
318270 50007230-ACUMULA-TAB16.                                                      
318280     SUBTRACT 1500 FROM WKS-NUM-TOT.                                          
318290     IF WKS-TCVE-16-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
318300        MOVE WS-CVE-COMUN                                                     
318310          TO WKS-TCVE-16-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
318320                                                                              
318330     IF WKS-TCVE-16-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
318340        ADD WS-IMP-COMUN                                                      
318350            TO WKS-TCVE-16-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
318360        ADD 1                                                                 
318370            TO WKS-TCVE-16-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
318380     ELSE                                                                     
318410        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
318420        MOVE WKS-TCVE-16-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
318430          TO WS-MSG-N-04                                                      
318440        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
318450               " CVE EN TABLA-16 ", WS-MSG-N-04                               
318460               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
318470        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
318480        PERFORM 60003000-ESC-MENSAJE                                          
318490        PERFORM 70000050-MENSAJE                                              
318500        CALL SYSTEM DMTERMINATE.                                              
318510                                                                              
318520***************************************************************               
318530 50007235-ACUMULA-TAB17.                                                      
318540     SUBTRACT 1600 FROM WKS-NUM-TOT.                                          
318550     IF WKS-TCVE-17-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
318560        MOVE WS-CVE-COMUN                                                     
318570          TO WKS-TCVE-17-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
318580     IF WKS-TCVE-17-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
318590        ADD WS-IMP-COMUN                                                      
318600            TO WKS-TCVE-17-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
318610        ADD 1                                                                 
318620            TO WKS-TCVE-17-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
318630     ELSE                                                                     
318660        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
318670        MOVE WKS-TCVE-17-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
318680          TO WS-MSG-N-04                                                      
318690        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
318700               " CVE EN TABLA-17 ", WS-MSG-N-04                               
318710               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
318720        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
318730        PERFORM 60003000-ESC-MENSAJE                                          
318740        PERFORM 70000050-MENSAJE                                              
318750        CALL SYSTEM DMTERMINATE.                                              
318760                                                                              
318770********************************************************                      
318780 50007240-ACUMULA-TAB18.                                                      
318790     SUBTRACT 1700 FROM WKS-NUM-TOT.                                          
318800     IF WKS-TCVE-18-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
318810        MOVE WS-CVE-COMUN                                                     
318820          TO WKS-TCVE-18-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
318830     IF WKS-TCVE-18-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
318840        ADD WS-IMP-COMUN                                                      
318850            TO WKS-TCVE-18-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
318860        ADD 1                                                                 
318870            TO WKS-TCVE-18-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
318880     ELSE                                                                     
318910        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
318920        MOVE WKS-TCVE-18-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
318930          TO WS-MSG-N-04                                                      
318940        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
318950               " CVE EN TABLA-18 ", WS-MSG-N-04                               
318960               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
318970        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
318980        PERFORM 60003000-ESC-MENSAJE                                          
318990        PERFORM 70000050-MENSAJE                                              
319000        CALL SYSTEM DMTERMINATE.                                              
319010                                                                              
319020******************************************************                        
319030 50007245-ACUMULA-TAB19.                                                      
319040     SUBTRACT 1800 FROM WKS-NUM-TOT.                                          
319050     IF WKS-TCVE-19-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
319060        MOVE WS-CVE-COMUN                                                     
319070          TO WKS-TCVE-19-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
319080     IF WKS-TCVE-19-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
319090        ADD WS-IMP-COMUN                                                      
319100            TO WKS-TCVE-19-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
319110        ADD 1                                                                 
319120            TO WKS-TCVE-19-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
319130     ELSE                                                                     
319160        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
319170        MOVE WKS-TCVE-19-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
319180          TO WS-MSG-N-04                                                      
319190        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
319200               " CVE EN TABLA-19 ", WS-MSG-N-04                               
319210               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
319220        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
319230        PERFORM 60003000-ESC-MENSAJE                                          
319240        PERFORM 70000050-MENSAJE                                              
319250        CALL SYSTEM DMTERMINATE.                                              
319260                                                                              
319270*************************************************************                 
319280 50007250-ACUMULA-TAB20.                                                      
319290     SUBTRACT 1900 FROM WKS-NUM-TOT.                                          
319300     IF WKS-TCVE-20-CVE(WKS-IND-INST, WKS-NUM-TOT) = ZEROS                    
319310        MOVE WS-CVE-COMUN                                                     
319320          TO WKS-TCVE-20-CVE(WKS-IND-INST, WKS-NUM-TOT).                      
319330     IF WKS-TCVE-20-CVE(WKS-IND-INST, WKS-NUM-TOT) = WS-CVE-COMUN             
319340        ADD WS-IMP-COMUN                                                      
319350            TO WKS-TCVE-20-IMP(WKS-IND-INST, WKS-NUM-TOT)                     
319360        ADD 1                                                                 
319370            TO WKS-TCVE-20-NUM(WKS-IND-INST, WKS-NUM-TOT)                     
319380     ELSE                                                                     
319410        MOVE WS-CVE-COMUN               TO WS-MSG-CVE                         
319420        MOVE WKS-TCVE-20-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
319430          TO WS-MSG-N-04                                                      
319440        STRING "CVE A SUMAR ", WS-MSG-CVE                                     
319450               " CVE EN TABLA-20 ", WS-MSG-N-04                               
319460               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
319470        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
319480        PERFORM 60003000-ESC-MENSAJE                                          
319490        PERFORM 70000050-MENSAJE                                              
319500        CALL SYSTEM DMTERMINATE.                                              
319510                                                                              
327000***********************************************************                   
327100 50008190-ENVIA-MOVSS151.                                                     
327200     MOVE 1                     TO WS-S151-0101-FUNCION-I.                    
327300     MOVE B03-NUM-PRODUCTO      TO WS-S151-0101-PRODUCT-I.                    
327400     MOVE B03-NUM-INSTRUM       TO WS-S151-0101-INSTRUMENTO-I.                
327500     MOVE B03-SUC-PROMOTORA     TO WS-S151-0101-SUCPROM-I                     
327600                                   WS-S151-0101-SUCTRAN-I.                    
327700     MOVE ZEROS                 TO WS-S151-0101-CAJTRAN-I.                    
327800     MOVE B03-MONEDA            TO WS-S151-0101-MONEDA-I.                     
327810     MOVE B03-NUM-CONTRATO      TO WS-S151-0101-CUENTA-I.                     
327820     MOVE B03-NUM-CLIENTE       TO WS-S151-0101-NUM-CTE-I.                    
327825     MOVE B03-NOMBRE            TO WS-S151-0101-NOMBRE-I.                     
327830     MOVE B03-SERVCITIDIREC     TO WS-S151-0101-SERVCITIDIREC-I.              
327831* INI INDICADOR BNE LP39629                                                   
327832     MOVE B03-IND-BNE-DIV       TO WS-S151-0101-IND-BNE-I.                    
327833* FIN INDICADOR BNE LP39629                                                   
327835     MOVE 0                     TO WS-S151-0101-SERVICIO-ALERTA-I.            
327840     MOVE 0                     TO WS-S151-0101-SALDO-FINAL-I.                
327845     MOVE B03-NUM-GPOSOCIO      TO WS-S151-0101-GRUPO-SOC-I.                  
327850     MOVE B03-MED-ACC-BIN       TO WS-S151-0101-BIN-TAR-I.                    
327900                                                                              
327905     IF B03-FEC-ULTMOV > 0                                                    
327910        MOVE B03-FEC-ULTMOV     TO WS-S151-0101-FEC-ULTMOV-I                  
327915     ELSE                                                                     
327920        MOVE B03-FEC-APERTURA   TO WS-S151-0101-FEC-ULTMOV-I.                 
327940                                                                              
327960     IF B03-CONT-CLVDIA   > 0                                                 
327980        IF (B03-NUM-MOVS    > 0)                                              
327982        OR (B03-IMP-CGOSDIA > 0)                                              
327984        OR (B03-IMP-ABOSDIA > 0)                                              
327986        OR (B06-DEPS-DIA(WKS-DD-FBASE)) > 0                                   
327990           MOVE WKS-FEC-BASE-08 TO WS-S151-0101-FEC-ULTMOV-I.                 
327992                                                                              
328000     MOVE WKS-FEC-BASE-08       TO WS-S151-0101-FECCONT-I                     
328100                                   WS-S151-0101-FECVA-I                       
328200     MOVE WKS-FEC-MAQ-08        TO WS-S151-0101-FECMOV-I.                     
328300     MOVE WKS-HORA-MAQ          TO WS-S151-0101-HORAMOV-I.                    
328400     MOVE 27                    TO WS-S151-0101-TIPO-PROC-I.                  
328500     MOVE 1                     TO WS-S151-0101-ORIGEN-I.                     
328510     MOVE 1                     TO WS-S151-0101-IND-EDOCTA-I.                 
328600     MOVE W77-MY-AUTORIZ        TO WS-S151-0101-AUTAPL-I.                     
328700     MOVE ZEROS                 TO WS-S151-0101-REFNUM-I.                     
328800     MOVE B03-SECTOR            TO WS-S151-0101-SECTOR-I.                     
328900     MOVE B03-BANCA             TO WS-S151-0101-BANCA-I.                      
328910     MOVE B03-ESTACION-LB       TO WS-S151-0101-ESTACION-LB-I.                
328920     MOVE 002                   TO WS-S151-0101-BCO-ORI-I.                    
328922     MOVE 002                   TO WS-S151-0101-BCO-DES-I.                    
329000     MOVE W77-MY-CSI            TO WS-S151-0101-NODORI-I.                     
329100                                                                              
329120     IF WKS-SIN-LBS151 = 1                                                    
329140        PERFORM 20000151-CARGAMOV1-LIMPIA                                     
329200     ELSE                                                                     
329220        PERFORM 20000151-CARGAMOV1.                                           
329240                                                                              
329300     MOVE 0        TO WKS-IND-MOV.                                            
329400                                                                              
329500****************************************************************              
329600 50008500-GENERA-PUNTEO.                                                      
329700     MOVE 27                          TO WKS-I04-R01-TPOREG.                  
329800     MOVE B03-SUC-PROMOTORA           TO WKS-I04-R01-SUCTRA.                  
329900     MOVE ZEROS                       TO WKS-I04-R01-CAJTRA.                  
330000     MOVE W77-MY-AUTORIZ              TO WKS-I04-R01-AUTTRA.                  
330100     MOVE B03-NUM-CONTRATO            TO WKS-I04-R01-CTO.                     
330200     MOVE B03-NUM-PRODUCTO            TO WKS-I04-R01-PROD.                    
330300     MOVE B03-NUM-INSTRUM             TO WKS-I04-R01-INST.                    
330400     MOVE B03-MONEDA                  TO WKS-I04-R01-MONEDA.                  
330500     MOVE WS-CVE-COMUN                TO WKS-I04-R01-CLAVE.                   
330600     MOVE WS-IMP-COMUN                TO WKS-I04-R01-IMPORTE.                 
330700     MOVE ZEROS                       TO WKS-I04-R01-REFE.                    
330800     MOVE 0                           TO WKS-I04-R01-AUTS151.                 
330900     MOVE WKS-FEC-MAQ-08              TO WKS-I04-R01-FECMAQ.                  
331000     MOVE WKS-HORA-MAQ                TO WKS-I04-R01-HORAMAQ.                 
331100     MOVE 1                           TO WKS-I04-R01-TPOMOV.                  
331200     MOVE 500                         TO WKS-I04-R01-SISORIG.                 
331300     MOVE 27                          TO WKS-I04-R01-TPOPROC.                 
331310     MOVE WKS-ESQ-CONTABLE            TO WKS-I04-R01-ESQCONT.                 
331320     MOVE 002002                      TO WKS-I04-R01-BCO-DEST.                
331400     MOVE WKS-I04-R01-DATOS           TO I04-R00-PUNTEOOUT.                   
331500     PERFORM 20004760-ESCRIBE-PUNTEO.                                         
331600                                                                              
331700**************************************************************                
331800 50097000-ACTUALIZA-GLOBALES.                                                 
331900     MOVE 1  TO W77-SW-BEGINTRAN  W77-SW-GLOBAL.                              
332000     PERFORM 90000000-BEGIN-TRANSACTION.                                      
332100     IF WS-STATUS-BASE > 0                                                    
332200        CALL SYSTEM DMTERMINATE.                                              
332300                                                                              
332400     PERFORM 50097100-INSTRUM-GLOBALES                                        
332500             VARYING WKS-IND-INST FROM 1 BY 1                                 
332600                     UNTIL WKS-IND-INST > 30.                                 
332700                                                                              
332800     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
332900     IF WS-STATUS-BASE > 0                                                    
333000        CALL SYSTEM DMTERMINATE.                                              
333100     MOVE 0 TO W77-SW-BEGINTRAN W77-SW-GLOBAL.                                
333200                                                                              
333300*************************************************************                 
333400 50097100-INSTRUM-GLOBALES.                                                   
333500     IF WKS-TB-B05-PROD(WKS-IND-INST) > 0                                     
333600        MOVE WKS-TOTAL-CVES-01    TO WKS-TOTAL-CVES-99                        
333700        PERFORM 50097110-TABXX-GLOBALES                                       
333800                VARYING WKS-NUM-TOT FROM 1 BY 1                               
333900                UNTIL WKS-NUM-TOT > 100                                       
334000        MOVE WKS-TOTAL-CVES-02    TO WKS-TOTAL-CVES-99                        
334100        PERFORM 50097110-TABXX-GLOBALES                                       
334200                VARYING WKS-NUM-TOT FROM 1 BY 1                               
334300                UNTIL WKS-NUM-TOT > 100                                       
334400        MOVE WKS-TOTAL-CVES-03    TO WKS-TOTAL-CVES-99                        
334500        PERFORM 50097110-TABXX-GLOBALES                                       
334600                VARYING WKS-NUM-TOT FROM 1 BY 1                               
334700                UNTIL WKS-NUM-TOT > 100                                       
334800        MOVE WKS-TOTAL-CVES-04    TO WKS-TOTAL-CVES-99                        
334900        PERFORM 50097110-TABXX-GLOBALES                                       
335000                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335100                UNTIL WKS-NUM-TOT > 100                                       
335200        MOVE WKS-TOTAL-CVES-05    TO WKS-TOTAL-CVES-99                        
335210        PERFORM 50097110-TABXX-GLOBALES                                       
335220                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335230                UNTIL WKS-NUM-TOT > 100                                       
335240        MOVE WKS-TOTAL-CVES-06    TO WKS-TOTAL-CVES-99                        
335250        PERFORM 50097110-TABXX-GLOBALES                                       
335260                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335270                UNTIL WKS-NUM-TOT > 100                                       
335280        MOVE WKS-TOTAL-CVES-07    TO WKS-TOTAL-CVES-99                        
335300        PERFORM 50097110-TABXX-GLOBALES                                       
335310                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335320                UNTIL WKS-NUM-TOT > 100                                       
335330        MOVE WKS-TOTAL-CVES-08    TO WKS-TOTAL-CVES-99                        
335340        PERFORM 50097110-TABXX-GLOBALES                                       
335350                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335360                UNTIL WKS-NUM-TOT > 100                                       
335400        MOVE WKS-TOTAL-CVES-09    TO WKS-TOTAL-CVES-99                        
335410        PERFORM 50097110-TABXX-GLOBALES                                       
335420                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335430                UNTIL WKS-NUM-TOT > 100                                       
335440        MOVE WKS-TOTAL-CVES-10    TO WKS-TOTAL-CVES-99                        
335450        PERFORM 50097110-TABXX-GLOBALES                                       
335460                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335470                UNTIL WKS-NUM-TOT > 100                                       
335475        MOVE WKS-TOTAL-CVES-11    TO WKS-TOTAL-CVES-99                        
335480        PERFORM 50097110-TABXX-GLOBALES                                       
335485                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335490                UNTIL WKS-NUM-TOT > 100                                       
335495        MOVE WKS-TOTAL-CVES-12    TO WKS-TOTAL-CVES-99                        
335500        PERFORM 50097110-TABXX-GLOBALES                                       
335505                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335510                UNTIL WKS-NUM-TOT > 100                                       
335515        MOVE WKS-TOTAL-CVES-13    TO WKS-TOTAL-CVES-99                        
335520        PERFORM 50097110-TABXX-GLOBALES                                       
335525                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335530                UNTIL WKS-NUM-TOT > 100                                       
335535        MOVE WKS-TOTAL-CVES-14    TO WKS-TOTAL-CVES-99                        
335540        PERFORM 50097110-TABXX-GLOBALES                                       
335545                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335550                UNTIL WKS-NUM-TOT > 100                                       
335555        MOVE WKS-TOTAL-CVES-15    TO WKS-TOTAL-CVES-99                        
335560        PERFORM 50097110-TABXX-GLOBALES                                       
335565                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335570                UNTIL WKS-NUM-TOT > 100                                       
335575        MOVE WKS-TOTAL-CVES-16    TO WKS-TOTAL-CVES-99                        
335580        PERFORM 50097110-TABXX-GLOBALES                                       
335585                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335590                UNTIL WKS-NUM-TOT > 100                                       
335595        MOVE WKS-TOTAL-CVES-17    TO WKS-TOTAL-CVES-99                        
335600        PERFORM 50097110-TABXX-GLOBALES                                       
335605                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335610                UNTIL WKS-NUM-TOT > 100                                       
335615        MOVE WKS-TOTAL-CVES-18    TO WKS-TOTAL-CVES-99                        
335620        PERFORM 50097110-TABXX-GLOBALES                                       
335625                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335630                UNTIL WKS-NUM-TOT > 100                                       
335635        MOVE WKS-TOTAL-CVES-19    TO WKS-TOTAL-CVES-99                        
335640        PERFORM 50097110-TABXX-GLOBALES                                       
335645                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335650                UNTIL WKS-NUM-TOT > 100                                       
335655        MOVE WKS-TOTAL-CVES-20    TO WKS-TOTAL-CVES-99                        
335660        PERFORM 50097110-TABXX-GLOBALES                                       
335665                VARYING WKS-NUM-TOT FROM 1 BY 1                               
335670                UNTIL WKS-NUM-TOT > 100.                                      
335680                                                                              
335700********************************************************                      
335800 50097110-TABXX-GLOBALES.                                                     
335900     IF WKS-TCVE-99-CVE(WKS-IND-INST, WKS-NUM-TOT) > 0                        
335910        MOVE 002002                          TO WS-LLAVE-BANCOS               
336000        MOVE WKS-TB-B05-PROD(WKS-IND-INST)   TO WS-NUM-PRODUCTO               
336100        MOVE WKS-TB-B05-INST(WKS-IND-INST)   TO WS-NUM-INSTRUM                
336200        MOVE WKS-TB-B05-MONEDA(WKS-IND-INST) TO WS-MONEDA                     
336300        MOVE 130                             TO WS-NUM-PASO                   
336400        MOVE WKS-TCVE-99-CVE(WKS-IND-INST, WKS-NUM-TOT)                       
336500             TO WS-CLAVE-TRANS                                                
336600                                                                              
336700        PERFORM 90000014-B14SXPRDPASOCVE-LOCK                                 
336800        IF WS-DB-NOTERROR                                                     
336900           PERFORM 50097120-SUMA-B14CVEGLOBAL                                 
337000        ELSE                                                                  
337100        IF WS-DB-NOTFOUND                                                     
337200           PERFORM 90000014-B14TOTCVES-CREATE                                 
337300           IF WS-DB-NOTERROR                                                  
337320              MOVE WS-LLAVE-BANCOS       TO B14-LLAVE-BANCOS                  
337400              MOVE WS-NUM-PRODUCTO       TO B14-NUM-PRODUCTO                  
337500              MOVE WS-NUM-INSTRUM        TO B14-NUM-INSTRUM                   
337600              MOVE WS-MONEDA             TO B14-MONEDA                        
337700              MOVE WS-NUM-PASO           TO B14-NUM-PASO                      
337800              MOVE WS-CLAVE-TRANS        TO B14-CLAVE-TRANS                   
337900              PERFORM 50097120-SUMA-B14CVEGLOBAL                              
338000           ELSE                                                               
338800              MOVE "ERR CREATE B14CVES " TO WS-0101-TEXT-MSG                  
338900              MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                       
339000              PERFORM 60003000-ESC-MENSAJE                                    
339100              PERFORM 70000050-MENSAJE                                        
339200              IF W77-SW-BEGINTRAN = 1                                         
339300                 PERFORM 90000000-END-TRANSACTIONNOAU                         
339400                 CALL SYSTEM DMTERMINATE                                      
339500              ELSE                                                            
339600                 CALL SYSTEM DMTERMINATE                                      
339700        ELSE                                                                  
339910         MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                            
340000         MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                             
340100         MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                            
340200         MOVE WS-MONEDA             TO WS-MSG-MDA                             
340300         MOVE WS-NUM-PASO           TO WS-MSG-PASO                            
340400         MOVE WS-CLAVE-TRANS        TO WS-MSG-CVE                             
340490         STRING "ERR LOCK B14CVES",                                           
340495                " ", WS-MSG-N-06,                                             
340500                " ", WS-MSG-PRD,                                              
340600                " ", WS-MSG-INST,                                             
340650                " ", WS-MSG-MDA                                               
340700                " ", WS-MSG-PASO,                                             
340750                " ", WS-MSG-CVE                                               
340800                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
340900         MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                            
341000         PERFORM 60003000-ESC-MENSAJE                                         
341100         PERFORM 70000050-MENSAJE                                             
341200         IF W77-SW-BEGINTRAN = 1                                              
341300            PERFORM 90000000-END-TRANSACTIONNOAU                              
341400            CALL SYSTEM DMTERMINATE                                           
341500         ELSE                                                                 
341600            CALL SYSTEM DMTERMINATE.                                          
341700                                                                              
341800***********************************************************                   
341900 50097120-SUMA-B14CVEGLOBAL.                                                  
342000     PERFORM 50002090-DAME-CVEFUNCION.                                        
342100                                                                              
342200     ADD WKS-TCVE-99-IMP(WKS-IND-INST, WKS-NUM-TOT)                           
342300      TO B14-IMPORTE.                                                         
342400     ADD WKS-TCVE-99-NUM(WKS-IND-INST, WKS-NUM-TOT)                           
342500      TO B14-NUM-TRANS.                                                       
342600     PERFORM 50097130-STORE-B14CVEGLOBAL.                                     
342700                                                                              
342800************************************************************                  
342900 50097130-STORE-B14CVEGLOBAL.                                                 
343000     PERFORM 90000014-B14TOTCVES-STORE.                                       
343100     IF WS-STATUS-BASE > 0                                                    
343310        MOVE WS-LLAVE-BANCOS       TO WS-MSG-N-06                             
343400        MOVE WS-NUM-PRODUCTO       TO WS-MSG-PRD                              
343500        MOVE WS-NUM-INSTRUM        TO WS-MSG-INST                             
343600        MOVE WS-MONEDA             TO WS-MSG-MDA                              
343700        MOVE WS-NUM-PASO           TO WS-MSG-PASO                             
343800        MOVE WS-CLAVE-TRANS        TO WS-MSG-CVE                              
343880        STRING "ERR STORE B14TCVES",                                          
343890               " ", WS-MSG-N-06,                                              
343900               " ", WS-MSG-PRD,                                               
344000               " ", WS-MSG-INST,                                              
344050               " ", WS-MSG-MDA,                                               
344100               " ", WS-MSG-PASO,                                              
344150               " ", WS-MSG-CVE                                                
344200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
344300        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
344400        PERFORM 60003000-ESC-MENSAJE                                          
344500        PERFORM 70000050-MENSAJE                                              
344600        IF W77-SW-BEGINTRAN = 1                                               
344700           PERFORM 90000000-END-TRANSACTIONNOAU                               
344800           CALL SYSTEM DMTERMINATE                                            
344900        ELSE                                                                  
345000           CALL SYSTEM DMTERMINATE.                                           
345100                                                                              
345200************************************************************                  
345300 59000000-ACTUALIZA-CONTROL.                                                  
345400                                                                              
345500     PERFORM 90000000-BEGIN-TRANSACTION.                                      
345600     IF WS-STATUS-BASE > 0                                                    
345700        CALL SYSTEM DMTERMINATE.                                              
345710                                                                              
345800     PERFORM 90000000-B00CTRLPASO-LOCK.                                       
345810     IF WS-STATUS-BASE > 0                                                    
346100        STRING "ERR LOCK B00CTRLPASO (02) ", WS-STATUS-BASE                   
346200               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
346210        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
346220        PERFORM 60003000-ESC-MENSAJE                                          
346300        PERFORM 70000050-MENSAJE                                              
346400        CALL SYSTEM DMTERMINATE.                                              
346800                                                                              
346900     MOVE 127                   TO B00-NUM-PASO-01.                           
347000                                                                              
348600     PERFORM 90000000-B00CTRLPASO-STORE.                                      
348610     IF WS-STATUS-BASE > 0                                                    
348900        STRING "ERR STORE B00CTRLPASO (02) ", WS-STATUS-BASE                  
349000               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
349100        MOVE WS-0101-TEXT-MSG  TO WLI-R05-MENSAJE                             
349200        PERFORM 60003000-ESC-MENSAJE                                          
349300        PERFORM 70000050-MENSAJE                                              
349400        CALL SYSTEM DMTERMINATE.                                              
349600                                                                              
349700     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
349800     IF WS-STATUS-BASE > 0                                                    
349900        CALL SYSTEM DMTERMINATE.                                              
350200                                                                              
350300*****************************************************************             
350400 59999990-FIN-PGM.                                                            
350500     ADD  1 TO WKS-I04-R99-NUMREGS.                                           
350600     MOVE WKS-I04-R99-TRAILER    TO I04-R00-PUNTEOOUT.                        
350700     PERFORM 20004760-ESCRIBE-PUNTEO.                                         
350800                                                                              
350900     MOVE WLI-R00-L99-FINAL      TO WLI-R04-L07-DETALLE.                      
351000     PERFORM 60002250-ESC-CANCELADOS.                                         
351700     MOVE WLI-R00-L99-FINAL      TO WLI-R05-MENSAJE.                          
351800     PERFORM 60003000-ESC-MENSAJE.                                            
351900                                                                              
352000     CLOSE   S500BD01CAPTACION.                                               
352100                                                                              
352200     CLOSE   I04-PUNTEOOUT  WITH SAVE.                                        
352300                                                                              
352700     CLOSE   R04-CANCS408   WITH SAVE                                         
352800             R05-MENSAJES   WITH SAVE.                                        
352820     MOVE 0 TO W77-OPEN-R05.                                                  
352900                                                                              
353000     IF W77-NOHAY-S408 = 0                                                    
353100        CLOSE E01-MOVS408 WITH SAVE.                                          
353200                                                                              
354100                                                                              
354200********  RUTINAS PARA LISTADOS *******************************               
364300 60002000-ARMALIN-CANDELADOS.                                                 
364400     MOVE WKS-E01-R01-CVE-SOB       TO WLI-R04-L07-CLAVE.                     
364410                                                                              
364500     IF W77-TPO-CANCEL = 5                                                    
364600        MOVE WKS-E01-R01-CONTRATO   TO WLI-R04-L07-CONTRATO                   
364700        MOVE WKS-E01-R01-SUC-PROM   TO WLI-R04-L07-SUC                        
364800        MOVE WKS-E01-R01-IMPORTE    TO WLI-R04-L07-SALDO                      
364900     ELSE                                                                     
365000        MOVE B03-NUM-CONTRATO       TO WLI-R04-L07-CONTRATO                   
365100        MOVE B03-SUC-PROMOTORA      TO WLI-R04-L07-SUC                        
365200        MOVE B03-FEC-APERTURA       TO WLI-R04-L07-FEC-APE                    
365300        MOVE B03-NOMBRE             TO WLI-R04-L07-NOMBRE                     
365400        MOVE B03-NUM-PRODUCTO       TO WLI-R04-L07-PROD                       
365500        MOVE B03-NUM-INSTRUM        TO WLI-R04-L07-INST                       
365600        MOVE B03-MONEDA             TO WLI-R04-L07-MONEDA                     
365700        IF W77-TPO-CANCEL = 1                                                 
365800           COMPUTE WLI-R04-L07-SALDO = WKS-E01-R01-IMPORTE * -1               
365900        ELSE                                                                  
366000           ADD B03-SDO-ACTUAL B03-SDOPROT-BLOQ                                
366002                GIVING WLI-R04-L07-SALDO.                                     
366010                                                                              
366100     IF W77-TPO-CANCEL > 0 AND < 10                                           
366200        MOVE WKS-TB-TPO-CANC(W77-TPO-CANCEL)                                  
366300             TO WLI-R04-L07-TPO-MOV                                           
366400     ELSE                                                                     
366500        MOVE "ERROR NO IDENTIFICADO" TO WLI-R04-L07-TPO-MOV.                  
366600                                                                              
366700     PERFORM 60002250-ESC-CANCELADOS.                                         
366800                                                                              
366900*********************************************************                     
367000 60002250-ESC-CANCELADOS.                                                     
367100     ADD 1   TO W77-NLIN-04.                                                  
367200     IF W77-NLIN-04 > 54                                                      
367300        PERFORM 60002260-ENCA-REP04.                                          
367400     WRITE R04-L00-CANCS408   FROM WLI-R04-L07-DETALLE AFTER 1.               
367500     MOVE " "                 TO WLI-R04-L07-DETALLE.                         
367600                                                                              
367700**********************************************************                    
367800 60002260-ENCA-REP04.                                                         
367900     ADD 1                           TO W77-NPAG-04.                          
368000     MOVE W77-NPAG-04                TO WLI-R00-L03-NPAG.                     
368100     MOVE WKS-TITULO-R04             TO WLI-R00-L02-TITULO.                   
368200     MOVE " "                        TO WLI-R00-L03-SBTIT.                    
368300     MOVE "004CANCELAS408"           TO WLI-R00-L01-NAME.                     
368400     MOVE 0511                       TO WLI-R00-L04-SUC.                      
368500     MOVE "CTO PROC DE VALORES"      TO WLI-R00-L05-NBSUC.                    
368600     WRITE R04-L00-CANCS408  FROM WLI-R00-L01-ENCA AFTER PAGE.                
368700     WRITE R04-L00-CANCS408  FROM WLI-R00-L02-ENCA AFTER 1.                   
368800     WRITE R04-L00-CANCS408  FROM WLI-R00-L03-ENCA AFTER 1.                   
368900     WRITE R04-L00-CANCS408  FROM WLI-R00-L04-ENCA AFTER 1.                   
369000     WRITE R04-L00-CANCS408  FROM WLI-R00-L05-ENCA AFTER 1.                   
369100     WRITE R04-L00-CANCS408  FROM WLI-R04-L06-ENCA AFTER 2.                   
369200     MOVE " "                TO R04-L00-CANCS408.                             
369300     WRITE R04-L00-CANCS408                         AFTER 1.                  
369400     MOVE 8                  TO W77-NLIN-04.                                  
369500                                                                              
369600***************************************************************               
369700 60003000-ESC-MENSAJE.                                                        
369750     IF W77-OPEN-R05 = 1                                                      
369800        ADD  1   TO W77-NLIN-05                                               
369900        IF W77-NLIN-05 > 55                                                   
370000           PERFORM 60003100-ENCA-MENSAJES.                                    
370020                                                                              
370040     IF W77-OPEN-R05 = 1                                                      
370100        WRITE R05-L00-MENSAJE FROM WLI-R05-DETALLE  AFTER 1.                  
370150                                                                              
370200     MOVE " "  TO WLI-R05-DETALLE.                                            
370300                                                                              
370400**************************************************************                
370500 60003100-ENCA-MENSAJES.                                                      
370600     ADD 1                    TO W77-NPAG-05.                                 
370700     MOVE W77-NPAG-05         TO WLI-R00-L03-NPAG.                            
370800     MOVE WKS-TITULO-R05      TO WLI-R00-L02-TITULO.                          
370900     MOVE " "                 TO WLI-R00-L03-SBTIT.                           
371000     MOVE "005MENSAJES"       TO WLI-R00-L01-NAME.                            
371100     IF W77-MY-CSI = 4                                                        
371200        MOVE 3667                     TO WLI-R00-L04-SUC                      
371300        MOVE "CYSAU MTY CTROL PROD"   TO WLI-R00-L05-NBSUC                    
371400     ELSE                                                                     
371500        MOVE 3084                     TO WLI-R00-L04-SUC                      
371600        MOVE "PYCP JARDINES"          TO WLI-R00-L05-NBSUC.                   
371700     WRITE R05-L00-MENSAJE    FROM WLI-R00-L01-ENCA AFTER PAGE.               
371800     WRITE R05-L00-MENSAJE    FROM WLI-R00-L02-ENCA AFTER 1.                  
371900     WRITE R05-L00-MENSAJE    FROM WLI-R00-L03-ENCA AFTER 1.                  
372000     WRITE R05-L00-MENSAJE    FROM WLI-R00-L04-ENCA AFTER 1.                  
372100     WRITE R05-L00-MENSAJE    FROM WLI-R00-L05-ENCA AFTER 1.                  
372200     MOVE " "                 TO R05-L00-MENSAJE.                             
372300     WRITE R05-L00-MENSAJE                          AFTER 2.                  
372400     MOVE 8 TO W77-NLIN-05.                                                   
372500                                                                              
372600**********************************************************                    
372605 70099998-INIACT-MAPLI.                                                       
372606     MOVE W77-ID-NOMB-ACT   TO W77-ID-NOMB-LIB.                               
372610     PERFORM 70000910-INIACT-MAPLI.                                           
372615     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
372616        STRING "INICIO ACT " W77-ID-ACTXX-MAPLI                               
372617               DELIMITED BY SIZE INTO W77-ERR-L035-DATO                       
372620        PERFORM 70099999-ERROR-MAPLI.                                         
372625                                                                              
372630**********************************************************                    
372635 70099998-ACT-REGPROC.                                                        
372640     PERFORM 70000950-ACT-REGPROC.                                            
372645     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
372646        STRING "SUMA REG ACT " W77-ID-ACTXX-MAPLI                             
372647               DELIMITED BY SIZE INTO W77-ERR-L035-DATO                       
372650        PERFORM 70099999-ERROR-MAPLI.                                         
372655                                                                              
372660**********************************************************                    
372665 70099998-FIN-ACTI-MAPLI.                                                     
372670     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
372675     IF WS-S038L035-RESULT > 0 AND W77-ERR-L035-MAPLI = 0                     
372676        STRING "FIN ACT " W77-ID-ACTXX-MAPLI                                  
372677               DELIMITED BY SIZE INTO W77-ERR-L035-DATO                       
372680        PERFORM 70099999-ERROR-MAPLI.                                         
372685                                                                              
372690**********************************************************                    
372700                                                                              
372800                                                                              
372900**********************************************************                    
372910 70099999-ERROR-MAPLI.                                                        
372912     IF W77-OPEN-R05 = 1                                                      
372915        MOVE 1                   TO W77-ERR-L035-MAPLI                        
372920        MOVE WS-S038L035-RESULT  TO WS-MSG-RS                                 
372930        STRING "ERROR LIB/MAPLI RS="  WS-MSG-RS                               
372940               "  SUSPENDO MONITOREO "                                        
372950               DELIMITED BY SIZE INTO WLI-R05-MENSAJE                         
372960        PERFORM 60003000-ESC-MENSAJE                                          
372970        STRING "CALL S038L035 " W77-ERR-L035-DATO                             
372972               DELIMITED BY SIZE INTO WLI-R05-MENSAJE                         
372974        PERFORM 60003000-ESC-MENSAJE                                          
372976        MOVE " " TO W77-ERR-L035-DATO.                                        
372978                                                                              
372980*****************************************************                         
373000                                                                              
373100                                                                              
373200                                                                              
373300                                                                              
373400                                                                              
373500                                                                              
373600                                                                              
373700                                                                              
373800                                                                              
379000                                                                              
379100****INCLUDE DE RUTINAS COMUNES   *************************                    
379200                                                                              
379300 COPY "S500/INC/PRO/25MTP002".                                                
379310                                                                              
379320                                                                              
379340 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
379400**********************************************************                    
