000010$SET LIST                                                                     
000510$SET LINEINFO                                                                 
001010$SET ERRORLIST                                                                
001510$SET ERRORLIMIT = 100                                                         
002510$SET BDB00R01                                                                 
003010$SET BDB00R02                                                                 
003510$SET BDB00R03                                                                 
004010$SET BDB00R04                                                                 
004510                                                                              
004520$SET BDB00R22                                                                 
004530$SET BDB00R23                                                                 
004540                                                                              
005010$SET BDB02R01                                                                 
006010                                                                              
009010$SET BDB17R02                                                                 
009510$SET BDB17R06                                                                 
010010                                                                              
010020$SET BDB28R01                                                                 
010030$SET BDB28R02                                                                 
010040$SET BDB28R03                                                                 
010050$SET BDB28R04                                                                 
010060                                                                              
010510$SET BDB91                                                                    
011010$SET S100VERSIONES                                                            
011020$SET S000LIBLJ                                                                
011510$SET S151REGISTRA                                                             
011520$SET S151REGISTRA2                                                            
012010$SET FECHA2000                                                                
012510****************************************************************              
013010*                                                                             
013510*   ARCHIVO: S500P178.INC                                                     
014010*   CODIGO DE "EN BATCH S500P178"                                             
014510*   DEL SISTEMA DE CAPTACION                                                  
015010*   VERSION - FEB /2006 CUENTA MAX 2DA. ETAPA.                                
015510*                                                                             
016010*****************************************************************             
016510* I D E N T I F I C A T I O N      D I V I S I O N.                           
017010*****************************************************************             
017510 IDENTIFICATION DIVISION.                                                     
018010 PROGRAM-ID. S500P178.                                                        
018510                                                                              
019010*****************************************************************             
019510* E N V I R O N M E N T       D I V I S I O N.                                
020010*****************************************************************             
020510 ENVIRONMENT DIVISION.                                                        
021010 CONFIGURATION SECTION.                                                       
021510 INPUT-OUTPUT SECTION.                                                        
022010*****************************************************************             
022510* F I L E     C O N T R O L.                                                  
023010*****************************************************************             
023510 FILE-CONTROL.                                                                
024010                                                                              
024510****************************************************************              
025010* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
025510* BONIFICACIONES DE LINEA COPIA 1.                                            
026010****************************************************************              
026510     SELECT PUNTEOL1                                                          
027010     ASSIGN TO DISK.                                                          
027510                                                                              
027520****************************************************************              
027530* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
027540* BONIFICACIONES DE LINEA COPIA 2.                                            
027550****************************************************************              
027560     SELECT PUNTEOL2                                                          
027570     ASSIGN TO DISK.                                                          
027580                                                                              
027590*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PLINEA (P105)   -YCY            
027600****************************************************************              
027610* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
027620* BONIFICACIONES DE LINEA COPIA 3.                                            
027630****************************************************************              
027640     SELECT PUNTEOL3                                                          
027650     ASSIGN TO DISK.                                                          
027660                                                                              
028010****************************************************************              
028510* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
029010* BONIFICACIONES DE BATCH COPIA 1.                                            
029510****************************************************************              
030010     SELECT PUNTEOB1                                                          
030510     ASSIGN TO DISK.                                                          
031010                                                                              
031020****************************************************************              
031030* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
031040* BONIFICACIONES DE BATCH COPIA 2.                                            
031050****************************************************************              
031060     SELECT PUNTEOB2                                                          
031070     ASSIGN TO DISK.                                                          
031080                                                                              
031090*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PBATCH (P130)   -YCY            
031100****************************************************************              
031110* ARCHIVO QUE CONTIENE LOS DATOS A LEER PARA ACTUALIZAR LAS                   
031120* BONIFICACIONES DE BATCH COPIA 3.                                            
031130****************************************************************              
031140     SELECT PUNTEOB3                                                          
031150     ASSIGN TO DISK.                                                          
031160                                                                              
031510****************************************************************              
032010* ARCHIVO QUE CONTIENE LOS DATOS DE AMBOS ARCHIVOS PARA PODER                 
032510* SORTEARLO.                                                                  
033010****************************************************************              
033510     SELECT PUNTEOT                                                           
034010     ASSIGN TO DISK.                                                          
034510                                                                              
035010****************************************************************              
035510* DECLARACION DEL ARCHIVO QUE SE VA A UTILIZAR PARA SORTEAR LOS               
036010* CAMPOS DE TOTALES POR CLAVE.                                                
036510****************************************************************              
037010     SELECT PUNTEO-SORT                                                       
037510     ASSIGN TO SORT DISK.                                                     
038010                                                                              
038510****************************************************************              
039010* D A T A              D I V I S I O N.                                       
039510****************************************************************              
040010 DATA DIVISION.                                                               
040510                                                                              
041010****************************************************************              
041510* F I L E              S E C T I O N.                                         
042010****************************************************************              
042510 FILE SECTION.                                                                
043010                                                                              
043510****************************************************************              
044010* DECLARACION DEL ARCHIVO DE PUNTEOL1.                                        
044510****************************************************************              
045010 FD  PUNTEOL1                                                                 
045510     BLOCK CONTAINS 300 RECORDS                                               
046010     VALUE OF TITLE IS WS-ETIQ-PUNTEOL1                                       
046510     VALUE OF AREAS 1000                                                      
047010     VALUE OF AREASIZE 3600.                                                  
047510                                                                              
048010 01  REG-PUNTEOL1.                                                            
048510   02 WS-HEAL1-TREG             PIC 9(02).                                    
049010   02 WS-HEADERL1.                                                            
049510     03 WS-HEAL1-SORI           PIC 9(04).                                    
050010     03 WS-HEAL1-SDES           PIC 9(04).                                    
050510     03 WS-HEAL1-FECHA          PIC 9(08).                                    
051010     03 WS-HEAL1-CSIO           PIC 9(02).                                    
051510     03 WS-HEAL1-FPRO           PIC 9(08).                                    
052010     03 WS-HEAL1-HPRO           PIC 9(06).                                    
052020     03 WS-HEAL1-HPASO          PIC 9(04).                                    
052030     03 WS-HEAL1-HCOPIA         PIC 9(02).                                    
052510     03 FILLER                PIC X(20).                                      
053010   02 WS-DETALLEL1 REDEFINES WS-HEADERL1.                                     
053510     03 WS-DETL1-AUT            PIC 9(12) COMP.                               
054010     03 WS-DETL1-NUMCTO         PIC 9(12) COMP.                               
054510     03 WS-DETL1-PRD            PIC 9(04) COMP.                               
055010     03 WS-DETL1-INS            PIC 9(04) COMP.                               
055510     03 WS-DETL1-MON            PIC 9(04) COMP.                               
056010     03 WS-DETL1-CVE            PIC 9(04) COMP.                               
056510     03 WS-DETL1-IMP            PIC 9(10)V99 COMP.                            
057010     03 WS-DETL1-REF            PIC 9(12)    COMP.                            
057510     03 WS-DETL1-AUT151         PIC 9(08)    COMP.                            
058010     03 WS-DETL1-FECMAQ         PIC 9(08)    COMP.                            
058510     03 WS-DETL1-HORMAQ         PIC 9(06)    COMP.                            
059010     03 WS-DETL1-TIPMOV         PIC 9(02)    COMP.                            
059510     03 WS-DETL1-ORIGEN         PIC 9(04)    COMP.                            
060010     03 WS-DETL1-TIPRO          PIC 9(02)    COMP.                            
060510     03 FILLER                PIC X(02).                                      
061010     03 WS-DETL1-BANCOS         PIC 9(06)    COMP.                            
061510     03 FILLER                PIC X(05).                                      
062010     03 WS-DETL1-ENTREGA        PIC 9(02)    COMP.                            
062510   02 WS-TRAILERL1 REDEFINES WS-HEADERL1.                                     
063010     03 WS-TRAL1-NREG           PIC 9(08)    COMP.                            
063510     03 FILLER                PIC X(54).                                      
064010                                                                              
064510****************************************************************              
065010* DECLARACION DEL ARCHIVO DE PUNTEOB1.                                        
065510****************************************************************              
066010 FD  PUNTEOB1                                                                 
066510     BLOCK CONTAINS 300 RECORDS                                               
067010     VALUE OF TITLE IS WS-ETIQ-PUNTEOB1                                       
067510     VALUE OF AREAS 1000                                                      
068010     VALUE OF AREASIZE 7200.                                                  
068510                                                                              
069010 01  REG-PUNTEOB1.                                                            
069510   02 WS-HEAB1-TREG            PIC 9(02).                                     
070010   02 WS-HEADERB1.                                                            
070510     03 WS-HEAB1-SORI          PIC 9(04).                                     
071010     03 WS-HEAB1-SDES          PIC 9(04).                                     
071510     03 WS-HEAB1-FECHA         PIC 9(08).                                     
072010     03 WS-HEAB1-CSIO          PIC 9(02).                                     
072510     03 WS-HEAB1-FPRO          PIC 9(08).                                     
073010     03 WS-HEAB1-HPRO          PIC 9(06).                                     
073510     03 WS-HEAB1-PASO          PIC X(04).                                     
073520     03 WS-HEAB1-COPIA         PIC 9(02).                                     
074010     03 FILLER                PIC X(20).                                      
074510   02 WS-DETALLEB1 REDEFINES WS-HEADERB1.                                     
075010     03 WS-DETB1-LLAVE         PIC 9(12)          COMP.                       
075510     03 WS-DETB1-LLAVE1        REDEFINES WS-DETB1-LLAVE.                      
076010         04 WS-DETB1-SUCTRA    PIC 9(04) COMP.                                
076510         04 WS-DETB1-CAJTRA    PIC 9(02) COMP.                                
077010         04 WS-DETB1-AUTTRA    PIC 9(06) COMP.                                
077510     03 WS-DETB1-NUMCTO        PIC 9(12) COMP.                                
078010     03 WS-DETB1-PRD           PIC 9(04) COMP.                                
078510     03 WS-DETB1-INS           PIC 9(04) COMP.                                
079010     03 WS-DETB1-MON           PIC 9(04) COMP.                                
079510     03 WS-DETB1-CVE           PIC 9(04) COMP.                                
080010     03 WS-DETB1-IMP           PIC 9(10)V99 COMP.                             
080510     03 WS-DETB1-REF           PIC 9(12)    COMP.                             
081010     03 WS-DETB1-AUT151        PIC 9(08)    COMP.                             
081510     03 WS-DETB1-FECMAQ        PIC 9(08)    COMP.                             
082010     03 WS-DETB1-HORMAQ        PIC 9(06)    COMP.                             
082510     03 WS-DETB1-TIPMOV        PIC 9(02)    COMP.                             
083010     03 WS-DETB1-ORIGEN        PIC 9(04)    COMP.                             
083510     03 WS-DETB1-TIPRO         PIC 9(02)    COMP.                             
084010     03 WS-DETB1-ESQCONT       PIC 9(04)    COMP.                             
084510     03 WS-DETB1-BANCOS        PIC 9(06)    COMP.                             
085010     03 FILLER                PIC X(05).                                      
085510     03 WS-DETB1-ENTREGA       PIC 9(02)    COMP.                             
086010   02 WS-TRAILERB1 REDEFINES WS-HEADERB1.                                     
086510     03 WS-TRAB1-NREG          PIC 9(08)    COMP.                             
087010     03 FILLER                PIC X(54).                                      
087510                                                                              
087520****************************************************************              
087530* DECLARACION DEL ARCHIVO DE PUNTEOL1 COPIA 2.                                
087540****************************************************************              
087550 FD  PUNTEOL2                                                                 
087560     BLOCK CONTAINS 300 RECORDS                                               
087570     VALUE OF TITLE IS WS-ETIQ-PUNTEOL2                                       
087580     VALUE OF AREAS 1000                                                      
087590     VALUE OF AREASIZE 3600.                                                  
087600                                                                              
087610 01  REG-PUNTEOL2.                                                            
087620   02 WS-HEAL2-TREG            PIC 9(02).                                     
087630   02 WS-HEADERL2.                                                            
087640     03 WS-HEAL2-SORI          PIC 9(04).                                     
087650     03 WS-HEAL2-SDES          PIC 9(04).                                     
087660     03 WS-HEAL2-FECHA         PIC 9(08).                                     
087670     03 WS-HEAL2-CSIO          PIC 9(02).                                     
087680     03 WS-HEAL2-FPRO          PIC 9(08).                                     
087690     03 WS-HEAL2-HPRO          PIC 9(06).                                     
087700     03 WS-HEAL2-HPASO         PIC 9(04).                                     
087710     03 WS-HEAL2-HCOPIA        PIC 9(02).                                     
087720     03 FILLER                PIC X(20).                                      
087730   02 WS-DETALLEL2 REDEFINES WS-HEADERL2.                                     
087740     03 WS-DETL2-AUT           PIC 9(12) COMP.                                
087750     03 WS-DETL2-NUMCTO        PIC 9(12) COMP.                                
087760     03 WS-DETL2-PRD           PIC 9(04) COMP.                                
087770     03 WS-DETL2-INS           PIC 9(04) COMP.                                
087780     03 WS-DETL2-MON           PIC 9(04) COMP.                                
087790     03 WS-DETL2-CVE           PIC 9(04) COMP.                                
087800     03 WS-DETL2-IMP           PIC 9(10)V99 COMP.                             
087810     03 WS-DETL2-REF           PIC 9(12)    COMP.                             
087820     03 WS-DETL2-AUT151        PIC 9(08)    COMP.                             
087830     03 WS-DETL2-FECMAQ        PIC 9(08)    COMP.                             
087840     03 WS-DETL2-HORMAQ        PIC 9(06)    COMP.                             
087850     03 WS-DETL2-TIPMOV        PIC 9(02)    COMP.                             
087860     03 WS-DETL2-ORIGEN        PIC 9(04)    COMP.                             
087870     03 WS-DETL2-TIPRO         PIC 9(02)    COMP.                             
087880     03 FILLER                PIC X(02).                                      
087890     03 WS-DETL2-BANCOS        PIC 9(06)    COMP.                             
087900     03 FILLER                PIC X(05).                                      
087910     03 WS-DETL2-ENTREGA       PIC 9(02)    COMP.                             
087920   02 WS-TRAILERL2 REDEFINES WS-HEADERL2.                                     
087930     03 WS-TRAL2-NREG          PIC 9(08)    COMP.                             
087940     03 FILLER                PIC X(54).                                      
087950                                                                              
087951*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PLINEA (P105)   -YCY            
087952****************************************************************              
087953* DECLARACION DEL ARCHIVO DE PUNTEOL1 COPIA 3.                                
087954****************************************************************              
087955 FD  PUNTEOL3                                                                 
087956     BLOCK CONTAINS 300 RECORDS                                               
087957     VALUE OF TITLE IS WS-ETIQ-PUNTEOL3                                       
087958     VALUE OF AREAS 1000                                                      
087959     VALUE OF AREASIZE 3600.                                                  
087960                                                                              
087961 01  REG-PUNTEOL3.                                                            
087962   02 WS-HEAL3-TREG            PIC 9(02).                                     
087963   02 WS-HEADERL3.                                                            
087964     03 WS-HEAL3-SORI          PIC 9(04).                                     
087965     03 WS-HEAL3-SDES          PIC 9(04).                                     
087966     03 WS-HEAL3-FECHA         PIC 9(08).                                     
087967     03 WS-HEAL3-CSIO          PIC 9(02).                                     
087968     03 WS-HEAL3-FPRO          PIC 9(08).                                     
087969     03 WS-HEAL3-HPRO          PIC 9(06).                                     
087970     03 WS-HEAL3-HPASO         PIC 9(04).                                     
087971     03 WS-HEAL3-HCOPIA        PIC 9(02).                                     
087972     03 FILLER                PIC X(20).                                      
087973   02 WS-DETALLEL3 REDEFINES WS-HEADERL3.                                     
087974     03 WS-DETL3-AUT           PIC 9(12) COMP.                                
087975     03 WS-DETL3-NUMCTO        PIC 9(12) COMP.                                
087976     03 WS-DETL3-PRD           PIC 9(04) COMP.                                
087977     03 WS-DETL3-INS           PIC 9(04) COMP.                                
087978     03 WS-DETL3-MON           PIC 9(04) COMP.                                
087979     03 WS-DETL3-CVE           PIC 9(04) COMP.                                
087980     03 WS-DETL3-IMP           PIC 9(10)V99 COMP.                             
087981     03 WS-DETL3-REF           PIC 9(12)    COMP.                             
087982     03 WS-DETL3-AUT151        PIC 9(08)    COMP.                             
087983     03 WS-DETL3-FECMAQ        PIC 9(08)    COMP.                             
087984     03 WS-DETL3-HORMAQ        PIC 9(06)    COMP.                             
087985     03 WS-DETL3-TIPMOV        PIC 9(02)    COMP.                             
087986     03 WS-DETL3-ORIGEN        PIC 9(04)    COMP.                             
087987     03 WS-DETL3-TIPRO         PIC 9(02)    COMP.                             
087988     03 FILLER                PIC X(02).                                      
087989     03 WS-DETL3-BANCOS        PIC 9(06)    COMP.                             
087990     03 FILLER                PIC X(05).                                      
087991     03 WS-DETL3-ENTREGA       PIC 9(02)    COMP.                             
087992   02 WS-TRAILERL3 REDEFINES WS-HEADERL3.                                     
087993     03 WS-TRAL3-NREG          PIC 9(08)    COMP.                             
087994     03 FILLER                PIC X(54).                                      
087995                                                                              
087996****************************************************************              
087997* DECLARACION DEL ARCHIVO DE PUNTEOB1 COPIA 2.                                
087998****************************************************************              
087999 FD  PUNTEOB2                                                                 
088000     BLOCK CONTAINS 300 RECORDS                                               
088010     VALUE OF TITLE IS WS-ETIQ-PUNTEOB2                                       
088020     VALUE OF AREAS 1000                                                      
088030     VALUE OF AREASIZE 7200.                                                  
088040                                                                              
088050 01  REG-PUNTEOB2.                                                            
088060   02 WS-HEAB2-TREG            PIC 9(02).                                     
088070   02 WS-HEADERB2.                                                            
088080     03 WS-HEAB2-SORI          PIC 9(04).                                     
088090     03 WS-HEAB2-SDES          PIC 9(04).                                     
088100     03 WS-HEAB2-FECHA         PIC 9(08).                                     
088110     03 WS-HEAB2-CSIO          PIC 9(02).                                     
088120     03 WS-HEAB2-FPRO          PIC 9(08).                                     
088130     03 WS-HEAB2-HPRO          PIC 9(06).                                     
088140     03 WS-HEAB2-PASO          PIC X(04).                                     
088150     03 WS-HEAB2-COPIA         PIC 9(02).                                     
088160     03 FILLER                PIC X(20).                                      
088170   02 WS-DETALLEB2 REDEFINES WS-HEADERB2.                                     
088180     03 WS-DETB2-LLAVE         PIC 9(12)          COMP.                       
088190     03 WS-DETB2-LLAVE1        REDEFINES WS-DETB2-LLAVE.                      
088200         04 WS-DETB2-SUCTRA    PIC 9(04) COMP.                                
088210         04 WS-DETB2-CAJTRA    PIC 9(02) COMP.                                
088220         04 WS-DETB2-AUTTRA    PIC 9(06) COMP.                                
088230     03 WS-DETB2-NUMCTO        PIC 9(12) COMP.                                
088240     03 WS-DETB2-PRD           PIC 9(04) COMP.                                
088250     03 WS-DETB2-INS           PIC 9(04) COMP.                                
088260     03 WS-DETB2-MON           PIC 9(04) COMP.                                
088270     03 WS-DETB2-CVE           PIC 9(04) COMP.                                
088280     03 WS-DETB2-IMP           PIC 9(10)V99 COMP.                             
088290     03 WS-DETB2-REF           PIC 9(12)    COMP.                             
088300     03 WS-DETB2-AUT151        PIC 9(08)    COMP.                             
088310     03 WS-DETB2-FECMAQ        PIC 9(08)    COMP.                             
088320     03 WS-DETB2-HORMAQ        PIC 9(06)    COMP.                             
088330     03 WS-DETB2-TIPMOV        PIC 9(02)    COMP.                             
088340     03 WS-DETB2-ORIGEN        PIC 9(04)    COMP.                             
088350     03 WS-DETB2-TIPRO         PIC 9(02)    COMP.                             
088360     03 WS-DETB2-ESQCONT       PIC 9(04)    COMP.                             
088370     03 WS-DETB2-BANCOS        PIC 9(06)    COMP.                             
088380     03 FILLER                PIC X(05).                                      
088390     03 WS-DETB2-ENTREGA       PIC 9(02)    COMP.                             
088400   02 WS-TRAILERB2 REDEFINES WS-HEADERB2.                                     
088410     03 WS-TRAB2-NREG          PIC 9(08)    COMP.                             
088420     03 FILLER                PIC X(54).                                      
088430                                                                              
088431*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PBATCH (P130)   -YCY            
088432****************************************************************              
088433* DECLARACION DEL ARCHIVO DE PUNTEOB1 COPIA 3.                                
088434****************************************************************              
088435 FD  PUNTEOB3                                                                 
088436     BLOCK CONTAINS 300 RECORDS                                               
088437     VALUE OF TITLE IS WS-ETIQ-PUNTEOB3                                       
088438     VALUE OF AREAS 1000                                                      
088439     VALUE OF AREASIZE 7200.                                                  
088440                                                                              
088441 01  REG-PUNTEOB3.                                                            
088442   02 WS-HEAB3-TREG            PIC 9(02).                                     
088443   02 WS-HEADERB3.                                                            
088444     03 WS-HEAB3-SORI          PIC 9(04).                                     
088445     03 WS-HEAB3-SDES          PIC 9(04).                                     
088446     03 WS-HEAB3-FECHA         PIC 9(08).                                     
088447     03 WS-HEAB3-CSIO          PIC 9(02).                                     
088448     03 WS-HEAB3-FPRO          PIC 9(08).                                     
088449     03 WS-HEAB3-HPRO          PIC 9(06).                                     
088450     03 WS-HEAB3-PASO          PIC X(04).                                     
088451     03 WS-HEAB3-COPIA         PIC 9(02).                                     
088452     03 FILLER                PIC X(20).                                      
088453   02 WS-DETALLEB3 REDEFINES WS-HEADERB3.                                     
088454     03 WS-DETB3-LLAVE         PIC 9(12)          COMP.                       
088455     03 WS-DETB3-LLAVE1        REDEFINES WS-DETB3-LLAVE.                      
088456         04 WS-DETB3-SUCTRA    PIC 9(04) COMP.                                
088457         04 WS-DETB3-CAJTRA    PIC 9(02) COMP.                                
088458         04 WS-DETB3-AUTTRA    PIC 9(06) COMP.                                
088459     03 WS-DETB3-NUMCTO        PIC 9(12) COMP.                                
088460     03 WS-DETB3-PRD           PIC 9(04) COMP.                                
088461     03 WS-DETB3-INS           PIC 9(04) COMP.                                
088462     03 WS-DETB3-MON           PIC 9(04) COMP.                                
088463     03 WS-DETB3-CVE           PIC 9(04) COMP.                                
088464     03 WS-DETB3-IMP           PIC 9(10)V99 COMP.                             
088465     03 WS-DETB3-REF           PIC 9(12)    COMP.                             
088466     03 WS-DETB3-AUT151        PIC 9(08)    COMP.                             
088467     03 WS-DETB3-FECMAQ        PIC 9(08)    COMP.                             
088468     03 WS-DETB3-HORMAQ        PIC 9(06)    COMP.                             
088469     03 WS-DETB3-TIPMOV        PIC 9(02)    COMP.                             
088470     03 WS-DETB3-ORIGEN        PIC 9(04)    COMP.                             
088471     03 WS-DETB3-TIPRO         PIC 9(02)    COMP.                             
088472     03 WS-DETB3-ESQCONT       PIC 9(04)    COMP.                             
088473     03 WS-DETB3-BANCOS        PIC 9(06)    COMP.                             
088474     03 FILLER                PIC X(05).                                      
088475     03 WS-DETB3-ENTREGA       PIC 9(02)    COMP.                             
088476   02 WS-TRAILERB3 REDEFINES WS-HEADERB3.                                     
088477     03 WS-TRAB3-NREG         PIC 9(08)    COMP.                              
088478     03 FILLER                PIC X(54).                                      
088479                                                                              
088500****************************************************************              
088510* DECLARACION DEL ARCHIVO DE DONDE SE ALMACENARAN LOS ARCHIVOS                
089010* DE PUNTEO.                                                                  
089510****************************************************************              
090010 FD  PUNTEOT                                                                  
090510     BLOCK CONTAINS 300 RECORDS                                               
091010     VALUE OF TITLE IS WS-ETIQ-PUNTEOT                                        
091510     VALUE OF AREAS 1000                                                      
092010     VALUE OF AREASIZE 7200.                                                  
092510                                                                              
093010 01  REG-PUNTEOT.                                                             
093510     02 WS-DETPT-CLAVE          PIC 9(04).                                    
094010     02 WS-DETPT-NUMCTO         PIC 9(12).                                    
094510     02 WS-DETPT-IMP            PIC 9(10)V99.                                 
095010     02 WS-DETPT-TIPO-IMP       PIC 9(01).                                    
095510     02 FILLER                  PIC X(07).                                    
096010                                                                              
096510****************************************************************              
097010* CAMPOS DEL ARCHIVO QUE SORTEARA LOS MOVIMIENTOS DE PUNTEOT.                 
097510****************************************************************              
098010 SD PUNTEO-SORT.                                                              
098510  01 REG-MOVSORT.                                                             
099010    02 CVEMOV-SORT        PIC 9(04).                                          
099510    02 CTOMOV-SORT        PIC 9(12).                                          
100010    02 FILLER             PIC X(20).                                          
100510                                                                              
101010****************************************************************              
101510* D A T A     B A S E       S E C T I O N.                                    
102010****************************************************************              
102510 DATA-BASE SECTION.                                                           
103010 DB S500BD01CAPTACION.                                                        
103020 01 S500B00CTRLPASO.                                                          
103510 01 S500B02CONTROL.                                                           
104010 01 S500B17CVESXFUN.                                                          
104510 01 S500B28COMICOB.                                                           
105010 01 S500B29COMICOB.                                                           
105510 01 S500B30COMICOB.                                                           
106010 01 S500B31COMICOB.                                                           
106510 01 S500B32COMICOB.                                                           
107010 01 S500B33COMICOB.                                                           
107510 01 S500B34COMICOB.                                                           
108010 01 S500B91REINICIO.                                                          
108510                                                                              
109010****************************************************************              
109510* W O R K I N G        S T O R A G E.                                         
110010****************************************************************              
110510 WORKING-STORAGE SECTION.                                                     
111010****************************************************************              
111510* BANDERAS QUE SE PRENDEN SEGUN LAS CARACTERISTICAS DEL MOV.                  
112010****************************************************************              
112410 77  WS-BAN-B00      PIC 9   VALUE 0.                                         
112510 77  WS-BAN-B02      PIC 9   VALUE 0.                                         
113010 77  WS-BAN-B28      PIC 9   VALUE 0.                                         
113510 77  WS-BAN-B29      PIC 9   VALUE 0.                                         
114010 77  WS-BAN-B30      PIC 9   VALUE 0.                                         
114510 77  WS-BAN-B31      PIC 9   VALUE 0.                                         
115010 77  WS-BAN-B32      PIC 9   VALUE 0.                                         
115510 77  WS-BAN-B33      PIC 9   VALUE 0.                                         
116010 77  WS-BAN-B34      PIC 9   VALUE 0.                                         
116510                                                                              
117010 77  WS-BAN-BEGIN    PIC 9   VALUE 0.                                         
117510****************************************************************              
118010* VARIABLE UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                   
118510* ACCESO A LA BASE DE DATOS Y LIBRERIAS.                                      
119010****************************************************************              
119510 COPY "S500/INC/WOR/25MTP002".                                                
119512                                                                              
119520                                                                              
120010 COPY "S500/INC/WOR/DAS/25MTP005".                                            
120110                                                                              
120510                                                                              
121010****************************************************************              
121510* CAMPO UTILIZADO PARA MANEJAR EL REGISTRO COMPLETO DE B28.                   
122010****************************************************************              
122510  01 WS-BONI-AREA.                                                            
123010       03 WS-B28-NUM-CONTRATO PIC 9(12)    COMP.                              
123510       03 WS-B28-CVE-ACUMULA  PIC 9(04)    COMP.                              
124010       03 WS-B28-IMP-COBRADO  PIC 9(08)V99 COMP.                              
124510       03 WS-B28-IVA-COBRADO  PIC 9(08)V99 COMP.                              
125010       03 WS-B28-IMP-BONIF    PIC 9(08)V99 COMP.                              
125510       03 WS-B28-IVA-BONIF    PIC 9(08)V99 COMP.                              
126010       03 WS-B28-FILLER       PIC 9(04)    COMP.                              
126510                                                                              
127010****************************************************************              
127510* TABLA DONDE SE GUARDARAN LOS VALORES DE TOTALES POR CLAVE USADOS            
128010****************************************************************              
128510 01 WS-GUARDO-CVES.                                                           
129010    02 WS-GUARDO-TOTXCVES OCCURS 9999.                                        
129510      03 WS-B17-CVEACUM-C         PIC 9(04) COMP.                             
130010      03 WS-B17-TPOACUM-C         PIC 9(01) COMP.                             
130510      03 WS-B17-TPO-MOV           PIC 9(01) COMP.                             
131010                                                                              
131510****************************************************************              
132010* VARIABLES UTILIZADAS PARA CAPTURAR LAS FECHAS.                              
132510* FORMATO AAMMDD.                                                             
133010****************************************************************              
133510 01 WS-FECHA-DIA        PIC 9(08).                                            
134010 01 WS-FECHA-DIA-AMD REDEFINES WS-FECHA-DIA.                                  
134510    05 WS-DIA-AA        PIC 9(04).                                            
135010    05 WS-DIA-MM        PIC 9(02).                                            
135510    05 WS-DIA-DD        PIC 9(02).                                            
136010                                                                              
136510 01 WS-FECHA-PASO                       PIC 9(08).                            
137010 01 WS-PASO-AMD REDEFINES WS-FECHA-PASO.                                      
137510    02 WS-PASO-AA                       PIC 9(04).                            
138010    02 WS-PASO-MM                       PIC 9(02).                            
138510    02 WS-PASO-DD                       PIC 9(02).                            
139010                                                                              
139510 01 WS-FECHA-MOV           PIC 9(08).                                         
140010 01 WS-FECHA-MOV-AMD REDEFINES WS-FECHA-MOV.                                  
140510    02 WS-FECHA-AA         PIC 9(04).                                         
141010    02 WS-FECHA-MM         PIC 9(02).                                         
141510    02 WS-FECHA-DD         PIC 9(02).                                         
142010                                                                              
142510***************************************************************               
143010* VARIABLE UTILIZADA PARA CAPTURAR LA HORA.                                   
143510***************************************************************               
144010 01 WS-HORA-HMSC-01.                                                          
144510    03 WS-HORA-HMSC-N           PIC 9(8).                                     
145010    03 WS-HORA-HMSC REDEFINES   WS-HORA-HMSC-N.                               
145510       05 WS-HORA-HMS-N         PIC 9(6).                                     
146010       05 WS-HORA-HMS REDEFINES WS-HORA-HMS-N.                                
146510          07 WS-HORA-HH-N       PIC 9(2).                                     
147010          07 WS-HORA-MM-N       PIC 9(2).                                     
147510          07 WS-HORA-SS-N       PIC 9(2).                                     
148010       05 FILLER                PIC X(2).                                     
148510                                                                              
149010****************************************************************              
149510* CAMPOS UTILIZADOS DENTRO DEL PROGRAMA.                                      
150010****************************************************************              
150510 77 WS-SORT-ESPACIO             PIC 9(12).                                    
151010 77 WS-AREA-ESPACIO             PIC 9(12).                                    
151510 77 WS-CTOTODO                  PIC 9(08) VALUE 0.                            
152010 77 WS-LASTRECORD               PIC 9(10).                                    
152510 77 WS-NUM-BEGIN                PIC 9(04).                                    
153010 77 WS-NUM-EST                  PIC 9.                                        
153510 77 WS-CTO-ANT                  PIC 9(12).                                    
154010 77 WS-CVE-ANT                  PIC 9(04).                                    
154020 77 WS-SUM-IMP-COBRADO          PIC 9(08)V99 COMP.                            
154030 77 WS-SUM-IVA-COBRADO          PIC 9(08)V99 COMP.                            
154040 77 WS-SIHAY                    PIC 9.                                        
154510 77 WS-1VEZ                     PIC 9.                                        
155010 77 WS-2VEZ                     PIC 9.                                        
155510 77 WS-3VEZ                     PIC 9.                                        
156010 77 WS-4VEZ                     PIC 9.                                        
156510 77 WS-5VEZ                     PIC 9.                                        
157010 77 WS-6VEZ                     PIC 9.                                        
157510 77 WS-7VEZ                     PIC 9.                                        
158010 77 WS-8VEZ                     PIC 9.                                        
158510 77 WS-9VEZ                     PIC 9.                                        
159010 77 WS-10VEZ                    PIC 9.                                        
159510 77 WS-11VEZ                    PIC 9.                                        
160010 77 WS-12VEZ                    PIC 9(02).                                    
160510 77 WS-13VEZ                    PIC 9.                                        
161010 77 WS-14VEZ                    PIC 9.                                        
161510 77 WS-15VEZ                    PIC 9(02).                                    
162010 77 WS-IND                      PIC 9(04).                                    
162510 77 WS-IND1                     PIC 9(04).                                    
163010 77 WS-IND2                     PIC 9(04).                                    
163510 77 WS-IND3                     PIC 9(04).                                    
164010 77 WS-IND4                     PIC 9(04).                                    
164510 77 WS-IND5                     PIC 9(04).                                    
165010 77 WS-IND6                     PIC 9(04).                                    
165510****************************************************************              
166010* VARIABLE QUE UTILIZO PARA ACCESAR LA TABLA.                                 
166510* Y PARA ACCESAT LOS DATASET DE LA BASE COMUNES.                              
167010****************************************************************              
167510****************************************************************              
168010*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOL1 COPIA 1.                      
168510****************************************************************              
169010 01 WS-ETIQ-PUNTEOL1.                                                         
169510   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PLINEA/".            
170010   02 WS-PUNTEOL1-CSIO   PIC 99.                                              
170510   02 FILLER             PIC X     VALUE "/".                                 
171010   02 WS-PUNTEOL1-FEC    PIC 9(06).                                           
171020   02 WS-PUNTEOL1-COP    PIC X(03) VALUE "/01".                               
171510   02 FILLER             PIC X     VALUE ".".                                 
172010                                                                              
172020****************************************************************              
172030*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOL2 COPIA 2.                      
172040****************************************************************              
172050 01 WS-ETIQ-PUNTEOL2.                                                         
172060   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PLINEA/".            
172070   02 WS-PUNTEOL2-CSIO   PIC 99.                                              
172080   02 FILLER             PIC X     VALUE "/".                                 
172090   02 WS-PUNTEOL2-FEC    PIC 9(06).                                           
172100   02 WS-PUNTEOL2-COP    PIC X(03) VALUE "/02".                               
172110   02 FILLER             PIC X     VALUE ".".                                 
172120                                                                              
172130*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PLINEA (P105)   -YCY            
172140****************************************************************              
172150*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOL3 COPIA 3.                      
172160****************************************************************              
172170 01 WS-ETIQ-PUNTEOL3.                                                         
172180   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PLINEA/".            
172190   02 WS-PUNTEOL3-CSIO   PIC 99.                                              
172200   02 FILLER             PIC X     VALUE "/".                                 
172210   02 WS-PUNTEOL3-FEC    PIC 9(06).                                           
172220   02 WS-PUNTEOL3-COP    PIC X(03) VALUE "/03".                               
172230   02 FILLER             PIC X     VALUE ".".                                 
172240                                                                              
172510****************************************************************              
173010*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOB1 COPIA 1.                      
173510****************************************************************              
174010 01 WS-ETIQ-PUNTEOB1.                                                         
174510   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PBATCH/".            
175010   02 WS-PUNTEOB1-CSIO   PIC 99.                                              
175510   02 FILLER             PIC X     VALUE "/".                                 
176010   02 WS-PUNTEOB1-FEC    PIC 9(06).                                           
176020   02 WS-PUNTEOB1-COP    PIC X(03) VALUE "/01".                               
176510   02 FILLER             PIC X     VALUE ".".                                 
176520                                                                              
176530*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PBATCH (P130)   -YCY            
176540****************************************************************              
176550*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOB3 COPIA 3.                      
176560****************************************************************              
176570 01 WS-ETIQ-PUNTEOB2.                                                         
176580   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PBATCH/".            
176590   02 WS-PUNTEOB2-CSIO   PIC 99.                                              
176600   02 FILLER             PIC X     VALUE "/".                                 
176610   02 WS-PUNTEOB2-FEC    PIC 9(06).                                           
176620   02 WS-PUNTEOB2-COP    PIC X(03) VALUE "/02".                               
176630   02 FILLER             PIC X     VALUE ".".                                 
177010                                                                              
177020****************************************************************              
177030*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEOB2 COPIA 2.                      
177040****************************************************************              
177050 01 WS-ETIQ-PUNTEOB3.                                                         
177060   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PBATCH/".            
177070   02 WS-PUNTEOB3-CSIO   PIC 99.                                              
177080   02 FILLER             PIC X     VALUE "/".                                 
177090   02 WS-PUNTEOB3-FEC    PIC 9(06).                                           
177100   02 WS-PUNTEOB3-COP    PIC X(03) VALUE "/03".                               
177110   02 FILLER             PIC X     VALUE ".".                                 
177120                                                                              
177510****************************************************************              
178010*   ETIQUETA DEL NOMBRE DEL ARCHIVO DE PUNTEO FUSIONADO.                      
178510****************************************************************              
179010 01 WS-ETIQ-PUNTEOT.                                                          
179510   02 FILLER             PIC X(22) VALUE "S500/FILE/S500/PTOTAL/".            
180010   02 WS-PUNTEOT-CSIO    PIC 99.                                              
180510   02 FILLER             PIC X     VALUE "/".                                 
181010   02 WS-PUNTEOT-FEC     PIC 9(06).                                           
181510   02 FILLER             PIC X     VALUE ".".                                 
182010                                                                              
182510******************************************************************            
183010* P R O C E D U R E         D I V I S I O N.                                  
183510****************************************************************              
184010 PROCEDURE DIVISION.                                                          
184510**********                                                                    
185010                                                                              
185510****************************************************************              
186010****************************************************************              
186510*          R U T I N A               P R I N C I P A L.                       
187010****************************************************************              
187510****************************************************************              
188010                                                                              
188510 00000000-INICIO SECTION.                                                     
189010 00000000-PRINCIPAL.                                                          
189060                                                                              
189110     MOVE 2                TO W77-USO-LIBLJ.                                  
189160     MOVE "S500P178"       TO W77-S000-MY-ID.                                 
189210     MOVE "25MTP004"       TO W77-S000-MY-VERSION.                            
189260     MOVE "P178"           TO WS-0101-PASO-MSG B91-IDPROG.                    
189310     MOVE "25MTP004"       TO WS-0101-MTP-MSG.                                
189360                                                                              
189510     PERFORM 10000000-LIBRERIAS THRU 10000000-EXIT.                           
190010     PERFORM 20000000-OPEN      THRU 20000000-EXIT.                           
190510     PERFORM 50000000-LEO-MOV   THRU 50000000-EXIT.                           
191010     PERFORM 70000000-CIERRO    THRU 70000000-EXIT.                           
191510     STOP RUN.                                                                
192010                                                                              
192510                                                                              
193010                                                                              
193510                                                                              
194010                                                                              
194510****************************************************************              
195010****************************************************************              
195510*                                                                             
196010*     R U T I N A   D E    L L A M A D O   A   L A S                          
196510*  L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S                
197010*               P O R   E L   P R O G R A M A.                                
197510*                                                                             
198010****************************************************************              
198510****************************************************************              
199010                                                                              
199510 10000000-LIBRERIAS.                                                          
200010                                                                              
200510****************************************************************              
201010* CHANGE A LA LIBRARIA DE VERSIONES.                                          
201510****************************************************************              
202010    PERFORM 10000100-VERSIONES.                                               
202510                                                                              
203010 10000000-EXIT.                                                               
203510   EXIT.                                                                      
204010                                                                              
204510                                                                              
205010*****************************************************************             
205510*****************************************************************             
206010*                                                                             
206510*                         O P E N.                                            
207010*      R U T I N A S    P A R A   A P E R T U R A   D E                       
207510*                B A S E   Y   A R C H I V O S.                               
208010*                                                                             
208510*****************************************************************             
209010******************************************************************            
209510                                                                              
210010 20000000-OPEN.                                                               
212010                                                                              
212510     PERFORM 20000050-CHECO-VER THRU 20000050-EXIT.                           
213010     PERFORM 20000100-ABRO-BASE THRU 20000100-EXIT.                           
213510     PERFORM 20000200-FECHA-PRO THRU 20000200-EXIT.                           
214010     PERFORM 20000500-VAL-PASO  THRU 20000500-EXIT.                           
214510     PERFORM 20000600-OPEN-ARC  THRU 20000600-EXIT.                           
215010     PERFORM 20000700-CARGO-B17 THRU 20000700-EXIT.                           
215510 20000000-EXIT.                                                               
216010   EXIT.                                                                      
216510                                                                              
217010******************************************************************            
217510* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
218010******************************************************************            
218510 20000050-CHECO-VER.                                                          
219010     PERFORM 20000100-CHECAME-VERSION.                                        
219510     IF S000-CTR-CVEERROR < 0                                                 
221010        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
221510        PERFORM 70000050-MENSAJE                                              
222010        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
222510 20000050-EXIT.                                                               
223010    EXIT.                                                                     
223510                                                                              
224010******************************************************************            
224510* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
225010******************************************************************            
225510 20000100-ABRO-BASE.                                                          
226010     OPEN UPDATE S500BD01CAPTACION                                            
226510     ON EXCEPTION                                                             
228010     MOVE "ERROR AL ABRIR LA BASE  " TO WS-0101-TEXT-MSG                      
228510     PERFORM 70000050-MENSAJE                                                 
229010     CALL SYSTEM DMTERMINATE.                                                 
229510                                                                              
229610    SET S500B00CTRLPASO       TO BEGINNING.                                   
230010    SET S500B02CONTROL        TO BEGINNING.                                   
230510    SET S500B17CVESXFUN       TO BEGINNING.                                   
231010    SET S500B28COMICOB        TO BEGINNING.                                   
231510    SET S500B29COMICOB        TO BEGINNING.                                   
232010    SET S500B30COMICOB        TO BEGINNING.                                   
232510    SET S500B31COMICOB        TO BEGINNING.                                   
233010    SET S500B32COMICOB        TO BEGINNING.                                   
233510    SET S500B33COMICOB        TO BEGINNING.                                   
234010    SET S500B34COMICOB        TO BEGINNING.                                   
234510 20000100-EXIT.                                                               
235010    EXIT.                                                                     
235510                                                                              
236010******************************************************************            
236510* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
237010******************************************************************            
237510 20000200-FECHA-PRO.                                                          
238010   PERFORM 90000002-B02CONTROL-FIND                                           
238510   IF WS-STATUS-BASE > 0                                                      
239010      IF WS-STATUS-BASE = 1                                                   
240510        MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG            
241010        PERFORM 70000050-MENSAJE                                              
241510        CALL SYSTEM DMTERMINATE                                               
242010      ELSE                                                                    
243510        STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                   
244010        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
244510        PERFORM 70000050-MENSAJE                                              
245010        CALL SYSTEM DMTERMINATE.                                              
245510                                                                              
246010     MOVE B02-FECHA-LOTE  TO WS-FECHA-MOV                                     
246510                  WS-PUNTEOL1-FEC WS-PUNTEOL2-FEC WS-PUNTEOL3-FEC             
247010                  WS-PUNTEOB1-FEC WS-PUNTEOB2-FEC WS-PUNTEOB3-FEC             
247015                  WS-PUNTEOT-FEC.                                             
247020                                                                              
247510                                                                              
248010     MOVE B02-NUM-CSI  TO                                                     
248510               WS-PUNTEOL1-CSIO WS-PUNTEOL2-CSIO WS-PUNTEOL3-CSIO             
248515               WS-PUNTEOB1-CSIO WS-PUNTEOB2-CSIO WS-PUNTEOB3-CSIO             
248520               WS-PUNTEOT-CSIO.                                               
249010                                                                              
249510 20000200-EXIT.                                                               
250010    EXIT.                                                                     
250510                                                                              
251010******************************************************************            
251510* VALIDA SI LA BASE ES SALIDA DEL P170    Y ACTUALIZA EL PASO CON             
252010* 0, PARA EVITAR QUE VUELVA A SER CORRIDO DICHO PASO EN CASO DE               
252510* HABER FALLADO POR ALGUN ERROR.                                              
253010******************************************************************            
253510 20000500-VAL-PASO.                                                           
253520   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
253530   IF WS-STATUS-BASE > 0                                                      
253540     IF WS-STATUS-BASE = 1                                                    
253570       MOVE "ERROR B00CTRLPASO     VACIO    " TO WS-0101-TEXT-MSG             
253580       PERFORM 70000050-MENSAJE                                               
253590       CALL SYSTEM DMTERMINATE                                                
253600     ELSE                                                                     
253630       STRING "ERROR AL HACER LOCK A B00CTRLPASO " ,WS-STATUS-BASE            
253640       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
253650       PERFORM 70000050-MENSAJE                                               
253660       CALL SYSTEM DMTERMINATE.                                               
253670*R4-COPIAS-2011 AGREGA MANEJO DEL 3er CAMPO DE CONTROL DE B00 -YCY            
253680    IF B00-NUM-PASO-01 = 170 AND B00-NUM-PASO-02 = 170                        
253685       AND B00-NUM-PASO-03 = 170                                              
253690      MOVE 0  TO                B00-NUM-PASO-01 B00-NUM-PASO-02               
253695                                B00-NUM-PASO-03                               
253700    ELSE                                                                      
253730      MOVE "ERROR BASE NO ES SALIDA DEL P170" TO WS-0101-TEXT-MSG             
253780      PERFORM 70000050-MENSAJE                                                
253790      CALL SYSTEM DMTERMINATE.                                                
258010                                                                              
259010    PERFORM 90000000-BEGIN-TRANSACTION.                                       
259510    PERFORM 90000000-B00CTRLPASO-STORE.                                       
260010    PERFORM 90000000-END-TRANSACTIONSYNC.                                     
260510 20000500-EXIT.                                                               
261010    EXIT.                                                                     
261510                                                                              
262010******************************************************************            
262510* ABRO LOS ARCHIVOS DE PUNTEO.                                                
263010******************************************************************            
263510 20000600-OPEN-ARC.                                                           
264010       OPEN OUTPUT PUNTEOT.                                                   
264510       OPEN INPUT  PUNTEOL1 PUNTEOL2 PUNTEOL3                                 
264515                   PUNTEOB1 PUNTEOB2 PUNTEOB3.                                
265010 20000600-EXIT.                                                               
265510     EXIT.                                                                    
266010                                                                              
266510****************************************************************              
267010* CARGO EL DATASET B17 EN MEMORIA.                                            
267510****************************************************************              
268010 20000700-CARGO-B17.                                                          
268510    PERFORM 20000800-LEO-B17 THRU 20000800-EXIT UNTIL                         
269010    WS-5VEZ = 1.                                                              
269510 20000700-EXIT.                                                               
270010     EXIT.                                                                    
270510                                                                              
271010****************************************************************              
271510* LEO B17 Y LO CARGO EN MEMORIA.                                              
272010****************************************************************              
272510 20000800-LEO-B17.                                                            
273010   PERFORM 90000017-B17CVESXFUN-FINDN                                         
273510   IF WS-STATUS-BASE > 0                                                      
274010      IF WS-STATUS-BASE = 1                                                   
274510           MOVE 1                        TO WS-5VEZ                           
275010      ELSE                                                                    
276510        STRING "ERROR AL HACER FINDN A B17 ",WS-STATUS-BASE                   
277010        DELIMITED BY SIZE INTO                    WS-0101-TEXT-MSG            
277510        PERFORM 70000050-MENSAJE                                              
278010        CALL SYSTEM DMTERMINATE.                                              
278510                                                                              
279010    IF WS-5VEZ = 0                                                            
279510     PERFORM 20000900-VAL-B17           THRU 20000900-EXIT.                   
280010 20000800-EXIT.                                                               
280510    EXIT.                                                                     
281010                                                                              
281510****************************************************************              
282010* CHECO LOS CALORES DE B17 PARA VER SI CUMPLEN CON LAS CONDICIONES            
282510* NECESARIAS PARA SER GRABADOS EN LA BASE.                                    
283010****************************************************************              
283510 20000900-VAL-B17.                                                            
284010   IF ( B17-CLAVE-TRANS      > 0) AND                                         
284510      ( B17-TIPO-MOV         = 1) AND                                         
285010      ( B17-CVE-ACUM-COMI    > 0) AND                                         
285510      ( B17-TPO-ACUM-COMI    > 0) AND                                         
286010      ( B17-TPO-ACUM-COMI    < 3)                                             
286510      MOVE B17-CLAVE-TRANS     TO WS-IND                                      
287010      MOVE B17-CVE-ACUM-COMI   TO WS-B17-CVEACUM-C(WS-IND)                    
287510      MOVE B17-TPO-ACUM-COMI   TO WS-B17-TPOACUM-C(WS-IND)                    
288010      MOVE B17-TIPO-MOV        TO WS-B17-TPO-MOV(WS-IND).                     
288510 20000900-EXIT.                                                               
289010    EXIT.                                                                     
289510                                                                              
290010                                                                              
290510                                                                              
291010****************************************************************              
291510****************************************************************              
292010* R U T I N A S     D E   A P L I C A C I O N     D E   L O S                 
292510*                    M O V I M I E N T O S.                                   
293010****************************************************************              
293510****************************************************************              
294010                                                                              
294510                                                                              
295010                                                                              
295510                                                                              
296010****************************************************************              
296510****************************************************************              
297010* PROCESO LOS ARCHIVOS DE PUNTEO Y GENERO UNO NUEVO CON LAS                   
297510* BONIFICACIONES.                                                             
298010****************************************************************              
298510****************************************************************              
299010 50000000-LEO-MOV.                                                            
299510     PERFORM 50001000-LEO-PLINEA1  THRU 50001000-EXIT.                        
299520     PERFORM 50001500-LEO-PLINEA2  THRU 50001500-EXIT.                        
299530     PERFORM 50001800-LEO-PLINEA3  THRU 50001800-EXIT.                        
300010     PERFORM 50002000-LEO-PBATCH1  THRU 50002000-EXIT.                        
300020     PERFORM 50002500-LEO-PBATCH2  THRU 50002500-EXIT.                        
300030     PERFORM 50002800-LEO-PBATCH3  THRU 50002800-EXIT.                        
300510     PERFORM 50003000-SORT-PTOTAL  THRU 50003000-EXIT.                        
301010     PERFORM 50004000-LEO-EST      THRU 50004000-EXIT.                        
301510     PERFORM 50005000-LEO-SORT     THRU 50005000-EXIT UNTIL                   
302010     WS-3VEZ = 1.                                                             
302510 50000000-EXIT.                                                               
303010     EXIT.                                                                    
303510                                                                              
304010***************************************************************               
304510* LEO EL ARCHIVO PLINEA COPIA 1.                                              
305010***************************************************************               
305510 50001000-LEO-PLINEA1.                                                        
306010   PERFORM 50001100-VAL-HEA        THRU 50001100-EXIT.                        
306510   PERFORM 50001200-VAL-DET        THRU 50001200-EXIT UNTIL                   
307010   WS-1VEZ = 1.                                                               
307510 50001000-EXIT.                                                               
308010    EXIT.                                                                     
308510                                                                              
309010****************************************************************              
309510* LEO EL HEADER DEL ARCHIVO PLINEA COPIA 1.                                   
310010****************************************************************              
310510 50001100-VAL-HEA.                                                            
311010     READ PUNTEOL1  AT END                                                    
312510        MOVE  "ERROR ARCHIVO PLINEA  VACIO" TO WS-0101-TEXT-MSG               
313010        PERFORM 70000050-MENSAJE                                              
313510        CALL SYSTEM DMTERMINATE.                                              
314010                                                                              
314510     IF WS-HEAL1-FECHA = WS-FECHA-MOV                                         
315010        NEXT SENTENCE                                                         
315510     ELSE                                                                     
317010        MOVE  "FECEXT.E INT ARC.PLINEA DIF" TO WS-0101-TEXT-MSG               
317510        PERFORM 70000050-MENSAJE                                              
318010        CALL SYSTEM DMTERMINATE.                                              
318510 50001100-EXIT.                                                               
319010    EXIT.                                                                     
319510                                                                              
320010***************************************************************               
320510* LEO EL DETALLE DEL ARCHIVO PLINEA COPIA 1.                                  
321010***************************************************************               
321510 50001200-VAL-DET.                                                            
322010     READ PUNTEOL1  AT END                                                    
322510        MOVE 1                              TO WS-1VEZ.                       
323010                                                                              
323510     IF WS-1VEZ = 0                                                           
324010        IF WS-HEAL1-TREG = 99                                                 
324510          NEXT SENTENCE                                                       
325010        ELSE                                                                  
325510          PERFORM 50001210-VAL-CVE         THRU 50001210-EXIT.                
326010 50001200-EXIT.                                                               
326510    EXIT.                                                                     
327010                                                                              
327510****************************************************************              
328010* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
328510* VALIDADAS SI SON BONIFICACIONES.                                            
329010***************************************************************               
329510 50001210-VAL-CVE.                                                            
330010   IF ((WS-DETL1-CVE > 1999) AND (WS-DETL1-CVE < 3000)) OR                    
330510      ((WS-DETL1-CVE > 3999) AND (WS-DETL1-CVE < 5000))                       
331010      MOVE WS-DETL1-CVE                 TO WS-IND1                            
331510      MOVE WS-DETL1-CVE                 TO WS-MSG-CVE                         
332010      PERFORM 50001230-CHECO-B17      THRU 50001230-EXIT.                     
332510 50001210-EXIT.                                                               
333010    EXIT.                                                                     
333510                                                                              
334010****************************************************************              
334510* VERIFICO SI LA CLAVE BUSCADA EN LA TABLA SE ENCUENTRA CON LAS               
335010* BANDERAS PRENDIDAS QUE INDICAN QUE SE TRATA DE UNA CLAVE DE                 
335510* UNA CLAVE DE CARGO Y A LA VEZ UNA COMISION.                                 
336010***************************************************************               
336510 50001230-CHECO-B17.                                                          
337010   IF WS-B17-CVEACUM-C(WS-IND1) > 0                                           
337510      PERFORM 50001240-LLENO-ARCPLINEA     THRU 50001240-EXIT.                
338010 50001230-EXIT.                                                               
338510    EXIT.                                                                     
339010                                                                              
339510****************************************************************              
340010* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
340510* EL ARCHIVO DE PUNTEO TOTAL.                                                 
341010*****************************************************************             
341510 50001240-LLENO-ARCPLINEA.                                                    
342010    MOVE SPACES                        TO REG-PUNTEOT                         
342510    MOVE WS-B17-CVEACUM-C(WS-IND1)     TO WS-DETPT-CLAVE                      
343010    MOVE WS-B17-TPOACUM-C(WS-IND1)     TO WS-DETPT-TIPO-IMP                   
343510    MOVE WS-DETL1-NUMCTO               TO WS-DETPT-NUMCTO                     
344010    MOVE WS-DETL1-IMP                  TO WS-DETPT-IMP                        
344510    PERFORM 50001250-GRABO-ARC         THRU 50001250-EXIT.                    
345010 50001240-EXIT.                                                               
345510    EXIT.                                                                     
346010                                                                              
346510****************************************************************              
347010* GRABO EL ARCHIVO DE PUNTEO TOTAL.                                           
347510****************************************************************              
348010 50001250-GRABO-ARC.                                                          
348510   WRITE REG-PUNTEOT INVALID KEY                                              
350010      MOVE "ERROR AL GRABAR ARC. PUNTEOT. " TO WS-0101-TEXT-MSG               
350510      PERFORM 70000050-MENSAJE.                                               
351010 50001250-EXIT.                                                               
351510    EXIT.                                                                     
352010                                                                              
352020***************************************************************               
352025* LEO EL ARCHIVO PLINEA COPIA 2.                                              
352030***************************************************************               
352035 50001500-LEO-PLINEA2.                                                        
352040   PERFORM 50001600-VAL-HEA        THRU 50001600-EXIT.                        
352045   PERFORM 50001700-VAL-DET        THRU 50001700-EXIT UNTIL                   
352050   WS-8VEZ = 1.                                                               
352055 50001500-EXIT.                                                               
352060    EXIT.                                                                     
352065                                                                              
352070****************************************************************              
352075* LEO EL HEADER DEL ARCHIVO PLINEA COPIA 2.                                   
352080****************************************************************              
352085 50001600-VAL-HEA.                                                            
352090     READ PUNTEOL2 AT END                                                     
352105        MOVE "ERROR ARCHIVO PLINEAC2 VACIO" TO WS-0101-TEXT-MSG               
352110        PERFORM 70000050-MENSAJE                                              
352115        CALL SYSTEM DMTERMINATE.                                              
352120                                                                              
352125     IF WS-HEAL2-FECHA = WS-FECHA-MOV                                         
352130        NEXT SENTENCE                                                         
352135     ELSE                                                                     
352150        MOVE "FECEXT.E INT ARCPLINEAC2 DIF" TO WS-0101-TEXT-MSG               
352155        PERFORM 70000050-MENSAJE                                              
352160        CALL SYSTEM DMTERMINATE.                                              
352165 50001600-EXIT.                                                               
352170    EXIT.                                                                     
352175                                                                              
352180***************************************************************               
352185* LEO EL DETALLE DEL ARCHIVO PLINEA COPIA 2.                                  
352190***************************************************************               
352195 50001700-VAL-DET.                                                            
352200     READ PUNTEOL2 AT END                                                     
352205        MOVE 1                              TO WS-8VEZ.                       
352210                                                                              
352215     IF WS-8VEZ = 0                                                           
352220        IF WS-HEAL2-TREG = 99                                                 
352225          NEXT SENTENCE                                                       
352230        ELSE                                                                  
352235          PERFORM 50001710-VAL-CVE         THRU 50001710-EXIT.                
352240 50001700-EXIT.                                                               
352245    EXIT.                                                                     
352250                                                                              
352255****************************************************************              
352260* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
352265* VALIDADAS SI SON BONIFICACIONES.                                            
352270***************************************************************               
352275 50001710-VAL-CVE.                                                            
352280   IF ((WS-DETL2-CVE > 1999) AND (WS-DETL2-CVE < 3000)) OR                    
352285      ((WS-DETL2-CVE > 3999) AND (WS-DETL2-CVE < 5000))                       
352290      MOVE WS-DETL2-CVE                TO WS-IND3                             
352295      MOVE WS-DETL2-CVE                TO WS-MSG-CVE                          
352300      PERFORM 50001730-CHECO-B17      THRU 50001730-EXIT.                     
352305 50001710-EXIT.                                                               
352310    EXIT.                                                                     
352315                                                                              
352320****************************************************************              
352325* VERIFICO SI LA CLAVE BUSCADA EN LA TABLA SE ENCUENTRA CON LAS               
352330* BANDERAS PRENDIDAS QUE INDICAN QUE SE TRATA DE UNA CLAVE DE                 
352335* UNA CLAVE DE CARGO Y A LA VEZ UNA COMISION.                                 
352340***************************************************************               
352345 50001730-CHECO-B17.                                                          
352350   IF WS-B17-CVEACUM-C(WS-IND3) > 0                                           
352355      PERFORM 50001740-LLENO-ARCPLINEA     THRU 50001740-EXIT.                
352360 50001730-EXIT.                                                               
352365    EXIT.                                                                     
352370                                                                              
352375****************************************************************              
352380* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
352385* EL ARCHIVO DE PUNTEO TOTAL.                                                 
352390*****************************************************************             
352395 50001740-LLENO-ARCPLINEA.                                                    
352400    MOVE SPACES                        TO REG-PUNTEOT                         
352405    MOVE WS-B17-CVEACUM-C(WS-IND3)     TO WS-DETPT-CLAVE                      
352410    MOVE WS-B17-TPOACUM-C(WS-IND3)     TO WS-DETPT-TIPO-IMP                   
352415    MOVE WS-DETL2-NUMCTO               TO WS-DETPT-NUMCTO                     
352420    MOVE WS-DETL2-IMP                  TO WS-DETPT-IMP                        
352425    PERFORM 50001250-GRABO-ARC         THRU 50001250-EXIT.                    
352430 50001740-EXIT.                                                               
352435    EXIT.                                                                     
352440                                                                              
352445*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PLINEA (P105)   -YCY            
352450***************************************************************               
352455* LEO EL ARCHIVO PLINEA COPIA 3.                                              
352460***************************************************************               
352465 50001800-LEO-PLINEA3.                                                        
352470   PERFORM 50001850-VAL-HEA        THRU 50001850-EXIT.                        
352475   PERFORM 50001900-VAL-DET        THRU 50001900-EXIT UNTIL                   
352480   WS-10VEZ = 1.                                                              
352485 50001800-EXIT.                                                               
352490    EXIT.                                                                     
352495                                                                              
352500****************************************************************              
352505* LEO EL HEADER DEL ARCHIVO PLINEA COPIA 3.                                   
352510****************************************************************              
352515 50001850-VAL-HEA.                                                            
352520     READ PUNTEOL3 AT END                                                     
352525        MOVE "ERROR ARCHIVO PLINEAC3 VACIO" TO WS-0101-TEXT-MSG               
352530        PERFORM 70000050-MENSAJE                                              
352535        CALL SYSTEM DMTERMINATE.                                              
352540                                                                              
352545     IF WS-HEAL3-FECHA = WS-FECHA-MOV                                         
352550        NEXT SENTENCE                                                         
352555     ELSE                                                                     
352560        MOVE "FECEXT.E INT ARCPLINEAC3 DIF" TO WS-0101-TEXT-MSG               
352565        PERFORM 70000050-MENSAJE                                              
352570        CALL SYSTEM DMTERMINATE.                                              
352575 50001850-EXIT.                                                               
352580    EXIT.                                                                     
352585                                                                              
352590***************************************************************               
352595* LEO EL DETALLE DEL ARCHIVO PLINEA COPIA 3.                                  
352600***************************************************************               
352605 50001900-VAL-DET.                                                            
352610     READ PUNTEOL3 AT END                                                     
352615        MOVE 1                              TO WS-10VEZ.                      
352620                                                                              
352625     IF WS-10VEZ = 0                                                          
352630        IF WS-HEAL3-TREG = 99                                                 
352635          NEXT SENTENCE                                                       
352640        ELSE                                                                  
352645          PERFORM 50001910-VAL-CVE         THRU 50001910-EXIT.                
352650 50001900-EXIT.                                                               
352655    EXIT.                                                                     
352660                                                                              
352665****************************************************************              
352670* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
352675* VALIDADAS SI SON BONIFICACIONES.                                            
352680***************************************************************               
352685 50001910-VAL-CVE.                                                            
352690   IF ((WS-DETL3-CVE > 1999) AND (WS-DETL3-CVE < 3000)) OR                    
352695      ((WS-DETL3-CVE > 3999) AND (WS-DETL3-CVE < 5000))                       
352700      MOVE WS-DETL3-CVE                TO WS-IND5                             
352705      MOVE WS-DETL3-CVE                TO WS-MSG-CVE                          
352710      PERFORM 50001930-CHECO-B17      THRU 50001930-EXIT.                     
352715 50001910-EXIT.                                                               
352720    EXIT.                                                                     
352725                                                                              
352730****************************************************************              
352735* VERIFICO SI LA CLAVE BUSCADA EN LA TABLA SE ENCUENTRA CON LAS               
352740* BANDERAS PRENDIDAS QUE INDICAN QUE SE TRATA DE UNA CLAVE DE                 
352745* UNA CLAVE DE CARGO Y A LA VEZ UNA COMISION.                                 
352750***************************************************************               
352755 50001930-CHECO-B17.                                                          
352760   IF WS-B17-CVEACUM-C(WS-IND5) > 0                                           
352765      PERFORM 50001940-LLENO-ARCPLINEA     THRU 50001940-EXIT.                
352770 50001930-EXIT.                                                               
352775    EXIT.                                                                     
352780                                                                              
352785****************************************************************              
352790* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
352795* EL ARCHIVO DE PUNTEO TOTAL.                                                 
352800****************************************************************              
352805 50001940-LLENO-ARCPLINEA.                                                    
352810    MOVE SPACES                        TO REG-PUNTEOT                         
352815    MOVE WS-B17-CVEACUM-C(WS-IND5)     TO WS-DETPT-CLAVE                      
352820    MOVE WS-B17-TPOACUM-C(WS-IND5)     TO WS-DETPT-TIPO-IMP                   
352825    MOVE WS-DETL3-NUMCTO               TO WS-DETPT-NUMCTO                     
352830    MOVE WS-DETL3-IMP                  TO WS-DETPT-IMP                        
352835    PERFORM 50001250-GRABO-ARC         THRU 50001250-EXIT.                    
352840 50001940-EXIT.                                                               
352845    EXIT.                                                                     
352850                                                                              
353000***************************************************************               
353010* LEO EL ARCHIVO PBATCH COPIA 1.                                              
353510***************************************************************               
354010 50002000-LEO-PBATCH1.                                                        
354510   PERFORM 50002100-VAL-HEA        THRU 50002100-EXIT.                        
355010   PERFORM 50002200-VAL-DET        THRU 50002200-EXIT UNTIL                   
355510   WS-2VEZ = 1.                                                               
356010 50002000-EXIT.                                                               
356510    EXIT.                                                                     
357010                                                                              
357510****************************************************************              
358010* LEO EL HEADER DEL ARCHIVO PBATCH COPIA 1.                                   
358510****************************************************************              
359010 50002100-VAL-HEA.                                                            
359510     READ PUNTEOB1  AT END                                                    
361010        MOVE  "ERROR ARCHIVO PBATCH  VACIO" TO WS-0101-TEXT-MSG               
361510        PERFORM 70000050-MENSAJE                                              
362010        CALL SYSTEM DMTERMINATE.                                              
362510                                                                              
363010     IF WS-HEAB1-FECHA = WS-FECHA-MOV                                         
363510        NEXT SENTENCE                                                         
364010     ELSE                                                                     
365510        MOVE  "FECEXT.E INT ARC.PBATCH DIF" TO WS-0101-TEXT-MSG               
366010        PERFORM 70000050-MENSAJE                                              
366510        CALL SYSTEM DMTERMINATE.                                              
367010 50002100-EXIT.                                                               
367510    EXIT.                                                                     
368010                                                                              
368510***************************************************************               
369010* LEO EL DETALLE DEL ARCHIVO PBATCH COPIA 1.                                  
369510***************************************************************               
370010 50002200-VAL-DET.                                                            
370510     READ PUNTEOB1  AT END                                                    
371010        MOVE 1                              TO WS-2VEZ.                       
372010                                                                              
372510     IF WS-2VEZ = 0                                                           
373010        IF WS-HEAB1-TREG = 99                                                 
373510          NEXT SENTENCE                                                       
374010        ELSE                                                                  
374510          PERFORM 50002210-VAL-CVE         THRU 50002210-EXIT.                
375010 50002200-EXIT.                                                               
375510    EXIT.                                                                     
376010                                                                              
376510****************************************************************              
377010* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
377510* VALIDADAS SI SON BONIFICACIONES.                                            
378010***************************************************************               
378510 50002210-VAL-CVE.                                                            
379010   IF ((WS-DETB1-CVE > 1999) AND (WS-DETB1-CVE < 3000)) OR                    
379510      ((WS-DETB1-CVE > 3999) AND (WS-DETB1-CVE < 5000))                       
380010      MOVE WS-DETB1-CVE                TO WS-IND2                             
380510      MOVE WS-DETB1-CVE                TO WS-MSG-CVE                          
381010      PERFORM 50002230-VAL-B17        THRU 50002230-EXIT.                     
381510 50002210-EXIT.                                                               
382010    EXIT.                                                                     
382510                                                                              
383010******************************************************************            
383510* VERIFICO SI B17 TIENE ENCENDIDOS LOS CAMPOS QUE ME INDICAN QUE              
384010* SE TRATA DE UNA CLAVE DE CARGO Y ES UNA BONIFICACION.                       
384510***************************************************************               
385010 50002230-VAL-B17.                                                            
385510   IF WS-B17-CVEACUM-C(WS-IND2) > 0                                           
386010      PERFORM 50002240-LLENO-ARCPLINEA     THRU 50002240-EXIT.                
386510 50002230-EXIT.                                                               
387010    EXIT.                                                                     
387510                                                                              
388010******************************************************************            
388510* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
389010* EL ARCHIVO DE PUNTEO TOTAL.                                                 
389510*****************************************************************             
390010 50002240-LLENO-ARCPLINEA.                                                    
390510    MOVE SPACES                       TO REG-PUNTEOT                          
391010    MOVE WS-B17-CVEACUM-C(WS-IND2)    TO WS-DETPT-CLAVE                       
391510    MOVE WS-B17-TPOACUM-C(WS-IND2)    TO WS-DETPT-TIPO-IMP                    
392010    MOVE WS-DETB1-NUMCTO              TO WS-DETPT-NUMCTO                      
392510    MOVE WS-DETB1-IMP                 TO WS-DETPT-IMP                         
393010    PERFORM 50001250-GRABO-ARC    THRU 50001250-EXIT.                         
393510 50002240-EXIT.                                                               
394010    EXIT.                                                                     
394510                                                                              
394520***************************************************************               
394525* LEO EL ARCHIVO PBATCH COPIA 2.                                              
394530***************************************************************               
394535 50002500-LEO-PBATCH2.                                                        
394540   PERFORM 50002600-VAL-HEA        THRU 50002600-EXIT.                        
394545   PERFORM 50002700-VAL-DET        THRU 50002700-EXIT UNTIL                   
394550   WS-9VEZ = 1.                                                               
394555 50002500-EXIT.                                                               
394560    EXIT.                                                                     
394565                                                                              
394570****************************************************************              
394575* LEO EL HEADER DEL ARCHIVO PBATCH COPIA 2.                                   
394580****************************************************************              
394585 50002600-VAL-HEA.                                                            
394590     READ PUNTEOB2 AT END                                                     
394605        MOVE "ERROR ARCHIVO PBATCHC2 VACIO" TO WS-0101-TEXT-MSG               
394610        PERFORM 70000050-MENSAJE                                              
394615        CALL SYSTEM DMTERMINATE.                                              
394620                                                                              
394625     IF WS-HEAB2-FECHA = WS-FECHA-MOV                                         
394630        NEXT SENTENCE                                                         
394635     ELSE                                                                     
394650        MOVE "FECEXT.E INT ARCPBATCHC2 DIF" TO WS-0101-TEXT-MSG               
394655        PERFORM 70000050-MENSAJE                                              
394660        CALL SYSTEM DMTERMINATE.                                              
394665 50002600-EXIT.                                                               
394670    EXIT.                                                                     
394675                                                                              
394680***************************************************************               
394685* LEO EL DETALLE DEL ARCHIVO PBATCH COPIA 2.                                  
394690***************************************************************               
394695 50002700-VAL-DET.                                                            
394700     READ PUNTEOB2 AT END                                                     
394705        MOVE 1                              TO WS-9VEZ.                       
394710*       CLOSE PUNTEOT                       WITH SAVE.                        
394715                                                                              
394720     IF WS-9VEZ = 0                                                           
394725        IF WS-HEAB2-TREG = 99                                                 
394730          NEXT SENTENCE                                                       
394735        ELSE                                                                  
394740          PERFORM 50002710-VAL-CVE         THRU 50002710-EXIT.                
394745 50002700-EXIT.                                                               
394750    EXIT.                                                                     
394755                                                                              
394760****************************************************************              
394765* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
394770* VALIDADAS SI SON BONIFICACIONES.                                            
394775***************************************************************               
394780 50002710-VAL-CVE.                                                            
394785   IF ((WS-DETB2-CVE > 1999) AND (WS-DETB2-CVE < 3000)) OR                    
394790      ((WS-DETB2-CVE > 3999) AND (WS-DETB2-CVE < 5000))                       
394795      MOVE WS-DETB2-CVE                TO WS-IND4                             
394800      MOVE WS-DETB2-CVE                TO WS-MSG-CVE                          
394805      PERFORM 50002730-VAL-B17        THRU 50002730-EXIT.                     
394810 50002710-EXIT.                                                               
394815    EXIT.                                                                     
394820                                                                              
394825******************************************************************            
394830* VERIFICO SI B17 TIENE ENCENDIDOS LOS CAMPOS QUE ME INDICAN QUE              
394835* SE TRATA DE UNA CLAVE DE CARGO Y ES UNA BONIFICACION.                       
394840***************************************************************               
394845 50002730-VAL-B17.                                                            
394850   IF WS-B17-CVEACUM-C(WS-IND4) > 0                                           
394855      PERFORM 50002740-LLENO-ARCPLINEA     THRU 50002740-EXIT.                
394860 50002730-EXIT.                                                               
394865    EXIT.                                                                     
394870                                                                              
394875******************************************************************            
394880* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
394885* EL ARCHIVO DE PUNTEO TOTAL.                                                 
394890*****************************************************************             
394895 50002740-LLENO-ARCPLINEA.                                                    
394900    MOVE SPACES                       TO REG-PUNTEOT                          
394905    MOVE WS-B17-CVEACUM-C(WS-IND4)    TO WS-DETPT-CLAVE                       
394910    MOVE WS-B17-TPOACUM-C(WS-IND4)    TO WS-DETPT-TIPO-IMP                    
394915    MOVE WS-DETB2-NUMCTO              TO WS-DETPT-NUMCTO                      
394920    MOVE WS-DETB2-IMP                 TO WS-DETPT-IMP                         
394925    PERFORM 50001250-GRABO-ARC    THRU 50001250-EXIT.                         
394930 50002740-EXIT.                                                               
394935    EXIT.                                                                     
395010                                                                              
395015*R4-COPIAS-2011 AGREGA MANEJO DEL 3er ARCHIVO PBATCH (P130)   -YCY            
395020***************************************************************               
395025* LEO EL ARCHIVO PBATCH COPIA 3.                                              
395030***************************************************************               
395035 50002800-LEO-PBATCH3.                                                        
395040   PERFORM 50002850-VAL-HEA        THRU 50002850-EXIT.                        
395045   PERFORM 50002900-VAL-DET        THRU 50002900-EXIT UNTIL                   
395050   WS-11VEZ = 1.                                                              
395055 50002800-EXIT.                                                               
395060    EXIT.                                                                     
395065                                                                              
395070****************************************************************              
395075* LEO EL HEADER DEL ARCHIVO PBATCH COPIA 3.                                   
395080****************************************************************              
395085 50002850-VAL-HEA.                                                            
395090     READ PUNTEOB3 AT END                                                     
395095        MOVE "ERROR ARCHIVO PBATCHC3 VACIO" TO WS-0101-TEXT-MSG               
395100        PERFORM 70000050-MENSAJE                                              
395105        CALL SYSTEM DMTERMINATE.                                              
395110                                                                              
395115     IF WS-HEAB3-FECHA = WS-FECHA-MOV                                         
395120        NEXT SENTENCE                                                         
395125     ELSE                                                                     
395130        MOVE "FECEXT.E INT ARCPBATCHC3 DIF" TO WS-0101-TEXT-MSG               
395135        PERFORM 70000050-MENSAJE                                              
395140        CALL SYSTEM DMTERMINATE.                                              
395145 50002850-EXIT.                                                               
395150    EXIT.                                                                     
395155                                                                              
395160***************************************************************               
395165* LEO EL DETALLE DEL ARCHIVO PBATCH COPIA 3.                                  
395170***************************************************************               
395175 50002900-VAL-DET.                                                            
395180     READ PUNTEOB3 AT END                                                     
395185        MOVE 1                              TO WS-11VEZ                       
395190        CLOSE PUNTEOT                       WITH SAVE.                        
395195                                                                              
395200     IF WS-11VEZ = 0                                                          
395205        IF WS-HEAB2-TREG = 99                                                 
395210          NEXT SENTENCE                                                       
395215        ELSE                                                                  
395220          PERFORM 50002910-VAL-CVE         THRU 50002910-EXIT.                
395225 50002900-EXIT.                                                               
395230    EXIT.                                                                     
395235                                                                              
395240****************************************************************              
395245* SOLO SON ELEGIDAS LAS CLAVES DE CARGO (2XXX Y 4XXX) PARA SER                
395250* VALIDADAS SI SON BONIFICACIONES.                                            
395255***************************************************************               
395260 50002910-VAL-CVE.                                                            
395265   IF ((WS-DETB3-CVE > 1999) AND (WS-DETB3-CVE < 3000)) OR                    
395270      ((WS-DETB3-CVE > 3999) AND (WS-DETB3-CVE < 5000))                       
395275      MOVE WS-DETB3-CVE                TO WS-IND6                             
395280      MOVE WS-DETB3-CVE                TO WS-MSG-CVE                          
395285      PERFORM 50002930-VAL-B17        THRU 50002930-EXIT.                     
395290 50002910-EXIT.                                                               
395295    EXIT.                                                                     
395300                                                                              
395305******************************************************************            
395310* VERIFICO SI B17 TIENE ENCENDIDOS LOS CAMPOS QUE ME INDICAN QUE              
395315* SE TRATA DE UNA CLAVE DE CARGO Y ES UNA BONIFICACION.                       
395320***************************************************************               
395325 50002930-VAL-B17.                                                            
395330   IF WS-B17-CVEACUM-C(WS-IND6) > 0                                           
395335      PERFORM 50002940-LLENO-ARCPLINEA     THRU 50002940-EXIT.                
395340 50002930-EXIT.                                                               
395345    EXIT.                                                                     
395350                                                                              
395355******************************************************************            
395360* SI LA CLAVE CUMPLIO CON LAS CONDICIONES DESEADAS, ES LLENADO                
395365* EL ARCHIVO DE PUNTEO TOTAL.                                                 
395370*****************************************************************             
395375 50002940-LLENO-ARCPLINEA.                                                    
395380    MOVE SPACES                       TO REG-PUNTEOT                          
395385    MOVE WS-B17-CVEACUM-C(WS-IND6)    TO WS-DETPT-CLAVE                       
395390    MOVE WS-B17-TPOACUM-C(WS-IND6)    TO WS-DETPT-TIPO-IMP                    
395395    MOVE WS-DETB3-NUMCTO              TO WS-DETPT-NUMCTO                      
395400    MOVE WS-DETB3-IMP                 TO WS-DETPT-IMP                         
395405    PERFORM 50001250-GRABO-ARC    THRU 50001250-EXIT.                         
395410 50002940-EXIT.                                                               
395415    EXIT.                                                                     
395420                                                                              
395510                                                                              
396010                                                                              
396510******************************************************************            
397010* SORTEO EL ARCHIVO DE PUNTEO TOTAL.                                          
397510******************************************************************            
398010 50003000-SORT-PTOTAL.                                                        
398510     OPEN INPUT PUNTEOT.                                                      
399010     MOVE ATTRIBUTE LASTRECORD OF PUNTEOT TO WS-LASTRECORD                    
399510     CLOSE PUNTEOT.                                                           
400010     COMPUTE WS-SORT-ESPACIO = (WS-LASTRECORD + 1) * 6 * 2.5                  
400510     COMPUTE WS-AREA-ESPACIO = (9 * 2000 ) + 1500                             
401010     SORT PUNTEO-SORT ON ASCENDING KEY CTOMOV-SORT CVEMOV-SORT                
401510     USING PUNTEOT GIVING PUNTEOT                                             
402010     MEMORY SIZE WS-AREA-ESPACIO WORDS                                        
402510     DISK   SIZE WS-SORT-ESPACIO WORDS.                                       
403010     OPEN INPUT PUNTEOT.                                                      
403510 50003000-EXIT.                                                               
404010    EXIT.                                                                     
404510                                                                              
405010****************************************************************              
405510* CON EL AµO,MES DE LA FECHA LOTE VERIFICO EN QUE NUMERO DE                   
406010* ESTRUCTURA SE VAN A GRABAR LAS COMISIONES ENCONTRADAS.                      
406510****************************************************************              
407010 50004000-LEO-EST.                                                            
407510     MOVE WS-FECHA-AA          TO WS-COMICOB-AA                               
408010     MOVE WS-FECHA-MM          TO WS-COMICOB-MM                               
408510     MOVE 0                    TO WS-NUM-EST                                  
409010     PERFORM 90000028-B28COMICOB-NO-DS.                                       
409510     IF (WS-COMICOB-DS > 0) AND                                               
410010        (WS-COMICOB-DS < 8)                                                   
410510        MOVE WS-COMICOB-DS         TO WS-NUM-EST                              
411010     ELSE                                                                     
412510        STRING "VALOR DE EST. INVALIDO  " ,WS-NUM-EST                         
413010        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
413510        PERFORM 70000050-MENSAJE                                              
414010        CALL SYSTEM DMTERMINATE.                                              
414510 50004000-EXIT.                                                               
415010    EXIT.                                                                     
415510                                                                              
416010***************************************************************               
416510* LEO EL DETALLE DEL ARCHIVO PTOTAL SORTEADO.                                 
417010***************************************************************               
417510 50005000-LEO-SORT.                                                           
418010     READ PUNTEOT  AT END                                                     
418510        MOVE 1                              TO WS-3VEZ                        
419010        MOVE 1                              TO WS-BAN-BEGIN                   
419020        PERFORM 50005500-ACT-B28            THRU 50005500-EXIT.               
420010                                                                              
420510     IF WS-3VEZ = 0                                                           
420520        MOVE    1                           TO WS-SIHAY                       
421010        PERFORM 50005200-ACT-EST            THRU 50005200-EXIT.               
421510 50005000-EXIT.                                                               
422010    EXIT.                                                                     
422510                                                                              
423010*****************************************************************             
423510* ACTUALIZO LA COMISION EN LA ESTRUCTURA QUE LE CORESPONDE.                   
424010*****************************************************************             
424510 50005200-ACT-EST.                                                            
425010    IF WS-7VEZ = 0                                                            
425510       MOVE WS-DETPT-NUMCTO       TO WS-CTO-ANT                               
426010       MOVE WS-DETPT-CLAVE        TO WS-CVE-ANT                               
426020       PERFORM 50005250-BUSCO     THRU 50005250-EXIT                          
426590       MOVE 1                     TO WS-7VEZ.                                 
427010                                                                              
427020    IF (WS-DETPT-NUMCTO = WS-CTO-ANT) AND                                     
427030       (WS-DETPT-CLAVE  = WS-CVE-ANT)                                         
427035       PERFORM 50005260-SUMO      THRU 50005260-EXIT                          
427090    ELSE                                                                      
431510       PERFORM 50005500-ACT-B28     THRU 50005500-EXIT                        
431520       MOVE WS-DETPT-NUMCTO         TO   WS-CTO-ANT                           
431530       MOVE WS-DETPT-CLAVE          TO   WS-CVE-ANT                           
431540       MOVE 0                       TO   WS-SUM-IMP-COBRADO                   
431550       MOVE 0                       TO   WS-SUM-IVA-COBRADO                   
432010       PERFORM 50005250-BUSCO       THRU 50005250-EXIT                        
432020       PERFORM 50005260-SUMO        THRU 50005260-EXIT.                       
433010 50005200-EXIT.                                                               
433510   EXIT.                                                                      
434010                                                                              
434020****************************************************************              
434030* REALIXO EL LOCK/CREATE AL CONTRATO SEGUN SEA EL CASO.                       
434040****************************************************************              
434050 50005250-BUSCO.                                                              
434060    MOVE WS-DETPT-NUMCTO          TO WS-NUM-CONTRATO                          
434070    MOVE WS-DETPT-CLAVE           TO WS-CVE-ACUMULA                           
434080    MOVE WS-NUM-EST               TO WS-COMICOB-DS                            
434090    MOVE 0                        TO WS-4VEZ                                  
434100    PERFORM 50005300-B28-LOCK     THRU 50005300-EXIT.                         
434110    IF WS-4VEZ = 1                                                            
434120      MOVE WS-NUM-EST             TO   WS-COMICOB-DS                          
434130      PERFORM 50005400-CREATE-B28 THRU 50005400-EXIT.                         
434140 50005250-EXIT.                                                               
434150    EXIT.                                                                     
434160                                                                              
434200****************************************************************              
434210* SI EL CTO/CVE ES LO MISMO SOLO SUMO.                                        
434220****************************************************************              
434230 50005260-SUMO.                                                               
434240       IF WS-DETPT-TIPO-IMP = 1                                               
434250          ADD WS-DETPT-IMP          TO   WS-SUM-IMP-COBRADO                   
434260       ELSE                                                                   
434270          ADD WS-DETPT-IMP          TO   WS-SUM-IVA-COBRADO.                  
434280 50005260-EXIT.                                                               
434290    EXIT.                                                                     
434300                                                                              
434510****************************************************************              
435010* BUSCO EN B28 SI EL REG. YA EXISTE, SI NO LO CREO.                           
435510****************************************************************              
436010 50005300-B28-LOCK.                                                           
436510   PERFORM 90000028-B28SXCTOCVE-LOCK                                          
437010   IF WS-STATUS-BASE > 0                                                      
437510      IF WS-STATUS-BASE = 1                                                   
438010         MOVE 1 TO WS-4VEZ                                                    
438510      ELSE                                                                    
440010         STRING "ERROR AL HACER LOCK A B28",WS-STATUS-BASE                    
440510         DELIMITED BY SIZE INTO             WS-0101-TEXT-MSG                  
441010         PERFORM 70000050-MENSAJE                                             
441510         CALL SYSTEM DMTERMINATE.                                             
442010                                                                              
442510   MOVE WS-COMICOB-AREA                     TO WS-BONI-AREA.                  
443010 50005300-EXIT.                                                               
443510    EXIT.                                                                     
444010                                                                              
444510****************************************************************              
445010* CUANDO NO EXISTE EL REG. EN B28 LO CREO.                                    
445510****************************************************************              
446010 50005400-CREATE-B28.                                                         
446510    PERFORM 90000028-B28COMICOB-CREATE                                        
447010    IF WS-STATUS-BASE > 0                                                     
448510       STRING "ERROR AL HACER CREATE A B28",WS-STATUS-BASE                    
449010       DELIMITED BY SIZE INTO               WS-0101-TEXT-MSG                  
449510       PERFORM 70000050-MENSAJE                                               
450010       CALL SYSTEM DMTERMINATE.                                               
450510                                                                              
451010    MOVE WS-DETPT-NUMCTO               TO   WS-B28-NUM-CONTRATO.              
451510    MOVE WS-DETPT-CLAVE                TO   WS-B28-CVE-ACUMULA.               
452010 50005400-EXIT.                                                               
452510   EXIT.                                                                      
453010                                                                              
453510****************************************************************              
454010* ACTUALIZO EL DATASET DE B28    EN CASO DE QUE YA EXISTA.                    
454510****************************************************************              
455010 50005500-ACT-B28.                                                            
455510   IF (WS-6VEZ = 0) AND (WS-SIHAY = 1)                                        
456010     MOVE 1   TO WS-6VEZ                                                      
456510     PERFORM 51074520-BEGIN  THRU 51074520-EXIT.                              
457010                                                                              
457020   IF WS-SIHAY = 1                                                            
457510     MOVE WS-NUM-EST                TO   WS-COMICOB-DS                        
458510     ADD WS-SUM-IMP-COBRADO         TO   WS-B28-IMP-COBRADO                   
459510     ADD WS-SUM-IVA-COBRADO         TO   WS-B28-IVA-COBRADO                   
460510     MOVE WS-BONI-AREA              TO   WS-COMICOB-AREA                      
461010     ADD  1                         TO   WS-NUM-BEGIN                         
461510     MOVE 1                         TO   WS-BAN-B28                           
462010     PERFORM 51074000-GRABO     THRU 51074000-EXIT.                           
462510 50005500-EXIT.                                                               
463010    EXIT.                                                                     
463510                                                                              
464010*****************************************************************             
464510* SI HAY ALGUN DATASET A ACTUALIZAR SE ABRE UN BEGIN TRANSACTION.             
465010* Y UN END-TRANSACTION.                                                       
465510*****************************************************************             
466010 51074000-GRABO.                                                              
466510   IF WS-BAN-B28 = 1                                                          
467010      PERFORM 51075000-ACTUALIZO THRU 51075000-EXIT                           
467510      MOVE 0 TO WS-BAN-B28.                                                   
468010                                                                              
468510   IF (WS-NUM-BEGIN = 3000) OR (WS-BAN-BEGIN = 1)                             
469010      PERFORM 51074500-BEGIN-END       THRU 51074500-EXIT.                    
469510 51074000-EXIT.                                                               
470010     EXIT.                                                                    
470510                                                                              
471010*****************************************************************             
471510* CUANDO EL NUMERO DE TRANSACCIONES ES = 3000 O YA TERMINE DE LEER            
472010* EL ARCHIVO REALIZO EL END Y BEGIN CORRESPONDIENTE.                          
472510*****************************************************************             
473010 51074500-BEGIN-END.                                                          
473510   IF WS-NUM-BEGIN = 3000                                                     
474010     IF WS-BAN-BEGIN = 1                                                      
474510        PERFORM 51074510-END     THRU 51074510-EXIT                           
475010     ELSE                                                                     
475510        MOVE 0                   TO   WS-NUM-BEGIN                            
476010        PERFORM 51074510-END     THRU 51074510-EXIT                           
476510        PERFORM 51074520-BEGIN   THRU 51074520-EXIT                           
477010   ELSE                                                                       
477510     PERFORM 51074510-END        THRU 51074510-EXIT.                          
478010 51074500-EXIT.                                                               
478510     EXIT.                                                                    
479010                                                                              
479510*****************************************************************             
480010* RUTINA DE END.                                                              
480510*****************************************************************             
481010 51074510-END.                                                                
481510    PERFORM 90000000-END-TRANSACTIONNOAU                                      
482010    IF WS-STATUS-BASE > 0                                                     
483510       STRING "ERROR EN END-TRANSACTION    " ,WS-STATUS-BASE                  
484010       DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                
484510       PERFORM 70000050-MENSAJE                                               
485010       CALL SYSTEM DMTERMINATE.                                               
485510 51074510-EXIT.                                                               
486010   EXIT.                                                                      
486510                                                                              
487010*****************************************************************             
487510* RUTINA DE BEGIN.                                                            
488010*****************************************************************             
488510 51074520-BEGIN.                                                              
489010    PERFORM 90000000-BEGIN-TRANSACTION                                        
489510     IF WS-STATUS-BASE > 0                                                    
491010        STRING "ERROR EN BEGIN-TRANSACTION " ,WS-STATUS-BASE                  
491510        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
492010        PERFORM 70000050-MENSAJE                                              
492510        CALL SYSTEM DMTERMINATE.                                              
493010 51074520-EXIT.                                                               
493510   EXIT.                                                                      
494010                                                                              
494510*****************************************************************             
495010* GRABO EL DATASET DEPENDIENDO DE SU BANDERA.                                 
495510*****************************************************************             
496010 51075000-ACTUALIZO.                                                          
496510    IF WS-BAN-B28 = 1                                                         
497010       MOVE WS-NUM-EST                         TO WS-COMICOB-DS               
497510       PERFORM 90000028-B28COMICOB-STORE                                      
498010       IF WS-STATUS-BASE > 0                                                  
499510        STRING "ERROR AL GRABAR B28 " ,WS-STATUS-BASE                         
500010        DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG               
500510        PERFORM 70000050-MENSAJE                                              
501010        CALL SYSTEM DMTERMINATE.                                              
501510 51075000-EXIT.                                                               
502010    EXIT.                                                                     
502510                                                                              
503010*****************************************************************             
503510*****************************************************************             
504010* R U T I N A S      F I N A L E S     D E L     P R O C E S O.               
504510*****************************************************************             
505010*****************************************************************             
505510                                                                              
506010                                                                              
506510                                                                              
507010                                                                              
507510*****************************************************************             
508010* RUTINA QUE SE EJECUTA ANTES DE FINALIZAR EL PROGRAMA.                       
508510*****************************************************************             
509010 70000000-CIERRO.                                                             
509510    PERFORM 70000400-GRABO-PASO  THRU 70000400-EXIT.                          
510010    PERFORM 70000600-CLOSE       THRU 70000600-EXIT.                          
510510 70000000-EXIT.                                                               
511010    EXIT.                                                                     
511510                                                                              
512010                                                                              
513010******************************************************************            
513510* GRABO EL PASO EN EL REG. DE CONTROL B00 SI YA TODO FUE CORRECTO.            
514010******************************************************************            
514510 70000400-GRABO-PASO.                                                         
515010   SET S500B00CTRLPASO TO BEGINNING.                                          
515510   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
516010   IF WS-STATUS-BASE > 0                                                      
516510      IF WS-STATUS-BASE = 1                                                   
518010         MOVE "ERROR REG B00CTRLPASO VACIO "   TO WS-0101-TEXT-MSG            
518510         PERFORM 70000050-MENSAJE                                             
519010         CALL SYSTEM DMTERMINATE                                              
519510      ELSE                                                                    
521010         STRING "ERROR AL HACER LOCK A B00",   WS-STATUS-BASE                 
521510         DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG               
522010         PERFORM 70000050-MENSAJE                                             
522510         CALL SYSTEM DMTERMINATE.                                             
523010*R4-COPIAS-2011 AGREGA MANEJO DEL 3er CAMPO DE CONTROL DE B00 -YCY            
523510   MOVE  178  TO  B00-NUM-PASO-01 B00-NUM-PASO-02 B00-NUM-PASO-03             
524510   PERFORM 51074520-BEGIN   THRU 51074520-EXIT.                               
525510   PERFORM 90000000-B00CTRLPASO-STORE.                                        
526010   IF WS-STATUS-BASE > 0                                                      
527510      STRING "ERROR AL GRABAR B00 " ,WS-STATUS-BASE                           
528010      DELIMITED BY SIZE INTO                 WS-0101-TEXT-MSG                 
528510      PERFORM 70000050-MENSAJE                                                
529010      CALL SYSTEM DMTERMINATE.                                                
530010   PERFORM 51074510-END     THRU 51074510-EXIT.                               
530510 70000400-EXIT.                                                               
531010    EXIT.                                                                     
531510                                                                              
532010****************************************************************              
532510* CIERRO ARCHIVO Y BASE.                                                      
533010****************************************************************              
533510 70000600-CLOSE.                                                              
534010     CLOSE PUNTEOL1   WITH SAVE.                                              
534020     CLOSE PUNTEOL2  WITH SAVE.                                               
534030     CLOSE PUNTEOL3  WITH SAVE.                                               
534510     CLOSE PUNTEOB1   WITH SAVE.                                              
534520     CLOSE PUNTEOB2  WITH SAVE.                                               
534530     CLOSE PUNTEOB3  WITH SAVE.                                               
535010**   CLOSE PUNTEOT   WITH PURGE.                                              
535020     CLOSE PUNTEOT   WITH SAVE.                                               
535510                                                                              
536010     CLOSE S500BD01CAPTACION                                                  
536510     ON EXCEPTION                                                             
538010     MOVE "ERROR AL CERRAR LA BASE "         TO WS-0101-TEXT-MSG              
538510     PERFORM 70000050-MENSAJE                                                 
539010     CALL SYSTEM DMTERMINATE.                                                 
539510 70000600-EXIT.                                                               
540010    EXIT.                                                                     
540510                                                                              
541010                                                                              
541510                                                                              
542010                                                                              
542510****************************************************************              
543010****************************************************************              
543510* R U T I N A S    P A R A    E L   D E S P L I E G U E   D E                 
544010*                        M S G.                                               
544510****************************************************************              
545010****************************************************************              
545510                                                                              
546010                                                                              
546510                                                                              
547010                                                                              
547510                                                                              
548010****************************************************************              
548510* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE DE DATOS.                 
549010****************************************************************              
549510 COPY "S500/INC/PRO/25MTP002".                                                
549512                                                                              
550010                                                                              
550510****************************************************************              
