000010$SET LIST                                                                     
000510$SET ERRORLIST                                                                
001010$SET ERRORLIMIT = 100                                                         
002010$SET LINEINFO                                                                 
002510$SET BDB00R01                                                                 
002520$SET BDB00R02                                                                 
002525$SET BDB00R04                                                                 
002530                                                                              
002540$SET BDB02R01                                                                 
002550$SET BDB02R02                                                                 
002560$SET BDB02R03                                                                 
002570                                                                              
003510$SET BDB91                                                                    
004010$SET S006LOCSUP                                                               
004015$SET S000LIBLJ                                                                
004050$SET S016L422 S016L422R02 S016L422R08 S016L458                                
004510$SET S080L700 S080IVA                                                         
004520$SET S080CATALOGOS S080L100                                                   
004530$SET S080DATOS                                                                
005010$SET S100VERSIONES                                                            
005020$SET FECHA2000                                                                
005100$SET S500L040  S500L040R03                                                    
005510******************************************************************            
006010*                                                                             
006510* SISTEMA: S500 CAPTACION.                                                    
007010* CODIGO DE BATCH P400.                                                       
007510* VERSION     : FEB /2006 CUENTA MAX 2DA. ETAPA.                              
008010*                                                                             
008510******************************************************************            
009010* I D E N T I F I C A T I O N      D I V I S I O N.                           
009510******************************************************************            
010010 IDENTIFICATION DIVISION.                                                     
010510 PROGRAM-ID.    S500P400.                                                     
011010                                                                              
011510******************************************************************            
012010* E N V I R O N M E N T            D I V I S I O N.                           
012510******************************************************************            
013010 ENVIRONMENT DIVISION.                                                        
013510 CONFIGURATION SECTION.                                                       
014010 INPUT-OUTPUT SECTION.                                                        
014510 FILE-CONTROL.                                                                
015010     SELECT REPORTE             ASSIGN TO PRINTER.                            
015510     SELECT OPTIONAL TARJETA    ASSIGN TO DISK                                
016010                                ORGANIZATION IS SEQUENTIAL                    
016510                                ACCESS MODE  IS RANDOM                        
017010                                ACTUAL KEY   IS W-LLAVE-TARJETA.              
017510     SELECT OPTIONAL TBINTERMON ASSIGN TO DISK.                               
018010     SELECT OPTIONAL TBINTERVDM ASSIGN TO DISK.                               
018100*    EAS-F5                                                                   
018200     SELECT OPTIONAL TBINTERMON-EAS ASSIGN TO DISK.                           
018300     SELECT OPTIONAL TBINTERVDM-EAS ASSIGN TO DISK.                           
018510******************************************************************            
019010* SEMANAL                                                                     
019510******************************************************************            
020010     SELECT OPTIONAL TBINTERNAL    ASSIGN TO DISK                             
020510                                   ORGANIZATION IS SEQUENTIAL                 
021010                                   ACCESS MODE  IS RANDOM                     
021510                                  ACTUAL KEY   IS W-LLAVE-INTER.              
021520*INI-STEFANINI EAS                                                            
021530******************************************************************            
021540*              ARCHIVOS PROYECTO EAS                                          
021550******************************************************************            
021560     SELECT OPTIONAL ARCH-EAS  ASSIGN TO DISK                                 
021562                               ORGANIZATION IS SEQUENTIAL                     
021563                               ACCESS MODE  IS RANDOM                         
021564                               ACTUAL KEY   IS W-LLAVE-EASDIARIO.             
021565                                                                              
021570     SELECT OPTIONAL ARCH-PROC ASSIGN TO DISK.                                
021580*FIN-STEFANINI EAS                                                            
021582******************************************************************            
021584*              ARCHIVOS PROYECTO EAS F3                                       
021586******************************************************************            
021588      SELECT OPTIONAL ARCH-EAS-SEM ASSIGN TO DISK                             
021590                                   ORGANIZATION IS SEQUENTIAL                 
021592                                   ACCESS MODE  IS RANDOM                     
021594                                   ACTUAL KEY   IS W-LLAVE-EASSEM.            
021596                                                                              
021598      SELECT OPTIONAL ARCH-DET-B   ASSIGN TO DISK                             
021600                                   ORGANIZATION IS SEQUENTIAL                 
021602                                   ACCESS MODE  IS RANDOM                     
021604                                   ACTUAL KEY   IS W-LLAVE-DETB.              
021606                                                                              
021608      SELECT ARCH-DET-SORT         ASSIGN TO SORT DISK.                       
022010                                                                              
022510******************************************************************            
023010* D A T A                  D I V I S I O N.                                   
023510******************************************************************            
024010 DATA DIVISION.                                                               
024510 FILE SECTION.                                                                
025010                                                                              
025510******************************************************************            
026010* DECLARACION DEL REPORTE GENERADO POR EL P400.                               
026510******************************************************************            
027010 FD  REPORTE.                                                                 
027510 01  LINEA                 PIC X(132).                                        
028010                                                                              
028510******************************************************************            
029010* DECLARACION DEL ARCHIVO DE ENTRADA DE TARJETAS DIARIO.                      
029510******************************************************************            
030010 FD  TARJETA                                                                  
030510     RECORD CONTAINS 192 CHARACTERS                                           
031010     VALUE OF TITLE  WS-ETIQTARJETA                                           
031510              DEPENDENTSPECS TRUE                                             
031600              DEPENDENTINTMODE TRUE.                                          
032010 01  TARJETA-REG           PIC X(192).                                        
032020                                                                              
032030*INI-STEFANINI EAS                                                            
032040******************************************************************            
032050*           DECLARACION DEL ARCHIVO DE ENTRADA EAS                            
032060******************************************************************            
032070 FD  ARCH-EAS                                                                 
032080     RECORD CONTAINS 500 CHARACTERS                                           
032090     VALUE OF TITLE WS-ETIQEAS                                                
032100               DEPENDENTSPECS TRUE                                            
032110               DEPENDENTINTMODE TRUE.                                         
032120 01  EAS-REG               PIC X(500).                                        
032130                                                                              
032140******************************************************************            
032150* DECLARACION DEL ARCHIVO DE SALIDA DE PROCESAMIENTO DE ARCHIVOS              
032160*****************************************************************             
032170 FD  ARCH-PROC                                                                
032180     RECORD CONTAINS 880 CHARACTERS                                           
032190     BLOCK  CONTAINS 072 RECORDS.                                             
032200                                                                              
032210 01  PROC-REG              PIC X(880).                                        
032220                                                                              
032230*FIN-STEFANINI EAS                                                            
032510                                                                              
033010******************************************************************            
033510* DECLARACION DEL ARCHIVO DE SALIDA GENERADO  PARA MTY.                       
034010******************************************************************            
034510 FD  TBINTERMON                                                               
035010     RECORD CONTAINS 240 CHARACTERS                                           
035510     BLOCK  CONTAINS 030 RECORDS.                                             
036010                                                                              
036510 01  REG-TBINTERMON        PIC X(240).                                        
037010                                                                              
037510******************************************************************            
038010* DECLARACION DEL ARCHIVO DE SALIDA GENERADO PARA VDM.                        
038510******************************************************************            
039010 FD  TBINTERVDM                                                               
039510     RECORD CONTAINS 240 CHARACTERS                                           
040010     BLOCK  CONTAINS 030 RECORDS.                                             
040510                                                                              
041010 01  REG-TBINTERVDM        PIC X(240).                                        
041020                                                                              
041040*INI EAS F5                                                                   
041060******************************************************************            
041080* DECLARACION DEL ARCHIVO DE SALIDA GENERADO  PARA MTY. EAS                   
041100******************************************************************            
041120 FD  TBINTERMON-EAS                                                           
041140     RECORD CONTAINS 240 CHARACTERS                                           
041160     BLOCK  CONTAINS 030 RECORDS.                                             
041180 01  REG-TBINTERMON-EAS        PIC X(240).                                    
041200                                                                              
041220******************************************************************            
041240* DECLARACION DEL ARCHIVO DE SALIDA GENERADO PARA VDM. EAS                    
041260******************************************************************            
041280 FD  TBINTERVDM-EAS                                                           
041300     RECORD CONTAINS 240 CHARACTERS                                           
041320     BLOCK  CONTAINS 030 RECORDS.                                             
041340 01  REG-TBINTERVDM-EAS        PIC X(240).                                    
041360* FIN EAS F5                                                                  
041510                                                                              
042010******************************************************************            
042510* DECLARACION DEL ARCHIVO DE ENTRADA SEMANAL.                                 
043010******************************************************************            
043510 FD  TBINTERNAL                                                               
044010     RECORD CONTAINS 192 CHARACTERS                                           
044510     VALUE OF TITLE  WS-ETIQTBINTER                                           
045010              DEPENDENTSPECS TRUE                                             
045200              DEPENDENTINTMODE TRUE.                                          
045510 01  TBINTER-REG           PIC X(192).                                        
046010                                                                              
046012******************************************************************            
046014*        DECLARACION DEL ARCHIVO DE ENTRADA EAS SEMANAL                       
046016******************************************************************            
046018 FD  ARCH-EAS-SEM                                                             
046020     RECORD CONTAINS 500 CHARACTERS                                           
046022     VALUE OF TITLE WS-ETIQEAS-SEM                                            
046024               DEPENDENTSPECS TRUE                                            
046026               DEPENDENTINTMODE TRUE.                                         
046028 01  EAS-SEM-REG            PIC X(500).                                       
046030                                                                              
046032******************************************************************            
046034*   DECLARACION DEL ARCHIVO COMBINADO DETALLES S111-EAS                       
046036*   Y ARCHIVO PARA SORT                                                       
046038******************************************************************            
046040 FD  ARCH-DET-B                                                               
046042     RECORD CONTAINS 500 CHARACTERS                                           
046043     BLOCK  CONTAINS 099 RECORDS                                              
046044     VALUE OF TITLE WS-ETIQDETALLEB                                           
046046               DEPENDENTSPECS TRUE                                            
046048               DEPENDENTINTMODE TRUE.                                         
046050 01  DET-REG               PIC X(500).                                        
046052                                                                              
046054 SD ARCH-DET-SORT                                                             
046056      RECORD CONTAINS 500 CHARACTERS.                                         
046058 01 SORT-REG.                                                                 
046060    02 FILLER              PIC X(485).                                        
046062    02 SORT-CONT           PIC 9(14).                                         
046064    02 SORT-ORIG           PIC 9(01).                                         
046066                                                                              
046510******************************************************************            
047010* D A T A   B A S E   S E C T I O N.                                          
047510******************************************************************            
048010 DATA-BASE SECTION.                                                           
048510 DB S500BD01CAPTACION.                                                        
049010 01 S500B02CONTROL.                                                           
049510 01 S500B91REINICIO.                                                          
050010                                                                              
050510******************************************************************            
051010*  W O R K I N G - S T O R A G E           S E C T I O N                      
051510******************************************************************            
052010 WORKING-STORAGE SECTION.                                                     
052012     77 W77-REG-LEI              PIC 9(08) VALUE 1.                           
052014     77 W77-REG-TOT              PIC 9(08) VALUE 0.                           
052015     77 WKS-HI-NUMHI             PIC 9(02) VALUE 0.                           
052060     77 W77-SI-S016              PIC 9(08) VALUE 0.                           
052062     77 W77-SI-L458              PIC 9(08) VALUE 0.                           
052063     77 W77-NO-L458              PIC 9(08) VALUE 0.                           
052064     77 W77-SI-L422              PIC 9(08) VALUE 0.                           
052110     77 W77-NO-S016              PIC 9(08) VALUE 0.                           
052120     77 WS-L458-L422             PIC 9(08) VALUE 0.                           
052122     77 WS-L040-L422             PIC 9(08) VALUE 0.                           
052124     77 W77-SUC-INV-L422         PIC 9(08) VALUE 0.                           
052126     77 W77-SUC-INV-L040         PIC 9(08) VALUE 0.                           
052160     77 W77-CSI-SIIGUAL          PIC 9(08) VALUE 0.                           
052210     77 W77-CSI-NOIGUAL          PIC 9(08) VALUE 0.                           
052212     77 W77-SUC-SIIGUAL          PIC 9(08) VALUE 0.                           
052214     77 W77-SUC-NOIGUAL          PIC 9(08) VALUE 0.                           
052216     77 W77-SI-BD04              PIC 9(08) VALUE 0.                           
052218     77 W77-NO-BD04              PIC 9(08) VALUE 0.                           
052220     77 W77-CSI-SIIGUAL-BD04     PIC 9(08) VALUE 0.                           
052222     77 W77-CSI-NOIGUAL-BD04     PIC 9(08) VALUE 0.                           
052224     77 W77-SUC-SIIGUAL-BD04     PIC 9(08) VALUE 0.                           
052226     77 W77-SUC-NOIGUAL-BD04     PIC 9(08) VALUE 0.                           
052228     77 W77-CTO-SIIGUAL-BD04     PIC 9(08) VALUE 0.                           
052230     77 W77-CTO-NOIGUAL-BD04     PIC 9(08) VALUE 0.                           
052232     77 W77-CSI-IGUAL-L458       PIC 9(08) VALUE 0.                           
052234     77 W77-CSI-NOIGUAL-L458     PIC 9(08) VALUE 0.                           
052240     77 W77-NOS016-NOBD04        PIC 9(08) VALUE 0.                           
052242     77 W77-CSI-12               PIC 9(08) VALUE 0.                           
052244     77 W77-CSI-XX               PIC 9(08) VALUE 0.                           
052246     77 W77-CSI-00               PIC 9(08) VALUE 0.                           
052280     77 W77-CSI-SUCORIG          PIC 9(02) VALUE 0.                           
052300     77 W77-S016-CONTRATO        PIC 9(12) VALUE 0.                           
052400     77 W77-BD04-CONTRATO        PIC 9(12) VALUE 0.                           
052420     77 W77-SUC-PTE              PIC 9(04) VALUE 0.                           
052421     77 W77-QUE-VA               PIC 9(01) VALUE 0.                           
052422     77 W77-CSI-PTE              PIC 9(04) VALUE 0.                           
052430     77 W77-SUCP-S016            PIC 9(04) VALUE 0.                           
052432     77 W77-ES-L422              PIC 9(01) VALUE 0.                           
052434     77 W77-WS-DISPL             PIC 9(01) VALUE 0.                           
052450     77 W77-TAM-REG              PIC 9(06) VALUE 0.                           
052500     77 W77-NOLLAMA-S016-BD04    PIC 9(06) VALUE 0.                           
052510                                                                              
052530 01  WS-MSG-AVANCE.                                                           
052550     02 FILLER              PIC X(08) VALUE " RTOTAL=".                       
052570     02 WS-HI-TOTAL         PIC 9(08).                                        
052590     02 FILLER              PIC X(08) VALUE " LEIDOS=".                       
052610     02 WS-HI-LEIDOS        PIC 9(08).                                        
052630     02 FILLER              PIC X(08) VALUE " A L458=".                       
052650     02 WS-HI-CL458         PIC 9(08).                                        
052670     02 FILLER              PIC X(08) VALUE " A L422=".                       
052690     02 WS-HI-CL422         PIC 9(08).                                        
052710     02 FILLER              PIC X(08) VALUE " A L040=".                       
052730     02 WS-HI-CL040         PIC 9(08).                                        
052735                                                                              
053010******************************************************************            
053510* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y LLAVES DE                  
054010* ACCESO A LA BASE DE DATOS.                                                  
054510******************************************************************            
055010 COPY "S500/INC/WOR/25MTP004".                                                
055510                                                                              
067010****************************************************************              
067510* NOMBRE DE LA CARATULA DE IMPRESION DEL REPORTE.                             
068010****************************************************************              
068510                                                                              
069010 01 WS-NOMBRE-REPORTE.                                                        
069510    02 FILLER  PIC X(25) VALUE "S500/LIST/P400/1000/C000/".                   
070510    02 WS-FECHA-BACKUP         PIC 9(6).                                      
071010    02 FILLER                  PIC X     VALUE "/".                           
071510    02 WS-MIX-NUMBER           PIC 9(7).                                      
072010    02 WS-NUM-SEQ              PIC X(04).                                     
073010    02 WS-NOM-BACKUP           PIC X(14).                                     
074010    02 FILLER                  PIC X(01) VALUE ".".                           
074510*                                                                             
075010 01  TAB-BNC                          VALUE ALL "0".                          
075510        03 TAB-CSI-BNC                OCCURS 10 TIMES.                        
076010           04 TOT-REGS                PIC 9(06).                              
076510           04 TOT-BRUTO               PIC 9(12)V99.                           
077010           04 TOT-NETO                PIC 9(12)V99.                           
077510           04 TOT-COMIS               PIC 9(12)V99.                           
078010*                                                                             
078510 01  TAB-CSI-MOV                      VALUE ALL "0".                          
079010        03 TAB-CSI                    OCCURS 10 TIMES.                        
079510           04 TOT-CSI-MOV             PIC 9(12)V99 OCCURS 5 TIMES.            
079512*                                                                             
079514 01  TAB-CSI-MOV-EAS                  VALUE ALL "0".                          
079516        03 TAB-CSI-EAS                OCCURS 10 TIMES.                        
079518           04 TOT-CSI-MOV-EAS         PIC 9(12)V99 OCCURS 5 TIMES.            
080010*                                                                             
080510 01  TAB-TOTALES                      VALUE ALL "0".                          
081010        03 TOTAL                      PIC 9(13)V99 OCCURS 5 TIMES.            
081012*                                                                             
081014 01  TAB-TOTALES-EAS                  VALUE ALL "0".                          
081016        03 TOTAL-EAS                  PIC 9(13)V99 OCCURS 5 TIMES.            
081220                                                                              
091510******************************************************************            
092010* VARIABLES PARA EL MANEJO DE FECHAS.                                         
092510******************************************************************            
093010 01 WS-FEC-BLOQUEO                   PIC 9(08).                               
093520                                                                              
093560 01 WS-FECHA-TEMP-AMD                PIC 9(06).                               
093570 01 WS-FECHA-TEMP1-AMD  REDEFINES WS-FECHA-TEMP-AMD.                          
093580    02 WS-TEMP-AA                    PIC 99.                                  
093590    02 WS-TEMP-MM                    PIC 99.                                  
093600    02 WS-TEMP-DD                    PIC 99.                                  
093610                                                                              
093620 01 WS-FECVAL-AMD                    PIC 9(08).                               
094010 01 WS-FECVAL-AMD-R REDEFINES WS-FECVAL-AMD.                                  
094510    02 WS-FEC-VAL-AA                 PIC 9(04).                               
095010    02 WS-FEC-VAL-MM                 PIC 99.                                  
095510    02 WS-FEC-VAL-DD                 PIC 99.                                  
096010                                                                              
096510 01 WS-FECHA-DIA-DMA                 PIC 9(08).                               
097010 01 WS-FECHA-DIA-DMA-R REDEFINES WS-FECHA-DIA-DMA.                            
097510    02 WS-DIA-DD                     PIC 99.                                  
098010    02 WS-DIA-MM                     PIC 99.                                  
098510    02 WS-DIA-AA                     PIC 9(04).                               
099010                                                                              
099510 01 WS-FECHA-DIA-MDA                 PIC 9(08).                               
100010 01 WS-FECHA-DIA-MDA-R REDEFINES WS-FECHA-DIA-MDA.                            
100510    02 WS-DIA-MM1                    PIC 99.                                  
101010    02 WS-DIA-DD1                    PIC 99.                                  
101510    02 WS-DIA-AA1                    PIC 9(04).                               
102010                                                                              
102510 01 WS-FECHA-DIA-AMD                 PIC 9(08).                               
103010 01 WS-FECHA-DIA-AMD-R REDEFINES WS-FECHA-DIA-AMD.                            
103510    02 WS-DIA-AA2                    PIC 9(04).                               
104010    02 WS-DIA-MM2                    PIC 99.                                  
104510    02 WS-DIA-DD2                    PIC 99.                                  
105010                                                                              
105510 01 WS-FECHA-PRO                     PIC 9(08).                               
106010 01 WS-FECHA-PRO-R REDEFINES WS-FECHA-PRO.                                    
106510    02 WS-PRO-AA                     PIC 9(04).                               
107010    02 WS-PRO-MM                     PIC 99.                                  
107510    02 WS-PRO-DD                     PIC 99.                                  
107512 01 WS-FECHA-PRO-R2 REDEFINES WS-FECHA-PRO.                                   
107514   02 WS-PRO-SS                     PIC 9(02).                                
107516   02 WS-PRO-AAMMDD                 PIC 9(06).                                
107520                                                                              
107540**INI-EASF5                                                                   
107560 01 WS-FECHA-PRO-EAS                 PIC 9(08).                               
107570 01 WS-FECHA-PRO-EAS-R6 REDEFINES WS-FECHA-PRO-EAS.                           
107580     03 WS-FECHA-PRO-EAS-SS          PIC 9(02).                               
107600     03 WS-FECHA-PRO-EAS-AAMMDD      PIC 9(06).                               
107620  01 WS-FECHA-PRO-EAS-R REDEFINES WS-FECHA-PRO-EAS.                           
107640    02 WS-PRO-EAS-AA                     PIC 9(04).                           
107660    02 WS-PRO-EAS-MM                     PIC 99.                              
107680    02 WS-PRO-EAS-DD                     PIC 99.                              
107700                                                                              
107720 01 WS-FECHA6-DDMMAA.                                                         
107740   03 WS-FECHA6-DD                  PIC 99.                                   
107760   03 WS-FECHA6-MM                  PIC 99.                                   
107780   03 WS-FECHA6-AA                  PIC 99.                                   
107800**FIN-EASF5                                                                   
108010                                                                              
108510 01 WS-INVEN-PRO-AMD                  PIC 9(08).                              
109010 01 WS-INVEN-PRO-AMD-R REDEFINES WS-INVEN-PRO-AMD.                            
109510    02 WS-INV-PRO-AA                  PIC 9(04).                              
110010    02 WS-INV-PRO-MM                  PIC 99.                                 
110510    02 WS-INV-PRO-DD                  PIC 99.                                 
111010                                                                              
111510 01 WS-FEC-CALCULADA-AMD             PIC 9(08).                               
112010 01 WS-FEC-CAL-AMD REDEFINES WS-FEC-CALCULADA-AMD.                            
112510    02 WS-CALCULADA-AA                PIC 9(04).                              
113010    02 WS-CALCULADA-MM                PIC 99.                                 
113510    02 WS-CALCULADA-DD                PIC 99.                                 
114010                                                                              
114510 01 WS-FEC-CALCULADA-AMD1            PIC 9(08).                               
115010 01 WS-FEC-CAL-AMD1 REDEFINES WS-FEC-CALCULADA-AMD1.                          
115510    02 WS-CALCULADA-AA1               PIC 9(04).                              
116010    02 WS-CALCULADA-MM1               PIC 99.                                 
116510    02 WS-CALCULADA-DD1               PIC 99.                                 
117010                                                                              
117510 01 WS-FECHA-PRO-DMA                 PIC 9(08).                               
118010 01 WS-FECHA-PRO-DMA-R REDEFINES WS-FECHA-PRO-DMA.                            
118510    02 WS-PRO-DD1                    PIC 99.                                  
119010    02 WS-PRO-MM1                    PIC 99.                                  
119510    02 WS-PRO-AA1                    PIC 9(04).                               
120010                                                                              
120510 01 WS-FEC-PUENTE-AMD              PIC 9(08).                                 
121010 01 WS-FEC-PUEN-AMD REDEFINES WS-FEC-PUENTE-AMD.                              
121510    02 WS-PUENTE-AA                PIC 9(04).                                 
122010    02 WS-PUENTE-MM                PIC 99.                                    
122510    02 WS-PUENTE-DD                PIC 99.                                    
123010                                                                              
123020 01  WKS-RESPALDO                PIC 9(08).                                   
123030 01  WKS-RESPALDO1               REDEFINES  WKS-RESPALDO.                     
123040     02 WS-FEC-RESPALDO-AMD      PIC 9(08).                                   
123050     02 WS-FEC-RES-AMD REDEFINES WS-FEC-RESPALDO-AMD.                         
123060        04 WS-RESPALDO-AA        PIC 9(04).                                   
123070        04 WS-RESPALDO-MM        PIC 9(02).                                   
123080        04 WS-RESPALDO-DD        PIC 9(02).                                   
123510                                                                              
124010 01  WS-HORA-HMSC-01.                                                         
124510     03 WS-HORA-HMSC-N      PIC 9(08).                                        
125010     03 WS-HORA-HMSC REDEFINES WS-HORA-HMSC-N.                                
125510        05 WS-HORA-HMS-N    PIC 9(06).                                        
126010        05 WS-HORA-HMS REDEFINES WS-HORA-HMS-N.                               
126510           07 WS-HORA-HH-N  PIC 9(02).                                        
127010           07 WS-HORA-MM-N  PIC 9(02).                                        
127510           07 WS-HORA-SS-N  PIC 9(02).                                        
128010        05 FILLER           PIC X(02).                                        
128510                                                                              
129010 01  WS-BLANCOS             PIC X(132) VALUE SPACES.                          
129510                                                                              
130010 77  WS-FECHA-DIARIO        PIC 9(08).                                        
130020 77  WS-FECHA-DIARIOP       PIC 9(08).                                        
130510 77  WS-FECHA-SEMANAL       PIC 9(08).                                        
130520 77  WS-FECHA-SEMANALP      PIC 9(08).                                        
130530 77  WS-FECHA-CAL1          PIC 9(08).                                        
130540 77  WS-FECHA-CAL2          PIC 9(08).                                        
130550 77  WS-CONTADOR1           PIC 99.                                           
130560 77  WS-CONTADOR2           PIC 99.                                           
131010 77  WS-SEMANAL             PIC 9      VALUE 0.                               
131510 77  WS-1VEZ                PIC 9      VALUE 0.                               
131520 77  WS-1VEZ-EAS            PIC 9      VALUE 0.                               
132010 77  WS-2VEZ                PIC 9      VALUE 0.                               
132510 77  WS-3VEZ                PIC 9      VALUE 0.                               
133010 77  WS-4VEZ                PIC 9      VALUE 0.                               
133510 77  WS-5VEZ                PIC 9      VALUE 0.                               
134010 77  WS-6VEZ                PIC 9      VALUE 0.                               
134015 77  WS-1VEZ-ETIQ-REPORT    PIC 9      VALUE 0.                               
134020 77  WS-NUMCSI              PIC 9(02)  VALUE 0.                               
134030 77  WS-NUMCSI1             PIC 9(02)  VALUE 0.                               
134035 77  WS-B02-DECOM-S111      PIC 9(02)  VALUE 0.                               
134038 77  WS-NUMCSIS016          PIC 9(02)  VALUE 0.                               
134510 77  WS-VAL-FEC             PIC 9(08).                                        
135010 77  W-LLAVE-TARJETA        PIC 9(11) BINARY VALUE 0.                         
135510 77  W-LLAVE-INTER          PIC 9(11) BINARY VALUE 0.                         
136010 77  WS-SUM-TOT-BRUTO       PIC 9(12)V99 COMP VALUE 0.                        
136100 77  WS-SUM-TOT-BRUTO-DISP  PIC 9(12)V99      VALUE 0.                        
136200 77  WS-SOEID-VOBO-TRAILER  PIC X(08)         VALUE SPACES.                   
136510 77  WS-SUM-TOT-NETO        PIC 9(12)V99 COMP VALUE 0.                        
137010 77  WS-SUM-TOT-COMIS       PIC 9(12)V99 COMP VALUE 0.                        
137510 77  REG-LEIDOS             PIC 9(06) VALUE 0.                                
138010 77  TOTAL-X-PARTES         PIC 9(13)V99 VALUE 0.                             
138510 77  TOTAL-TOTAL            PIC 9(13)V99 VALUE 0.                             
139010 77  CA-SUM-TOT-BRUTO       PIC 9(12)V99 COMP VALUE 0.                        
139510 77  CA-SUM-TOT-NETO        PIC 9(12)V99 COMP VALUE 0.                        
140010 77  CA-SUM-TOT-COMIS       PIC 9(12)V99 COMP VALUE 0.                        
140510 77  REG-LEIDOS-C           PIC 9(06) VALUE 0.                                
141010 77  TOTAL-X-PARTES-C       PIC 9(13)V99 VALUE 0.                             
141510 77  TOTAL-TOTAL-C          PIC 9(13)V99 VALUE 0.                             
142010 77  SW-LEC-TAR                 PIC 9(01) VALUE 0.                            
142510 77  SW-LEC                     PIC 9(01) VALUE 0.                            
143010 77  WS-PASO-TAR                PIC 9(01) VALUE 0.                            
143510 77  I                          PIC 99    VALUE 0.                            
144010 77  J                          PIC 99    VALUE 0.                            
144510 77  WS-ESINTER                 PIC 9(01) COMP VALUE 0.                       
145010 77  WS-SINO                    PIC X(02) VALUE "SI".                         
145510 01  IND-CSI                    PIC 9(02) VALUE 0.                            
146010     88 IND-CSI-OK                    VALUE 4, 10.                            
146020                                                                              
146030*INI-STEFANINI TIPO DE CAMBIO                                                 
146040 01  WS-INTIMP-COMIS        PIC 9(12) VALUE ZEROES.                           
146050 01  WS-INTIMP-NETO         PIC 9(12) VALUE ZEROES.                           
146060                                                                              
146070 01  WS-TC-BANX             PIC 9(06)V9(06).                                  
146080 01  WS-TC-BANX-R REDEFINES WS-TC-BANX.                                       
146090     03 FILLER              PIC X(01).                                        
146100     03 WS-TC-BANXICO       PIC 9(05)V9(06).                                  
146110                                                                              
146120 01  WS-TC-VALM             PIC 9(06)V9(06).                                  
146130 01  WS-TC-VALM-R REDEFINES WS-TC-VALM.                                       
146140     03 FILLER              PIC X(01).                                        
146150     03 WS-TC-VALMER        PIC 9(05)V9(06).                                  
146160*FIN-STEFANINI TIPO DE CAMBIO                                                 
146510                                                                              
147010 01  IND-TIPO-MOV               PIC 9(01) VALUE 0.                            
147510 77  WS-TAR-DS              PIC X(10) RECEIVED BY CONTENT.                    
147515                                                                              
147520*INI-STEFANINI EAS                                                            
147525 01 WS-DATOS-NOCONT.                                                          
147530    03 WS-NC-IMPORTE-AUTORIZACION PIC 9(12)V99.                               
147535    03 WS-NC-BLOQUEO-DESBLOQUEO   PIC 9(02).                                  
147540    03 WS-NC-AUT-3ERNIVEL         PIC 9(08).                                  
147545    03 WS-NC-REF-INTERNACIONAL    PIC 9(23).                                  
147550    03 WS-NC-DATOS-GENERALES.                                                 
147555       05 WS-NC-NOMBRE            PIC X(36).                                  
147560       05 WS-NC-TIPO-PERSONA      PIC 9(02).                                  
147565       05 WS-NC-SEGMENTO          PIC 9(02).                                  
147570       05 WS-NC-CVEPERBNM         PIC 9(02).                                  
147575       05 WS-NC-FECHA-CORTE       PIC 9(02).                                  
147580       05 WS-NC-RESTRICCIONES     PIC 9(02).                                  
147585       05 WS-NC-NIVEL              PIC 9(01).                                 
147590       05 WS-NC-RESTRIC-CTACONCENT PIC 9(01).                                 
147595       05 WS-NC-CTA-CONCENTRADORA PIC 9(02).                                  
147600       05 WS-NC-ESTACION-LB       PIC 9(04).                                  
147605    03 WS-NC-CAMBIO-PROD-MONEDA.                                              
147610       05 WS-NC-MONEDA            PIC 9(03).                                  
147615       05 WS-NC-PRODUCTO          PIC 9(04).                                  
147620       05 WS-NC-INSTRUMENTO       PIC 9(04).                                  
147625    03 WS-NC-PREVENCION-CHEQUERA.                                             
147630       05 WS-NC-CLAVE-PREVENCION  PIC 9(02).                                  
147635       05 WS-NC-1ERCHEQUE         PIC 9(08).                                  
147640       05 WS-NC-ULTCHEQUE         PIC 9(08).                                  
147645    03 WS-NC-CAMBIO-SUCPROM.                                                  
147650       05 WS-NC-SUCPROM           PIC 9(04).                                  
147655    03 WS-NC-CAMBIO-SECTOR.                                                   
147660       05 WS-NC-SECTOR            PIC 9(02).                                  
147665    03 WS-NC-TCORIGEN             PIC 9(06).                                  
147670    03 WS-NC-NOMINA               PIC 9(08).                                  
147675    03 WS-NC-AUTORIZACION         PIC 9(08).                                  
147680    03 WS-NC-IND-CTA-EMP          PIC 9(02).                                  
147685    03 WS-NC-MONEDA-AUT           PIC 9(03).                                  
147690    03 WS-NC-CAMB-CTOS-TRAS.                                                  
147695       05 WS-NC-CAMBCTOTRAS-CTO1  PIC 9(12).                                  
147700       05 WS-NC-CAMBCTOTRAS-CTO2  PIC 9(12).                                  
147705       05 WS-NC-CAMBCTOTRAS-CTO3  PIC 9(12).                                  
147710    03 WS-NC-NVO-NUM-TEF          PIC 9(16).                                  
147715    03 WS-NC-DISP-S054            PIC 9(07)V99.                               
147720    03 WS-NC-TIP-AUT              PIC X(01).                                  
147725    03 WS-NC-AUT-FORZ             PIC 9(01).                                  
147730    03 WS-NC-FILLER2              PIC X(576).                                 
148010                                                                              
148015 01  WS-FECHA-PROY          PIC 9(08).                                        
148020 01  WS-TIPO-MOVTO          PIC 9(04).                                        
148025     88 WS-ES-CARGO         VALUE 2018, 2132.                                 
148030     88 WS-ES-ABONO         VALUE 1014.                                       
148035     88 WS-ES-NCONT         VALUE 0527.                                       
148040                                                                              
148045 01  WS-FECHA-AUT           PIC 9(08).                                        
148050 01  WS-FECHA-AUT-R REDEFINES WS-FECHA-AUT.                                   
148055     03 FILLER              PIC 9(05).                                        
148060     03 WS-FECHA-AUT-M      PIC 9(01).                                        
148065     03 WS-FECHA-AUT-DD     PIC 9(02).                                        
148070                                                                              
148075 01  WS-AUT-PROC            PIC 9(08).                                        
148080 01  WS-AUT-PROC-R REDEFINES WS-AUT-PROC.                                     
148085     03 WS-AUT-M            PIC 9(01).                                        
148090     03 WS-AUT-DD           PIC 9(02).                                        
148095     03 WS-AUT-SEC          PIC 9(05).                                        
148100                                                                              
148105 01  WS-CONTRATO-PROC       PIC 9(16).                                        
148110 01  WS-CONTRATO-PROC-R REDEFINES WS-CONTRATO-PROC.                           
148115     03 WS-SUCURSAL     PIC 9(04).                                            
148120     03 WS-CONTRATO     PIC 9(12).                                            
148125                                                                              
148130 01  WS-AGRUPADOR-TC        PIC X(30).                                        
148135 01  WS-AGRUPADOR-TC-R REDEFINES WS-AGRUPADOR-TC.                             
148140     03 WS-TCAM-BANX        PIC X(11).                                        
148145     03 WS-TCAM-BANX-R REDEFINES WS-TCAM-BANX PIC 9(05)V9(06).                
148150     03 WS-TCAM-COM         PIC X(08).                                        
148155     03 WS-TCAM-COM-R  REDEFINES WS-TCAM-COM  PIC 9(04)V9(04).                
148160     03 WS-TCAM-VALM        PIC X(11).                                        
148165     03 WS-TCAM-VALM-R REDEFINES WS-TCAM-VALM PIC 9(05)V9(06).                
148170                                                                              
148175 01  WS-FILLER-ORI          PIC X(22) VALUE SPACES.                           
148180 01  WS-FILLER-TC           PIC X(05) VALUE SPACES.                           
148185 01  WS-TOTAL-CARGOS        PIC 9(08).                                        
148190 01  WS-TOTIMP-CARGOS       PIC 9(16)V99.                                     
148195 01  WS-TOTAL-ABONOS        PIC 9(08).                                        
148200 01  WS-TOTIMP-ABONOS       PIC 9(16)V99.                                     
148205 01  WS-TOTAL-NCONT         PIC 9(08).                                        
148210 01  WS-HORA-FINEAS         PIC 9(08).                                        
148215 01  WS-HORA-FINEAS-R REDEFINES WS-HORA-FINEAS.                               
148220     03 WS-HORA-EAS-HHMM    PIC 9(04).                                        
148225     03 WS-HORA-EAS-RESTO   PIC 9(04).                                        
148230 01  WS-POINTER             PIC 9(03).                                        
148235                                                                              
148240******************************************************************            
148242*              ETIQUETA DEL ARCHIVO DE ENTRADA EAS.              *            
148245******************************************************************            
148250 01  WS-ETIQEAS.                                                              
148255     03 FILLER               PIC X(27) VALUE                                  
148260       "S500/FILE/INTE/50019E01/10/".                                         
148265     03 WS-ETIQEAS-FECHA     PIC 9(08).                                       
148270     03 FILLER               PIC X(14) VALUE                                  
148275       "/TBINTEREAS/00".                                                      
148280     03 WS-ETIQEAS-SS        PIC 9(02) VALUE 01.                              
148285     03 FILLER               PIC X     VALUE ".".                             
148290                                                                              
148295*ETIQUETA ARCHIVO EAS YA PROCESADO                                            
148300 01  WS-ETIQEAS-PROC.                                                         
148305     03 FILLER               PIC X(41) VALUE                                  
148310     "APLTBINTEREAS/S500/FILE/INTE/50019E01/10/".                             
148315     03 WS-ETIQEAS-FPROC     PIC 9(08).                                       
148320     03 FILLER               PIC X(16) VALUE                                  
148325     "/TBINTEREAS/0001".                                                      
148330     03 FILLER               PIC X     VALUE ".".                             
148332                                                                              
148334 01  WS-ETIQEAS-ERR.                                                          
148336     03 FILLER               PIC X(41) VALUE                                  
148338     "ERRTBINTER/S500/FILE/INTE/50019E01/10/".                                
148340     03 WS-ETIQEAS-FECERR    PIC 9(08).                                       
148342     03 FILLER               PIC X(16) VALUE                                  
148344     "/TBINTEREAS/0001".                                                      
148346     03 FILLER               PIC X     VALUE ".".                             
148348                                                                              
148350******************************************************************            
148352*              ETIQUETA DEL ARCHIVO DE SALIDA ARCH-PROC          *            
148354******************************************************************            
148355 01  WS-ETIQPROC.                                                             
148360     03 FILLER              PIC X(15) VALUE                                   
148365       "S500/FILE/INTE/".                                                     
148370     03 WS-ETIQPROC-BUZON   PIC X(08) VALUE "50019E01".                       
148375     03 FILLER              PIC X(04) VALUE "/10/".                           
148380     03 WS-ETIQPROC-FECHA   PIC 9(08).                                        
148385     03 FILLER              PIC X(01) VALUE "/".                              
148390     03 WS-ETIQPROC-CTE     PIC 9(12) VALUE 000000175172.                     
148395     03 FILLER              PIC X(01) VALUE "/".                              
148400     03 WS-ETIQPROC-SS      PIC 9(04) VALUE 0001.                             
148405     03 FILLER              PIC X     VALUE ".".                              
148410                                                                              
148415******************************************************************            
148420*               WFL PARA LANZAR P197                             *            
148425******************************************************************            
148430 01  WS-WFLP197.                                                              
148435     03 FILLER              PIC X(11) VA "BEGIN JOB; ".                       
148440     03 FILLER              PIC X(06) VA "START ".                            
148445     03 WS-WFLP197-LOTE     PIC X(41).                                        
148450     03 FILLER              PIC X(17) VA "(""CORRESOLO P197 ".                
148455     03 WS-WFLP197-OPCION   PIC 9(02).                                        
148460     03 FILLER              PIC X(01) VA " ".                                 
148465     03 WS-WFLP197-FECHA    PIC 9(08).                                        
148470     03 FILLER              PIC X(12) VA """); END JOB.".                     
148472                                                                              
148475 01 WS-FECHA-FIN-BUSQ       PIC 9(08).                                        
148480 01 WS-FIN-PROGRAMA        PIC 9(01) VALUE ZEROES.                            
148485 01 WS-EXISTE-ARCH          PIC 9(01) VALUE ZEROES.                           
148490 01 WS-SEC-REG              PIC 9(08) VALUE ZEROES.                           
148495 01 WS-FIN-EAS              PIC 9(01) VALUE ZEROES.                           
148500 01 WS-SEC-AUT              PIC 9(05) VALUE ZEROES.                           
148505 01 WS-TIPMEDACC-PROC       PIC 9(02).                                        
148506 01 WS-INDLEY-PROC          PIC 9(02).                                        
148507                                                                              
148508*FIN-STEFANINI EAS                                                            
148510******************************************************************            
149010* ETIQUETA DEL ARCHIVO DE ENTRADA DE TARJETAS.                                
149510******************************************************************            
150010 01  WS-ETIQTARJETA.                                                          
150510     03  FILLER               PIC X(29) VALUE                                 
151010     "S500/FILE/S500/10/10/TBINTER/".                                         
151510     03 WS-ETIQTARJETA-FECHA  PIC 9(06).                                      
152010     03 FILLER                PIC X     VALUE ".".                            
152012                                                                              
152014******************************************************************            
152016* ETIQUETA DEL ARCHIVO  DE ENTRADA DE TARJETAS ERRONEO.                       
152018******************************************************************            
152020   01  WS-ETIQTARJETA-ERROR.                                                  
152022     03  FILLER               PIC X(40) VALUE                                 
152024     "ERRTBINTER/S500/FILE/S500/10/10/TBINTER/".                              
152026     03 WS-ETIQTARJETA-FECHA-ERR PIC 9(06).                                   
152028     03 FILLER                PIC X     VALUE ".".                            
152050                                                                              
152100******************************************************************            
152150* ETIQUETA DEL ARCHIVO YA PROCESADO DE ENTRADA DE TARJETAS.                   
152200******************************************************************            
152250 01  WS-ETIQTARJETA-APL.                                                      
152300     03  FILLER               PIC X(40) VALUE                                 
152350     "APLTBINTER/S500/FILE/S500/10/10/TBINTER/".                              
152400     03 WS-ETIQTARJETA-FECHA-APL PIC 9(06).                                   
152450     03 FILLER                PIC X     VALUE ".".                            
153010******************************************************************            
153510* ETIQUETA DEL ARCHIVO DE SALIDA DE MTY Y VDM.                                
154010******************************************************************            
154510  01  WS-ETIQ-TAR-CAJ-CSI.                                                    
155010     03 FILLER                PIC X(21) VALUE                                 
155510     "S500/FILE/S500/10/".                                                    
156010     03 WS-ETIQ-CSIDES        PIC 99.                                         
156510     03 FILLER                PIC X(13) VALUE "/MOVSTBINTER/".                
157010     03 WS-ETIQTARJETA-FECSI  PIC 9(06).                                      
157510     03 WS-ETIQTARJETA-FECSI-R REDEFINES WS-ETIQTARJETA-FECSI.                
158010        04 WS-ETIQTARJETA-AA  PIC 99.                                         
158510        04 WS-ETIQTARJETA-MM  PIC 99.                                         
159010        04 WS-ETIQTARJETA-DD  PIC 99.                                         
159510     03 FILLER                PIC X     VALUE ".".                            
159550******************************************************************            
159600* ETIQUETA DEL ARCHIVO DE SALIDA EAS DE MTY Y VDM.     EAS F5                 
159650******************************************************************            
159700  01  WS-ETIQ-TAR-CAJ-CSI-EAS.                                                
159750     03 FILLER                PIC X(21) VALUE                                 
159800     "S500/FILE/S500/10/".                                                    
159850     03 WS-ETIQ-CSIDES-EAS        PIC 99.                                     
159900     03 FILLER                PIC X(16) VALUE "/MOVSTBINTEREAS/".             
159950     03 WS-ETIQTARJETA-FECSI-EAS  PIC 9(06).                                  
160000     03 WS-ETIQTARJETA-FECSI-R-EAS REDEFINES                                  
160050                                   WS-ETIQTARJETA-FECSI-EAS.                  
160100        04 WS-ETIQTARJETA-AA-EAS  PIC 99.                                     
160150        04 WS-ETIQTARJETA-MM-EAS  PIC 99.                                     
160200        04 WS-ETIQTARJETA-DD-EAS  PIC 99.                                     
160250     03 FILLER                PIC X     VALUE ".".                            
160510******************************************************************            
161010* ETIQUETA DEL ARCHIVO DE TARJETAS DE ENTRADA SEMANAL.                        
161510******************************************************************            
162010 01  WS-ETIQTBINTER.                                                          
162510     03  FILLER               PIC X(32) VALUE                                 
163010     "S500/FILE/S500/10/10/TBINTERSEM/".                                      
163510     03 WS-ETIQTBINTER-FECHA  PIC 9(06).                                      
164010     03 WS-ETIQTBINTER-FECHA-R REDEFINES WS-ETIQTBINTER-FECHA.                
164510        05 WS-ETIQTBINTER-AA  PIC 99.                                         
165010        05 WS-ETIQTBINTER-MM  PIC 99.                                         
165510        05 WS-ETIQTBINTER-DD  PIC 99.                                         
166010     03 FILLER                PIC X     VALUE ".".                            
166020                                                                              
166040******************************************************************            
166060* ETIQUETA DEL ARCHIVO YA APLICADO DE TARJETAS DE ENTRADA SEMANAL.            
166080******************************************************************            
166100 01  WS-ETIQTBINTER-APL.                                                      
166120     03  FILLER               PIC X(43) VALUE                                 
166140     "APLTBINTER/S500/FILE/S500/10/10/TBINTERSEM/".                           
166160     03 WS-ETIQTBINTER-FECHA-APL PIC 9(06).                                   
166180     03 WS-ETIQTBINTER-FECHA-APL-R                                            
166200        REDEFINES WS-ETIQTBINTER-FECHA-APL.                                   
166220        05 WS-ETIQTBINTER-AA-APL PIC 99.                                      
166240        05 WS-ETIQTBINTER-MM-APL PIC 99.                                      
166260        05 WS-ETIQTBINTER-DD-APL PIC 99.                                      
166280     03 FILLER                PIC X     VALUE ".".                            
166300                                                                              
166350******************************************************************            
166400* ETIQUETA DEL ARCHIVO YA APLICADO DE TARJETAS DE ENTRADA SEMANAL.            
166450******************************************************************            
166500 01  WS-ETIQTBINTER-ERROR.                                                    
166550     03  FILLER                  PIC X(43) VALUE                              
166600     "ERRTBINTER/S500/FILE/S500/10/10/TBINTERSEM/".                           
166650     03 WS-ETIQTBINTER-FECHA-ERR PIC 9(06).                                   
166700     03 FILLER                   PIC X     VALUE ".".                         
166750                                                                              
167010******************************************************************            
167510* ETIQUETA DE LOS ARCHIVOS DE SALIDA SEMANALES PARA MTY. Y VDM.               
168010******************************************************************            
168510 01  WS-ETIQTBINTER-CSI.                                                      
169010     03 FILLER                PIC X(18) VALUE                                 
169510     "S500/FILE/S500/10/".                                                    
170010     03 WS-ETIQTBINT-CSI      PIC 99.                                         
170510     03 FILLER                PIC X(16) VALUE "/MOVSTBINTERSEM/".             
171010     03 WS-ETIQTBINT-FECSI    PIC 9(06).                                      
171510     03 WS-ETIQTBINT-FECSI-R REDEFINES WS-ETIQTBINT-FECSI.                    
172010        05 WS-ETIQTBINT-AA    PIC 99.                                         
172510        05 WS-ETIQTBINT-MM    PIC 99.                                         
173010        05 WS-ETIQTBINT-DD    PIC 99.                                         
173510     03 FILLER                PIC X     VALUE ".".                            
173512******************************************************************            
173514* ETIQUETA DE LOS ARCHIVOS DE SALIDA SEM PARA MTY.Y VDM    EAS F5             
173516******************************************************************            
173518 01  WS-ETIQTBINTER-CSI-EAS.                                                  
173520     03 FILLER                    PIC X(18) VALUE                             
173522     "S500/FILE/S500/10/".                                                    
173524     03 WS-ETIQTBINT-CSI-EAS      PIC 99.                                     
173526     03 FILLER              PIC X(19) VALUE "/MOVSTBINTERSEMEAS/".            
173528     03 WS-ETIQTBINT-FECSI-EAS    PIC 9(06).                                  
173530     03 WS-ETIQTBINT-FECSI-R-EAS REDEFINES WS-ETIQTBINT-FECSI-EAS.            
173532        05 WS-ETIQTBINT-AA-EAS    PIC 99.                                     
173534        05 WS-ETIQTBINT-MM-EAS    PIC 99.                                     
173536        05 WS-ETIQTBINT-DD-EAS    PIC 99.                                     
173538     03 FILLER                    PIC X     VALUE ".".                        
173540                                                                              
173542*INI STEFANINI EAS F3                                                         
173544******************************************************************            
173546*          ETIQUETA DEL ARCHIVO DE ENTRADA EAS SEMANAL.          *            
173548******************************************************************            
173550 01  WS-ETIQEAS-SEM.                                                          
173552     03 FILLER                   PIC X(27) VALUE                              
173554       "S500/FILE/INTE/50019E01/10/".                                         
173556     03 WS-ETIQEAS-SEM-FECHA     PIC 9(08).                                   
173558     03 FILLER                   PIC X(14) VALUE                              
173560       "/TBINTEREAS/00".                                                      
173562     03 WS-ETIQEAS-SEM-SS        PIC 9(02) VALUE 02.                          
173564     03 FILLER                   PIC X     VALUE ".".                         
173566                                                                              
173568******************************************************************            
173570*   ETIQUETA DEL ARCHIVO DE ENTRADA EAS SEMANAL YA PROCESADO.    *            
173572******************************************************************            
173574 01  WS-ETIQEAS-SEM-PROC.                                                     
173576     03 FILLER                   PIC X(41) VALUE                              
173578     "APLTBINTEREAS/S500/FILE/INTE/50019E01/10/".                             
173580     03 WS-ETIQEAS-SEM-FPROC     PIC 9(08).                                   
173582     03 FILLER                   PIC X(16) VALUE                              
173584     "/TBINTEREAS/0002".                                                      
173586     03 FILLER                   PIC X     VALUE ".".                         
173588                                                                              
17359001  WS-ETIQEAS-SEM-ERR.                                                       
173592     03 FILLER                   PIC X(41) VALUE                              
173594     "ERRTBINTER/S500/FILE/INTE/50019E01/10/".                                
173596     03 WS-ETIQEAS-SEM-FECERR    PIC 9(08).                                   
173598     03 FILLER                   PIC X(16) VALUE                              
173600     "/TBINTEREAS/0002".                                                      
173602     03 FILLER                   PIC X     VALUE ".".                         
173604******************************************************************            
173606*          ETIQUETA DEL ARCHIVO DE DETALLES S111-EAS.            *            
173608******************************************************************            
173610 01  WS-ETIQDETALLEB.                                                         
173612     03  FILLER               PIC X(31) VALUE                                 
173614     "S500/FILE/S500/10/10/COMBINADO/".                                       
173616     03 WS-ETIQ-DET-B-FECHA   PIC 9(06).                                      
173618     03 FILLER                PIC X     VALUE ".".                            
173620                                                                              
173622*AREA DE VARIABLES EAS F3                                                     
173624 77 W-LLAVE-EASDIARIO      PIC 9(11) BINARY VALUE 0.                          
173626 77 W-LLAVE-EASSEM         PIC 9(11) BINARY VALUE 0.                          
173628 77 W-LLAVE-DETB           PIC 9(11) BINARY VALUE 0.                          
173630 77 WS-NO-ES-DIAHABIL      PIC 9(01) VALUE 0.                                 
173632 77 WS-FIN-ARCH-S111       PIC 9(01) VALUE 0.                                 
173634 77 WS-FIN-ARCH-EAS        PIC 9(01) VALUE 0.                                 
173636 77 WS-SUM-TOT-EAS         PIC 9(16)V99 COMP VALUE 0.                         
173638 77 WS-SUM-TOT-EAS-DISP    PIC 9(16)V99      VALUE 0.                         
173640 77 WS-TOTAL-IMPORT        PIC 9(12)V99 VALUE 0.                              
173642 77 WS-SUM-TOT-SIST        PIC 9(12)V99 VALUE 0.                              
173644 77 WS-TOTAL-NUMREG        PIC 9(10).                                         
173646 77 WS-CAMBIO-CONT         PIC 9(01) VALUE 0.                                 
173648 77 WS-IMP-AUTOR-ANT       PIC 9(10)V99 COMP.                                 
173650 77 WS-IMP-BRUTO-ANT       PIC 9(10)V99 COMP.                                 
173652 77 WS-IMP-CONTR-ANT       PIC 9(14).                                         
173654 77 WS-ACUMULADO-IMP-BRUTO PIC 9(10)V99 COMP VALUE 0.                         
173656 77 WS-ACUMULADO-IMP-AUTOR PIC 9(10)V99 COMP VALUE 0.                         
173658 77 WS-ACUMULADO-IMP-DETAL PIC 9(12)V99 COMP VALUE 0.                         
173660 77 REG-LEIDOS-EAS         PIC 9(08) VALUE 0.                                 
173662 77 WS-VAL-CVE             PIC 9(04).                                         
173664   88 WS-CVES-NOCONT        VALUE 526,527,584,585,                            
173666                                  613,615,700,701.                            
173668 77 WS-CONT-IDEM           PIC 9(01) VALUE 0.                                 
173670 77 W77-TOT-REGS           PIC 9(11) VALUE 0.                                 
173672 77 W77-MAXRECSIZE         PIC 9(11) VALUE 0.                                 
173674 77 W77-UNITS              PIC 9(11) VALUE 0.                                 
173676 77 W77-DISK-SIZE          PIC 9(11) VALUE 0.                                 
173678 77 W77-MEMORY-SIZE        PIC 9(11) VALUE 0.                                 
173680 77 W77-LIN-REP            PIC 9(02) VALUE 0.                                 
173682 77 WS-EAS-TOTREG          PIC 9(08) VALUE 0.                                 
173684 77 WS-EAS-TOTIMP          PIC 9(16)V99 VALUE 0.                              
173686 77 WS-OPENED-EAS-FILE     PIC 9(01) VALUE 0.                                 
173688                                                                              
173690 01 WKS-VARIABLES-CTAMAE-DLS.                                                 
173692    02 WKS-MOVTO-A-CTAMAE-VA      PIC 9(01).                                  
173694       88 WKS-MOVTO-A-CTAMAEMN-EN-MN      VALUE 1.                            
173696       88 WKS-MOVTO-A-CTAMAEDLS-EN-MN     VALUE 2.                            
173698       88 WKS-MOVTO-A-CTAMAEDLS-EN-DLS    VALUE 3.                            
173700    02 WKS-IND-MONEDA             PIC 9(01).                                  
173702    02 WKS-IND-TOTREC-PIM         PIC 9(01).                                  
173704                                                                              
173706 77 WS-EXIT-WAIT           PIC 9(01) VALUE 0.                                 
173708 77 WS-CONT-WAIT           PIC 9(02) VALUE 0.                                 
173710 77 WS-CONTINUAR-BUSQUEDA  PIC X(02) VALUE SPACES.                            
173712*FIN-STEFANINI EAS F3                                                         
173714                                                                              
173716**INI-EASF5                                                                   
173718 01 ARCHPEND-S111  PIC 9.                                                     
173720   88 NO-ARCHPEND-S111   VALUE 0.                                             
173722   88 SI-ARCHPEND-S111   VALUE 1.                                             
173724                                                                              
173726 01 ARCHPEND-EAS  PIC 9.                                                      
173728   88 NO-ARCHPEND-EAS   VALUE 0.                                              
173730   88 SI-ARCHPEND-EAS   VALUE 1.                                              
173732                                                                              
173734 01 ARCH-A-PROCESAR PIC 9.                                                    
173736   88 NINGUNO           VALUE 0.                                              
173738   88 ARCH-S111         VALUE 1.                                              
173740   88 ARCH-ECMS         VALUE 2.                                              
173742   88 ARCH-REPORT       VALUE 3.                                              
173744                                                                              
173746 01  WS-FECHA-DIARIOEASP     PIC 9(08).                                       
173748*   03  WS-FECHA-SSEAS-D      PIC 9(02).                                      
173752*   03  WS-FECHA-AAMMDDEASP-D PIC 9(06).                                      
173754                                                                              
173756 01  WS-FECHA-SEMANALEASP    PIC 9(08).                                       
173758*   03  WS-FECHA-SSEAS-S       PIC 9(02).                                     
173762*   03  WS-FECHA-AAMMDDEASP-S  PIC 9(06).                                     
173764                                                                              
173766 77 WS-FIN-PROCESOS         PIC 9      VALUE ZEROES.                          
173768 77 WS-FECHA-LINE           PIC 9(08).                                        
173770 77 WS-FECHA-MAQ            PIC 9(08).                                        
173772 77 WS-FECHA-DIARIOEAS      PIC 9(08).                                        
173774 77 WS-FECHA-SEMANALEAS     PIC 9(08).                                        
173780 77 WS-OMITIR-RESI          PIC 9 VALUE 0.                                    
173782 77 WS-PROCESO-1-ARCH       PIC 9 VALUE 0.                                    
173788 77 WS-HEA-FEC-D            PIC 9 VALUE 0.                                    
173790 77 WS-HEA-SIS-D            PIC 9 VALUE 0.                                    
173792 77 WS-HEADER-CORRECTO-S    PIC 9 VALUE 0.                                    
173794 77 WS-TIT-ARCH-TRAI-ERROR  PIC X(12) VALUE SPACES.                           
173796 77 WS-COUNT-LINEA          PIC 9(04) VALUE 0.                                
173798 77 WS-HOJA                 PIC 99 VALUE 0.                                   
173800 77 TOTAL-TOTAL-EAS         PIC 9(13)V99 VALUE 0.                             
173900 77 WS-ERROR-TRAILER        PIC 9      VALUE 0.                               
173950                                                                              
174000 77 WS-1VEZ-LEE-FECH-B02    PIC 9 VALUE 0.                                    
174050 77 WS-NO-PROCESO           PIC 9 VALUE 0.                                    
174100 77 WS-FIN-DIARIO           PIC 9 VALUE 0.                                    
174150 77 WS-FIN-SEMANAL          PIC 9 VALUE 0.                                    
174200 77 WS-NOPROC-ERR-TRAI      PIC 9 VALUE 0.                                    
174220 77 WS-OMITIR-ECMS          PIC 9 VALUE 0.                                    
174240                                                                              
174250*FIN EASF5                                                                    
174510******************************************************************            
175010* AREA DE ENCABEZADOS PARA EL REPORTE DEL P400.                               
175510******************************************************************            
176010 01 TIT1.                                                                     
176510    02  FILLER              PIC X(02) VALUE SPACES.                           
177010    02  ID-REP              PIC X(27) VALUE                                   
177510                            "S500/P400/000DISPERSION-TAR".                    
178010    02  FILLER              PIC X(25) VALUE SPACES.                           
178510    02  FILLER              PIC X(22) VALUE                                   
179010         "CUENTA MAESTRA BANAMEX".                                            
179510    02  FILLER              PIC X(32) VALUE SPACES.                           
180010    02  FILLER              PIC X(09) VALUE "PROCESO: ".                      
180510    02  ANO-REP             PIC 9(04).                                        
181010    02  FILLER              PIC X(01) VALUE "/".                              
181510    02  MES-REP             PIC 9(02).                                        
182010    02  FILLER              PIC X(01) VALUE "/".                              
182510    02  DIA-REP             PIC 9(02).                                        
183010    02  FILLER              PIC X(04) VALUE SPACES.                           
183510 01 TIT2.                                                                     
184510    02  ANO-MAQ             PIC 9(04).                                        
185010    02  FILLER              PIC X(01) VALUE "/".                              
185510    02  MES-MAQ             PIC 9(02).                                        
186010    02  FILLER              PIC X(01) VALUE "/".                              
186510    02  DIA-MAQ             PIC 9(02).                                        
187010    02  FILLER              PIC X(02) VALUE SPACES.                           
187510    02  HORA-MAQ            PIC 9(02).                                        
188010    02  FILLER              PIC X(01) VALUE ":".                              
188510    02  MINU-MAQ            PIC 9(02).                                        
189010    02  FILLER              PIC X(17) VALUE SPACES.                           
189510    02  FILLER              PIC X(33) VALUE                                   
190010        "DISPERSION DE MOVTOS DE TARJETAS ".                                  
190510    02 TIT2-LEYINTER        PIC X(09) VALUE SPACES.                           
191010    02 TIT2-ANO             PIC 9(04).                                        
191510    02 FILLER               PIC X     VALUE "-".                              
192010    02 TIT2-MES             PIC 9(02).                                        
192510    02 FILLER               PIC X     VALUE "-".                              
193010    02 TIT2-DIA             PIC 9(02).                                        
193100    02 FILLER               PIC X(20) VALUE SPACES.                           
193200    02 FILLER               PIC X(06) VALUE                                   
193300       "HOJA :".                                                              
193400    02 NUM-HOJA             PIC 99.                                           
193510    02 FILLER               PIC X(16) VALUE SPACES.                           
194010 01 TIT3.                                                                     
194510    02  FILLER              PIC X(06) VALUE SPACES.                           
195010    02  FILLER              PIC X(06) VALUE "C.S.I.".                         
195510    02  FILLER              PIC X(31) VALUE SPACES.                           
196010    02  FILLER              PIC X(21) VALUE                                   
196510        "MOVIMIENTOS CONTABLES".                                              
197010    02  FILLER              PIC X(30) VALUE SPACES.                           
197510    02  FILLER              PIC X(24) VALUE                                   
198010        "MOVIMIENTOS NO CONTABLES".                                           
198510    02  FILLER              PIC X(14) VALUE SPACES.                           
199010 01 TIT4.                                                                     
199510    02  FILLER              PIC X(38) VALUE SPACES.                           
200010    02  FILLER              PIC X(21) VALUE "SALIDAS".                        
200510    02  FILLER              PIC X(33) VALUE "ENTRADAS".                       
201010    02  FILLER              PIC X(21) VALUE "SALIDAS".                        
201510    02  FILLER              PIC X(8)  VALUE "ENTRADAS".                       
201560 01 TIT5.                                                                     
201610    02  FILLER              PIC X(02) VALUE SPACES.                           
201660    02  ID-REP-02           PIC X(50) VALUE                                   
201710           "REEMBOLSOS RECIBIDOS SIN AFECTACION AL S028 :".                   
201760    02  FILLER              PIC X(69) VALUE SPACES.                           
202010/                                                                             
202510 01 DETALLE.                                                                  
203010    02  FILLER              PIC X(02) VALUE SPACES.                           
203510    02  NOMBRE-CSI          PIC X(30).                                        
204010    02  TOT-SAL-CON-REP     PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
204510    02  TOT-ENT-CON-REP     PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                      
205010    02  TOT-SAL-NOCON-REP   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205510    02  TOT-ENT-NOCON-REP   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                           
205600                                                                              
205610 01 DETALLE-02.                                                               
205620    02  FILLER              PIC X(04) VALUE " ".                              
205630    02  CONCEPTO-02         PIC X(30).                                        
205640    02  WS-DET02-NUM        PIC ZZZ,ZZZ,ZZ9.                                  
205641                                                                              
205642 01 DETALLE-03.                                                               
205643    02  FILLER              PIC X(02) VALUE SPACES.                           
205644    02  NOMBRE-CSI-02       PIC X(30).                                        
205645    02  TOT-SAL-CON-REP-M   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205646    02  TOT-ENT-CON-REP-M   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                      
205647    02  TOT-SAL-NOCON-REP-M PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205648    02  TOT-ENT-NOCON-REP-M PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                           
205650                                                                              
205670 01 DETALLE-04.                                                               
205690    02  FILLER              PIC X(02) VALUE SPACES.                           
205710    02  NOMBRE-CSI-03       PIC X(30).                                        
205730    02  TOT-SAL-CON-REP-V   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205750    02  TOT-ENT-CON-REP-V   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                      
205770    02  TOT-SAL-NOCON-REP-V PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205790    02  TOT-ENT-NOCON-REP-V PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                           
205810                                                                              
205830 01 DETALLE-05.                                                               
205850    02  FILLER              PIC X(02) VALUE SPACES.                           
205870    02  NOMBRE-CSI-04       PIC X(30).                                        
205890    02  TOT-SAL-CON-REP-S   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205910    02  TOT-ENT-CON-REP-S   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                      
205930    02  TOT-SAL-NOCON-REP-S PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                       
205950    02  TOT-ENT-NOCON-REP-S PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                           
205970                                                                              
206010 01 GUIONES.                                                                  
206510    02  FILLER              PIC X(31) VALUE SPACES.                           
207010    02  FILLER              PIC X(19) VALUE ALL "-".                          
207510    02  FILLER              PIC X(05) VALUE SPACES.                           
208010    02  FILLER              PIC X(19) VALUE ALL "-".                          
208510    02  FILLER              PIC X(11) VALUE SPACES.                           
209010    02  FILLER              PIC X(19) VALUE ALL "-".                          
209510    02  FILLER              PIC X(05) VALUE SPACES.                           
210010    02  FILLER              PIC X(19) VALUE ALL "-".                          
210510    02  FILLER              PIC X(04) VALUE SPACES.                           
211010 01 TOTALES.                                                                  
211510    02  FILLER               PIC X(02) VALUE SPACES.                          
212010    02  FILLER               PIC X(29) VALUE "     TOTALES".                  
212510    02  TOTTOT-SAL-CON-REP   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                     
213010    02  TOTTOT-ENT-CON-REP   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(11).                    
213510    02  TOTTOT-SAL-NOCON-REP PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                     
214010    02  TOTTOT-ENT-NOCON-REP PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                         
214060                                                                              
214110 01 TOTALES-02.                                                               
214160    02  FILLER                 PIC X(02) VALUE SPACES.                        
214210    02  FILLER                 PIC X(29) VALUE "     TOTALES".                
214260    02  TOTTOT-SAL-CON-REP-S   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                   
214310    02  TOTTOT-ENT-CON-REP-S   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(11).                  
214360    02  TOTTOT-SAL-NOCON-REP-S PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                   
214410    02  TOTTOT-ENT-NOCON-REP-S PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                       
214510*                                                                             
215010 01 REG-MOVS-TB.                                                              
221010*      03 TB-CVE-TRANS            PIC 9(02).                                  
221012      03 TB-CVE-TRANS            PIC 9(04).                                   
223010      03 TB-IMP-BRUTO            PIC 9(10)V99 COMP.                           
223510      03 TB-IMP-COMIS            PIC 9(10)V99 COMP.                           
224010      03 TB-IMP-NETO             PIC 9(10)V99 COMP.                           
225010      03 TB-SUCURSAL             PIC 9(04).                                   
225012*INI-STEFANINI EAS F3                                                         
225014      03 TB-IMP-POSTEO           PIC 9(10)V99 COMP.                           
225016      03 TB-IMP-AUTORI           PIC 9(10)V99 COMP.                           
225018      03 TB-TARJETA              PIC 9(16).                                   
225020      03 TB-CONTRATO             PIC 9(14).                                   
225022      03 TB-SEQLINEA             PIC 9(06).                                   
225024*FIN-STEFANINI EAS F3                                                         
226010                                                                              
226012 01  REG-MOVS-6611.                                                           
226014     03 WS-BD04-SUCP             PIC 9(04).                                   
226016     03 WS-BD04-CTO              PIC 9(12).                                   
226018     03 WS-BD04-CSI              PIC 9(02).                                   
226020     03 WS-ES-6611               PIC 9.                                       
230510                                                                              
230512 01 WKS-R02-IMP-MONORI.                                                       
230514      03 WKS-IMP-MONORI-DESP     PIC 9(02)    VALUE ZEROS.                    
230516      03 WKS-R02-IMP-MONORI-REC  PIC 9(08)V99 VALUE ZEROS.                    
230518                                                                              
230520*INI-STEFANINI EAS F3                                                         
230522 01 DETALLE-06.                                                               
230524    02  FILLER                  PIC X(02) VALUE SPACES.                       
230526    02  NOMBRE-CSI-05           PIC X(30).                                    
230528    02  TOT-EAS-SAL-CON-REP     PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230530    02  TOT-EAS-ENT-CON-REP     PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                  
230532    02  TOT-EAS-SAL-NOCON-REP   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230534    02  TOT-EAS-ENT-NOCON-REP   PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                       
230536                                                                              
230538 01 DETALLE-07.                                                               
230540    02  FILLER                  PIC X(02) VALUE SPACES.                       
230542    02  NOMBRE-CSI-06           PIC X(30).                                    
230544    02  TOT-EAS-SAL-CON-REP-M   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230546    02  TOT-EAS-ENT-CON-REP-M   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                  
230548    02  TOT-EAS-SAL-NOCON-REP-M PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230550    02  TOT-EAS-ENT-NOCON-REP-M PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                       
230552                                                                              
230554 01 DETALLE-08.                                                               
230556    02  FILLER                  PIC X(02) VALUE SPACES.                       
230558    02  NOMBRE-CSI-07           PIC X(30).                                    
230560    02  TOT-EAS-SAL-CON-REP-V   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230562    02  TOT-EAS-ENT-CON-REP-V   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                  
230564    02  TOT-EAS-SAL-NOCON-REP-V PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230566    02  TOT-EAS-ENT-NOCON-REP-V PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                       
230568                                                                              
230570 01 DETALLE-09.                                                               
230572    02  FILLER                  PIC X(02) VALUE SPACES.                       
230574    02  NOMBRE-CSI-08           PIC X(30).                                    
230576    02  TOT-EAS-SAL-CON-REP-S   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230578    02  TOT-EAS-ENT-CON-REP-S   PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(12).                  
230580    02  TOT-EAS-SAL-NOCON-REP-S PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(6).                   
230582    02  TOT-EAS-ENT-NOCON-REP-S PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                       
230584                                                                              
230586 01 TOTALES-EAS.                                                              
230588    02  FILLER                   PIC X(02) VALUE SPACES.                      
230590    02  FILLER                   PIC X(29) VALUE "     TOTALES".              
230592    02  TOTTOT-EAS-SAL-CON-REP   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                 
230594    02  TOTTOT-EAS-ENT-CON-REP   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(11).                
230596    02  TOTTOT-EAS-SAL-NOCON-REP PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).                 
230598    02  TOTTOT-EAS-ENT-NOCON-REP PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                     
230600                                                                              
230602 01 TOTALES-02-EAS.                                                           
230604    02  FILLER                     PIC X(02) VALUE SPACES.                    
230606    02  FILLER                     PIC X(29) VALUE "     TOTALES".            
230608    02  TOTTOT-EAS-SAL-CON-REP-S   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).               
230610    02  TOTTOT-EAS-ENT-CON-REP-S   PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(11).              
230612    02  TOTTOT-EAS-SAL-NOCON-REP-S PIC ZZZZ,ZZZ,ZZZ,ZZ9.99B(5).               
230614    02  TOTTOT-EAS-ENT-NOCON-REP-S PIC ZZZZ,ZZZ,ZZZ,ZZ9.99.                   
230616*FIN-STEFANINI EAS F2                                                         
230618                                                                              
231010******************************************************************            
231510*                      TABLA DE CSI'S                            *            
232010******************************************************************            
232510*                                                                             
233010 01  WS-TABLA-NOMCSIS.                                                        
233510     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
234010     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
234510     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
235010     03 FILLER        PIC X(15) VALUE "MONTERREY      ".                      
235510     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
236010     03 FILLER        PIC X(15) VALUE "LEON-GUA-HER   ".                      
236510     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
237010     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
237510     03 FILLER        PIC X(15) VALUE "NO EXISTE      ".                      
238010     03 FILLER        PIC X(15) VALUE "VDM-MOR        ".                      
238510 01  WS-TABLA-NOMCSIS-R REDEFINES WS-TABLA-NOMCSIS.                           
239010     03 WS-NOM-CSI    PIC X(15) OCCURS 10.                                    
239510*****************************************************************             
240010*  REG. P/LEER ARCH. S500/FILE/S500/10/10/TBINTER/DDMMAA    *                 
240510*****************************************************************             
241010 01  REG-TBINTER.                                                             
241510     03 REG-TBINTER-CTL.                                                      
242010        05 WS-INTCTL-ID             PIC X(11).                                
242510        05 WS-INTCTL-IDR REDEFINES WS-INTCTL-ID.                              
243010           08 WS-INTCTL-ID-UNO      PIC X(04).                                
243510           08 WS-INTCTL-ID-DOS      PIC X(07).                                
244010        05 WS-INTCTL-FECHA          PIC 9(06).                                
244510        05 WS-INTCTL-FECHA-R REDEFINES WS-INTCTL-FECHA.                       
245010           08 WS-INTCTL-DD          PIC 99.                                   
245510           08 WS-INTCTL-MM          PIC 99.                                   
246010           08 WS-INTCTL-AA          PIC 99.                                   
246510        05 WS-INTCTL-SISORIG        PIC 9(03).                                
247010        05 FILLER                   PIC X(172).                               
247510     03 REG-TBINTER-DATA REDEFINES REG-TBINTER-CTL.                           
248010        05 WS-INTCVE-TRAN              PIC 9(02).                             
248510        05 WS-INTNUM-TARJETA           PIC 9(16).                             
249010        05 WS-INTNUM-TARJ-R REDEFINES WS-INTNUM-TARJETA.                      
249510           07 WS-INTCTA-TARJ           PIC 9(06).                             
249600              88 W88-INTBIN-TARJPREP   VALUE 554492.                          
250010           07 WS-INTNUM-CTE            PIC 9(09).                             
250510           07 WS-INTDIG-CTE            PIC 9(01).                             
251010        05 WS-INTIMP-BRUTO             PIC 9(12)V99.                          
251020*INI-STEFANINI TIPO DE CAMBIO                                                 
251510        05 WS-INTTC-BANXICO            PIC 9(06)V9(06).                       
252010        05 WS-INTTC-VALMER             PIC 9(06)V9(06).                       
252020*FIN-STEFANINI TIPO DE CAMBIO                                                 
252510        05 WS-INTFECHA-MOVIMAMD        PIC 9(06).                             
253010        05 WS-INTSUCURSAL              PIC 9(04).                             
253510        05 WS-INTREFEREN-NAL           PIC 9(05).                             
254010        05 WS-INTFECHA-PROC            PIC 9(04).                             
254510***        FORMATO FECHA < MMDD >      ***                                    
255010        05 WS-INTCVE-AUTORIZA          PIC X(01).                             
255510        05 WS-INTDESCRIP-NEG           PIC X(20).                             
256010        05 WS-INTPOBLACION             PIC X(15).                             
256510        05 WS-INTCVE-CONFIRLIN         PIC 9(01).                             
257010***   0 = NO SE MANDO  1 = SE RECIBIO CONFIRMACION                            
257510        05 FILLER                      PIC X(01).                             
258010        05 WS-INTCVE-PAIS              PIC X(03).                             
258510***        CVE PAIS = MEX              ***                                    
259010        05 WS-INTIMP-DLLS              PIC 9(8)V99.                           
259510        05 WS-INTREFEREN-INT           PIC 9(23).                             
260010        05 WS-INTREF-INT REDEFINES WS-INTREFEREN-INT.                         
260510           07 WS-INTMICRO-FILM         PIC 9(01).                             
261010           07 WS-INTBCA-ACEPT          PIC 9(06).                             
261510           07 WS-INTFECHA-CAPT         PIC 9(04).                             
262010           07 WS-INTLOCALIZA-FILM.                                            
262510              09 WS-INTNUM-BATCH       PIC 9(05).                             
263010              09 WS-INTNUM-BOLETA      PIC 9(06).                             
263510              09 WS-INTDIGITO-VERIF    PIC 9(01).                             
264010        05 WS-INTCODIGO-MONEDA         PIC 9(03).                             
264510***        PESOS MEXICANOS CVE = 480   ***                                    
265010        05 WS-INTNUM-CONTRATO          PIC 9(14).                             
265510        05 WS-INTREF-SEQLINEA          PIC 9(06).                             
265560        05 WS-ID-NEGOCIO               PIC 9(08).                             
265570*INI-STEFANINI TIPO DE CAMBIO                                                 
265580        05 WS-INT-MARK-UP-EMI          PIC 9(04)V9(04).                       
265600        05 FILLER                      PIC X(04).                             
265610*FIN-STEFANINI TIPO DE CAMBIO                                                 
266010     03 REG-TBINTER-TRAIL-ENT REDEFINES REG-TBINTER-CTL.                      
266510        05 WS-INTRAIL-TIPREG-E         PIC X(01).                             
267010        05 WS-INTRAIL-NUMREG-E         PIC 9(06).                             
267510        05 WS-INTRAIL-IMPBRUTO-E       PIC 9(12)V99.                          
268010        05 WS-INTRAIL-IMPCOMIS-E       PIC 9(12)V99.                          
268510        05 WS-INTRAIL-IMPNETO-E        PIC 9(12)V99.                          
269010        05 FILLER                      PIC X(143).                            
269510                                                                              
269520 01  REG-TBINTER-ANT.                                                         
269540     03 REG-TBINTER-CTL-ANT.                                                  
269560        05 FILLER                      PIC X(168).                            
269580     03 REG-TBINTER-DATA-ANT REDEFINES REG-TBINTER-CTL-ANT.                   
269600        05 FILLER                      PIC X(152).                            
269620        05 WS-INTNUM-CONTRATO-ANT      PIC 9(10).                             
269640        05 WS-INTREF-SEQLINEA-ANT      PIC 9(06).                             
269660     03 REG-TBINTER-TRAIL-ENT-ANT REDEFINES REG-TBINTER-CTL-ANT.              
269680        05 FILLER                      PIC X(168).                            
269700                                                                              
270010*****************************************************************             
270510*  REG. P/GRABAR ARCH. S500/FILE/S500/10/XX/MOVSTBINTER/DDMMAA  *             
271010*****************************************************************             
271510 01  REG-TBINTER-S.                                                           
272010     03 REG-TBINTER-CTL-S.                                                    
272510        05 WS-INTCTL-ID-S           PIC X(11).                                
273010        05 WS-INTCTL-FECHA-S        PIC 9(06).                                
273510        05 CA-INTCTL-FECHA-S        PIC 9(06).                                
274010        05 WS-INTCTL-SISORIG-S      PIC 9(03).                                
274510        05 WS-INTCTL-CSI-S          PIC 9(02).                                
275010        05 WS-INTTIP-ARCH-S         PIC 9(01).                                
275510        05 WS-INTCTL-PROCESO-S      PIC X.                                    
276010        05 FILLER                   PIC X(210).                               
276510     03   REG-TBINTER-CTL-SR  REDEFINES  REG-TBINTER-CTL-S.                   
277010        05 FILLER                   PIC X(17).                                
277510        05 WS-INTCTL-SISORIG-SEM    PIC 9(03).                                
278010        05 WS-INTCTL-CSI-SEM        PIC 9(02).                                
278510        05 WS-INTTIP-ARCH-SEM       PIC 9(01).                                
279010        05 FILLER                   PIC X(217).                               
279510     03 REG-TBINTER-DATA-S REDEFINES REG-TBINTER-CTL-S.                       
280010*        05 WS-INTCVE-TRAN-S            PIC 9(02).                            
280012        05 WS-INTCVE-TRAN-S            PIC 9(04).                             
280510        05 WS-INTNUM-TARJETA-S         PIC 9(16).                             
281010        05 WS-INTNUM-TARJ-SR REDEFINES WS-INTNUM-TARJETA-S.                   
281510           07 WS-INTCTA-TARJ-S         PIC 9(06).                             
282010           07 WS-INTNUM-CTE-S          PIC 9(09).                             
282510           07 WS-INTDIG-CTE-S          PIC 9(01).                             
283010        05 WS-INTNUM-CONTRATO-S        PIC 9(12) COMP.                        
283510        05 WS-INTIMP-BRUTO-S           PIC 9(12)V99.                          
284010        05 WS-INTIMP-COMIS-S           PIC 9(12).                             
284510        05 WS-INTIMP-NETO-S            PIC 9(12).                             
285010        05 WS-INTFECHA-MOVIMAMD-S      PIC 9(06) COMP.                        
285510        05 WS-INTSUCURSAL-S            PIC 9(04) COMP.                        
286010        05 WS-INTREFEREN-NAL-S         PIC 9(05).                             
286510        05 WS-INTFECHA-PROC-S          PIC 9(04).                             
287010        05 WS-INTCVE-AUTORIZA-S        PIC X(01).                             
287510        05 WS-INTDESCRIP-NEG-S         PIC X(20).                             
288010*        05 WS-INTPOBLACION-S           PIC X(15).                            
288012        05 WS-INTPOBLACION-S           PIC X(20).                             
288510        05 WS-INTCVE-PAIS-S            PIC X(03).                             
289010***        CVE PAIS = MEX              ***                                    
289510        05 WS-INTIMP-DLLS-S            PIC 9(8)V99.                           
290010        05 WS-INTREFEREN-INT-S         PIC 9(23).                             
290510        05 WS-INTREF-INT-S REDEFINES WS-INTREFEREN-INT-S.                     
291010           07 WS-INTMICRO-FILM-S       PIC 9(01).                             
291510           07 WS-INTBCA-ACEPT-S        PIC 9(06).                             
292010           07 WS-INTFECHA-CAPT-S       PIC 9(04).                             
292510           07 WS-INTLOCALIZA-FILM-S.                                          
293010              09 WS-INTNUM-BATCH-S     PIC 9(05).                             
293510              09 WS-INTNUM-BOLETA-S    PIC 9(06).                             
294010              09 WS-INTDIGITO-VERIF-S  PIC 9(01).                             
294510        05 WS-INTCODIGO-MONEDA-S       PIC 9(03).                             
295010***        PESOS MEXICANOS CVE = 480   ***                                    
295510        05 WS-INTCVE-CONFIRLIN-S       PIC 9(01).                             
296010***  0 = NO SE MANDO  1 = SE RECIBIO CONFIRMACION                             
296510        05 WS-INTREF-SEQLINEA-S        PIC 9(06) COMP.                        
297010        05 WS-INTTAR-CAJ-S             PIC 9(01).                             
297510***  1 = TARJETA      2 = CAJERO                                              
297610        05 WS-ID-NEGOCIO-S              PIC 9(08).                            
297620*INI-STEFANINI TIPO DE CAMBIO                                                 
297630        05 WS-INT-TC-BANXICO-S          PIC 9(05)V9(06).                      
297640        05 WS-INT-MARK-UP-EMI-S         PIC 9(04)V9(04).                      
297650        05 WS-INT-TC-VALMER-S           PIC 9(05)V9(06).                      
297660*        05 FILLER                       PIC X(46).                           
297670*FIN-STEFANINI TIPO DE CAMBIO                                                 
297672        05 WS-INTIMP-AUTORIZ-S         PIC 9(12)V99.                          
297674        05 WS-INT-S111-O-EAS-S         PIC 9(02).                             
297676*** 01 = S111     02 = EAS                                                    
297700        05 WS-INTINSTITUCION-ID-S      PIC 9(04).                             
297750        05 WS-INTAPLICACION-ID-S       PIC 9(04).                             
297800        05 WS-INTAUTH-CODE-S           PIC X(06).                             
297850*        05 FILLER                      PIC X(23).                            
297900        05 FILLER                      PIC X(9).                              
298010     03 REG-TBINTER-TRAIL-S REDEFINES REG-TBINTER-CTL-S.                      
298510        05 WS-INTRAIL-TIPREG-S         PIC X(01).                             
299010        05 WS-INTRAIL-NUMREG-S         PIC 9(06)    COMP.                     
299510        05 WS-INTRAIL-IMPBRUTO-S       PIC 9(12)V99 COMP.                     
300010        05 WS-INTRAIL-IMPCOMIS-S       PIC 9(12)V99 COMP.                     
300510        05 WS-INTRAIL-IMPNETO-S        PIC 9(12)V99 COMP.                     
301010        05 FILLER                      PIC X(215).                            
301510                                                                              
301515*INI-STEFANINI EAS                                                            
301520*****************************************************************             
301525*  REG. P/LEER ARCH. EAS    *                                                 
301530*****************************************************************             
301535 01  REG-EAS.                                                                 
301540     03 REG-EAS-CTL                    PIC X(500).                            
301545     03 REG-EAS-HEADER REDEFINES REG-EAS-CTL.                                 
301550        05 EAS-R01-SISTEMA             PIC 9(06).                             
301555        05 EAS-R01-FECHA               PIC 9(06).                             
301556        05 EAS-R01-FECHA-R REDEFINES EAS-R01-FECHA.                           
301557           08 EAS-INTCTL-AA              PIC 99.                              
301558           08 EAS-INTCTL-MM              PIC 99.                              
301559           08 EAS-INTCTL-DD              PIC 99.                              
301560        05 FILLER                      PIC X(488).                            
301565                                                                              
301570     03 REG-EAS-DET REDEFINES REG-EAS-CTL.                                    
301575        05 EAS-R02-CSI                 PIC 9(02).                             
301580        05 EAS-R02-CVETRANS            PIC 9(04).                             
301585        05 EAS-R02-TARJETA             PIC 9(16).                             
301590        05 EAS-R02-IMP-POSTEO          PIC 9(12)V99.                          
301595        05 EAS-R02-IMP-AUT             PIC 9(12)V99.                          
301600        05 EAS-R02-FECHA-ECMS          PIC 9(06).                             
301605        05 EAS-R02-FECHA-VALOR         PIC 9(06).                             
301610        05 EAS-R02-REFERENCIA          PIC 9(12).                             
301615        05 EAS-R02-NEG                 PIC X(40).                             
301616        05 EAS-R02-NEG-R REDEFINES EAS-R02-NEG.                               
301617           08 EAS-R02-DESCRIP          PIC X(20).                             
301618           08 EAS-R02-POBLAC           PIC X(20).                             
301620        05 EAS-R02-IMP-MONORI          PIC 9(10)V99.                          
301625        05 EAS-R02-REF-INT             PIC X(23).                             
301630        05 EAS-R02-REF-INT-R REDEFINES EAS-R02-REF-INT PIC 9(23).             
301635        05 EAS-R02-MON-ORI             PIC 9(03).                             
301640        05 EAS-R02-SUC                 PIC 9(04).                             
301645        05 EAS-R02-CONTRATO            PIC 9(12).                             
301650        05 EAS-R02-CVE-NEG             PIC 9(08).                             
301655        05 EAS-R02-TCAM-BANX           PIC 9(05)V9(06).                       
301660        05 EAS-R02-TCAM-COM            PIC 9(04)V9(04).                       
301665        05 EAS-R02-TCAM-VALM           PIC 9(05)V9(06).                       
301666        05 EAS-R02-INST-ID             PIC 9(04).                             
301668        05 EAS-R02-APPL-ID             PIC 9(04).                             
301670        05 EAS-R02-AUTH-CODE           PIC X(06).                             
301672*        05 FILLER                      PIC X(294).                           
301674        05 FILLER                      PIC X(280).                            
301676                                                                              
301680     03 REG-EAS-TRL REDEFINES REG-EAS-CTL.                                    
301685        05 EAS-R03-TIPREG              PIC X(01).                             
301690        05 EAS-R03-TOTREG              PIC 9(08).                             
301695        05 EAS-R03-TOTIMP              PIC 9(16)V99.                          
301700        05 FILLER                      PIC X(473).                            
301705                                                                              
301710*****************************************************************             
301715*  REG. P/LEER ARCH. EAS    *                                                 
301720*****************************************************************             
301725 01  REG-PROC.                                                                
301730     03 REG-PROC-CTL                   PIC X(880).                            
301735     03 REG-PROC-HEADER REDEFINES REG-PROC-CTL.                               
301740        05 PROC-R01-TIPREG             PIC X(01).                             
301745        05 PROC-R01-NODO               PIC 9(02).                             
301750        05 PROC-R01-FECHA              PIC 9(06).                             
301755        05 PROC-R01-CTE                PIC 9(12).                             
301760        05 PROC-R01-SEC                PIC 9(04).                             
301765        05 PROC-R01-DESC               PIC X(36).                             
301770        05 FILLER                      PIC X(819).                            
301775                                                                              
301780     03 REG-PROC-DET REDEFINES REG-PROC-CTL.                                  
301785        05 PROC-R02-TIPREG             PIC X(01).                             
301790        05 PROC-R02-SECDET             PIC 9(08).                             
301795        05 PROC-R02-SUCORI             PIC 9(04).                             
301800        05 PROC-R02-CAJORI             PIC 9(02).                             
301805        05 PROC-R02-AUT                PIC 9(08).                             
301810        05 PROC-R02-CVETRANS           PIC 9(04).                             
301815        05 PROC-R02-TIPMOV             PIC 9(01).                             
301820        05 PROC-R02-TIPMACC            PIC 9(02).                             
301825        05 PROC-R02-CONTRATO           PIC 9(16).                             
301830        05 PROC-R02-IMPORTE            PIC 9(14)V99.                          
301835        05 PROC-R02-MONEDA             PIC 9(03).                             
301840        05 PROC-R02-REF                PIC 9(12).                             
301845        05 PROC-R02-FORZADO            PIC 9(01).                             
301850        05 PROC-R02-FORVAR             PIC X(802).                            
301855                                                                              
301860     03 REG-PROC-TRL REDEFINES REG-PROC-CTL.                                  
301865        05 PROC-R03-TIPREG             PIC X(01).                             
301870        05 PROC-R03-TOTABO             PIC 9(08).                             
301875        05 PROC-R03-IMPABO             PIC 9(16)V99.                          
301880        05 PROC-R03-TOTCAR             PIC 9(08).                             
301885        05 PROC-R03-IMPCAR             PIC 9(16)V99.                          
301890        05 PROC-R03-TNCONT             PIC 9(08).                             
301895        05 FILLER                      PIC X(819).                            
301900                                                                              
301905*FIN-STEFANINI EAS                                                            
301910                                                                              
301911****************************************************************              
301912*  REG. P/LEER ARCH. EAS  SEMANAL  *                                          
301914****************************************************************              
301916 01  REG-EAS-SEM.                                                             
301918     03 REG-EAS-SEM-CTL                   PIC X(500).                         
301920     03 REG-EAS-SEM-HEADER REDEFINES REG-EAS-SEM-CTL.                         
301922        05 EAS-R01S-SISTEMA               PIC X(06).                          
301924        05 EAS-R01S-FECHA                 PIC 9(06).                          
301926        05 EAS-R01S-FECHA-R REDEFINES EAS-R01S-FECHA.                         
301928           08 EAS-R01S-INTCTL-AA          PIC 99.                             
301930           08 EAS-R01S-INTCTL-MM          PIC 99.                             
301932           08 EAS-R01S-INTCTL-DD          PIC 99.                             
301934        05 FILLER                         PIC X(488).                         
301936                                                                              
301938     03 REG-EAS-SEM-DET REDEFINES REG-EAS-SEM-CTL.                            
301940        05 EAS-R02S-CSI                   PIC 9(02).                          
301942        05 EAS-R02S-CVETRANS              PIC 9(04).                          
301944        05 EAS-R02S-TARJETA               PIC 9(16).                          
301946        05 EAS-R02S-IMP-AUT               PIC 9(12)V99.                       
301948        05 EAS-R02S-FECHA-VALOR           PIC 9(06).                          
301950        05 EAS-R02S-SUC                   PIC 9(04).                          
301952        05 EAS-R02S-CONTRATO              PIC 9(12).                          
301954        05 FILLER                         PIC X(442).                         
301956                                                                              
301958     03 REG-EAS-SEM-TRL REDEFINES REG-EAS-SEM-CTL.                            
301960        05 EAS-R03S-TIPREG                PIC X(01).                          
301962        05 EAS-R03S-TOTREG                PIC 9(08).                          
301964        05 EAS-R03S-TOTIMP                PIC 9(16)V99.                       
301966        05 FILLER                         PIC X(473).                         
301968                                                                              
301970*****************************************************************             
301972*  REG. P/LEER ARCH. COMBINADO DE DETALLES                      *             
301974*****************************************************************             
301976 01  REG-TBINTER-B.                                                           
301978   03 REG-TBINTER-DATA-B.                                                     
301980      05 WS-INTCVE-TRAN-B              PIC 9(02).                             
301982      05 WS-INTNUM-TARJETA-B           PIC 9(16).                             
301984      05 WS-INTNUM-TARJ-R-B REDEFINES WS-INTNUM-TARJETA-B.                    
301986         07 WS-INTCTA-TARJ-B           PIC 9(06).                             
301988            88 MOVTINT-BIN-DPAGO            VALUE 854873.                     
301990            88 MOVTINT-BIN-PERFIL-EJECUTIVO VALUE 525678.                     
301992            88 MOVTINT-BIN-TARJ-SKY         VALUE 602089.                     
301994            88 MOVTINT-BIN-VISA-CLASICA     VALUE 520698.                     
301996            88 MOVTINT-BIN-VISA-ORO         VALUE 520694.                     
301998            88 MOVTINT-BIN-MASTERCARD-CLA   VALUE 441545.                     
302000            88 MOVTINT-BIN-MASTERCARD-ORO   VALUE 441549.                     
302002            88 MOVTINT-BIN-CTASREL          VALUE 602089,520698,              
302004                                           520694,441545,441549.              
302006            88 MOVTINT-BIN-TARJPREP         VALUE 554492.                     
302008            88 MOVTINT-BIN-CTAMAE-DLS       VALUE 404313, 522912.             
302010            88 W88-INTBIN-TARJPREP-B        VALUE 554492.                     
302012         07 WS-INTNUM-CTE-B            PIC 9(09).                             
302014         07 WS-INTDIG-CTE-B            PIC 9(01).                             
302016      05 WS-INTIMP-BRUTO-B             PIC 9(12)V99.                          
302018      05 WS-INTTC-BANXICO-B            PIC 9(06)V9(06).                       
302020      05 WS-INTTC-VALMER-B             PIC 9(06)V9(06).                       
302022      05 WS-INTFECHA-MOVIMAMD-B        PIC 9(06).                             
302024      05 WS-INTSUCURSAL-B              PIC 9(04).                             
302026      05 WS-INTREFEREN-NAL-B           PIC 9(05).                             
302028      05 WS-INTFECHA-PROC-B            PIC 9(04).                             
302030      05 WS-INTCVE-AUTORIZA-B          PIC X(01).                             
302032      05 WS-INTDESCRIP-NEG-B           PIC X(20).                             
302034      05 WS-INTPOBLACION-B             PIC X(15).                             
302036      05 WS-INTCVE-CONFIRLIN-B         PIC 9(01).                             
302038      05 FILLER                        PIC X(01).                             
302040      05 WS-INTCVE-PAIS-B              PIC X(03).                             
302042      05 WS-INTIMP-DLLS-B              PIC 9(8)V99.                           
302044      05 WS-INTREFEREN-INT-B           PIC 9(23).                             
302046      05 WS-INTREF-INT-B REDEFINES WS-INTREFEREN-INT-B.                       
302048         07 WS-INTMICRO-FILM-B         PIC 9(01).                             
302050         07 WS-INTBCA-ACEPT-B          PIC 9(06).                             
302052         07 WS-INTFECHA-CAPT-B         PIC 9(04).                             
302054         07 WS-INTLOCALIZA-FILM-B.                                            
302056            09 WS-INTNUM-BATCH-B       PIC 9(05).                             
302058            09 WS-INTNUM-BOLETA-B      PIC 9(06).                             
302060            09 WS-INTDIGITO-VERIF-B    PIC 9(01).                             
302062      05 WS-INTCODIGO-MONEDA-B         PIC 9(03).                             
302064      05 WS-INTNUM-CONTRATO-B          PIC 9(14).                             
302066      05 WS-INTREF-SEQLINEA-B          PIC 9(06).                             
302068      05 WS-ID-NEGOCIO-B               PIC 9(08).                             
302070      05 WS-INT-MARK-UP-EMI-B          PIC 9(04)V9(04).                       
302072      05 FILLER                        PIC X(312).                            
302074   03 REG-EAS-DATA-B REDEFINES REG-TBINTER-DATA-B.                            
302076      05 EAS-R0B-CSI                 PIC 9(02).                               
302078      05 EAS-R0B-CVETRANS            PIC 9(04).                               
302080      05 EAS-R0B-TARJETA             PIC 9(16).                               
302082      05 EAS-R0B-TARJETA-R-B REDEFINES EAS-R0B-TARJETA.                       
302084         07 EAS-R0B-TARJ-B           PIC 9(06).                               
302086            88 W88-EAS-R0B-TARJPREP-B VALUE 554492.                           
302088         07 EAS-R0B-NUMCTE-B            PIC 9(09).                            
302090         07 EAS-R0B-DIGCTE-B            PIC 9(01).                            
302092      05 EAS-R0B-IMP-POSTEO          PIC 9(12)V99.                            
302094      05 EAS-R0B-IMP-AUT             PIC 9(12)V99.                            
302096      05 EAS-R0B-FECHA-ECMS          PIC 9(06).                               
302098      05 EAS-R0B-FECHA-VALOR         PIC 9(06).                               
302100      05 EAS-R0B-REFERENCIA          PIC 9(12).                               
302102      05 EAS-R0B-NEG                 PIC X(40).                               
302104      05 EAS-R0B-NEG-R REDEFINES EAS-R0B-NEG.                                 
302106           08 EAS-R0B-DESCRIP          PIC X(20).                             
302108           08 EAS-R0B-POBLAC           PIC X(20).                             
302110      05 EAS-R0B-IMP-MONORI          PIC 9(10)V99.                            
302112      05 EAS-R0B-REF-INT             PIC X(23).                               
302114      05 EAS-R0B-REF-INT-R REDEFINES EAS-R0B-REF-INT PIC 9(23).               
302116      05 EAS-R0B-MON-ORI             PIC 9(03).                               
302118      05 EAS-R0B-SUC                 PIC 9(04).                               
302120      05 EAS-R0B-CONTRATO            PIC 9(12).                               
302122      05 EAS-R0B-CVE-NEG             PIC 9(08).                               
302124      05 EAS-R0B-TCAM-BANX           PIC 9(05)V9(06).                         
302126      05 EAS-R0B-TCAM-COM            PIC 9(04)V9(04).                         
302128      05 EAS-R0B-TCAM-VALM           PIC 9(05)V9(06).                         
302200      05 EAS-R0B-INST-ID             PIC 9(04).                               
302400      05 EAS-R0B-APPL-ID             PIC 9(04).                               
302600      05 EAS-R0B-AUTH-CODE           PIC X(06).                               
302800*      05 FILLER                      PIC X(294).                             
303000      05 FILLER                      PIC X(280).                              
303200   03 REG-EAS-S-DATA-B REDEFINES REG-TBINTER-DATA-B.                          
303400      05 EAS-S-R0B-CSI                 PIC 9(02).                             
303600      05 EAS-S-R0B-CVETRANS            PIC 9(04).                             
303800      05 EAS-S-R0B-TARJETA             PIC 9(16).                             
304000      05 EAS-S-R0B-TARJETA-R-B REDEFINES EAS-S-R0B-TARJETA.                   
304200         07 EAS-S-R0B-TARJ-B           PIC 9(06).                             
304400            88 W88-EAS-S-R0B-TARJPREP-B VALUE 554492.                         
304600         07 EAS-S-R0B-NUMCTE-B         PIC 9(09).                             
304800         07 EAS-S-R0B-DIGCTE-B         PIC 9(01).                             
305000      05 EAS-S-R0B-IMP-AUT             PIC 9(12)V99.                          
305200      05 EAS-S-R0B-FECHA-VALOR         PIC 9(06).                             
305400      05 EAS-S-R0B-SUC                 PIC 9(04).                             
305600      05 EAS-S-R0B-CONTRATO            PIC 9(12).                             
305800      05 FILLER                        PIC X(442).                            
306000   03 REG-EXTRA-DATA-B REDEFINES REG-TBINTER-DATA-B.                          
306200      05 FILLER                      PIC X(484).                              
306400      05 RENG-SORT                   PIC X(01).                               
306600      05 CONTRATO-SORT               PIC 9(14).                               
306800      05 ORIGEN-SIST                 PIC 9(01).                               
307000                                                                              
308510******************************************************************            
309010* P R O C E D U R E           D I V I  S I O N.                               
309510******************************************************************            
310010 PROCEDURE DIVISION USING WS-TAR-DS.                                          
310510************************************                                          
310530 DECLARATIVES.                                                                
310550 INTERRUPT-SECCION        SECTION  00.                                        
310570     USE AS INTERRUPT PROCEDURE.                                              
310590 INTERRUPT-BY-HI.                                                             
310610     DISALLOW  INTERRUPT.                                                     
310630     MOVE "I" TO W77-TIPO-DISP.                                               
310650                                                                              
310670     IF ATTRIBUTE  TASKVALUE OF MYSELF = 0                                    
310672        MOVE W77-REG-LEI       TO WS-HI-LEIDOS                                
310690        MOVE WS-MSG-AVANCE     TO WS-0101-TEXT-MSG                            
310710        PERFORM 70000050-MENSAJE                                              
310730     ELSE                                                                     
310750        MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-HI-NUMHI                    
310770        STRING "NUM HI ERRONEO ", WKS-HI-NUMHI                                
310790               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
310810        PERFORM 70000050-MENSAJE.                                             
310830                                                                              
310850      SET MYSELF (TASKVALUE)  TO ZERO.                                        
310870      MOVE "E" TO W77-TIPO-DISP.                                              
310890  END-INTERRUPT-BY-HI.                                                        
310910      ALLOW INTERRUPT.                                                        
310930  END DECLARATIVES.                                                           
311010                                                                              
311510******************************************************************            
312010******************************************************************            
312510* R U T I N A          P R I N C I P A L.                                     
313010******************************************************************            
313510******************************************************************            
314010 00000000-INICIO SECTION  01.                                                 
314510 00000000-PRINCIPAL.                                                          
314520     MOVE ATTRIBUTE HOSTNAME OF MYSELF TO WKS-NAME-HOST.                      
314530     MOVE 2              TO W77-USO-LIBLJ.                                    
314540     MOVE "P400"         TO WS-0101-PASO-MSG B91-IDPROG.                      
314550     MOVE "25MTP011"     TO WS-0101-MTP-MSG  W77-S000-MY-VERSION.             
314560     MOVE "S500P400"     TO W77-S000-MY-ID                                    
314570                                                                              
315010     PERFORM 10000000-LIBRERIAS THRU 10000000-EXIT.                           
315510     PERFORM 20000000-OPEN      THRU 20000000-EXIT.                           
315520**INI-EASF5                                                                   
315540     IF WS-TAR-DS = "TARJETADIA" OR "TARJETASEM"                              
315560        PERFORM 30000000-PROCESO   THRU 30000000-EXIT.                        
315580**FIN-EASF5                                                                   
315600*INI-STEFANINI EAS                                                            
315700*     IF WS-TAR-DS = "TARJETADIA" OR "TARJETASEM"                             
316010*        PERFORM 50000000-PROCESOS  THRU 50000000-EXIT                        
316110*        PERFORM 70000000-CIERRO    THRU 70000000-EXIT.                       
316120*     ELSE                                                                    
316125*INI-STEFANINI EAS F3                                                         
316130*     IF WS-TAR-DS = "EASDIARIO "                                             
316140*        PERFORM 60000000-PROCESO-EAS THRU 60000000-EXIT                      
316150*        UNTIL WS-FIN-PROGRAMA = 1.                                           
316152*INI-STEFANINI EAS F3                                                         
316160*FIN-STEFANINI EAS                                                            
316210     DISALLOW  INTERRUPT.                                                     
316310                                                                              
316510*     PERFORM 70000000-CIERRO    THRU 70000000-EXIT.                          
317010     STOP RUN.                                                                
317510                                                                              
318010                                                                              
318510                                                                              
319010                                                                              
319510                                                                              
320010                                                                              
320510******************************************************************            
321010******************************************************************            
321510*         R U T I N A S  D E   S E L E C C I O N   D E                        
322010*    L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S              
322510*                  P O R   E L   P R O G R A M A.                             
323010******************************************************************            
323510******************************************************************            
324010                                                                              
324510 10000000-LIBRERIAS.                                                          
325010                                                                              
325510******************************************************************            
326010* CHANGE A LA LIBRARIA DE VERSIONES.                                          
326510******************************************************************            
327010     PERFORM 10000100-VERSIONES.                                              
327510                                                                              
328010******************************************************************            
328510* ACCESO LA LIBRERIA DE ESTRUCTURA POR MEDIO DEL CONTROL DE                   
329010* VER. PARA OBTENER EL NUMERO DE CSI AL QUE PERTENECEN LAS SUCS.              
329510******************************************************************            
330010     PERFORM 10000080-S080L700.                                               
330020     PERFORM 10000080-S080IVA.                                                
330510                                                                              
331010******************************************************************            
331510* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
332010******************************************************************            
332510     PERFORM 10000006-LOCSUP.                                                 
332610******************************************************************            
332620* CHANGE A LA LIBRERIA S016/L422 DATOS GRALES                                 
332630******************************************************************            
332640     PERFORM 10000016-L422.                                                   
332700                                                                              
332710******************************************************************            
332715* CHANGE A LA LIBRERIA S500/L040 PARA OBTENER CONTRATO DEL 66-11              
332720******************************************************************            
332730     PERFORM 10000500-L040LIGAS.                                              
332740                                                                              
332790******************************************************************            
332840* CHANGE A LA LIBRERIA S016/L458 PARA OBTENER CONTRATO                        
332890******************************************************************            
332940     PERFORM 10000016-L458.                                                   
332990                                                                              
333010 10000000-EXIT.                                                               
333510    EXIT.                                                                     
334010                                                                              
334510                                                                              
335010                                                                              
335510                                                                              
336010                                                                              
336510                                                                              
337010                                                                              
337510******************************************************************            
338010******************************************************************            
338510*                             O P E N.                                        
339010*  R U T I N A S   P A R A   A P E R T U R A   D E   B A S E   Y              
339510*                            A R C H I V O S.                                 
340010******************************************************************            
340510******************************************************************            
341010                                                                              
341510 20000000-OPEN.                                                               
341520   PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT.                          
342010   IF WS-TAR-DS = "TARJETADIA" OR "TARJETASEM"                                
342510       MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WS-VAL-FEC                       
343540*      PERFORM 20000050-CHECO-VER    THRU 20000050-EXIT                       
343550       PERFORM 20000100-CARGO-SUCS   THRU 20000100-EXIT                       
344010       PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT                       
344510       PERFORM 20002000-FECHA-PRO    THRU 20002000-EXIT                       
345010       PERFORM 20003000-FECHA-DIA    THRU 20003000-EXIT                       
345510       PERFORM 20004000-HORA         THRU 20004000-EXIT                       
345600**** INI-EAS F5                                                               
345700*INI-STEFANINI EAS F3                                                         
345800**       PERFORM 20004500-FECHA-HABIL  THRU 20004500-EXIT                     
345900*FIN-STEFANINI EAS F3                                                         
346010**       PERFORM 20005000-ABRO-ARC     THRU 20005000-EXIT                     
346500**** FIN-EAS F5                                                               
347010**       PERFORM 20006500-PROYSIGDIA   THRU 20006500-EXIT                     
347200**** FIN-EAS F5                                                               
347510       PERFORM 20007000-CIERRO-BASE  THRU 20007000-EXIT                       
347550**** INI EAS F5                                                               
347600       PERFORM 30003000-VERSION-LOTE THRU 30003000-EXIT                       
347800**** FIN EAS F5                                                               
348010   ELSE                                                                       
348060*INI-STEFANINI EAS                                                            
348110   IF WS-TAR-DS = "EASDIARIO "                                                
348210       PERFORM 20001000-ABRO-BASE    THRU 20001000-EXIT                       
348260       PERFORM 30001000-FECPRO-EAS   THRU 30001000-EXIT                       
348310       PERFORM 30002000-PROY-1MESANT THRU 30002000-EXIT                       
348360       PERFORM 30003000-VERSION-LOTE THRU 30003000-EXIT                       
348410       PERFORM 20007000-CIERRO-BASE  THRU 20007000-EXIT                       
348460   ELSE                                                                       
348510*FIN-STEFANINI EAS                                                            
349510       MOVE "PARAMETRO DE ENTRADA ERRONEO  "  TO WS-0101-TEXT-MSG             
350010       PERFORM 70000050-MENSAJE                                               
350510       CALL SYSTEM DMTERMINATE.                                               
351010 20000000-EXIT.                                                               
351510    EXIT.                                                                     
352010                                                                              
352020******************************************************************            
352030* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
352040******************************************************************            
352050 20000050-CHECO-VER.                                                          
352060     PERFORM 20000100-CHECAME-VERSION.                                        
352070     IF S000-CTR-CVEERROR < 0                                                 
352100        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
352110        PERFORM 70000050-MENSAJE                                              
352120        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
352130 20000050-EXIT.                                                               
352140    EXIT.                                                                     
352150                                                                              
352160*****************************************************************             
352170* CARGO ESTRUCTURA EN UNA TABLA.                                              
352180*****************************************************************             
352190 20000100-CARGO-SUCS.                                                         
352200    PERFORM 40000100-CARGO-TABLA       THRU 40000100-EXIT.                    
352210    CANCEL "CTLVERS".                                                         
352220    CANCEL "S080TARIFAS".                                                     
352230    CANCEL "S080BD01CON".                                                     
352240 20000100-EXIT.                                                               
352250    EXIT.                                                                     
352260                                                                              
352510******************************************************************            
353010* ABRO LA BASE DE DATOS DE INQUIRY YA QUE SOLO SERA CONSULTADA.               
353510******************************************************************            
354010 20001000-ABRO-BASE.                                                          
354510     OPEN INQUIRY S500BD01CAPTACION                                           
355010     ON EXCEPTION                                                             
356510        MOVE "ERROR AL ABRIR LA BASE      " TO WS-0101-TEXT-MSG               
357010        PERFORM 70000050-MENSAJE                                              
357510        CALL SYSTEM DMTERMINATE.                                              
358010                                                                              
358510    SET S500B02CONTROL        TO BEGINNING.                                   
359010 20001000-EXIT.                                                               
359510    EXIT.                                                                     
360010                                                                              
360510******************************************************************            
361010* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
361510******************************************************************            
362010 20002000-FECHA-PRO.                                                          
362510  PERFORM 90000002-B02CONTROL-FIND                                            
363010  IF WS-STATUS-BASE > 0                                                       
363510    IF WS-STATUS-BASE = 1                                                     
365010       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
365510       PERFORM 70000050-MENSAJE                                               
366010       CALL SYSTEM DMTERMINATE                                                
366510    ELSE                                                                      
368010       STRING "ERROR AL HACER FIND A B02 " ,     WS-STATUS-BASE               
368510       DELIMITED BY SIZE INTO                    WS-0101-TEXT-MSG             
369010       PERFORM 70000050-MENSAJE                                               
369510       CALL SYSTEM DMTERMINATE.                                               
370010                                                                              
370020     MOVE B02-NUM-CSI               TO WS-NUMCSI1                             
370025     MOVE B02-USO-FUTURO-05         TO WS-B02-DECOM-S111.                     
370030                                                                              
370510     PERFORM 20002100-PROY-FEC      THRU  20002100-EXIT                       
370520** GUARDAR SOLO 1 VEZ LA FECHA DEL ARCH S111 DIA-SEM EN VALUE  **             
370530** PARA QUE EL WFL LOTE PUEDA LLAMAR A P197 PARA EL ENVIO A MTY**             
370540     IF  WS-1VEZ-LEE-FECH-B02 = 0                                             
370550         MOVE WS-FECHA-PRO              TO WS-FEC-RESPALDO-AMD                
370560         SET MYSELF (TASKVALUE)         TO WKS-RESPALDO                       
370570         MOVE 1                         TO WS-1VEZ-LEE-FECH-B02.              
370580                                                                              
370600     IF  WS-1VEZ-ETIQ-REPORT = 0                                              
371010         MOVE WS-FECHA-PRO  TO WS-FECHA-BACKUP                                
371100         MOVE 1             TO WS-1VEZ-ETIQ-REPORT.                           
371200                                                                              
371300     MOVE B02-FECHA-LINEA           TO  WS-FECHA-LINE                         
371510     MOVE WS-FECHA-PRO              TO  WS-ETIQTARJETA-FECHA                  
371600                                        WS-ETIQTARJETA-FECHA-APL              
371800                                        WS-ETIQTARJETA-FECHA-ERR              
372000                                                                              
372010                                        WS-ETIQTBINTER-FECHA                  
372100                                        WS-ETIQTBINTER-FECHA-APL              
372200                                        WS-ETIQTBINTER-FECHA-ERR              
372510                                        WS-ETIQTBINT-FECSI.                   
372520** INI-EASF5                                                                  
372560    MOVE WS-FECHA-PRO-EAS           TO  WS-ETIQEAS-FECHA                      
372610                                        WS-ETIQEAS-FPROC                      
372620                                        WS-ETIQEAS-FECERR                     
372640                                                                              
372660                                        WS-ETIQEAS-SEM-FECHA                  
372710                                        WS-ETIQEAS-SEM-FPROC                  
372720                                        WS-ETIQEAS-SEM-FECERR                 
372760                                        WS-ETIQ-DET-B-FECHA.                  
373010                                                                              
373510*     MOVE WS-PRO-DD                 TO  DIA-REP TIT2-DIA.                    
374010*     MOVE WS-PRO-MM                 TO  MES-REP TIT2-MES.                    
374510*     MOVE WS-PRO-AA                 TO  ANO-REP TIT2-ANO.                    
374600** FIN-EASF5                                                                  
375010 20002000-EXIT.                                                               
375510    EXIT.                                                                     
376010                                                                              
376510******************************************************************            
377010* VERIFICO SI LA FECHA FUE PASADA POR LA BASE O POR VALUE.                    
377510* SI FUE POR VALUE PASO DIRECTAMENTE LA FECHA, SI NO TOMO LA FECHA            
378010* DEL SIG. ARCHIVO A APLICAR DE B02-ULT-ARCH-APLI, DONDE LA                   
378510* OCURRENCIA 9 ES PARA EL ARCHIVO DIARIO, Y LA OCURRENCIA 10                  
379010* PARA EL ARCHIVO SEMANAL.                                                    
379510******************************************************************            
380010 20002100-PROY-FEC.                                                           
380510   IF WS-TAR-DS = "TARJETADIA"                                                
381010      IF WS-VAL-FEC > 0                                                       
381510         MOVE WS-VAL-FEC            TO WS-FECHA-PRO                           
382010      ELSE                                                                    
382510         MOVE B02-ULT-ARCH-APLI(9)  TO WS-FECHA-PRO                           
382600         MOVE B02-ULT-ARCH-APLI(21) TO WS-FECHA-PRO-EAS                       
383010   ELSE                                                                       
383510      IF WS-VAL-FEC > 0                                                       
384010         PERFORM 20002110-VALSEM    THRU 20002110-EXIT                        
384510         MOVE WS-VAL-FEC            TO WS-FECHA-PRO                           
385010      ELSE                                                                    
385510         MOVE B02-ULT-ARCH-APLI(10) TO WS-FECHA-PRO                           
385600         MOVE B02-ULT-ARCH-APLI(22) TO WS-FECHA-PRO-EAS.                      
385800                                                                              
386010 20002100-EXIT.                                                               
386510    EXIT.                                                                     
387010                                                                              
387510******************************************************************            
388010* CUANDO ES PROCESO SEMANAL, Y LA FECHA FUE PASADA POR VALUE,                 
388510* VALIDO SI LA FECHA PASADA EFECTIVAMENTE PERTENECE A UN FIN DE               
389010* SEMANA.                                                                     
389020* CALCULO EL SIG. DIA HABIL.                                                  
389510******************************************************************            
390010 20002110-VALSEM.                                                             
390510    MOVE WS-VAL-FEC              TO    WS-S006-FECHA1                         
391010    MOVE 1                       TO    WS-S006-FECHA2                         
391510    MOVE 13                      TO    WS-S006-FORMATO                        
392010    MOVE 13                      TO    WS-S006-FUNCION                        
392510    PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT                          
393010    MOVE WS-S006-FECHA1          TO    WS-FEC-CALCULADA-AMD1.                 
393510                                                                              
394010    PERFORM 20002120-SEMANA      THRU  20002120-EXIT.                         
394510    IF WS-SEMANAL = 1                                                         
395010       NEXT SENTENCE                                                          
395510    ELSE                                                                      
397010       MOVE "LA FECHA PASADA NO ES SEMANAL" TO WS-0101-TEXT-MSG               
397510       PERFORM 70000050-MENSAJE                                               
398010       CALL SYSTEM DMTERMINATE.                                               
398510 20002110-EXIT.                                                               
399010    EXIT.                                                                     
399510                                                                              
400010******************************************************************            
400510* VERIFICO SI LA FECHA DE PROCESO ES FIN DE SEMANA O NO.                      
400520* UNA VEZ OBTENIDO EL SIG. DIA HABIL VERIFICO A QUE DIA DE LA                 
400530* SEMANA CORRESPONDE.                                                         
400540* SI CORRESPONDE A UN VIERNES (5) YA ES FIN DE SEMANA.                        
400550* SI CORRESPONDE A UN LUNES   (1) Y LA FECHA PASADA NO                        
400560* CORRESPONDIA A UN VIERNES QUIERE DECIR QUE ESA FECHA SE TOMA                
400570* COMO FIN DE SEMANA, YA QUE SE TRATARA DE ALGUN PUENTE.                      
400580* COMO LA SEMANA SANTA POR EJEMPLO.                                           
401010******************************************************************            
401510 20002120-SEMANA.                                                             
402010    MOVE WS-VAL-FEC              TO    WS-S006-FECHA1                         
402510    MOVE 12                      TO    WS-S006-FORMATO                        
403010    MOVE 6                       TO    WS-S006-FUNCION                        
403510    PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT.                         
404010    IF WS-S006-FECHA1     = 00000005                                          
404510       MOVE 1                    TO    WS-SEMANAL.                            
405010*** ELSE                                                                      
405510***    PERFORM 20002121-INFEC    THRU  20002121-EXIT                          
406010***    IF WS-S006-FECHA1 = 00000001                                           
406510***       MOVE 1                 TO    WS-SEMANAL.                            
407010 20002120-EXIT.                                                               
407510    EXIT.                                                                     
408010                                                                              
408510******************************************************************            
409010* VERIFICO SI LA FECHA INTRODUCIDA POR PARAMETRO ES SEMANAL.                  
409020* SI LA FECHA NO FUE VIERNES (5) VUELVO A CALCULAR EL SIG. DIA                
409030* HABIL A LA FECHA PARA VES SI NO SE TRATA DE UN PUENTE.                      
409510******************************************************************            
410010 20002121-INFEC.                                                              
410510       MOVE WS-FEC-CALCULADA-AMD1   TO    WS-S006-FECHA1                      
411010       MOVE 12                      TO    WS-S006-FORMATO                     
411510       MOVE 6                       TO    WS-S006-FUNCION                     
412010       PERFORM 40000000-CALL-FECPRO THRU 40000000-EXIT.                       
412510 20002121-EXIT.                                                               
413010   EXIT.                                                                      
413510                                                                              
414010******************************************************************            
414510* OBTENGO LA FECHA DEL DIA.                                                   
415010******************************************************************            
415510 20003000-FECHA-DIA.                                                          
416010        PERFORM 90000000-DAME-FEC-MAQUINA.                                    
416510        MOVE WKS-DD-MAQ           TO    WS-DIA-DD2                            
417010        MOVE WKS-MM-MAQ           TO    WS-DIA-MM2                            
417510        MOVE WKS-AAAA-MAQ         TO    WS-DIA-AA2                            
418050                                                                              
418510        MOVE WS-DIA-DD2           TO    DIA-MAQ                               
419010        MOVE WS-DIA-MM2           TO    MES-MAQ                               
419510        MOVE WS-DIA-AA2           TO    ANO-MAQ.                              
419600                                                                              
419700*INI EAS F5                                                                   
419800        MOVE WS-FECHA-DIA-AMD     TO    WS-FECHA-MAQ.                         
419900*FIN EAS F5                                                                   
420010 20003000-EXIT.                                                               
420510    EXIT.                                                                     
421010                                                                              
421510******************************************************************            
422010* OBTENGO LA HORA DE LA MAQUINA PARA LA GENERACION DE REPORTES.               
422510******************************************************************            
423010 20004000-HORA.                                                               
423510        ACCEPT  WS-HORA-HMSC-N    FROM TIME.                                  
424010        MOVE WS-HORA-HH-N     TO  HORA-MAQ.                                   
424510        MOVE WS-HORA-MM-N     TO  MINU-MAQ.                                   
425010 20004000-EXIT.                                                               
425510    EXIT.                                                                     
425512*INI-STEFANINI EAS F2                                                         
425514******************************************************************            
425516* VERIFICO QUE LA FECHA SEA HABIL PARA ABRIR EL ARCHIVO DE       *            
425518* ENTRADA DE EAS DIARIO.                                                      
425520******************************************************************            
425522 20004500-FECHA-HABIL.                                                        
425524   IF WS-TAR-DS = "TARJETADIA"                                                
425526      PERFORM 20004510-VAL-DIA-HABIL.                                         
425528                                                                              
425530 20004500-EXIT.                                                               
425532   EXIT.                                                                      
425534                                                                              
425536 20004510-VAL-DIA-HABIL.                                                      
425538    MOVE WS-FECHA-PRO-EAS                    TO WS-S006-FECHA1.               
425540    MOVE 13                                  TO WS-S006-FORMATO.              
425542    MOVE 18                                  TO WS-S006-FUNCION.              
425544    PERFORM 40000000-CALL-FECPRO             THRU 40000000-EXIT.              
425546    IF WS-S006-FECHA1 = 0                                                     
425548         MOVE 1      TO WS-NO-ES-DIAHABIL.                                    
425550*FIN-STEFANINI EAS F2                                                         
426010                                                                              
426510******************************************************************            
427010* ABRO REPORTES Y ARCHIVOS DEPENDIENDO DE SI ES DIARIO O SEMANAL.             
427510* EL PROCESO DIARIO SE IDENTIFICA  CON EL PARAMETRO "TARJETADIA".             
428010* EL PROCESO SEMANAL SE IDENTIFICA CON EL PARAMETRO "TARJETASEM".             
428510******************************************************************            
429010 20005000-ABRO-ARC.                                                           
429500 IF ARCH-S111                                                                 
430010   IF WS-TAR-DS = "TARJETADIA"                                                
430510*      MOVE "S500/P400/000DISPERSION-TAR" TO ID-REP                           
430520*      MOVE "/001"                        TO WS-NUM-SEQ                       
431010*      MOVE "DISPER-DIARIA "              TO WS-NOM-BACKUP                    
431510      OPEN INPUT TARJETA                                                      
431512      MOVE ATTRIBUTE LASTRECORD OF TARJETA TO WS-HI-TOTAL                     
431600      MOVE ATTRIBUTE MAXRECSIZE OF TARJETA TO W77-TAM-REG                     
431700      IF ATTRIBUTE UNITS OF TARJETA = 0                                       
431800         COMPUTE W77-TAM-REG = W77-TAM-REG * 6                                
431900      ELSE                                                                    
432000         NEXT SENTENCE                                                        
432010   ELSE                                                                       
432510*      MOVE "S500/P400/000SEMANAL"        TO ID-REP                           
432520*      MOVE "/002"                        TO WS-NUM-SEQ                       
433010*      MOVE "DISPER-SEMANAL"              TO WS-NOM-BACKUP                    
433020*      OPEN INPUT ARCH-EAS-SEM                                                
433510      OPEN INPUT TBINTERNAL                                                   
433512      MOVE ATTRIBUTE LASTRECORD OF TBINTERNAL TO WS-HI-TOTAL                  
433514      MOVE ATTRIBUTE MAXRECSIZE OF TBINTERNAL TO W77-TAM-REG                  
433600      IF ATTRIBUTE UNITS OF TBINTERNAL = 0                                    
433700         COMPUTE W77-TAM-REG = W77-TAM-REG * 6.                               
433702                                                                              
433704 IF ARCH-ECMS                                                                 
433706*INI-STEFANINI EAS F3                                                         
433708*   IF WS-TAR-DS = "TARJETADIA" AND WS-NO-ES-DIAHABIL = 0                     
433710   IF WS-TAR-DS = "TARJETADIA"                                                
433712*      CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS                       
433714*      IF ATTRIBUTE RESIDENT OF ARCH-EAS = VALUE TRUE                         
433716         OPEN INPUT ARCH-EAS                                                  
433718         MOVE 1 TO WS-OPENED-EAS-FILE                                         
433720      ELSE                                                                    
433722*         PERFORM 20005050-ESPERANDO-ARCH-EAS                                 
433724*                              UNTIL WS-EXIT-WAIT = 1.                        
433726                                                                              
433728*   IF WS-TAR-DS = "TARJETASEM"                                               
433730*      CHANGE ATTRIBUTE TITLE OF ARCH-EAS-SEM TO WS-ETIQEAS-SEM               
433732*      IF ATTRIBUTE RESIDENT OF ARCH-EAS-SEM = VALUE TRUE                     
433734         OPEN INPUT ARCH-EAS-SEM                                              
433736         MOVE 1 TO WS-OPENED-EAS-FILE.                                        
433738*      ELSE                                                                   
433740*         PERFORM 20005050-ESPERANDO-ARCH-EAS                                 
433742*                              UNTIL WS-EXIT-WAIT = 1.                        
433744*FIN-STEFANINI EAS F3                                                         
433800                                                                              
433850 IF ARCH-REPORT                                                               
433900     IF WS-TAR-DS = "TARJETADIA"                                              
433950       MOVE "S500/P400/000DISPERSION-TAR" TO ID-REP                           
434000       MOVE "/001"                        TO WS-NUM-SEQ                       
434050       MOVE "DISPER-DIARIA "              TO WS-NOM-BACKUP                    
434100    ELSE                                                                      
434150       MOVE "S500/P400/000SEMANAL"        TO ID-REP                           
434200       MOVE "/002"                        TO WS-NUM-SEQ                       
434250       MOVE "DISPER-SEMANAL"              TO WS-NOM-BACKUP.                   
434300                                                                              
434350 IF ARCH-REPORT                                                               
434400                                                                              
434510   MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WS-MIX-NUMBER                        
435010   SET REPORTE(USERBACKUPNAME) TO VALUE TRUE                                  
435510   CHANGE ATTRIBUTE TITLE OF REPORTE TO WS-NOMBRE-REPORTE                     
436010   OPEN OUTPUT REPORTE.                                                       
436510 20005000-EXIT.                                                               
437010    EXIT.                                                                     
437510                                                                              
437520 20005050-ESPERANDO-ARCH-EAS.                                                 
437532    IF WS-OPENED-EAS-FILE = 1                                                 
437533      MOVE 1 TO WS-EXIT-WAIT                                                  
437540    ELSE                                                                      
437542       PERFORM 20005055-P400-WAIT UNTIL WS-CONT-WAIT > 19                     
437550       IF WS-OPENED-EAS-FILE = 0 AND WS-CONT-WAIT > 19                        
437560         MOVE SPACES TO WS-0101-TEXT-MSG                                      
437570         STRING "ARCHIVO EAS NO ENCONTRADO, DESEA VOLVER A ",                 
437580                 "INTENTAR REALIZAR LA BUSQUEDA (SI/NO)?"                     
437590         DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                              
437600         PERFORM 70000050-MENSAJE                                             
437610         ACCEPT WS-CONTINUAR-BUSQUEDA                                         
437620         IF WS-CONTINUAR-BUSQUEDA = "NO"                                      
437630            MOVE 1 TO WS-EXIT-WAIT                                            
437640         ELSE                                                                 
437650            NEXT SENTENCE.                                                    
437652                                                                              
437653    MOVE ZERO   TO WS-CONT-WAIT.                                              
437654    MOVE SPACES TO WS-0101-TEXT-MSG.                                          
437660                                                                              
437680 20005055-P400-WAIT.                                                          
437685    IF WS-TAR-DS = "TARJETADIA"                                               
437686       CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS                       
437690       IF ATTRIBUTE RESIDENT OF ARCH-EAS = VALUE TRUE                         
437700          OPEN INPUT ARCH-EAS                                                 
437710          MOVE 1   TO WS-OPENED-EAS-FILE                                      
437720          MOVE 20  TO WS-CONT-WAIT                                            
437730       ELSE                                                                   
437740          WAIT(60)                                                            
437750          ADD 1 TO WS-CONT-WAIT.                                              
438000                                                                              
439000    IF WS-TAR-DS = "TARJETASEM"                                               
439500       CHANGE ATTRIBUTE TITLE OF ARCH-EAS-SEM TO WS-ETIQEAS-SEM               
440000       IF ATTRIBUTE RESIDENT OF ARCH-EAS-SEM = VALUE TRUE                     
441000          OPEN INPUT ARCH-EAS-SEM                                             
442000          MOVE 1   TO WS-OPENED-EAS-FILE                                      
443000          MOVE 20  TO WS-CONT-WAIT                                            
444000       ELSE                                                                   
445000          WAIT(60)                                                            
446000          ADD 1 TO WS-CONT-WAIT.                                              
447000                                                                              
454010******************************************************************            
454510* PROYECTO EL SIG DIA. QUE DEBERAN APLICARSE LOS ARCHIVOS                     
455010* DIARIO Y SEMANAL.                                                           
455510******************************************************************            
456010 20006500-PROYSIGDIA.                                                         
456510   IF WS-VAL-FEC > 0                                                          
457010      IF WS-TAR-DS = "TARJETADIA"                                             
457510         PERFORM 20006510-VALDIAVAL        THRU 20006510-EXIT                 
458010      ELSE                                                                    
458510         PERFORM 20006520-VALSEMVAL        THRU 20006520-EXIT                 
459010   ELSE                                                                       
459510      IF WS-TAR-DS = "TARJETADIA"                                             
460000         PERFORM 20006530-PROYECTAR-DIARIO THRU 20006530-EXIT                 
460510      ELSE                                                                    
460520         PERFORM 20006540-PROYECTAR-SEMANAL THRU 20006540-EXIT.               
461510 20006500-EXIT.                                                               
461520   EXIT.                                                                      
461540                                                                              
461560 20006530-PROYECTAR-DIARIO.                                                   
461580    IF ARCH-S111                                                              
461600      MOVE B02-ULT-ARCH-APLI(9)         TO WS-FECHA-DIARIOP                   
461620      PERFORM 20006512-PROYDIANAT       THRU 20006512-EXIT                    
461640    ELSE IF ARCH-ECMS                                                         
461660      MOVE B02-ULT-ARCH-APLI(21)        TO WS-FECHA-DIARIOEASP                
461680      PERFORM 20006513-PROYDIAHABIL     THRU 20006513-EXIT.                   
461700                                                                              
461720 20006530-EXIT.                                                               
461740                                                                              
461760 20006540-PROYECTAR-SEMANAL.                                                  
461780   IF ARCH-S111                                                               
461800     MOVE B02-ULT-ARCH-APLI(10)        TO WS-FECHA-SEMANALP                   
461820     PERFORM 20006522-PROYSEMPRO       THRU 20006522-EXIT                     
461840   ELSE IF ARCH-ECMS                                                          
461860     MOVE B02-ULT-ARCH-APLI(22)        TO WS-FECHA-SEMANALEASP                
461880     PERFORM 20006522-PROYSEMPRO       THRU 20006522-EXIT.                    
461900                                                                              
461920 20006540-EXIT.                                                               
461940                                                                              
462510                                                                              
463010******************************************************************            
463510* PROYECTO EL SIG. DIA DE  UN ARCHIVO DIARIO Y VALUE = 0.                     
464010******************************************************************            
464510 20006510-VALDIAVAL.                                                          
465010    IF WS-VAL-FEC < B02-ULT-ARCH-APLI(9)                                      
465510       MOVE B02-ULT-ARCH-APLI(9) TO WS-FECHA-DIARIO.                          
466010                                                                              
466510    IF WS-VAL-FEC = B02-ULT-ARCH-APLI(9)                                      
466520       MOVE  B02-ULT-ARCH-APLI(9)      TO WS-FECHA-DIARIOP                    
467010       PERFORM 20006512-PROYDIANAT     THRU 20006512-EXIT.                    
467510                                                                              
468010    IF WS-VAL-FEC > B02-ULT-ARCH-APLI(9)                                      
469510       MOVE "ERR FALTAN ARC. DIA POR APLICAR" TO WS-0101-TEXT-MSG             
470010       PERFORM 70000050-MENSAJE                                               
470510       CALL SYSTEM DMTERMINATE.                                               
471010 20006510-EXIT.                                                               
471510    EXIT.                                                                     
472010                                                                              
472510******************************************************************            
473010* PROYECTO EL SIG. DIA DEL UN ARCHIVO SEMANAL  Y VALUE = 0.                   
473510******************************************************************            
474010 20006520-VALSEMVAL.                                                          
474020    IF WS-VAL-FEC < B02-ULT-ARCH-APLI(10)                                     
474030       MOVE B02-ULT-ARCH-APLI(10) TO WS-FECHA-SEMANAL.                        
474040                                                                              
474050    IF WS-VAL-FEC = B02-ULT-ARCH-APLI(10)                                     
474055       MOVE B02-ULT-ARCH-APLI(10)      TO WS-FECHA-SEMANALP                   
474060       PERFORM 20006522-PROYSEMPRO     THRU 20006522-EXIT.                    
474070                                                                              
474080    IF WS-VAL-FEC > B02-ULT-ARCH-APLI(10)                                     
474110       MOVE "ERR FALTAN ARC. SEM POR APLICAR" TO WS-0101-TEXT-MSG             
474120       PERFORM 70000050-MENSAJE                                               
474130       CALL SYSTEM DMTERMINATE.                                               
474140 20006520-EXIT.                                                               
474150    EXIT.                                                                     
474160                                                                              
474170******************************************************************            
474180* PROYECTO LA FECHA CON LA QUE HABRA DE PEDIRSE EL ARCHIVO DIARIO             
474185* DEPENDIENDO DE LA FECHA DEL ULTIMO ARCHIVO APLICADO.                        
474190******************************************************************            
474200 20006512-PROYDIANAT.                                                         
474210     MOVE WS-FECHA-DIARIOP             TO WS-S006-FECHA1                      
474220     MOVE 1                            TO WS-S006-FECHA2                      
474230     MOVE 12                           TO WS-S006-FORMATO                     
474240     MOVE 8                            TO WS-S006-FUNCION                     
474250     PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474260     MOVE WS-S006-FECHA1               TO WS-FECHA-DIARIO.                    
474270 20006512-EXIT.                                                               
474280    EXIT.                                                                     
474282******************************************************************            
474284* PROYECTO LA FECHA CON LA QUE HABRA DE PEDIRSE EL ARCHIVO DIARIO             
474286* DE EAS DEPENDIENDO DE LA FECHAHABIL DEL ULTIMO ARCHIVO APLICADO.            
474288******************************************************************            
474290 20006513-PROYDIAHABIL.                                                       
474292     MOVE WS-FECHA-DIARIOEASP          TO WS-S006-FECHA1                      
474294     MOVE 1                            TO WS-S006-FECHA2                      
474296     MOVE 12                           TO WS-S006-FORMATO                     
474298     MOVE 13                           TO WS-S006-FUNCION                     
474300     PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474302     MOVE WS-S006-FECHA1               TO WS-FECHA-DIARIOEAS.                 
474304 20006513-EXIT.                                                               
474306    EXIT.                                                                     
474308                                                                              
474310******************************************************************            
474320* PROYECTO LA FECHA CON LA QUE HABRA DE PEDIRSE EL ARCHIVO SEMANAL            
474330* DEPENDIENDO DE LA FECHA DEL ULTIMO ARCHIVO APLICADO.                        
474332*****************************************************************             
474334* SEGUN INFORMACION DE TARJETAS EL ARCHIVO SEMANAL SE GENERA                  
474336* TODOS LOS VIERNES AUN EN DIAS INHABILES.                                    
474338* SE PROYACTA LA FECHA DE VIERNES A VIERNES.                                  
474340******************************************************************            
474350 20006522-PROYSEMPRO.                                                         
474352     IF ARCH-S111                                                             
474354        MOVE WS-FECHA-SEMANALP            TO WS-S006-FECHA1                   
474356     ELSE IF ARCH-ECMS                                                        
474358        MOVE WS-FECHA-SEMANALEASP         TO WS-S006-FECHA1.                  
474360                                                                              
474362     MOVE 7                            TO WS-S006-FECHA2.                     
474364     MOVE 12                           TO WS-S006-FORMATO.                    
474366     MOVE 08                           TO WS-S006-FUNCION.                    
474368     PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT.                   
474370     MOVE WS-S006-FECHA1               TO WS-FECHA-CAL1.                      
474372                                                                              
474374     IF ARCH-S111                                                             
474376        MOVE WS-FECHA-CAL1                TO WS-FECHA-SEMANAL                 
474378     ELSE IF ARCH-ECMS                                                        
474380        MOVE WS-FECHA-CAL1                TO WS-FECHA-SEMANALEAS.             
474382                                                                              
474384***  MOVE WS-FECHA-SEMANALP            TO WS-S006-FECHA1                      
474386***  MOVE 1                            TO WS-S006-FECHA2                      
474388***  MOVE 12                           TO WS-S006-FORMATO                     
474390***  MOVE 13                           TO WS-S006-FUNCION                     
474400***  PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474410***  MOVE WS-S006-FECHA1               TO WS-FECHA-CAL1                       
474420***  MOVE 1                            TO WS-S006-FECHA2                      
474430***  MOVE 12                           TO WS-S006-FORMATO                     
474440***  MOVE 13                           TO WS-S006-FUNCION                     
474450***  PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474460***  MOVE WS-S006-FECHA1               TO WS-FECHA-CAL2                       
474470***  MOVE WS-FECHA-CAL1                TO WS-S006-FECHA1                      
474480***  MOVE 12                           TO WS-S006-FORMATO                     
474490***  MOVE 6                            TO WS-S006-FUNCION                     
474500***  PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474510***  MOVE WS-S006-FECHA1               TO WS-CONTADOR1                        
474520***  MOVE WS-FECHA-CAL2                TO WS-S006-FECHA1                      
474530***  MOVE 12                           TO WS-S006-FORMATO                     
474540***  MOVE 6                            TO WS-S006-FUNCION                     
474550***  PERFORM 40000000-CALL-FECPRO      THRU  40000000-EXIT                    
474560***  MOVE WS-S006-FECHA1               TO WS-CONTADOR2                        
474570***  PERFORM 20006524-CHECO THRU 20006524-EXIT UNTIL WS-6VEZ = 1              
474575***  MOVE WS-FECHA-CAL1                TO WS-FECHA-SEMANAL.                   
474580 20006522-EXIT.                                                               
474590   EXIT.                                                                      
474614                                                                              
474616******************************************************************            
474620* CALCULO EL PROXIMO DIA QUE DEBERA SER PEDIDO EL TBINTERSEM.                 
474630******************************************************************            
474640 20006524-CHECO.                                                              
474650    IF WS-CONTADOR2 > WS-CONTADOR1                                            
474660       MOVE WS-FECHA-CAL2        TO WS-FECHA-CAL1                             
474670       MOVE WS-CONTADOR2         TO WS-CONTADOR1                              
474680       MOVE WS-FECHA-CAL2        TO WS-S006-FECHA1                            
474690       MOVE 1                    TO WS-S006-FECHA2                            
474700       MOVE 12                   TO WS-S006-FORMATO                           
474710       MOVE 13                   TO WS-S006-FUNCION                           
474720       PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT                       
474730       MOVE WS-S006-FECHA1       TO WS-FECHA-CAL2                             
474740       MOVE 12                   TO WS-S006-FORMATO                           
474750       MOVE 6                    TO WS-S006-FUNCION                           
474760       PERFORM 40000000-CALL-FECPRO THRU  40000000-EXIT                       
474770       MOVE WS-S006-FECHA1       TO WS-CONTADOR2                              
474780    ELSE                                                                      
474790       MOVE 1                    TO WS-6VEZ.                                  
474800 20006524-EXIT.                                                               
474810   EXIT.                                                                      
474820                                                                              
475010******************************************************************            
475510* CIERRO LA BASE PARA NO ESTARLA TOMANDO MIENTRAS SE EJECUTA                  
476010* EL PROCESO, POSTERIORMENTE Y UNA VEZ QUE HAYA VISTO QUE EL                  
476510* PROCESO TERMINO EN FORMA CORRECTA, ACTUALIZO, LOS VALORES DE B02            
477010******************************************************************            
477510 20007000-CIERRO-BASE.                                                        
478010    CLOSE  S500BD01CAPTACION ON EXCEPTION                                     
479510       MOVE "ERROR AL CERRAR LA BASE"    TO WS-0101-TEXT-MSG                  
480010       PERFORM 70000050-MENSAJE                                               
480510       CALL SYSTEM DMTERMINATE.                                               
481010 20007000-EXIT.                                                               
481510     EXIT.                                                                    
482010                                                                              
482020*INI-STEFANINI EAS                                                            
482030*****************************************************************             
482040* SE OBTIENE FECHA DE LINEA                                                   
482050*****************************************************************             
482060 30001000-FECPRO-EAS.                                                         
482070    PERFORM 90000002-B02CONTROL-FIND.                                         
482080    IF WS-STATUS-BASE > 0                                                     
482090       IF WS-STATUS-BASE = 1                                                  
482100          MOVE "ERROR REG. DE CONTROL VACIO" TO WS-0101-TEXT-MSG              
482110          PERFORM 70000050-MENSAJE                                            
482120          CALL SYSTEM DMTERMINATE                                             
482130       ELSE                                                                   
482140          STRING "ERROR AL HACER FIND A B02",   WS-STATUS-BASE                
482150          DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG              
482160          PERFORM 70000050-MENSAJE                                            
482170          CALL SYSTEM DMTERMINATE.                                            
482180                                                                              
482190    MOVE B02-NUM-CSI                         TO WS-NUMCSI1.                   
482200    MOVE B02-FECHA-LINEA                     TO WS-FECHA-PRO.                 
482210                                                                              
482220 30001000-EXIT.                                                               
482230     EXIT.                                                                    
482240                                                                              
482250*****************************************************************             
482260*  SE PROYECTA FEC LINEA 1 MES ATRAS P/OBTENER FECHA LIM DE BUSQ              
482270******************************************************************            
482280 30002000-PROY-1MESANT.                                                       
482290    MOVE WS-FECHA-PRO                        TO WS-S006-FECHA1.               
482300    MOVE 01                                  TO WS-S006-FECHA2.               
482310    MOVE 12                                  TO WS-S006-FORMATO.              
482320    MOVE 22                                  TO WS-S006-FUNCION.              
482330    PERFORM 40000000-CALL-FECPRO             THRU 40000000-EXIT.              
482340    MOVE WS-S006-FECHA1                      TO WS-FECHA-FIN-BUSQ.            
482350                                                                              
482360 30002000-EXIT.                                                               
482370     EXIT.                                                                    
482380                                                                              
482390******************************************************************            
482400*  SE OBTINE VERSION WFL-LOTE PARA EJECUCION P197                             
482410******************************************************************            
482420 30003000-VERSION-LOTE.                                                       
482430    MOVE "S500JBATCH"                        TO S000-CTR-LIBID.               
482440    CALL "DAME_TIT IN CTLVERS"                                                
482450         USING  S000-CTR-LIBID                                                
482460                S000-CTR-NOMLIB                                               
482470         GIVING S000-CTR-CVEERROR.                                            
482480                                                                              
482490    MOVE S000-CTR-NOMLIB                      TO WS-WFLP197-LOTE.             
482500 30003000-EXIT.                                                               
482505     EXIT.                                                                    
482510*FIN-STEFANINI EAS                                                            
483010                                                                              
483510                                                                              
484010                                                                              
484510******************************************************************            
485010******************************************************************            
485510*                                                                             
486010* R U T I N A S    D E   L L A M A D O S   A   L I B R E R I A S.             
486510*                                                                             
487010******************************************************************            
487510******************************************************************            
488010                                                                              
488510******************************************************************            
489010* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
489510* DE PROCESO RESTANDOLE UN DIA A LA FECHA QUE YA HABIA SIDO PROY.             
490010******************************************************************            
490510 40000000-CALL-FECPRO.                                                        
491010     PERFORM 20000006-LOCSUP.                                                 
491510     IF WS-S006-FUNCION > 0                                                   
492010        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
493000                                                                              
493510        STRING "ERROR AL ACCESAR LOCSUP",   WS-MSG-RS                         
494010        DELIMITED BY SIZE INTO              WS-0101-TEXT-MSG                  
494510        PERFORM 70000050-MENSAJE                                              
495010        CALL SYSTEM DMTERMINATE.                                              
495510 40000000-EXIT.                                                               
496010     EXIT.                                                                    
496510                                                                              
496520******************************************************************            
496530* CARGO EN UNA TABLA TODOS LOS VALORES NECESARIOS DE STRUCTURA.               
496540******************************************************************            
496550 40000100-CARGO-TABLA.                                                        
496552    PERFORM 40000080-CARGA-DATOS-S080.                                        
496554    IF WKS-S080-RS-CARGA = 0 OR 1                                             
496560       NEXT SENTENCE                                                          
496570    ELSE                                                                      
496580       MOVE WKS-S080-RS-CARGA                TO WS-MSG-RS                     
496610       STRING "ERROR EN CARGA DEL S080 RS=", WS-MSG-RS                        
496620       DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG                 
496630       PERFORM 70000050-MENSAJE                                               
496640       CALL SYSTEM DMTERMINATE.                                               
496650 40000100-EXIT.                                                               
496660    EXIT.                                                                     
496670                                                                              
497010******************************************************************            
497510* LLAMADO A LA RUTINA 42000080-DATOS-S080 PARA OBTENER EL CSI    *            
498010* DEL NUMERO DE SUCURSAL W77-SUC-PTE (PUEDE CAMBIAR POR 0105)    *            
498510******************************************************************            
503100 40000450-CSI-SUCPTE.                                                         
503102     MOVE 0                      TO W77-CSI-PTE.                              
503105     MOVE W77-SUC-PTE            TO WKS-S080-NUMSUC.                          
503110     MOVE 400                    TO WKS-S080-NUMPASO.                         
503115     MOVE WS-FECHA-PRO           TO WKS-S080-FECHA.                           
503120     PERFORM 42000080-DATOS-S080.                                             
503125     IF (WKS-S080-STA-DATO = 0)                                               
503126    AND (WKS-S080-NUMCSI > 0)                                                 
503130        IF WKS-S080-NUMCSI =  4 OR 10                                         
503135           MOVE WKS-S080-NUMCSI TO W77-CSI-PTE                                
503140        ELSE                                                                  
503141        IF WKS-S080-NUMCSI = 12                                               
503142           MOVE 10              TO W77-CSI-PTE                                
503143           MOVE 105             TO W77-SUC-PTE                                
503144           ADD  1               TO W77-CSI-12.                                
503145                                                                              
503146     IF W77-CSI-PTE > 0                                                       
503147        NEXT SENTENCE                                                         
503148     ELSE                                                                     
503149     IF W77-QUE-VA = 1                                                        
503150        MOVE 10              TO W77-CSI-PTE                                   
503250        MOVE 105             TO W77-SUC-PTE                                   
503350        ADD  1               TO W77-CSI-XX.                                   
503356                                                                              
503358     MOVE 0 TO W77-QUE-VA.                                                    
503450                                                                              
503510 40000480-VALI-CSI.                                                           
503520     IF W77-S016-CONTRATO > 0                                                 
503522        IF W77-ES-L422 = 0                                                    
503530           IF WS-NUMCSIS016 = W77-CSI-SUCORIG                                 
503540              MOVE W77-CSI-SUCORIG TO WS-NUMCSI                               
503550              ADD 1                TO W77-CSI-IGUAL-L458                      
503560           ELSE                                                               
503562           IF WS-NUMCSIS016 > 0                                               
503570              MOVE WS-NUMCSIS016 TO WS-NUMCSI                                 
503572              ADD 1              TO W77-CSI-NOIGUAL-L458                      
503574              IF WS-NUMCSIS016 = 10                                           
503575                 MOVE 105        TO TB-SUCURSAL                               
503576*                MOVE 105        TO TB-SUCURSAL WS-INTSUCURSAL                
503578              ELSE                                                            
503579                 MOVE 105        TO TB-SUCURSAL                               
503580*                MOVE 117        TO TB-SUCURSAL WS-INTSUCURSAL                
503582           ELSE                                                               
503584              MOVE W77-CSI-SUCORIG TO WS-NUMCSI                               
503586              ADD  1               TO W77-CSI-00                              
503615        ELSE                                                                  
503616        IF W77-SUCP-S016 = TB-SUCURSAL                                        
503617           MOVE W77-CSI-SUCORIG  TO WS-NUMCSI                                 
503618           ADD 1                 TO W77-SUC-SIIGUAL                           
503619           ADD 1                 TO W77-CSI-SIIGUAL                           
503620        ELSE                                                                  
503621        IF W77-CSI-SUCORIG = WS-NUMCSIS016                                    
503622*          MOVE W77-SUCP-S016    TO TB-SUCURSAL WS-INTSUCURSAL                
503623           MOVE W77-SUCP-S016    TO TB-SUCURSAL                               
503625           MOVE WS-NUMCSIS016    TO WS-NUMCSI                                 
503626           ADD 1                 TO W77-CSI-SIIGUAL                           
503627           ADD 1                 TO W77-SUC-NOIGUAL                           
503628        ELSE                                                                  
503629        IF WS-NUMCSIS016 > 0                                                  
503630*          MOVE W77-SUCP-S016    TO TB-SUCURSAL WS-INTSUCURSAL                
503631           MOVE W77-SUCP-S016    TO TB-SUCURSAL                               
503633           MOVE WS-NUMCSIS016    TO WS-NUMCSI                                 
503634           ADD  1                TO W77-SUC-NOIGUAL                           
503635           ADD  1                TO W77-CSI-NOIGUAL                           
503636        ELSE                                                                  
503637           MOVE W77-CSI-SUCORIG  TO WS-NUMCSI                                 
503638           ADD  1                TO W77-SUC-INV-L422                          
503639     ELSE                                                                     
503640     IF W77-BD04-CONTRATO > 0                                                 
503642        IF WS-BD04-SUCP = TB-SUCURSAL                                         
503644           MOVE W77-CSI-SUCORIG TO WS-NUMCSI                                  
503646           ADD  1               TO W77-CSI-SIIGUAL-BD04                       
503648        ELSE                                                                  
503650        IF WS-BD04-CSI = W77-CSI-SUCORIG                                      
503660           MOVE W77-CSI-SUCORIG TO WS-NUMCSI                                  
503662*          MOVE WS-BD04-SUCP    TO TB-SUCURSAL WS-INTSUCURSAL                 
503663           MOVE WS-BD04-SUCP    TO TB-SUCURSAL                                
503670           ADD  1               TO W77-CSI-SIIGUAL-BD04                       
503680        ELSE                                                                  
503681        IF WS-BD04-CSI > 0                                                    
503682*          MOVE WS-BD04-SUCP    TO TB-SUCURSAL WS-INTSUCURSAL                 
503683           MOVE WS-BD04-SUCP    TO TB-SUCURSAL                                
503685           MOVE WS-BD04-CSI     TO WS-NUMCSI                                  
503686           ADD 1                TO W77-CSI-NOIGUAL-BD04                       
503687        ELSE                                                                  
503688           MOVE W77-CSI-SUCORIG TO WS-NUMCSI                                  
503689           ADD  1               TO W77-SUC-INV-L040                           
503690     ELSE                                                                     
503700        MOVE W77-CSI-SUCORIG TO WS-NUMCSI.                                    
503710                                                                              
504010                                                                              
504510                                                                              
505010                                                                              
505510                                                                              
506010******************************************************************            
506110* LLAMADO A LIB S016/L422 PARA OBTENER EL NUMERO DE SUC PROMOTORA             
506120* EN BASE AL NUMERO DE CONTRATO DEL ARCHIVO                                   
506122* O EL QUE REGRESO LA LIB S016/L458.                                          
506130******************************************************************            
506200 40000500-CALL-S016-L422.                                                     
506210     MOVE 400                    TO WS-S016-0102-CTR-NUMPASO-I.               
506212     IF W77-S016-CONTRATO > 0                                                 
506214        MOVE W77-S016-CONTRATO    TO WS-S016-0102-CTO-NUM-I                   
506216     ELSE                                                                     
506218        MOVE TB-CONTRATO         TO WS-S016-0102-CTO-NUM-I.                   
506220*        MOVE WS-INTNUM-CONTRATO   TO WS-S016-0102-CTO-NUM-I.                 
506230***  MOVE 1                       TO WS-S016-0102-CTR-OPCION-I.               
506240                                                                              
506250     PERFORM 20000016-L422-S500-02.                                           
506260                                                                              
506270 40000500-EXIT.                                                               
506280     EXIT.                                                                    
506282***************************************************************               
506284* LLAMADO A LIB S500/L040 PARA OBTENER SUC PROM Y CONTRATO    *               
506285* SI LA TARJETA ES DEL BIN PREPAGADA (W88-INTBIN-TARJPREP)    *               
506286***************************************************************               
506288 40000600-CALL-S500L040.                                                      
506292*     MOVE WS-INTNUM-TARJETA   TO WS-S500-L040-03-TARJ-I.                     
506293     MOVE TB-TARJETA          TO WS-S500-L040-03-TARJ-I.                      
506294     MOVE 0                   TO WS-S500-L040-RESULT.                         
506296     ADD  1                   TO WS-HI-CL040.                                 
506298     PERFORM 20000500-S500L040-DA-CONTRATO.                                   
506300                                                                              
506302     IF WS-S500-L040-RESULT = 0                                               
506304        MOVE WS-S500-L040-03-CTO-S   TO WS-BD04-CTO                           
506306                                        W77-BD04-CONTRATO                     
506318        MOVE WS-S500-L040-03-SUCP-S  TO WS-BD04-SUCP                          
506320        MOVE WS-S500-L040-03-CSI-S   TO WS-BD04-CSI                           
506322        MOVE 1                       TO WS-ES-6611                            
506324        ADD  1                       TO W77-SI-BD04                           
506326     ELSE                                                                     
506332        ADD  1      TO W77-NO-BD04                                            
506334        ADD  1      TO WS-L040-L422.                                          
506338                                                                              
506340     IF WS-S500-L040-RESULT = 0                                               
506344*        IF WS-INTNUM-CONTRATO = WS-BD04-CTO                                  
506346         IF TB-CONTRATO = WS-BD04-CTO                                         
506349           ADD 1           TO W77-CTO-SIIGUAL-BD04                            
506354        ELSE                                                                  
506359           ADD 1            TO W77-CTO-NOIGUAL-BD04                           
506360           MOVE WS-BD04-CTO TO TB-CONTRATO.                                   
506364*           MOVE WS-BD04-CTO TO WS-INTNUM-CONTRATO.                           
506369                                                                              
506374     IF WS-S500-L040-RESULT = 0                                               
506379        IF TB-SUCURSAL = WS-BD04-SUCP                                         
506384           ADD 1 TO W77-SUC-SIIGUAL-BD04                                      
506389        ELSE                                                                  
506394           ADD 1 TO W77-SUC-NOIGUAL-BD04.                                     
506404                                                                              
506409 40000600-EXIT.                                                               
506414     EXIT.                                                                    
506419                                                                              
506424***************************************************************               
506510******************************************************************            
507010*                                                                             
507510* E J E C U C I O N   D E   P R O C E S O   P R I N C I P A L.                
508010*                                                                             
508510******************************************************************            
509010******************************************************************            
509510 50000000-PROCESOS.                                                           
510010     PERFORM 50001000-SEPARO THRU 50001000-EXIT.                              
510510 50000000-EXIT.                                                               
511010    EXIT.                                                                     
511510*****************************************************************             
511520****        P R O C E S O    E A S   F 5                     ****             
511530*****************************************************************             
511540 30000000-PROCESO.                                                            
511542*  VALIDAR FECHA ARCHIVOS DIARIOS DE EAS                                      
511544   IF WS-TAR-DS = "TARJETADIA"                                                
511546      PERFORM 30000100-VAL-FEC-HABIL-EAS  THRU 30000100-EXIT.                 
511548                                                                              
511550*  CREAR Y ABRIR EL ARCHIVO REPORTE                                           
511560   MOVE 3 TO ARCH-A-PROCESAR.                                                 
511570   PERFORM 20005000-ABRO-ARC  THRU 20005000-EXIT.                             
511580                                                                              
511590*  PROCESAR TODOS LOS ARCHIVOS PENDIENTES                                     
511600   PERFORM 31000000-PROCESOS  THRU 31000000-EXIT                              
511610                              UNTIL WS-FIN-PROCESOS = 1.                      
511620                                                                              
511630*  CERRAR Y GUARDAR ARCHIVO DE REPROTE                                        
511640   MOVE 3 TO ARCH-A-PROCESAR.                                                 
511650   PERFORM 70000000-CIERRO    THRU 70000000-EXIT.                             
511660                                                                              
51167030000000-EXIT.                                                                
511680   EXIT.                                                                      
511690                                                                              
511700 31000000-PROCESOS.                                                           
511710  MOVE ZEROS TO ARCHPEND-S111  ARCHPEND-EAS  ARCH-A-PROCESAR                  
511720                WS-PROCESO-1-ARCH  WS-OMITIR-RESI WS-NO-PROCESO.              
511740                                                                              
511770  IF (WS-FECHA-PRO      < WS-FECHA-MAQ  AND WS-B02-DECOM-S111 = 0)            
511775      OR                                                                      
511780     (WS-FECHA-PRO-EAS  < WS-FECHA-LINE AND WS-OMITIR-ECMS    = 0)            
511840                                                                              
511850*    ENCENDER BANDERAS DE ARCHIVOS PENDIENTES                                 
511860     PERFORM 31200000-VALIDAR-ARCH-PEND THRU 31200000-EXIT                    
511870*    LOGICA PARA PROCESAR ARCHIVOS , PRIORIDAD S111 LUEGO ECMS                
511880     PERFORM 31300001-PROCESAR-ARCH     THRU 31300001-EXIT                    
511890             UNTIL WS-PROCESO-1-ARCH = 1 OR WS-NO-PROCESO = 1                 
511895     IF WS-NO-PROCESO = 0                                                     
511900*       PROYECTA SIG FEC, ACT FEC B02 Y CIERRA ARCHIVOS                       
511910        PERFORM 31400000-PROY-ACT-CIERRA    THRU 31400000-EXIT                
511912     ELSE                                                                     
511914*       NO PROCESO NINGUN ARCHIVO POR ALGUN ERROR DE TRAILER                  
511916        NEXT SENTENCE                                                         
511918  ELSE                                                                        
511920***   NO EXISTE ARCHIVOS PENDIENTES A PROCESAR ***                            
511922      MOVE 1             TO WS-FIN-PROCESOS.                                  
511924 31000000-EXIT.                                                               
511926   EXIT.                                                                      
511928                                                                              
511930 30000100-VAL-FEC-HABIL-EAS.                                                  
511932* PROCESO VALIDAR LA FECHA DE EAS SEA HABIL DE LO CONTRARIO                   
511934* PROYECTAR PROXIMA FECHA HABIL                                               
511936  MOVE 0  TO WS-NO-ES-DIAHABIL.                                               
511938  PERFORM 20004510-VAL-DIA-HABIL.                                             
511940                                                                              
511942 IF WS-NO-ES-DIAHABIL  = 1                                                    
511944*   SI LA FECHA ES DIA INHABIL NECESITAMOS PROYECTA LA SIG HABIL              
511946      MOVE    WS-FECHA-PRO-EAS          TO WS-FECHA-DIARIOEASP                
511948      PERFORM 20006513-PROYDIAHABIL     THRU 20006513-EXIT                    
511950*  ACTUALIZAMOS LA FECHA EN B02                                               
511952      MOVE    2                          TO   ARCH-A-PROCESAR                 
511954      PERFORM 70001000-OPEN-BASEUP       THRU 70001000-EXIT                   
511956      PERFORM 70002000-ACTB02            THRU 70002000-EXIT                   
511958*  REALIZAR LA CONSULTA DE FECHAS DE B02                                      
511960      PERFORM 20002000-FECHA-PRO         THRU 20002000-EXIT                   
511962      PERFORM 20007000-CIERRO-BASE       THRU 20007000-EXIT                   
511965                                                                              
511970      STRING "FECHA EN B02 PARA EAS DIAR. INHABIL: "                          
511975              WS-FECHA-DIARIOEASP                                             
511980               " SE ACTUALIZO AL PROX HABIL:" WS-FECHA-PRO-EAS                
511985               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
511990               PERFORM 70000050-MENSAJE.                                      
511995                                                                              
512000 30000100-EXIT.                                                               
512005   EXIT.                                                                      
512010******************************************************************            
512510* ARMO LOS ARCHIVOS DEPENDIENDO DEL PROCESO DIARIO O SEMANAL.                 
513010******************************************************************            
513510 50001000-SEPARO.                                                             
513560                                                                              
513610     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
513660            OF MYSELF.                                                        
513710     ALLOW INTERRUPT.                                                         
513760                                                                              
514010     IF WS-TAR-DS = "TARJETADIA"                                              
514510        PERFORM 50002000-DIARIO                                               
515010     ELSE                                                                     
515510        PERFORM 50003000-SEMANAL.                                             
516010 50001000-EXIT.                                                               
516510    EXIT.                                                                     
516520*****************************************************************             
516530**   L O G I C A   D E   P R O C E S A R   A R C H I V O S     **             
516540*****************************************************************             
516550 31200000-VALIDAR-ARCH-PEND.                                                  
516565   IF WS-FECHA-PRO <  WS-FECHA-MAQ AND WS-B02-DECOM-S111 = 0                  
516570      MOVE 1 TO ARCHPEND-S111.                                                
516580   IF WS-FECHA-PRO-EAS < WS-FECHA-LINE                                        
516590      MOVE 1 TO ARCHPEND-EAS.                                                 
516600 31200000-EXIT.                                                               
516610   EXIT.                                                                      
516620                                                                              
516630                                                                              
516640 31400000-PROY-ACT-CIERRA.                                                    
516650*  PROYECTAR SIGUIENTE FECHA DE ARCH                                          
516660   PERFORM 20001000-ABRO-BASE         THRU 20001000-EXIT                      
516670   PERFORM 20006500-PROYSIGDIA        THRU 20006500-EXIT.                     
516680   PERFORM 20007000-CIERRO-BASE       THRU 20007000-EXIT.                     
516690                                                                              
516700*  CIERRA ARCHIVOS MOVS Y ACTUALIZA FECHA B02                                 
516710   PERFORM 70000000-CIERRO            THRU 70000000-EXIT.                     
516720                                                                              
516730*  ENVIAR ARCHIVO MOVS CON COBERTURA MTY CSI 04 CON AYUDA DEL P197            
516740   PERFORM 60004100-ENVIO-ARCH-P197  THRU 60004100-EXIT.                      
516750                                                                              
516760*  OBTEN LA SIGUIENTE FECHA PARA ARCHIVOS DE B02                              
516770   PERFORM 20001000-ABRO-BASE         THRU 20001000-EXIT.                     
516780   PERFORM 20002000-FECHA-PRO         THRU 20002000-EXIT.                     
516790   PERFORM 20007000-CIERRO-BASE       THRU 20007000-EXIT.                     
516800                                                                              
516810 31400000-EXIT.                                                               
516820   EXIT.                                                                      
516830                                                                              
51684031300005-ARCHNORESID-MSJ-LJ.                                                  
516842                                                                              
516844 IF ARCH-S111                                                                 
516846    IF WS-TAR-DS = "TARJETADIA"                                               
516848       STRING "ARCHIVO S111 DIAR. NO ENCONTRADO " WS-ETIQTARJETA              
516850               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
516852    ELSE                                                                      
516854       STRING "ARCHIVO S111 SEM. NO ENCONTRADO " WS-ETIQTBINTER               
516856               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
516858 ELSE IF ARCH-ECMS                                                            
516860     IF WS-TAR-DS = "TARJETADIA"                                              
516862        STRING "ARCHIVO EAS DIAR. NO ENCONTRADO " WS-ETIQEAS                  
516864                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
516866     ELSE                                                                     
516868        STRING "ARCHIVO EAS SEM. NO ENCONTRADO " WS-ETIQEAS-SEM               
516870                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG.                      
516872                                                                              
516874 PERFORM 70000050-MENSAJE.                                                    
516876                                                                              
516878 31300005-EXIT.                                                               
516880  EXIT.                                                                       
516882                                                                              
51688431300001-PROCESAR-ARCH.                                                       
516902                                                                              
516904 IF SI-ARCHPEND-S111 AND WS-PROCESO-1-ARCH = 0                                
516910    PERFORM 31310000-VALIDA-PROC-ARCH111.                                     
516920 IF SI-ARCHPEND-EAS  AND WS-PROCESO-1-ARCH = 0 AND                            
516925    WS-NO-PROCESO = 0 AND WS-OMITIR-ECMS = 0                                  
516930    PERFORM 31320000-VALIDA-PROC-ARCHEAS.                                     
516940                                                                              
516950 31300001-EXIT.                                                               
516960   EXIT.                                                                      
516970*****************************************************************             
516980* EL CAMPO "ARCH-A-PROCESAR" NOS INDICA QUE ARCHIVO PROCESAR:                 
516990* 1 = PARA PROCESO DE ARCHIVO S111                                            
517000* 2 = PARA PROCESO DE ARCHIVO EAS (ECMS)                                      
517010*****************************************************************             
517020                                                                              
517030*** RUTINA PARA VALIDAR EL PROCESAMIENTO DE UN ARCHIVO S111 *****             
51704031310000-VALIDA-PROC-ARCH111.                                                 
517050  MOVE 1 TO ARCH-A-PROCESAR.                                                  
517060  PERFORM 31310100-CHANGE-TIT-ARCH THRU 31310100-EXIT.                        
517070                                                                              
517080  IF WS-TAR-DS = "TARJETADIA"                                                 
517090     IF SI-ARCHPEND-EAS AND WS-OMITIR-ECMS = 0                                
517100        IF ATTRIBUTE RESIDENT  OF TARJETA = VALUE TRUE                        
517110           PERFORM 31310200-VE-A-PROCESAR  THRU 31310200-EXIT                 
517120        ELSE                                                                  
517130           PERFORM 31300005-ARCHNORESID-MSJ-LJ THRU 31300005-EXIT             
517140     ELSE                                                                     
517150         PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT.                   
517160                                                                              
517170  IF WS-TAR-DS = "TARJETASEM"                                                 
517180     IF SI-ARCHPEND-EAS AND WS-OMITIR-RESI = 0                                
517190        IF ATTRIBUTE RESIDENT OF TBINTERNAL = VALUE TRUE                      
517200           PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT                  
517210        ELSE                                                                  
517220           PERFORM 31300005-ARCHNORESID-MSJ-LJ THRU 31300005-EXIT             
517230     ELSE                                                                     
517240         PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT.                   
517250 31310000-EXIT.                                                               
517260   EXIT.                                                                      
517270                                                                              
517280*** RUTINA PARA VALIDAR EL PROCESAMIENTO DE UN ARCHIVO ECMS   ***             
517290 31320000-VALIDA-PROC-ARCHEAS.                                                
517300  MOVE 2 TO ARCH-A-PROCESAR.                                                  
517310  PERFORM 31310100-CHANGE-TIT-ARCH.                                           
517320                                                                              
517330  IF WS-TAR-DS = "TARJETADIA"                                                 
517350     IF ATTRIBUTE RESIDENT OF ARCH-EAS = VALUE TRUE                           
517360        PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT                     
517370     ELSE                                                                     
517375        PERFORM 31300005-ARCHNORESID-MSJ-LJ THRU 31300005-EXIT                
517380        PERFORM 31320300-ESPERAR-SIG-INTENTO THRU 31320300-EXIT.              
517410                                                                              
517420  IF WS-TAR-DS = "TARJETASEM"                                                 
517430     IF SI-ARCHPEND-S111  AND WS-OMITIR-RESI = 0                              
517440        IF ATTRIBUTE RESIDENT OF ARCH-EAS-SEM = VALUE TRUE                    
517450           PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT                  
517460        ELSE                                                                  
517465           PERFORM 31300005-ARCHNORESID-MSJ-LJ THRU 31300005-EXIT             
517470           PERFORM 31320300-ESPERAR-SIG-INTENTO THRU 31320300-EXIT            
517480     ELSE                                                                     
517490        PERFORM 31310200-VE-A-PROCESAR THRU 31310200-EXIT.                    
517500                                                                              
517510 31320000-EXIT.                                                               
517520  EXIT.                                                                       
517530                                                                              
517540**** RUTINA PARA LA ASIGNACION DE NOMBRE ARCHIVO S111 O EAS  ****             
517550 31310100-CHANGE-TIT-ARCH.                                                    
517560   IF ARCH-A-PROCESAR = 1                                                     
517570      IF WS-TAR-DS = "TARJETADIA"                                             
517580         CHANGE ATTRIBUTE TITLE OF TARJETA TO WS-ETIQTARJETA                  
517590      ELSE                                                                    
517600         CHANGE ATTRIBUTE TITLE OF TBINTERNAL TO WS-ETIQTBINTER               
517610                                                                              
517620   ELSE IF ARCH-A-PROCESAR = 2                                                
517630      IF WS-TAR-DS = "TARJETADIA"                                             
517640         CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS                     
517650      ELSE                                                                    
517660         CHANGE ATTRIBUTE TITLE OF ARCH-EAS-SEM TO WS-ETIQEAS-SEM.            
517670                                                                              
517680 31310100-EXIT.                                                               
517690   EXIT.                                                                      
517700                                                                              
517710                                                                              
517720**** RUTINA PARA PROCESAR SOLO 1 ARCHIVO (DIARIO O SEMANAL) ****              
517730 31310200-VE-A-PROCESAR.                                                      
517740   MOVE 0 TO  WS-NOPROC-ERR-TRAI  WS-FIN-DIARIO  WS-FIN-SEMANAL               
517745                                                                              
517750   IF WS-TAR-DS = "TARJETADIA"                                                
517760      PERFORM 50002000-DIARIO UNTIL WS-FIN-DIARIO = 1 OR                      
517765                                    WS-NOPROC-ERR-TRAI = 1                    
517770   ELSE                                                                       
517780      PERFORM 50003000-SEMANAL UNTIL WS-FIN-SEMANAL = 1 OR                    
517782                                     WS-NOPROC-ERR-TRAI = 1.                  
517784   IF WS-FIN-DIARIO = 1 OR WS-FIN-SEMANAL = 1                                 
517790*     BANDERA PARA SALIR E IR A 31400000-PROY-ACT-CIERRA                      
517800      MOVE 1 TO WS-PROCESO-1-ARCH                                             
517802   ELSE IF WS-NOPROC-ERR-TRAI = 1                                             
517804*     BANDERA PARA SALIR POR ALGUN ERROR                                      
517806      MOVE 1 TO WS-NO-PROCESO.                                                
517810 31310200-EXIT.                                                               
517820   EXIT.                                                                      
517830                                                                              
517840** RUTINAS PARA LA ESPERA DE 5 MIN ANTES DEL SIGUIENTE INTENTO **             
517850 31320300-ESPERAR-SIG-INTENTO.                                                
517852                                                                              
517854   IF WS-TAR-DS = "TARJETADIA"                                                
517856*     SI UN ARCHIVO DIARIO EAS NO ESTA, YA NO SE VOLVERA A BUSCAR             
517858      MOVE 1 TO WS-OMITIR-ECMS                                                
517860   ELSE                                                                       
517862*     SI EL ARCH SEM EAS NO ESTA, SE OMITIRA PREGUNTAR RESIDENCIA             
517864      MOVE 1 TO WS-OMITIR-RESI.                                               
517866                                                                              
517868   IF ((SI-ARCHPEND-S111 OR WS-B02-DECOM-S111 = 1)    AND                     
517869                            WS-TAR-DS = "TARJETADIA") OR                      
517870                           (WS-TAR-DS = "TARJETASEM")                         
517872*      EL WAIT APLICARA CUANDO                                                
517874*         1: EXISTEN ARCH DIARIOS DEL S111 PENDIENTES.                        
517875*            O EXT ARCH DIARIO EAS PTE. Y BANDERA DECOM PRENDIDA.             
517876*         2: EXISTEN ARCHIVOS SEMANALES PENDIENTES (S111 O EAS).              
517878       WAIT(300)                                                              
517880   ELSE                                                                       
517882*      CUANDO SOLO EXISTA(N) ARCHIVO(S) PEND DIARIO(S) DE EAS Y               
517884*       NO SE ENCONTRO EL PRIMERO DEBEREMOS SALIR SIN PROCESAR                
517886*       Y SIN HACER EL WAIT(APLICA PARA BANDERA DECOMISO APAGADA).            
517888       MOVE 1 TO WS-NO-PROCESO.                                               
517890                                                                              
517900 31320300-EXIT.                                                               
517910   EXIT.                                                                      
517930                                                                              
518030                                                                              
518050 31310110-CHANGETIT-ARCH-ERR.                                                 
518100   IF ARCH-A-PROCESAR = 1                                                     
518150      IF WS-TAR-DS = "TARJETADIA"                                             
518200         CHANGE ATTRIBUTE TITLE OF TARJETA TO WS-ETIQTARJETA-ERROR            
518220         CLOSE  TARJETA   WITH SAVE                                           
518250      ELSE                                                                    
518300         CHANGE ATTRIBUTE TITLE OF TBINTERNAL                                 
518320                                TO WS-ETIQTBINTER-ERROR                       
518340         CLOSE  TBINTERNAL WITH SAVE                                          
518350                                                                              
518400   ELSE IF ARCH-A-PROCESAR = 2                                                
518450      IF WS-TAR-DS = "TARJETADIA"                                             
518500         CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS-ERR                 
518520         CLOSE  ARCH-EAS  WITH SAVE                                           
518550      ELSE                                                                    
518600         CHANGE ATTRIBUTE TITLE OF ARCH-EAS-SEM                               
518620                                TO WS-ETIQEAS-SEM-ERR                         
518640         CLOSE  ARCH-EAS-SEM  WITH SAVE.                                      
518650                                                                              
518700 31310110-EXIT.                                                               
518750   EXIT.                                                                      
518800                                                                              
518850******************************************************************            
518900* REALIZO LAS RUTINAS DEL PROCESO DIARIO.                                     
518950******************************************************************            
519010 50002000-DIARIO.                                                             
519510     MOVE ZEROES TO TAB-BNC TAB-CSI-MOV TAB-TOTALES SW-LEC-TAR                
520010                    WS-SUM-TOT-BRUTO WS-SUM-TOT-NETO                          
520510                    WS-SUM-TOT-COMIS IND-TIPO-MOV                             
521010                    REG-LEIDOS TOTAL-X-PARTES TOTAL-TOTAL                     
521012                    WS-TOTAL-NUMREG WS-TOTAL-IMPORT                           
521014                    WS-SUM-TOT-SIST  WS-SUM-TOT-EAS                           
521020*INI EAS F5                                                                   
521040                    REG-LEIDOS-EAS TOTAL-TOTAL-EAS WS-1VEZ                    
521060                    W-LLAVE-EASDIARIO WS-1VEZ-EAS W-LLAVE-TARJETA             
521080                    TAB-CSI-MOV-EAS TAB-CSI-MOV TAB-TOTALES                   
521100                    TAB-TOTALES-EAS WS-ERROR-TRAILER WS-HEA-FEC-D             
521110                    WS-HEA-SIS-D.                                             
521120                                                                              
521140    PERFORM 50002115-OPEN-VALHEADER THRU 50002115-EXIT                        
521160                      UNTIL WS-HEA-FEC-D = 1 AND WS-HEA-SIS-D =1.             
521180                                                                              
521200    IF ARCH-S111                                                              
521220        PERFORM 50002120-WRITE-HEADER-MOVS THRU 50002120-EXIT                 
521240     ELSE IF ARCH-ECMS                                                        
521260        PERFORM 50002125-WRITE-HEADER-MOVSEAS THRU 50002125-EXIT.             
521280                                                                              
521510                                                                              
522010*     PERFORM 50002100-LEO-HEADER     THRU 50002100-EXIT.                     
522015    IF ARCH-S111                                                              
522020       PERFORM 50002230-LEO-DETALLE-S111 THRU 50002230-EXIT                   
522022                                        UNTIL WS-1VEZ = 1.                    
522024    IF ARCH-ECMS                                                              
522026*     IF WS-OPENED-EAS-FILE = 1                                               
522200       PERFORM 50002240-LEO-DETALLE-EAS  THRU 50002240-EXIT                   
522400                                        UNTIL WS-1VEZ-EAS = 1.                
522510*     PERFORM 50002200-LEO-DETALLE    THRU 50002200-EXIT UNTIL                
523010*     WS-1VEZ = 1.                                                            
523020    PERFORM 50002450-VAL-TRAILER    THRU 50002450-EXIT                        
523100                                                                              
523200*** VALIDAR SI EL TRAILER DEL ARCHIVO DIARIO FUE CORRECTO  ******             
523300***       O SI ESTUVO INCORRECTO Y SE DECIDIO CONTINUAR *********             
523400    IF WS-NOPROC-ERR-TRAI = 0                                                 
523510       PERFORM 50002500-SUM-TAR        THRU 50002500-EXIT                     
524010       PERFORM 50002600-IMP-TAR        THRU 50002600-EXIT                     
524200       MOVE    1                       TO   WS-FIN-DIARIO.                    
524400                                                                              
524510 50002000-EXIT.                                                               
524600   EXIT.                                                                      
524700                                                                              
524800                                                                              
524900 50002115-OPEN-VALHEADER.                                                     
524950  PERFORM 31310100-CHANGE-TIT-ARCH THRU 31310100-EXIT                         
525000  PERFORM 20005000-ABRO-ARC        THRU 20005000-EXIT                         
525100  MOVE    0                        TO WS-HEA-FEC-D  WS-HEA-SIS-D              
525200  IF ARCH-S111                                                                
525300     PERFORM 50002100-LEO-HEADER     THRU 50002100-EXIT                       
525400  ELSE IF ARCH-ECMS                                                           
525500     PERFORM 50002110-LEO-HEADER-EAS-DIARIO THRU 50002110-EXIT.               
525700 50002115-EXIT.                                                               
525800   EXIT.                                                                      
525900                                                                              
526010******************************************************************            
526510* VALIDO EL HEADER DEL ARCHIVO DIARIO.                                        
527010* Y GRABO EL HEADER DE LOS 2 CSIÀS.                                           
527510******************************************************************            
528010 50002100-LEO-HEADER.                                                         
528510     MOVE 1 TO W-LLAVE-TARJETA.                                               
529010     READ TARJETA INTO REG-TBINTER INVALID KEY                                
530510       MOVE "ERROR AL LEER HEAD. ARC DIARIO"  TO WS-0101-TEXT-MSG             
531010       PERFORM 70000050-MENSAJE                                               
531510       CALL SYSTEM DMTERMINATE.                                               
531600     MOVE REG-TBINTER                TO REG-TBINTER-ANT.                      
532010                                                                              
532020     MOVE WS-FECHA-PRO               TO       WS-FECHA-TEMP-AMD               
532510     IF (WS-TEMP-AA = WS-INTCTL-AA)  AND                                      
533010        (WS-TEMP-MM = WS-INTCTL-MM)  AND                                      
533510        (WS-TEMP-DD = WS-INTCTL-DD)                                           
534010         MOVE 1 TO WS-HEA-FEC-D                                               
534510     ELSE                                                                     
536010       MOVE "FEC INT. DIF. PROC. ARC DIARIO"  TO WS-0101-TEXT-MSG             
536510       PERFORM 70000050-MENSAJE.                                              
537010*       CALL SYSTEM DMTERMINATE.                                              
537510                                                                              
538010      IF WS-INTCTL-ID-UNO       = "S111"                                      
538510*        NEXT SENTENCE                                                        
538600         MOVE 1 TO WS-HEA-SIS-D                                               
539010     ELSE                                                                     
540510       MOVE "SIS. INT. DIFERENTE DE S111   "  TO WS-0101-TEXT-MSG             
541010       PERFORM 70000050-MENSAJE.                                              
541510*       CALL SYSTEM DMTERMINATE.                                              
541520                                                                              
541540     IF WS-HEA-FEC-D = 0 OR WS-HEA-SIS-D=0                                    
541550        PERFORM 31310110-CHANGETIT-ARCH-ERR  THRU 31310110-EXIT               
541580        STRING "ARCH CON HEADER ERRONEO " WS-ETIQTARJETA                      
541600               "INYECTAR ARC DIARIO CON HEADER CORRECTO Y DAR OK"             
541620               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
541640*   "O" = a pantalla y Log  no acumula mensajes  se va a STOP                 
541650               MOVE "O" TO W77-TIPO-DISP                                      
541660               PERFORM 70000050-MENSAJE                                       
541680*   DEVOLVERLO A "E" = solo a log        si acumula mensajes                  
541690               MOVE "E" TO W77-TIPO-DISP.                                     
542010                                                                              
542012*INI-STEFANINI EAS F2                                                         
542014*     IF ATTRIBUTE OPEN OF ARCH-EAS = VALUE TRUE                              
542016*        PERFORM 50002110-LEO-HEADER-EAS-DIARIO.                              
542018*FIN-STEFANINI EAS F2                                                         
542100 50002100-EXIT.                                                               
542200     EXIT.                                                                    
542300                                                                              
54240050002120-WRITE-HEADER-MOVS.                                                   
542510     MOVE WS-INTCTL-DD            TO WS-ETIQTARJETA-DD                        
543010     MOVE WS-INTCTL-MM            TO WS-ETIQTARJETA-MM                        
543510     MOVE WS-INTCTL-AA            TO WS-ETIQTARJETA-AA                        
543600     MOVE SPACES            TO REG-TBINTER-CTL-S                              
543800*    FECHA DDMMAA                                                             
544010     MOVE WS-INTCTL-FECHA   TO WS-INTCTL-FECHA-S.                             
544510     MOVE WS-INTCTL-ID      TO WS-INTCTL-ID-S.                                
545010     MOVE "D"               TO WS-INTCTL-PROCESO-S.                           
545510     MOVE 1 TO WS-INTTIP-ARCH-S.                                              
546010     MOVE 1 TO WS-INTCTL-CSI-S.                                               
546510                                                                              
547010     MOVE 04    TO WS-ETIQ-CSIDES.                                            
547510     CHANGE ATTRIBUTE TITLE OF TBINTERMON TO WS-ETIQ-TAR-CAJ-CSI.             
548010     OPEN OUTPUT TBINTERMON.                                                  
548510                                                                              
549010     MOVE 10    TO WS-ETIQ-CSIDES.                                            
549510     CHANGE ATTRIBUTE TITLE OF TBINTERVDM TO WS-ETIQ-TAR-CAJ-CSI.             
550010     OPEN OUTPUT TBINTERVDM.                                                  
550510                                                                              
551010     MOVE 4 TO WS-INTCTL-CSI-S.                                               
551510     WRITE REG-TBINTERMON FROM REG-TBINTER-S INVALID KEY                      
553010       MOVE "ERR.AL GRAB HEADER MTY. DIARIO"  TO WS-0101-TEXT-MSG             
553510       PERFORM 70000050-MENSAJE                                               
554010       CALL SYSTEM DMTERMINATE.                                               
554510                                                                              
555010     MOVE 10 TO WS-INTCTL-CSI-S.                                              
555510     WRITE REG-TBINTERVDM FROM REG-TBINTER-S INVALID KEY                      
557010       MOVE "ERR.AL GRAB HEADER VDM. DIARIO"  TO WS-0101-TEXT-MSG             
557510       PERFORM 70000050-MENSAJE                                               
558010       CALL SYSTEM DMTERMINATE.                                               
558020                                                                              
558030  50002120-EXIT.                                                              
558040    EXIT.                                                                     
558050                                                                              
558060                                                                              
558070 50002125-WRITE-HEADER-MOVSEAS.                                               
558080*FECHAS PARA CREAR RUTA DEL NUEVO MOVSTBINTER DE EAS DIARIO                   
558090   MOVE EAS-INTCTL-DD              TO WS-ETIQTARJETA-DD-EAS                   
558100   MOVE EAS-INTCTL-MM              TO WS-ETIQTARJETA-MM-EAS                   
558110   MOVE EAS-INTCTL-AA              TO WS-ETIQTARJETA-AA-EAS                   
558120                                                                              
558130*CREAMOS EL ARCHIVO MOVSTBINTER DE EAS CSI 04                                 
558140   MOVE 04    TO WS-ETIQ-CSIDES-EAS                                           
558150   CHANGE ATTRIBUTE TITLE OF TBINTERMON-EAS                                   
558160                          TO WS-ETIQ-TAR-CAJ-CSI-EAS                          
558170   OPEN OUTPUT TBINTERMON-EAS                                                 
558180                                                                              
558190*CREAMOS EL ARCHIVO MOVSTBINTER DE EAS CSI 10                                 
558200   MOVE 10    TO WS-ETIQ-CSIDES-EAS                                           
558210   CHANGE ATTRIBUTE TITLE OF TBINTERVDM-EAS                                   
558220                          TO WS-ETIQ-TAR-CAJ-CSI-EAS                          
558230   OPEN OUTPUT TBINTERVDM-EAS                                                 
558240                                                                              
558250   MOVE SPACES                    TO REG-TBINTER-CTL-S                        
558260*MOVES ESCRIBIR EL HEADER DEL MOVSTBINTER DE EAS DIARIO                       
558270   MOVE EAS-R01-SISTEMA           TO WS-INTCTL-ID-S                           
558280*  REACOMODAR EL AAMMDD DEL TBINTER AL DDMMAA DEL MOVS                        
558290   MOVE EAS-INTCTL-AA             TO WS-FECHA6-AA                             
558300   MOVE EAS-INTCTL-MM             TO WS-FECHA6-MM                             
558310   MOVE EAS-INTCTL-DD             TO WS-FECHA6-DD                             
558320   MOVE WS-FECHA6-DDMMAA          TO WS-INTCTL-FECHA-S                        
558330                                                                              
558340   MOVE "D"                       TO WS-INTCTL-PROCESO-S                      
558350   MOVE 1                         TO WS-INTTIP-ARCH-S                         
558360                                                                              
558370*GRABAMOS EL HEADER DEL MOVSTBINTER DE EAS CSI 04                             
558380   MOVE 4 TO WS-INTCTL-CSI-S                                                  
558390   WRITE REG-TBINTERMON-EAS FROM REG-TBINTER-S INVALID KEY                    
558400     MOVE "ERR.AL GRAB HEADER EAS MTY. DIARIO" TO WS-0101-TEXT-MSG            
558410     PERFORM 70000050-MENSAJE                                                 
558420     CALL SYSTEM DMTERMINATE.                                                 
558430                                                                              
558440*GRABAMOS EL HEADER DEL MOVSTBINTER DE EAS CSI 10                             
558450   MOVE 10 TO WS-INTCTL-CSI-S                                                 
558460   WRITE REG-TBINTERVDM-EAS FROM REG-TBINTER-S INVALID KEY                    
558470     MOVE "ERR.AL GRAB HEADER EAS VDM. DIARIO" TO WS-0101-TEXT-MSG            
558480     PERFORM 70000050-MENSAJE                                                 
558490     CALL SYSTEM DMTERMINATE.                                                 
558500                                                                              
558510 50002125-EXIT.                                                               
558520     EXIT.                                                                    
558530                                                                              
558540                                                                              
558550                                                                              
559012*INI-STEFANINI EAS F3                                                         
559014 50002150-JUNTO-DETALLES.                                                     
559016    OPEN OUTPUT ARCH-DET-B.                                                   
559018    MOVE 1        TO W-LLAVE-TARJETA   W-LLAVE-INTER                          
559020                     W-LLAVE-EASDIARIO W-LLAVE-EASSEM.                        
559021    IF WS-OPENED-EAS-FILE = 1                                                 
559022    PERFORM 50002060-LEE-DETALLE-EAS  UNTIL WS-FIN-ARCH-EAS  = 1.             
559024    PERFORM 50002055-LEE-DETALLE-S111 UNTIL WS-FIN-ARCH-S111 = 1.             
559026    CLOSE ARCH-DET-B WITH SAVE.                                               
559028                                                                              
559030    IF WS-TAR-DS = "TARJETASEM"                                               
559032      PERFORM 50002065-SORT-ARCH-DET.                                         
559034                                                                              
559036    OPEN INPUT ARCH-DET-B.                                                    
559038    MOVE ZEROES TO W-LLAVE-TARJETA   W-LLAVE-INTER                            
559040                   W-LLAVE-EASDIARIO W-LLAVE-EASSEM W-LLAVE-DETB.             
559042 50002150-EXIT.                                                               
559044     EXIT.                                                                    
559046                                                                              
559048 50002055-LEE-DETALLE-S111.                                                   
559050    ADD 1   TO W-LLAVE-TARJETA                                                
559052               W-LLAVE-INTER.                                                 
559054                                                                              
559056    IF WS-TAR-DS = "TARJETADIA"                                               
559058      READ TARJETA INTO REG-TBINTER INVALID KEY                               
559060         MOVE 1   TO WS-FIN-ARCH-S111                                         
559061    ELSE                                                                      
559064      READ TBINTERNAL INTO REG-TBINTER INVALID KEY                            
559066         MOVE 1   TO WS-FIN-ARCH-S111.                                        
559068                                                                              
559070    IF WS-FIN-ARCH-S111 = 0                                                   
559072       IF WS-INTRAIL-TIPREG-E = "T"                                           
559074            MOVE 1                  TO WS-FIN-ARCH-S111                       
559076       ELSE                                                                   
559078            MOVE REG-TBINTER        TO REG-TBINTER-B                          
559080            MOVE 1                  TO ORIGEN-SIST                            
559082            MOVE WS-INTNUM-CONTRATO TO CONTRATO-SORT                          
559084            ADD  1                  TO W-LLAVE-DETB                           
559086            WRITE DET-REG FROM REG-TBINTER-B.                                 
559088                                                                              
559090 50002060-LEE-DETALLE-EAS.                                                    
559092    ADD 1 TO W-LLAVE-EASDIARIO                                                
559094             W-LLAVE-EASSEM.                                                  
559095    IF WS-TAR-DS = "TARJETADIA" AND WS-OPENED-EAS-FILE = 0                    
559096       MOVE 1   TO WS-FIN-ARCH-EAS.                                           
559097                                                                              
559098    IF WS-TAR-DS = "TARJETADIA" AND WS-OPENED-EAS-FILE = 1                    
559100*      ATTRIBUTE OPEN OF ARCH-EAS = VALUE TRUE                                
559102         READ ARCH-EAS INTO REG-EAS INVALID KEY                               
559104            MOVE 1   TO WS-FIN-ARCH-EAS                                       
559105    ELSE                                                                      
559106     IF WS-TAR-DS = "TARJETASEM" AND WS-OPENED-EAS-FILE = 1                   
559108      READ ARCH-EAS-SEM INTO REG-EAS-SEM INVALID KEY                          
559110         MOVE 1   TO WS-FIN-ARCH-EAS.                                         
559112                                                                              
559114    IF WS-FIN-ARCH-EAS = 0                                                    
559116       IF EAS-R03-TIPREG  = "T" OR EAS-R03S-TIPREG = "T"                      
559118            MOVE 1                  TO WS-FIN-ARCH-EAS                        
559120       ELSE                                                                   
559122         IF WS-TAR-DS = "TARJETADIA"                                          
559124            MOVE REG-EAS             TO REG-TBINTER-B                         
559126            MOVE EAS-R02-CONTRATO    TO CONTRATO-SORT                         
559128            MOVE 2                   TO ORIGEN-SIST                           
559130            ADD  1                   TO W-LLAVE-DETB                          
559132            WRITE DET-REG FROM REG-TBINTER-B                                  
559134         ELSE                                                                 
559136            MOVE REG-EAS-SEM         TO REG-TBINTER-B                         
559138            MOVE EAS-R02S-CONTRATO   TO CONTRATO-SORT                         
559140            MOVE 2                   TO ORIGEN-SIST                           
559142            ADD  1                   TO W-LLAVE-DETB                          
559144            WRITE DET-REG FROM REG-TBINTER-B.                                 
559146                                                                              
559148 50002065-SORT-ARCH-DET.                                                      
559150    OPEN INPUT ARCH-DET-B                                                     
559152    MOVE ATTRIBUTE UNITS       OF ARCH-DET-B TO W77-UNITS                     
559154    MOVE ATTRIBUTE MAXRECSIZE  OF ARCH-DET-B TO W77-MAXRECSIZE                
559156    ADD ATTRIBUTE  LASTRECORD  OF ARCH-DET-B TO W77-TOT-REGS                  
559158    ADD 10 TO W77-TOT-REGS                                                    
559160    CLOSE ARCH-DET-B WITH SAVE.                                               
559162*      CONVERTIR MAXRECSIZE A PALABRAS EN CASO DE SER NECESARIO               
559164   IF W77-UNITS NOT = 0                                                       
559166      IF (FUNCTION MOD(W77-MAXRECSIZE,6)) > 0                                 
559168         COMPUTE W77-MAXRECSIZE =                                             
559170            FUNCTION DIV(W77-MAXRECSIZE,6) + 1                                
559172      ELSE                                                                    
559174         COMPUTE W77-MAXRECSIZE =                                             
559176            FUNCTION DIV(W77-MAXRECSIZE,6).                                   
559178                                                                              
559180*     SE CALCULA EL MEMORY SIZE                                               
559182   COMPUTE W77-MEMORY-SIZE =((W77-TOT-REGS / 16)                              
559184                             * (W77-MAXRECSIZE + 3)) + 1500.                  
559186   IF W77-MEMORY-SIZE < 400000                                                
559188      MOVE 400000 TO W77-MEMORY-SIZE                                          
559190   ELSE                                                                       
559192     IF W77-MEMORY-SIZE > 258435000                                           
559194        MOVE 258435000 TO W77-MEMORY-SIZE.                                    
559196                                                                              
559198*     SE CALCULA EL DISK SIZE                                                 
559200   COMPUTE W77-DISK-SIZE = W77-MAXRECSIZE * W77-TOT-REGS * 3.5.               
559202                                                                              
559204   SORT ARCH-DET-SORT ON ASCENDING KEY SORT-CONT                              
559206   USING  ARCH-DET-B                                                          
559208   GIVING ARCH-DET-B                                                          
559210   MEMORY W77-MEMORY-SIZE WORDS                                               
559212   DISK   W77-DISK-SIZE WORDS.                                                
559214                                                                              
559216******************************************************************            
559218* VALIDO EL HEADER DEL ARCHIVO DIARIO DE EAS.                    *            
559220******************************************************************            
559222 50002110-LEO-HEADER-EAS-DIARIO.                                              
559224     MOVE 1    TO W-LLAVE-EASDIARIO.                                          
559226     READ ARCH-EAS INTO REG-EAS INVALID KEY                                   
559228       MOVE "ERROR AL LEER HEAD. EAS ARC DIARIO"                              
559230         TO WS-0101-TEXT-MSG                                                  
559232       PERFORM 70000050-MENSAJE                                               
559234       CALL SYSTEM DMTERMINATE.                                               
559236                                                                              
559238     IF WS-FECHA-PRO-EAS-AAMMDD = EAS-R01-FECHA                               
559240         MOVE 1 TO WS-HEA-FEC-D                                               
559242     ELSE                                                                     
559244        MOVE "FEC INT. DIF. PROC. EAS ARC DIARIO"                             
559246          TO WS-0101-TEXT-MSG                                                 
559248        PERFORM 70000050-MENSAJE.                                             
559250*        CALL SYSTEM DMTERMINATE.                                             
559252                                                                              
559254     IF EAS-R01-SISTEMA = 175172                                              
559256*        NEXT SENTENCE                                                        
559260        MOVE 1 TO WS-HEA-SIS-D                                                
559270     ELSE                                                                     
559280        MOVE "SIS. INT. DIFERENTE DE EAS DIARIO"                              
559290          TO WS-0101-TEXT-MSG                                                 
559300        PERFORM 70000050-MENSAJE.                                             
559310*        CALL SYSTEM DMTERMINATE.                                             
559320                                                                              
559330     IF WS-HEA-FEC-D = 0 OR WS-HEA-SIS-D=0                                    
559335        PERFORM 31310110-CHANGETIT-ARCH-ERR  THRU 31310110-EXIT               
559350        STRING "ARCH CON HEADER ERRONEO " WS-ETIQEAS                          
559360               "INYECTAR ARC DIARIO CON HEADER CORRECTO Y DAR OK"             
559370               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
559380*   "O" = a pantalla y Log  no acumula mensajes  se va a STOP                 
559385               MOVE "O" TO W77-TIPO-DISP                                      
559390               PERFORM 70000050-MENSAJE                                       
559400*    DEVOLVERLO A "E" = solo a log        si acumula mensajes                 
559405               MOVE "E" TO W77-TIPO-DISP.                                     
559420                                                                              
559430 50002110-EXIT.                                                               
559440     EXIT.                                                                    
559450*FIN-STEFANINI EAS F3                                                         
559510                                                                              
560010******************************************************************            
560510* LEO EL DETALLE DEL ARCHIVO DIARIO.                                          
561010******************************************************************            
561510 50002200-LEO-DETALLE.                                                        
562010*     ADD 1 TO W-LLAVE-TARJETA.                                               
562510*     READ TARJETA INTO REG-TBINTER INVALID KEY                               
562710     ADD 1 TO W-LLAVE-DETB.                                                   
562910     READ ARCH-DET-B INTO REG-TBINTER-B INVALID KEY                           
563010       MOVE 1 TO WS-1VEZ.                                                     
563100*     MOVE REG-TBINTER           TO REG-TBINTER-ANT.                          
563150     MOVE REG-TBINTER-B           TO REG-TBINTER-ANT.                         
563200     IF W77-TAM-REG < 192                                                     
563300*        MOVE WS-INTNUM-CONTRATO-ANT TO WS-INTNUM-CONTRATO                    
563400*        MOVE WS-INTREF-SEQLINEA-ANT TO WS-INTREF-SEQLINEA.                   
563450         MOVE WS-INTNUM-CONTRATO-ANT TO WS-INTNUM-CONTRATO-B                  
563500         MOVE WS-INTREF-SEQLINEA-ANT TO WS-INTREF-SEQLINEA-B.                 
563510                                                                              
563512     IF WS-1VEZ = 0                                                           
563514         ADD 1 TO W77-REG-LEI                                                 
563516         IF ORIGEN-SIST = 1                                                   
563518            PERFORM 50002210-LEO-DET-S111 THRU 50002210-EXIT                  
563520         ELSE                                                                 
563522            PERFORM 50002215-LEO-DET-EAS  THRU 50002215-EXIT.                 
563524                                                                              
563526     IF WS-1VEZ = 0                                                           
563528         MOVE  1                   TO WS-INTTAR-CAJ-S                         
563530         MOVE ORIGEN-SIST          TO WS-INT-S111-O-EAS-S                     
563532         PERFORM 50002250-CVETAR THRU 50002250-EXIT                           
563534         PERFORM 50002300-GRADET THRU 50002300-EXIT.                          
563536                                                                              
564010*     IF WS-1VEZ = 0                                                          
564012*        ADD 1 TO W77-REG-LEI                                                 
564510*        IF WS-INTRAIL-TIPREG-E = "T"                                         
565010*           PERFORM 50002450-VAL-TRAILER THRU 50002450-EXIT                   
565510*        ELSE                                                                 
566010*           MOVE WS-INTCVE-TRAN  TO TB-CVE-TRANS                              
566510*           MOVE WS-INTSUCURSAL  TO TB-SUCURSAL                               
567010*           MOVE WS-INTIMP-BRUTO TO TB-IMP-BRUTO                              
567510*           MOVE WS-INTIMP-COMIS TO TB-IMP-COMIS                              
568010*           MOVE WS-INTIMP-NETO  TO TB-IMP-NETO                               
568510*           PERFORM 50002250-CVETAR THRU 50002250-EXIT                        
569010*           MOVE  1               TO WS-INTTAR-CAJ-S                          
569110*           MOVE WS-ID-NEGOCIO    TO WS-ID-NEGOCIO-S                          
569510*           PERFORM 50002300-GRADET THRU 50002300-EXIT.                       
570010 50002200-EXIT.                                                               
570510     EXIT.                                                                    
571010                                                                              
571012*INI-STEFANINI EAS F3                                                         
571014 50002210-LEO-DET-S111.                                                       
571016     MOVE WS-INTCVE-TRAN-B          TO TB-CVE-TRANS.                          
571018     MOVE WS-INTSUCURSAL-B          TO TB-SUCURSAL.                           
571020     MOVE WS-INTIMP-BRUTO-B         TO TB-IMP-BRUTO.                          
571022     MOVE WS-INTIMP-COMIS           TO TB-IMP-COMIS.                          
571024     MOVE WS-INTIMP-NETO            TO TB-IMP-NETO.                           
571026     MOVE WS-INTNUM-TARJETA-B       TO TB-TARJETA.                            
571028     MOVE WS-INTNUM-CONTRATO-B      TO TB-CONTRATO.                           
571030     MOVE WS-INTREF-SEQLINEA-B      TO TB-SEQLINEA.                           
571032                                                                              
571034 50002210-EXIT.                                                               
571036     EXIT.                                                                    
571038                                                                              
571040 50002215-LEO-DET-EAS.                                                        
571042     IF WS-TAR-DS = "TARJETADIA"                                              
571044        MOVE EAS-R0B-CVETRANS       TO TB-CVE-TRANS                           
571046        MOVE EAS-R0B-SUC            TO TB-SUCURSAL                            
571048        MOVE EAS-R0B-IMP-POSTEO     TO TB-IMP-POSTEO                          
571050        MOVE EAS-R0B-IMP-AUT        TO TB-IMP-AUTORI                          
571052        MOVE EAS-R0B-TARJETA        TO TB-TARJETA                             
571054        MOVE EAS-R0B-CONTRATO       TO TB-CONTRATO                            
571058     ELSE                                                                     
571060        MOVE EAS-S-R0B-CVETRANS     TO TB-CVE-TRANS                           
571062        MOVE EAS-S-R0B-SUC          TO TB-SUCURSAL                            
571064        MOVE EAS-S-R0B-IMP-AUT      TO TB-IMP-AUTORI                          
571066        MOVE EAS-S-R0B-TARJETA      TO TB-TARJETA                             
571068        MOVE EAS-S-R0B-CONTRATO     TO TB-CONTRATO                            
571070        MOVE ZEROS                  TO TB-IMP-POSTEO.                         
571072                                                                              
571074 50002215-EXIT.                                                               
571076     EXIT.                                                                    
571081******************************************************************            
571086* LEO EL DETALLE DEL ARCHIVO EAS DIARIO.                                      
571091******************************************************************            
571096 50002240-LEO-DETALLE-EAS.                                                    
571098* SE ACTUALIZA PARA PODER LEER EL SEMANAL   EAS F5                            
571100  IF WS-TAR-DS = "TARJETADIA"                                                 
571101     ADD 1 TO W-LLAVE-EASDIARIO                                               
571106     READ ARCH-EAS INTO REG-EAS INVALID KEY                                   
571111       MOVE 1 TO WS-1VEZ-EAS                                                  
571112  ELSE                                                                        
571114     ADD 1 TO  W-LLAVE-EASSEM                                                 
571116     READ ARCH-EAS-SEM INTO REG-EAS-SEM INVALID KEY                           
571118          MOVE 1 TO WS-1VEZ-EAS.                                              
571120                                                                              
571122                                                                              
571124     IF WS-1VEZ-EAS = 0                                                       
571126         ADD 1 TO W77-REG-LEI                                                 
571131         IF EAS-R03-TIPREG = "T" OR EAS-R03S-TIPREG = "T"                     
571136            MOVE 1   TO WS-1VEZ-EAS                                           
571141         ELSE                                                                 
571146*            MOVE REG-EAS                  TO REG-TBINTER-B                   
571148            PERFORM 50002241-MOVE-REG-EAS                                     
571150*           WS-INTTAR-CAJ-S     1 = TARJETA | 2 = CAJERO                      
571151            MOVE  1                       TO WS-INTTAR-CAJ-S                  
571156            MOVE  2                       TO WS-INT-S111-O-EAS-S              
571161                                             ORIGEN-SIST                      
571166            PERFORM 50002215-LEO-DET-EAS  THRU 50002215-EXIT                  
571171            PERFORM 50002250-CVETAR       THRU 50002250-EXIT                  
571176            PERFORM 50002300-GRADET       THRU 50002300-EXIT.                 
571181 50002240-EXIT.                                                               
571186     EXIT.                                                                    
571188                                                                              
57119050002241-MOVE-REG-EAS.                                                        
571192   IF WS-TAR-DS = "TARJETADIA"                                                
571194      MOVE REG-EAS                  TO REG-TBINTER-B                          
571196   ELSE                                                                       
571198      MOVE REG-EAS-SEM              TO REG-TBINTER-B.                         
571200******************************************************************            
571201* LEO EL DETALLE DEL ARCHIVO S111 DIARIO.                                     
571206******************************************************************            
571211 50002230-LEO-DETALLE-S111.                                                   
571216     IF WS-TAR-DS = "TARJETADIA"                                              
571221         ADD 1 TO W-LLAVE-TARJETA                                             
571226         READ TARJETA INTO REG-TBINTER INVALID KEY                            
571231            MOVE 1 TO WS-1VEZ                                                 
571236     ELSE                                                                     
571241         ADD 1 TO W-LLAVE-INTER                                               
571246         READ TBINTERNAL INTO REG-TBINTER INVALID KEY                         
571251            MOVE 1 TO WS-1VEZ.                                                
571256                                                                              
571261     MOVE REG-TBINTER           TO REG-TBINTER-ANT.                           
571266     IF W77-TAM-REG < 192                                                     
571271         MOVE WS-INTNUM-CONTRATO-ANT TO WS-INTNUM-CONTRATO-B                  
571276         MOVE WS-INTREF-SEQLINEA-ANT TO WS-INTREF-SEQLINEA-B.                 
571281                                                                              
571286     IF WS-1VEZ = 0                                                           
571291         ADD 1 TO W77-REG-LEI                                                 
571296         IF WS-INTRAIL-TIPREG-E = "T"                                         
571301            MOVE 1   TO WS-1VEZ                                               
571306         ELSE                                                                 
571311            MOVE REG-TBINTER              TO REG-TBINTER-B                    
571316            MOVE  1                       TO WS-INTTAR-CAJ-S                  
571321                                             WS-INT-S111-O-EAS-S              
571326                                             ORIGEN-SIST                      
571331            PERFORM 50002210-LEO-DET-S111 THRU 50002210-EXIT                  
571336            PERFORM 50002250-CVETAR       THRU 50002250-EXIT                  
571341            PERFORM 50002300-GRADET       THRU 50002300-EXIT.                 
571346 50002230-EXIT.                                                               
571351     EXIT.                                                                    
571356                                                                              
571361*FIN-STEFANINI EAS F3                                                         
571510******************************************************************            
572010* ACUMULO LOS TOTALES DEPENDIENDO DE LA CVE. DE TRANSACCION.                  
572510******************************************************************            
573010 50002250-CVETAR.                                                             
573020                                                                              
573060                                                                              
573062     IF ORIGEN-SIST = 1                                                       
573064         PERFORM 50002260-MAPEO-CVE-TRANS.                                    
573066* SUMATORIA ACUMULADO CON LOS QUE COMPARA EL TRAILER DEL ARCHIVO              
573068     IF ORIGEN-SIST = 1                                                       
573510      COMPUTE WS-SUM-TOT-BRUTO = WS-SUM-TOT-BRUTO + TB-IMP-BRUTO              
574010      COMPUTE WS-SUM-TOT-NETO  = WS-SUM-TOT-NETO  + TB-IMP-NETO               
574510      COMPUTE WS-SUM-TOT-COMIS = WS-SUM-TOT-COMIS + TB-IMP-COMIS              
574560     ELSE                                                                     
574610        IF TB-IMP-POSTEO > 0                                                  
574660           COMPUTE WS-SUM-TOT-EAS = WS-SUM-TOT-EAS +                          
574710                                    TB-IMP-POSTEO                             
574760        ELSE                                                                  
574810           COMPUTE WS-SUM-TOT-EAS = WS-SUM-TOT-EAS +                          
574860                                    TB-IMP-AUTORI.                            
574880     PERFORM 50002252-IND-TIPO-MOV.                                           
574882*SUMATORIA ACUMULADO QUE COMPARA VS TOTALXPARTES                              
574884     IF ORIGEN-SIST = 1                                                       
574886         ADD 1   TO REG-LEIDOS                                                
574888         COMPUTE TOTAL-TOTAL = TOTAL-TOTAL + TB-IMP-BRUTO                     
574890     ELSE                                                                     
574892         ADD 1   TO REG-LEIDOS-EAS                                            
574894         IF TB-IMP-POSTEO > 0                                                 
574896            COMPUTE TOTAL-TOTAL-EAS = TOTAL-TOTAL-EAS                         
574898                                    + TB-IMP-POSTEO                           
574900         ELSE                                                                 
574902            COMPUTE TOTAL-TOTAL-EAS = TOTAL-TOTAL-EAS                         
574904                                    + TB-IMP-AUTORI.                          
574910                                                                              
575010*     IF TB-CVE-TRANS = 72 OR 32                                              
575510*        MOVE TB-IMP-BRUTO  TO TB-IMP-NETO  WS-INTIMP-NETO                    
576010*        MOVE ZEROES        TO TB-IMP-COMIS WS-INTIMP-COMIS                   
576510*        IF TB-CVE-TRANS = 72                                                 
577010*           MOVE 62 TO TB-CVE-TRANS WS-INTCVE-TRAN                            
577510*        ELSE                                                                 
578010*           MOVE 30 TO TB-CVE-TRANS WS-INTCVE-TRAN.                           
578510*     ADD 1   TO REG-LEIDOS.                                                  
579010*     COMPUTE TOTAL-TOTAL = TOTAL-TOTAL + TB-IMP-BRUTO.                       
579510*     IF TB-CVE-TRANS = 62 OR 66 OR 68 OR 72                                  
580010*        MOVE 1      TO IND-TIPO-MOV                                          
580510*     ELSE                                                                    
581010*     IF TB-CVE-TRANS = 40 OR 30 OR 32                                        
581510*        MOVE 2      TO IND-TIPO-MOV                                          
582010*     ELSE                                                                    
582510*     IF TB-CVE-TRANS = 14 OR 15                                              
583010*        MOVE 3      TO IND-TIPO-MOV                                          
583510*     ELSE                                                                    
584010*     IF TB-CVE-TRANS = 13                                                    
584510*        MOVE 4      TO IND-TIPO-MOV                                          
585010*     ELSE                                                                    
585020*     IF TB-CVE-TRANS = 99                                                    
585030*        PERFORM 50002255-VALCVE       THRU 50002255-EXIT                     
585040*     ELSE                                                                    
585060*         MOVE   1   TO IND-TIPO-MOV.                                         
585080                                                                              
585100     MOVE 0                      TO W77-S016-CONTRATO                         
585106                                    WS-NUMCSIS016                             
585108                                    W77-ES-L422                               
585110                                    W77-SUCP-S016                             
585112                                    WS-BD04-CTO WS-BD04-SUCP                  
585114                                    WS-BD04-CSI WS-ES-6611                    
585120                                    W77-BD04-CONTRATO                         
585140                                    R422-78-CTR-ERROR                         
585142                                    WS-S016-0201-RESULT                       
585160                                    WS-S500-L040-RESULT.                      
585180     MOVE LOW-VALUES             TO E422-78-CTR-ENTRADA                       
585200                                    S422-78-CTR-SALIDA                        
585205                                    WS-S016-0201-L458                         
585220                                    WS-S500-L040-ENTRADA-03                   
585222                                    WS-S500-L040-SALIDA-03.                   
585240                                                                              
585242     MOVE TB-SUCURSAL TO W77-SUC-PTE.                                         
585243     MOVE 1           TO W77-QUE-VA.                                          
585244     PERFORM 40000450-CSI-SUCPTE.                                             
585246     MOVE W77-CSI-PTE TO W77-CSI-SUCORIG.                                     
585247*    MOVE W77-SUC-PTE TO TB-SUCURSAL WS-INTSUCURSAL                           
585248     MOVE W77-SUC-PTE TO TB-SUCURSAL.                                         
585250     IF TB-CONTRATO > 0 AND ORIGEN-SIST = 2                                   
585251        ADD 1           TO W77-NOLLAMA-S016-BD04                              
585252     ELSE                                                                     
585253     IF TB-TARJETA > 999999999999999                                          
585254        PERFORM 50002256-OBTENGO-CONTRATO THRU 50002256-EXIT                  
585258        IF W77-S016-CONTRATO > 0                                              
585268           IF W77-ES-L422 = 1                                                 
585278              MOVE W77-SUCP-S016    TO W77-SUC-PTE                            
585288              MOVE 2                TO W77-QUE-VA                             
585298              PERFORM 40000450-CSI-SUCPTE                                     
585308              MOVE W77-SUC-PTE      TO W77-SUCP-S016                          
585318              IF W77-CSI-PTE = WS-NUMCSIS016                                  
585320                 NEXT SENTENCE                                                
585330              ELSE                                                            
585332                 MOVE W77-CSI-PTE TO WS-NUMCSIS016                            
585350           ELSE                                                               
585368              NEXT SENTENCE                                                   
585378        ELSE                                                                  
585388        IF W77-BD04-CONTRATO > 0                                              
585398           MOVE WS-BD04-SUCP     TO W77-SUC-PTE                               
585408           MOVE 3                TO W77-QUE-VA                                
585418           PERFORM 40000450-CSI-SUCPTE                                        
585428           MOVE W77-SUC-PTE      TO WS-BD04-SUCP                              
585438           IF W77-CSI-PTE = WS-BD04-CSI                                       
585448              NEXT SENTENCE                                                   
585458           ELSE                                                               
585468              MOVE W77-CSI-PTE TO WS-BD04-CSI                                 
585478        ELSE                                                                  
585488           ADD 1   TO W77-NOS016-NOBD04.                                      
585498                                                                              
585700     PERFORM 40000480-VALI-CSI.                                               
585710                                                                              
585720     IF WS-NUMCSI = 0                                                         
585730        STRING  " WS-NUMCSI = CERO  REG:" W77-REG-LEI                         
585731                " TARJ=" TB-TARJETA                                           
585732                " CTO="  TB-CONTRATO                                          
585733                " ORIGEN(1 S111/2 EAS)=" ORIGEN-SIST                          
585740*                " TARJ=" WS-INTNUM-TARJETA                                   
585750*                " CTO="  WS-INTNUM-CONTRATO                                  
585752                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
585754        PERFORM 70000050-MENSAJE                                              
585760        MOVE 10         TO WS-NUMCSI                                          
585762*       MOVE 105        TO TB-SUCURSAL WS-INTSUCURSAL                         
585763        MOVE 105        TO TB-SUCURSAL.                                       
585770                                                                              
585905                                                                              
586010     MOVE WS-NUMCSI   TO IND-CSI.                                             
586020     PERFORM 50002253-SUMA-TOTALES-X-SIST.                                    
586030                                                                              
586040     MOVE SPACES     TO WS-INTCVE-AUTORIZA-S.                                 
586050     IF TB-IMP-POSTEO > 0 AND TB-IMP-AUTORI = 0                               
586060        MOVE "C"    TO WS-INTCVE-AUTORIZA-S                                   
586070     ELSE                                                                     
586080     IF TB-IMP-POSTEO = 0 AND TB-IMP-AUTORI > 0                               
586090        MOVE "V"    TO WS-INTCVE-AUTORIZA-S                                   
586100     ELSE                                                                     
586110     IF TB-IMP-POSTEO > 0 AND TB-IMP-AUTORI > 0                               
586120        MOVE "P"    TO WS-INTCVE-AUTORIZA-S.                                  
586130                                                                              
590010*     COMPUTE  TOT-CSI-MOV(IND-CSI, IND-TIPO-MOV) =                           
590510*             TOT-CSI-MOV(IND-CSI, IND-TIPO-MOV) + TB-IMP-BRUTO.              
591010*     COMPUTE TOT-BRUTO(IND-CSI) =                                            
591510*                          TOT-BRUTO(IND-CSI) + TB-IMP-BRUTO.                 
592010*     COMPUTE  TOT-NETO(IND-CSI)  =                                           
592510*            TOT-NETO(IND-CSI)  + TB-IMP-NETO.                                
593010*     COMPUTE TOT-COMIS(IND-CSI) =                                            
593510*                           TOT-COMIS(IND-CSI) + TB-IMP-COMIS.                
593511*     IF WS-TAR-DS = "TARJETASEM"                                             
593512*         PERFORM 50003205-ACUMULO-IMP-X-CONT.                                
593514                                                                              
593517        IF ORIGEN-SIST = 1                                                    
593518           MOVE TB-CVE-TRANS            TO  WS-INTCVE-TRAN-S                  
593519           MOVE WS-INTNUM-TARJETA-B     TO  WS-INTNUM-TARJETA-S               
593520           MOVE WS-INTIMP-BRUTO-B       TO  WS-INTIMP-BRUTO-S                 
593521           MOVE WS-INTIMP-COMIS         TO  WS-INTIMP-COMIS-S                 
593522           MOVE WS-INTIMP-NETO          TO  WS-INTIMP-NETO-S                  
593523           MOVE WS-INTFECHA-MOVIMAMD-B  TO  WS-INTFECHA-MOVIMAMD-S            
593524           MOVE WS-INTREFEREN-NAL-B     TO  WS-INTREFEREN-NAL-S               
593525           MOVE WS-INTFECHA-PROC-B      TO  WS-INTFECHA-PROC-S                
593526           MOVE WS-INTCVE-AUTORIZA-B    TO  WS-INTCVE-AUTORIZA-S              
593527           MOVE WS-INTDESCRIP-NEG-B     TO  WS-INTDESCRIP-NEG-S               
593528           MOVE WS-INTPOBLACION-B       TO  WS-INTPOBLACION-S                 
593529           MOVE WS-INTREF-SEQLINEA-B    TO  WS-INTREF-SEQLINEA-S              
593530           MOVE WS-INTCVE-CONFIRLIN-B   TO  WS-INTCVE-CONFIRLIN-S             
593531           MOVE WS-INTCVE-PAIS-B        TO  WS-INTCVE-PAIS-S                  
593532           MOVE WS-INTIMP-DLLS-B        TO  WS-INTIMP-DLLS-S                  
593533           MOVE WS-INTREFEREN-INT-B     TO  WS-INTREFEREN-INT-S               
593534           MOVE WS-INTCODIGO-MONEDA-B   TO  WS-INTCODIGO-MONEDA-S             
593535           MOVE WS-ID-NEGOCIO-B         TO  WS-ID-NEGOCIO-S                   
593536*INI-STEFANIN TIPO DE CAMBIO                                                  
593537           MOVE WS-INTTC-BANXICO-B      TO  WS-TC-BANX                        
593538           MOVE WS-TC-BANXICO           TO  WS-INT-TC-BANXICO-S               
593539           MOVE WS-INTTC-VALMER-B       TO  WS-TC-VALM                        
593540           MOVE WS-TC-VALMER            TO  WS-INT-TC-VALMER-S                
593541           MOVE WS-INT-MARK-UP-EMI-B    TO  WS-INT-MARK-UP-EMI-S              
593542           MOVE ZEROS                   TO  WS-INTIMP-AUTORIZ-S               
593543*FIN-STEFANINI TIPO DE CAMBIO                                                 
593544        ELSE                                                                  
593545           IF WS-TAR-DS = "TARJETADIA"                                        
593546              MOVE EAS-R0B-CVETRANS     TO  WS-INTCVE-TRAN-S                  
593547              MOVE EAS-R0B-TARJETA      TO  WS-INTNUM-TARJETA-S               
593548              MOVE EAS-R0B-IMP-POSTEO   TO  WS-INTIMP-BRUTO-S                 
593549              MOVE EAS-R0B-IMP-AUT      TO  WS-INTIMP-AUTORIZ-S               
593550              MOVE ZEROS                TO  WS-INTIMP-COMIS-S                 
593551                                            WS-INTIMP-NETO-S                  
593552*    EAS F5 - ESCRIBIR REFERENCIA EN MOVS    WS-INTREFEREN-NAL-S              
593553                                            WS-INTFECHA-PROC-S                
593554                                            WS-INTCVE-CONFIRLIN-S             
593555                                            WS-INTREF-SEQLINEA-S              
593556*              MOVE EAS-R0B-IMP-AUT      TO  WS-INTIMP-AUTORIZ-S              
593557              MOVE EAS-R0B-FECHA-VALOR  TO  WS-INTFECHA-MOVIMAMD-S            
593558              MOVE EAS-R0B-CVE-NEG      TO  WS-ID-NEGOCIO-S                   
593559              MOVE EAS-R0B-DESCRIP      TO  WS-INTDESCRIP-NEG-S               
593560              MOVE EAS-R0B-POBLAC       TO  WS-INTPOBLACION-S                 
593561              MOVE SPACES               TO  WS-INTCVE-PAIS-S                  
593562              MOVE EAS-R0B-IMP-MONORI   TO  WS-INTIMP-DLLS-S                  
593563              MOVE EAS-R0B-REF-INT      TO  WS-INTREFEREN-INT-S               
593564              MOVE EAS-R0B-MON-ORI      TO  WS-INTCODIGO-MONEDA-S             
593565              MOVE EAS-R0B-TCAM-BANX    TO  WS-INT-TC-BANXICO-S               
593566              MOVE EAS-R0B-TCAM-COM     TO  WS-INT-MARK-UP-EMI-S              
593567              MOVE EAS-R0B-TCAM-VALM    TO  WS-INT-TC-VALMER-S                
593568              MOVE EAS-R0B-INST-ID      TO  WS-INTINSTITUCION-ID-S            
593570              MOVE EAS-R0B-APPL-ID      TO  WS-INTAPLICACION-ID-S             
593572              MOVE EAS-R0B-AUTH-CODE    TO  WS-INTAUTH-CODE-S                 
593573              MOVE EAS-R0B-REFERENCIA   TO  WS-INTREFEREN-NAL-S               
593574            ELSE                                                              
593576              MOVE EAS-S-R0B-CVETRANS   TO  WS-INTCVE-TRAN-S                  
593578              MOVE EAS-S-R0B-TARJETA    TO  WS-INTNUM-TARJETA-S               
593580              MOVE ZEROS                TO  WS-INTIMP-BRUTO-S                 
593582              MOVE EAS-S-R0B-IMP-AUT    TO  WS-INTIMP-AUTORIZ-S               
593584              MOVE EAS-S-R0B-FECHA-VALOR                                      
593586                                        TO  WS-INTFECHA-MOVIMAMD-S            
593588              MOVE ZEROS                TO  WS-INTIMP-COMIS-S                 
593590                                            WS-INTIMP-NETO-S                  
593592                                            WS-INTREFEREN-NAL-S               
593594                                            WS-INTFECHA-PROC-S                
593596                                            WS-INTCVE-CONFIRLIN-S             
593598                                            WS-INTREF-SEQLINEA-S              
593600                                            WS-ID-NEGOCIO-S                   
593602                                            WS-INTIMP-DLLS-S                  
593604                                            WS-INTREFEREN-INT-S               
593606                                            WS-INTCODIGO-MONEDA-S             
593608                                            WS-INT-TC-BANXICO-S               
593610                                            WS-INT-MARK-UP-EMI-S              
593612                                            WS-INT-TC-VALMER-S                
593614              MOVE SPACES               TO  WS-INTDESCRIP-NEG-S               
593616                                            WS-INTPOBLACION-S                 
593618                                            WS-INTCVE-PAIS-S.                 
593652                                                                              
594010*     MOVE  WS-INTCVE-TRAN         TO  WS-INTCVE-TRAN-S.                      
594510*     MOVE  WS-INTNUM-TARJETA      TO  WS-INTNUM-TARJETA-S.                   
595010*     MOVE  WS-INTIMP-BRUTO        TO  WS-INTIMP-BRUTO-S.                     
595510*     MOVE  WS-INTIMP-COMIS        TO  WS-INTIMP-COMIS-S.                     
596010*     MOVE  WS-INTIMP-NETO         TO  WS-INTIMP-NETO-S.                      
596510*     MOVE  WS-INTFECHA-MOVIMAMD   TO  WS-INTFECHA-MOVIMAMD-S.                
596511                                                                              
596512     IF TB-SUCURSAL = 0                                                       
596513           MOVE  105              TO  WS-INTSUCURSAL-S                        
596514     ELSE                                                                     
596516           MOVE  TB-SUCURSAL      TO  WS-INTSUCURSAL-S.                       
597011                                                                              
597510*     MOVE  WS-INTREFEREN-NAL      TO  WS-INTREFEREN-NAL-S.                   
598010*     MOVE  WS-INTFECHA-PROC       TO  WS-INTFECHA-PROC-S.                    
598510*     MOVE  WS-INTCVE-AUTORIZA     TO  WS-INTCVE-AUTORIZA-S.                  
599010*     MOVE  WS-INTDESCRIP-NEG      TO  WS-INTDESCRIP-NEG-S.                   
599510*     MOVE  WS-INTPOBLACION        TO  WS-INTPOBLACION-S.                     
600010*     MOVE  WS-INTCVE-CONFIRLIN    TO  WS-INTCVE-CONFIRLIN-S.                 
600510*     MOVE  WS-INTCVE-PAIS         TO  WS-INTCVE-PAIS-S.                      
601010*     MOVE  WS-INTIMP-DLLS         TO  WS-INTIMP-DLLS-S.                      
601510*     MOVE  WS-INTREFEREN-INT      TO  WS-INTREFEREN-INT-S.                   
602010*     MOVE  WS-INTCODIGO-MONEDA    TO  WS-INTCODIGO-MONEDA-S.                 
602012                                                                              
602050     IF W77-S016-CONTRATO > 0                                                 
602100        MOVE W77-S016-CONTRATO    TO WS-INTNUM-CONTRATO-S                     
602150     ELSE                                                                     
602200     IF W77-BD04-CONTRATO > 0                                                 
602250        MOVE W77-BD04-CONTRATO    TO WS-INTNUM-CONTRATO-S                     
602300     ELSE                                                                     
602310        MOVE TB-CONTRATO          TO WS-INTNUM-CONTRATO-S.                    
602510*        MOVE WS-INTNUM-CONTRATO   TO WS-INTNUM-CONTRATO-S.                   
602512                                                                              
603010*     MOVE  WS-INTREF-SEQLINEA     TO  WS-INTREF-SEQLINEA-S.                  
603020                                                                              
603030*INI-STEFANINI TIPO DE CAMBIO                                                 
603040*     MOVE WS-INTTC-BANXICO        TO  WS-TC-BANX.                            
603050*     MOVE WS-TC-BANXICO           TO  WS-INT-TC-BANXICO-S.                   
603060*     MOVE WS-INTTC-VALMER         TO  WS-TC-VALM.                            
603070*     MOVE WS-TC-VALMER            TO  WS-INT-TC-VALMER-S.                    
603080*     MOVE WS-INT-MARK-UP-EMI      TO  WS-INT-MARK-UP-EMI-S.                  
603090*FIN-STEFANINI TIPO DE CAMBIO                                                 
603092** EAS F5 - YA NO ES NECESARIO COMBINAR ARCHIVO SEMANAL                       
603094**      IF WS-TAR-DS = "TARJETASEM" AND WS-OPENED-EAS-FILE = 1                
603096**        PERFORM 50003205-ACUMULO-IMP-X-CONT.                                
603100                                                                              
603510 50002250-EXIT.                                                               
604010    EXIT.                                                                     
604015                                                                              
604020********************************************************                      
604025* VALIDO LA CLAVE REAL CONTENIDA EN REF. CUANDO LA CVE VALE 99.               
604030********************************************************                      
604035 50002255-VALCVE.                                                             
604036     IF WS-INTREF-SEQLINEA = 1114 OR                                          
604037        WS-INTREF-SEQLINEA = 1115                                             
604038        MOVE 5                     TO IND-TIPO-MOV.                           
604039                                                                              
604040     IF (WS-INTREF-SEQLINEA > 0)   AND                                        
604045        (WS-INTREF-SEQLINEA < 1000)                                           
604050         MOVE 3                    TO IND-TIPO-MOV.                           
604055                                                                              
604060     IF ((WS-INTREF-SEQLINEA > 999)     AND                                   
604061         (WS-INTREF-SEQLINEA < 1114))   OR                                    
604062        ((WS-INTREF-SEQLINEA > 1115)    AND                                   
604063         (WS-INTREF-SEQLINEA < 2000))   OR                                    
604064        ((WS-INTREF-SEQLINEA > 2999)    AND                                   
604066         (WS-INTREF-SEQLINEA < 4000))                                         
604068         MOVE 2                    TO IND-TIPO-MOV.                           
604070                                                                              
604072     IF ((WS-INTREF-SEQLINEA > 1999)    AND                                   
604074         (WS-INTREF-SEQLINEA < 3000))   OR                                    
604076        ((WS-INTREF-SEQLINEA > 3999)    AND                                   
604078         (WS-INTREF-SEQLINEA < 5000))                                         
604080         MOVE 1                    TO IND-TIPO-MOV.                           
604082                                                                              
604084 50002255-EXIT.                                                               
604086    EXIT.                                                                     
604088                                                                              
604090******************************************************************            
604100* OBTENGO CONTRATO DE CLIENTES A PARTIR DE WS-INTNUM-TARJETA     *            
604110* CON LA LIBRERIA S016/L458 ÿ S500/L040 ÿ S016/L422              *            
604120******************************************************************            
604130 50002256-OBTENGO-CONTRATO.                                                   
604140*     MOVE WS-INTNUM-TARJETA      TO WS-S016-0201-CUENTA-E.                   
604145     MOVE TB-TARJETA             TO WS-S016-0201-CUENTA-E.                    
604150     ADD 1                       TO WS-HI-CL458.                              
604160     PERFORM  20000016-L458-BUSCA-MDA.                                        
604170     IF WS-S016-0201-RESULT = 0                                               
604172        MOVE WS-S016-0201-CUENTA-S TO W77-S016-CONTRATO                       
604174        IF WS-S016-0201-CSI-S = 04 OR 10                                      
604180           ADD 1                      TO W77-SI-S016 W77-SI-L458              
604190           MOVE WS-S016-0201-CUENTA-S TO W77-S016-CONTRATO                    
604200           MOVE WS-S016-0201-CSI-S    TO WS-NUMCSIS016                        
604202        ELSE                                                                  
604204           ADD 1   TO WS-L458-L422                                            
604206           PERFORM 50002258-VOY-A-L422                                        
604208     ELSE                                                                     
604210        ADD 1 TO W77-NO-L458.                                                 
604212                                                                              
604218     IF W77-S016-CONTRATO = 0                                                 
604220*    AND W88-INTBIN-TARJPREP                                                  
604222         IF (ORIGEN-SIST = 1 AND W88-INTBIN-TARJPREP-B ) OR                   
604224            (ORIGEN-SIST = 2 AND W88-EAS-R0B-TARJPREP-B) OR                   
604226            (ORIGEN-SIST = 2 AND W88-EAS-S-R0B-TARJPREP-B)                    
604230                  PERFORM 40000600-CALL-S500L040.                             
604232                                                                              
604234     IF W77-S016-CONTRATO > 0                                                 
604240     OR W77-BD04-CONTRATO > 0                                                 
604242        NEXT SENTENCE                                                         
604244     ELSE                                                                     
604250*     IF WS-INTNUM-CONTRATO > 0                                               
604251     IF TB-CONTRATO > 0                                                       
604260        PERFORM 50002258-VOY-A-L422                                           
604270     ELSE                                                                     
604280        ADD 1 TO W77-NO-S016.                                                 
604290                                                                              
604300 50002256-EXIT.                                                               
604310    EXIT.                                                                     
604320                                                                              
604322*INI-STEFANINI EAS F3                                                         
604324*****************************************************************             
604326* MAPEO LAS CLAVES DE TRANSACCION QUE PROVIENEN DEL ARCHIVO                   
604328* DIARIO DEL S111 PARA PASARLAS A 4 DIGITOS.                                  
604330*****************************************************************             
604332 50002260-MAPEO-CVE-TRANS.                                                    
604334    IF NOT MOVTINT-BIN-CTAMAE-DLS                                             
604336        MOVE 1              TO WKS-MOVTO-A-CTAMAE-VA                          
604338     ELSE                                                                     
604340        MOVE 2              TO WKS-MOVTO-A-CTAMAE-VA.                         
604342                                                                              
604344    IF ORIGEN-SIST = 1                                                        
604346      IF TB-CVE-TRANS = 72 OR 32                                              
604348         MOVE TB-IMP-BRUTO  TO TB-IMP-NETO  WS-INTIMP-NETO                    
604350         MOVE ZEROES        TO TB-IMP-COMIS WS-INTIMP-COMIS                   
604352         IF TB-CVE-TRANS = 72                                                 
604354            MOVE 62         TO TB-CVE-TRANS WS-INTCVE-TRAN                    
604356         ELSE                                                                 
604358            MOVE 30         TO TB-CVE-TRANS WS-INTCVE-TRAN.                   
604360                                                                              
604362    IF TB-CVE-TRANS = 13                                                      
604364      MOVE 526              TO TB-CVE-TRANS                                   
604366    ELSE                                                                      
604368    IF TB-CVE-TRANS = 14                                                      
604370      MOVE 527              TO TB-CVE-TRANS                                   
604372    ELSE                                                                      
604374    IF TB-CVE-TRANS = 15                                                      
604376      MOVE 577              TO TB-CVE-TRANS                                   
604378    ELSE                                                                      
604380    IF TB-CVE-TRANS = 62                                                      
604382      IF TB-SEQLINEA = 2131                                                   
604384         MOVE 2131          TO TB-CVE-TRANS                                   
604386      ELSE                                                                    
604388         MOVE 2020          TO TB-CVE-TRANS                                   
604390    ELSE                                                                      
604392    IF TB-CVE-TRANS = 66 OR 68                                                
604394      IF TB-CVE-TRANS = 68 AND TB-SEQLINEA = 2132                             
604396         MOVE 2132          TO TB-CVE-TRANS                                   
604398      ELSE                                                                    
604400         MOVE 2018          TO TB-CVE-TRANS                                   
604402    ELSE                                                                      
604404    IF TB-CVE-TRANS = 72                                                      
604406      IF WKS-MOVTO-A-CTAMAEMN-EN-MN                                           
604408         MOVE 2017          TO TB-CVE-TRANS                                   
604410      ELSE                                                                    
604412         MOVE 0             TO TB-CVE-TRANS                                   
604414    ELSE                                                                      
604416    IF TB-CVE-TRANS = 30                                                      
604418      MOVE 1014             TO TB-CVE-TRANS                                   
604420    ELSE                                                                      
604422    IF TB-CVE-TRANS = 40                                                      
604424      IF WKS-MOVTO-A-CTAMAEMN-EN-MN                                           
604426         MOVE 1015          TO TB-CVE-TRANS                                   
604428      ELSE                                                                    
604430         MOVE 0             TO TB-CVE-TRANS                                   
604432    ELSE                                                                      
604434    IF TB-CVE-TRANS = 99                                                      
604436      MOVE TB-SEQLINEA      TO TB-CVE-TRANS                                   
604438    ELSE                                                                      
604440      MOVE 0                TO TB-CVE-TRANS.                                  
604442                                                                              
604444    IF MOVTINT-BIN-CTAMAE-DLS                                                 
604446        PERFORM 50002262-ASIGNA-CLAVES-DLS.                                   
604448                                                                              
604450 50002260-EXIT.                                                               
604452    EXIT.                                                                     
604454                                                                              
604456 50002262-ASIGNA-CLAVES-DLS.                                                  
604458     IF TB-CVE-TRANS      = 1014                                              
604460           MOVE 1195        TO TB-CVE-TRANS                                   
604462     ELSE IF TB-CVE-TRANS = 1015                                              
604464           MOVE 1196        TO TB-CVE-TRANS                                   
604466     ELSE IF TB-CVE-TRANS = 1021                                              
604468           MOVE 1197        TO TB-CVE-TRANS                                   
604470     ELSE IF TB-CVE-TRANS = 2018                                              
604472           MOVE 2387        TO TB-CVE-TRANS                                   
604474     ELSE IF TB-CVE-TRANS = 2020                                              
604476           MOVE 2388        TO TB-CVE-TRANS                                   
604478     ELSE IF TB-CVE-TRANS = 2131                                              
604480           MOVE 2394        TO TB-CVE-TRANS                                   
604482     ELSE IF TB-CVE-TRANS = 2132                                              
604484           MOVE 2395        TO TB-CVE-TRANS                                   
604486     ELSE IF TB-CVE-TRANS = 2139                                              
604488           MOVE 2425        TO TB-CVE-TRANS                                   
604490     ELSE IF TB-CVE-TRANS = 2220                                              
604492           MOVE 2405        TO TB-CVE-TRANS                                   
604494     ELSE IF TB-CVE-TRANS = 2221                                              
604496           MOVE 2406        TO TB-CVE-TRANS.                                  
604498                                                                              
604500*****************************************************************             
604502* ASIGNACION DE TIPO DE MOVIMIENTO                              *             
604504*    1: SALIDA CONTABLE                                         *             
604506*    2: ENTRADA CONTABLE                                        *             
604508*    3: SALIDA NO CONTABLE                                      *             
604510*    4: ENTRADA NO CONTABLE (CVE 526)                          *              
604512*    5: ENTRADA CONTABLE REBOLSOS                               *             
604514*****************************************************************             
604516 50002252-IND-TIPO-MOV.                                                       
604518   IF TB-CVE-TRANS = 526                                                      
604520        MOVE 4              TO IND-TIPO-MOV                                   
604522   ELSE                                                                       
604524   IF TB-CVE-TRANS = 527 OR 577                                               
604526        MOVE 3              TO IND-TIPO-MOV                                   
604528   ELSE                                                                       
604530   IF (TB-CVE-TRANS > 0   AND TB-CVE-TRANS < 526 )  OR                        
604532      (TB-CVE-TRANS > 527 AND TB-CVE-TRANS < 577 )  OR                        
604534      (TB-CVE-TRANS > 577 AND TB-CVE-TRANS < 1000)                            
604536        MOVE 3              TO IND-TIPO-MOV                                   
604538   ELSE                                                                       
604540   IF TB-CVE-TRANS = 1114 OR 1115                                             
604542        MOVE 5              TO IND-TIPO-MOV                                   
604544   ELSE                                                                       
604546   IF (TB-CVE-TRANS > 999  AND TB-CVE-TRANS < 1114)  OR                       
604548      (TB-CVE-TRANS > 1115 AND TB-CVE-TRANS < 2000)  OR                       
604550      (TB-CVE-TRANS > 2999 AND TB-CVE-TRANS < 4000)                           
604552        MOVE 2              TO IND-TIPO-MOV                                   
604554   ELSE                                                                       
604556   IF (TB-CVE-TRANS > 1999 AND TB-CVE-TRANS < 3000)  OR                       
604558      (TB-CVE-TRANS > 3999 AND TB-CVE-TRANS < 5000)                           
604560        MOVE 1              TO IND-TIPO-MOV                                   
604562   ELSE                                                                       
604564        MOVE 1              TO IND-TIPO-MOV.                                  
604566 50002252-EXIT.                                                               
604568   EXIT.                                                                      
604570                                                                              
604572 50002253-SUMA-TOTALES-X-SIST.                                                
604574   IF ORIGEN-SIST = 1                                                         
604576      COMPUTE  TOT-CSI-MOV(IND-CSI, IND-TIPO-MOV) =                           
604578               TOT-CSI-MOV(IND-CSI, IND-TIPO-MOV) + TB-IMP-BRUTO              
604580   ELSE                                                                       
604582      IF TB-IMP-POSTEO > 0                                                    
604584         COMPUTE  TOT-CSI-MOV-EAS(IND-CSI , IND-TIPO-MOV) =                   
604586                  TOT-CSI-MOV-EAS(IND-CSI , IND-TIPO-MOV)                     
604588                                + TB-IMP-POSTEO                               
604590      ELSE                                                                    
604592          COMPUTE  TOT-CSI-MOV-EAS(IND-CSI , IND-TIPO-MOV) =                  
604594                   TOT-CSI-MOV-EAS(IND-CSI, IND-TIPO-MOV)                     
604596                                + TB-IMP-AUTORI.                              
604598    MOVE TB-CVE-TRANS TO WS-VAL-CVE                                           
604600    IF WS-CVES-NOCONT                                                         
604602      NEXT SENTENCE                                                           
604604    ELSE                                                                      
604606      IF ORIGEN-SIST = 1                                                      
604608         COMPUTE TOT-BRUTO(IND-CSI) =                                         
604610                          TOT-BRUTO(IND-CSI) + TB-IMP-BRUTO                   
604612         COMPUTE TOT-NETO(IND-CSI)  =                                         
604614                          TOT-NETO(IND-CSI)  + TB-IMP-NETO                    
604616         COMPUTE TOT-COMIS(IND-CSI) =                                         
604618                          TOT-COMIS(IND-CSI) + TB-IMP-COMIS                   
604620      ELSE                                                                    
604622         IF TB-IMP-POSTEO > 0                                                 
604624            COMPUTE TOT-BRUTO(IND-CSI) = TOT-BRUTO(IND-CSI) +                 
604626                                      TB-IMP-POSTEO                           
604628         ELSE                                                                 
604630            COMPUTE TOT-BRUTO(IND-CSI) = TOT-BRUTO(IND-CSI) +                 
604632                                      TB-IMP-AUTORI.                          
604634******************************************************************            
604636* VERIFICO QUE EL SIGUIENTE CONTRATO NO SEA IGUAL AL ACTUAL                   
604638* DE SER ASI, SE SUMARAN LOS IMPORTES CORRESPONDIENTES                        
604640* SOLO PARA LA IMPRESION DE DETALLE EN EL MOVSTBINTER SEMANAL.                
604642******************************************************************            
604644 50003205-ACUMULO-IMP-X-CONT.                                                 
604646    MOVE CONTRATO-SORT TO WS-IMP-CONTR-ANT.                                   
604648                                                                              
604650    IF ORIGEN-SIST = 1                                                        
604652      MOVE WS-INTIMP-BRUTO-B     TO WS-IMP-BRUTO-ANT                          
604654    ELSE                                                                      
604656      MOVE EAS-S-R0B-IMP-AUT     TO WS-IMP-AUTOR-ANT.                         
604658                                                                              
604660    ADD 1 TO W-LLAVE-DETB.                                                    
604662    READ ARCH-DET-B INTO REG-TBINTER-B INVALID KEY                            
604664       MOVE 1 TO WS-CAMBIO-CONT.                                              
604666                                                                              
604668    IF (CONTRATO-SORT  = WS-IMP-CONTR-ANT) AND                                
604670       (WS-CAMBIO-CONT = 0)                                                   
604672       COMPUTE WS-ACUMULADO-IMP-BRUTO =                                       
604674               WS-ACUMULADO-IMP-BRUTO + WS-IMP-BRUTO-ANT                      
604676       COMPUTE WS-ACUMULADO-IMP-AUTOR =                                       
604678               WS-ACUMULADO-IMP-AUTOR + WS-IMP-AUTOR-ANT                      
604680       MOVE 1  TO WS-CONT-IDEM                                                
604682       SUBTRACT 1 FROM W-LLAVE-DETB                                           
604684    ELSE                                                                      
604686       MOVE 0 TO WS-CONT-IDEM                                                 
604688       SUBTRACT 1 FROM W-LLAVE-DETB.                                          
604690                                                                              
604692 50003205-EXIT.                                                               
604694    EXIT.                                                                     
604696                                                                              
604698*FIN-STEFANINI EAS F3                                                         
604700********************************************************                      
604705* OBTENGO SUCURSAL PROMOTORA DE CLIENTES                                      
604710********************************************************                      
604715 50002258-VOY-A-L422.                                                         
604720     MOVE ZEROS            TO WS-S016-0102-RESULT.                            
604725     MOVE ALL @00@         TO WS-S016-0102-ENTRADA.                           
604730***  MOVE WS-NUMCSI1       TO WS-S016-0102-CTR-NUMCSI-I.                      
604735     ADD 1                 TO WS-HI-CL422.                                    
604740     PERFORM 40000500-CALL-S016-L422 THRU 40000500-EXIT.                      
604745                                                                              
604750     IF WS-S016-0102-RESULT = 0                                               
604755        MOVE WS-S016-0102-NUMSUC   TO W77-SUCP-S016                           
604760        MOVE WS-S016-0102-NUMCSI   TO WS-NUMCSIS016                           
604762        MOVE 1                     TO W77-ES-L422                             
604765        ADD  1                     TO W77-SI-S016                             
604767        ADD  1                     TO W77-SI-L422                             
604770        IF W77-S016-CONTRATO > 0                                              
604772           NEXT SENTENCE                                                      
604775        ELSE                                                                  
604776           MOVE TB-CONTRATO        TO W77-S016-CONTRATO                       
604777*           MOVE WS-INTNUM-CONTRATO TO W77-S016-CONTRATO                      
604780     ELSE                                                                     
604785        ADD 1       TO W77-NO-S016                                            
604790        MOVE ZERO   TO W77-S016-CONTRATO.                                     
604795                                                                              
604800                                                                              
604805                                                                              
604810 50002258-EXIT.                                                               
604815     EXIT.                                                                    
604820                                                                              
604825                                                                              
604830                                                                              
605010******************************************************************            
605510* GRABO EL REGISTRO DE DETALLE YA SEA DE MTY. O DE VDM.                       
606010******************************************************************            
606510 50002300-GRADET.                                                             
606512     MOVE ZEROES   TO WS-IMP-BRUTO-ANT WS-IMP-CONTR-ANT                       
606514                      WS-IMP-AUTOR-ANT WS-ACUMULADO-IMP-BRUTO                 
606516                      WS-ACUMULADO-IMP-AUTOR                                  
606518                      WS-ACUMULADO-IMP-DETAL.                                 
607010     ADD 1 TO TOT-REGS(IND-CSI).                                              
607200                                                                              
607400  IF ARCH-S111                                                                
607510     IF IND-CSI = 4                                                           
608010        WRITE REG-TBINTERMON FROM REG-TBINTER-S                               
608510     ELSE IF IND-CSI = 10                                                     
609010        WRITE REG-TBINTERVDM FROM REG-TBINTER-S.                              
609050                                                                              
609100  IF ARCH-ECMS                                                                
609150     IF IND-CSI = 4                                                           
609200        WRITE REG-TBINTERMON-EAS FROM REG-TBINTER-S                           
609250     ELSE IF IND-CSI = 10                                                     
609300        WRITE REG-TBINTERVDM-EAS FROM REG-TBINTER-S.                          
609350                                                                              
609510 50002300-EXIT.                                                               
610010   EXIT.                                                                      
610510                                                                              
611010******************************************************************            
611510* VALIDO EL TRAILER DEL ARCHIVO DIARIO.                                       
612010******************************************************************            
612510 50002450-VAL-TRAILER.                                                        
612511   PERFORM 50002455-POSICIONO-TRAILER THRU 50002455-EXIT.                     
612560                                                                              
612580   IF ARCH-S111                                                               
612600      PERFORM 50002452-VAL-TRAILER-S111 THRU 50002452-EXIT                    
612620   ELSE IF ARCH-ECMS                                                          
612640      PERFORM 50002451-VAL-TRAILER-EAS  THRU 50002451-EXIT.                   
612660                                                                              
612680   IF WS-ERROR-TRAILER = 1                                                    
612700      PERFORM 50002454-MSG-TRAI-ERROR  THRU 50002454-EXIT.                    
612720 50002450-EXIT.                                                               
612740    EXIT.                                                                     
612760                                                                              
612780                                                                              
61280050002452-VAL-TRAILER-S111.                                                    
612820   IF WS-TAR-DS = "TARJETADIA"                                                
612840     MOVE "DIARIO S111"   TO WS-TIT-ARCH-TRAI-ERROR                           
612860   ELSE                                                                       
612880     MOVE "SEMANAL S111"   TO WS-TIT-ARCH-TRAI-ERROR.                         
612900                                                                              
613010   IF (WS-INTRAIL-NUMREG-E      NOT = REG-LEIDOS      ) OR                    
613510      (WS-INTRAIL-IMPBRUTO-E    NOT = WS-SUM-TOT-BRUTO)                       
613512*      (WS-EAS-TOTREG            NOT = REG-LEIDOS-EAS  ) OR                   
613514*      (WS-EAS-TOTIMP            NOT = WS-SUM-TOT-EAS  )                      
613600       MOVE SPACES              TO WS-0101-TEXT-MSG                           
613650       MOVE 1                   TO WS-ERROR-TRAILER                           
613700       MOVE WS-SUM-TOT-BRUTO    TO WS-SUM-TOT-BRUTO-DISP                      
613702*       MOVE WS-SUM-TOT-EAS      TO WS-SUM-TOT-EAS-DISP                       
615010       STRING " DETALLE Y TRAI. DIF ARC. " WS-TIT-ARCH-TRAI-ERROR             
615050              ", REG-LEIDOS "     REG-LEIDOS                                  
615100              ", TRAIL-NUMREG "   WS-INTRAIL-NUMREG-E                         
615102*              ", REG-LEIDOS EAS "      REG-LEIDOS-EAS                        
615104*              ", TRAIL-NUMREG EAS "    WS-EAS-TOTREG                         
615150              ", SUM-BRUTO "      WS-SUM-TOT-BRUTO-DISP                       
615200              ", TRAIL-IMPBRUTO " WS-INTRAIL-IMPBRUTO-E                       
615202*              ", SUM-POST-AUT EAS "    WS-SUM-TOT-EAS-DISP                   
615204*              ", TRAIL-IMPBRUTO EAS "  WS-EAS-TOTIMP                         
615250              ", WS-FECHA-PRO "   WS-FECHA-PRO                                
615300              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
615510       PERFORM 70000050-MENSAJE.                                              
61551250002452-EXIT.                                                                
615514    EXIT.                                                                     
615516                                                                              
61551850002454-MSG-TRAI-ERROR.                                                      
615520                                                                              
615532       IF WS-FECHA-PRO > 20111201 AND                                         
615540          WS-FECHA-PRO < 20111207                                             
615560          NEXT SENTENCE                                                       
615580       ELSE                                                                   
615600          MOVE SPACES           TO WS-0101-TEXT-MSG                           
615620          STRING "ÍDESEA PROCESAR SIN VALIDAR TRAILER (SI/NO)?"               
615640              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
615660          PERFORM 70000050-MENSAJE                                            
615680          ACCEPT WS-SINO                                                      
615700          IF WS-SINO ="SI"                                                    
615702             MOVE SPACES        TO WS-0101-TEXT-MSG                           
615704             STRING "DEME EL SOEID DE QUIEN ESTA AUTORIZANDO, ",              
615706             "SI LO DESCONOCE, OBTENGALO DEL DIRECTORIO DE ",                 
615708             "PERSONAL EN INTRANET"                                           
615710             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
615712             PERFORM 70000050-MENSAJE                                         
615714             ACCEPT WS-SOEID-VOBO-TRAILER                                     
615716             MOVE SPACES        TO WS-0101-TEXT-MSG                           
615718             STRING "EL SOEID DE QUIEN AUTORIZO PROCESAR SIN ",               
615720                    "VALIDAR EL TRAILER ES: "                                 
615722                    WS-SOEID-VOBO-TRAILER                                     
615724             DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                          
615726             PERFORM 70000050-MENSAJE                                         
615740          ELSE                                                                
615760*             CALL SYSTEM DMTERMINATE.                                        
615780* EAS INI F5 - ADAPTACION PARA NO PROCESAMIENTO DE TRAILER ERRONEO            
615800*            CAMBIAR DE RUTA EL TBINTER CON PREFIJO ERRTBINTER/               
615820             PERFORM 31310110-CHANGETIT-ARCH-ERR                              
615840                                            THRU 31310110-EXIT                
615860*            ELIMINAR LOS MOVS 10-04 CREADOS                                  
615880             PERFORM 50002456-PURGE-MOVS    THRU 50002456-EXIT                
615900*            ENCENDER BANDERA PARA NO CONTINUAR CON EL PROCESO                
615920             MOVE  1 TO WS-NOPROC-ERR-TRAI.                                   
615940 50002454-EXIT.                                                               
615960    EXIT.                                                                     
615980                                                                              
616000 50002456-PURGE-MOVS.                                                         
616020   IF ARCH-S111                                                               
616040      CLOSE TBINTERMON WITH PURGE                                             
616060      CLOSE TBINTERVDM WITH PURGE                                             
616080   ELSE IF ARCH-ECMS                                                          
616100      CLOSE TBINTERMON-EAS WITH PURGE                                         
616120      CLOSE TBINTERVDM-EAS WITH PURGE.                                        
616140 50002456-EXIT.                                                               
616160   EXIT.                                                                      
616180                                                                              
616540 50002451-VAL-TRAILER-EAS.                                                    
616550  IF WS-TAR-DS = "TARJETADIA"                                                 
616560     MOVE EAS-R03-TOTREG TO WS-EAS-TOTREG                                     
616570     MOVE EAS-R03-TOTIMP TO WS-EAS-TOTIMP                                     
616580     MOVE "EAS DIARIO"   TO WS-TIT-ARCH-TRAI-ERROR                            
616590  ELSE                                                                        
616600     MOVE EAS-R03S-TOTREG TO WS-EAS-TOTREG                                    
616610     MOVE EAS-R03S-TOTIMP TO WS-EAS-TOTIMP                                    
616620     MOVE "EAS SEMANAL"   TO WS-TIT-ARCH-TRAI-ERROR.                          
616630                                                                              
616640  IF (WS-EAS-TOTREG  NOT = REG-LEIDOS-EAS) OR                                 
616650     (WS-EAS-TOTIMP  NOT = WS-SUM-TOT-EAS)                                    
616660       MOVE SPACES              TO WS-0101-TEXT-MSG                           
616670       MOVE 1                   TO WS-ERROR-TRAILER                           
616690       MOVE WS-SUM-TOT-EAS      TO WS-SUM-TOT-EAS-DISP                        
616700       STRING "DETALLE Y TRAI. DIF ARC. " WS-TIT-ARCH-TRAI-ERROR              
616710              ", REG-LEIDOS EAS "      REG-LEIDOS-EAS                         
616720              ", TRAIL-NUMREG EAS "    WS-EAS-TOTREG                          
616730              ", SUM-POST-AUT EAS "    WS-SUM-TOT-EAS-DISP                    
616740              ", TRAIL-IMPBRUTO EAS "  WS-EAS-TOTIMP                          
616750              ", WS-FECHA-PRO EAS "    WS-FECHA-PRO-EAS                       
616760              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
616770       PERFORM 70000050-MENSAJE.                                              
616780                                                                              
616790 50002451-EXIT.                                                               
616800   EXIT.                                                                      
616810                                                                              
616820                                                                              
617012                                                                              
617014 50002455-POSICIONO-TRAILER.                                                  
617016*POCISIONARSE EN LA ULTIMA LINEA PARA LEER EL TRAILER DEL TBINTER             
617018 IF ARCH-S111                                                                 
617020   IF WS-TAR-DS = "TARJETADIA"                                                
617022      MOVE ATTRIBUTE LASTRECORD OF TARJETA TO W-LLAVE-TARJETA                 
617024      ADD 1 TO W-LLAVE-TARJETA                                                
617026      READ TARJETA INTO REG-TBINTER                                           
617028   ELSE                                                                       
617030*   IF WS-TAR-DS = "TARJETASEM"                                               
617032      MOVE ATTRIBUTE LASTRECORD OF TBINTERNAL TO W-LLAVE-INTER                
617034      ADD 1 TO W-LLAVE-INTER                                                  
617036      READ TBINTERNAL INTO REG-TBINTER.                                       
617038                                                                              
617040 IF ARCH-ECMS                                                                 
617042   IF WS-TAR-DS = "TARJETADIA"                                                
617044      MOVE ATTRIBUTE LASTRECORD OF ARCH-EAS TO W-LLAVE-EASDIARIO              
617048      ADD 1 TO W-LLAVE-EASDIARIO                                              
617050      READ ARCH-EAS INTO REG-EAS                                              
617100   ELSE                                                                       
617150      MOVE ATTRIBUTE LASTRECORD OF ARCH-EAS-SEM TO W-LLAVE-EASSEM             
617200      ADD 1 TO W-LLAVE-EASSEM                                                 
617250      READ ARCH-EAS-SEM INTO REG-EAS-SEM.                                     
617300                                                                              
617350 50002455-EXIT.                                                               
617400    EXIT.                                                                     
617510                                                                              
618010******************************************************************            
618510* SUMARIZO LOS TOTALES Y GRABO LOS TRAILERS DEL LOS 2 ARCHIVOS.               
619010* DIARIOS.                                                                    
619510******************************************************************            
620010 50002500-SUM-TAR.                                                            
620510     PERFORM 50002510-SUMARIZA-XCSI  THRU 50002510-EXIT                       
621010     VARYING WS-2VEZ FROM 1 BY 1 UNTIL WS-2VEZ > 5                            
621510     AFTER   IND-CSI    FROM 1 BY 1 UNTIL  IND-CSI   > 10.                    
621600                                                                              
622010     MOVE 0 TO IND-CSI.                                                       
622510     PERFORM 50002520-GRATRA         THRU 50002520-EXIT                       
623010     VARYING IND-CSI    FROM 1 BY 1 UNTIL  IND-CSI   > 10.                    
623200                                                                              
623400    IF ARCH-S111                                                              
623510     COMPUTE TOTAL-X-PARTES =                                                 
624010             TOTAL(1) + TOTAL(2) + TOTAL(3) + TOTAL(4) + TOTAL(5)             
624012*             + TOTAL-EAS(1) + TOTAL-EAS(2) + TOTAL-EAS(3) +                  
624014*               TOTAL-EAS(4) + TOTAL-EAS(5)                                   
624510        IF TOTAL-TOTAL NOT = TOTAL-X-PARTES                                   
626010         MOVE "NO COINCIDEN TOT. DE TARJETAS " TO WS-0101-TEXT-MSG            
626510         PERFORM 70000050-MENSAJE                                             
627010         CALL SYSTEM DMTERMINATE.                                             
627020                                                                              
627040     IF ARCH-ECMS                                                             
627060        COMPUTE TOTAL-X-PARTES =                                              
627080                   TOTAL-EAS(1) + TOTAL-EAS(2) + TOTAL-EAS(3) +               
627100                   TOTAL-EAS(4) + TOTAL-EAS(5)                                
627120        IF TOTAL-TOTAL-EAS NOT = TOTAL-X-PARTES                               
627140         MOVE "NO COINCIDEN TOT. DE TARJETAS EAS "                            
627160               TO WS-0101-TEXT-MSG                                            
627180               PERFORM 70000050-MENSAJE                                       
627200               CALL SYSTEM DMTERMINATE.                                       
627220                                                                              
627510 50002500-EXIT.                                                               
628010    EXIT.                                                                     
628510                                                                              
629010******************************************************************            
629510* TOTALIZA POR CSI.                                                           
630010******************************************************************            
630510 50002510-SUMARIZA-XCSI.                                                      
630600   IF ARCH-S111                                                               
631010     COMPUTE TOTAL(WS-2VEZ) = TOTAL(WS-2VEZ) +                                
631510             TOT-CSI-MOV(IND-CSI WS-2VEZ).                                    
631600                                                                              
631700   IF ARCH-ECMS                                                               
631800     COMPUTE TOTAL-EAS(WS-2VEZ) = TOTAL-EAS(WS-2VEZ) +                        
631900             TOT-CSI-MOV-EAS(IND-CSI WS-2VEZ).                                
632010 50002510-EXIT.                                                               
632510     EXIT.                                                                    
633010                                                                              
633510******************************************************************            
634010* GRABA LA TRANSACCION PARA LOS 2 CSIS.                                       
634510******************************************************************            
635010 50002520-GRATRA.                                                             
635510     IF IND-CSI-OK                                                            
636010       MOVE SPACES             TO REG-TBINTER-S                               
636510       MOVE        "T"         TO WS-INTRAIL-TIPREG-S                         
637010       MOVE TOT-REGS(IND-CSI)  TO WS-INTRAIL-NUMREG-S                         
638010       MOVE TOT-BRUTO(IND-CSI) TO WS-INTRAIL-IMPBRUTO-S                       
639010       MOVE TOT-COMIS(IND-CSI) TO WS-INTRAIL-IMPCOMIS-S                       
640010       MOVE TOT-NETO(IND-CSI)  TO WS-INTRAIL-IMPNETO-S                        
640510       PERFORM 50002300-GRADET THRU 50002300-EXIT.                            
640600                                                                              
640700     MOVE ZEROS TO TOT-REGS(IND-CSI)   TOT-BRUTO(IND-CSI)                     
640800                   TOT-NETO(IND-CSI)   TOT-COMIS(IND-CSI).                    
640900                                                                              
641010 50002520-EXIT.                                                               
641510    EXIT.                                                                     
642010                                                                              
642510******************************************************************            
643010* IMPRIME EL DETALLE DEL LISTADO DE TOTALES.                                  
643510******************************************************************            
644010 50002600-IMP-TAR.                                                            
644020    IF WS-TAR-DS = "TARJETADIA"                                               
644510       MOVE "INTERDIA "           TO TIT2-LEYINTER                            
644520    ELSE                                                                      
644530       MOVE "INTERSEM "           TO TIT2-LEYINTER.                           
644550                                                                              
644600    ADD 1 TO WS-HOJA.                                                         
644650    IF ARCH-S111                                                              
644700       PERFORM 50002610-IMPRIME-S111 THRU 50002610-EXIT                       
644750    ELSE IF ARCH-ECMS                                                         
644800       PERFORM 50002620-IMPRIME-ECMS THRU 50002620-EXIT.                      
64485050002600-EXIT.                                                                
644900    EXIT.                                                                     
644950                                                                              
64500050002610-IMPRIME-S111.                                                        
645050    MOVE WS-PRO-DD                 TO  DIA-REP TIT2-DIA.                      
645100    MOVE WS-PRO-MM                 TO  MES-REP TIT2-MES.                      
645150    MOVE WS-PRO-AA                 TO  ANO-REP TIT2-ANO.                      
645200                                                                              
645250    WRITE LINEA FROM WS-BLANCOS AFTER  PAGE                                   
645510    WRITE LINEA FROM TIT1       AFTER  1  LINES                               
645600    MOVE  WS-HOJA TO NUM-HOJA                                                 
646010    WRITE LINEA FROM TIT2       AFTER  1  LINES                               
646510    WRITE LINEA FROM TIT3       AFTER  3  LINES                               
647010    WRITE LINEA FROM TIT4       AFTER  1  LINES                               
647510    WRITE LINEA FROM WS-BLANCOS AFTER  1  LINES.                              
648010                                                                              
648510    PERFORM 50002650-IMPDET     THRU 50002650-EXIT                            
649010    VARYING IND-CSI FROM 1 BY 1 UNTIL IND-CSI > 10.                           
649510                                                                              
650010    WRITE LINEA FROM GUIONES    AFTER  1  LINES.                              
650510    WRITE LINEA FROM WS-BLANCOS AFTER  1  LINES.                              
651010    MOVE TOTAL(1)               TO TOTTOT-SAL-CON-REP.                        
651510    MOVE TOTAL(2)               TO TOTTOT-ENT-CON-REP.                        
652010    MOVE TOTAL(3)               TO TOTTOT-SAL-NOCON-REP.                      
652510    MOVE TOTAL(4)               TO TOTTOT-ENT-NOCON-REP.                      
652610    MOVE TOTAL(5)               TO TOTTOT-ENT-CON-REP-S.                      
652660    MOVE 0                      TO TOT-SAL-CON-REP-M                          
652710                                   TOT-SAL-NOCON-REP-M                        
652760                                   TOT-ENT-NOCON-REP-M                        
652810                                   TOT-SAL-CON-REP-V                          
652860                                   TOT-SAL-NOCON-REP-V                        
652910                                   TOT-ENT-NOCON-REP-V                        
652930                                   TOTTOT-SAL-CON-REP-S                       
652950                                   TOTTOT-SAL-NOCON-REP-S                     
652970                                   TOTTOT-ENT-NOCON-REP-S.                    
653010    WRITE LINEA FROM TOTALES    AFTER  1  LINES                               
653110    WRITE LINEA FROM WS-BLANCOS AFTER  3  LINES                               
653210    WRITE LINEA FROM TIT5       AFTER  1  LINES                               
653260    WRITE LINEA FROM DETALLE-03 AFTER  3  LINES                               
653270    WRITE LINEA FROM DETALLE-04 AFTER  1  LINES                               
653280    WRITE LINEA FROM GUIONES    AFTER  1  LINES                               
653300    WRITE LINEA FROM TOTALES-02 AFTER  1  LINES.                              
65330250002610-EXIT.                                                                
653304    EXIT.                                                                     
653310                                                                              
65331550002620-IMPRIME-ECMS.                                                        
653320    MOVE WS-PRO-EAS-DD                 TO  DIA-REP TIT2-DIA.                  
653325    MOVE WS-PRO-EAS-MM                 TO  MES-REP TIT2-MES.                  
653330    MOVE WS-PRO-EAS-AA                 TO  ANO-REP TIT2-ANO.                  
653335    WRITE LINEA FROM WS-BLANCOS AFTER  PAGE                                   
653340*INI-STEFANINI EAS F2                                                         
653345    MOVE "EAS      "           TO TIT2-LEYINTER                               
653350    WRITE LINEA FROM WS-BLANCOS AFTER  3  LINES                               
653355    WRITE LINEA FROM TIT1       AFTER  1  LINES                               
653360    MOVE  WS-HOJA TO NUM-HOJA                                                 
653365    WRITE LINEA FROM TIT2       AFTER  1  LINES                               
653370    WRITE LINEA FROM TIT3       AFTER  3  LINES                               
653375    WRITE LINEA FROM TIT4       AFTER  1  LINES                               
653380    WRITE LINEA FROM WS-BLANCOS AFTER  1  LINES                               
653385                                                                              
653390    PERFORM 50002655-IMPDET-EAS THRU 50002655-EXIT                            
653395    VARYING IND-CSI FROM 1 BY 1 UNTIL IND-CSI > 10.                           
653400                                                                              
653405    WRITE LINEA FROM GUIONES    AFTER  1  LINES.                              
653410    WRITE LINEA FROM WS-BLANCOS AFTER  1  LINES.                              
653415    MOVE TOTAL-EAS(1)           TO TOTTOT-EAS-SAL-CON-REP.                    
653420    MOVE TOTAL-EAS(2)           TO TOTTOT-EAS-ENT-CON-REP.                    
653425    MOVE TOTAL-EAS(3)           TO TOTTOT-EAS-SAL-NOCON-REP.                  
653430    MOVE TOTAL-EAS(4)           TO TOTTOT-EAS-ENT-NOCON-REP.                  
653435    MOVE TOTAL-EAS(5)           TO TOTTOT-EAS-ENT-CON-REP-S.                  
653440    WRITE LINEA FROM TOTALES-EAS     AFTER  1  LINES                          
653445    WRITE LINEA FROM WS-BLANCOS      AFTER  3  LINES.                         
653510 50002620-EXIT.                                                               
654010    EXIT.                                                                     
654510                                                                              
655010******************************************************************            
655510* IMPRIMO LOS TOTALES DE CADA ARCHIVO POR CSI.                                
656010******************************************************************            
656510 50002650-IMPDET.                                                             
657010       IF IND-CSI-OK                                                          
657510        MOVE WS-NOM-CSI(IND-CSI)     TO NOMBRE-CSI                            
658010        MOVE TOT-CSI-MOV(IND-CSI, 1) TO TOT-SAL-CON-REP                       
658510        MOVE TOT-CSI-MOV(IND-CSI, 2) TO TOT-ENT-CON-REP                       
659010        MOVE TOT-CSI-MOV(IND-CSI, 3) TO TOT-SAL-NOCON-REP                     
659510        MOVE TOT-CSI-MOV(IND-CSI, 4) TO TOT-ENT-NOCON-REP                     
659610        MOVE TOT-CSI-MOV(IND-CSI, 5) TO TOT-ENT-CON-REP-S                     
660010        WRITE LINEA FROM DETALLE     AFTER  1  LINES.                         
660060        IF WS-NOM-CSI(IND-CSI) = "MONTERREY      "                            
660080           MOVE WS-NOM-CSI(IND-CSI)     TO NOMBRE-CSI-02                      
660110           MOVE TOT-CSI-MOV(IND-CSI, 5) TO TOT-ENT-CON-REP-M                  
660160        ELSE                                                                  
660210        IF WS-NOM-CSI(IND-CSI) = "VDM-MOR        "                            
660230           MOVE WS-NOM-CSI(IND-CSI)     TO NOMBRE-CSI-03                      
660260           MOVE TOT-CSI-MOV(IND-CSI, 5) TO TOT-ENT-CON-REP-V.                 
660310                                                                              
660510 50002650-EXIT.                                                               
661010    EXIT.                                                                     
661012******************************************************************            
661014* IMPRIMO LOS TOTALES DE CADA ARCHIVO POR CSI DE EAS.                         
661016******************************************************************            
661018 50002655-IMPDET-EAS.                                                         
661020       IF IND-CSI-OK                                                          
661022        MOVE WS-NOM-CSI(IND-CSI)         TO NOMBRE-CSI-05                     
661024        MOVE TOT-CSI-MOV-EAS(IND-CSI, 1) TO TOT-EAS-SAL-CON-REP               
661026        MOVE TOT-CSI-MOV-EAS(IND-CSI, 2) TO TOT-EAS-ENT-CON-REP               
661028        MOVE TOT-CSI-MOV-EAS(IND-CSI, 3) TO TOT-EAS-SAL-NOCON-REP             
661030        MOVE TOT-CSI-MOV-EAS(IND-CSI, 4) TO TOT-EAS-ENT-NOCON-REP             
661032        MOVE TOT-CSI-MOV-EAS(IND-CSI, 5) TO TOT-EAS-ENT-CON-REP-S             
661034        WRITE LINEA FROM DETALLE-06     AFTER  1  LINES.                      
661036        IF WS-NOM-CSI(IND-CSI) = "MONTERREY      "                            
661038           MOVE WS-NOM-CSI(IND-CSI)     TO NOMBRE-CSI-06                      
661040           MOVE TOT-CSI-MOV-EAS(IND-CSI, 5)                                   
661042                                        TO TOT-EAS-ENT-CON-REP-M              
661044        ELSE                                                                  
661046        IF WS-NOM-CSI(IND-CSI) = "VDM-MOR        "                            
661048           MOVE WS-NOM-CSI(IND-CSI)     TO NOMBRE-CSI-07                      
661050           MOVE TOT-CSI-MOV-EAS(IND-CSI, 5)                                   
661052                                        TO TOT-EAS-ENT-CON-REP-V.             
661054 50002655-EXIT.                                                               
661056    EXIT.                                                                     
661510                                                                              
662010******************************************************************            
662510* RUTINAS PARA EL PROCESO SEMANAL.                                            
663010******************************************************************            
663510 50003000-SEMANAL.                                                            
664010     MOVE ZEROES TO TAB-BNC TAB-CSI-MOV TAB-TOTALES SW-LEC                    
664510                    WS-SUM-TOT-BRUTO WS-SUM-TOT-NETO                          
665010                    WS-SUM-TOT-COMIS IND-TIPO-MOV                             
665510                    REG-LEIDOS TOTAL-X-PARTES TOTAL-TOTAL                     
665512                    WS-TOTAL-NUMREG WS-TOTAL-IMPORT                           
665514                    WS-SUM-TOT-SIST  WS-SUM-TOT-EAS                           
665550                                                                              
665600                    TOTAL-TOTAL-EAS W-LLAVE-EASSEM WS-1VEZ-EAS                
665650                    W-LLAVE-INTER WS-1VEZ  WS-HEADER-CORRECTO-S               
665700                    TAB-CSI-MOV-EAS TAB-CSI-MOV                               
665750                    TAB-TOTALES  TAB-TOTALES-EAS WS-ERROR-TRAILER             
665800                    REG-LEIDOS-EAS.                                           
666010                                                                              
667010     MOVE 1 TO WS-ESINTER                                                     
667510*     PERFORM 50003100-LEO-HEADER   THRU 50003100-EXIT.                       
667515*     IF WS-OPENED-EAS-FILE = 1                                               
667520*         PERFORM 50002150-JUNTO-DETALLES THRU 50002150-EXIT                  
668010*         PERFORM 50003200-LEO-DETALLE    THRU 50003200-EXIT UNTIL            
668510*     WS-3VEZ = 1                                                             
668512*     ELSE                                                                    
668550     PERFORM 500030050-OPEN-VALHEADER THRU 50003050-EXIT                      
668600                                   UNTIL WS-HEADER-CORRECTO-S = 1.            
668620                                                                              
668640     IF ARCH-S111                                                             
668660       PERFORM 50003120-WRITE-HEADER-MOVS-S THRU 50003120-EXIT                
668680     ELSE IF ARCH-ECMS                                                        
668700       PERFORM 50003130-WRITE-HEADER-MEAS-S THRU 50003130-EXIT.               
668720                                                                              
668740     IF ARCH-S111                                                             
668750         PERFORM 50002230-LEO-DETALLE-S111                                    
668800                                   THRU 50002230-EXIT UNTIL                   
668850                                        WS-1VEZ = 1.                          
668855     IF ARCH-ECMS                                                             
668860        PERFORM 50002240-LEO-DETALLE-EAS                                      
668865                                     THRU 50002240-EXIT UNTIL                 
668870                                          WS-1VEZ-EAS = 1.                    
668875                                                                              
668900     PERFORM 50002450-VAL-TRAILER  THRU 50002450-EXIT                         
668920*** VALIDAR SI EL TRAILER DEL ARCHIVO SEMANAL FUE CORRECTO ******             
668940***       O SI ESTUVO INCORRECTO Y SE DECIDIO CONTINUAR *********             
668960    IF WS-NOPROC-ERR-TRAI = 0                                                 
669010       PERFORM 50003500-SUMTAR-SEM   THRU 50003500-EXIT                       
669510       PERFORM 50002600-IMP-TAR      THRU 50002600-EXIT                       
669600       MOVE    1                     TO WS-FIN-SEMANAL.                       
669800                                                                              
670010 50003000-EXIT.                                                               
670510     EXIT.                                                                    
670520                                                                              
670540                                                                              
670600 500030050-OPEN-VALHEADER.                                                    
670620  PERFORM 31310100-CHANGE-TIT-ARCH THRU 31310100-EXIT                         
670650  PERFORM 20005000-ABRO-ARC        THRU 20005000-EXIT                         
670700                                                                              
670750  IF ARCH-S111                                                                
670800     PERFORM 50003100-LEO-HEADER   THRU 50003100-EXIT                         
670850  ELSE IF ARCH-ECMS                                                           
670900     PERFORM 50003110-LEO-HEADER-EAS-SEM THRU 50003110-EXIT.                  
670950                                                                              
671000 50003050-EXIT.                                                               
671050   EXIT.                                                                      
671100                                                                              
671510******************************************************************            
672010* VALIDO EL HEADER DEL ARCHIVO SEMANAL Y GRABO EL HEADER                      
672510* DE LOS ARCHIVOS DE LOS 2 CSI'S.                                             
673010******************************************************************            
673510 50003100-LEO-HEADER.                                                         
674010     MOVE 1 TO W-LLAVE-INTER.                                                 
674510     READ TBINTERNAL INTO REG-TBINTER INVALID KEY                             
676010        MOVE "ERROR AL LEER HEADER ARC. SEM." TO WS-0101-TEXT-MSG             
676510        PERFORM 70000050-MENSAJE                                              
677010        CALL SYSTEM DMTERMINATE.                                              
677200     MOVE REG-TBINTER             TO          REG-TBINTER-ANT.                
677510                                                                              
677520     MOVE WS-FECHA-PRO            TO          WS-FECHA-TEMP-AMD               
678010     IF WS-TEMP-DD = WS-INTCTL-DD AND                                         
678510        WS-TEMP-MM = WS-INTCTL-MM AND                                         
679010        WS-TEMP-AA = WS-INTCTL-AA                                             
679510*        NEXT SENTENCE                                                        
679600         MOVE 1 TO WS-HEADER-CORRECTO-S                                       
680010     ELSE                                                                     
681510        MOVE "FEC INT. DIF. PROC.  ARC. SEM." TO WS-0101-TEXT-MSG             
681600        PERFORM 70000050-MENSAJE.                                             
681605                                                                              
681610     IF WS-HEADER-CORRECTO-S = 0                                              
681612        PERFORM 31310110-CHANGETIT-ARCH-ERR  THRU 31310110-EXIT               
681620        STRING "ARCH CON HEADER ERRONEO " WS-ETIQTBINTER                      
681625               "INYECTAR ARC SEMANAL CON HEADER CORRECTO Y DAR OK"            
681630               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
681635*   "O" = a pantalla y Log  no acumula mensajes  se va a STOP                 
681640               MOVE "O" TO W77-TIPO-DISP                                      
681645               PERFORM 70000050-MENSAJE                                       
681650*   DEVOLVERLO A "E" = solo a log        si acumula mensajes                  
681655               MOVE "E" TO W77-TIPO-DISP.                                     
681700*        CALL SYSTEM DMTERMINATE.                                             
681800                                                                              
681900 50003100-EXIT.                                                               
682000     EXIT.                                                                    
682100                                                                              
68220050003110-LEO-HEADER-EAS-SEM.                                                  
682512*INI-STEFANINI EAS F3                                                         
682513    IF WS-OPENED-EAS-FILE = 1                                                 
682514     MOVE 1 TO    W-LLAVE-EASSEM                                              
682516     READ ARCH-EAS-SEM INTO REG-EAS-SEM INVALID KEY                           
682518         MOVE "ERROR AL LEER HEAD. EAS ARC SEM"                               
682520               TO WS-0101-TEXT-MSG                                            
682522         PERFORM 70000050-MENSAJE                                             
682524         CALL SYSTEM DMTERMINATE.                                             
682528*    IF WS-OPENED-EAS-FILE = 1                                                
682530     IF WS-FECHA-PRO-EAS-AAMMDD = EAS-R01S-FECHA                              
682532*         NEXT SENTENCE                                                       
682540         MOVE 1 TO WS-HEADER-CORRECTO-S                                       
682560     ELSE                                                                     
682580         MOVE "FEC INT. DIF. PROC. EAS ARC SEM"                               
682600               TO WS-0101-TEXT-MSG                                            
682620         PERFORM 70000050-MENSAJE.                                            
682640*         CALL SYSTEM DMTERMINATE.                                            
682642                                                                              
682644     IF WS-HEADER-CORRECTO-S = 0                                              
682646        PERFORM 31310110-CHANGETIT-ARCH-ERR  THRU 31310110-EXIT               
682650        STRING "ARCH CON HEADER ERRONEO " WS-ETIQEAS-SEM                      
682652               "INYECTAR ARC SEMANAL CON HEADER CORRECTO Y DAR OK"            
682654               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
682656*   "O" = a pantalla y Log  no acumula mensajes  se va a STOP                 
682658               MOVE "O" TO W77-TIPO-DISP                                      
682660               PERFORM 70000050-MENSAJE                                       
682662* DEVOLVERLO A "E" = solo a log        si acumula mensajes                    
682664               MOVE "E" TO W77-TIPO-DISP.                                     
682666*        CALL SYSTEM DMTERMINATE.                                             
682668                                                                              
682670*FIN-STEFANINI EAS F3                                                         
682680 50003110-EXIT.                                                               
682700   EXIT.                                                                      
682720                                                                              
683010                                                                              
68320050003120-WRITE-HEADER-MOVS-S.                                                 
684010     MOVE 04    TO WS-ETIQTBINT-CSI.                                          
684510     CHANGE ATTRIBUTE TITLE OF TBINTERMON TO WS-ETIQTBINTER-CSI.              
685010     OPEN OUTPUT TBINTERMON.                                                  
685510                                                                              
686010     MOVE 10    TO WS-ETIQTBINT-CSI.                                          
686510     CHANGE ATTRIBUTE TITLE OF TBINTERVDM TO WS-ETIQTBINTER-CSI.              
687010     OPEN OUTPUT TBINTERVDM.                                                  
687510                                                                              
688010     MOVE WS-INTCTL-ID    TO WS-INTCTL-ID-S.                                  
688510     MOVE WS-INTCTL-FECHA TO WS-INTCTL-FECHA-S.                               
689010     MOVE WS-INTCTL-SISORIG TO WS-INTCTL-SISORIG-SEM.                         
689510     MOVE "S"               TO WS-INTCTL-PROCESO-S.                           
690010     MOVE 1                 TO WS-INTTIP-ARCH-SEM.                            
690510                                                                              
691010     MOVE 4 TO WS-INTCTL-CSI-SEM.                                             
691510     WRITE REG-TBINTERMON FROM REG-TBINTER-S INVALID KEY                      
693010        MOVE "ERROR AL GRAB.HEADER MTY. SEM." TO WS-0101-TEXT-MSG             
693510        PERFORM 70000050-MENSAJE                                              
694010        CALL SYSTEM DMTERMINATE.                                              
694510                                                                              
695010     MOVE 10 TO WS-INTCTL-CSI-SEM.                                            
695510     WRITE REG-TBINTERVDM FROM REG-TBINTER-S INVALID KEY                      
697010        MOVE "ERROR AL GRAB.HEADER VDM. SEM." TO WS-0101-TEXT-MSG             
697510        PERFORM 70000050-MENSAJE                                              
698010        CALL SYSTEM DMTERMINATE.                                              
698510 50003120-EXIT.                                                               
698520   EXIT.                                                                      
698540                                                                              
69856050003130-WRITE-HEADER-MEAS-S.                                                 
698580*FECHAS PARA CREAR RUTA DEL NUEVO MOVSTBINTER DE EAS SEM                      
698600   MOVE EAS-R01S-INTCTL-DD              TO WS-ETIQTBINT-DD-EAS                
698620   MOVE EAS-R01S-INTCTL-MM              TO WS-ETIQTBINT-MM-EAS                
698640   MOVE EAS-R01S-INTCTL-AA              TO WS-ETIQTBINT-AA-EAS                
698660                                                                              
698680*CREAMOS EL ARCHIVO MOVSTBINTER DE EAS CSI 04                                 
698700   MOVE 04    TO WS-ETIQTBINT-CSI-EAS                                         
698720   CHANGE ATTRIBUTE TITLE OF TBINTERMON-EAS                                   
698740                          TO WS-ETIQTBINTER-CSI-EAS                           
698760   OPEN OUTPUT TBINTERMON-EAS                                                 
698780                                                                              
698800*CREAMOS EL ARCHIVO MOVSTBINTER DE EAS CSI 10                                 
698820   MOVE 10    TO WS-ETIQTBINT-CSI-EAS                                         
698840   CHANGE ATTRIBUTE TITLE OF TBINTERVDM-EAS                                   
698860                          TO WS-ETIQTBINTER-CSI-EAS                           
698880   OPEN OUTPUT TBINTERVDM-EAS                                                 
698900                                                                              
698920   MOVE SPACES                    TO REG-TBINTER-CTL-S                        
698940*MOVES ESCRIBIR EL HEADER DEL MOVSTBINTER DE EAS DIARIO                       
698960   MOVE EAS-R01S-SISTEMA          TO WS-INTCTL-ID-S                           
698980*  REACOMODAR EL AAMMDD DEL TBINTER AL DDMMAA DEL MOVS                        
699000   MOVE EAS-R01S-INTCTL-AA             TO WS-FECHA6-AA                        
699020   MOVE EAS-R01S-INTCTL-MM             TO WS-FECHA6-MM                        
699040   MOVE EAS-R01S-INTCTL-DD             TO WS-FECHA6-DD                        
699060   MOVE WS-FECHA6-DDMMAA               TO WS-INTCTL-FECHA-S                   
699080                                                                              
699100   MOVE "S"                       TO WS-INTCTL-PROCESO-S                      
699120   MOVE 1                         TO WS-INTTIP-ARCH-SEM                       
699140                                                                              
699160*GRABAMOS EL HEADER DEL MOVSTBINTER DE EAS CSI 04                             
699180   MOVE 4 TO WS-INTCTL-CSI-SEM                                                
699200                                                                              
699220   WRITE REG-TBINTERMON-EAS FROM REG-TBINTER-S INVALID KEY                    
699240     MOVE "ERR.AL GRAB HEADER EAS MTY. SEM. EAS"                              
699260                            TO WS-0101-TEXT-MSG                               
699280     PERFORM 70000050-MENSAJE                                                 
699300     CALL SYSTEM DMTERMINATE.                                                 
699320                                                                              
699340*GRABAMOS EL HEADER DEL MOVSTBINTER DE EAS CSI 10                             
699360   MOVE 10 TO WS-INTCTL-CSI-SEM                                               
699380   WRITE REG-TBINTERVDM-EAS FROM REG-TBINTER-S INVALID KEY                    
699400     MOVE "ERR.AL GRAB HEADER EAS VDM. SEM. EAS"                              
699420                            TO WS-0101-TEXT-MSG                               
699440     PERFORM 70000050-MENSAJE                                                 
699460     CALL SYSTEM DMTERMINATE.                                                 
699480 50003130-EXIT.                                                               
699500     EXIT.                                                                    
699520                                                                              
700010******************************************************************            
700510* LEO EL DETALLE DEL ARCHIVO DIARIO.                                          
701010******************************************************************            
701510 50003200-LEO-DETALLE.                                                        
702010*   ADD 1 TO W-LLAVE-INTER.                                                   
702510*   READ TBINTERNAL INTO REG-TBINTER INVALID KEY                              
702512   ADD 1 TO W-LLAVE-DETB.                                                     
702514   READ ARCH-DET-B INTO REG-TBINTER-B INVALID KEY                             
703010         MOVE 1 TO WS-3VEZ.                                                   
703012   MOVE REG-TBINTER-B            TO REG-TBINTER-ANT.                          
703100*   MOVE REG-TBINTER             TO REG-TBINTER-ANT.                          
703200   IF W77-TAM-REG < 192                                                       
703202      MOVE WS-INTNUM-CONTRATO-ANT TO WS-INTNUM-CONTRATO-B                     
703204      MOVE WS-INTREF-SEQLINEA-ANT TO WS-INTREF-SEQLINEA-B.                    
703300*      MOVE WS-INTNUM-CONTRATO-ANT TO WS-INTNUM-CONTRATO                      
703400*      MOVE WS-INTREF-SEQLINEA-ANT TO WS-INTREF-SEQLINEA.                     
703510                                                                              
704010     IF WS-3VEZ = 0                                                           
704012        ADD 1 TO W77-REG-LEI                                                  
704022        IF ORIGEN-SIST = 1                                                    
704032             PERFORM 50002210-LEO-DET-S111 THRU 50002210-EXIT                 
704042         ELSE                                                                 
704052             PERFORM 50002215-LEO-DET-EAS  THRU 50002215-EXIT.                
704510*        IF WS-INTRAIL-TIPREG-E = "T"                                         
705010*           PERFORM 50002450-VAL-TRAILER THRU 50002450-EXIT                   
705510*        ELSE                                                                 
706010*           MOVE WS-INTCVE-TRAN  TO TB-CVE-TRANS                              
706510*           MOVE WS-INTSUCURSAL  TO TB-SUCURSAL                               
707010*           MOVE WS-INTIMP-BRUTO TO TB-IMP-BRUTO                              
707510*           MOVE WS-INTIMP-COMIS TO TB-IMP-COMIS                              
708010*           MOVE WS-INTIMP-NETO  TO TB-IMP-NETO                               
708510*           PERFORM 50002250-CVETAR THRU 50002250-EXIT                        
708610*           MOVE  1               TO WS-INTTAR-CAJ-S                          
708710*           MOVE WS-ID-NEGOCIO    TO WS-ID-NEGOCIO-S                          
709010*           PERFORM 50002300-GRADET THRU 50002300-EXIT                        
709012      IF WS-3VEZ = 0                                                          
709014         MOVE  1                   TO WS-INTTAR-CAJ-S                         
709016         MOVE ORIGEN-SIST          TO WS-INT-S111-O-EAS-S                     
709018         PERFORM 50002250-CVETAR THRU 50002250-EXIT                           
709022         IF WS-ACUMULADO-IMP-AUTOR > 0 OR                                     
709024            WS-ACUMULADO-IMP-BRUTO > 0                                        
709026            MOVE 2 TO WS-INT-S111-O-EAS-S.                                    
709027                                                                              
709028       IF WS-3VEZ = 0                                                         
709029                                                                              
709030         IF WS-CONT-IDEM = 0                                                  
709032           ADD WS-ACUMULADO-IMP-AUTOR   TO WS-INTIMP-AUTORIZ-S                
709034           ADD WS-ACUMULADO-IMP-BRUTO   TO WS-INTIMP-BRUTO-S                  
709036           PERFORM 50002300-GRADET      THRU 50002300-EXIT.                   
709510 50003200-EXIT.                                                               
710010    EXIT.                                                                     
710510                                                                              
711010******************************************************************            
711510* SUMARIZA LOS TOTALES DEL ARCHIVO SEMANAL.                                   
712010******************************************************************            
712510 50003500-SUMTAR-SEM.                                                         
713010     PERFORM 50003510-SUMARIZA-XCSI-SEM THRU 50003510-EXIT                    
713510     VARYING WS-4VEZ FROM 1 BY 1 UNTIL WS-4VEZ > 5                            
714010     AFTER     IND-CSI    FROM 1 BY 1 UNTIL    IND-CSI   > 10.                
714200                                                                              
714510     MOVE 0 TO IND-CSI.                                                       
715010     PERFORM 50003520-GRATRA-SEM THRU 50003520-EXIT                           
715510     VARYING   IND-CSI    FROM 1 BY 1 UNTIL    IND-CSI   > 10.                
715600                                                                              
716010   IF ARCH-S111                                                               
716510     COMPUTE TOTAL-X-PARTES =                                                 
717010             TOTAL(1) + TOTAL(2) + TOTAL(3) + TOTAL(4) + TOTAL(5)             
717012*             + TOTAL-EAS(1) + TOTAL-EAS(2) + TOTAL-EAS(3) +                  
717014*               TOTAL-EAS(4) + TOTAL-EAS(5).                                  
717510     IF TOTAL-TOTAL NOT = TOTAL-X-PARTES                                      
719010        MOVE "NO COINCIDEN TOT.TAR.SEM. "   TO WS-0101-TEXT-MSG               
719510        PERFORM 70000050-MENSAJE                                              
720010        CALL SYSTEM DMTERMINATE.                                              
720050                                                                              
720100   IF ARCH-ECMS                                                               
720150     COMPUTE TOTAL-X-PARTES =                                                 
720200               TOTAL-EAS(1) + TOTAL-EAS(2) + TOTAL-EAS(3) +                   
720250               TOTAL-EAS(4) + TOTAL-EAS(5)                                    
720300     IF TOTAL-TOTAL-EAS NOT = TOTAL-X-PARTES                                  
720350        MOVE "NO COINCIDEN TOT.TAR.SEM.EAS "  TO WS-0101-TEXT-MSG             
720400        PERFORM 70000050-MENSAJE                                              
720450        CALL SYSTEM DMTERMINATE.                                              
720510 50003500-EXIT.                                                               
721010    EXIT.                                                                     
721510                                                                              
722010******************************************************************            
722510* ACUMULA LOS TOTALES DEL ARC. SEMANAL POR CSI.                               
723010******************************************************************            
723510 50003510-SUMARIZA-XCSI-SEM.                                                  
723600   IF ARCH-S111                                                               
724010     COMPUTE TOTAL(WS-4VEZ) = TOTAL(WS-4VEZ) +                                
724510             TOT-CSI-MOV(IND-CSI WS-4VEZ).                                    
724600   IF ARCH-ECMS                                                               
724700     COMPUTE TOTAL-EAS(WS-4VEZ) = TOTAL-EAS(WS-4VEZ) +                        
724800             TOT-CSI-MOV-EAS(IND-CSI WS-4VEZ).                                
725010 50003510-EXIT.                                                               
725510    EXIT.                                                                     
726010                                                                              
726510******************************************************************            
727010* GRABO EL TRAILER DE LOS 2 ARCHIVOS SEMANALES PARA LOS CSI'S.                
727510******************************************************************            
728010 50003520-GRATRA-SEM.                                                         
728510     IF IND-CSI-OK                                                            
729010       MOVE SPACES             TO REG-TBINTER-S                               
729510       MOVE        "T"         TO WS-INTRAIL-TIPREG-S                         
730010       MOVE TOT-REGS(IND-CSI)  TO WS-INTRAIL-NUMREG-S                         
731010       MOVE TOT-BRUTO(IND-CSI) TO WS-INTRAIL-IMPBRUTO-S                       
732010       MOVE TOT-COMIS(IND-CSI) TO WS-INTRAIL-IMPCOMIS-S                       
733010       MOVE TOT-NETO(IND-CSI)  TO WS-INTRAIL-IMPNETO-S                        
733510       IF WS-ESINTER = 1                                                      
734010          PERFORM 50002300-GRADET THRU 50002300-EXIT.                         
734100                                                                              
734200       MOVE ZEROS TO TOT-REGS(IND-CSI)   TOT-BRUTO(IND-CSI)                   
734300                TOT-COMIS(IND-CSI)  TOT-NETO(IND-CSI).                        
734510 50003520-EXIT.                                                               
735010     EXIT.                                                                    
735020                                                                              
735030*INI-STEFANINI EAS                                                            
735040*****************************************************************             
735050*RUTINAS PARA PROCESAR ARCHIVO EAS Y GENERAR ARCH DE PROC                     
735060*****************************************************************             
735070 60000000-PROCESO-EAS.                                                        
735080   ACCEPT  WS-HORA-FINEAS                 FROM TIME.                          
735090                                                                              
735100   IF WS-HORA-EAS-HHMM > 1800                                                 
735110      MOVE 1                              TO WS-FIN-PROGRAMA                  
735120      EXIT PERFORM.                                                           
735130                                                                              
735140   MOVE WS-FECHA-PRO                      TO WS-FECHA-PROY.                   
735150   MOVE WS-FECHA-PROY                     TO WS-ETIQEAS-FECHA                 
735160                                             WS-ETIQEAS-FPROC                 
735170                                             WS-ETIQPROC-FECHA.               
735180                                                                              
735190   PERFORM 60001000-BUSCA-ARCHIVO THRU 60001000-EXIT                          
735200   UNTIL WS-FECHA-PROY < WS-FECHA-FIN-BUSQ.                                   
735210                                                                              
735220   WAIT (300).                                                                
735230                                                                              
735240 60000000-EXIT.                                                               
735250     EXIT.                                                                    
735260                                                                              
735270 60001000-BUSCA-ARCHIVO.                                                      
735275   CHANGE ATTRIBUTE NEWFILE OF ARCH-EAS TO VALUE FALSE.                       
735280   CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS.                          
735290   IF ATTRIBUTE RESIDENT OF ARCH-EAS = VALUE TRUE                             
735300      PERFORM 60002000-GENERA-ARCHIVO     THRU 60002000-EXIT                  
735310      PERFORM 60003000-CAMBIA-RUTA        THRU 60003000-EXIT                  
735320      PERFORM 60004000-LLAMA-P197         THRU 60004000-EXIT                  
735330      WAIT(15).                                                               
735340                                                                              
735350   MOVE WS-FECHA-PROY                     TO WS-S006-FECHA1.                  
735360   MOVE 01                                TO WS-S006-FECHA2.                  
735370   MOVE 12                                TO WS-S006-FORMATO.                 
735380   MOVE 10                                TO WS-S006-FUNCION.                 
735390   PERFORM 40000000-CALL-FECPRO           THRU 40000000-EXIT.                 
735400   MOVE WS-S006-FECHA1                    TO WS-FECHA-PROY.                   
735410   IF WS-FECHA-PROY < WS-FECHA-FIN-BUSQ                                       
735420      EXIT PERFORM                                                            
735430   ELSE                                                                       
735440      MOVE WS-FECHA-PROY                  TO WS-ETIQEAS-FECHA                 
735450                                             WS-ETIQEAS-FPROC                 
735460                                             WS-ETIQPROC-FECHA.               
735470                                                                              
735480 60001000-EXIT.                                                               
735490     EXIT.                                                                    
735500                                                                              
735510 60002000-GENERA-ARCHIVO.                                                     
735520   OPEN INPUT ARCH-EAS.                                                       
735530   CHANGE ATTRIBUTE NEWFILE OF ARCH-PROC TO VALUE FALSE.                      
735540   CHANGE ATTRIBUTE TITLE OF ARCH-PROC    TO WS-ETIQPROC.                     
735550   OPEN OUTPUT ARCH-PROC.                                                     
735560                                                                              
735570   PERFORM 60002010-GENERA-HEADER         THRU 60002010-EXIT.                 
735580   PERFORM 60002015-LIMPIA-VARIABLES      THRU 60002015-EXIT.                 
735590   PERFORM 60002020-GENERA-DETALLES       THRU 60002020-EXIT                  
735600           UNTIL WS-FIN-EAS = 1.                                              
735610   PERFORM 60002030-GENERA-TRAILER        THRU 60002030-EXIT.                 
735620   CLOSE ARCH-PROC    WITH SAVE.                                              
735630 60002000-EXIT.                                                               
735640     EXIT.                                                                    
735650                                                                              
735680 60002010-GENERA-HEADER.                                                      
735690   READ ARCH-EAS INTO REG-EAS INVALID KEY                                     
735700   MOVE "ERROR AL LEER HEAD. ARCH EAS"    TO WS-0101-TEXT-MSG                 
735710   PERFORM 70000050-MENSAJE                                                   
735720   CALL SYSTEM DMTERMINATE.                                                   
735730                                                                              
735740   IF EAS-R01-SISTEMA = 175172                                                
735750      MOVE "1"                            TO PROC-R01-TIPREG                  
735760      MOVE 10                             TO PROC-R01-NODO                    
735770      MOVE EAS-R01-FECHA                  TO PROC-R01-FECHA                   
735780      MOVE EAS-R01-SISTEMA                TO PROC-R01-CTE                     
735790      MOVE 0001                           TO PROC-R01-SEC                     
735800      MOVE SPACES                         TO PROC-R01-DESC                    
735810   ELSE                                                                       
735820      MOVE "1"                            TO PROC-R01-TIPREG                  
735830      MOVE ZEROES                         TO PROC-R01-NODO                    
735840      MOVE ZEROES                         TO PROC-R01-FECHA                   
735850      MOVE ZEROES                         TO PROC-R01-CTE                     
735860      MOVE ZEROES                         TO PROC-R01-SEC                     
735870      MOVE SPACES                         TO PROC-R01-DESC.                   
735880                                                                              
735890   WRITE PROC-REG FROM REG-PROC INVALID KEY                                   
735900   MOVE "ERR.AL GRAB HEADER ARCH PROC"    TO WS-0101-TEXT-MSG                 
735910   PERFORM 70000050-MENSAJE                                                   
735920   CALL SYSTEM DMTERMINATE.                                                   
735930 60002010-EXIT.                                                               
735940     EXIT.                                                                    
735950                                                                              
735960 60002015-LIMPIA-VARIABLES.                                                   
735970   MOVE 0                                 TO WS-SEC-REG.                      
735980   MOVE WS-ETIQEAS-FECHA                  TO WS-FECHA-AUT.                    
735990   MOVE WS-FECHA-AUT-M                    TO WS-AUT-M.                        
736000   MOVE WS-FECHA-AUT-DD                   TO WS-AUT-DD.                       
736010   MOVE 0                                 TO WS-TOTAL-CARGOS                  
736020                                             WS-TOTAL-ABONOS                  
736030                                             WS-TOTAL-NCONT                   
736040                                             WS-TOTIMP-CARGOS                 
736050                                             WS-TOTIMP-ABONOS.                
736060   MOVE 0                                 TO WS-FIN-EAS.                      
736070 60002015-EXIT.                                                               
736080     EXIT.                                                                    
736090                                                                              
736100 60002020-GENERA-DETALLES.                                                    
736110   READ ARCH-EAS INTO REG-EAS INVALID KEY                                     
736120   MOVE 1                                 TO WS-FIN-EAS.                      
736130                                                                              
736140   IF EAS-R03-TIPREG = "T"                                                    
736150      MOVE 1                              TO WS-FIN-EAS                       
736160      EXIT PERFORM.                                                           
736170                                                                              
736180   MOVE EAS-R02-CVETRANS                  TO WS-TIPO-MOVTO.                   
736190   MOVE 1                                 TO WS-POINTER.                      
736200   IF WS-ES-CARGO                                                             
736210      PERFORM 60002022-GENERA-REG-NCONT   THRU 60002022-EXIT                  
736220      MOVE 1                              TO WS-POINTER                       
736230      PERFORM 60002021-GENERA-REG-CONT    THRU 60002021-EXIT                  
736240   ELSE                                                                       
736250      IF WS-ES-ABONO                                                          
736260         PERFORM 60002021-GENERA-REG-CONT THRU 60002021-EXIT                  
736270      ELSE                                                                    
736280         IF WS-ES-NCONT                                                       
736290            PERFORM 60002022-GENERA-REG-NCONT THRU 60002022-EXIT.             
736300                                                                              
736310 60002020-EXIT.                                                               
736320     EXIT.                                                                    
736330                                                                              
736340 60002021-GENERA-REG-CONT.                                                    
736350   MOVE "2"                               TO PROC-R02-TIPREG.                 
736360   ADD 1                                  TO WS-SEC-REG.                      
736370   MOVE WS-SEC-REG                        TO PROC-R02-SECDET.                 
736380   MOVE 0342                              TO PROC-R02-SUCORI.                 
736390   MOVE 21                                TO PROC-R02-CAJORI.                 
736400   IF WS-SEC-AUT = 99999                                                      
736410      MOVE 0                              TO WS-SEC-AUT.                      
736420   ADD 1                                  TO WS-SEC-AUT.                      
736430   MOVE WS-SEC-AUT                        TO WS-AUT-SEC.                      
736440   MOVE WS-AUT-PROC                       TO PROC-R02-AUT.                    
736450   MOVE EAS-R02-CVETRANS                  TO PROC-R02-CVETRANS.               
736460   IF WS-ES-CARGO                                                             
736470      MOVE 1                              TO PROC-R02-TIPMOV                  
736480   ELSE                                                                       
736490      IF WS-ES-ABONO                                                          
736500         MOVE 2                           TO PROC-R02-TIPMOV.                 
736510   MOVE 00                                TO PROC-R02-TIPMACC.                
736520   MOVE EAS-R02-SUC                       TO WS-SUCURSAL.                     
736530   MOVE EAS-R02-CONTRATO                  TO WS-CONTRATO.                     
736540   MOVE WS-CONTRATO-PROC                  TO PROC-R02-CONTRATO.               
736550   MOVE EAS-R02-IMP-POSTEO                TO PROC-R02-IMPORTE.                
736560   MOVE 01                                TO PROC-R02-MONEDA.                 
736570   MOVE EAS-R02-REFERENCIA                TO PROC-R02-REF.                    
736580   MOVE 0                                 TO PROC-R02-FORZADO.                
736590   MOVE SPACES                            TO PROC-R02-FORVAR.                 
736600   IF WS-ES-CARGO                                                             
736610      MOVE 3                              TO WS-INDLEY-PROC                   
736620   ELSE                                                                       
736630      MOVE 0                              TO WS-INDLEY-PROC.                  
736632   MOVE EAS-R02-IMP-MONORI                TO WKS-R02-IMP-MONORI.              
736640                                                                              
736650   IF EAS-R02-NEG > SPACES AND WS-INDLEY-PROC > 0                             
736660      STRING "B", WS-INDLEY-PROC, EAS-R02-NEG                                 
736670      DELIMITED BY SIZE INTO PROC-R02-FORVAR POINTER WS-POINTER.              
736680                                                                              
736690   MOVE 2                                 TO WS-TIPMEDACC-PROC.               
736700   STRING "C", WS-TIPMEDACC-PROC, EAS-R02-TARJETA                             
736710   DELIMITED BY SIZE INTO PROC-R02-FORVAR POINTER WS-POINTER.                 
736720                                                                              
736730   IF EAS-R02-FECHA-VALOR > 0                                                 
736740      STRING "D", EAS-R02-FECHA-VALOR DELIMITED BY SIZE INTO                  
736750      PROC-R02-FORVAR POINTER WS-POINTER.                                     
736760                                                                              
736770   IF EAS-R02-REF-INT > SPACES                                                
736780      STRING "F", EAS-R02-REF-INT DELIMITED BY SIZE INTO                      
736790      PROC-R02-FORVAR POINTER WS-POINTER.                                     
736800                                                                              
736810   IF EAS-R02-TCAM-BANX = ZEROES                                              
736820      MOVE SPACES                         TO WS-TCAM-BANX                     
736830   ELSE                                                                       
736840      MOVE EAS-R02-TCAM-BANX              TO WS-TCAM-BANX-R.                  
736850                                                                              
736860   IF EAS-R02-TCAM-COM = ZEROES                                               
736870      MOVE SPACES                         TO WS-TCAM-COM                      
736880   ELSE                                                                       
736890      MOVE EAS-R02-TCAM-COM               TO WS-TCAM-COM-R.                   
736900                                                                              
736910   IF EAS-R02-TCAM-VALM = ZEROES                                              
736920      MOVE SPACES                         TO WS-TCAM-VALM                     
736930   ELSE                                                                       
736940      MOVE EAS-R02-TCAM-VALM              TO WS-TCAM-VALM-R.                  
736950                                                                              
736960   IF EAS-R02-IMP-MONORI > 0                                                  
736970    STRING "l", EAS-R02-MON-ORI, WKS-R02-IMP-MONORI-REC,                      
736972    WS-FILLER-ORI                                                             
736980    DELIMITED BY SIZE INTO PROC-R02-FORVAR POINTER WS-POINTER                 
736990    STRING "m", WS-AGRUPADOR-TC, WS-FILLER-TC                                 
737000    DELIMITED BY SIZE INTO PROC-R02-FORVAR POINTER WS-POINTER.                
737010                                                                              
737020   STRING "uC", PROC-R02-AUT DELIMITED BY SIZE INTO                           
737030   PROC-R02-FORVAR POINTER WS-POINTER.                                        
737040                                                                              
737050   IF EAS-R02-CVE-NEG > 0                                                     
737060      STRING "Z", EAS-R02-CVE-NEG DELIMITED BY SIZE INTO                      
737070      PROC-R02-FORVAR POINTER WS-POINTER.                                     
737080                                                                              
737090   STRING "." DELIMITED BY SIZE INTO                                          
737100   PROC-R02-FORVAR POINTER WS-POINTER.                                        
737110                                                                              
737120   WRITE PROC-REG FROM REG-PROC.                                              
737130                                                                              
737140   IF WS-ES-CARGO                                                             
737150      ADD 1                               TO WS-TOTAL-CARGOS                  
737160      COMPUTE WS-TOTIMP-CARGOS = WS-TOTIMP-CARGOS +                           
737170                                 PROC-R02-IMPORTE                             
737180   ELSE                                                                       
737190      IF WS-ES-ABONO                                                          
737200         ADD 1                            TO WS-TOTAL-ABONOS                  
737210         COMPUTE WS-TOTIMP-ABONOS = WS-TOTIMP-ABONOS +                        
737220                                    PROC-R02-IMPORTE.                         
737230 60002021-EXIT.                                                               
737240     EXIT.                                                                    
737250                                                                              
737260 60002022-GENERA-REG-NCONT.                                                   
737270   IF EAS-R02-IMP-AUT = 0                                                     
737280      EXIT PERFORM.                                                           
737290                                                                              
737300   MOVE "2"                               TO PROC-R02-TIPREG.                 
737310   ADD 1                                  TO WS-SEC-REG.                      
737320   MOVE WS-SEC-REG                        TO PROC-R02-SECDET.                 
737330   MOVE 0342                              TO PROC-R02-SUCORI.                 
737340   MOVE 21                                TO PROC-R02-CAJORI.                 
737350   IF WS-SEC-AUT = 99999                                                      
737360      MOVE 0                              TO WS-SEC-AUT.                      
737370   ADD 1                                  TO WS-SEC-AUT.                      
737380   MOVE WS-SEC-AUT                        TO WS-AUT-SEC.                      
737390   MOVE WS-AUT-PROC                       TO PROC-R02-AUT.                    
737400   MOVE 0527                              TO PROC-R02-CVETRANS.               
737410   MOVE 3                                 TO PROC-R02-TIPMOV.                 
737420   MOVE 00                                TO PROC-R02-TIPMACC.                
737430   MOVE EAS-R02-SUC                       TO WS-SUCURSAL.                     
737440   MOVE EAS-R02-CONTRATO                  TO WS-CONTRATO.                     
737450   MOVE WS-CONTRATO-PROC                  TO PROC-R02-CONTRATO.               
737460   MOVE EAS-R02-IMP-AUT                TO PROC-R02-IMPORTE                    
737470   MOVE 01                                TO PROC-R02-MONEDA.                 
737480   MOVE EAS-R02-REFERENCIA                TO PROC-R02-REF.                    
737490   MOVE 0                                 TO PROC-R02-FORZADO.                
737500   MOVE LOW-VALUES                        TO WS-DATOS-NOCONT.                 
737510   MOVE PROC-R02-IMPORTE           TO WS-NC-IMPORTE-AUTORIZACION.             
737520   MOVE 00                         TO WS-NC-BLOQUEO-DESBLOQUEO.               
737530   MOVE 001                               TO WS-NC-MONEDA                     
737540                                             WS-NC-MONEDA-AUT.                
737550   MOVE WS-DATOS-NOCONT                   TO PROC-R02-FORVAR.                 
737560                                                                              
737570   WRITE PROC-REG FROM REG-PROC.                                              
737580                                                                              
737590   ADD 1                                  TO WS-TOTAL-NCONT.                  
737600 60002022-EXIT.                                                               
737610     EXIT.                                                                    
737620                                                                              
737630 60002030-GENERA-TRAILER.                                                     
737640   MOVE LOW-VALUES                        TO REG-PROC.                        
737650   MOVE "9"                               TO PROC-R03-TIPREG.                 
737660   MOVE WS-TOTAL-ABONOS                   TO PROC-R03-TOTABO.                 
737670   MOVE WS-TOTIMP-ABONOS                  TO PROC-R03-IMPABO.                 
737680   MOVE WS-TOTAL-CARGOS                   TO PROC-R03-TOTCAR.                 
737690   MOVE WS-TOTIMP-CARGOS                  TO PROC-R03-IMPCAR.                 
737700   MOVE WS-TOTAL-NCONT                    TO PROC-R03-TNCONT.                 
737710                                                                              
737720   WRITE PROC-REG FROM REG-PROC.                                              
737730 60002030-EXIT.                                                               
737740     EXIT.                                                                    
737750                                                                              
737760 60003000-CAMBIA-RUTA.                                                        
737770   CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS-PROC.                     
737780   CLOSE ARCH-EAS WITH RELEASE.                                               
737790 60003000-EXIT.                                                               
737800     EXIT.                                                                    
737810                                                                              
737820 60004000-LLAMA-P197.                                                         
737830   MOVE WS-ETIQEAS-FECHA                  TO WS-WFLP197-FECHA.                
737840   MOVE 58                                TO WS-WFLP197-OPCION.               
737850   CALL SYSTEM WFL USING WS-WFLP197.                                          
737860 60004000-EXIT.                                                               
737870     EXIT.                                                                    
737880                                                                              
737890*FIN-STEFANINI EAS                                                            
737900                                                                              
737920*INI EAS F5                                                                   
737940******************************************************************            
737960* ENVIO DE ARCHIVOS MOVS A COBERTURA MTY,CON LLAMADO AL P197     *            
737980******************************************************************            
738000** BEGIN JOB; START ("CORRESOLO P197 OP AAAAMMDD"); END JOB.   ***            
738020******************************************************************            
738040                                                                              
738060 60004100-ENVIO-ARCH-P197.                                                    
738065   MOVE 0 TO WS-WFLP197-OPCION.                                               
738070                                                                              
738080   IF ARCH-S111                                                               
738100      MOVE WS-FECHA-PRO                  TO WS-WFLP197-FECHA                  
738120      IF WS-TAR-DS = "TARJETADIA"                                             
738140         MOVE 51       TO WS-WFLP197-OPCION.                                  
738200                                                                              
738220   IF ARCH-ECMS                                                               
738240       MOVE WS-FECHA-PRO-EAS             TO WS-WFLP197-FECHA                  
738260      IF WS-TAR-DS = "TARJETADIA"                                             
738280         MOVE 40       TO WS-WFLP197-OPCION                                   
738300      ELSE                                                                    
738320         MOVE 41       TO WS-WFLP197-OPCION.                                  
738330                                                                              
738340   IF WS-WFLP197-OPCION > 0                                                   
738360       CALL SYSTEM WFL USING WS-WFLP197.                                      
738370                                                                              
738380 60004100-EXIT.                                                               
738400     EXIT.                                                                    
738420**FIN EAS F5                                                                  
739010******************************************************************            
739510******************************************************************            
740010* C E R R A D O   D E   A R C H I V O S   Y   B A S E.                        
740510******************************************************************            
741010******************************************************************            
741510 70000000-CIERRO.                                                             
741600  IF ARCH-S111 OR ARCH-ECMS                                                   
742010    PERFORM 70001000-OPEN-BASEUP THRU 70001000-EXIT                           
742510    PERFORM 70002000-ACTB02      THRU 70002000-EXIT                           
743010                                                                              
743510    CLOSE  S500BD01CAPTACION ON EXCEPTION                                     
745010       MOVE "ERROR AL CERRAR LA BASE"    TO WS-0101-TEXT-MSG                  
745510       PERFORM 70000050-MENSAJE                                               
746010       CALL SYSTEM DMTERMINATE.                                               
746200                                                                              
746510 IF ARCH-S111                                                                 
747010    IF WS-TAR-DS = "TARJETADIA"                                               
747100       CHANGE ATTRIBUTE TITLE OF TARJETA TO WS-ETIQTARJETA-APL                
747510       CLOSE TARJETA    WITH SAVE                                             
748010    ELSE                                                                      
748100       CHANGE ATTRIBUTE TITLE OF TBINTERNAL TO WS-ETIQTBINTER-APL             
748510       CLOSE TBINTERNAL WITH SAVE.                                            
748512                                                                              
748514 IF ARCH-ECMS                                                                 
748516*INI-STEFANINI EAS F3                                                         
748518*    IF WS-TAR-DS = "TARJETADIA" AND WS-OPENED-EAS-FILE = 1                   
748520*    ATTRIBUTE OPEN OF ARCH-EAS = VALUE TRUE                                  
748522    IF WS-TAR-DS = "TARJETADIA"                                               
748524       CHANGE ATTRIBUTE TITLE OF ARCH-EAS TO WS-ETIQEAS-PROC                  
748526       CLOSE ARCH-EAS  WITH SAVE                                              
748528       MOVE 0 TO WS-OPENED-EAS-FILE                                           
748530    ELSE                                                                      
748532*    IF WS-TAR-DS = "TARJETASEM" AND WS-OPENED-EAS-FILE = 1                   
748534       CHANGE ATTRIBUTE TITLE OF ARCH-EAS-SEM                                 
748536                                     TO WS-ETIQEAS-SEM-PROC                   
748538       CLOSE ARCH-EAS-SEM WITH SAVE                                           
748540       MOVE 0 TO WS-OPENED-EAS-FILE.                                          
748542*       CLOSE ARCH-DET-B WITH PURGE.                                          
748544                                                                              
748546  IF ARCH-REPORT                                                              
748548      IF WS-TAR-DS = "TARJETADIA"                                             
748550        MOVE "INTERDIA "           TO TIT2-LEYINTER                           
748552      ELSE                                                                    
748554        MOVE "INTERSEM "           TO TIT2-LEYINTER.                          
748556*FIN-STEFANINI EAS F3                                                         
748558  IF ARCH-REPORT                                                              
748560     ADD 1 TO WS-HOJA                                                         
748562                                                                              
748564     WRITE LINEA FROM WS-BLANCOS AFTER  PAGE                                  
748566     WRITE LINEA FROM TIT1       AFTER  1  LINES                              
748568     MOVE  WS-HOJA TO NUM-HOJA                                                
748570     WRITE LINEA FROM TIT2       AFTER  1  LINES                              
748572     WRITE LINEA FROM TIT3       AFTER  3  LINES                              
748574     WRITE LINEA FROM TIT4       AFTER  1  LINES                              
748575                                                                              
748580     MOVE "LLAMADOS AL S016/L422/L458    " TO CONCEPTO-02                     
748585     ADD W77-SI-S016, W77-NO-S016 GIVING WS-DET02-NUM                         
748590     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748591                                                                              
748592     MOVE "LLAMADOS AL S016/L458         " TO CONCEPTO-02                     
748593     MOVE WS-HI-CL458                      TO WS-DET02-NUM                    
748594     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748595                                                                              
748600     MOVE "SI ENCONTRADOS EN EL S016     " TO CONCEPTO-02                     
748602     MOVE W77-SI-S016                      TO WS-DET02-NUM                    
748604     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748606                                                                              
748608     MOVE "NO ENCONTRADOS EN EL S016     " TO CONCEPTO-02                     
748610     MOVE W77-NO-S016                      TO WS-DET02-NUM                    
748612     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748614                                                                              
748616     MOVE "SI ENCONTRADOS EN S016/L458   " TO CONCEPTO-02                     
748617     MOVE W77-SI-L458                      TO WS-DET02-NUM                    
748618     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748619                                                                              
748620     MOVE "NO ENCONTRADOS EN S016/L458   " TO CONCEPTO-02                     
748621     MOVE W77-NO-L458                      TO WS-DET02-NUM                    
748622     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748623                                                                              
748624     MOVE "SI ENCONTRADOS EN S016/L422   " TO CONCEPTO-02                     
748626     MOVE W77-SI-L422                      TO WS-DET02-NUM                    
748628     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748630                                                                              
748640     MOVE "SUC SI IGUAL L422 VS ARCHIVO  " TO CONCEPTO-02                     
748642     MOVE W77-SUC-SIIGUAL                  TO WS-DET02-NUM                    
748644     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748646                                                                              
748648     MOVE "SUC NO IGUAL L422 VS ARCHIVO  " TO CONCEPTO-02                     
748650     MOVE W77-SUC-NOIGUAL                  TO WS-DET02-NUM                    
748652     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748654                                                                              
748656     MOVE "CSI SI IGUAL L422 VS S080     " TO CONCEPTO-02                     
748658     MOVE W77-CSI-SIIGUAL                  TO WS-DET02-NUM                    
748659     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748660                                                                              
748661     MOVE "CSI NO IGUAL L422 VS S080     " TO CONCEPTO-02                     
748662     MOVE W77-CSI-NOIGUAL                  TO WS-DET02-NUM                    
748663     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748664                                                                              
748665     MOVE "SUC NO VALIDA L422            " TO CONCEPTO-02                     
748666     MOVE W77-SUC-INV-L422                 TO WS-DET02-NUM                    
748667     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748670                                                                              
748672     MOVE "CSI SI IGUAL L458 VS S080     " TO CONCEPTO-02                     
748674     MOVE W77-CSI-IGUAL-L458               TO WS-DET02-NUM                    
748676     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748678                                                                              
748680     MOVE "CSI NO IGUAL L458 VS S080     " TO CONCEPTO-02                     
748682     MOVE W77-CSI-NOIGUAL-L458             TO WS-DET02-NUM                    
748684     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748686                                                                              
748688     MOVE "CSI EN CEROS L458             " TO CONCEPTO-02                     
748690     MOVE W77-CSI-00                       TO WS-DET02-NUM                    
748692     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748694                                                                              
748755     MOVE "LLAMADOS A S500L040  " TO CONCEPTO-02                              
748760     ADD W77-SI-BD04, W77-NO-BD04 GIVING WS-DET02-NUM                         
748765     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748770                                                                              
748775     MOVE "SI ENCONTRADOS EN S500L040 " TO CONCEPTO-02                        
748780     MOVE W77-SI-BD04                   TO WS-DET02-NUM                       
748785     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748790                                                                              
748795     MOVE "NO ENCONTRADOS EN S500L040 " TO CONCEPTO-02                        
748800     MOVE W77-NO-BD04                   TO WS-DET02-NUM                       
748805     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748810                                                                              
748815     MOVE "SUC SI IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748820     MOVE W77-SUC-SIIGUAL-BD04             TO WS-DET02-NUM                    
748825     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748830                                                                              
748835     MOVE "SUC NO IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748840     MOVE W77-SUC-NOIGUAL-BD04             TO WS-DET02-NUM                    
748845     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748850                                                                              
748855     MOVE "CTO SI IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748860     MOVE W77-CTO-SIIGUAL-BD04             TO WS-DET02-NUM                    
748865     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748870                                                                              
748875     MOVE "CTO NO IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748880     MOVE W77-CTO-NOIGUAL-BD04             TO WS-DET02-NUM                    
748885     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748890                                                                              
748895     MOVE "CSI SI IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748900     MOVE W77-CSI-SIIGUAL-BD04             TO WS-DET02-NUM                    
748905     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748910                                                                              
748915     MOVE "CSI NO IGUAL L040 VS ARCHIVO  " TO CONCEPTO-02                     
748920     MOVE W77-CSI-NOIGUAL-BD04             TO WS-DET02-NUM                    
748925     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748926                                                                              
748927     MOVE "SUC NO VALIDA L040            " TO CONCEPTO-02                     
748928     MOVE W77-SUC-INV-L040                 TO WS-DET02-NUM                    
748929     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748930                                                                              
748935     MOVE "REGS NO EN S016 NI BD04       " TO CONCEPTO-02                     
748940     MOVE W77-NOS016-NOBD04                TO WS-DET02-NUM                    
748945     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748950                                                                              
748952     MOVE "REGS CON NODO 12 SE MOD SUC   " TO CONCEPTO-02                     
748954     MOVE W77-CSI-12                       TO WS-DET02-NUM                    
748956     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748958                                                                              
748960     MOVE "REGS CON SUC/ORIG NO VALIDA   " TO CONCEPTO-02                     
748962     MOVE W77-CSI-XX                       TO WS-DET02-NUM                    
748964     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748970                                                                              
748972     MOVE "DOBLE LLAMADO L458-L422       " TO CONCEPTO-02                     
748974     MOVE WS-L458-L422                     TO WS-DET02-NUM                    
748976     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
748978                                                                              
748980     MOVE "DOBLE LLAMADO L040-L422       " TO CONCEPTO-02                     
748982     MOVE WS-L040-L422                     TO WS-DET02-NUM                    
748984     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
749002                                                                              
749004     MOVE "NO LLAMADOS AL S016/L422/L458 " TO CONCEPTO-02                     
749006     MOVE W77-NOLLAMA-S016-BD04            TO WS-DET02-NUM                    
749008     WRITE LINEA FROM DETALLE-02  AFTER  1  LINES                             
749010                                                                              
749400     MOVE " "  TO DETALLE-02                                                  
749405     MOVE "**** FIN DE REPORTE ****"       TO CONCEPTO-02                     
749410     WRITE LINEA FROM DETALLE-02  AFTER  2  LINES.                            
749420                                                                              
749440  IF ARCH-S111 AND WS-B02-DECOM-S111 = 0                                      
749510     CLOSE TBINTERMON WITH SAVE                                               
750010     CLOSE TBINTERVDM WITH SAVE.                                              
750100  IF ARCH-ECMS                                                                
750200     CLOSE TBINTERMON-EAS WITH SAVE                                           
750300     CLOSE TBINTERVDM-EAS WITH SAVE.                                          
750400  IF ARCH-REPORT                                                              
750510     CLOSE REPORTE    WITH SAVE.                                              
751010 70000000-EXIT.                                                               
751510    EXIT.                                                                     
752010                                                                              
752510******************************************************************            
753010* ABRO LA BASE DE DATOS DE INQUIRY YA QUE SOLO SERA CONSULTADA.               
753510******************************************************************            
754010 70001000-OPEN-BASEUP.                                                        
754510     OPEN UPDATE  S500BD01CAPTACION                                           
755010     ON EXCEPTION                                                             
756510        MOVE "ERROR AL ABRIR LA BAUPDATE  " TO WS-0101-TEXT-MSG               
757010        PERFORM 70000050-MENSAJE                                              
757510        CALL SYSTEM DMTERMINATE.                                              
758010                                                                              
758510    SET S500B02CONTROL        TO BEGINNING.                                   
759010 70001000-EXIT.                                                               
759510    EXIT.                                                                     
760010                                                                              
760510******************************************************************            
761010* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
761510******************************************************************            
762010 70002000-ACTB02.                                                             
762510  PERFORM 90000002-B02CONTROL-LOCK                                            
763010  IF WS-STATUS-BASE > 0                                                       
763510    IF WS-STATUS-BASE = 1                                                     
765010       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
765510       PERFORM 70000050-MENSAJE                                               
766010       CALL SYSTEM DMTERMINATE                                                
766510    ELSE                                                                      
768010       STRING "ERROR AL HACER LOCK A B02 " ,     WS-STATUS-BASE               
768510       DELIMITED BY SIZE INTO                    WS-0101-TEXT-MSG             
769010       PERFORM 70000050-MENSAJE                                               
769510       CALL SYSTEM DMTERMINATE.                                               
770010                                                                              
770020  IF ARCH-S111 AND WS-B02-DECOM-S111 = 0                                      
770040    IF WS-TAR-DS = "TARJETADIA"                                               
770060          MOVE WS-FECHA-DIARIO           TO B02-ULT-ARCH-APLI(9)              
770080    ELSE                                                                      
770100          MOVE WS-FECHA-SEMANAL          TO B02-ULT-ARCH-APLI(10).            
770120                                                                              
770140  IF ARCH-ECMS                                                                
770160    IF WS-TAR-DS = "TARJETADIA"                                               
770180          MOVE WS-FECHA-DIARIOEAS        TO B02-ULT-ARCH-APLI(21)             
770200    ELSE                                                                      
770510          MOVE WS-FECHA-SEMANALEAS       TO B02-ULT-ARCH-APLI(22).            
772510                                                                              
773010     PERFORM 90000000-BEGIN-TRANSACTION.                                      
773510     PERFORM 90000002-B02CONTROL-STORE.                                       
774010     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
774510 70002000-EXIT.                                                               
775010    EXIT.                                                                     
775510                                                                              
776010                                                                              
776510                                                                              
777010                                                                              
777510                                                                              
778010******************************************************************            
778510*    R U T I N A S   D E   D E S P L I E G U E   D E   M S G.                 
779010*        P A R A   L A   P R I M E R A   S E C T I O N.                       
779510******************************************************************            
780010                                                                              
780510                                                                              
781010                                                                              
781510                                                                              
782010                                                                              
782510                                                                              
783010******************************************************************            
783510* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE.                          
784010******************************************************************            
784510 COPY "S500/INC/PRO/25MTP005".                                                
