000100 IDENTIFICATION DIVISION.                                                     
000200 PROGRAM-ID. S500P131.                                                        
000300 AUTHOR. RG01723 SG09266.                                                     
000400 ENVIRONMENT  DIVISION.                                                       
000500******************************************************************            
000600* S500P131 - SE ENCARGA DE LEER EL  ARCHIVO  DE  TRANSACCIONES  DE            
000700* TERADA Y UTILIZAN LAS REGLAS  CARGADAS   EN LA   BASE DE   DATOS            
000800* S500B04TARJETAS GENERA  EL  CALCULO  DE  COMISIONES  Y  REWARDS.            
000900* GENERA EL ARCHIVO DE RESPUESTA A  TERADATA CON LA INFORMACION DE            
001000* LAS COMISIONES Y REWARDS CALCULADAS.                                        
001100* GENERA EL ARCHIVO DE POSTEO PARA EL PROCESAMIENTO  EN  EL  S500.            
001200* ARCHIVO DE ENTRADA: S500/FILE/INTE/50034E01/04/20250616/EVCOMIS             
001300* ARCHIVOS GENERADOS: S500/FILE/INTS/50034S01/04/20250618/RESEVAL             
001400* S500/FILE/INTE/50034E01/04/20250616/000000000500/0005                       
001500* S500/LIST/P131/0400/R0000/250616/0003291/001EPPCOMISREW                     
001501**************[ 26MTP001-TIPO DE EVALUCION 5 Y 6 ]****************            
001502*=> SE EVALUA    ESQUEMA 5(SALDO Y REWARDS).                                  
001503*=> SE EVALUA    ESQUEMA 6(RENTA Y REWARDS).                                  
001504*=> SE ELIMINA   ESQUEMA 3(REWARDS).                                          
001505*=> SE MODIFICA  MONEDA PARA ESQUEMA DE  REWARDS EN EL ARCHIVO  DE            
001506*   DE RESPUESTA VALOR  INICIAL EN 10, SE INCREMENTA EN 1 POR CADA25MTP010    
001507*   REGLA APLICADA.                                               25MTP010    
001600******************************************************************            
001700 INPUT-OUTPUT SECTION.                                                        
001800 FILE-CONTROL.                                                                
001900        SELECT S500ARCEPP      ASSIGN TO DISK.                                
002000        SELECT S500LISTEPPIN   ASSIGN TO DISK.                                
002100        SELECT S500ARCEPPR     ASSIGN TO DISK.                                
002200        SELECT S500ARCPOST     ASSIGN TO DISK.                                
002300        SELECT S500EPPCOMISREW ASSIGN TO PRINTER.                             
002400        SELECT ARCTEM          ASSIGN TO SORT DISK.                           
002500                                                                              
002600******************************************************************            
002700*                     DATA DIVISION                              *            
002800******************************************************************            
002900                                                                              
003000 DATA DIVISION.                                                               
003100 FILE SECTION.                                                    018100      
003200******************************************************************            
003300*                     ARCHIVO DE POSTEO                          *            
003400******************************************************************            
003500 FD S500ARCPOST                                                               
003600 BLOCK CONTAINS   72   RECORDS.                                               
003700 01  ARC-POSTING-REG       PIC X(880).                                        
003800******************************************************************            
003900*                  ARCHIVO DE RESPUESTA-TERADATA                 *            
004000******************************************************************            
004100 FD S500ARCEPPR                                                               
004200    RECORD CONTAINS  200  CHARACTERS                                          
004300    BLOCK CONTAINS   324   RECORDS                                            
004400    VALUE OF                                                                  
004500            AREAS         IS 42                                               
004600            AREASIZE      IS 13608.                                           
004700 01  S500EPP-REG-RCOMIS  PIC  X(200).                                         
004800******************************************************************            
004900*            ARCHVO DE ENTRADA PARA COMI Y REWARDS               *            
005000******************************************************************            
005100 FD S500LISTEPPIN                                                             
005200 RECORD CONTAINS 90 CHARACTERS.                                               
005300 01 S500LISTEPPIN-REG     PIC X(90).                                          
005400                                                                              
005500******************************************************************            
005600*       LISTADO DE LA EVALUACION DE COMISIONES Y REWARDS         *            
005700******************************************************************            
005800 FD S500EPPCOMISREW                                                           
005900 RECORD CONTAINS 132 CHARACTERS .                                             
006000 01 S500REPCOMIS-REG     PIC X(132).                                          
006100                                                                              
006200******************************************************************            
006300*        ARCHIVO DE EPP-CALCULO DE COMSIONES Y REWARDS           *            
006400******************************************************************            
006500 FD S500ARCEPP VALUE OF DEPENDENTSPECS IS TRUE.                               
006600 01 S500EPP-REG PIC X(300).                                                   
006700                                                                              
006800 SD ARCTEM.                                                                   
006900 01 ST-S500EPP-REG.                                                           
007000     02 ST-LIST-PROD.                                                         
007100         03 ST-L-PROD     PIC 9(04).                                          
007200         03 ST-L-INST     PIC 9(04).                                          
007300         03 ST-L-MON      PIC 9(03).                                          
007400     02 ST-LIST-ESQ       PIC 9(02).                                          
007500     02 ST-LIST-CTO       PIC 9(12).                                          
007600     02 ST-LIST-STATUS    PIC 9(02).                                          
007700     02 ST-LIST-DET       PIC X(63).                                          
007800     02 ST-LIST-DET-COMI           REDEFINES ST-LIST-DET.                     
007900        03 ST-LCOMIS-IMP          PIC 9(08)V99.                               
008000        03 ST-LCOMIS-SUC          PIC 9(04).                                  
008100        03 ST-LCOMIS-NUM-REG      PIC 9(02).                                  
008200        03 ST-LCOMIS-TIP-EXC      PIC 9(02).                                  
008300        03 ST-LCOMIS-CP           PIC 9(02).                                  
008400        03 ST-LCOMIS-WAIVER       PIC 9(08)V99.                               
008500        03 ST-LCOMIS-IMP-EXC      PIC 9(08)V99.                               
008600        03 ST-LCOMIS-IMP-COMI     PIC 9(08)V99.                               
008700        03 ST-LCOMIS-IND-TAB-TOT  PIC 9(02).                                  
008800        03 ST-LCOMIS-EXC-MAN-COD  PIC 9(04).                                  
008900        03 FILLER                 PIC X(07).                                  
009000     02 ST-LIST-DET-REW          REDEFINES ST-LIST-DET.                       
009100        03 ST-LREW-WAIVER       PIC 9(08)V99.                                 
009200        03 ST-LREW-SUC          PIC 9(04).                                    
009300        03 ST-LREW-NUM-REG      PIC 9(02).                                    
009400        03 ST-LREW-TIP-EXC      PIC 9(02).                                    
009500        03 ST-LREW-TIP-REW      PIC 9(02).                                    
009600        03 ST-LREW-CANAL        PIC 9(02).                                    
009700        03 ST-LREW-NUM-MOVS     PIC 9(06).                                    
009800        03 ST-LREW-IMP-REW      PIC 9(08)V99.                                 
009900        03 ST-LREW-IND-TAB-TOT  PIC 9(02).                                    
010000        03 FILLER                  PIC X(23).                                 
010100                                                                              
010200******************************************************************            
010300*                     DATA BASE SECTION                          *            
010400******************************************************************            
010500 DATA-BASE SECTION.                                                           
010600 DB S500BD04TARJETAS.                                                         
010700     01 S500B08PCTRARRIBO.                                                    
010800     01 S500B13PREGCOMEPP.                                                    
010900     01 S500B14PREGREWEPP.                                                    
011000******************************************************************            
011100*                     WORKING STORAGE SECTION                    *            
011200******************************************************************            
011300 WORKING-STORAGE SECTION.                                                     
011400 77 WKS-I                    PIC 9(03).                                       
011500 77 WKS-J                    PIC 9(03).                                       
011600 77 WKS-IN-COM                  PIC 9(03).                                    
011700 77 WKS-ID-T                 PIC 9(02).                                       
011800 77 WKS-J-C                  PIC 9(03).                                       
011900 77 WKS-I-R                  PIC 9(03).                                       
012000 77 WKS-J-R                  PIC 9(03).                                       
012100 77 WKS-I-PRE                PIC 9(03).                                       
012200 77 WKS-J-PRE                PIC 9(03).                                       
012300 77 WKS-K                    PIC 9(02).                                       
012400 77 WKS-COMI                 PIC 9(08)V99.                                    
012500 77 WKS-IMP-EXC              PIC 9(08)V99.                                    
012600 77 WKS-REWARD               PIC 9(08)V99.                                    
012700 77 WKS-CUMPLE-REGLA         PIC 9(02).                                       
012800 77 WKS-REGS-B13             PIC 9(04).                                       
012900 77 WKS-REGS-B14             PIC 9(04).                                       
013000 77 WKS-EOF                  PIC 9(01) VALUE ZERO.                            
013100 77 WKS-EOBD                 PIC 9(02).                                       
013200 77 WKS-EOCAT                PIC 9(02).                                       
013300******************************************************************            
013400*             LAYOUT ARCHIVO DE ENTRADA: EVCOMIS                 *            
013500******************************************************************            
01360001 WKS-S500EPP-REG.                                                           
013700     02 WKS-EPP-TIP-REG                  PIC 9(01).                           
013800     02 WKS-S500EPP-REG-DATA             PIC X(299).                          
013900     02 WKS-EPP-HDR            REDEFINES WKS-S500EPP-REG-DATA.                
014000         03 WKS-EPP-HDR-NODO-ORI         PIC 9(02).                           
014100         03 WKS-EPP-HDR-FECHA-PROCESO    PIC 9(06).                           
014200         03 WKS-EPP-HDR-CLIENTE          PIC 9(12).                           
014300         03 WKS-EPP-HDR-SEC-ARC          PIC 9(04).                           
014400         03 WKS-EPP-HDR-DESC-ARC         PIC X(36).                           
014500         03 WKS-EPP-HDR-FILLER           PIC X(239).                          
014600     02 WKS-EPP-DET            REDEFINES WKS-S500EPP-REG-DATA.                
014700         03 WKS-EPP-DET-SEC              PIC 9(08).                           
014800         03 WKS-EPP-DET-NUM-CLIENTE      PIC 9(12).                           
014900         03 WKS-EPP-DET-NUM-CTO          PIC 9(12).                           
015000         03 WKS-EEP-DET-PROD.                                                 
015100             04 WKS-EPP-DET-PROD         PIC 9(03).                           
015200             04 WKS-EPP-DET-INST         PIC 9(03).                           
015300             04 WKS-EPP-DET-MOND         PIC 9(03).                           
015400         03 WKS-EPP-DET-FEC-ULT-CORTE.                                        
015500             04 WKS-FEC-ULT-C-AAAA       PIC 9(04).                           
015600             04 WKS-FEC-ULT-C-MM         PIC 9(02).                           
015700             04 WKS-FEC-ULT-C-DD         PIC 9(02).                           
015800         03 WKS-EPP-DET-FEC-CORTE-ANT.                                        
015900             04 WKS-FEC-C-ANT-AAAA       PIC 9(04).                           
016000             04 WKS-FEC-C-ANT-MM         PIC 9(02).                           
016100             04 WKS-FEC-C-ANT-DD         PIC 9(02).                           
016200         03 WKS-EPP-DET-FEC-APER.                                             
016300             04 WKS-FEC-APER-AAAA       PIC 9(04).                            
016400             04 WKS-FEC-APER-MM         PIC 9(02).                            
016500             04 WKS-FEC-APER-DD         PIC 9(02).                            
016600         03 WKS-EPP-DET-CVE-TPER         PIC 9(02).                           
016700         03 WKS-EPP-DET-GPO-BIN          PIC 9(04).                           
016800         03 WKS-EPP-DET-CTA-STATUS       PIC 9(01).                           
016900             88 WKS-CTA-ACTIVA           VALUE 1.                             
017000             88 WKS-CTA-DORMANT          VALUE 2.                             
017100             88 WKS-CTA-CLOSE            VALUE 3.                             
017200         03 WKS-EPP-DET-TIP-EVA          PIC 9(02).                           
017300             88 WKS-ESQ-BY-REN           VALUE 01.                            
017400             88 WKS-ESQ-BY-SDO           VALUE 02.                            
017500*            88 WKS-ESQ-BY-REW           VALUE 03.                            
017520             88 WKS-ESQ-MIX-REN          VALUE 05.                            
017540             88 WKS-ESQ-MIX-SDO          VALUE 06.                            
017600         03 WKS-EPP-DET-NUM-SUCDEPTO     PIC 9(04).                           
017700         03 WKS-EPP-DET-PERBCO           PIC 9(02).                           
017800         03 WKS-EPP-DET-SDO-PROM-INTE    PIC 9(14)V99.                        
017900         03 WKS-EPP-DET-COD-EXC-MANUAL   PIC 9(04).                           
018000         03 WKS-EPP-DET-COD-NOMINA       PIC 9(02).                           
018100         03 WKS-EPP-DET-COD-SEGMENTO     PIC 9(04).                           
018200         03 WKS-EPP-DET-CANAL-1          PIC 9(02).                           
018300         03 WKS-EPP-DET-NUM-MOVS-CANAL-1 PIC 9(06).                           
018400         03 WKS-EPP-DET-IMP-CANAL-1      PIC 9(14)V99.                        
018500         03 WKS-EPP-DET-CANAL-2          PIC 9(02).                           
018600         03 WKS-EPP-DET-NUM-MOVS-CANAL-2 PIC 9(06).                           
018700         03 WKS-EPP-DET-IMP-CANAL-2      PIC 9(14)V99.                        
018800         03 WKS-EPP-DET-CANAL-3          PIC 9(02).                           
018900         03 WKS-EPP-DET-NUM-MOVS-CANAL-3 PIC 9(06).                           
019000         03 WKS-EPP-DET-IMP-CANAL-3      PIC 9(14)V99.                        
019100         03 WKS-EPP-DET-CANAL-4          PIC 9(02).                           
019200         03 WKS-EPP-DET-NUM-MOVS-CANAL-4 PIC 9(06).                           
019300         03 WKS-EPP-DET-IMP-CANAL-4      PIC 9(14)V99.                        
019400         03 WKS-EPP-DET-CANAL-5          PIC 9(02).                           
019500         03 WKS-EPP-DET-NUM-MOVS-CANAL-5 PIC 9(06).                           
019600         03 WKS-EPP-DET-IMP-CANAL-5      PIC 9(14)V99.                        
019700         03 WKS-EPP-DET-CANAL-6          PIC 9(02).                           
019800         03 WKS-EPP-DET-NUM-MOVS-CANAL-6 PIC 9(06).                           
019900         03 WKS-EPP-DET-IMP-CANAL-6      PIC 9(14)V99.                        
020000         03 WKS-EPP-DET-CANAL-7          PIC 9(02).                           
020100         03 WKS-EPP-DET-NUM-MOVS-CANAL-7 PIC 9(06).                           
020200         03 WKS-EPP-DET-IMP-CANAL-7      PIC 9(14)V99.                        
020300         03 WKS-EPP-DET-FILLER           PIC X(25).                           
020400     02 WKS-EPP-TRAILER            REDEFINES WKS-S500EPP-REG-DATA.            
020500         03 WKS-EPP-TRAILER-NUM-REGS     PIC 9(08).                           
020600         03 WKS-EPP-TARILER-FILLER       PIC X(291).                          
020700                                                                              
020800******************************************************************            
020900*                  ARCHIVO DE ENTRADA: EVCOMIS                   *            
021000******************************************************************            
021100 01 WKS-NAME-OF-EVCOMIS.                                                      
021200     02 FILLER              PIC X(15) VALUE "S500/FILE/INTE/".                
021300     02 WKS-EVCOMIS-BUZON   PIC X(08) VALUE "50034E01".                       
021400     02 FILLER              PIC X VALUE "/".                                  
021500     02 WKS-EVCOMIS-CSI     PIC 9(02).                                        
021600     02 FILLER              PIC X(01) VALUE "/".                              
021700     02 WKS-EVCOMIS-FECHA   PIC 9(08).                                        
021800     02 FILLER              PIC X(09) VALUE "/EVCOMIS.".                      
021900******************************************************************            
022000*            ARCHIVO DE ENTRADA-PROCESADO: EVCOMIS               *            
022100******************************************************************            
022200 01 WKS-NAME-OF-EVCOMIS-PROC.                                                 
022300     02 FILLER              PIC X(15) VALUE "S500/FILE/INTE/".                
022400     02 FILLER              PIC X(08) VALUE "50034E01".                       
022500     02 FILLER              PIC X VALUE "/".                                  
022600     02 WKS-EVCOMIS-CSI-P   PIC 9(02).                                        
022700     02 FILLER              PIC X(01) VALUE "/".                              
022800     02 WKS-EVCOMIS-FECHA-P PIC 9(08).                                        
022900     02 FILLER              PIC X(19) VALUE "/EVCOMIS/PROCESADO.".            
023000******************************************************************            
023100*                     ARCHIVO DE POSTEO                          *            
023200******************************************************************            
023300 01 WKS-NAME-OF-ARC-POSTING.                                                  
023400     02 FILLER              PIC X(15) VALUE "S500/FILE/INTE/".                
023500     02 WKS-POSTING-BUZON   PIC X(08) VALUE "50034E01".                       
023600     02 FILLER              PIC X VALUE "/".                                  
023700     02 WKS-POSTING-CSI     PIC 9(02).                                        
023800     02 FILLER              PIC X VALUE "/".                                  
023900     02 WKS-POSTING-FECHA   PIC 9(08).                                        
024000     02 FILLER              PIC X VALUE "/".                                  
024100     02 WKS-POSTING-CLIENT  PIC X(12) VALUE "000000000500".                   
024200     02 FILLER              PIC X VALUE "/".                                  
024300     02 WKS-POSTING-SEQ     PIC X(04) VALUE "0005".                           
024400     02 FILLER              PIC X(01) VALUE ".".                              
024500                                                                              
024600******************************************************************            
024700*          ARCHIVO DE RESPUESTA-TERADATA: EPPCOMIREW             *            
024800******************************************************************            
024900 01 WKS-NAME-OF-RCOMIS.                                                       
025000     02 FILLER              PIC X(15) VALUE "S500/FILE/INTS/".                
025100     02 WKS-RCOMIS-BUZON    PIC X(08) VALUE "50034S01".                       
025200     02 FILLER              PIC X VALUE "/".                                  
025300     02 WKS-RCOMIS-CSI      PIC 9(02).                                        
025400     02 FILLER              PIC X VALUE "/".                                  
025500     02 WKS-RCOMIS-FECHA    PIC 9(08).                                        
025600     02 FILLER              PIC X(09) VALUE "/RESEVAL.".                      
025700******************************************************************            
025800*          LISTADO DE COMISIONES Y REWARDS: EPPCOMIREW           *            
025900******************************************************************            
026000 01 WKS-NAME-OF-EPPCOMISREW.                                                  
026100     02 FILLER               PIC X(14)  VALUE "S500/LIST/P131".               
026200     02 FILLER                PIC X(01) VALUE "/".                            
026300     02 WKS-EPPCOMISREW-CSI   PIC 9(02).                                      
026400     02 WKS-RCOMIS-SUB-NODO   PIC 9(02) VALUE 00.                             
026500     02 FILLER                PIC X(02) VALUE "/R".                           
026600     02 WKS-EPPCOMISREW-SEQ   PIC 9(03) VALUE ZEROS.                          
026700     02 FILLER                PIC X(01) VALUE "/".                            
026800     02 WKS-EPPCOMISREW-FECHA.                                                
026820         03 WKS-EPPCOMISREW-FEC-AA PIC 9(02).                                 
026840         03 WKS-EPPCOMISREW-FEC-MM PIC 9(02).                                 
026860         03 WKS-EPPCOMISREW-FEC-DD PIC 9(02).                                 
026900     02 FILLER                PIC X(01) VALUE "/".                            
027000     02 WKS-EPPCOMISREW-MIX   PIC 9(07).                                      
027100     02 FILLER                PIC X(16) VALUE "/001EPPCOMISREW.".             
027200 01 WKS-NAME-OF-ARCCOMISREW.                                                  
027300     02 FILLER               PIC X(14) VALUE "S500/FILE/P131".                
027400     02 FILLER                    PIC X(01) VALUE "/".                        
027500     02 WKS-ARCCOMISREW-CSI       PIC 9(02).                                  
027600     02 WKS-ARCCOMISREW-SUB-NODO  PIC 9(02) VALUE 00.                         
027700     02 FILLER                    PIC X(01) VALUE "/".                        
027800     02 WKS-ARCCOMISREW-FECHA     PIC 9(08).                                  
027900     02 FILLER                PIC X(16) VALUE "/001EPPCOMISREW.".             
028000                                                                              
028100 77 WKS-CONT-PAG             PIC 9(06) VALUE 0.                               
028200 77 WKS-CONT-LIN             PIC 9(02) VALUE 21.                              
028300 77 WKS-MAX-LIN              PIC 9(02) VALUE 58.                              
028400 77 WKS-ESQ-ACTUAL           PIC 9(02).                                       
028500 77 WKS-EVA-ANT              PIC 9(02).                                       
028600 77 WKS-ESQ-AUX              PIC 9(02).                                       
028700 01 WKS-PROD-ACTUAL.                                                          
028800     02 WKS-PROD-ACT         PIC 9(04).                                       
028900     02 WKS-INST-ACT         PIC 9(04).                                       
029000     02 WKS-MOND-ACT         PIC 9(04).                                       
029100 77 WKS-PROD-ANT             PIC 9(11).                                       
029200 77 WKS-PROD-AUX             PIC 9(12).                                       
029300 77 WKS-NUM-REGLA            PIC 9(02).                                       
029400 77 WKS-B13PSTATUS-REGLA     PIC 9(02).                                       
029500 77 WKS-PROD-IMPORTE         PIC 9(08)V99.                                    
029600 77 WKS-PROD-FOUND           PIC 9(01).                                       
029700 01 WKS-VAL-RCOMIS.                                                           
029800     02 WKS-RCOMIS-PROD      PIC 9(04).                                       
029900     02 WKS-RCOMIS-INST      PIC 9(04).                                       
030000     02 WKS-RCOMIS-MON       PIC 9(04).                                       
030100     02 WKS-RCOMIS-NUMC      PIC 9(04).                                       
030200     02 WKS-RCOMIS-CTO       PIC 9(08).                                       
030300     02 WKS-RCOMIS-DESC      PIC X(40).                                       
030400 01 WKS-VAL-POSTE.                                                            
030500     02 WKS-POST-C-EXC       PIC 9(08)V99.                                    
030600 01 WKS-VAL-REP.                                                              
030700     02 WKS-REP-PROD         PIC 9(04).                                       
030800     02 WKS-REP-INST         PIC 9(04).                                       
030900     02 WKS-REP-MON          PIC 9(04).                                       
031000     02 WKS-REP-ESQ          PIC 9(04).                                       
031100     02 WKS-REP-IMP-COMI     PIC 9(08)V99.                                    
031200     02 WKS-REP-SUC          PIC 9(10).                                       
031300     02 WKS-REP-CTO          PIC 9(12).                                       
031400     02 WKS-REP-NUM-REG      PIC 9(02).                                       
031500     02 WKS-REP-DESC         PIC X(40).                                       
031600     02 WKS-REP-CP           PIC 9(01).                                       
031700     02 WKS-REP-WAIVER       PIC 9(08)V99.                                    
031800     02 WKS-REP-C-EXC        PIC 9(08)V99.                                    
031900     02 WKS-REP-C-COMI       PIC 9(08)V99.                                    
032000     02 WKS-REP-T-REW        PIC 9(02).                                       
032100     02 WKS-REP-CAN-REW      PIC 9(02).                                       
032200     02 WKS-REP-MOVS-REW     PIC 9(06).                                       
032300 01 WKS-PRODUCTO.                                                             
032400     02 WKS-PRODUCTO-C             PIC 9(03).                                 
032500     02 WKS-INSTRUMENTO-C          PIC 9(03).                                 
032600     02 WKS-MONEDA-C               PIC 9(03).                                 
032700     02 WKS-ESQUEMA-C              PIC 9(02).                                 
032800 01 WKS-PRODUCTO-R.                                                           
032900     02 PRODUCTO-R           PIC 9(03).                                       
033000     02 INSTRUMENTO-R        PIC 9(03).                                       
033100     02 MONEDA-R             PIC 9(03).                                       
033150 01 WSK-ESQ-R                PIC 9(02).                                       
033200 01  WS-DATOS-HOST.                                                           
033300     02 WS-DH-NUM-CSI           PIC  9(002).                      846300      
033400     02 WKS-HOSTNAME            PIC  X(010).                                  
033500     02 WS-DH-NOM-CSI           PIC  X(026).                      847600      
033600     02 WS-DH-LINEA-BATCH       PIC  X(005).                      847700      
033700 77 WKS-NODO                 PIC 9(02).                                       
033800 77 WKS-FEC-ON-B08           PIC 9(08).                                       
033900 77 WKS-B08-EXISTE-REG       PIC 9(01).                                       
034000 01 WKS-TIPO-EXC             PIC 9(02).                                       
034100     88 WKS-EXC-ON-OPCON     VALUE 01.                                        
034200     88 WKS-EXC-ON-CORRESOLO VALUE 02.                                        
034300 01 WKS-FEC-MAQ.                                                              
034350     02 WKS-FEC-MAQ-SS       PIC 9(02).                                       
034400     02 WKS-FEC-MAQ-AA       PIC 9(02).                                       
034500     02 WKS-FEC-MAQ-MM       PIC 9(02).                                       
034600     02 WKS-FEC-MAQ-DD       PIC 9(02).                                       
034700 01 WKS-FEC-ARC.                                                              
034720     02 WKS-FEC-ARC-SS       PIC 9(02).                                       
034740     02 WKS-FEC-ARC-AA       PIC 9(02).                                       
034760     02 WKS-FEC-ARC-MM       PIC 9(02).                                       
034780     02 WKS-FEC-ARC-DD       PIC 9(02).                                       
034800 01 WKS-FEC-LIST.                                                             
034900     02 WKS-FEC-L-SS         PIC 9(02).                                       
035000     02 WKS-FEC-L-AA         PIC 9(02).                                       
035100     02 WKS-FEC-L-MM         PIC 9(02).                                       
035200     02 WKS-FEC-L-DD         PIC 9(02).                                       
035300 01 WKS-FEC-SAMD.                                                             
035400     02 WKS-FEC-SS           PIC 9(02) VALUE 20.                              
035500     02 WKS-FEC-AA           PIC 9(02).                                       
035600     02 WKS-FEC-MM           PIC 9(02).                                       
035700     02 WKS-FEC-DD           PIC 9(02).                                       
035800 01 WKS-FEC-T-N.                                                              
035900     02 WKS-TAB-PROYECTA-FECHA OCCURS 3 TIMES.                                
036000         03 WKS-FECHA-N      PIC 9(08).                                       
036100         03 WKS-FEC-PROCESDA PIC 9(01).                                       
036200         03 WKS-ARCH-LOG     PIC 9(01).                                       
036300 01 WKS-HORA-MAQ.                                                             
036400     02 WKS-HH               PIC 9(02).                                       
036500     02 WKS-MM               PIC 9(02).                                       
036600     02 WKS-SS               PIC 9(02).                                       
036700     02 WKS-DS               PIC 9(02).                                       
036800 01 WKS-HORMAQ-HM-R          REDEFINES WKS-HORA-MAQ.                          
036900     02 WKS-HORMAQ-HM        PIC 9(04).                                       
037000     02 FILLER               PIC 9(04).                                       
037100 77 WKS-B13P-FEC-INI              PIC 9(08).                                  
037200 77 WKS-B13P-FEC-FIN              PIC 9(08).                                  
037300 77 WKS-LOG-MSG              PIC X(110).                                      
037400 77 WS-I02-LASTREC          PIC S9(12)     .                                  
037500 77 WKS-LOG-MSG2             PIC X(145).                                      
037600 77 WKS-FIN-PROG             PIC 9(01).                                       
037700 77 WKS-ID-ARC               PIC 9(01).                                       
037800 77 WKS-FEC-HABIL            PIC 9(01).                                       
037900 77 WS-S006-FORMATO          PIC S9(11)     BINARY.                           
038000 77 WS-S006-FUNCION          PIC S9(11)     BINARY.                           
038100 01 WS-S006-FECHA1           PIC 9(08).                                       
038200 01 WS-S006-FECHA2           PIC 9(08).                                       
038300 77 WKS-ARC-ON-DISK          PIC 9(01).                                       
038400 77 WKS-HORA-EXE             PIC 9(04).                                       
038500 77 WKS-DESC-ARC             PIC X(36).                                       
038600 77 WKS-CONT-DET             PIC 9(08).                                       
038700 77 WKS-CONT-DET-RCOMIS      PIC 9(08).                                       
038750 77 WKS-CONT-REWARDS         PIC 9(03).                                       
038800 77 WKS-D-GRACIA             PIC 9(03).                                       
038900 77 WKS-NUM-SUC              PIC 9(04).                                       
039000 77 WKS-NUM-CAJ              PIC 9(02).                                       
039100 77 WKS-CVETXN               PIC 9(04).                                       
039200 77 WKS-CVE-CT               PIC 9(04).                                       
039300 77 WKS-CVE-NC               PIC 9(04).                                       
039400 77 WKS-TIPMOV               PIC 9(01).                                       
039500 77 WKS-FRAMESIZE            PIC 9(02)   COMP.                                
039600 77 WKS-LASTRECORD           PIC 9(12)   COMP.                                
039700 77 WKS-MAXRECSIZE           PIC 9(12)   COMP.                                
039800 77 WKS-DISK-SIZE            PIC 9(18)   COMP.                                
039900 77 WKS-MEMORY-SIZE          PIC 9(18)   COMP.                                
040000 77 WKS-MEMORY-65K           PIC 9(18)   COMP.                                
040100 01 WKS-CALC-WORD            PIC 9(12)V99.                                    
040200 01 WKS-CALC-WORD-RED  REDEFINES WKS-CALC-WORD.                               
040300     02 WKS-WORD-ENT         PIC 9(012).                                      
040400     02 WKS-WORD-RES         PIC 9(002).                                      
040500 01 WKS-MEDACC.                                                               
040600     02 WKS-SUCPRO           PIC 9(04).                                       
040700     02 WKS-NUMCTO           PIC 9(12).                                       
040800 77 WKS-IMP-TXN              PIC 9(14)V99.                                    
040900 77 WKS-NUM-PRI              PIC 9(02).                                       
041000 77 WKS-REF-2                PIC X(35).                                       
041100 77 WKS-REF-3                PIC X(35).                                       
041200 77 WKS-REF-4                PIC X(35).                                       
041205 77 WKS-GEN-FECHA            PIC 9(08).                                       
041210 01 WKS-FECHA-INICIAL.                                                        
041220    02 WKS-FI-AA             PIC 9(04).                                       
041230    02 WKS-FI-MM             PIC 9(02).                                       
041240    02 WKS-FI-DD             PIC 9(02).                                       
041250 01 WKS-FECHA-FINAL.                                                          
041260    02 WKS-FN-AA             PIC 9(04).                                       
041270    02 WKS-FN-MM             PIC 9(02).                                       
041280    02 WKS-FN-DD             PIC 9(02).                                       
041300 77 WKS-MES-INI              PIC X(03).                                       
041400 77 WKS-DIA-INI                 PIC 9(02).                                    
041500 77 WKS-MES-FIN                 PIC X(03).                                    
041600 77 WKS-DIA-FIN                 PIC 9(02).                                    
041700 77 WKS-NUN-ABO              PIC 9(08).                                       
041800 77 WKS-TOT-ABO              PIC 9(16)V99.                                    
041900 77 WKS-NUM-CAR              PIC 9(08).                                       
042000 77 WKS-TOT-CAR              PIC 9(16)V99.                                    
042100 77 WKS-NUM-NCO              PIC 9(08).                                       
042200 77 WKS-ERROR                PIC 9(03).                                       
042300 77 WKS-IVA                  PIC 9(03).                                       
042400 77 WKS-ID-ARCHI             PIC X(120).                                      
042500 77 WKS-INTENTO-INTE         PIC 9(01).                                       
042600 77 WKS-ARC-ENVIADO          PIC 9(01).                                       
042700 77 WKS-REPS-INTE            PIC 9(01).                                       
042800 77 WKS-EPP-COMI-MOTIVO      PIC X(40).                                       
043000 77 WKS-EPP-STATUS-REG       PIC 9(02).                                       
043100 77 WKS-B13P-IMP-COMI        PIC 9(08)V99.                                    
043200 77 WKS-EPP-DG-COMI          PIC 9(03).                                       
043300 77 WKS-DG-FECHA1            PIC 9(08).                                       
043400 77 WKS-DG-FECHA2            PIC 9(08).                                       
043500 77 WKS-B13P-WAIVER          PIC 9(08)V99.                                    
043600 77 WKS-PARAM-EPP            PIC 9(08).                                       
043700 77 WKS-B13P-CP              PIC 9(01).                                       
043800 77 WKS-COMI-FORMAT          PIC $ZZZZZZZ9.99.                                
043900 77 WKS-COMI-FORMAT3         PIC $ZZZZZZZ9.99.                                
044000 77 WKS-COMI-FORMAT4         PIC ZZZZZZZ9.99.                                 
044100 77 WKS-COMI-FORMAT2         PIC $ZZ,ZZZ,ZZ9.99.                              
044200 77 WKS-I-LEY-COM            PIC 9(02).                                       
044300******************************************************************            
044400*         VALORES PARA: WKS-EPP-TIP-EXC(TIPO DE EXC.)            *            
044500*01.NOMINA BNMX    02.EMPLEADO. BNMX       03.SEGMENTOS.         *            
044600*04.GRUPO BIN      05.TIPO DE PERSONA      06.SALDO PROMEDIO.    *            
044700*07.MOVIMIENTOS    08.ESQ/EVA.INVALIDA     09.PROD.NOEXISTE EN B13            
044800*10.PROD.INACT.B13 11.PERIODO DE GRACIA    12.EXCEPCION MANUAL   *            
044900*13.N/A REGLA COMI 14.PROD.NOEXISTE EN B14 15.PROD.INACT.B14     *            
045000*16.MOVS. X CANAL  17.N/A REGLA REWARDS                          *            
045100******************************************************************            
045200 77 WKS-EPP-TIP-EXC          PIC 9(02).                                       
045300 77 WKS-B13P-CASQ-BAL        PIC 9(08)V99.                                    
045400 77 WKS-MOVS-MIN             PIC 9(04).                                       
045500 77 WKS-MOVS-MAX             PIC 9(04).                                       
045600 77 WKS-MOVS-CD              PIC 9(04).                                       
045700 77 WKS-MOVS1                PIC 9(06).                                       
045800 77 WKS-MOVS2                PIC 9(06).                                       
045900 77 WKS-MOVS3                PIC 9(06).                                       
046000 77 WKS-CANAL1               PIC 9(02).                                       
046100 77 WKS-CANAL2               PIC 9(02).                                       
046200 77 WKS-CANAL3               PIC 9(02).                                       
046300 77 WKS-EPP-LIM-INF          PIC 9(08)V99.                                    
046400 77 WKS-WAIVER-RW            PIC 9(08)V99.                                    
046500 77 WKS-CANAL-RW             PIC 9(02).                                       
046600 77 WKS-TIPO-RW              PIC 9(02).                                       
046700 77 WKS-CP-RW                PIC 9(02).                                       
046800 77 WKS-NUM-MOVS-RW          PIC 9(06).                                       
046900******************************************************************            
047000*                  VALORES PARA: WKS-IND-TOT                     *            
047100* PARA COMISIONES VALORES DEL 1 AL 12                                         
047200* 1.LEIDOS     2.CON ERROR  3.PER.GRACIA  4.MANUALES 5.NOM.BNMX               
047300* 6. EMP.BNMX  7.SEGMENTOS  8.GPO.BIN     9.TIP.PER 10.SDO.PROM               
047400* 11. MOVS    12.NO APLICA REGLA                                              
047500* PARA REWARDS VALORES DEL 1 AL 10                                            
047600*  1.LEIDOS 2.CON ERROR 3.CAN.DIG        4.ATM.BNMX  5.ATM NO BNMX            
047700*  7.TEOS   8.ATMSAB    9.BANCANET.EMP  10.COMPRAS  11.N/A REGLA              
047800*                                                                             
047900* CADA INDICE CORRESPONDE A UN VALOR PARA:                                    
048000* TAB-TOT-LEYENDAS-COMI                                                       
048100* TAB-TOTALES-COMI                                                            
048200* TAB-TOT-LEYENDAS-REWARDS                                                    
048300* TAB-TOTALES-REW                                                             
048400******************************************************************            
048500 77 WKS-IND-TOT              PIC 9(03).                                       
048600 77 WKS-IMP-C3               PIC 9(16)V99.                                    
048700 77 WKS-B13P-COD-FOUND       PIC 9(01).                                       
048800 01 WKS-VAL-CAT-EXC-EPP.                                                      
048900     02 WKS-CAT-ID           PIC 9(04).                                       
049000     02 WKS-CAT-COD          PIC 9(06).                                       
049100 77 CONTADOR-LJ              PIC 9(11) BINARY VALUE 0.                        
049200 01 MENSAJE-LJ.                                                   100300      
049300     02 SISTEMA-LJ           PIC X(04) VALUE "S500".                          
049400     02 FILLER               PIC X VALUE "/".                                 
049500     02 PASO-LJ              PIC X(04) VALUE "P131".                          
049600     02 FILLER               PIC X VALUE "/".                                 
049700     02 MTP-LJ               PIC 9(03) VALUE 001.                             
049800     02 FILLER               PIC X VALUE ":".                                 
049900     02 TIPO-LJ              PIC X.                                           
050000     02 FILLER               PIC X VALUE ">".                                 
050100     02 CODIGO-LJ            PIC 9(06).                                       
050200     02 FILLER               PIC X VALUE "<".                                 
050300     02 TEXTO-LJ             PIC X(250).                                      
050400 01 WKS-EPP-MESES            PIC X(36)                                        
050500            VALUE "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".                     
050600 01 TAB-EPP-MESES            REDEFINES WKS-EPP-MESES.                         
050700     02 EPP-MESES            OCCURS 12 TIMES.                                 
050800         03 MES-DESC         PIC X(03).                                       
050900 01 TAB-EXC-DESC.                                                             
051000     02 FILLER PIC X(14)     VALUE "NOM.BNX       ".                          
051100     02 FILLER PIC X(14)     VALUE "EMP.BNX       ".                          
051200     02 FILLER PIC X(14)     VALUE "SEGMENTO      ".                          
051300     02 FILLER PIC X(14)     VALUE "GPO.BIN       ".                          
051400     02 FILLER PIC X(14)     VALUE "TIP.PER       ".                          
051500     02 FILLER PIC X(14)     VALUE "SDO.PROM      ".                          
051600     02 FILLER PIC X(14)     VALUE "MOVS          ".                          
051700 01 TAB-EXC-DESC-R           REDEFINES TAB-EXC-DESC.                          
051800     03 WKS-EXC-DESC         PIC X(14) OCCURS 7 TIMES.                        
051900 01 TAB-DESC-CAN.                                                             
052000     02 FILLER PIC X(13)     VALUE "CAN.DIG.     ".                           
052100     02 FILLER PIC X(13)     VALUE "ATM BNMX.    ".                           
052200     02 FILLER PIC X(13)     VALUE "ATM NO BNMX. ".                           
052300     02 FILLER PIC X(13)     VALUE "TEOS.        ".                           
052400     02 FILLER PIC X(13)     VALUE "ATMSAB.      ".                           
052500     02 FILLER PIC X(13)     VALUE "BANCANET.EMP.".                           
052600     02 FILLER PIC X(13)     VALUE "COMPRAS.     ".                           
052700     02 FILLER PIC X(13)     VALUE "SIN CANAL    ".                           
052800 01 TAB-DESC-CAN-R           REDEFINES TAB-DESC-CAN.                          
052900     03 WKS-CAN-DESC         PIC X(13) OCCURS 8 TIMES.                        
053000 01 TAB-TOT-LEYENDAS-COMI.                                                    
053100     02 FILLER PIC X(13)     VALUE "LEIDOS      :".                           
053200     02 FILLER PIC X(13)     VALUE "CON ERROR   :".                           
053300     02 FILLER PIC X(13)     VALUE "P.GRACIA    :".                           
053400     02 FILLER PIC X(13)     VALUE "MANUALES    :".                           
053500     02 FILLER PIC X(13)     VALUE "NOMIMA.BNMX :".                           
053600     02 FILLER PIC X(13)     VALUE "EMP.BNMX    :".                           
053700     02 FILLER PIC X(13)     VALUE "SEGMENTOS   :".                           
053800     02 FILLER PIC X(13)     VALUE "GRUPO BIN   :".                           
053900     02 FILLER PIC X(13)     VALUE "T.PERSONA   :".                           
054000     02 FILLER PIC X(13)     VALUE "SALDO.PROM  :".                           
054100     02 FILLER PIC X(13)     VALUE "MOVIMIENTOS :".                           
054200     02 FILLER PIC X(13)     VALUE "N/A REGLA   :".                           
054300 01 TAB-TOT-LEYENDAS-COMI-R  REDEFINES TAB-TOT-LEYENDAS-COMI.                 
054400     03 WKS-LEY-COMI         PIC X(13) OCCURS 12 TIMES.                       
054500 01 TAB-TOT-LEYENDAS-REWARDS.                                                 
054600     02 FILLER PIC X(13)     VALUE "LEIDOS      :".                           
054700     02 FILLER PIC X(13)     VALUE "CON ERROR   :".                           
054800     02 FILLER PIC X(13)     VALUE "CAN.DIG     :".                           
054900     02 FILLER PIC X(13)     VALUE "ATM.BNMX    :".                           
055000     02 FILLER PIC X(13)     VALUE "ATM NO BNMX :".                           
055100     02 FILLER PIC X(13)     VALUE "TEOS        :".                           
055200     02 FILLER PIC X(13)     VALUE "ATMSAB      :".                           
055300     02 FILLER PIC X(13)     VALUE "BANCANET.EMP:".                           
055400     02 FILLER PIC X(13)     VALUE "COMPRAS     :".                           
055500     02 FILLER PIC X(13)     VALUE "N/A REGLA   :".                           
055600 01 TAB-TOT-LEYENDAS-REWARDS-R REDEFINES TAB-TOT-LEYENDAS-REWARDS.            
055700     03 WKS-LEY-REW            PIC X(13) OCCURS 10 TIMES.                     
055800 01 TAB-TOTALES-COMI.                                                         
055900     02 WKS-TOT-COMI               OCCURS 12 TIMES.                           
056000         03 WKS-TOT-COMI-REGS      PIC 9(09).                                 
056100         03 WKS-TOT-COMI-IMP-POST  PIC 9(10)V99.                              
056200         03 WKS-TOT-COMI-IMP-EXC   PIC 9(10)V99.                              
056300     02 WKS-TOT-POST               PIC 9(10)V99.                              
056400 01 TAB-TOTALES-REW.                                                          
056500     02 TAB-TOT-REW               OCCURS 10 TIMES.                            
056600         03 TAB-TOT-REW-REGS      PIC 9(09).                                  
056700         03 TAB-TOT-REW-IMP-WVR   PIC 9(10)V99.                               
056800     02 WKS-TOT-WAIVER            PIC 9(10)V99.                               
056900 77 WKS-BD                        PIC X(20).                                  
057000 01 WKS-REGLA-AUX.                                                            
057100     04 WKS-AUX-NUM-REGLA        PIC 9(02) COMP.                              
057200     04 WKS-AUX-TIPO-EXCEP       PIC 9(02) COMP.                              
057300     04 WKS-AUX-FECHA-INI        PIC 9(08) COMP.                              
057400     04 WKS-AUX-FECHA-FIN        PIC 9(08) COMP.                              
057500     04 WKS-AUX-CASQ-BALANCE     PIC 9(08)V99 COMP.                           
057600     04 WKS-AUX-IND-IMP-PORC     PIC 9(01) COMP.                              
057700     04 WKS-AUX-IMP-WAIVER       PIC 9(08)V99 COMP.                           
057800     04 WKS-AUX-NUM-RET-ATM-MIN  PIC 9(04) COMP.                              
057900     04 WKS-AUX-NUM-RET-ATM-MAX  PIC 9(04) COMP.                              
058000     04 WKS-AUX-NUM-MOVS-CAN-DIG PIC 9(04) COMP.                              
058100     04 WKS-AUX-STATUS-REGLA     PIC 9(01) COMP.                              
058200     04 WKS-AUX-PRELACION-REGLA  PIC 9(02) COMP.                              
058300******************************************************************            
058400*          TABLA PARA LAS REGLAS DE COMISIONES EN B13            *            
058500******************************************************************            
058600 01 T1-TABLA-REGLAS-COMISIONES.                                               
058700    02 T1-B13PREGCOMEPP                 OCCURS 60 TIMES.                      
058800         03 T1-B13PRODUCTO.                                                   
058900             04 T1-B13P-PRODUCTO         PIC 9(03).                           
059000             04 T1-B13P-INSTRUMENTO      PIC 9(03).                           
059100             04 T1-B13P-MONEDA           PIC 9(03).                           
059200             04 T1-B13P-TIPO-COMI        PIC 9(02).                           
059300         03 T1-B13P-DIAS-PERIO-GRACIA    PIC 9(02).                           
059400         03 T1-B13P-IMP-COMISION         PIC 9(08)V99 COMP.                   
059500         03 T1-B13-TOTAL-REGLAS          PIC 9(02).                           
059600         03 T1-B13P-STATUS               PIC 9(01) COMP.                      
059700         03 T1-B13P-REGLASXPIMYTC        OCCURS 30 TIMES.                     
059800             04 T1-B13P-NUM-REGLA        PIC 9(02) COMP.                      
059900             04 T1-B13P-TIPO-EXCEP       PIC 9(02) COMP.                      
060000             04 T1-B13P-FECHA-INI        PIC 9(08) COMP.                      
060100             04 T1-B13P-FECHA-FIN        PIC 9(08) COMP.                      
060200             04 T1-B13P-CASQ-BALANCE     PIC 9(08)V99 COMP.                   
060300             04 T1-B13P-IND-IMP-PORC     PIC 9(01) COMP.                      
060400             04 T1-B13P-IMP-WAIVER       PIC 9(08)V99 COMP.                   
060500             04 T1-B13P-NUM-RET-ATM-MIN  PIC 9(04) COMP.                      
060600             04 T1-B13P-NUM-RET-ATM-MAX  PIC 9(04) COMP.                      
060700             04 T1-B13P-NUM-MOVS-CAN-DIG PIC 9(04) COMP.                      
060800             04 T1-B13P-STATUS-REGLA     PIC 9(01) COMP.                      
060900             04 T1-B13P-PRELACION-REGLA  PIC 9(02) COMP.                      
061000                                                                              
061100 01 WKS-TABLA-REGLAS-COMISIONES.                                              
061200     02 WKS-B13PREGCOMEPP.                                                    
061300         03 WKS-B13PRODUCTO.                                                  
061400             04 WKS-B13P-PRODUCTO         PIC 9(03).                          
061500             04 WKS-B13P-INTSRUMENTO      PIC 9(03).                          
061600             04 WKS-B13P-MONEDA           PIC 9(03).                          
061700             04 WKS-B13P-TIPO-COMI        PIC 9(02).                          
061800         03 WKS-B13P-DIAS-PERIO-GRACIA    PIC 9(02).                          
061900         03 WKS-B13P-IMP-COMISION         PIC 9(08)V99 COMP.                  
062000         03 WKS-B13-TOTAL-REGLAS          PIC 9(02).                          
062100         03 WKS-B13P-STATUS               PIC 9 COMP.                         
062200         03 WKS-B13P-REGLASXPIMYTC        OCCURS 30 TIMES                     
062300                                          INDEXED BY IDX JDX.                 
062400             04 WKS-T1-B13P-NUM-REGLA     PIC 9(02) COMP.                     
062500             04 WKS-B13P-TIPO-EXCEP       PIC 9(02) COMP.                     
062600             04 WKS-B13P-FECHA-INI        PIC 9(08) COMP.                     
062700             04 WKS-B13P-FECHA-FIN        PIC 9(08) COMP.                     
062800             04 WKS-B13P-CASQ-BALANCE     PIC 9(08)V99 COMP.                  
062900             04 WKS-B13P-IND-IMP-PORC     PIC 9(01) COMP.                     
063000             04 WKS-B13P-IMP-WAIVER       PIC 9(08)V99 COMP.                  
063100             04 WKS-B13P-NUM-RET-ATM-MIN  PIC 9(04) COMP.                     
063200             04 WKS-B13P-NUM-RET-ATM-MAX  PIC 9(04) COMP.                     
063300             04 WKS-B13P-NUM-MOVS-CAN-DIG PIC 9(04) COMP.                     
063400             04 WKS-B13P-STATUS-REGLA     PIC 9(01) COMP.                     
063500             04 WKS-B13P-PRELACION-REGLA  PIC 9(02) COMP.                     
063600                                                                              
063700******************************************************************            
063800*              TABLA DE REGLAS DE REWARDS EN B14                 *            
063900******************************************************************            
064000 01 T2-TABLA-REGLAS-REWARDS.                                                  
064100     02 T2-B14PREGREWEPP OCCURS 60 TIMES.                                     
064200         03 T2-B14PRODUCTO.                                                   
064300             04 T2-B14P-PRODUCTO       PIC 9(03).                             
064400             04 T2-B14P-INTRUMENTO     PIC 9(03).                             
064500             04 T2-B14P-MONEDA         PIC 9(03).                             
064600         03 T2-B14P-STATUS             PIC 9(01).                             
064700         03 T2-B14-TOTAL-REGLAS        PIC 9(02).                             
064800         03 T2-B14P-REGLASXPIM         OCCURS 30.                             
064900             04 T2-B14P-NUM-REWARD     PIC 9(02).                             
065000             04 T2-B14P-TIPO-REWARD    PIC 9(02).                             
065100             04 T2-B14P-IND-IMP-PORC   PIC 9(01).                             
065200             04 T2-B14P-IMP-WAIVER     PIC 9(08)V99.                          
065300             04 T2-B14P-TIPO-CANAL     PIC 9(02).                             
065400             04 T2-B14P-MOVS-CANAL-DIG PIC 9(04).                             
065500             04 T2-B14P-STATUS-REWARD  PIC 9(01).                             
065600 01 WKS-B14PREGREWEPP.                                                        
065700     02 WKS-B14PRODUCTO.                                                      
065800         03 WKS-B14P-PRODUCTO          PIC 9(03).                             
065900         03 WKS-B14P-INTRUMENTO        PIC 9(03).                             
066000         03 WKS-B14P-MONEDA            PIC 9(03).                             
066100     02 WKS-B14P-STATUS                PIC 9(01).                             
066200     02 WKS-T2-B14-TOTAL-REGLAS        PIC 9(02).                             
066300     02 WKS-B14P-REGLASXPIM            OCCURS 30 TIMES.                       
066400         03 WKS-B14P-NUM-REWARD        PIC 9(02).                             
066500         03 WKS-B14P-TIPO-REWARD       PIC 9(02).                             
066600         03 WKS-B14P-IND-IMP-PORC      PIC 9(01).                             
066700         03 WKS-B14P-IMP-WAIVER        PIC 9(08)V99.                          
066800         03 WKS-B14P-TIPO-CANAL        PIC 9(02).                             
066900         03 WKS-B14P-MOVS-CANAL-DIG    PIC 9(04).                             
067000         03 WKS-B14P-STATUS-REWARD     PIC 9(01).                             
067100******************************************************************            
067200*                   TABLA-ORDEN-DE-PRELACION                     *            
067300******************************************************************            
067400 01 WKS-PRELACIONES.                                                          
067500   02 WKS-TAB-PRELACIONES OCCURS 60 TIMES.                                    
067600      03 WKS-PRE-PIM.                                                         
067700         04 WKS-PRE-PROD  PIC 9(04).                                          
067800         04 WKS-PRE-INST  PIC 9(04).                                          
067900         04 WKS-PRE-MON   PIC 9(04).                                          
068000         04 WKS-PRE-ESQ   PIC 9(04).                                          
068100      03 WKS-PRELACION OCCURS 99 TIMES.                                       
068200         04 WKS-PRE-NUM-REGLA PIC 9(02).                                      
068300 77 WKS-B13-NUM-REG PIC 9(02).                                                
068400 77 WKS-B13-PRE     PIC 9(02).                                                
068500                                                                              
068600******************************************************************            
068700*                   TABLA-MOVS-CLIENTE-X-CANAL                   *            
068800******************************************************************            
068900 01 WKS-MOVS-CLIENTE.                                                         
069000     02 WKS-TAB-MOVS OCCURS 7 TIMES.                                          
069100         03 WKS-MOVS-CANAL     PIC 9(02).                                     
069200         03 WKS-MOVS-NUMERO    PIC 9(06).                                     
069300         03 WKS-MOVS-IMPORTE   PIC 9(14)V99.                                  
069400                                                                              
069500******************************************************************            
069600*                    S080-CATALOGO-EPP                           *            
069700******************************************************************            
069800 77 W77-L710-SISTEMA    PIC S9(11) BINARY.                                    
069900 77 W77-L710-PROGRAMA   PIC S9(11) BINARY.                                    
070000 77 W77-L710-RESULT     PIC S9(11) BINARY.                                    
070100 77 W77-L710-IND        PIC  9(04) BINARY.                                    
070200 77 W77-L710-SUC        PIC  9(04) COMP.                                      
070300 77 W77-FIN-L710        PIC  9(02) COMP.                                      
070400 77 W77-L710-REGION     PIC  9(02) COMP.                                      
070500 77 W77-INDCAT-L710     PIC  9(04) COMP.                                      
070600                                                                  332400      
070700 01 WKS-L710-PARAM-ENT.                                                       
070800     02 WKS-L710-CATALOGO-E   PIC 9(06)   COMP.                   332600      
070900     02 WKS-L710-CLAVE-E      PIC 9(02)   COMP.                   332700      
071000     02 WKS-L710-ORDBUSQ-E    PIC 9(02)   COMP.                   332800      
071100     02 WKS-L710-REGS-E       PIC 9(02)   COMP.                   332900      
071200     02 WKS-L710-LLAVE1-E     PIC 9(12).                          333000      
071300     02 WKS-L710-LLAVE2-E     PIC 9(12).                          333100      
071400     02 WKS-L710-LLAVE3-E     PIC 9(12).                          333200      
071500     02 WKS-L710-LLAVE4-E     PIC 9(12).                          333300      
071600     02 WKS-L710-LLAVE5-E     PIC 9(12).                          333400      
071700     02 WKS-L710-LLAVE6-E     PIC 9(12).                          333500      
071800     02 WKS-L710-FVIG-E       PIC 9(06)    COMP.                  333600      
071900     02 WKS-L710-FINI-CON-E   PIC 9(06)    COMP.                  333700      
072000     02 WKS-L710-NIVEL-E      PIC 9(02)    COMP.                  333800      
072100     02 FILLER                PIC X(11).                          333900      
072200                                                                  334000      
072300 01 WKS-L710-PARAM-SAL.                                                       
072400     02 WKS-L710-REGS-S       PIC 9(02)   COMP.                   334200      
072500     02 WKS-L710-CATALOGO-S   PIC 9(06)   COMP.                   334300      
072600     02 WKS-L710-FINI-CON-S   PIC 9(06)   COMP.                   334400      
072700     02 WKS-L710-NIVEL-S      PIC 9(02)   COMP.                   334500      
072800     02 FILLER                PIC X(22).                                      
072900     02 WKS-L710-REGISTRO     OCCURS 10 TIMES.                    334700      
073000         04 WKS-L710-DATOS    PIC 9(12) OCCURS 28 TIMES.                      
073100         04 WKS-L710-FALT-S   PIC 9(06) COMP.                                 
073200         04 WKS-L710-FBAJ-S   PIC 9(06) COMP.                                 
073300         04 WKS-L710-FULT-S   PIC 9(06) COMP.                                 
073400         04 WKS-L710-FVIG-S   PIC 9(06) COMP.                                 
073500         04 FILLER            PIC X(42).                                      
073600 01 WKS-S08CATEPP.                                                            
073700     02 WKS-TAB-CATEPP                 OCCURS 500 TIMES                       
073800                                       INDEXED BY IDX-CAT.                    
073900         03 WKS-CATEPP-ID-CAT          PIC 9(04).                             
074000         03 WKS-CATEPP-PROD            PIC 9(04).                             
074100         03 WKS-CATEPP-INST            PIC 9(04).                             
074200         03 WKS-CATEPP-MON             PIC 9(03).                             
074300         03 WKS-CATEPP-EVA             PIC 9(02).                             
074400         03 WKS-CATEPP-COT-CAT         PIC 9(06).                             
074500         03 WKS-CATEPP-IND-COMI        PIC 9(02).                             
074600         03 WKS-CATEPP-CAN-POR         PIC 9(08)V99.                          
074700         03 WKS-CATEPP-TIP-CANAL       PIC 9(02).                             
074800         03 WKS-CATEPP-NUM-MOVS        PIC 9(02).                             
074900         03 WKS-CATEPP-IMP-MIN         PIC 9(08)V99.                          
075000 01 WKS-S08CATEPP-AUX.                                                        
075100     02 WKS-TAB-CATEPP-AUX             OCCURS 500 TIMES.                      
075200         03 WKS-CATEPP-ID-CAT-AUX      PIC 9(04).                             
075300         03 WKS-CATEPP-PROD-AUX        PIC 9(04).                             
075400         03 WKS-CATEPP-INST-AUX        PIC 9(04).                             
075500         03 WKS-CATEPP-MON-AUX         PIC 9(03).                             
075600         03 WKS-CATEPP-EVA-AUX         PIC 9(02).                             
075700         03 WKS-CATEPP-COT-CAT-AUX     PIC 9(06).                             
075800         03 WKS-CATEPP-IND-COMI-AUX    PIC 9(02).                             
075900         03 WKS-CATEPP-CAN-POR-AUX     PIC 9(08)V99.                          
076000         03 WKS-CATEPP-TIP-CANAL-AUX   PIC 9(02).                             
076100         03 WKS-CATEPP-NUM-MOVS-AUX    PIC 9(02).                             
076200         03 WKS-CATEPP-IMP-MIN-AUX     PIC 9(08)V99.                          
076300 77  WKS-88-CTLVERS                    PIC 99      COMP  VALUE 0.             
076400 77  W77-S000-MY-ID                    PIC X(12).                             
076500 77  W77-S000-MY-VERSION               PIC X(08).                             
076600 01  S000-CTR-LIBID                    PIC X(12).                             
076700 01  S000-CTR-NOMLIB                   PIC X(72).                             
076800 01  S000-CTR-CVEERROR                 PIC S9(11)  BINARY.                    
076900 77 WS-MSG-N-02                        PIC 9(02).                             
077000******************************************************************            
077100*                    ARCHIVO DE POSTEO                           *            
077200******************************************************************            
077300 01 WKS-POSTE-REG                         PIC X(880).                         
077400 01 WKS-POSTE-HDR REDEFINES WKS-POSTE-REG.                                    
077500     03 WKS-POSTE-HDR-TIPREG              PIC 9(01).                          
077600     03 WKS-POSTE-HDR-NODORI              PIC 9(02).                          
077700     03 WKS-POSTE-HDR-FECPRO.                                                 
077800         04 WKS-FECPRO-AA                 PIC 99.                             
077900         04 WKS-FECPRO-MM                 PIC 99.                             
078000         04 WKS-FECPRO-DD                 PIC 99.                             
078100     03 WKS-POSTE-HDR-SISCTE              PIC ZZZZZZZZZZZ9.                   
078200     03 WKS-POSTE-HDR-NUMARC              PIC ZZZ9.                           
078300     03 WKS-POSTE-HDR-DESCTE              PIC X(36).                          
078400     03 WKS-POSTE-HDR-FILLER              PIC X(143).                         
078500     03 WKS-POSTE-HDR-FINREG              PIC X(01).                          
078600     03 WKS-POSTE-HDR-FILLER2             PIC X(675).                         
078700 01 WKS-POSTE-TRL REDEFINES WKS-POSTE-REG.                        167420      
078800     03 WKS-POSTE-TRL-TIPREG              PIC 9(01).                          
078900     03 WKS-POSTE-TRL-NUMABO              PIC ZZZZZZZ9.                       
079000     03 WKS-POSTE-TRL-IMPABO              PIC ZZZZZZZZZZZZZZZ9V99.            
079100     03 WKS-POSTE-TRL-NUMCAR              PIC ZZZZZZZ9.                       
079200     03 WKS-POSTE-TRL-IMPCAR              PIC ZZZZZZZZZZZZZZZ9V99.            
079300     03 WKS-POSTE-TRL-NUMNCO              PIC ZZZZZZZ9.                       
079400     03 WKS-POSTE-TRL-FILLER              PIC X(143).                         
079500     03 WKS-POSTE-TRL-FINREG              PIC X(01).                          
079600     03 WKS-POSTE-TRL-FILLER2             PIC X(675).                         
079700 01 WKS-POSTE-DET REDEFINES WKS-POSTE-REG.                        167465      
079800     03 WKS-POSTE-DET-TIPREG              PIC 9(01).                          
079900     03 WKS-POSTE-DET-SECDET              PIC ZZZZZZZ9.                       
080000     03 WKS-POSTE-DET-NUMSUC              PIC ZZZ9.                           
080100     03 WKS-POSTE-DET-NUMCAJ              PIC 9(02).                          
080200     03 WKS-POSTE-DET-NUMAUT              PIC ZZZZZZZ9.                       
080300     03 WKS-POSTE-DET-CVETXN              PIC ZZZ9.                           
080400     03 WKS-POSTE-DET-TIPMOV              PIC 9(01).                          
080500     03 WKS-POSTE-DET-TIPMED              PIC 9(02).                          
080600     03 WKS-POSTE-DET-MEDACC.                                                 
080700         05 WKS-POSTE-DET-SUCPRO          PIC 9(04).                          
080800         05 WKS-POSTE-DET-NUMCTO          PIC 9(12).                          
080900     03 WKS-POSTE-DET-IMPTXN              PIC 9(14)V99.                       
081000     03 WKS-POSTE-DET-TIPMON              PIC 9(03).                          
081100     03 WKS-POSTE-DET-NUMREF              PIC 9(12).                          
081200     03 WKS-POSTE-DET-VALFI1              PIC 9(01).                          
081300     03 WKS-POSTE-DET-LETRUT              PIC X(02).                          
081400     03 WKS-POSTE-DET-NUMPRI              PIC 9(02).                          
081500     03 WKS-POSTE-DET-VALFI2              PIC 9(14).                          
081600     03 WKS-POSTE-DET-LMEMEM              PIC X(01).                          
081700     03 WKS-POSTE-DET-REFAL2              PIC X(35).                          
081800     03 WKS-POSTE-DET-LMENEN              PIC X(01).                          
081900     03 WKS-POSTE-DET-REFAL3              PIC X(35).                          
082000     03 WKS-POSTE-DET-LMOOOO              PIC X(01).                          
082100     03 WKS-POSTE-DET-REFAL4              PIC X(35).                          
082200     03 WKS-POSTE-DET-FINREG              PIC X(01).                          
082300     03 WKS-POSTE-DET-FILLER              PIC X(675).                         
082400                                                                              
082500******************************************************************            
082600*               ARCHIVO DE RESPUESTA-COMISION                    *            
082700******************************************************************            
082800 01 WKS-RCOMIS-REG              PIC X(200).                                   
082900 01 WKS-RCOMIS-HDR              REDEFINES WKS-RCOMIS-REG.                     
083000     02 WKS-RCOMIS-HDR-TIP-REG  PIC 9(01).                                    
083100     02 WKS-RCOMIS-HDR-NODO-ORI PIC 9(02).                                    
083200     02 WKS-RCOMIS-HDR-FEC-PRGR.                                              
083300        03 WKS-RCOMIS-FEC-AA    PIC 9(02).                                    
083400        03 WKS-RCOMIS-FEC-MM    PIC 9(02).                                    
083500        03 WKS-RCOMIS-FEC-DD    PIC 9(02).                                    
083600     02 WKS-RCOMIS-HDR-SISTEM   PIC 9(12).                                    
083700     02 WKS-RCOMIS-HDR-SEC-ARC  PIC 9(04).                                    
083800     02 WKS-RCOMIS-HDR-DEC-SIS  PIC X(36).                                    
083900     02 WKS-RCOMIS-HDR-FILLER   PIC X(139).                                   
084000 01 WKS-RCOMIS-DET              REDEFINES WKS-RCOMIS-REG.                     
084100     02 WKS-RCOMIS-DET-TIP-REG  PIC 9(01).                                    
084200     02 WKS-RCOMIS-DET-SEQ      PIC 9(08).                                    
084300     02 WKS-RCOMIS-DET-NUM-CLE  PIC 9(12).                                    
084400     02 WKS-RCOMIS-DET-NUM-CTO  PIC 9(12).                                    
084500     02 WKS-RCOMIS-DET-PROD     PIC 9(03).                                    
084600     02 WKS-RCOMIS-DET-INST     PIC 9(03).                                    
084700     02 WKS-RCOMIS-DET-MON      PIC 9(03).                                    
084800     02 WKS-RCOMIS-DET-RESP-EVA PIC X(40).                                    
084900     02 WKS-RCOMIS-DET-FEC-CORT PIC 9(08).                                    
085000     02 WKS-RCOMIS-DET-FEC-RESP PIC 9(08).                                    
085100     02 WKS-RCOMIS-DET-FILLER   PIC X(102).                                   
085200 01 WKS-RCOMIS-TRL              REDEFINES WKS-RCOMIS-REG.                     
085300     02 WKS-RCOMIS-TRL-TIP-REG  PIC 9(01).                                    
085400     02 WKS-RCOMIS-TRL-NUM-DET  PIC 9(08).                                    
085500     02 WKS-RCOMIS-TRL-FILLER   PIC X(191).                                   
085600******************************************************************            
085700*           LISTADO EVALUACION DE COMISIONES/REWARDS             *            
085800******************************************************************            
085900 01 WKS-ARC-LIST-IN.                                                          
086000     02 WKS-LIST-PROD.                                                        
086100         03 WKS-L-PROD             PIC 9(04).                                 
086200         03 WKS-L-INST             PIC 9(04).                                 
086300         03 WKS-L-MON              PIC 9(03).                                 
086400     02 WKS-LIST-ESQ               PIC 9(02).                                 
086500     02 WKS-LIST-CTO               PIC 9(12).                                 
086600     02 WKS-LIST-STATUS            PIC 9(02).                                 
086700     02 WKS-LIST-DET               PIC X(63).                                 
086800     02 WKS-LIST-DET-COMI          REDEFINES WKS-LIST-DET.                    
086900        03 WKS-LCOMIS-IMP          PIC 9(08)V99.                              
087000        03 WKS-LCOMIS-SUC          PIC 9(04).                                 
087100        03 WKS-LCOMIS-NUM-REG      PIC 9(02).                                 
087200        03 WKS-LCOMIS-TIP-EXC      PIC 9(02).                                 
087300        03 WKS-LCOMIS-CP           PIC 9(02).                                 
087400        03 WKS-LCOMIS-WAIVER       PIC 9(08)V99.                              
087500        03 WKS-LCOMIS-IMP-EXC      PIC 9(08)V99.                              
087600        03 WKS-LCOMIS-IMP-COMI     PIC 9(08)V99.                              
087700        03 WKS-LCOMIS-IND-TAB-TOT  PIC 9(02).                                 
087800        03 WKS-LCOMIS-EXC-MAN-COD  PIC 9(04).                                 
087900        03 FILLER                  PIC X(07).                                 
088000     02 WKS-LIST-DET-REW           REDEFINES WKS-LIST-DET.                    
088100        03 WKS-LREW-WAIVER         PIC 9(08)V99.                              
088200        03 WKS-LREW-SUC            PIC 9(04).                                 
088300        03 WKS-LREW-NUM-REG        PIC 9(02).                                 
088400        03 WKS-LREW-TIP-EXC        PIC 9(02).                                 
088500        03 WKS-LREW-TIP-REW        PIC 9(02).                                 
088600        03 WKS-LREW-CANAL          PIC 9(02).                                 
088700        03 WKS-LREW-NUM-MOVS       PIC 9(06).                                 
088800        03 WKS-LREW-IMP-REW        PIC 9(08)V99.                              
088900        03 WKS-LREW-IND-TAB-TOT    PIC 9(02).                                 
088950        03 WKS-LREW-CP             PIC 9(02).                                 
089000        03 FILLER                  PIC X(21).                                 
089100                                                                              
089200******************************************************************            
089300*           LISTADO EVALUACION DE COMISIONES/REWARDS             *            
089400******************************************************************            
089500 01 WKS-REPCOMIS-HDR1.                                                        
089600     02 FILLER PIC X(23)  VALUE "  S500-P131-EPPCOMISREW".                    
089700     02 FILLER PIC X(28)  VALUE SPACES.                                       
089800     02 FILLER PIC X(29)  VALUE "BANCO NACIONAL DE MEXICO S.A.".              
089900     02 FILLER PIC X(34)  VALUE SPACES.                                       
090000     02 FILLER PIC X(07)  VALUE "FECHA: ".                                    
090100     02 WKS-REPCOMIS-HDR1-FEC.                                                
090200         03 WKS-HDR1-DD   PIC 9(02).                                          
090300         03 FILLER        PIC X(01) VALUE "/".                                
090400         03 WKS-HDR1-MM   PIC 9(02).                                          
090500         03 FILLER        PIC X(03) VALUE "/20".                              
090600         03 WKS-HDR1-AAAA PIC 9(02).                                          
090700                                                                              
090800 01 WKS-REPCOMIS-HDR2.                                                        
090900     02 FILLER PIC X(11)  VALUE "  PROCESO: ".                                
091000     02 WKS-REPCOMIS-HDR2-FEC.                                                
091100        03 WKS-HDR2-DD   PIC 9(02).                                           
091200        03 FILLER        PIC X(01) VALUE "/".                                 
091300        03 WKS-HDR2-MM   PIC 9(02).                                           
091400        03 FILLER        PIC X(03) VALUE "/20".                               
091500        03 WKS-HDR2-AAAA PIC 9(02).                                           
091600     02 FILLER           PIC X(28) VALUE SPACES.                              
091700     02 FILLER           PIC X(35) VALUE                                      
091800                            "TRANSACCIONES PROCESADAS COMISIONES".            
091900     02 FILLER           PIC X(24) VALUE SPACES.                              
092000     02 FILLER           PIC X(23) VALUE                                      
092100                            "TIPO DE PROCESO: DIARIO".                        
092200                                                                              
092300 01 WKS-REPCOMIS-HDR3.                                                        
092400     02 FILLER                  PIC X(08) VALUE "  HORA: ".                   
092500     02 WKS-REPCOMIS-HDR3-HORA.                                               
092600         03 WKS-HDR3-HH         PIC 9(02).                                    
092700         03 FILLER              PIC X(01) VALUE ":".                          
092800         03 WKS-HDR3-MN         PIC 9(02).                                    
092900         03 FILLER              PIC X(01) VALUE ":".                          
093000         03 WKS-HDR3-SG         PIC 9(02).                                    
093100     02 FILLER                  PIC X(06) VALUE SPACES.                       
093200     02 FILLER                  PIC X(06) VALUE "HOST: ".                     
093300     02 WKS-HDR3-HOST           PIC X(09).                                    
093400     02 FILLER                  PIC X(83) VALUE SPACES.                       
093500     02 FILLER                  PIC X(05) VALUE "HOJA:".                      
093600     02 WKS-HDR3-PAG            PIC 9(06).                                    
093700                                                                              
093800 01 WKS-REPCOMIS-HDR4.                                                        
093900     02 FILLER PIC X(02) VALUE SPACES.                                        
094000     02 FILLER PIC X(10) VALUE "PRODUCTO: ".                                  
094100     02 WKS-HDR4-PROD    PIC ZZZ9.                                            
094200     02 FILLER           PIC X(16) VALUE "   INSTRUMENTO: ".                  
094300     02 WKS-HDR4-INST    PIC ZZZ9.                                            
094400     02 FILLER           PIC X(11) VALUE "   MONEDA: ".                       
094500     02 WKS-HDR4-MOND    PIC ZZ9.                                             
094600     02 FILLER           PIC X(12) VALUE "   ESQUEMA: ".                      
094700     02 WKS-HDR4-ESQ     PIC X(12).                                           
094800     02 FILLER           PIC X(08) VALUE SPACES.                              
094900     02 FILLER           PIC X(18) VALUE "IMPORTE DE COMIS: ".                
095000     02 WKS-HDR4-IMP     PIC ZZZZZZZ9.99.                                     
095100                                                                              
095200  01 WKS-REPCOMIS-HDR4-1.                                                     
095300     02 FILLER PIC X(02) VALUE SPACES.                                        
095400     02 FILLER PIC X(10) VALUE "PRODUCTO: ".                                  
095500     02 WKS-HDR4-1-PROD  PIC ZZZ9.                                            
095600     02 FILLER           PIC X(16) VALUE "   INSTRUMENTO: ".                  
095700     02 WKS-HDR4-1-INST  PIC ZZZ9.                                            
095800     02 FILLER           PIC X(11) VALUE "   MONEDA: ".                       
095900     02 WKS-HDR4-1-MOND  PIC ZZ9.                                             
096000     02 FILLER           PIC X(12) VALUE "   ESQUEMA: ".                      
096100     02 WKS-HDR4-1-ESQ   PIC X(12).                                           
096200                                                                              
096300 01 WKS-REPCOMIS-HDR5.                                                        
096400     02 FILLER    PIC X(02) VALUE SPACES.                                     
096500     02 FILLER    PIC X(20) VALUE "SUC   NO.CONTRATO   ".                     
096600     02 FILLER    PIC X(17) VALUE "REGLA DESCRIPCION".                        
096700     02 FILLER    PIC X(31) VALUE SPACES.                                     
096800     02 FILLER    PIC X(25) VALUE "T.COMIS   WAIVER         ".                
096900     02 FILLER    PIC X(37) VALUE                                             
097000                           "CANT.EXENCION   COMISION     ESTATUS".            
097100 01 WKS-REPCOMIS-HDR5-1.                                                      
097200     02 FILLER    PIC X(02) VALUE SPACES.                                     
097300     02 FILLER    PIC X(24) VALUE "SUC  REW  NO.CONTRATO   ".                 
097400     02 FILLER    PIC X(17) VALUE "REGLA DESCRIPCION".                        
097500     02 FILLER    PIC X(23) VALUE SPACES.                                     
097600     02 FILLER    PIC X(28) VALUE "T.REW  CANAL         NO.MOVS".             
097700     02 FILLER    PIC X(24) VALUE "       WAIVER   ESTATUS".                  
097800 01 WKS-REPCOMIS-DET.                                                         
097900     02 FILLER            PIC X(02) VALUE SPACES.                             
098000     02 WKS-DET-SUC       PIC 9(04).                                          
098100     02 FILLER            PIC X(02) VALUE SPACES.                             
098200     02 WKS-DET-CTO       PIC 9(12).                                          
098300     02 FILLER            PIC X(03) VALUE SPACES.                             
098400     02 WKS-DET-NUM-REGLA PIC Z9.                                             
098500     02 FILLER            PIC X(03) VALUE SPACES.                             
098600     02 WKS-DET-EXC-DESC  PIC X(40) VALUE SPACES.                             
098700     02 FILLER            PIC X(02) VALUE SPACES.                             
098800     02 WKS-DET-T-COMI    PIC X(05).                                          
098900     02 FILLER            PIC X(05) VALUE SPACES.                             
099000     02 WKS-DET-WAIVER    PIC ZZZZZZZ9.99.                                    
099100     02 FILLER            PIC X(05) VALUE SPACES.                             
099200     02 WKS-DET-C-EXEN    PIC ZZZZZZZ9.99.                                    
099300     02 FILLER            PIC X(04) VALUE SPACES.                             
099400     02 WKS-DET-COMISION  PIC ZZZZZZZ9.99.                                    
099500     02 FILLER            PIC X(02) VALUE SPACES.                             
099600     02 WKS-DET-STATUS    PIC X(07).                                          
099700 01 WKS-REPCOMIS-DET-REW.                                                     
099800     02 FILLER            PIC X(02) VALUE SPACES.                             
099900     02 WKS-REW-SUC       PIC 9(04).                                          
100000     02 FILLER            PIC X(02) VALUE SPACES.                             
100100     02 WKS-REW-NUM-REGLA PIC Z9.                                             
100200     02 FILLER            PIC X(02) VALUE SPACES.                             
100300     02 WKS-REW-CTO       PIC 9(12).                                          
100400     02 FILLER            PIC X(02) VALUE SPACES.                             
100500     02 WKS-REW-EXC-DESC  PIC X(40) VALUE SPACES.                             
100600     02 WKS-REW-TIPO      PIC X(05).                                          
100700     02 FILLER            PIC X(02) VALUE SPACES.                             
100800     02 WKS-REW-CAN       PIC X(13) VALUE SPACES.                             
100900     02 FILLER            PIC X(02) VALUE SPACES.                             
101000     02 WKS-REW-MOVS      PIC ZZZZZ9.                                         
101100     02 FILLER            PIC X(02) VALUE SPACES.                             
101200     02 WKS-REW-WAIVER    PIC X(12).                                          
101300     02 FILLER            PIC X(02) VALUE SPACES.                             
101400     02 WKS-REW-STATUS    PIC X(07).                                          
101500                                                                              
101600 01 WKS-REPCOMIS-HDR6.                                                        
101700     02 FILLER            PIC X(17) VALUE "  TOTALES ESQUEMA".                
101800     02 FILLER            PIC X(21) VALUE "     REGISTROS       ".            
101900     02 FILLER            PIC X(18) VALUE "IMP POSTEADO      ".               
102000     02 FILLER            PIC X(14) VALUE " IMP EXCEPCION".                   
102100 01 WKS-REPCOMIS-HDR7.                                                        
102200     02 FILLER            PIC X(18) VALUE "   TOTALES ESQUEMA".               
102300     02 FILLER            PIC X(21) VALUE "     REGISTROS       ".            
102400     02 FILLER            PIC X(03) VALUES SPACES.                            
102500     02 FILLER            PIC X(18) VALUE "IMP WAIVER      ".                 
102600 01 WKS-REPCOMIS-TOTALES-COM.                                                 
102700     02 FILLER                 PIC X(02) VALUE SPACES.                        
102800     02 WKS-TOT-COMIS-LEY      PIC X(13) VALUE SPACES.                        
102900     02 FILLER                 PIC X(07) VALUES SPACES.                       
103000     02 WKS-TOT-COMIS-CONT     PIC ZZZ,ZZZ,ZZ9.                               
103100     02 FILLER                 PIC X(03) VALUE SPACES.                        
103200     02 WKS-TOT-COMIS-IMP-POST PIC X(17).                                     
103300     02 WKS-TOT-COMIS-IMP-POST-R REDEFINES WKS-TOT-COMIS-IMP-POST.            
103400        03 WKS-IMP-POST        PIC $Z,ZZZ,ZZZ,ZZ9.99.                         
103500     02 FILLER                 PIC X(03) VALUE SPACES.                        
103600     02 WKS-TOT-COMIS-IMP-EXC  PIC X(17).                                     
103700     02 WKS-TOT-COMIS-IMP-EXC-R REDEFINES WKS-TOT-COMIS-IMP-EXC.              
103800        03 WKS-IMP-EXC-R         PIC $Z,ZZZ,ZZZ,ZZ9.99.                       
103900 01 WKS-REPCOMIS-TOTALES-REW.                                                 
104000     02 FILLER               PIC X(02) VALUE SPACES.                          
104100     02 WKS-TOT-REW-LEY      PIC X(13) VALUE SPACES.                          
104200     02 FILLER               PIC X(07) VALUES SPACES.                         
104300     02 WKS-TOT-REW-CONT     PIC ZZZ,ZZZ,ZZ9.                                 
104400     02 FILLER               PIC X(03) VALUE SPACES.                          
104500     02 WKS-TOT-REW-IMP-WVR  PIC X(17).                                       
104600     02 WKS-TOT-REW-IMP-WVR-R REDEFINES WKS-TOT-REW-IMP-WVR.                  
104700        03 WKS-IMP-WVR         PIC $Z,ZZZ,ZZZ,ZZ9.99.                         
104800  01 WKS-REPCOMIS-TOTALES-IMP.                                                
104900     02 FILLER               PIC X(02) VALUE SPACES.                          
105000     02 WKS-TOT-IMP-LEY      PIC X(17) VALUE SPACES.                          
105100     02 FILLER               PIC X(02) VALUES SPACES.                         
105200     02 WKS-TOT-IMP          PIC $Z,ZZZ,ZZZ,ZZ9.99.                           
105300  01 WKS-REPCOMIS-VACIO     PIC X(19) VALUE "   SIN INFORMACION.".            
105400  01 WKS-REPCOMIS-1X         PIC X(02) VALUE "1X".                            
105402                                                                              
105404******************************************************************            
105406*           SYSTEM FORZA WFL                                     *            
105408******************************************************************            
105410 01 WKS-WFL-SYSTEMF USAGE DISPLAY.                                            
105412    03 FILLER                             PIC X(29) VALUE                     
105414              "BEGIN JOB SYSTEM/FORZA/P131; ".                                
105416    03 FILLER                             PIC X(26) VALUE                     
105418              "JOBSUMMARY=UNCONDITIONAL; ".                                   
105420    03 FILLER                             PIC X(40) VALUE                     
105422              "FAMILY DISK = CAPTACION OTHERWISE DISK; ".                     
105424    03 WS-TIT-ACCE                        PIC X(30)     .                     
105432    03 FILLER                             PIC X(18) VALUE                     
105434       " RUN SYSTEM/FORZA(".                                                  
105436    03 FILLER                             PIC X(01) VALUE QUOTES.             
105438    03 FILLER                             PIC X(14) VALUE                     
105440               "S500/LIST/P131".                                              
105442    03 FILLER                             PIC X(01) VALUE QUOTES.             
105444    03 FILLER                             PIC X(03) VALUE "); ".              
105446    03 FILLER                             PIC X(08) VALUE                     
105448                               "END JOB.".                                    
105450                                                                              
105500******************************************************************            
105600*                  PROCEDURE DIVISION                            *            
105700******************************************************************            
105800 PROCEDURE DIVISION.                                                          
105900 DECLARATIVES.                                                                
106000 PROC-BY-HI SECTION.                                                          
106100    USE AS INTERRUPT PROCEDURE.                                               
106200 000-HI-INICIO.                                                               
106300     DISALLOW INTERRUPT.                                                      
106400                                                                              
106500     IF ATTRIBUTE TASKVALUE OF MYSELF = 4                                     
106600         STRING "HI 4: SE FINALIZA EJECUCION DEL PROCESO-EPP"                 
106700         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
106800         PERFORM 000100-ARMA-MSG-LOG                                          
106900         MOVE 1 TO WKS-FIN-PROG.                                              
107000                                                                              
107100     CHANGE ATTRIBUTE TASKVALUE OF MYSELF TO 0.                               
107200     ALLOW INTERRUPT.                                                         
107300 END DECLARATIVES.                                                            
107400******************************************************************            
107500*                    MAIN PROCEDURE-SECTION                      *            
107600*PRIMER CASO: WKS-EXC-ON-CORRESOLO                               *            
107700*WKS-FEC-HABIL = 0                                               *            
107800*   FECHA INHABIL NO SE EJECUTA EL PROCESO                       *            
107900*WKS-B08-STATUS-REG=1                                            *            
108000*   NO SE EJECUTA PORQUE LA FECHA YA SE PROCESO.                 *            
108100*                                                                *            
108200*SEGUNDO CASO: WKS-EXC-ON-OPCON                                  *            
108300*EJECUCION POR OPCON, SE EJECUTA TODO EL DIA 0 HASTA QUE SE      *            
108400*ENCUENTREN LOS ARCHIVOS EN T-N                                  *            
108500******************************************************************            
108600                                                                              
108700 0000-MAIN-PROCEDURE SECTION.                                                 
108800 0000-PROCEDURE.                                                              
108900     PERFORM 000000-INICIO-PROCESO                                            
109000     IF WKS-EXC-ON-CORRESOLO                                                  
109100         PERFORM 000300-PROCESA-EXC-CORRESOLO                                 
109200     ELSE                                                                     
109300     IF WKS-EXC-ON-OPCON                                                      
109400         PERFORM 000300-PROCESA-EXC-OPCON UNTIL WKS-FIN-PROG = 1.             
109500                                                                              
109600     PERFORM 0400-END-PROG.                                                   
109700                                                                              
109800******************************************************************            
109900*                      INICIO DEL PROGRAMA                       *            
110000******************************************************************            
110100 000000-INICIO-PROCESO.                                                       
110200     PERFORM 000100-ENLACE-LIBS                                               
110300     PERFORM 000100-CHECA-VERSION-PG                                          
110400     PERFORM 000100-HOSTNAME                                                  
110500     PERFORM 000100-ASIGNA-NODO                                               
110600     PERFORM 000100-VALIDA-PARAMETRO                                          
110700     ATTACH PROC-BY-HI TO ATTRIBUTE EXCEPTIONEVENT                            
110800            OF MYSELF.                                            347900      
110900     ALLOW INTERRUPT.                                             348000      
111000                                                                              
111100 000100-INI-VARS-OPCON.                                                       
111200*     MOVE 0 TO WKS-FEC-PROCESDA(1),                                          
111300*               WKS-FEC-PROCESDA(2),                                          
111400*               WKS-FEC-PROCESDA(3)                                           
111500                                                                              
111600     MOVE 1 TO WKS-INTENTO-INTE                                               
111700     MOVE 3 TO WKS-ID-ARC                                                     
111800     MOVE SPACES TO WKS-LOG-MSG.                                              
111900                                                                              
112000 000100-INI-VARS-CORRESOLO.                                                   
112100     MOVE 0             TO WKS-TOT-ABO                                        
112200     MOVE 1             TO WKS-INTENTO-INTE                                   
112300     MOVE WKS-FEC-SAMD  TO WKS-FEC-ON-B08,                                    
112400                           WKS-FEC-ARC                                        
112500     MOVE SPACES        TO WKS-LOG-MSG.                                       
112600                                                                              
112700 000100-CHECA-VERSION-PG.                                                     
112800     MOVE "S500P131" TO W77-S000-MY-ID                                        
112900     MOVE "26MTP001" TO W77-S000-MY-VERSION                                   
113000     CALL "CHECAME IN CTLVERS"                                                
113100           USING   W77-S000-MY-ID                                 120900      
113200                   W77-S000-MY-VERSION                            120950      
113300           GIVING  S000-CTR-CVEERROR.                             121000      
113400                                                                              
113500     IF S000-CTR-CVEERROR < 0                                                 
113600         STRING "ERROR DE VERSION "                               212400      
113700                DELIMITED BY SIZE INTO WKS-LOG-MSG                            
113800         PERFORM 000100-ARMA-MSG-LOG                                          
113900         CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                             
114000                                                                              
114100 000100-HOSTNAME.                                                             
114200     CHANGE ATTRIBUTE LIBACCESS OF "SOPORTECOMS" TO BYFUNCTION.               
114300     CHANGE ATTRIBUTE FUNCTIONNAME OF "SOPORTECOMS"               014950      
114400                                   TO "SOPORTECOMS".              015000      
114500                                                                              
114600     CALL "CSIID OF SOPORTECOMS" USING WS-DATOS-HOST.                         
114700                                                                              
114800******************************************************************            
114900*        PROCESO PARA MANDAR MENSAJE A LA LOG CON LA LJ          *            
115000******************************************************************            
115100 000100-ARMA-MSG-LOG.                                                         
115200     IF CONTADOR-LJ > 900                                                     
115300         STRING "CONTADOR LJ > 900: SE REINICIA VALOR A 0"                    
115400         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
115500         MOVE ZEROS TO CONTADOR-LJ.                                           
115600     MOVE "E"         TO  TIPO-LJ                                             
115700     MOVE "050115"    TO  CODIGO-LJ                                           
115800     MOVE WKS-LOG-MSG TO TEXTO-LJ                                             
115900     PERFORM 000400-CALL-LJ.                                                  
116000                                                                              
116100******************************************************************            
116200*                 VALIDACION DEL PARAMETRO EPP                   *            
116300*WKS-PARAM-EPP:                                                  *            
116400*  VALOR 1  : EJECUCION EN OPCON, SE TOMA LA FEHCA MAQUINA       *            
116500*  VALOR > 1: EJECUCION EN CORRESOLO, SE TOMA LA FECHA DEL PARAM.*            
116600*  VALOR 0  : PARAMETRO INCORECTO                                *            
116700*WKS-TIPO-EXC:                                                   *            
116800*  VALOR 1: EJECUCION EN OPCON                                   *            
116900*  VALOR 2: EJECUCION EN CORRESOLO                               *            
117000******************************************************************            
117100 000100-VALIDA-PARAMETRO.                                                     
117200     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-PARAM-EPP.                     
117300     ACCEPT WKS-FEC-MAQ       FROM DATE YYYYMMDD.                             
117400     ACCEPT WKS-HORA-MAQ      FROM TIME                                       
117500     IF WKS-PARAM-EPP > 1                                                     
117600         PERFORM 000200-ABRE-S500BD04TARJETAS                                 
117700         MOVE   WKS-PARAM-EPP TO WKS-FEC-SAMD                                 
117800         MOVE   02            TO WKS-TIPO-EXC                                 
117900         PERFORM 000100-VAL-FEC-CORRESOLO                                     
118000     ELSE                                                                     
118100         IF WKS-PARAM-EPP = 1                                                 
118200            PERFORM 000200-ABRE-S500BD04TARJETAS                              
118300            MOVE WKS-FEC-MAQ-AA TO WKS-FEC-AA                                 
118400            MOVE WKS-FEC-MAQ-DD TO WKS-FEC-DD                                 
118500            MOVE WKS-FEC-MAQ-MM TO WKS-FEC-MM                                 
118600            MOVE 01             TO WKS-TIPO-EXC                               
118700            PERFORM 000100-CARGA-CAT-EPP                                      
118800            PERFORM 000100-PROCESA-FECHA-OPCON                                
118900         ELSE                                                                 
119000            IF WKS-PARAM-EPP = 0                                              
119100                STRING "ERROR: PARAMETRO INVALIDO: " WKS-PARAM-EPP            
119200                DELIMITED BY SIZE INTO WKS-LOG-MSG                            
119300                PERFORM 000100-ARMA-MSG-LOG                                   
119400                CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                      
119500                                                                              
119600 000100-VAL-FEC-B08-CORRESOLO.                                                
119700     PERFORM 000100-BUSCA-FEC-T-N-ON-B08.                                     
119800     IF WKS-B08-EXISTE-REG = 1                                                
119900         STRING "CORRESOLO: YA SE PROCESO FECHA:" WKS-FEC-SAMD                
120000         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
120100         PERFORM 000100-ARMA-MSG-LOG.                                         
120200                                                                              
120300******************************************************************            
120400*               ENLACE DE LIBRERIAS PARA EL PROCESO              *            
120500******************************************************************            
120600 000100-ENLACE-LIBS.                                                          
120700     CHANGE  ATTRIBUTE LIBACCESS    OF "ADMONXFERS" TO  BYFUNCTION            
120800     CHANGE  ATTRIBUTE LIBACCESS    OF "LOCSUP"     TO BYFUNCTION             
120900     CHANGE  ATTRIBUTE FUNCTIONNAME OF "LOCSUP"     TO "LOCSUP"               
121000     CHANGE  ATTRIBUTE TITLE OF "DISP" TO                                     
121100            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK."                   
121200     PERFORM 000100-VERSIONES.                                                
121300                                                                              
121400******************************************************************            
121500*            VALIDACION DE HORARIO DE EJECUCION                  *            
121600*        DEV = 20HRS  | UAT = 18:30HRS  |  PROD= 20HRS           *            
121700******************************************************************            
121800 000100-VALIDA-HORARIO.                                                       
121900     MOVE 0 TO WKS-FIN-PROG                                                   
122000     ACCEPT WKS-HORA-MAQ      FROM TIME                                       
122100     IF WKS-HORMAQ-HM >  WKS-HORA-EXE                                         
122200         MOVE 1 TO WKS-FIN-PROG                                               
122300         STRING "INF:FIN DE PROCESO POR HORARIO DE EJECUCION"                 
122400         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
122500         PERFORM 000100-ARMA-MSG-LOG.                                         
122600                                                                              
122700******************************************************************            
122800*      VALIDACION DE LA RESIDENCIA DEL ARCHIVO DE ENTRADA        *            
122900*WKS-ARC-ON-DISK:                                                *            
123000*  VALOR 1: EXISTE ARCHIVO  | VALOR 0: NO EXISTE ARCHIVO         *            
123100******************************************************************            
123200 000100-VALIDA-ARC-EPP.                                                       
123300     MOVE 1                 TO WKS-ARC-ON-DISK                                
123400     MOVE WKS-NODO          TO WKS-EVCOMIS-CSI,                               
123500                               WKS-EVCOMIS-CSI-P                              
123600     MOVE WKS-FEC-ARC       TO WKS-EVCOMIS-FECHA,                             
123700                               WKS-EVCOMIS-FECHA-P                            
123800     CHANGE ATTRIBUTE TITLE OF S500ARCEPP                                     
123900                            TO WKS-NAME-OF-EVCOMIS                            
124000                                                                              
124100     IF ATTRIBUTE RESIDENT OF S500ARCEPP = VALUE FALSE                        
124200         MOVE 0 TO WKS-ARC-ON-DISK.                                           
124300                                                                              
124400******************************************************************            
124500*            VALIDACION DE LAS FECHAS T-N PARA OPCON             *            
124600*PROYECTA LA FECHA DE PROESO EN T-1, T-2 Y T-3                   *            
124700*LAS FECHAS PROYECTADAS YA SON EN DIAS HABILES                   *            
124800*EN B08 SE VALIDA SI LAS FECHAS PROYECTADAS EN T-N YA FUERON     *            
124900*PROCESADAS.                                                     *            
125000******************************************************************            
125100 000100-PROCESA-FECHA-OPCON.                                                  
125200     MOVE 1 TO WKS-I                                                          
125300     PERFORM 000100-PROYECTA-FEC-OPCON UNTIL WKS-I > 3.                       
125400                                                                              
125500 000100-PROYECTA-FEC-OPCON.                                                   
125600     MOVE 15                     TO WS-S006-FUNCION                           
125700     MOVE WKS-I                  TO WS-S006-FECHA2                            
125800     MOVE 13                     TO WS-S006-FORMATO                           
125900     MOVE WKS-FEC-SAMD           TO WS-S006-FECHA1                            
126000     PERFORM 000000-CALL-CALENDAR                                             
126100     MOVE WS-S006-FECHA1         TO WKS-FECHA-N(WKS-I),                       
126200                                    WKS-FEC-ON-B08                            
126300     MOVE 0 TO WKS-FEC-PROCESDA(WKS-I)                                        
126400     ADD 1                       TO WKS-I.                                    
126500                                                                              
126600 000100-BUSCA-FEC-T-N-ON-B08.                                                 
126700     MOVE 1 TO WKS-B08-EXISTE-REG                                             
126800     FIND FIRST B08PSXFECSISCTESQ OF S500B08PCTRARRIBO  AT                    
126900         B08P-FEC-PROC = WKS-FEC-ON-B08 AND B08P-SIST-CTE= 500                
127000         AND B08P-TIPO = 1 AND B08P-SECUENCIAL = 005 AND                      
127100         B08P-NODO = WKS-NODO AND B08P-PRIORIDAD = 1 AND                      
127200         B08P-ESTATUS = "D"                                                   
127300         ON EXCEPTION                                                         
127400            IF DMSTATUS( NOTFOUND )                                           
127500               MOVE 0 TO WKS-B08-EXISTE-REG.                                  
127600                                                                              
127700******************************************************************            
127800*                 ASIGNACION DEL NODO Y HORARIO                  *            
127900*                       MTY= 04  | VDM=10                        *            
128000*             DEV Y PROD: 20:00 HRS | UAT: 18:30 HRS             *            
128100******************************************************************            
128200 000100-ASIGNA-NODO.                                                          
128300     IF WKS-HOSTNAME = "ACYPBETA." OR WKS-HOSTNAME = "MONBETA.  "             
128400         MOVE 04 TO WKS-NODO                                                  
128500         MOVE 2000 TO WKS-HORA-EXE                                            
128600     ELSE                                                                     
128700     IF WKS-HOSTNAME = "MONALFA.  " OR WKS-HOSTNAME = "VDMKAPPA. "            
128800         MOVE 04 TO WKS-NODO                                                  
128900         MOVE 1830 TO WKS-HORA-EXE                                            
129000     ELSE                                                                     
129100     IF WKS-HOSTNAME = "VDMBETA." OR WKS-HOSTNAME = "VDMALFA."                
129200         MOVE 10 TO WKS-NODO                                                  
129300         MOVE 2000 TO WKS-HORA-EXE                                            
129400     ELSE                                                                     
129500     IF WKS-HOSTNAME = "ACYPGAMA." OR WKS-HOSTNAME = "ACYPOMEGA."             
129600         MOVE 10 TO WKS-NODO                                                  
129700         MOVE 1830 TO WKS-HORA-EXE.                                           
129800                                                                              
129900                                                                              
130000******************************************************************            
130100*               ORDENAIENTO DEL ARCHIVO DE ENTRADA               *            
130200*ORDER:                                                          *            
130300*  TIPO DE REGISTRO|TIPO DE ESQUEMA|PRODUCTO|MONEDA|INSTRUMENTO  *            
130400******************************************************************            
130500 0000-ATTRIBUTES-OF-S500ARCEPP.                                               
130600     MOVE 0  TO WKS-FRAMESIZE                                                 
130700                WKS-LASTRECORD                                                
130800                WKS-MAXRECSIZE                                                
130900                WKS-DISK-SIZE                                                 
131000                WKS-MEMORY-SIZE                                               
131100                WKS-MEMORY-65K                                                
131200                WKS-CALC-WORD                                                 
131300                WKS-CALC-WORD-RED.                                            
131400     COMPUTE WKS-FRAMESIZE =ATTRIBUTE FRAMESIZE  OF S500LISTEPPIN.            
131500     COMPUTE WKS-MAXRECSIZE=ATTRIBUTE MAXRECSIZE OF S500LISTEPPIN.            
131600     COMPUTE WKS-LASTRECORD=ATTRIBUTE LASTRECORD OF S500LISTEPPIN.            
131700     COMPUTE WKS-LASTRECORD = WKS-LASTRECORD + 1.                             
131800     CLOSE S500LISTEPPIN WITH RELEASE.                                        
131900                                                                              
132000 0000-CALCULA-ESPACIO.                                                        
132100     IF WKS-FRAMESIZE = 8                                                     
132200         COMPUTE WKS-CALC-WORD = WKS-MAXRECSIZE / 6                           
132300         IF WKS-WORD-RES > ZEROS                                              
132400                COMPUTE WKS-MAXRECSIZE = WKS-WORD-ENT + 1                     
132500         ELSE                                                                 
132600                COMPUTE WKS-MAXRECSIZE = WKS-WORD-ENT .                       
132700                                                                              
132800     COMPUTE WKS-MEMORY-65K = 66000 * WKS-MAXRECSIZE .                        
132900                                                                              
133000     COMPUTE WKS-MEMORY-SIZE ROUNDED                                          
133100           = (WKS-MAXRECSIZE + 3) * (WKS-LASTRECORD / 16) + 1500 .            
133200                                                                              
133300     IF WKS-MEMORY-SIZE > 258435000                                           
133400         MOVE 258435000    TO WKS-MEMORY-SIZE                                 
133500     ELSE                                                                     
133600     IF WKS-MEMORY-SIZE < 400000                                              
133700         MOVE WKS-MEMORY-65K TO WKS-MEMORY-SIZE .                             
133800                                                                              
133900     COMPUTE WKS-DISK-SIZE ROUNDED                                            
134000           =  (WKS-MAXRECSIZE + 3) * WKS-LASTRECORD * 3.5 .                   
134100                                                                              
134200                                                                              
134300 0000-SORT-ARC-EPP.                                                           
134400     SORT ARCTEM ASCENDING KEY ST-LIST-ESQ,                                   
134500                             ST-L-PROD,                                       
134600                             ST-L-INST,                                       
134700                             ST-L-MON,                                        
134800                             ST-LIST-STATUS,                                  
134900                             ST-LIST-CTO                                      
135000                USING S500LISTEPPIN RELEASE                                   
135100                GIVING S500LISTEPPIN SAVE                                     
135200                MEMORY SIZE IS WKS-MEMORY-SIZE WORDS                          
135300                DISK   SIZE IS WKS-DISK-SIZE   WORDS.                         
135400                                                                              
135500******************************************************************            
135600*             VALIDACION DE LA FECHA DEL CORRESOLO               *            
135700*VALIDA SI ES UN DIA HABIL O NO                                  *            
135800******************************************************************            
135900 000100-VAL-FEC-CORRESOLO.                                                    
136000     MOVE 0 TO WKS-FEC-HABIL                                                  
136100     MOVE 18                        TO WS-S006-FUNCION                        
136200     MOVE 0                         TO WS-S006-FECHA2                         
136300     MOVE 13                        TO WS-S006-FORMATO                        
136400     MOVE WKS-FEC-SAMD              TO WS-S006-FECHA1                         
136500     PERFORM 000000-CALL-CALENDAR                                             
136600     IF WS-S006-FUNCION = 0                                                   
136700         IF WS-S006-FECHA1 = 1                                                
136800               MOVE 1 TO WKS-FEC-HABIL.                                       
136900     IF WKS-FEC-HABIL = 0                                                     
137000         STRING "CORRESOLO: FECHA INHABIL:" WKS-FEC-SAMD                      
137100         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
137200         PERFORM 000100-ARMA-MSG-LOG.                                         
137300                                                                              
137400******************************************************************            
137500*                     LLAMADO LIB. CALENDAR                      *            
137600******************************************************************            
137700 000000-CALL-CALENDAR.                                                        
137800     CALL "THECALENDAR OF LOCSUP" USING WS-S006-FUNCION                       
137900                                        WS-S006-FECHA1                        
138000                                        WS-S006-FECHA2                        
138100                                        WS-S006-FORMATO.                      
138200                                                                              
138300******************************************************************            
138400*                    PROCESO PRINCIPAL: OPCON                    *            
138500*VALIDA HORARIO:                                                 *            
138600*  WKS-FIN-PROG = 1 TERMINA PROGRAMA                             *            
138700*  WKS-FIN-PROG = 0 CONTINUA EJECUCION PROG                      *            
138800*SI LAS FECHAS EN T-N YA FUERON PROCESADAS, EL PROG SE DA DE BAJA*            
138900*VALIDA FECHAS EN T-3 EN B08 SI YA FUERON PROCESDAS              *            
139000*VALIDA ARCHIVO-ENTRDA:                                          *            
139100*   WKS-ARC-ON-DISK = 0 NO EXISTE ARCHIVO                        *            
139200*   WKS-ARC-ON-DISK = 1 EXISTE ARCHIVO                           *            
139300*                                                                *            
139400******************************************************************            
139500 000300-PROCESA-EXC-OPCON.                                                    
139600     PERFORM 000100-INI-VARS-OPCON                                            
139650     PERFORM 000300-VALIDA-FIN-PG                                             
139700     PERFORM 000300-BUSCA-ARCHIVOS UNTIL WKS-ID-ARC = 0                       
139800                                         OR WKS-FIN-PROG = 1                  
140000     IF WKS-FIN-PROG = 0                                                      
140100         WAIT(300).                                                           
140200                                                                              
140300 000300-BUSCA-ARCHIVOS.                                                       
140400     PERFORM 000300-B08-FEC-OPCON                                             
140500     PERFORM 000100-VALIDA-ARC-EPP                                            
140600     IF(WKS-ARC-ON-DISK = 1 AND WKS-FEC-PROCESDA(WKS-ID-ARC) = 0)             
140700         PERFORM 000100-CARGA-TABLAS                                          
140800         PERFORM 000200-ABRE-ARCHIVOS                                         
140900         PERFORM 000300-PROCESA-ARC-EPP                                       
141000         PERFORM 000300-FIN-PROCESO-ARC-EPP.                                  
141100                                                                              
141200     SUBTRACT  1  FROM WKS-ID-ARC.                                            
141300                                                                              
141400 000300-VALIDA-FIN-PG.                                                        
141500     IF(WKS-FEC-PROCESDA(1)=1 AND WKS-FEC-PROCESDA(2)=1 AND                   
141600        WKS-FEC-PROCESDA(3)=1)                                                
141700         STRING "OPCON:FIN CALCULO DE COMISIONES Y REWARDS "                  
141800         "A LAS "WKS-HH":"WKS-MM" EL " WKS-FEC-DD                             
141900         " DE "MES-DESC(WKS-FEC-MM)" DEL 20"WKS-FEC-AA                        
142000         ": "WKS-NAME-OF-EVCOMIS-PROC                                         
142100         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
142200         PERFORM 000100-ARMA-MSG-LOG                                          
142300         MOVE 1 TO WKS-FIN-PROG                                               
142400     ELSE                                                                     
142500         PERFORM 000100-VALIDA-HORARIO.                                       
142600                                                                              
142700 000300-B08-FEC-OPCON.                                                        
142800     MOVE WKS-FECHA-N(WKS-ID-ARC) TO WKS-FEC-ON-B08, WKS-FEC-ARC              
142900     PERFORM 000100-BUSCA-FEC-T-N-ON-B08                                      
143000     MOVE WKS-B08-EXISTE-REG      TO WKS-FEC-PROCESDA(WKS-ID-ARC)             
143100                                                                              
143200     IF WKS-B08-EXISTE-REG = 1 AND WKS-ARCH-LOG(WKS-ID-ARC)=0                 
143300         STRING "OPCON: ARCHIVO CON FECHA:" WKS-FEC-ON-B08                    
143400         " YA FUE PROCESADO" DELIMITED BY SIZE INTO WKS-LOG-MSG               
143500         PERFORM 000100-ARMA-MSG-LOG                                          
143600         MOVE 1 TO WKS-ARCH-LOG(WKS-ID-ARC).                                  
143700                                                                              
143800******************************************************************            
143900*                 PROCESO PRINCIPAL: CORRESOLO                   *            
144000******************************************************************            
144100 000300-PROCESA-EXC-CORRESOLO.                                                
144200     IF WKS-FEC-HABIL = 1                                                     
144300         PERFORM 000100-CARGA-CAT-EPP                                         
144400         PERFORM 000100-INI-VARS-CORRESOLO                                    
144500         PERFORM 000100-VAL-FEC-B08-CORRESOLO                                 
144600         PERFORM 000300-INICIA-CORRESOLO.                                     
144700                                                                              
144800 000300-INICIA-CORRESOLO.                                                     
144900     PERFORM 000100-VALIDA-ARC-EPP                                            
145000     IF WKS-ARC-ON-DISK = 1 AND WKS-B08-EXISTE-REG = 0                        
145100         PERFORM 000100-CARGA-TABLAS                                          
145200         MOVE 1 TO WKS-I                                                      
145300         PERFORM 000200-ABRE-ARCHIVOS                                         
145400         PERFORM 000300-PROCESA-ARC-EPP                                       
145500         PERFORM 000300-FIN-PROCESO-ARC-EPP                                   
145600     ELSE                                                                     
145700     IF WKS-ARC-ON-DISK = 0                                                   
145800         STRING "CORRESOLO: FINALIZA PROCESO."                                
145900         " NO SE ENCONTRO ARCHIVO: " WKS-NAME-OF-EVCOMIS                      
146000         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
146100         PERFORM 000100-ARMA-MSG-LOG.                                         
146200                                                                              
146300 000300-RENOMBRA-ARC-EPP.                                                     
146400     IF ATTRIBUTE OPEN OF S500ARCEPP = VALUE TRUE                             
146500         CHANGE ATTRIBUTE TITLE OF S500ARCEPP                                 
146600                            TO WKS-NAME-OF-EVCOMIS-PROC.                      
146700 000300-FIN-PROCESO-ARC-EPP.                                                  
146800     IF WKS-EXC-ON-OPCON                                                      
147000         MOVE 0 TO WKS-ARC-ON-DISK, WKS-EOF.                                  
147100     PERFORM 000300-RENOMBRA-ARC-EPP                                          
147200     PERFORM 0003000-CLOSE-ARC                                                
147300     PERFORM 0000300-PROCESA-LIST-EPP                                         
147400     PERFORM 000300-AVISA-FIN-PROCESO                                         
147500     PERFORM 000100-ARMA-MSG-LOG                                              
147600     PERFORM 000300-VALIDA-ENVIO-RESP.                                        
147700                                                                              
147800 000300-AVISA-FIN-PROCESO.                                                    
147900     IF WKS-EXC-ON-OPCON                                                      
148000         STRING "FINALIZA PROCESO PARA EL ARCHIVO: "                          
148100         WKS-NAME-OF-EVCOMIS" A LAS "WKS-HH":"WKS-MM                          
148200         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
148300     ELSE                                                                     
148400         STRING "CORRESOLO:FIN CALCULO DE COMISIONES Y REWARDS "              
148500         "A LAS "WKS-HH":"WKS-MM" EL " WKS-FEC-MAQ-DD                         
148600         " DE "MES-DESC(WKS-FEC-MAQ-MM)" DEL 20"WKS-FEC-MAQ-AA                
148700         ": "WKS-NAME-OF-EVCOMIS-PROC                                         
148800         DELIMITED BY SIZE INTO WKS-LOG-MSG.                                  
148900******************************************************************            
149000*             ENVIO DEL ARCHIVO DE RESPUESTA: RCOMIS             *            
149100* SE REALIZAN DOS INTENTO DE ENVIO                               *            
149200******************************************************************            
149300 000300-VALIDA-ENVIO-RESP.                                                    
149400     MOVE SPACES TO WKS-LOG-MSG                                               
149500     PERFORM 000300-ENVIA-ARC-INTE UNTIL WKS-INTENTO-INTE>2                   
149600                                         OR  WKS-ARC-ENVIADO=1                
149700     IF WKS-ARC-ENVIADO = 0                                                   
149800         STRING "ERROR: ARCHIVO "WKS-NAME-OF-RCOMIS                           
149900         " NO ENVIADO,REALIZAR ENVIO MANUAL: "WKS-REPS-INTE                   
150000         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
150100                                                                              
150200     ELSE                                                                     
150300         STRING "SE ENVIO: "WKS-NAME-OF-RCOMIS                                
150400         DELIMITED BY SIZE INTO WKS-LOG-MSG.                                  
150500     PERFORM 000100-ARMA-MSG-LOG.                                             
150600                                                                              
150700******************************************************************            
150800*                    CARGA TABLAS                                *            
150900******************************************************************            
151000 000100-CARGA-TABLAS.                                                         
151100     PERFORM 000300-INI-TABLAS                                                
151200     MOVE 1 TO WKS-I.                                                         
151300     MOVE 1 TO  WKS-J.                                                        
151400     MOVE 0 TO WKS-EOBD.                                                      
151500     SET S500B13PREGCOMEPP      TO BEGINNING.                                 
151600     PERFORM 000100-CARGA-TAB01 UNTIL WKS-EOBD = 10                           
151700     MOVE 0  TO WKS-EOBD.                                                     
151800     MOVE 1  TO WKS-I,  WKS-J.                                                
151900     SET S500B14PREGREWEPP         TO BEGINNING                               
152000     PERFORM 000100-CARGA-TAB02 UNTIL WKS-EOBD = 10                           
152100     PERFORM 000100-CARGA-TAB-PRELACION VARYING WKS-I FROM 1 BY 1             
152200                                  UNTIL WKS-I > WKS-REGS-B13.                 
152300     PERFORM 000100-ORG-TAB-PRELACION VARYING WKS-I FROM 1 BY 1               
152400                                  UNTIL WKS-I > WKS-REGS-B13.                 
152500                                                                              
152600 000100-CARGA-TAB-PRELACION.                                                  
152700     MOVE T1-B13PRODUCTO(WKS-I) TO WKS-PRE-PIM(WKS-I)                         
152800     PERFORM 000100-PRELACION-X-NUM-REG VARYING  WKS-J FROM 1 BY 1            
152900                         UNTIL WKS-J > T1-B13-TOTAL-REGLAS(WKS-I).            
153000                                                                              
153100 000100-PRELACION-X-NUM-REG.                                                  
153200    MOVE T1-B13P-NUM-REGLA(WKS-I, WKS-J)       TO WKS-B13-NUM-REG             
153300    MOVE T1-B13P-PRELACION-REGLA(WKS-I, WKS-J) TO WKS-B13-PRE                 
153400    MOVE WKS-B13-NUM-REG TO WKS-PRE-NUM-REGLA(WKS-I, WKS-B13-PRE).            
153500                                                                              
153600                                                                              
153700 000100-ORG-TAB-PRELACION.                                                    
153800     MOVE 1 TO WKS-J-PRE                                                      
153900     PERFORM 000100-ORG-PRELACION VARYING  WKS-J FROM 1 BY 1                  
154000                         UNTIL  WKS-J > 99.                                   
154100 000100-ORG-PRELACION.                                                        
154200     IF WKS-PRE-NUM-REGLA(WKS-I, WKS-J) > 0                                   
154300         MOVE WKS-PRE-NUM-REGLA(WKS-I, WKS-J) TO WKS-B13-NUM-REG              
154400         MOVE 0 TO WKS-PRE-NUM-REGLA(WKS-I, WKS-J)                            
154500         MOVE WKS-B13-NUM-REG TO                                              
154600                                WKS-PRE-NUM-REGLA(WKS-I,WKS-J-PRE)            
154700                                                                              
154800         ADD 1                               TO WKS-J-PRE.                    
154900                                                                              
155000******************************************************************            
155100*             CARGA DATOS - TABLA REGLAS COMISIONES              *            
155200******************************************************************            
155300 000100-CARGA-TAB01.                                                          
155400     PERFORM 000100-LEE-B13PREGCOMEPP                                         
155500     IF WKS-EOBD = 0                                                          
155600         MOVE B13P-PRODUCTO          TO T1-B13P-PRODUCTO(WKS-I)               
155700         MOVE B13P-INTRUMENTO        TO T1-B13P-INSTRUMENTO(WKS-I)            
155800         MOVE B13P-MONEDA            TO T1-B13P-MONEDA(WKS-I)                 
155900         MOVE B13P-TIPO-COMI         TO T1-B13P-TIPO-COMI(WKS-I)              
156000         MOVE B13P-DIAS-PERIO-GRACIA TO                                       
156100                                  T1-B13P-DIAS-PERIO-GRACIA(WKS-I)            
156200         MOVE B13P-IMP-COMISION      TO                                       
156300                                  T1-B13P-IMP-COMISION(WKS-I)                 
156400         MOVE B13P-STATUS            TO T1-B13P-STATUS(WKS-I)                 
156500         PERFORM 000100-LLENA-REG-COMI-DESC                                   
156600         UNTIL  WKS-J > 30 OR ( B13P-NUM-REGLA(WKS-J)  = ZEROS OR             
156700               B13P-TIPO-EXCEP(WKS-J) = ZEROS )                               
156800         MOVE 1 TO WKS-J                                                      
156900         ADD  1 TO WKS-I                                                      
157000         ADD  1 TO WKS-REGS-B13.                                              
157100                                                                              
157200 000100-LEE-B13PREGCOMEPP.                                                    
157300     FIND NEXT S500B13PREGCOMEPP                                              
157400        ON EXCEPTION                                                          
157500           IF DMSTATUS(NOTFOUND)                                              
157600              MOVE 10 TO WKS-EOBD.                                            
157700                                                                              
157800 000100-LLENA-REG-COMI-DESC.                                                  
157900     MOVE B13P-NUM-REGLA(WKS-J) TO T1-B13P-NUM-REGLA(WKS-I,WKS-J)             
158000                                                                              
158100     MOVE B13P-TIPO-EXCEP(WKS-J)                                              
158200     TO   T1-B13P-TIPO-EXCEP(WKS-I,  WKS-J)                                   
158300                                                                              
158400     MOVE B13P-FECHA-INI(WKS-J)                                               
158500     TO   T1-B13P-FECHA-INI(WKS-I, WKS-J)                                     
158600                                                                              
158700     MOVE B13P-FECHA-FIN(WKS-J)                                               
158800     TO   T1-B13P-FECHA-FIN(WKS-I,  WKS-J)                                    
158900                                                                              
159000     MOVE B13P-CASQ-BALANCE(WKS-J)                                            
159100     TO   T1-B13P-CASQ-BALANCE(WKS-I,  WKS-J)                                 
159200                                                                              
159300     MOVE B13P-IND-IMP-PORC(WKS-J)                                            
159400     TO   T1-B13P-IND-IMP-PORC(WKS-I,  WKS-J)                                 
159500                                                                              
159600     MOVE B13P-IMP-PORCNTJE-WAIVER(WKS-J)                                     
159700     TO   T1-B13P-IMP-WAIVER(WKS-I,  WKS-J)                                   
159800                                                                              
159900     MOVE B13P-NUM-RETIRO-ATM-MIN(WKS-J)                                      
160000     TO   T1-B13P-NUM-RET-ATM-MIN(WKS-I,  WKS-J)                              
160100                                                                              
160200     MOVE B13P-NUM-RETIRO-ATM-MAX(WKS-J)                                      
160300     TO   T1-B13P-NUM-RET-ATM-MAX(WKS-I,  WKS-J)                              
160400                                                                              
160500     MOVE B13P-NUM-MOVS-CANAL-DIG(WKS-J)                                      
160600     TO   T1-B13P-NUM-MOVS-CAN-DIG(WKS-I,  WKS-J)                             
160700                                                                              
160800     MOVE B13P-STATUS-REGLA(WKS-J)                                            
160900     TO   T1-B13P-STATUS-REGLA(WKS-I,  WKS-J)                                 
161000                                                                              
161100     MOVE B13P-PRELACION-REGLA(WKS-J)                                         
161200     TO   T1-B13P-PRELACION-REGLA(WKS-I,  WKS-J)                              
161300                                                                              
161400     ADD 1 TO  WKS-J                                                          
161500     ADD 1 TO T1-B13-TOTAL-REGLAS(WKS-I).                                     
161600                                                                              
161700******************************************************************            
161800*               CARGA DATOS - TABLA REGLAS REWARDS               *            
161900******************************************************************            
162000 000100-CARGA-TAB02.                                                          
162100     PERFORM 000100-LEE-B14PREGREWEPP                                         
162200     IF (WKS-EOBD = 0)                                                        
162300         MOVE B14P-PRODUCTO    TO T2-B14P-PRODUCTO(WKS-I)                     
162400         MOVE B14P-INSTRUMENTO TO T2-B14P-INTRUMENTO(WKS-I)                   
162500         MOVE B14P-MONEDA      TO T2-B14P-MONEDA(WKS-I)                       
162600         MOVE B14P-STATUS      TO T2-B14P-STATUS(WKS-I)                       
162700         PERFORM 000100-LLENA-REG-REW-DESC                                    
162800         UNTIL  WKS-J > 30 OR B14P-NUM-REWARD( WKS-J)  = ZEROS                
162900         MOVE 1 TO  WKS-J                                                     
163000         ADD  1 TO WKS-REGS-B14                                               
163100         ADD  1 TO WKS-I.                                                     
163200                                                                              
163300 000100-LLENA-REG-REW-DESC.                                                   
163400     MOVE B14P-NUM-REWARD(WKS-J)                                              
163500     TO   T2-B14P-NUM-REWARD(WKS-I,  WKS-J)                                   
163600                                                                              
163700     MOVE B14P-TIPO-REWARD(WKS-J)                                             
163800     TO   T2-B14P-TIPO-REWARD(WKS-I,  WKS-J)                                  
163900                                                                              
164000     MOVE B14P-IND-IMP-PORC(WKS-J)                                            
164100     TO   T2-B14P-IND-IMP-PORC(WKS-I,  WKS-J)                                 
164200                                                                              
164300     MOVE B14P-IMP-WAIVER(WKS-J)                                              
164400     TO   T2-B14P-IMP-WAIVER(WKS-I,  WKS-J)                                   
164500                                                                              
164600     MOVE B14P-TIPO-CANAL(WKS-J)                                              
164700     TO   T2-B14P-TIPO-CANAL(WKS-I,  WKS-J)                                   
164800                                                                              
164900     MOVE B14P-MOVS-CANAL-DIG(WKS-J)                                          
165000     TO   T2-B14P-MOVS-CANAL-DIG (WKS-I,  WKS-J)                              
165100                                                                              
165200     MOVE B14P-STATUS-REWARD(WKS-J)                                           
165300     TO   T2-B14P-STATUS-REWARD(WKS-I,  WKS-J)                                
165400     ADD 1 TO  WKS-J                                                          
165500     ADD 1 TO T2-B14-TOTAL-REGLAS(WKS-I).                                     
165600                                                                              
165700******************************************************************            
165800*              PROCESO PARA EL LLENADO DEL CATALOGO              *            
165900******************************************************************            
166000 000100-VERSIONES.                                                            
166100     MOVE ZEROS              TO S000-CTR-CVEERROR.                            
166200     MOVE "S080BD01CON"      TO S000-CTR-LIBID.                   032200      
166300     CHANGE ATTRIBUTE LIBACCESS OF "CTLVERS" TO BYFUNCTION.                   
166400     CHANGE ATTRIBUTE FUNCTIONNAME OF "CTLVERS" TO "CTLVERS"                  
166500                                                                              
166600     CALL "DAME_TIT IN CTLVERS"                                               
166700           USING      S000-CTR-LIBID                              121900      
166800                      S000-CTR-NOMLIB                             121950      
166900           GIVING     S000-CTR-CVEERROR.                          122000      
167000     IF S000-CTR-CVEERROR = 0                                                 
167100          CHANGE ATTRIBUTE TITLE OF "S080BD01CON"                 032450      
167200                     TO S000-CTR-NOMLIB                           032500      
167300     ELSE                                                         032550      
167400         MOVE S000-CTR-CVEERROR TO WS-MSG-N-02                                
167500         STRING "ERROR EN CALL CTLVER S080BD01CON: " WS-MSG-N-02              
167600         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
167700         PERFORM 000100-ARMA-MSG-LOG                                          
167800         CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                             
167900                                                                              
168000 000100-CARGA-CAT-EPP.                                                        
168100     MOVE 500        TO W77-L710-SISTEMA.                                     
168200     MOVE 0          TO W77-L710-RESULT.                                      
168300     MOVE 1832       TO WKS-L710-CATALOGO-E.                                  
168400     MOVE 20         TO WKS-L710-CLAVE-E.                                     
168500     MOVE 1          TO WKS-L710-ORDBUSQ-E.                                   
168600     MOVE 0          TO WKS-L710-FINI-CON-E.                                  
168700     MOVE 10         TO WKS-L710-REGS-E.                                      
168800     MOVE 00         TO WKS-EOCAT.                                            
168900     MOVE 1          TO WKS-J, WKS-I                                          
169000     MOVE LOW-VALUES TO WKS-S08CATEPP,                                        
169100                        WKS-S08CATEPP-AUX.                                    
169200                                                                              
169300     PERFORM 000100-BUSCA-PROD UNTIL WKS-EOCAT = 01                           
169400     MOVE 1 TO  WKS-J, WKS-I                                                  
169500     PERFORM 000100-PROCESA-CAT UNTIL                                         
169600                                 WKS-CATEPP-ID-CAT-AUX(WKS-J) = 0.            
169700     MOVE 1 TO  WKS-J, WKS-I.                                                 
169800                                                                              
169900 000100-BUSCA-PROD.                                                           
170000    PERFORM 000100-CALL-CATEPP-S080.                                          
170100    IF W77-L710-RESULT = 0 OR 1                                               
170200         PERFORM 000100-CARGA-CAT VARYING WKS-I FROM 1 BY 1                   
170300                                  UNTIL WKS-I > WKS-L710-REGS-E               
170400         PERFORM 000100-INI-VAL-CAT-EPP                                       
170500                                                                              
170600         IF W77-L710-RESULT = 0                                               
170700            MOVE 1 TO WKS-EOCAT                                               
170800         ELSE                                                                 
170900            NEXT SENTENCE                                                     
171000    ELSE                                                                      
171100       MOVE 1 TO WKS-EOCAT.                                                   
171200                                                                              
171300 000100-CALL-CATEPP-S080.                                                     
171400      CALL "L710_CONSUL_DETALLE IN S080BD01CON"                               
171500          USING           W77-L710-SISTEMA                        114450      
171600                          W77-L710-PROGRAMA                       114500      
171700                          WKS-L710-PARAM-ENT                      114550      
171800                          WKS-L710-PARAM-SAL                      114600      
171900          GIVING          W77-L710-RESULT.                        114650      
172000                                                                              
172100 000100-INI-VAL-CAT-EPP.                                                      
172200     IF WKS-L710-DATOS(WKS-L710-REGS-S, 1) = 01 OR 02 OR 03                   
172300         MOVE WKS-L710-FINI-CON-S  TO WKS-L710-FINI-CON-E                     
172400         MOVE WKS-L710-NIVEL-S     TO WKS-L710-NIVEL-E                        
172500         MOVE WKS-L710-FVIG-S(WKS-L710-REGS-S)                                
172600         TO WKS-L710-FVIG-E                                                   
172700         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 1)                              
172800         TO WKS-L710-LLAVE1-E                                                 
172900         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 2)                              
173000         TO WKS-L710-LLAVE2-E                                                 
173100         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 3)                              
173200         TO WKS-L710-LLAVE3-E                                                 
173300         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 4)                              
173400         TO WKS-L710-LLAVE4-E                                                 
173500         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 5)                              
173600         TO WKS-L710-LLAVE5-E                                                 
173700         MOVE WKS-L710-DATOS(WKS-L710-REGS-S, 6)                              
173800         TO WKS-L710-LLAVE6-E                                                 
173900     ELSE                                                                     
174000         MOVE 1 TO WKS-EOCAT.                                                 
174100                                                                              
174200                                                                              
174300 000100-CARGA-CAT.                                                            
174400     IF WKS-L710-DATOS(WKS-I, 01) = 01 OR 02 OR 03                            
174500         MOVE WKS-L710-DATOS(WKS-I, 01) TO                                    
174600                                   WKS-CATEPP-ID-CAT-AUX(WKS-J)               
174700         MOVE WKS-L710-DATOS(WKS-I, 02) TO                                    
174800                                   WKS-CATEPP-PROD-AUX(WKS-J)                 
174900         MOVE WKS-L710-DATOS(WKS-I, 03) TO                                    
175000                                   WKS-CATEPP-INST-AUX(WKS-J)                 
175100         MOVE WKS-L710-DATOS(WKS-I, 04) TO                                    
175200                                   WKS-CATEPP-MON-AUX(WKS-J)                  
175300         MOVE WKS-L710-DATOS(WKS-I, 05) TO                                    
175400                                   WKS-CATEPP-EVA-AUX(WKS-J)                  
175500         MOVE WKS-L710-DATOS(WKS-I, 06) TO                                    
175600                                   WKS-CATEPP-COT-CAT-AUX(WKS-J)              
175700         MOVE WKS-L710-DATOS(WKS-I, 07) TO                                    
175800                                   WKS-CATEPP-IND-COMI-AUX(WKS-J)             
175900         MOVE WKS-L710-DATOS(WKS-I, 08) TO                                    
176000                                   WKS-CATEPP-CAN-POR-AUX(WKS-J)              
176100         MOVE WKS-L710-DATOS(WKS-I, 9) TO                                     
176200                                   WKS-CATEPP-TIP-CANAL-AUX(WKS-J)            
176300         MOVE WKS-L710-DATOS(WKS-I, 10) TO                                    
176400                                   WKS-CATEPP-NUM-MOVS-AUX(WKS-J)             
176500         MOVE WKS-L710-DATOS(WKS-I, 11) TO                                    
176600                                   WKS-CATEPP-IMP-MIN-AUX(WKS-J)              
176700         PERFORM 0001000-GRABA-CAT-LOG                                        
176800         ADD 1 TO  WKS-J.                                                     
176900                                                                              
177000 0001000-GRABA-CAT-LOG.                                                       
177100     STRING "#["WKS-J"]==> ID-CAT["WKS-CATEPP-ID-CAT-AUX(WKS-J)               
177200     "] PROD["WKS-CATEPP-PROD-AUX(WKS-J)"] INST["                             
177300     WKS-CATEPP-INST-AUX(WKS-J)"] MON["WKS-CATEPP-MON-AUX(WKS-J)              
177400     "] EVA["WKS-CATEPP-EVA-AUX(WKS-J)"] COD-CAT["                            
177500     WKS-CATEPP-COT-CAT-AUX(WKS-J)"] IND-COMI["                               
177600     WKS-CATEPP-IND-COMI-AUX(WKS-J)"] CAN-POR["                               
177700     WKS-CATEPP-CAN-POR-AUX(WKS-J)"] CAN["                                    
177800     WKS-CATEPP-TIP-CANAL-AUX(WKS-J)"] MOVS["                                 
177900     WKS-CATEPP-NUM-MOVS-AUX(WKS-J)"] IMP["                                   
178000     WKS-CATEPP-IMP-MIN-AUX(WKS-J)"]"                                         
178100     DELIMITED BY SIZE INTO WKS-LOG-MSG2                                      
178200     MOVE "E"         TO  TIPO-LJ                                             
178300     MOVE "050115"    TO  CODIGO-LJ                                           
178400     MOVE WKS-LOG-MSG2 TO TEXTO-LJ                                            
178500     PERFORM 000400-CALL-LJ.                                                  
178600                                                                              
178700 000100-PROCESA-CAT.                                                          
178800     IF WKS-CATEPP-EVA-AUX(WKS-J) = 04                                        
178900         MOVE WKS-TAB-CATEPP-AUX( WKS-J) TO WKS-TAB-CATEPP(WKS-I)             
179000         MOVE 1 TO WKS-CATEPP-EVA(WKS-I)                                      
179100         ADD  1 TO WKS-I                                                      
179200         MOVE WKS-TAB-CATEPP-AUX(WKS-J)  TO                                   
179300                                         WKS-TAB-CATEPP(WKS-I)                
179400         MOVE 2 TO WKS-CATEPP-EVA(WKS-I)                                      
179500         ADD  1 TO WKS-I                                                      
179600     ELSE                                                                     
179700         MOVE WKS-TAB-CATEPP-AUX(WKS-J)  TO WKS-TAB-CATEPP(WKS-I)             
179800         ADD 1 TO WKS-I.                                                      
179900     ADD 1 TO  WKS-J.                                                         
180000                                                                              
180100 000100-LEE-B14PREGREWEPP.                                                    
180200     FIND NEXT S500B14PREGREWEPP                                              
180300         ON EXCEPTION                                                         
180400             IF DMSTATUS( NOTFOUND )                                          
180500                 MOVE 10 TO WKS-EOBD.                                         
180600******************************************************************            
180700*                        APERTURA ARCHIVOS                       *            
180800******************************************************************            
180900 000200-ABRE-ARCHIVOS.                                                        
181000                                                                              
181100     MOVE WKS-NODO     TO WKS-POSTING-CSI,                                    
181200                          WKS-RCOMIS-CSI ,                                    
181300                          WKS-ARCCOMISREW-CSI                                 
181400     MOVE WKS-FEC-ARC  TO WKS-POSTING-FECHA,                                  
181500                          WKS-RCOMIS-FECHA ,                                  
181600                          WKS-ARCCOMISREW-FECHA                               
181700                                                                              
181800*    ARCHIVO-POSTEO                                                           
181900     CHANGE ATTRIBUTE TITLE OF S500ARCPOST                                    
182000     TO WKS-NAME-OF-ARC-POSTING                                               
182100                                                                              
182200*    ARCHIVO-RESPUESTA                                                        
182300     CHANGE ATTRIBUTE TITLE OF S500ARCEPPR                                    
182400     TO WKS-NAME-OF-RCOMIS                                                    
182500*    ARCHIVO D EENTRADA PARA LISTADO                                          
182600     CHANGE ATTRIBUTE TITLE OF S500LISTEPPIN                                  
182700     TO WKS-NAME-OF-ARCCOMISREW                                               
182800                                                                              
182900                                                                              
183000     OPEN OUTPUT S500ARCPOST.                                                 
183100     OPEN OUTPUT S500LISTEPPIN.                                               
183200     OPEN OUTPUT S500ARCEPPR.                                                 
183300     OPEN INPUT  S500ARCEPP.                                                  
183400                                                                              
183500******************************************************************            
183600*               APERTURA DE BD:S500BD04TARJETAS                  *            
183700******************************************************************            
183800 000200-ABRE-S500BD04TARJETAS.                                                
183900     MOVE SPACES TO WKS-LOG-MSG, WKS-BD                                       
184000     OPEN  INQUIRY S500BD04TARJETAS                                           
184100     ON EXCEPTION                                                             
184200         MOVE "S500BD04TARJETAS" TO WKS-BD                                    
184300         PERFORM 000400-VALIDA-ERROR.                                         
184400                                                                              
184500******************************************************************            
184600*                CIERRA DE BD:S500BD04TARJETAS                   *            
184700******************************************************************            
184800 000200-CIERRA-S500BD04TARJETAS.                                              
184900     MOVE SPACES TO WKS-LOG-MSG, WKS-BD                                       
185000     CLOSE S500BD04TARJETAS                                                   
185100     ON EXCEPTION                                                             
185200         MOVE "S500BD04TARJETAS" TO WKS-BD                                    
185300         PERFORM 000400-VALIDA-ERROR.                                         
185400                                                                              
185500******************************************************************            
185600*                 PROCESO - ARCHIVO EPP                          *            
185700******************************************************************            
185800 000300-PROCESA-ARC-EPP.                                                      
185900     MOVE 0 TO WKS-EOF, WKS-CONT-DET-RCOMIS, WKS-CONT-PAG,                    
186000               WKS-TOT-ABO, WKS-NUN-ABO, WKS-NUM-NCO,                         
186100               WKS-TOT-ABO, WKS-NUM-CAR, WKS-TOT-CAR,                         
186150               WKS-CONT-DET                                                   
186200     PERFORM 000300-ARMA-HEADER-POSTE                                         
186300     PERFORM 000300-ARMA-HDR-RCOMIS                                           
186400     PERFORM 000300-LEE-ARC-TRANSACCIONES                                     
186500                                                                              
186600     PERFORM 000300-PROC-COMI-REW UNTIL WKS-EOF = 1 OR                        
186700                                        WKS-FIN-PROG = 1.                     
186800     PERFORM 000300-ARMA-TRL-RCOMIS                                           
186900     PERFORM 000300-ARMA-TRAILER-POSTE.                                       
187000                                                                              
187100******************************************************************            
187200*        INICIO PROCESO -  CALCULO DE COMI Y REWARDS             *            
187300******************************************************************            
187400 000300-PROC-COMI-REW.                                                        
187500     IF (WKS-EPP-TIP-REG = 2)                                                 
187600         PERFORM 000300-INI-VARS                                              
187700         PERFORM 000300-VALIDA-ESQUEMA.                                       
187800     PERFORM 000300-LEE-ARC-TRANSACCIONES.                                    
187900                                                                              
188000******************************************************************            
188100*                    VALIDACION DE ESQUEMAS:                     *            
188200*      1.RENTA 2.SALDO 5. REWARD Y RENTA 6. REWARD Y SALDO       *            
188300******************************************************************            
188400 000300-VALIDA-ESQUEMA.                                                       
188500     IF WKS-ESQ-BY-REN OR WKS-ESQ-BY-SDO                                      
188950        PERFORM 000300-PROCESO-COMISIONES                                     
189300     ELSE                                                                     
189320     IF WKS-ESQ-MIX-SDO OR WKS-ESQ-MIX-REN                                    
189340        PERFORM 000300-PROCESO-COMISIONES                                     
189360        PERFORM 000300-BUSCA-REGLA-REWARD                                     
189380     ELSE                                                                     
189400        MOVE SPACES          TO WKS-EPP-COMI-MOTIVO                           
189500        STRING "ERROR: ESQUEMA INVALIDO["WKS-EPP-DET-TIP-EVA"]"               
189600        DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                            
189700        MOVE 1  TO WKS-EPP-STATUS-REG                                         
189800        MOVE 08 TO WKS-EPP-TIP-EXC                                            
189900        MOVE 02 TO WKS-IND-TOT                                                
190000        PERFORM 000300-ARMA-DET-RCOMIS                                        
190100        PERFORM 000300-ARMA-DET-COMI-ARCLIST.                                 
190110                                                                              
190120 000300-PROCESO-COMISIONES.                                                   
190130     PERFORM 000300-CALCULO-COMISION                                          
190140     PERFORM 000300-ARMA-DET-RCOMIS                                           
190150     PERFORM 000300-ARMA-DET-COMI-ARCLIST                                     
190160     PERFORM 000300-GENERA-DET-POSTE.                                         
190200                                                                              
190300******************************************************************            
190400*          BUSCA REGLA DE COMISION EN TAB01-REG-COMI             *            
190500* 1.SI EL PROD NO EXISTE EN B13: GENERA MENSAJE DE ERROR         *            
190600* 2.SI EL PROD ESTA INACTIVO (STATUS 0): GENERA MENSAJE  DE ERROR*            
190700* 3.SI SE CUMPLE CON EL PERIODO  DE  GRACIA:  GENERA  MENSAJE  DE*            
190800*   EXENCION, NO SE COBRA COMISION                               *            
190900* 4.SI SE CUMPLE CON LA EXCEPCION MANUAL (COD: 101|202):         *            
191000*   GENERA MENSAJE DE EXENCION, NO SE COBRA COMISION             *            
191100* 5.SI NINGUN PUNTO ANT. SE CUMPLE, SE VALIDAN LAS REGS DE COMI  *            
191200******************************************************************            
191300 000300-CALCULO-COMISION.                                                     
191400     PERFORM 000300-BUSCA-PROD-ON-TAB1                                        
191500     MOVE 0                     TO WKS-CUMPLE-REGLA,                          
191600                                   WKS-EPP-STATUS-REG,                        
191700                                   WKS-NUM-REGLA                              
191750     MOVE SPACES                TO WKS-EPP-COMI-MOTIVO                        
191800     PERFORM 000300-VAL-PROD-STAT-B13                                         
191900     IF WKS-CUMPLE-REGLA = 0                                                  
192000         PERFORM 000300-VAL-PER-GRACIA                                        
192100         IF WKS-CUMPLE-REGLA = 0                                              
192200             PERFORM 000300-VAL-EXC-MANUAL                                    
192300             IF WKS-CUMPLE-REGLA = 0                                          
192400                 PERFORM 000300-VAL-REGLA-B13                                 
192500                     IF WKS-CUMPLE-REGLA = 0                                  
192600                         PERFORM 000300-VAL-NA-REGLA.                         
192700                                                                              
192800 000300-VAL-PROD-STAT-B13.                                                    
192900     IF WKS-PROD-FOUND = 00                                                   
193000         STRING "ERR:PROD[" WKS-PRODUCTO "]NOREG.S500B13PREGCOM"              
193100         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
193200         MOVE 1  TO WKS-EPP-STATUS-REG                                        
193300         MOVE 09 TO WKS-EPP-TIP-EXC                                           
193400         MOVE 02 TO WKS-IND-TOT                                               
193500         MOVE 1  TO WKS-CUMPLE-REGLA                                          
193600     ELSE IF WKS-B13P-STATUS = 2                                              
193700         STRING "ERROR:PROD[" WKS-PRODUCTO "]INACT.S500B13PREGCOM"            
193800         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
193900         MOVE 1  TO WKS-EPP-STATUS-REG                                        
194000         MOVE 10 TO WKS-EPP-TIP-EXC                                           
194100         MOVE 02 TO WKS-IND-TOT                                               
194200         MOVE 1  TO WKS-CUMPLE-REGLA.                                         
194300                                                                              
194400 000300-VAL-PER-GRACIA.                                                       
194500     MOVE WKS-B13P-DIAS-PERIO-GRACIA TO WKS-EPP-DG-COMI                       
194600     MOVE WKS-B13P-IMP-COMISION      TO WKS-PROD-IMPORTE                      
194700     IF WKS-EPP-DET-FEC-CORTE-ANT = 00010101                                  
194800*        FECHA DE ULTIMO CORTE - FECHA DE PROCESO(ARCHIVO)                    
194900*         MOVE WKS-EPP-DET-FEC-ULT-CORTE TO WKS-DG-FECHA1                     
194920*SE CONSIDERA FECHA DE APERTURA EN LUGAR DE FECHA DE ULTIMO CORTE             
194940         MOVE WKS-EPP-DET-FEC-APER      TO WKS-DG-FECHA1                      
195000         MOVE WKS-FEC-ARC               TO WKS-DG-FECHA2                      
195100     ELSE                                                                     
195200*        FECHA DE CORTE ANTERIOR  - FECHA DE ULTIMO CORTE                     
195300         MOVE WKS-EPP-DET-FEC-CORTE-ANT TO WKS-DG-FECHA1                      
195400         MOVE WKS-EPP-DET-FEC-ULT-CORTE TO WKS-DG-FECHA2.                     
195500     PERFORM 000300-OBTIENE-DIAS-GRACIA                                       
195600     PERFORM 000300-COMPARA-DIAS-GRACIA.                                      
195700                                                                              
195800 000300-OBTIENE-DIAS-GRACIA.                                                  
195900     MOVE 02            TO WS-S006-FUNCION                                    
196000     MOVE WKS-DG-FECHA1 TO WS-S006-FECHA1                                     
196100     MOVE WKS-DG-FECHA2 TO WS-S006-FECHA2                                     
196200     MOVE 13            TO WS-S006-FORMATO                                    
196300     PERFORM 000000-CALL-CALENDAR.                                            
196400                                                                              
196500 000300-COMPARA-DIAS-GRACIA.                                                  
196600     IF (WS-S006-FECHA1 < WKS-EPP-DG-COMI) OR                                 
196700     (WS-S006-FECHA1 = WKS-EPP-DG-COMI)                                       
196800         STRING "EX %100.00  PERIODO DE GRACIA"                               
196900         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
197000         MOVE 0                TO WKS-COMI                                    
197100         MOVE WKS-PROD-IMPORTE TO WKS-IMP-EXC,WKS-IMP-TXN                     
197200         MOVE 11               TO WKS-EPP-TIP-EXC                             
197300         MOVE 03               TO WKS-IND-TOT                                 
197400         MOVE 1                TO WKS-CUMPLE-REGLA.                           
197500                                                                              
197600 000300-VAL-EXC-MANUAL.                                                       
197700*     IF(WKS-EPP-DET-COD-EXC-MANUAL = 0101) OR                                
197800*     (WKS-EPP-DET-COD-EXC-MANUAL = 0202)                                     
197850     IF WKS-EPP-DET-COD-EXC-MANUAL > 0                                        
197900         STRING "EX %100.00  EXCEPCION MANUAL["                               
198000         WKS-EPP-DET-COD-EXC-MANUAL "]" DELIMITED BY SIZE INTO                
198100         WKS-EPP-COMI-MOTIVO                                                  
198200         MOVE 0                TO WKS-COMI                                    
198300         MOVE WKS-PROD-IMPORTE TO WKS-IMP-EXC, WKS-IMP-TXN                    
198400         MOVE 12               TO WKS-EPP-TIP-EXC                             
198500         MOVE 04               TO WKS-IND-TOT                                 
198600         MOVE 1                TO WKS-CUMPLE-REGLA.                           
198700                                                                              
198800                                                                              
198900 000300-VAL-REGLA-B13.                                                        
199000     MOVE 1 TO WKS-J-PRE                                                      
199100     PERFORM 000300-BUSCA-REGLA-ON-TAB1                                       
199200             VARYING WKS-J-PRE FROM 1 BY 1                                    
199300             UNTIL (WKS-CUMPLE-REGLA=1) OR                                    
199400             WKS-PRE-NUM-REGLA(WKS-I-PRE,WKS-J-PRE)=0 OR                      
199500             WKS-J-PRE > 99.                                                  
199600                                                                              
199700 000300-VAL-NA-REGLA.                                                         
199800     MOVE WKS-B13P-IMP-COMISION TO WKS-COMI, WKS-IMP-TXN,                     
199900                                   WKS-COMI-FORMAT                            
200000     MOVE 0                     TO WKS-B13P-WAIVER,                           
200100                                   WKS-REP-WAIVER, WKS-NUM-REGLA              
200200     MOVE 13                    TO WKS-EPP-TIP-EXC                            
200300     MOVE 12                    TO WKS-IND-TOT                                
200400     MOVE 1                     TO WKS-CUMPLE-REGLA                           
200500     STRING "COM "WKS-COMI-FORMAT" NO CUMPLE CON REGLA"                       
200600     DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                              
200700                                                                              
200800 000300-INI-TABLAS.                                                           
200900     MOVE LOW-VALUES TO T1-TABLA-REGLAS-COMISIONES,                           
201000                        WKS-TABLA-REGLAS-COMISIONES,                          
201100                        T2-TABLA-REGLAS-REWARDS,                              
201200                        WKS-B14PREGREWEPP,                                    
201300                        WKS-PRELACIONES,                                      
201400                        WKS-MOVS-CLIENTE,                                     
201500                        TAB-TOTALES-REW,                                      
201600                        TAB-TOTALES-COMI.                                     
201700                                                                              
201800 000300-INI-VARS.                                                             
201900     MOVE 0  TO WKS-IND-TOT          , WKS-TIPMOV,                            
202000                WKS-IMP-TXN          , WKS-EPP-STATUS-REG,                    
202100                WKS-PROD-IMPORTE     , WKS-EPP-LIM-INF                        
202200                WKS-B13P-CASQ-BAL    , WKS-B13P-IMP-COMI,                     
202300                WKS-NUM-REGLA        , WKS-CUMPLE-REGLA,                      
202400                WKS-COMI             , WKS-IMP-EXC,                           
202500                WKS-NUM-REGLA        , WKS-PRODUCTO,                          
202600                WKS-D-GRACIA         , WKS-CVETXN,                            
202700                WKS-B13P-WAIVER      , WKS-REP-WAIVER,                        
202800                WKS-B13P-IMP-COMISION, WKS-B13P-CP,                           
202900                WKS-EPP-TIP-EXC      , WSK-ESQ-R.                             
202950     MOVE 10 TO WKS-CONT-REWARDS.                                             
203000     MOVE SPACES TO WKS-EPP-COMI-MOTIVO, WKS-REF-3, WKS-REF-2.                
203100                                                                              
203200 000300-ASIGNA-VAL-SALIDA.                                                    
203300     MOVE WKS-EPP-DET-NUM-SUCDEPTO TO WKS-POSTE-DET-SUCPRO                    
203400     MOVE WKS-EPP-DET-NUM-CTO      TO WKS-POSTE-DET-NUMCTO                    
203500     MOVE WKS-EPP-COMI-MOTIVO      TO WKS-RCOMIS-DESC                         
203600     MOVE WKS-IMP-EXC              TO WKS-POST-C-EXC.                         
203700                                                                              
203800 000300-VAL-SAL-LIST-COMI-DET.                                                
203900     MOVE LOW-VALUES           TO WKS-VAL-REP                                 
204000*     MOVE WKS-L-PROD           TO WKS-REP-PROD                               
204100*     MOVE WKS-L-INST           TO WKS-REP-INST                               
204200*     MOVE WKS-L-MON            TO WKS-REP-MON                                
204300*     MOVE WKS-LIST-ESQ         TO WKS-REP-ESQ                                
204400*     MOVE WKS-LCOMIS-IMP       TO WKS-REP-IMP-COMI                           
204500     MOVE WKS-LCOMIS-SUC       TO WKS-REP-SUC                                 
204600     MOVE WKS-LIST-CTO         TO WKS-REP-CTO                                 
204700     MOVE WKS-LCOMIS-NUM-REG   TO WKS-REP-NUM-REG                             
204800     MOVE WKS-EPP-COMI-MOTIVO  TO WKS-REP-DESC                                
204900     MOVE WKS-LCOMIS-CP        TO WKS-REP-CP                                  
205000     MOVE WKS-LCOMIS-WAIVER    TO WKS-REP-WAIVER                              
205100     MOVE WKS-LCOMIS-IMP-EXC   TO WKS-REP-C-EXC                               
205200     MOVE WKS-LCOMIS-IMP-COMI  TO WKS-REP-C-COMI.                             
205300                                                                              
205400                                                                              
205500 000300-VAL-SAL-LIST-REW-D.                                                   
205600     MOVE LOW-VALUES          TO WKS-VAL-REP,                                 
205700                                 WKS-REP-DESC                                 
205800     MOVE WKS-LREW-SUC        TO WKS-REP-SUC                                  
205900     MOVE WKS-LREW-NUM-REG    TO WKS-REW-NUM-REGLA                            
206000     MOVE WKS-LIST-CTO        TO WKS-REP-CTO                                  
206100     MOVE WKS-EPP-COMI-MOTIVO TO WKS-REP-DESC                                 
206200*     MOVE WKS-L-PROD          TO WKS-REP-PROD                                
206300*     MOVE WKS-L-INST          TO WKS-REP-INST                                
206400*     MOVE WKS-L-MON           TO WKS-REP-MON                                 
206500*     MOVE WKS-LIST-ESQ        TO WKS-REP-ESQ                                 
206600     MOVE WKS-LREW-WAIVER     TO WKS-REP-WAIVER                               
206700     MOVE WKS-LREW-IMP-REW    TO WKS-REP-T-REW                                
206800     MOVE WKS-LREW-CANAL      TO WKS-REP-CAN-REW                              
206900     MOVE WKS-LREW-NUM-MOVS   TO WKS-REP-MOVS-REW                             
207000     MOVE WKS-LREW-TIP-REW    TO WKS-REP-T-REW                                
207100     MOVE WKS-LREW-NUM-REG    TO WKS-REP-NUM-REG.                             
207200                                                                              
207300******************************************************************            
207400*                 BUSCA PIM EN TAB01-REG-COMI                    *            
207500* DONDE:                                                         *            
207600*  -> WKS-PRODUCTO: VALOR LEIDO DEL ARCHIVO, FORMADO POR:        *            
207700*         - PRODUCTO                                             *            
207800*         - INSTRUMENTO                                          *            
207900*         - MONEDA                                               *            
208000*         - TIPO DE ESQUEMA(1SALDO, 2RENTA, 3REWARD)             *            
208100*  -> T1-B13PRODUCTO: VALOR EXTRAIDO DE B13                      *            
208200*  -> WKS-PROD-FOUND: VALOR CERO, NO ENCONTRO PRODUCTO           *            
208300******************************************************************            
208400 000300-BUSCA-PROD-ON-TAB1.                                                   
208500     MOVE 0                   TO WKS-PROD-FOUND,                              
208600                                 WKS-PRODUCTO                                 
208700     MOVE WKS-EPP-DET-PROD    TO WKS-PRODUCTO-C                               
208800     MOVE WKS-EPP-DET-INST    TO WKS-INSTRUMENTO-C                            
208900     MOVE WKS-EPP-DET-MOND    TO WKS-MONEDA-C                                 
209100                                                                              
209110     IF WKS-EPP-DET-TIP-EVA = 05                                              
209120        MOVE                  01 TO WKS-ESQUEMA-C                             
209130     ELSE                                                                     
209140     IF WKS-EPP-DET-TIP-EVA = 06                                              
209150        MOVE                  02 TO WKS-ESQUEMA-C                             
209160     ELSE                                                                     
209170        MOVE WKS-EPP-DET-TIP-EVA TO WKS-ESQUEMA-C.                            
209180                                                                              
209200     PERFORM 0003000-FIND-PRODUCTO VARYING WKS-IN-COM FROM 1 BY 1             
209300            UNTIL (WKS-IN-COM>WKS-REGS-B13) OR (WKS-PROD-FOUND=1).            
209400                                                                              
209500 0003000-FIND-PRODUCTO.                                                       
209600     IF WKS-PRODUCTO = T1-B13PRODUCTO(WKS-IN-COM)                             
209700         MOVE T1-B13PREGCOMEPP(WKS-IN-COM) TO WKS-B13PREGCOMEPP               
209800         MOVE 1                            TO WKS-PROD-FOUND                  
209900         MOVE WKS-IN-COM                   TO WKS-I-PRE.                      
210000                                                                              
210100******************************************************************            
210200*          BUSCA REGLA DE COMISION EN WKS-TAB01-REG-COMI         *            
210300* VALIDA:                                                        *            
210400* SALDO PROMEDIO: MIN-MAX                                        *            
210500* CALCULAR EL SALDO MINIMO:                                      *            
210600* MOVIMIENTOS EN RED BANAMEX Y CANALES DIGITALES                 *            
210700******************************************************************            
210800 000300-BUSCA-REGLA-ON-TAB1.                                                  
210900     IF WKS-PRE-NUM-REGLA(WKS-I-PRE, WKS-J-PRE) > 0                           
211000         MOVE WKS-PRE-NUM-REGLA(WKS-I-PRE,WKS-J-PRE) TO WKS-IN-COM            
211100         PERFORM 000300-BUSCA-REGLA-ON-B13.                                   
211200                                                                              
211300 000300-BUSCA-REGLA-ON-B13.                                                   
211400     PERFORM 000300-VALORES-INICIALES                                         
211500                                                                              
211600     IF WKS-B13PSTATUS-REGLA = 1  AND                                         
211700     (WKS-FEC-SAMD > WKS-B13P-FEC-INI OR                                      
211800      WKS-FEC-SAMD = WKS-B13P-FEC-INI)AND                                     
211900     (WKS-FEC-SAMD < WKS-B13P-FEC-FIN OR                                      
212000      WKS-FEC-SAMD = WKS-B13P-FEC-FIN OR                                      
212100      WKS-B13P-FEC-FIN = 0)                                                   
212200                                                                              
212300         PERFORM 000300-EXC-NOMINA-BNMX                                       
212400         IF WKS-CUMPLE-REGLA = 0                                              
212500             PERFORM 000300-EXC-EMPLEADO-BNX                                  
212600             IF WKS-CUMPLE-REGLA = 0                                          
212700                 PERFORM 000300-EXC-SEGMENTO                                  
212800                 IF WKS-CUMPLE-REGLA = 0                                      
212900                     PERFORM 000300-EXC-GPO-BIN                               
213000                     IF WKS-CUMPLE-REGLA = 0                                  
213100                         PERFORM 000300-EXC-TIPO-PER                          
213200                         IF WKS-CUMPLE-REGLA = 0                              
213300                             PERFORM 000300-EXC-SDO-PROM                      
213400                             IF WKS-CUMPLE-REGLA = 0                          
213500                                 PERFORM 000300-EXC-MOVIMIENTOS.              
213600                                                                              
213700                                                                              
213800******************************************************************            
213900*          VALIDACION DE EXCEPCION 01: NOMINA BANAMEX            *            
214000******************************************************************            
214100 000300-EXC-NOMINA-BNMX.                                                      
214200     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM)=01 AND                                
214300     WKS-EPP-DET-COD-NOMINA=02                                                
214400         PERFORM 000300-COMISION-BY-EXC                                       
214500         PERFORM 000300-ASIGNA-MSG-BY-EXC                                     
214600         MOVE  1     TO WKS-CUMPLE-REGLA                                      
214700         MOVE 05     TO WKS-IND-TOT.                                          
214800                                                                              
214900******************************************************************            
215000*        VALIDACION DE EXCEPCION 02: EMPLEADO BANAMEX            *            
215100******************************************************************            
215200 000300-EXC-EMPLEADO-BNX.                                                     
215300     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM) = 02 AND                              
215400     WKS-EPP-DET-PERBCO = 02                                                  
215500         PERFORM 000300-COMISION-BY-EXC                                       
215600         PERFORM 000300-ASIGNA-MSG-BY-EXC                                     
215700         MOVE    1  TO WKS-CUMPLE-REGLA                                       
215800         MOVE   06  TO WKS-IND-TOT.                                           
215900                                                                              
216000******************************************************************            
216100*            VALIDACION DE EXCEPCION 03: SEGMENTO                *            
216200******************************************************************            
216300 000300-EXC-SEGMENTO.                                                         
216400     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM) = 03 AND                              
216500     WKS-EPP-DET-COD-SEGMENTO>0                                               
216600         MOVE    1                        TO WKS-CAT-ID                       
216700         MOVE    WKS-EPP-DET-COD-SEGMENTO TO WKS-CAT-COD                      
216800         PERFORM 000300-BUSCA-COD-ON-CAT-EXC                                  
216900         IF WKS-B13P-COD-FOUND = 1                                            
217000             PERFORM 000300-COMISION-BY-EXC                                   
217100             PERFORM 000300-ASIGNA-MSG-BY-EXC                                 
217200             MOVE    1   TO WKS-CUMPLE-REGLA                                  
217300             MOVE   07  TO WKS-IND-TOT.                                       
217400                                                                              
217500                                                                              
217600******************************************************************            
217700*            VALIDACION DE EXCEPCION 04: GRUPO BIN               *            
217800******************************************************************            
217900 000300-EXC-GPO-BIN.                                                          
218000     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM) = 04 AND                              
218100     WKS-EPP-DET-GPO-BIN >0                                                   
218200         MOVE    2                    TO WKS-CAT-ID                           
218300         MOVE    WKS-EPP-DET-GPO-BIN  TO WKS-CAT-COD                          
218400         PERFORM 000300-BUSCA-COD-ON-CAT-EXC                                  
218500         IF WKS-B13P-COD-FOUND = 1                                            
218600             PERFORM 000300-COMISION-BY-EXC                                   
218700             PERFORM 000300-ASIGNA-MSG-BY-EXC                                 
218800             MOVE    1   TO WKS-CUMPLE-REGLA                                  
218900             MOVE   08  TO WKS-IND-TOT.                                       
219000                                                                              
219100******************************************************************            
219200*         VALIDACION DE EXCEPCION 05: TIPO DE PERSONA            *            
219300******************************************************************            
219400 000300-EXC-TIPO-PER.                                                         
219500     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM) = 05 AND                              
219600        WKS-EPP-DET-CVE-TPER>0                                                
219700         MOVE    3                    TO WKS-CAT-ID                           
219800         MOVE    WKS-EPP-DET-CVE-TPER TO WKS-CAT-COD                          
219900         PERFORM 000300-BUSCA-COD-ON-CAT-EXC                                  
220000         IF WKS-B13P-COD-FOUND = 1                                            
220100             PERFORM 000300-COMISION-BY-EXC                                   
220200             PERFORM 000300-ASIGNA-MSG-BY-EXC                                 
220300             MOVE  0 TO WKS-B13P-COD-FOUND                                    
220400             MOVE  1 TO WKS-CUMPLE-REGLA                                      
220500             MOVE 09 TO WKS-IND-TOT.                                          
220600                                                                              
220700******************************************************************            
220800*          VALIDACION DE EXCEPCION 06: SALDO PROMEDIO            *            
220900******************************************************************            
221000 000300-EXC-SDO-PROM.                                                         
221100     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM)=06 AND                                
221200     WKS-EPP-DET-SDO-PROM-INTE>0                                              
221300         PERFORM 000300-CALCULA-COMI-SDO-PROM                                 
221400         MOVE   10  TO WKS-IND-TOT.                                           
221500                                                                              
221600******************************************************************            
221700*           VALIDACION DE EXCEPCION 07: MOVIMIENTOS              *            
221800******************************************************************            
221900 000300-EXC-MOVIMIENTOS.                                                      
222000     IF WKS-B13P-TIPO-EXCEP(WKS-IN-COM) = 07                                  
222100         PERFORM 000300-CALCULA-COMI-MOVS                                     
222200         MOVE   11  TO WKS-IND-TOT.                                           
222300                                                                              
222400                                                                              
222500******************************************************************            
222600*                 CALCULO DE COMISION X EXEPCION                 *            
222700* SE EVALUAN LOS VALORES DE WKS-B13P-CP:                         *            
222800* SI ES 1 COBRO DE COMISION POR CANTIDAD                         *            
222900* SI ES 2 COBRO DE COMISION POR PORCENTAJE                       *            
223000* wks-COMI    = IMPORTE A COBRAR                                 *            
223100* WKS-IMP-EXC = IMPORTE A EXCENTAR                               *            
223200******************************************************************            
223300 000300-COMISION-BY-EXC.                                                      
223400     IF WKS-B13P-CP = 1                                                       
223500         PERFORM 000300-ASIGNA-COMISION                                       
223600     ELSE                                                                     
223700     IF WKS-B13P-CP = 2                                                       
223800         COMPUTE WKS-IMP-EXC=                                                 
223900                 WKS-B13P-IMP-COMI * (WKS-B13P-WAIVER/100)                    
224000         COMPUTE WKS-COMI = WKS-B13P-IMP-COMI - WKS-IMP-EXC.                  
224100                                                                              
224200 000300-ASIGNA-COMISION.                                                      
224300     IF WKS-B13P-WAIVER>WKS-B13P-IMP-COMI OR WKS-B13P-IMP-COMI = 0            
224400         MOVE 0 TO WKS-COMI                                                   
224500     ELSE                                                                     
224600         COMPUTE WKS-COMI = WKS-B13P-IMP-COMI - WKS-B13P-WAIVER.              
224700                                                                              
224800     COMPUTE WKS-IMP-EXC = WKS-B13P-IMP-COMI - WKS-COMI.                      
224900                                                                              
225000 000300-ASIGNA-MSG-BY-EXC.                                                    
225100     MOVE WKS-EPP-TIP-EXC TO WKS-I-LEY-COM                                    
225200                                                                              
225300     IF WKS-B13P-CP = 1                                                       
225400         MOVE WKS-IMP-EXC TO WKS-COMI-FORMAT                                  
225500         MOVE WKS-COMI    TO WKS-COMI-FORMAT3                                 
225600         STRING "EX "WKS-COMI-FORMAT"COM " WKS-COMI-FORMAT3                   
225700         WKS-EXC-DESC(WKS-I-LEY-COM)                                          
225800         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
225900      ELSE                                                                    
226000      IF WKS-B13P-CP = 2                                                      
226100         MOVE WKS-B13P-WAIVER TO WKS-COMI-FORMAT4                             
226200         MOVE WKS-COMI        TO WKS-COMI-FORMAT3                             
226300         STRING "EX "WKS-COMI-FORMAT4"%COM " WKS-COMI-FORMAT3                 
226400         WKS-EXC-DESC(WKS-I-LEY-COM)                                          
226500         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                          
226600                                                                              
226700 000300-BUSCA-COD-ON-CAT-EXC.                                                 
226800     MOVE   0 TO  WKS-B13P-COD-FOUND                                          
226900     SET IDX-CAT TO 1                                                         
227000     SEARCH WKS-TAB-CATEPP VARYING IDX-CAT                                    
227100     AT END                                                       785100      
227200        MOVE 0 TO  WKS-B13P-COD-FOUND                                         
227300     WHEN                                                         785300      
227400        WKS-CATEPP-ID-CAT(IDX-CAT)  = WKS-CAT-ID  AND                         
227500        WKS-CATEPP-PROD(IDX-CAT)    = WKS-PRODUCTO-C    AND                   
227600        WKS-CATEPP-INST(IDX-CAT)    = WKS-INSTRUMENTO-C AND                   
227700        WKS-CATEPP-MON(IDX-CAT)     = WKS-MONEDA-C      AND                   
227800        WKS-CATEPP-EVA(IDX-CAT)     = WKS-ESQUEMA-C     AND                   
227900        WKS-CATEPP-COT-CAT(IDX-CAT) = WKS-CAT-COD                             
228000        MOVE 1 TO  WKS-B13P-COD-FOUND.                                        
228100     MOVE 0 TO WKS-CAT-ID,WKS-CAT-COD, WKS-PRODUCTO.                          
228200                                                                              
228300 000300-VALORES-INICIALES.                                                    
228400     MOVE 0                                 TO WKS-B13P-COD-FOUND             
228500     MOVE WKS-B13P-IMP-COMISION             TO WKS-B13P-IMP-COMI              
228600     MOVE WKS-B13P-IMP-WAIVER(WKS-IN-COM)   TO WKS-B13P-WAIVER                
228700     MOVE WKS-B13P-IND-IMP-PORC(WKS-IN-COM) TO WKS-B13P-CP                    
228800     MOVE WKS-B13P-TIPO-EXCEP(WKS-IN-COM)   TO WKS-EPP-TIP-EXC                
228900     MOVE WKS-B13P-CASQ-BALANCE(WKS-IN-COM) TO WKS-B13P-CASQ-BAL              
229000     MOVE WKS-B13P-FECHA-INI(WKS-IN-COM)    TO WKS-B13P-FEC-INI               
229100     MOVE WKS-B13P-FECHA-FIN(WKS-IN-COM)    TO WKS-B13P-FEC-FIN               
229200     MOVE WKS-B13P-STATUS-REGLA(WKS-IN-COM) TO                                
229300                                            WKS-B13PSTATUS-REGLA              
229400     MOVE WKS-T1-B13P-NUM-REGLA(WKS-IN-COM) TO WKS-NUM-REGLA.                 
229500                                                                              
229600******************************************************************            
229700*                 CALCULO DE LIMITE INFERIOR                     *            
229800******************************************************************            
229900 000300-CALCULA-LIM-INFERIOR.                                                 
230000     IF WKS-B13P-IMP-COMI>WKS-B13P-CASQ-BAL OR WKS-B13P-CASQ-BAL=0            
230100         MOVE 0 TO WKS-EPP-LIM-INF                                            
230200     ELSE                                                                     
230300         COMPUTE WKS-EPP-LIM-INF =                                            
230400                            WKS-B13P-CASQ-BAL - WKS-B13P-IMP-COMI.            
230500                                                                              
230600******************************************************************            
230700*        ASIGNA VALOR DE LA COMISION PARA <SDO PROMEDIO>         *            
230800******************************************************************            
230900 000300-CALCULA-COMI-SDO-PROM.                                                
231000     IF(WKS-EPP-DET-SDO-PROM-INTE > WKS-B13P-CASQ-BAL) OR                     
231100     (WKS-EPP-DET-SDO-PROM-INTE   = WKS-B13P-CASQ-BAL) AND                    
231200     WKS-B13P-CP = 2                                                          
231300         PERFORM 000300-COMISION-BY-EXC                                       
231400         PERFORM 000300-ASIGNA-MSG-BY-EXC                                     
231500         MOVE 1  TO WKS-CUMPLE-REGLA                                          
231600     ELSE                                                                     
231700        PERFORM 000300-CALCULA-LIM-INFERIOR                                   
231800        IF(WKS-EPP-DET-SDO-PROM-INTE < WKS-B13P-CASQ-BAL OR                   
231900        WKS-EPP-DET-SDO-PROM-INTE    = WKS-B13P-CASQ-BAL) AND                 
232000        (WKS-EPP-DET-SDO-PROM-INTE   > WKS-EPP-LIM-INF OR                     
232100         WKS-EPP-DET-SDO-PROM-INTE   = WKS-EPP-LIM-INF) AND                   
232200        WKS-B13P-CP = 1                                                       
232300            COMPUTE WKS-COMI =                                                
232400                     WKS-B13P-CASQ-BAL - WKS-EPP-DET-SDO-PROM-INTE            
232500            COMPUTE WKS-IMP-EXC = WKS-B13P-IMP-COMI - WKS-COMI                
232600            PERFORM 000300-ASIGNA-MSG-BY-EXC                                  
232700            MOVE 1 TO WKS-CUMPLE-REGLA.                                       
232800                                                                              
232900******************************************************************            
233000* ASIGNA VALOR DE LA COMISION PARA MOVS <ATM BNMX Y CANALES DIG> *            
233100******************************************************************            
233200 000300-CALCULA-COMI-MOVS.                                                    
233300     PERFORM 000300-ASIGNA-MOVS                                               
233400     PERFORM 000300-VALIDA-MOVS-COMI.                                         
233500                                                                              
233600 000300-VALIDA-MOVS-COMI.                                                     
233700     IF(WKS-MOVS1 > WKS-MOVS-CD OR WKS-MOVS1= WKS-MOVS-CD)                    
233800        IF(WKS-MOVS2 > WKS-MOVS-MIN OR WKS-MOVS2 = WKS-MOVS-MIN)              
233900           IF(WKS-MOVS2 <WKS-MOVS-MAX OR WKS-MOVS2 = WKS-MOVS-MAX)            
234000                         PERFORM 000300-ASIGNA-COMI-X-MOVS.                   
234100                                                                              
234200 000300-ASIGNA-COMI-X-MOVS.                                                   
234300     PERFORM 000300-COMISION-BY-EXC                                           
234400     PERFORM 000300-ASIGNA-MSG-BY-EXC                                         
234500     MOVE 1  TO WKS-CUMPLE-REGLA.                                             
234600                                                                              
234700 000300-ASIGNA-MOVS.                                                          
234800     MOVE WKS-B13P-NUM-RET-ATM-MIN(WKS-IN-COM)  TO WKS-MOVS-MIN               
234900     MOVE WKS-B13P-NUM-RET-ATM-MAX(WKS-IN-COM)  TO WKS-MOVS-MAX               
235000     MOVE WKS-B13P-NUM-MOVS-CAN-DIG(WKS-IN-COM) TO WKS-MOVS-CD                
235100     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-1          TO WKS-MOVS1                  
235200     MOVE WKS-EPP-DET-CANAL-1                   TO WKS-CANAL1                 
235300     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-2          TO WKS-MOVS2                  
235400     MOVE WKS-EPP-DET-CANAL-2                   TO WKS-CANAL2                 
235500     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-3          TO WKS-MOVS3                  
235600     MOVE WKS-EPP-DET-CANAL-3                   TO WKS-CANAL3.                
235700                                                                              
235800******************************************************************            
235900*         BUSCA REGLA REWARDS EN TAB03-REG-REW                   *            
236000*SI EL PROD NO EXISTE EN B14 SE GENERA EL MSG DE ERROR           *            
236100*SI EL PROD NO ESTA ACTIVO (VALOR 2) SE GENERA EL MSG DE ERROR   *            
236200*SI EL PROD EXISTE SE VALIDAN LAS REGLAS DE B14                  *            
236300******************************************************************            
236400 000300-BUSCA-REGLA-REWARD.                                                   
236500     MOVE 0      TO WKS-CUMPLE-REGLA,WKS-IMP-TXN,                             
236520                    WKS-IMP-EXC     , WKS-COMI                                
236540     MOVE SPACES TO WKS-EPP-COMI-MOTIVO                                       
236600     PERFORM 000300-BUSCA-PROD-T3                                             
236700     PERFORM 000300-VAL-PROD-STAT-B14                                         
236800     IF WKS-CUMPLE-REGLA = 0                                                  
236900         PERFORM 000300-VAL-REGLA-B14                                         
237000         IF WKS-CUMPLE-REGLA = 0                                              
237100             PERFORM 000300-VAL-NA-REGLA-REW.                                 
237200                                                                              
237300                                                                              
237400 000300-VAL-PROD-STAT-B14.                                                    
237500     IF WKS-PROD-FOUND = 0                                                    
237600         STRING "ERR:PROD["WKS-PRODUCTO-R"]NOREG.S500B14PREGREW"              
237700         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
237800         PERFORM 0003000-ASIGNA-VAL-RW-ERR                                    
237900         MOVE 1 TO WKS-EPP-STATUS-REG                                         
238000         PERFORM 000300-ARMA-DET-RCOMIS                                       
238100         MOVE 14 TO WKS-EPP-TIP-EXC                                           
238200         MOVE 02  TO WKS-IND-TOT                                              
238300         PERFORM 000300-ARMA-DET-REW-ARCLIST                                  
238400         MOVE 1 TO WKS-CUMPLE-REGLA                                           
238500     ELSE                                                                     
238600     IF WKS-B14P-STATUS = 2                                                   
238700         STRING "ERR:PRO["WKS-PRODUCTO-R"]INACT.S500B14PREGREWE"              
238800         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
238900         PERFORM 0003000-ASIGNA-VAL-RW-ERR                                    
239000         MOVE 1 TO WKS-EPP-STATUS-REG                                         
239100         PERFORM 000300-ARMA-DET-RCOMIS                                       
239200         MOVE 15 TO WKS-EPP-TIP-EXC                                           
239300         MOVE 02  TO WKS-IND-TOT                                              
239400         PERFORM 000300-ARMA-DET-REW-ARCLIST                                  
239500         MOVE 1 TO WKS-CUMPLE-REGLA.                                          
239600                                                                              
239700 000300-VAL-REGLA-B14.                                                        
239800                                                                              
239900         PERFORM 000300-BUSCA-REGLA-T3 VARYING WKS-I-R FROM 1 BY 1            
240000                 UNTIL WKS-I-R > WKS-T2-B14-TOTAL-REGLAS.                     
240100                                                                              
240200 000300-VAL-NA-REGLA-REW.                                                     
240300         MOVE 0 TO WKS-NUM-REGLA, WKS-EPP-STATUS-REG                          
240400         MOVE 0 TO WKS-COMI-FORMAT, WKS-TIPO-RW                               
240500         STRING "REW "WKS-COMI-FORMAT                                         
240600         " NO CUMPLE CON REGLA" DELIMITED BY SIZE INTO                        
240700         WKS-EPP-COMI-MOTIVO                                                  
240800         MOVE 1                TO WKS-CUMPLE-REGLA                            
240900         PERFORM 0003000-ASIGNA-VAL-RW-ERR                                    
241100         MOVE 0  TO WKS-B13P-WAIVER, WKS-REP-WAIVER                           
241200         PERFORM 000300-ARMA-DET-RCOMIS                                       
241300         MOVE 17 TO WKS-EPP-TIP-EXC                                           
241400         MOVE 10 TO WKS-IND-TOT                                               
241500         PERFORM 000300-ARMA-DET-REW-ARCLIST.                                 
241600                                                                              
241700 0003000-ASIGNA-VAL-RW-ERR.                                                   
241800     MOVE 8                              TO WKS-CANAL-RW                      
241900     MOVE 0                              TO WKS-WAIVER-RW,                    
242000                                            WKS-NUM-REGLA,                    
242100                                            WKS-TIPO-RW,                      
242200                                            WKS-NUM-MOVS-RW,                  
242300                                            WKS-EPP-STATUS-REG.               
242400                                                                              
242500******************************************************************            
242600*          BUSCA PRODUCTO DE REWARD EN TAB03-REG-REW             *            
242700******************************************************************            
242800 000300-BUSCA-PROD-T3.                                                        
242900     MOVE 0                TO WKS-PROD-FOUND                                  
243000                                                                              
243100     MOVE WKS-EPP-DET-PROD TO PRODUCTO-R                                      
243200     MOVE WKS-EPP-DET-INST TO INSTRUMENTO-R                                   
243300     MOVE WKS-EPP-DET-MOND TO MONEDA-R                                        
243350     MOVE               03 TO WSK-ESQ-R                                       
243400                                                                              
243500     PERFORM 0003000-FIND-PRODUCTO-REW VARYING WKS-I-R FROM 1 BY 1            
243600             UNTIL WKS-PROD-FOUND  =  1 OR WKS-I-R > WKS-REGS-B14.            
243700                                                                              
243800                                                                              
243900                                                                              
244000 0003000-FIND-PRODUCTO-REW.                                                   
244100     IF WKS-PRODUCTO-R = T2-B14PRODUCTO(WKS-I-R)                              
244200         MOVE T2-B14PREGREWEPP(WKS-I-R) TO WKS-B14PREGREWEPP                  
244300         MOVE 1 TO WKS-PROD-FOUND.                                            
244400                                                                              
244500******************************************************************            
244600*          BUSCA REGLA DE REWARD EN TAB03-REG-REW                *            
244700******************************************************************            
244800 000300-BUSCA-REGLA-T3.                                                       
244900     IF( WKS-B14P-STATUS-REWARD(WKS-I-R) = 1 )                                
245000         PERFORM 000300-VAL-INI-REW                                           
245100         PERFORM 000300-CARGA-TAB-MOVS-X-CAN                                  
245200         PERFORM 000300-VALIDA-MOVS-X-CANAL                                   
245300                        VARYING WKS-K FROM 1 BY 1 UNTIL WKS-K > 7.            
245400                                                                              
245500 000300-CARGA-TAB-MOVS-X-CAN.                                                 
245600     MOVE WKS-EPP-DET-CANAL-1          TO WKS-MOVS-CANAL(1)                   
245700     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-1 TO WKS-MOVS-NUMERO(1)                  
245800     MOVE WKS-EPP-DET-IMP-CANAL-1      TO WKS-MOVS-IMPORTE(1)                 
245900                                                                              
246000     MOVE WKS-EPP-DET-CANAL-2          TO WKS-MOVS-CANAL(2)                   
246100     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-2 TO WKS-MOVS-NUMERO(2)                  
246200     MOVE WKS-EPP-DET-IMP-CANAL-2      TO WKS-MOVS-IMPORTE(2)                 
246300                                                                              
246400     MOVE WKS-EPP-DET-CANAL-3          TO WKS-MOVS-CANAL(3)                   
246500     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-3 TO WKS-MOVS-NUMERO(3)                  
246600     MOVE WKS-EPP-DET-IMP-CANAL-3      TO WKS-MOVS-IMPORTE(3)                 
246700                                                                              
246800     MOVE WKS-EPP-DET-CANAL-4          TO WKS-MOVS-CANAL(4)                   
246900     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-4 TO WKS-MOVS-NUMERO(4)                  
247000     MOVE WKS-EPP-DET-IMP-CANAL-4      TO WKS-MOVS-IMPORTE(4)                 
247100                                                                              
247200     MOVE WKS-EPP-DET-CANAL-5          TO WKS-MOVS-CANAL(5)                   
247300     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-5 TO WKS-MOVS-NUMERO(5)                  
247400     MOVE WKS-EPP-DET-IMP-CANAL-5      TO WKS-MOVS-IMPORTE(5)                 
247500                                                                              
247600     MOVE WKS-EPP-DET-CANAL-6          TO WKS-MOVS-CANAL(6)                   
247700     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-6 TO WKS-MOVS-NUMERO(6)                  
247800     MOVE WKS-EPP-DET-IMP-CANAL-6      TO WKS-MOVS-IMPORTE(6)                 
247900                                                                              
248000     MOVE WKS-EPP-DET-CANAL-7          TO WKS-MOVS-CANAL(7)                   
248100     MOVE WKS-EPP-DET-NUM-MOVS-CANAL-7 TO WKS-MOVS-NUMERO(7)                  
248200     MOVE WKS-EPP-DET-IMP-CANAL-7      TO WKS-MOVS-IMPORTE(7).                
248300                                                                              
248400 000300-VALIDA-MOVS-X-CANAL.                                                  
248500     IF(WKS-MOVS-CANAL(WKS-K)= WKS-B14P-TIPO-CANAL(WKS-I-R)) AND              
248600     (WKS-MOVS-NUMERO(WKS-K) >WKS-B14P-MOVS-CANAL-DIG(WKS-I-R) OR             
248700      WKS-MOVS-NUMERO(WKS-K) = WKS-B14P-MOVS-CANAL-DIG(WKS-I-R))              
248800         PERFORM 000300-CAL-REW-BY-CANT-POR                                   
248900         PERFORM 000300-ASIGNA-MSG-REW                                        
249000         PERFORM 000300-VAL-SAL-LIST-REW-DET                                  
249100         PERFORM 000300-ARMA-DET-RCOMIS                                       
249200         PERFORM 000300-GENERA-DET-POSTE                                      
249300         PERFORM 000300-ARMA-DET-REW-ARCLIST                                  
249400         MOVE 01 TO WKS-CUMPLE-REGLA.                                         
249500                                                                              
249600 000300-VAL-SAL-LIST-REW-DET.                                                 
249700     MOVE WKS-EPP-COMI-MOTIVO            TO WKS-RCOMIS-DESC                   
249800     MOVE WKS-MOVS-CANAL(WKS-K)          TO WKS-CANAL-RW                      
249900     MOVE WKS-MOVS-NUMERO(WKS-K)         TO WKS-NUM-MOVS-RW                   
250000     MOVE WKS-B14P-NUM-REWARD(WKS-I-R)   TO WKS-NUM-REGLA                     
250100     MOVE WKS-B14P-TIPO-REWARD(WKS-I-R)  TO WKS-TIPO-RW                       
250200     MOVE 0                              TO WKS-EPP-STATUS-REG                
250300     MOVE 16                             TO WKS-EPP-TIP-EXC                   
250400     COMPUTE WKS-IND-TOT = WKS-K + 2.                                         
250500 000300-ASIGNA-MSG-REW.                                                       
250600     MOVE SPACES                         TO WKS-EPP-COMI-MOTIVO               
250700     MOVE WKS-MOVS-IMPORTE(WKS-K)        TO WKS-COMI-FORMAT2                  
250800                                                                              
250900     IF WKS-CP-RW = 01                                                        
251000         MOVE WKS-WAIVER-RW                  TO WKS-COMI-FORMAT3              
251100         STRING "RW"WKS-COMI-FORMAT3"X RET.IMP:"WKS-COMI-FORMAT2              
251200         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
251300     ELSE                                                                     
251400     IF WKS-CP-RW = 02                                                        
251500         MOVE WKS-WAIVER-RW TO WKS-COMI-FORMAT4                               
251600         STRING "RW"WKS-COMI-FORMAT4"%X RET.IMP:"WKS-COMI-FORMAT2             
251700         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                          
251800                                                                              
251900 000300-VAL-INI-REW.                                                          
252000     MOVE WKS-B14P-IMP-WAIVER(WKS-I-R)   TO WKS-WAIVER-RW                     
252100     MOVE WKS-B14P-IND-IMP-PORC(WKS-I-R) TO WKS-CP-RW.                        
252200                                                                              
252300 000300-CAL-REW-BY-CANT-POR.                                                  
252400     IF WKS-CP-RW = 01                                                        
252500         COMPUTE WKS-REWARD = WKS-WAIVER-RW                                   
252600     ELSE                                                                     
252700     IF WKS-CP-RW = 02                                                        
252800         COMPUTE WKS-REWARD =                                                 
252900                (WKS-MOVS-IMPORTE(WKS-K) * ( WKS-WAIVER-RW/100 )).            
253000                                                                              
253100     MOVE WKS-REWARD TO WKS-IMP-TXN                                           
253200     COMPUTE WKS-TOT-ABO = WKS-TOT-ABO + WKS-REWARD.                          
253300                                                                              
253400******************************************************************            
253500*         FIN PROCESO -  CALCULO DE COMI Y REWARDS               *            
253600******************************************************************            
253700                                                                              
253800******************************************************************            
253900*                   HEADER-ARCHIVO DE POSTEO                     *            
254000******************************************************************            
254100 000300-ARMA-HEADER-POSTE.                                                    
254200     MOVE SPACES TO WKS-POSTE-HDR                                             
254300     MOVE "EPP - INSTRUCCIONES COMIS-PAQ-INCENT" TO WKS-DESC-ARC              
254400     MOVE 1              TO WKS-POSTE-HDR-TIPREG                              
254500     MOVE WKS-NODO       TO WKS-POSTE-HDR-NODORI                              
254600     MOVE WKS-FEC-ARC-AA TO WKS-FECPRO-AA                                     
254700     MOVE WKS-FEC-ARC-MM TO WKS-FECPRO-MM                                     
254800     MOVE WKS-FEC-ARC-DD TO WKS-FECPRO-DD                                     
254900     MOVE 000000000500   TO WKS-POSTE-HDR-SISCTE                              
255000     MOVE 005            TO WKS-POSTE-HDR-NUMARC                              
255100     MOVE WKS-DESC-ARC   TO WKS-POSTE-HDR-DESCTE                              
255200     WRITE   ARC-POSTING-REG    FROM WKS-POSTE-HDR.                           
255300                                                                              
255400******************************************************************            
255500*                  DETALLE-ARCHIVO DE POSTEO                     *            
255600******************************************************************            
255700 000300-ARMA-DETALLE-POSTE.                                                   
255800     MOVE SPACES                    TO WKS-POSTE-DET                          
255900     MOVE WKS-EPP-DET-NUM-SUCDEPTO  TO WKS-POSTE-DET-SUCPRO                   
256000     MOVE WKS-EPP-DET-NUM-CTO       TO WKS-POSTE-DET-NUMCTO                   
256100     MOVE 2                         TO WKS-POSTE-DET-TIPREG                   
256200     MOVE WKS-CONT-DET              TO WKS-POSTE-DET-SECDET                   
256300     MOVE WKS-NUM-SUC               TO WKS-POSTE-DET-NUMSUC                   
256400     MOVE WKS-NUM-CAJ               TO WKS-POSTE-DET-NUMCAJ                   
256500     MOVE WKS-CONT-DET              TO WKS-POSTE-DET-NUMAUT                   
256600     MOVE WKS-CVETXN                TO WKS-POSTE-DET-CVETXN                   
256700     MOVE WKS-TIPMOV                TO WKS-POSTE-DET-TIPMOV                   
256800     MOVE 00                        TO WKS-POSTE-DET-TIPMED                   
256900     MOVE WKS-IMP-TXN               TO WKS-POSTE-DET-IMPTXN                   
257000     MOVE 001                       TO WKS-POSTE-DET-TIPMON                   
257100     MOVE ZEROS                     TO WKS-POSTE-DET-NUMREF                   
257200     MOVE ZERO                      TO WKS-POSTE-DET-VALFI1                   
257300     MOVE "uT"                      TO WKS-POSTE-DET-LETRUT                   
257400     MOVE 01                        TO WKS-POSTE-DET-NUMPRI                   
257500     MOVE ZEROS                     TO WKS-POSTE-DET-VALFI2                   
257600     MOVE "m"                       TO WKS-POSTE-DET-LMEMEM                   
257700     MOVE WKS-REF-2                 TO WKS-POSTE-DET-REFAL2                   
257800     MOVE "n"                       TO WKS-POSTE-DET-LMENEN                   
257900     MOVE WKS-REF-3                 TO WKS-POSTE-DET-REFAL3                   
258000     MOVE "o"                       TO WKS-POSTE-DET-LMOOOO                   
258100     MOVE "."                       TO WKS-POSTE-DET-FINREG                   
258200     WRITE ARC-POSTING-REG          FROM WKS-POSTE-DET                        
258300     MOVE  SPACES                   TO WKS-REF-3, WKS-REF-2.                  
258400                                                                              
258500******************************************************************            
258600*                  TRAILER-ARCHIVO DE POSTEO                     *            
258700******************************************************************            
258800 000300-ARMA-TRAILER-POSTE.                                                   
258900     MOVE SPACES           TO WKS-POSTE-TRL                                   
259000     MOVE 9                TO WKS-POSTE-TRL-TIPREG                            
259100     MOVE WKS-NUN-ABO      TO WKS-POSTE-TRL-NUMABO                            
259200     MOVE WKS-TOT-ABO      TO WKS-POSTE-TRL-IMPABO                            
259300     MOVE WKS-NUM-CAR      TO WKS-POSTE-TRL-NUMCAR                            
259400     MOVE WKS-TOT-CAR      TO WKS-POSTE-TRL-IMPCAR                            
259500     MOVE WKS-NUM-NCO      TO WKS-POSTE-TRL-NUMNCO                            
259600     WRITE ARC-POSTING-REG FROM WKS-POSTE-TRL.                                
259700                                                                              
259800******************************************************************            
259900*                   DETALLE-ARCHIVO DE POSTEO                    *            
260000******************************************************************            
260100 000300-GENERA-DET-POSTE.                                                     
260200     PERFORM 000300-ASIGNA-SUC-CAJ                                            
260300     MOVE 0 TO WKS-TIPMOV, WKS-CVETXN                                         
260400     IF WKS-IMP-EXC > 0                                                       
260500         MOVE WKS-IMP-EXC TO WKS-IMP-TXN                                      
260600*        MOV NO CONTABLE                                                      
260700         MOVE 3           TO WKS-TIPMOV                                       
260800         ADD  1           TO WKS-CONT-DET                                     
260900         ADD  1           TO WKS-NUM-NCO                                      
261000         PERFORM 000300-ASIGNA-CVE-TRN-NCO                                    
261100         PERFORM 000300-ASIGNA-REF                                            
261200         PERFORM 000300-ARMA-DETALLE-POSTE.                                   
261300                                                                              
261400     IF WKS-COMI > 0                                                          
261500         ADD WKS-COMI  TO WKS-TOT-CAR                                         
261600*        CARGO                                                                
261700         MOVE 1        TO WKS-TIPMOV                                          
261800         MOVE WKS-COMI TO WKS-IMP-TXN                                         
261900         ADD  1        TO WKS-CONT-DET                                        
262000         ADD  1        TO WKS-NUM-CAR                                         
262100         PERFORM 000300-ASIGNA-CVE-TRN-CAR                                    
262200         PERFORM 000300-ASIGNA-REF                                            
262300         PERFORM 000300-ARMA-DETALLE-POSTE.                                   
262400                                                                              
262500     IF WKS-REWARD > 0                                                        
262600*        ABONO                                                                
262700         MOVE 2    TO WKS-TIPMOV                                              
262800         ADD  1    TO WKS-CONT-DET                                            
262900         ADD  1    TO WKS-NUN-ABO                                             
263000         MOVE 1293 TO WKS-CVETXN                                              
263020         MOVE 0511 TO WKS-NUM-SUC                                             
263040         MOVE   72 TO WKS-NUM-CAJ                                             
263100         PERFORM 000300-ASIGNA-REF                                            
263200         PERFORM 000300-ARMA-DETALLE-POSTE.                                   
263300                                                                              
263400******************************************************************            
263500*              ASIGNACION DE CLAVE DE TRANSACCION                *            
263600*833 : EXENCION COBRO COMISION RENTA MENSUAL                     *            
263700*2523: INSTRUCCION COMISION RENTA MENSUAL                        *            
263800*835 : EXENCION COBRO COMISION MANEJO DE CUENTA                  *            
263900*2524: INSTRUCCION COMISION MANEJO DE CUENTA                     *            
264000*1293: BONIFICACION POR PAQUETE                                  *            
264100******************************************************************            
264200 000300-ASIGNA-CVE-TRN-NCO.                                                   
264300     MOVE ZEROS TO WKS-CVETXN                                                 
264400     IF WKS-ESQ-BY-REN OR WKS-ESQ-MIX-REN                                     
264500         MOVE 0833  TO WKS-CVETXN                                             
264600     ELSE                                                                     
264750         IF WKS-ESQ-BY-SDO OR WKS-ESQ-MIX-SDO                                 
264800            MOVE 0835  TO WKS-CVETXN.                                         
264900                                                                              
265000 000300-ASIGNA-CVE-TRN-CAR.                                                   
265100     MOVE ZEROS TO WKS-CVETXN                                                 
265250     IF WKS-ESQ-BY-REN OR WKS-ESQ-MIX-REN                                     
265300         MOVE 2523  TO WKS-CVETXN                                             
265400     ELSE                                                                     
265550         IF WKS-ESQ-BY-SDO OR WKS-ESQ-MIX-SDO                                 
265600            MOVE 2524  TO WKS-CVETXN.                                         
265700                                                                              
265800******************************************************************            
265900*        REFERENCIA ALFANUMERICA ARCHIVO DE POSTEO               *            
266000******************************************************************            
266100 000300-ASIGNA-REF.                                                           
266150     PERFORM 000300-INI-VALUES.                                               
266200*    CUENTA NUEVA, SIN FECHA DE CORTE ANTERIOR=00010101                       
266300     IF WKS-EPP-DET-FEC-CORTE-ANT = 00010101 AND                              
266400        WKS-FEC-APER-MM > 0 AND WKS-FEC-ULT-C-MM > 0                          
266420        MOVE WKS-EPP-DET-FEC-APER      TO WKS-FECHA-INICIAL                   
266440        MOVE WKS-EPP-DET-FEC-ULT-CORTE TO WKS-FECHA-FINAL                     
266460        PERFORM 000300-CALCULA-FEC-INI-FIN                                    
266900     ELSE                                                                     
267000*    CUENTA CON FECHA DE CORTE ANTERIOR                                       
267100     IF WKS-FEC-C-ANT-MM > 0 AND WKS-FEC-ULT-C-MM >0                          
267120        MOVE WKS-EPP-DET-FEC-CORTE-ANT TO WKS-FECHA-INICIAL                   
267140        MOVE WKS-EPP-DET-FEC-ULT-CORTE TO WKS-FECHA-FINAL                     
267160        PERFORM 000300-CALCULA-FEC-INI-FIN.                                   
267600                                                                              
267700     IF WKS-CVETXN = 0833 OR 0835                                             
267800         STRING "PERIODO " WKS-MES-INI WKS-DIA-INI " AL "                     
267900         WKS-MES-FIN WKS-DIA-FIN" IMPORTE A EX"                               
268000         DELIMITED BY SIZE INTO WKS-REF-2                                     
268100         MOVE WKS-IMP-TXN TO WKS-COMI-FORMAT2                                 
268200         STRING "ENTAR " WKS-COMI-FORMAT2                                     
268300         DELIMITED BY SIZE INTO WKS-REF-3                                     
268400     ELSE                                                                     
268500         STRING "PERIODO "WKS-MES-INI WKS-DIA-INI                             
268550                " AL "WKS-MES-FIN WKS-DIA-FIN                                 
268600         DELIMITED BY SIZE INTO WKS-REF-2.                                    
268602                                                                              
268604 000300-INI-VALUES.                                                           
268606     MOVE 0                         TO WKS-MES-INI    ,WKS-DIA-INI            
268608                                       WKS-MES-FIN    ,WKS-DIA-FIN            
268610                                       WKS-FECHA-FINAL,                       
268612                                       WKS-FECHA-INICIAL,                     
268614                                       WS-S006-FECHA1.                        
268616     MOVE 13                        TO WS-S006-FORMATO.                       
268618     MOVE SPACES                    TO WKS-REF-2,WKS-REF-3.                   
268620                                                                              
268622 000300-CALCULA-FEC-INI-FIN.                                                  
268624     PERFORM 000301-FECHA-INI.                                                
268626     PERFORM 000302-FECHA-FIN.                                                
268628     PERFORM 000303-ASIGNA-FECHAS.                                            
268630                                                                              
268632 000301-FECHA-INI.                                                            
268633     MOVE WKS-FECHA-INICIAL TO WS-S006-FECHA1                                 
268634     PERFORM 000300-ES-FECHA-HABIL.                                           
268636     IF WKS-FEC-HABIL = 1                                                     
268638        MOVE    WKS-FECHA-INICIAL TO WS-S006-FECHA1                           
268640        PERFORM 000300-SUMA-DIA-NATURAL                                       
268642        MOVE    WKS-GEN-FECHA     TO WKS-FECHA-INICIAL                        
268644     ELSE                                                                     
268646        MOVE    WKS-FECHA-INICIAL TO WS-S006-FECHA1                           
268648        PERFORM 000300-DIA-HABIL-ANTERIOR                                     
268650        MOVE    WKS-GEN-FECHA     TO WS-S006-FECHA1                           
268652        PERFORM 000300-SUMA-DIA-NATURAL                                       
268654        MOVE    WKS-GEN-FECHA     TO WKS-FECHA-INICIAL.                       
268656                                                                              
268658 000300-ES-FECHA-HABIL.                                                       
268660     MOVE 0                 TO WKS-FEC-HABIL, WS-S006-FECHA2                  
268662     MOVE 18                TO WS-S006-FUNCION                                
268664     PERFORM 000000-CALL-CALENDAR                                             
268666     IF WS-S006-FUNCION = 0                                                   
268668         IF WS-S006-FECHA1 = 1                                                
268670               MOVE 1 TO WKS-FEC-HABIL.                                       
268672                                                                              
268674 000300-DIA-HABIL-ANTERIOR.                                                   
268676     MOVE 15             TO WS-S006-FUNCION                                   
268678     MOVE 1              TO WS-S006-FECHA2                                    
268680     PERFORM 000000-CALL-CALENDAR                                             
268682     MOVE WS-S006-FECHA1 TO WKS-GEN-FECHA.                                    
268684                                                                              
268686 000300-SUMA-DIA-NATURAL.                                                     
268688     MOVE 08             TO WS-S006-FUNCION                                   
268690     MOVE 1              TO WS-S006-FECHA2                                    
268692     PERFORM 000000-CALL-CALENDAR                                             
268694     MOVE WS-S006-FECHA1 TO WKS-GEN-FECHA.                                    
268696                                                                              
268698 000302-FECHA-FIN.                                                            
268700     MOVE WKS-FECHA-FINAL       TO WS-S006-FECHA1                             
268702     PERFORM 000300-ES-FECHA-HABIL.                                           
268704     IF WKS-FEC-HABIL = 0                                                     
268710        MOVE    WKS-FECHA-FINAL TO WS-S006-FECHA1                             
268712        PERFORM 000300-DIA-HABIL-ANTERIOR                                     
268714        MOVE    WKS-GEN-FECHA   TO WKS-FECHA-FINAL.                           
268716                                                                              
268718 000303-ASIGNA-FECHAS.                                                        
268720     IF WKS-FI-MM > 0                                                         
268722        MOVE MES-DESC(WKS-FI-MM) TO WKS-MES-INI                               
268724        MOVE WKS-FI-DD           TO WKS-DIA-INI.                              
268725     IF WKS-FN-MM > 0                                                         
268726        MOVE MES-DESC(WKS-FN-MM) TO WKS-MES-FIN                               
268728        MOVE WKS-FN-DD           TO WKS-DIA-FIN.                              
268730                                                                              
268900******************************************************************            
269000*                   NUMERO DE SUCURSAL Y CAJA                    *            
269100* PARA COMISIONES: SUCURSAL/CAJA = 0511/71                       *            
269200* PARA REWARDS   : SUCURSAL/CAJA = 0511/72                       *            
269300******************************************************************            
269400 000300-ASIGNA-SUC-CAJ.                                                       
269520     IF(WKS-ESQ-BY-REN OR  WKS-ESQ-BY-SDO) OR                                 
269540       (WKS-ESQ-MIX-SDO OR WKS-ESQ-MIX-REN)                                   
269600         MOVE 0511 TO WKS-NUM-SUC                                             
269700         MOVE   71 TO WKS-NUM-CAJ.                                            
270200                                                                              
270300******************************************************************            
270400*         INICIO PROCESO -  GENERA ARCHIVO TRANSAC-RESP          *            
270500******************************************************************            
270600                                                                              
270700******************************************************************            
270800*          HEADER ARCHIVO ARCHIVO DE RESPUESTA: RCOMIS           *            
270900******************************************************************            
271000 000300-ARMA-HDR-RCOMIS.                                                      
271100     MOVE SPACES           TO WKS-RCOMIS-REG                                  
271200     MOVE            1     TO WKS-RCOMIS-HDR-TIP-REG                          
271300     MOVE 000000000500     TO WKS-RCOMIS-HDR-SISTEM                           
271400     MOVE         0001     TO WKS-RCOMIS-HDR-SEC-ARC                          
271500     MOVE WKS-NODO         TO WKS-RCOMIS-HDR-NODO-ORI                         
271600     MOVE WKS-FEC-ARC-AA   TO WKS-RCOMIS-FEC-AA                               
271700     MOVE WKS-FEC-ARC-MM   TO WKS-RCOMIS-FEC-MM                               
271800     MOVE WKS-FEC-ARC-DD   TO WKS-RCOMIS-FEC-DD                               
271900     MOVE "EPP - RESOLUCION COMISIONES-REWARDS"                               
272000                           TO WKS-RCOMIS-HDR-DEC-SIS                          
272100     WRITE   S500EPP-REG-RCOMIS FROM WKS-RCOMIS-REG.                          
272200                                                                              
272300******************************************************************            
272400*          DETALLE ARCHIVO ARCHIVO DE RESPUESTA: RCOMIS          *            
272500******************************************************************            
272600 000300-ARMA-DET-RCOMIS.                                                      
272700     ADD 1                          TO WKS-CONT-DET-RCOMIS                    
272800     MOVE SPACES                    TO WKS-RCOMIS-REG                         
272900     MOVE  2                        TO WKS-RCOMIS-DET-TIP-REG                 
273000     MOVE WKS-CONT-DET-RCOMIS       TO WKS-RCOMIS-DET-SEQ                     
273100     MOVE WKS-EPP-DET-PROD          TO WKS-RCOMIS-DET-PROD                    
273200     MOVE WKS-EPP-DET-INST          TO WKS-RCOMIS-DET-INST                    
273210                                                                              
273220     IF WSK-ESQ-R = 03                                                        
273230        MOVE WKS-CONT-REWARDS       TO WKS-RCOMIS-DET-MON                     
273240        ADD                 1       TO WKS-CONT-REWARDS                       
273250     ELSE                                                                     
273300        MOVE WKS-EPP-DET-MOND       TO WKS-RCOMIS-DET-MON.                    
273350                                                                              
273400     MOVE WKS-EPP-DET-NUM-CLIENTE   TO WKS-RCOMIS-DET-NUM-CLE                 
273500     MOVE WKS-EPP-DET-NUM-CTO       TO WKS-RCOMIS-DET-NUM-CTO                 
273600     MOVE WKS-EPP-COMI-MOTIVO       TO WKS-RCOMIS-DET-RESP-EVA                
273700     MOVE WKS-EPP-DET-FEC-ULT-CORTE TO WKS-RCOMIS-DET-FEC-CORT                
273800     MOVE WKS-FEC-MAQ               TO WKS-RCOMIS-DET-FEC-RESP                
273900     WRITE S500EPP-REG-RCOMIS       FROM WKS-RCOMIS-REG.                      
274000                                                                              
274100 000300-ARMA-TRL-RCOMIS.                                                      
274200     MOVE SPACES                 TO WKS-RCOMIS-REG                            
274300     MOVE  9                     TO WKS-RCOMIS-TRL-TIP-REG                    
274400     MOVE WKS-CONT-DET-RCOMIS    TO WKS-RCOMIS-TRL-NUM-DET                    
274500     WRITE   S500EPP-REG-RCOMIS  FROM WKS-RCOMIS-REG.                         
274600                                                                              
274700                                                                              
274800000300-ARMA-DET-COMI-ARCLIST.                                                 
274900     MOVE LOW-VALUES                 TO WKS-ARC-LIST-IN                       
275000     MOVE WKS-EPP-DET-PROD           TO WKS-L-PROD                            
275100     MOVE WKS-EPP-DET-INST           TO WKS-L-INST                            
275200     MOVE WKS-EPP-DET-MOND           TO WKS-L-MON                             
275400     MOVE WKS-PROD-IMPORTE           TO WKS-LCOMIS-IMP                        
275500     MOVE WKS-EPP-DET-NUM-SUCDEPTO   TO WKS-LCOMIS-SUC                        
275600     MOVE WKS-EPP-DET-NUM-CTO        TO WKS-LIST-CTO                          
275700     MOVE WKS-NUM-REGLA              TO WKS-LCOMIS-NUM-REG                    
275800     MOVE WKS-EPP-TIP-EXC            TO WKS-LCOMIS-TIP-EXC                    
275900     MOVE WKS-B13P-CP                TO WKS-LCOMIS-CP                         
276000     MOVE WKS-B13P-WAIVER            TO WKS-LCOMIS-WAIVER                     
276100     MOVE WKS-IMP-EXC                TO WKS-LCOMIS-IMP-EXC                    
276200     MOVE WKS-COMI                   TO WKS-LCOMIS-IMP-COMI                   
276300     MOVE WKS-EPP-STATUS-REG         TO WKS-LIST-STATUS                       
276400     MOVE WKS-IND-TOT                TO WKS-LCOMIS-IND-TAB-TOT                
276500     MOVE WKS-EPP-DET-COD-EXC-MANUAL TO WKS-LCOMIS-EXC-MAN-COD                
276600                                                                              
276610     IF WKS-EPP-DET-TIP-EVA = 05                                              
276620        MOVE                  01 TO WKS-LIST-ESQ                              
276630     ELSE                                                                     
276640     IF WKS-EPP-DET-TIP-EVA = 06                                              
276650        MOVE                  02 TO WKS-LIST-ESQ                              
276660     ELSE                                                                     
276670        MOVE WKS-EPP-DET-TIP-EVA TO WKS-LIST-ESQ.                             
276680                                                                              
276700     WRITE S500LISTEPPIN-REG         FROM WKS-ARC-LIST-IN.                    
276800                                                                              
276900000300-ARMA-DET-REW-ARCLIST.                                                  
277000     MOVE LOW-VALUES               TO WKS-ARC-LIST-IN                         
277100     MOVE WKS-EPP-DET-PROD         TO WKS-L-PROD                              
277200     MOVE WKS-EPP-DET-INST         TO WKS-L-INST                              
277300     MOVE WKS-EPP-DET-MOND         TO WKS-L-MON                               
277450     MOVE 03                       TO WKS-LIST-ESQ                            
277500     MOVE WKS-EPP-DET-NUM-SUCDEPTO TO WKS-LREW-SUC                            
277600     MOVE WKS-EPP-DET-NUM-CTO      TO WKS-LIST-CTO                            
277700     MOVE WKS-WAIVER-RW            TO WKS-LREW-WAIVER                         
277800     MOVE WKS-NUM-REGLA            TO WKS-LREW-NUM-REG                        
277900     MOVE WKS-EPP-TIP-EXC          TO WKS-LREW-TIP-EXC                        
278000     MOVE WKS-TIPO-RW              TO WKS-LREW-TIP-REW                        
278100     MOVE WKS-CANAL-RW             TO WKS-LREW-CANAL                          
278200     MOVE WKS-NUM-MOVS-RW          TO WKS-LREW-NUM-MOVS                       
278300     MOVE WKS-REWARD               TO WKS-LREW-IMP-REW                        
278350     MOVE WKS-CP-RW                TO WKS-LREW-CP                             
278400     MOVE WKS-EPP-STATUS-REG       TO WKS-LIST-STATUS                         
278500     MOVE WKS-IND-TOT              TO WKS-LREW-IND-TAB-TOT                    
278600     WRITE S500LISTEPPIN-REG       FROM WKS-ARC-LIST-IN.                      
278700                                                                              
278800                                                                              
278900******************************************************************            
279000*         INICIO PROCESO -  REPORTE EVCOMISI                     *            
279100******************************************************************            
279200 000300-ARMA-REP-EVCOMI.                                                      
279300     PERFORM 000300-VALIDA-CORTE                                              
279400     IF WKS-CONT-LIN > WKS-MAX-LIN                                            
279500        PERFORM 000300-GENERA-HDRS-REP                                        
279600        PERFORM 000300-GENERA-HDRS-DET.                                       
279700     PERFORM 000300-GENERA-DET-REP                                            
279800     ADD 1 TO WKS-CONT-LIN.                                                   
279900                                                                              
280000 000300-VALIDA-CORTE.                                                         
280100     IF(WKS-LIST-ESQ NOT = WKS-EVA-ANT) OR                                    
280200     (WKS-LIST-PROD NOT = WKS-PROD-ANT)                                       
280300             PERFORM 000300-GENERA-CORTE-PROD-ESQ                             
280400             PERFORM 000300-GENERA-HDRS-REP                                   
280500             MOVE WKS-LIST-ESQ  TO WKS-EVA-ANT                                
280600             MOVE WKS-LIST-PROD TO WKS-PROD-ANT                               
280700             PERFORM 000300-GENERA-HDRS-DET.                                  
280800                                                                              
280900* 000300-VAL-CAMBIO-PAG.                                                      
281000*     IF(WKS-CONT-LIN + 15) > WKS-MAX-LIN                                     
281100*             PERFORM 000300-GENERA-HDRS-REP.                                 
281200                                                                              
281300******************************************************************            
281400*          HEADERS LISTADO                                       *            
281500******************************************************************            
281600 000300-ASIG-VAL-HDRS.                                                        
281700     MOVE WKS-FEC-ARC    TO WKS-FEC-LIST                                      
281800                                                                              
281900     MOVE WKS-FEC-MAQ-DD TO WKS-HDR1-DD                                       
282000     MOVE WKS-FEC-MAQ-MM TO WKS-HDR1-MM                                       
282100     MOVE WKS-FEC-MAQ-AA TO WKS-HDR1-AAAA                                     
282200                                                                              
282300     MOVE WKS-FEC-L-DD   TO WKS-HDR2-DD                                       
282400     MOVE WKS-FEC-L-MM   TO WKS-HDR2-MM                                       
282500     MOVE WKS-FEC-L-AA   TO WKS-HDR2-AAAA                                     
282600                                                                              
282700     MOVE WKS-HH         TO WKS-HDR3-HH                                       
282800     MOVE WKS-MM         TO WKS-HDR3-MN                                       
282900     MOVE WKS-SS         TO WKS-HDR3-SG                                       
283000                                                                              
283100     MOVE WKS-HOSTNAME   TO WKS-HDR3-HOST.                                    
283200                                                                              
283300 000300-GENERA-HDRS-REP.                                                      
283301     IF WKS-CONT-PAG > 0                                                      
283302         MOVE SPACES            TO S500REPCOMIS-REG                           
283303         WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-1X BEFORE 1.                
283400     ADD  1                 TO WKS-CONT-PAG                                   
283500     MOVE WKS-CONT-PAG      TO WKS-HDR3-PAG                                   
283600     WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-HDR1 AFTER PAGE                 
283700     WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-HDR2 BEFORE 1                   
283800     WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-HDR3 BEFORE 1.                  
283900     MOVE 3 TO WKS-CONT-LIN.                                                  
284000                                                                              
284100******************************************************************            
284200*          HEADER DEL DETALLE LISTADO                            *            
284300******************************************************************            
284400 000300-GENERA-HDRS-DET.                                                      
284500                                                                              
284600     IF WKS-LIST-ESQ = 03                                                     
284700         PERFORM 000300-HDRS-REWARDS                                          
284800     ELSE                                                                     
284900         PERFORM 000300-HDRS-COMIS.                                           
285000                                                                              
285100 000300-HDRS-REWARDS.                                                         
285200     MOVE SPACES            TO WKS-HDR4-1-ESQ                                 
285300     WRITE S500REPCOMIS-REG FROM WKS-HDR4-1-ESQ BEFORE 1                      
285400     MOVE WKS-L-PROD        TO WKS-HDR4-1-PROD                                
285500     MOVE WKS-L-INST        TO WKS-HDR4-1-INST                                
285600     MOVE WKS-L-MON         TO WKS-HDR4-1-MOND.                               
285700     MOVE "REWARD"          TO WKS-HDR4-1-ESQ                                 
285800     WRITE S500REPCOMIS-REG FROM  WKS-REPCOMIS-HDR4-1 BEFORE 2                
285900     WRITE S500REPCOMIS-REG FROM  WKS-REPCOMIS-HDR5-1 BEFORE 1                
286000     ADD 4 TO WKS-CONT-LIN.                                                   
286100                                                                              
286200 000300-HDRS-COMIS.                                                           
286300     MOVE SPACES             TO WKS-HDR4-ESQ                                  
286400     WRITE S500REPCOMIS-REG  FROM WKS-HDR4-ESQ BEFORE 1                       
286500     MOVE WKS-L-PROD         TO WKS-HDR4-PROD                                 
286600     MOVE WKS-L-INST         TO WKS-HDR4-INST                                 
286700     MOVE WKS-L-MON          TO WKS-HDR4-MOND.                                
286800     IF WKS-LIST-ESQ = 01                                                     
286900         MOVE "RENTA"        TO WKS-HDR4-ESQ                                  
287000     ELSE                                                                     
287100     IF WKS-LIST-ESQ = 02                                                     
287200         MOVE "SALDO"        TO WKS-HDR4-ESQ                                  
287300     ELSE                                                                     
287400         MOVE "ESQ.INVALIDO" TO WKS-HDR4-ESQ.                                 
287500                                                                              
287600     MOVE WKS-LCOMIS-IMP     TO WKS-HDR4-IMP                                  
287700     WRITE S500REPCOMIS-REG  FROM  WKS-REPCOMIS-HDR4 BEFORE 2                 
287800     WRITE S500REPCOMIS-REG  FROM  WKS-REPCOMIS-HDR5 BEFORE 1                 
287900     ADD 4 TO WKS-CONT-LIN.                                                   
288000                                                                              
288100******************************************************************            
288200*          CORTE DE ESQUEMA O PRODUCTO LISTADO                   *            
288300******************************************************************            
288400 000300-GENERA-CORTE-PROD-ESQ.                                                
288420    IF(WKS-CONT-LIN + 15) > WKS-MAX-LIN                                       
288440       PERFORM 000300-GENERA-HDRS-REP.                                        
288460                                                                              
288500     MOVE SPACES TO S500REPCOMIS-REG                                          
288600                                                                              
288700     WRITE S500REPCOMIS-REG BEFORE 1                                          
288800                                                                              
288900     IF WKS-EVA-ANT = 03                                                      
289000         WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-HDR7 BEFORE 1               
289100         PERFORM 000300-TOTALES-REWARDS VARYING WKS-I FROM 1 BY 1             
289200                                  UNTIL WKS-I > 10                            
289300         MOVE "IMP.REWARD.TOTAL:" TO WKS-TOT-IMP-LEY                          
289400         MOVE WKS-TOT-WAIVER      TO WKS-TOT-IMP                              
289500         WRITE S500REPCOMIS-REG   FROM                                        
289600                                WKS-REPCOMIS-TOTALES-IMP BEFORE 1             
289700     ELSE                                                                     
289800         WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-HDR6 BEFORE 1               
289900         PERFORM 000300-TOTALES-COMIS VARYING WKS-I FROM 1 BY 1               
290000                                  UNTIL WKS-I > 12                            
290100         MOVE "IMP.POSTE.TOTAL:" TO WKS-TOT-IMP-LEY                           
290200         MOVE WKS-TOT-POST       TO WKS-TOT-IMP                               
290300         WRITE S500REPCOMIS-REG  FROM                                         
290400                                WKS-REPCOMIS-TOTALES-IMP BEFORE 1.            
290500     ADD  15    TO WKS-CONT-LIN.                                              
290600     MOVE ZEROS TO TAB-TOTALES-COMI, TAB-TOTALES-REW.                         
290700                                                                              
290800 000300-TOTALES-REWARDS.                                                      
290900     IF WKS-I = 01 OR 02                                                      
291000         MOVE SPACES TO WKS-TOT-REW-IMP-WVR                                   
291100     ELSE                                                                     
291200         ADD  TAB-TOT-REW-IMP-WVR(WKS-I)  TO WKS-TOT-WAIVER                   
291300         MOVE TAB-TOT-REW-IMP-WVR(WKS-I)  TO WKS-IMP-WVR.                     
291400                                                                              
291500     MOVE WKS-LEY-REW(WKS-I)       TO WKS-TOT-REW-LEY                         
291600     MOVE TAB-TOT-REW-REGS(WKS-I)  TO WKS-TOT-REW-CONT                        
291700    WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-TOTALES-REW BEFORE 1.            
291800                                                                              
291900 000300-TOTALES-COMIS.                                                        
292000     IF WKS-I = 01 OR 02                                                      
292100         MOVE SPACES TO WKS-TOT-COMIS-IMP-POST,                               
292200                        WKS-TOT-COMIS-IMP-EXC                                 
292300     ELSE                                                                     
292400         ADD WKS-TOT-COMI-IMP-POST(WKS-I)  TO WKS-TOT-POST                    
292500         MOVE WKS-TOT-COMI-IMP-POST(WKS-I) TO WKS-IMP-POST                    
292600         MOVE WKS-TOT-COMI-IMP-EXC(WKS-I)  TO WKS-IMP-EXC-R.                  
292700                                                                              
292800     MOVE WKS-LEY-COMI(WKS-I)      TO WKS-TOT-COMIS-LEY                       
292900     MOVE WKS-TOT-COMI-REGS(WKS-I) TO WKS-TOT-COMIS-CONT                      
293000                                                                              
293100                                                                              
293200    WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-TOTALES-COM BEFORE 1.            
293300                                                                              
293400******************************************************************            
293500*          DETALLE LISTADO:                                      *            
293600******************************************************************            
293700 000300-GENERA-DET-REP.                                                       
293800     MOVE SPACES TO S500REPCOMIS-REG                                          
293900     IF WKS-LIST-STATUS = 01                                                  
294000         MOVE "ERROR."      TO WKS-DET-STATUS, WKS-REW-STATUS                 
294100     ELSE                                                                     
294200        IF WKS-LIST-STATUS = 00                                               
294300             MOVE "DISPER." TO WKS-DET-STATUS, WKS-REW-STATUS                 
294400        ELSE                                                                  
294500           MOVE "-------"   TO WKS-DET-STATUS, WKS-REW-STATUS.                
294600                                                                              
294700     IF WKS-LIST-ESQ = 03                                                     
294800         PERFORM 000300-DETALLE-REWARDS                                       
294900     ELSE                                                                     
295000         PERFORM 000300-DETALLE-COMISION.                                     
295100                                                                              
295200                                                                              
295300 000300-DETALLE-REWARDS.                                                      
295400     MOVE WKS-REP-SUC      TO WKS-REW-SUC                                     
295500     MOVE WKS-REP-NUM-REG  TO WKS-REW-NUM-REGLA                               
295600     MOVE WKS-REP-CTO      TO WKS-REW-CTO                                     
295700     MOVE WKS-REP-DESC     TO WKS-REW-EXC-DESC                                
295800     MOVE WKS-REP-MOVS-REW TO WKS-REW-MOVS                                    
295910                                                                              
295920     IF WKS-LREW-CP = 01                                                      
295930        MOVE WKS-LREW-WAIVER  TO WKS-COMI-FORMAT3                             
295940        MOVE WKS-COMI-FORMAT3 TO WKS-REW-WAIVER                               
295950     ELSE                                                                     
295960     IF WKS-LREW-CP = 02                                                      
295970         MOVE WKS-LREW-WAIVER  TO WKS-COMI-FORMAT4                            
295980         STRING "%"WKS-COMI-FORMAT4                                           
295990         DELIMITED BY SIZE INTO WKS-REW-WAIVER.                               
295995                                                                              
296000     IF WKS-REP-CAN-REW > 0                                                   
296100         MOVE WKS-CAN-DESC(WKS-REP-CAN-REW) TO WKS-REW-CAN.                   
296200     IF WKS-REP-T-REW = 1                                                     
296300         MOVE "MEN."      TO WKS-REW-TIPO                                     
296400     ELSE                                                                     
296500     IF WKS-REP-T-REW = 2                                                     
296600          MOVE "TRAN."    TO WKS-REW-TIPO                                     
296700     ELSE                                                                     
296800          MOVE "N/A"      TO WKS-REW-TIPO.                                    
296900     WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-DET-REW BEFORE 1                
297000     MOVE SPACES TO WKS-VAL-REP.                                              
297100                                                                              
297200 000300-DETALLE-COMISION.                                                     
297300     MOVE WKS-REP-SUC       TO   WKS-DET-SUC                                  
297400     MOVE WKS-REP-CTO       TO   WKS-DET-CTO                                  
297500     MOVE WKS-REP-NUM-REG   TO   WKS-DET-NUM-REGLA                            
297600     MOVE WKS-REP-DESC      TO   WKS-DET-EXC-DESC                             
297700     MOVE WKS-REP-WAIVER    TO   WKS-DET-WAIVER                               
297800     MOVE WKS-REP-C-EXC     TO   WKS-DET-C-EXEN                               
297900     MOVE WKS-REP-C-COMI    TO   WKS-DET-COMISION                             
298000                                                                              
298100     IF(WKS-REP-CP = 1)                                                       
298200         MOVE "CANT."     TO WKS-DET-T-COMI                                   
298300     ELSE                                                                     
298400     IF(WKS-REP-CP = 2)                                                       
298500         MOVE "PORC."     TO WKS-DET-T-COMI                                   
298600     ELSE                                                                     
298700         MOVE "N/A"       TO WKS-DET-T-COMI.                                  
298800                                                                              
298900     WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-DET BEFORE 1.                   
299000                                                                              
299100 0000300-PROCESA-LIST-EPP.                                                    
299200     PERFORM 000300-INICIO-LIST                                               
299300     PERFORM 000300-PROCESA-ARC-LIST                                          
299400     PERFORM 000300-FIN-LIST.                                                 
299500                                                                              
299600 000300-INICIO-LIST.                                                          
299700     MOVE ATTRIBUTE MIXNUMBER OF MYSELF TO WKS-EPPCOMISREW-MIX                
299800     ACCEPT WKS-EPPCOMISREW-FECHA FROM DATE                                   
299900                                                                              
300000     MOVE WKS-NODO          TO WKS-EPPCOMISREW-CSI                            
300120     MOVE WKS-FEC-ARC-AA    TO WKS-EPPCOMISREW-FEC-AA                         
300140     MOVE WKS-FEC-ARC-MM    TO WKS-EPPCOMISREW-FEC-MM                         
300160     MOVE WKS-FEC-ARC-DD    TO WKS-EPPCOMISREW-FEC-DD                         
300200     CHANGE ATTRIBUTE TITLE OF S500EPPCOMISREW                                
300300                            TO WKS-NAME-OF-EPPCOMISREW                        
300400     OPEN INPUT S500LISTEPPIN                                                 
300500     PERFORM 0000-ATTRIBUTES-OF-S500ARCEPP                                    
300600     PERFORM 0000-CALCULA-ESPACIO                                             
300700     PERFORM 0000-SORT-ARC-EPP                                                
300800                                                                              
300900     SET S500EPPCOMISREW(USERBACKUPNAME) TO VALUE TRUE                        
301000                                                                              
301100     OPEN OUTPUT S500EPPCOMISREW                                              
301200     OPEN INPUT S500LISTEPPIN                                                 
301300                                                                              
301400     STRING "P131: INICIA GENERACION DEL LISTADO DE EVALUACION"               
301500     " DE COMISIONES Y REWARDS."                                              
301600     DELIMITED BY SIZE INTO WKS-LOG-MSG                                       
301700     PERFORM 000100-ARMA-MSG-LOG.                                             
301800                                                                              
301900 000300-PROCESA-ARC-LIST.                                                     
302000     PERFORM 000300-INI-VAL-LIST.                                             
302100     PERFORM 000300-ASIG-VAL-HDRS                                             
302200     MOVE ATTRIBUTE LASTRECORD OF S500LISTEPPIN TO WS-I02-LASTREC             
302201     PERFORM 000300-GENERA-HDRS-REP                                           
302300     IF WS-I02-LASTREC < 0                                                    
302400*         PERFORM 000300-GENERA-HDRS-REP                                      
302500         MOVE SPACES TO S500REPCOMIS-REG                                      
302600         WRITE  S500REPCOMIS-REG BEFORE 1                                     
302700         WRITE S500REPCOMIS-REG FROM WKS-REPCOMIS-VACIO BEFORE 1              
302800     ELSE                                                                     
302801         PERFORM 000300-GENERA-HDRS-DET                                       
302900         PERFORM 000300-GENERA-LIST-EPP UNTIL WKS-EOF = 1                     
303000         PERFORM 000300-GENERA-CORTE-PROD-ESQ.                                
303100                                                                              
303200 000300-LEE-ARC-LIST.                                                         
303300     READ S500LISTEPPIN INTO WKS-ARC-LIST-IN                                  
303400                        AT END MOVE 1 TO WKS-EOF.                             
303500                                                                              
303600 000300-INI-VAL-LIST.                                                         
303700     MOVE LOW-VALUES    TO WKS-ARC-LIST-IN,                                   
303800                           WKS-PROD-ANT,                                      
303900                           WKS-EVA-ANT,                                       
304000                           WKS-EOF,                                           
304100                           WKS-VAL-REP.                                       
304200*     MOVE 88            TO WKS-CONT-LIN                                      
304300     PERFORM 000300-LEE-ARC-LIST.                                             
304400     MOVE WKS-LIST-ESQ  TO WKS-EVA-ANT                                        
304500     MOVE WKS-LIST-PROD TO WKS-PROD-ANT.                                      
304600                                                                              
304700 000300-GENERA-LIST-EPP.                                                      
304800     IF WKS-LIST-ESQ = 01 OR 02                                               
304900         PERFORM 000300-ASIGNA-RESP-COMI                                      
305000         PERFORM 000300-VAL-SAL-LIST-COMI-DET                                 
305100     ELSE                                                                     
305200     IF WKS-LIST-ESQ = 03                                                     
305300         PERFORM 000300-ASIGNA-RESP-REW                                       
305400         PERFORM 000300-VAL-SAL-LIST-REW-D                                    
305500     ELSE                                                                     
305600         PERFORM 000300-ASIGNA-RESP-ERROR                                     
305700         PERFORM 000300-VAL-SAL-LIST-COMI-DET.                                
305800                                                                              
305900     PERFORM 000300-ARMA-REP-EVCOMI                                           
306000     PERFORM 000300-TOTALES-LISTADO                                           
306100     PERFORM 000300-LEE-ARC-LIST.                                             
306200                                                                              
306300 000300-ASIGNA-RESP-COMI.                                                     
306400     MOVE SPACES TO WKS-EPP-COMI-MOTIVO.                                      
306500                                                                              
306600     IF WKS-LCOMIS-TIP-EXC > 0 AND WKS-LCOMIS-TIP-EXC < 08                    
306700         MOVE WKS-LCOMIS-CP       TO WKS-B13P-CP                              
306800         MOVE WKS-LCOMIS-IMP-EXC  TO WKS-IMP-EXC                              
306900         MOVE WKS-LCOMIS-IMP-COMI TO WKS-COMI                                 
307000         MOVE WKS-LCOMIS-WAIVER   TO WKS-B13P-WAIVER                          
307100         MOVE WKS-LCOMIS-TIP-EXC  TO WKS-EPP-TIP-EXC                          
307200         PERFORM 000300-ASIGNA-MSG-BY-EXC                                     
307300     ELSE                                                                     
307400     IF WKS-LCOMIS-TIP-EXC = 09                                               
307500         STRING "ERR:PROD["WKS-LIST-PROD WKS-LIST-ESQ                         
307600         "]NOREG.S500B13PREGCOM" DELIMITED BY SIZE                            
307700         INTO WKS-EPP-COMI-MOTIVO                                             
307800     ELSE                                                                     
307900     IF WKS-LCOMIS-TIP-EXC = 10                                               
308000         STRING "ERROR:PROD[" WKS-LIST-PROD WKS-LIST-ESQ                      
308100         "]INACT.S500B13PREGCOM" DELIMITED BY SIZE                            
308200         INTO WKS-EPP-COMI-MOTIVO                                             
308300     ELSE                                                                     
308400     IF WKS-LCOMIS-TIP-EXC = 11                                               
308500         STRING "EX %100.00 X PERIODO DE GRACIA"                              
308600         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
308700     ELSE                                                                     
308800     IF WKS-LCOMIS-TIP-EXC = 12                                               
308900         STRING "EX %100.00 X EXCEPCION MANUAL["                              
309000          WKS-LCOMIS-EXC-MAN-COD"]" DELIMITED BY SIZE INTO                    
309100         WKS-EPP-COMI-MOTIVO                                                  
309200     ELSE                                                                     
309300     IF WKS-LCOMIS-TIP-EXC = 13                                               
309400         MOVE WKS-LCOMIS-IMP TO WKS-COMI-FORMAT                               
309500         STRING "COM "WKS-COMI-FORMAT                                         
309600         " NO CUMPLE CON REGLA" DELIMITED BY SIZE INTO                        
309700         WKS-EPP-COMI-MOTIVO.                                                 
309800                                                                              
309900 000300-ASIGNA-RESP-REW.                                                      
310000     MOVE SPACES           TO WKS-EPP-COMI-MOTIVO                             
310100     IF WKS-LREW-TIP-EXC = 14                                                 
310200         STRING "ERR:PROD["WKS-LIST-PROD"]NOREG.S500B14PREGREW"               
310300         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
310400     ELSE                                                                     
310500     IF WKS-LREW-TIP-EXC = 15                                                 
310600         STRING "ERR:PRO["WKS-LIST-PROD"]INACT.S500B14PREGREWE"               
310700         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                           
310800     ELSE                                                                     
310900     IF WKS-LREW-TIP-EXC = 16                                                 
311000         MOVE WKS-LREW-IMP-REW TO WKS-COMI-FORMAT2                            
311100         MOVE WKS-LREW-WAIVER  TO WKS-COMI-FORMAT3                            
311120         MOVE WKS-LREW-WAIVER  TO WKS-COMI-FORMAT4                            
311140         PERFORM 00300-ASIGNA-RESP-RW                                         
311400     ELSE                                                                     
311500     IF WKS-LREW-TIP-EXC = 17                                                 
311600         STRING "REW: NO CUMPLE CON REGLA"                                    
311700         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                          
311800                                                                              
31181000300-ASIGNA-RESP-RW.                                                         
311820     IF WKS-LREW-CP = 01                                                      
311830        STRING "RW"WKS-COMI-FORMAT3"X RET.IMP:"WKS-COMI-FORMAT2               
311840        DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO                            
311850     ELSE                                                                     
311860     IF WKS-LREW-CP = 02                                                      
311870         STRING "RW"WKS-COMI-FORMAT4"%X RET.IMP:"WKS-COMI-FORMAT2             
311880         DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                          
311890                                                                              
311900                                                                              
312000 000300-ASIGNA-RESP-ERROR.                                                    
312100     MOVE SPACES          TO WKS-EPP-COMI-MOTIVO                              
312200     STRING "ERROR: ESQUEMA INVALIDO["WKS-LIST-ESQ"]"                         
312300     DELIMITED BY SIZE INTO WKS-EPP-COMI-MOTIVO.                              
312400                                                                              
312500 000300-TOTALES-LISTADO.                                                      
312600     IF WKS-LIST-ESQ = 03                                                     
312700         PERFORM 000300-TOTALES-REW                                           
312800     ELSE                                                                     
312900         PERFORM 000300-TOTALES-COMI-ERR.                                     
313000                                                                              
313100 000300-TOTALES-REW.                                                          
313200     MOVE 0 TO WKS-I                                                          
313300     IF WKS-LREW-IND-TAB-TOT > 0                                              
313400         MOVE WKS-LREW-IND-TAB-TOT TO WKS-I                                   
313500         ADD WKS-LREW-IMP-REW      TO TAB-TOT-REW-IMP-WVR(WKS-I)              
313600         ADD 1                     TO TAB-TOT-REW-REGS(WKS-I).                
313700     ADD 1 TO TAB-TOT-REW-REGS(01).                                           
313800                                                                              
313900 000300-TOTALES-COMI-ERR.                                                     
314000     MOVE 0 TO WKS-I                                                          
314100     IF WKS-LCOMIS-IND-TAB-TOT > 0                                            
314200         MOVE WKS-LCOMIS-IND-TAB-TOT TO WKS-I                                 
314300         ADD WKS-LCOMIS-IMP-COMI TO WKS-TOT-COMI-IMP-POST(WKS-I)              
314400         ADD WKS-LCOMIS-IMP-EXC  TO WKS-TOT-COMI-IMP-EXC(WKS-I)               
314500         ADD 1                   TO WKS-TOT-COMI-REGS(WKS-I).                 
314600     ADD 1 TO WKS-TOT-COMI-REGS(01).                                          
314700                                                                              
314800 000300-FIN-LIST.                                                             
314900     CLOSE S500EPPCOMISREW WITH SAVE                                          
315000     CLOSE S500LISTEPPIN   WITH PURGE.                                        
315050     WAIT(30).                                                                
315055     IF WKS-HOSTNAME = "ACYPBETA."                                            
315060        MOVE "ACCESSCODE=90834844/GEML1234; " TO WS-TIT-ACCE                  
315065     ELSE                                                                     
315070        MOVE SPACES                           TO WS-TIT-ACCE.                 
315075     CALL SYSTEM WFL USING WKS-WFL-SYSTEMF.                                   
315100     WAIT(30).                                                                
315200******************************************************************            
315300*         INICIO PROCESO -  ENVIA ARCHIVO RESP                   *            
315400******************************************************************            
315500 000300-ENVIA-ARC-INTE.                                                       
315600     MOVE SPACES               TO WKS-ID-ARCHI                                
315700     MOVE 1                    TO WKS-ARC-ENVIADO                             
315800     MOVE WKS-NAME-OF-RCOMIS   TO WKS-ID-ARCHI                                
315900     PERFORM                   000300-CALL-INTELAR                            
316000     IF WKS-REPS-INTE > ZEROS                                                 
316100         ADD 1  TO WKS-INTENTO-INTE                                           
316200         MOVE 0 TO WKS-ARC-ENVIADO                                            
316300         WAIT(02).                                                            
316400                                                                              
316500******************************************************************            
316600*                           LIB INTELAR                          *            
316700******************************************************************            
316800 000300-CALL-INTELAR.                                                         
316900     CALL "INTELARSND IN ADMONXFERS" USING   WKS-ID-ARCHI                     
317000                                     GIVING  WKS-REPS-INTE.                   
317100                                                                              
317200******************************************************************            
317300*               LECTURA DEL ARCHIVO DE ENTRADA                   *            
317400******************************************************************            
317500 000300-LEE-ARC-TRANSACCIONES.                                                
317600     READ S500ARCEPP INTO WKS-S500EPP-REG                                     
317700                     AT END MOVE 1 TO WKS-EOF.                                
317800                                                                              
317900                                                                              
318000******************************************************************            
318100*        CIERRE DE ARCHIVOS: LISTADO|POSTEO|RESPUESTA            *            
318200******************************************************************            
318300 0003000-CLOSE-ARC.                                                           
318400     CLOSE S500ARCEPP      WITH SAVE                                          
318500     CLOSE S500ARCPOST     WITH SAVE                                          
318600     CLOSE S500ARCEPPR     WITH SAVE                                          
318700     CLOSE S500LISTEPPIN   WITH SAVE.                                         
318750     WAIT(05).                                                                
318800                                                                              
318900******************************************************************            
319000*                OBTENCION DE ERRORES DE LA BD                   *            
319100******************************************************************            
319200 000400-VALIDA-ERROR.                                                         
319300     IF DMSTATUS (OPENERROR)                                                  
319400         STRING "OPEN ERROR ON: " WKS-BD                                      
319500         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
319600         PERFORM 000100-ARMA-MSG-LOG.                                         
319700     IF DMSTATUS (CLOSEERROR)                                                 
319800         STRING "CLOSE ERROR ON: " WKS-BD                                     
319900         DELIMITED BY SIZE INTO WKS-LOG-MSG                                   
320000         PERFORM 000100-ARMA-MSG-LOG.                                         
320100     CALL SYSTEM DMTERMINATE.                                                 
320200                                                                              
320300******************************************************************            
320400*                         FIN DE PROGRAMA                        *            
320500******************************************************************            
320600 0400-END-PROG.                                                               
320700     IF WKS-EXC-ON-OPCON OR WKS-EXC-ON-CORRESOLO                              
320800         PERFORM 000200-CIERRA-S500BD04TARJETAS.                              
320900     STOP RUN.                                                                
321000                                                                              
321100******************************************************************            
321200*                              LIB LJ                            *            
321300******************************************************************            
321400 000400-CALL-LJ.                                                              
321500     CALL "LJ IN DISP" USING  CONTADOR-LJ, MENSAJE-LJ.                        
