000010$SET LIST                                                                     
000810$SET LINEINFO                                                                 
001610$SET ERRORLIST                                                                
003210$SET BDB00R01                                                                 
004010$SET BDB00R02                                                                 
004810$SET BDB00R03                                                                 
005610$SET BDB00R04                                                                 
006410                                                                              
006430$SET BDB00R22                                                                 
006440$SET BDB00R23                                                                 
006450                                                                              
007210$SET BDB02R01                                                                 
008010$SET BDB02R02                                                                 
008810$SET BDB02R03                                                                 
009610                                                                              
009700$SET BDB03R01                                                                 
010410$SET BDB03R02                                                                 
011210$SET BDB03R08                                                                 
012010$SET BDB03R12                                                                 
012810                                                                              
013610$SET BDB06R06                                                                 
014410$SET BDB06R08                                                                 
015210$SET BDB06R11                                                                 
016010                                                                              
016810$SET BDB25R04                                                                 
017610$SET BDB25R12                                                                 
018410                                                                              
019210$SET BDB91                                                                    
020010                                                                              
020810$SET LIBMAPLI                                                                 
021610$SET MAPLIACTLIB015 MAPLIACTLIB025                                            
022410$SET S100VERSIONES                                                            
023210$SET S016L422 S016L422R02 S016L422R01                                         
024010$SET S006LOCSUP  S000LIBLJ                                                    
024810$SET FECHA2000                                                                
025610****************************************************************              
026410*                                                                             
027210* SISTEMA: S500 CAPTACION                                                     
028010* CODIGO DE BATCH P155.                                                       
028810* VERSION JUN/2006 CUENTA UNO.                                                
029610*                                                                             
030410****************************************************************              
031210*       I D E N T I F I C A T I O N      D I V I S I O N.                     
032010****************************************************************              
032810 IDENTIFICATION DIVISION.                                                     
033610 PROGRAM-ID. COMPARATIVO.                                                     
034410                                                                              
035210****************************************************************              
036010*       E N V I R O N M E N T           D I V I S I O N.                      
036810****************************************************************              
037610 ENVIRONMENT DIVISION.                                                        
038410 CONFIGURATION SECTION.                                                       
039210 INPUT-OUTPUT SECTION.                                                        
040010                                                                              
040810****************************************************************              
041610* F I L E    C O N T R O L.                                                   
042410****************************************************************              
043210 FILE-CONTROL.                                                                
044010                                                                              
044810****************************************************************              
045610* ARCHIVO DE CLIENTES A EMPATAR EN EL S500.                                   
046410****************************************************************              
047210     SELECT OPTIONAL CLIENTES        ASSIGN TO DISK.                          
048010                                                                              
048020****************************************************************              
048030* ARCHIVO DE SALIDA, REGISTROS BORRADOS EN BD01/B25.                          
048040****************************************************************              
048050     SELECT REGBORRADOS           ASSIGN TO DISK.                             
048060                                                                              
048810****************************************************************              
049610* ARCHIVO DEL S016 PARA BLOQUEOS POR EXPEDIENTES INCOMPLETOS                  
050410****************************************************************              
051210     SELECT CTESBLOQUEOS             ASSIGN TO DISK                           
052010            ACCESS MODE IS RANDOM                                             
052810            ACTUAL KEY  IS W77-REG-BLOQ.                                      
053610                                                                              
053700****************************************************************              
053800* ARCHIVO DEL S500 PARA CUENTA PRODUCTIVA ESPECIAL                            
053900****************************************************************              
054000     SELECT CPESEC                   ASSIGN TO DISK.                          
054100                                                                              
054410****************************************************************              
055210* D A T A    D I V I S I O N.                                                 
056010****************************************************************              
056810 DATA DIVISION.                                                               
057610                                                                              
058410****************************************************************              
059210* F I L E    S E C T I O N.                                                   
060010****************************************************************              
060810 FILE SECTION.                                                                
061610                                                                              
062410*****************************************************************             
063210* DECLARACION DE LOS CAMPOS MANEJADO EN EL ARCHIVO DE CLIENTES.               
064010*****************************************************************             
064810 FD CLIENTES                                                                  
065610      RECORD CONTAINS 90 CHARACTERS                                           
066410      VALUE OF TITLE IS WS-ETIQ-CTE                                           
067210      DEPENDENTSPECS TRUE.                                                    
068010                                                                              
068810 01  REG-CTES.                                                                
069610    02 CTE-TREG                 PIC 9(02).                                    
070410    02 CTE-HEADER.                                                            
071210       03 CTE-SISTEMA           PIC X(04).                                    
072010       03 CTE-FECPRO            PIC 9(08).                                    
072810       03 CTE-CSI               PIC 9(02).                                    
073610       03 FILLER                PIC X(74).                                    
074410    02 CTE-DETALLE REDEFINES CTE-HEADER.                                      
075210       03 CTE-CSI1              PIC  9(02).                                   
076010       03 CTE-PRD               PIC  9(04).                                   
076810       03 CTE-INS               PIC  9(04).                                   
077610       03 CTE-PRE               PIC  9(04).                                   
078410       03 CTE-CTA               PIC  9(12).                                   
079210       03 CTE-CTEA              PIC  9(12).                                   
080010       03 CTE-CTEN              PIC  9(12).                                   
080810       03 CTE-PMAC              PIC  9(04).                                   
081610       03 CTE-MEDAC             PIC  9(12).                                   
082410       03 FILLER                PIC  9(22).                                   
083210    02 CTE-TRAILER REDEFINES CTE-HEADER.                                      
084010       03 CTE-NUMREG            PIC 9(10).                                    
084810       03 CTE-FECHA             PIC 9(08).                                    
085610       03 CTE-NODO              PIC 9(02).                                    
086410       03 FILLER                PIC X(68).                                    
087210                                                                              
088010****************************************************************              
088810*  FD ARCHIVO DE BLOQUEOS POR EXPEDIENTES INCOMPLETOS          *              
089610****************************************************************              
090410 FD  CTESBLOQUEOS                                                             
091210     VALUE OF                                                                 
092010           DEPENDENTSPECS IS TRUE                                             
092810           TITLE          IS WS-ETIQ-ARCHBLQ.                                 
093610                                                                              
094410 01  FD-REG-CTEBLQ     PIC X(30).                                             
095210                                                                              
095220*****************************************************************             
095230* DECLARACION DEL FD ARCHIVO DE SALIDA BORRADOS  DE  BD01/B25.                
095240*****************************************************************             
095250 FD REGBORRADOS                                                               
095260    RECORD CONTAINS 90 CHARACTERS                                             
095270    BLOCK  CONTAINS 180  RECORDS                                              
095280    VALUE OF TITLE IS WS-ETIQ-BORRAB25.                                       
095290                                                                              
095300 01 REG-BORRADOS       PIC X(90).                                             
095430                                                                              
095440******************************************************************            
095450* DECLARACION DE LOS CAMPOS MANEJADO EN EL ARCHIVO DE CUENTAS CPE.            
095460******************************************************************            
095470 FD CPESEC                                                                    
095480      RECORD CONTAINS 180 CHARACTERS                                          
095490      BLOCK  CONTAINS 90 RECORDS                                              
095500      VALUE OF TITLE IS WS-ETIQ-CPESEC                                        
095510      VALUE OF PROTECTION IS 1.                                               
095520                                                                              
095530 01  WKS-CPESEC-REG.                                                          
095540     05 CPE-TIP-REG       PIC 9(02).                                          
095550     05 CPE-TIP-HEADER.                                                       
095560        10 CPE-NOM-ARC.                                                       
095570           15 CPE-PREF    PIC X(15).                                          
095580           15 CPE-DIAG-1  PIC X(01).                                          
095590           15 CPE-ORIG    PIC 9(02).                                          
095600           15 CPE-DIAG-2  PIC X(01).                                          
095610           15 CPE-DEST    PIC 9(02).                                          
095620           15 CPE-DIAG-3  PIC X(01).                                          
095630           15 CPE-NOMB    PIC X(06).                                          
095640           15 CPE-DIAG-4  PIC X(01).                                          
095650           15 CPE-AAMMDD  PIC 9(06).                                          
095660        10 FILLER         PIC X(143).                                         
095670                                                                              
095680     05 CPE-TIP-DETALLE   REDEFINES                                           
095690        CPE-TIP-HEADER.                                                       
095700        10 CPE-NUM-CTO    PIC 9(12).                                          
095710        10 CPE-CON-COM    PIC 9(06).                                          
095720        10 CPE-DIA-CIC    PIC 9(02).                                          
095730        10 CPE-PRO-CIC    PIC 9(12)V99.                                       
095740        10 CPE-TIP-PER    PIC 9(02).                                          
095750        10 CPE-NOM-CTE    PIC X(36).                                          
095760        10 CPE-STA-CTO    PIC 9(02).                                          
095770        10 CPE-TAS-ANT    PIC 9(03)V9999.                                     
095780        10 CPE-INT-CAP    PIC 9(12)V99.                                       
095790        10 CPE-IMP-RET    PIC 9(12)V99.                                       
095800        10 CPE-TAS-BTA    PIC 9(03)V9999.                                     
095810        10 CPE-CVE-COBRO  PIC 9(02).                                          
095812        10 CPE-IMP-COM-CAP PIC 9(06)V99.                                      
095814        10 FILLER         PIC X(52).                                          
095820                                                                              
095830     05 CPE-TIP-TRAILER   REDEFINES                                           
095840        CPE-TIP-HEADER.                                                       
095850        10 CPE-REG-DET    PIC 9(07).                                          
095860        10 FILLER         PIC X(171).                                         
095870                                                                              
096010****************************************************************              
096810*           D A T A       B A S E      S E C T I O N.                         
097610****************************************************************              
098410 DATA-BASE SECTION.                                                           
099210 DB S500BD01CAPTACION.                                                        
099220 01 S500B00CTRLPASO.                                                          
100010 01 S500B02CONTROL.                                                           
100810 01 S500B03CONTRATOS.                                                         
101610 01 S500B06HISTORICO.                                                         
102410 01 S500B25PGOSPENDPE.                                                        
103210 01 S500B91REINICIO.                                                          
104010                                                                              
104810******************************************************************            
105610*           W O R K I N G           S T O R A G E.                            
106410******************************************************************            
107210 WORKING-STORAGE SECTION.                                                     
108010                                                                              
108810******************************************************************            
109610* VARIABLES UTILIZADAS PARA EL MANEJO DE ERRORES Y CLAVES DE                  
110410* ACCESO A LA BASE DE DATOS.                                                  
111210******************************************************************            
112010 COPY "S500/INC/WOR/25MTP003".                                                
112810 COPY "S500/INC/MAPLI/WOR/15MTP001".                                          
113610                                                                              
114410****************************************************************              
115210* ETIQUETA DEL NOMBRE DEL ARCHIVO DE CLIENTES.                                
116010**************************************************************                
116810 01 WS-ETIQ-CTE.                                                              
117610   02 WS-CTE-TIT     PIC X(16) VALUE                                          
118410                     "(S016)S016/FILE/".                                      
119210   02 WS-CTE-CSI     PIC X(03).                                               
120010   02 WS-CTE-TIT1    PIC X(12) VALUE "/FUSCTASOTS/".                          
120810   02 WS-CTE-FEC     PIC 9(06).                                               
121610   02 FILLER         PIC X(13) VALUE                                          
122410                     " ON CLIENTES ".                                         
123210   02 FILLER         PIC X VALUE ".".                                         
123260                                                                              
123310****************************************************************              
123360* ETIQUETA DEL ARCHIVO SALIDA DE REGISTROS BORRADOS DE BD01/B25.              
123410****************************************************************              
123460 01 WS-ETIQ-BORRAB25.                                                         
123510      02 WS-BR-TIT              PIC X(15) VALUE                               
123560                                "S500/FILE/S500/".                            
123610      02 WS-BR-CSIO             PIC 99.                                       
123660      02 FILLER                 PIC X(1) VALUE "/".                           
123710      02 WS-BR-CSID             PIC 99.                                       
123760      02 FILLER                 PIC X(1) VALUE "/".                           
123810      02 WS-BR-TIT1             PIC X(08) VALUE "B25ELIM/".                   
123860      02 WS-BR-FECHA            PIC 9(6).                                     
123910      02 FILLER                 PIC X VALUE ".".                              
124010                                                                              
124050****************************************************************              
124100* ETIQUETA DEL ARCHIVO SALIDA DE CUENTAS CPE.                                 
124150****************************************************************              
124200 01 WS-ETIQ-CPESEC.                                                           
124250      02 WS-CPE-TIT             PIC X(15) VALUE                               
124300                                "S500/FILE/S500/".                            
124350      02 WS-CPE-CSIO            PIC 99.                                       
124400      02 FILLER                 PIC X(1) VALUE "/".                           
124450      02 WS-CPE-CSID            PIC 99.                                       
124500      02 FILLER                 PIC X(1) VALUE "/".                           
124550      02 WS-CPE-TIT1            PIC X(07) VALUE "CPESEC/".                    
124600      02 WS-CPE-FECHA           PIC 9(6).                                     
124650      02 FILLER                 PIC X VALUE ".".                              
124700                                                                              
124810******************************************************************            
125610* VARIABLE UTILIZADAS EN EL PROCESO.                                          
126410******************************************************************            
127210 77 WS-IND                 PIC 9(02).                                         
128010 77 WS-CSI                 PIC 9(02).                                         
128020 77 WS-BAN-B00             PIC 9     VALUE 0.                                 
128810 77 WS-BAN-B02             PIC 9     VALUE 0.                                 
129610 77 WS-BAN-B03             PIC 9     VALUE 0.                                 
130410 77 WS-BAN-B06             PIC 9     VALUE 0.                                 
131210 77 WS-BAN-B25             PIC 9     VALUE 0.                                 
132010 77 WS-SALDO-TOTAL         PIC 9(10)V99 COMP.                                 
132810 77 WS-ERROR               PIC 9(08).                                         
133610 77 WS-TOTALDEP            PIC 9(20)V99.                                      
134410 77 WS-TOTALRET            PIC 9(20)V99.                                      
135210 77 WS-LASTRECORD          PIC 9(10).                                         
136010 77 WS-SORT-ESPACIO        PIC 9(12).                                         
136810 77 WS-1VEZ                PIC 9.                                             
137610 77 WS-2VEZ                PIC 9.                                             
138410 77 WS-3VEZ                PIC 9.                                             
139210 77 WS-4VEZ                PIC 9.                                             
140010 77 WS-5VEZ                PIC 9.                                             
140810 77 WS-6VEZ                PIC 9.                                             
141610 77 WS-7VEZ                PIC 9.                                             
142410 77 WS-8VEZ                PIC 9.                                             
143210 77 WS-9VEZ                PIC 9.                                             
144010 77 WS-10VEZ               PIC 9.                                             
144810 77 WS-11VEZ               PIC 9.                                             
145610 77 WS-12VEZ               PIC 9.                                             
146410 77 WS-13VEZ               PIC 9.                                             
147210 77 WS-14VEZ               PIC 9.                                             
148010 77 WS-15VEZ               PIC 9.                                             
148810 77 WS-FALLO-BLO           PIC 9      VALUE 0.                                
149610 77 WS-FALLO-EMP           PIC 9      VALUE 0.                                
150410 77 W77-REG-BLOQ           PIC 9(08)  VALUE 0.                                
151210 77 WS-RESL-DIV            PIC 9(4).                                          
152010 77 WS-ES-BISIESTO         PIC 9.                                             
152810 77 WS-TIPOPER             PIC 9(02).                                         
153610 77 WS-NOM-CTE             PIC X(30).                                         
154410 77 WS-CONTADOR            PIC 9 VALUE 0.                                     
155210 77 WS-CONTADOR1           PIC 9 VALUE 0.                                     
156010 77 WS-FIN                 PIC 9 VALUE 0.                                     
156810 77 WS-FIN1                PIC 9 VALUE 0.                                     
157610 77 WS-FIN2                PIC 9 VALUE 0.                                     
158410 77 WS-FIN3                PIC 9 VALUE 0.                                     
159210 77 WS-PRD1                PIC 9(02) VALUE 0.                                 
159310 77 WS-REG-BORRA           PIC 9(10).                                         
159400 77 WS-RESUL               PIC 9(08) VALUE 0.                                 
159500 77 WS-RESIDUO             PIC 9(08) VALUE 0.                                 
159600 77 WS-TOTAL-CPE           PIC 9(08) VALUE 0.                                 
159700 77 WS-FIN-MES             PIC 9(06) VALUE 0.                                 
159710                                                                              
159720 77 W77-STA-BENFE          PIC 9(01).                                         
159722 88 W88-ES-ART61           VALUE 3, 8.                                        
159724 88 W88-NO-ART61           VALUE 0, 1, 6, 7.                                  
159728                                                                              
159730 77 W77-STA-CTO            PIC 9(01).                                         
159732 88 W88-CTO-VIG            VALUE 0, 1.                                        
160010                                                                              
160810*****************************************************************             
161610* CAMPOS UTILIZADOS PARA LA MAPLI.                                            
162410*****************************************************************             
163210 77 WS-NUM-DSET              PIC 9(04)    COMP.                               
164010 77 WS-NUM-ACT01             PIC 9(04)    COMP.                               
164810 77 WS-NUM-ACT02             PIC 9(04)    COMP.                               
165610 77 WS-NUM-ACT03             PIC 9(04)    COMP.                               
166410 77 WS-NUM-ACT04             PIC 9(04)    COMP.                               
167210 77 WS-NUM-ACT05             PIC 9(04)    COMP.                               
168010 77 WS-NUM-ACT06             PIC 9(04)    COMP.                               
168810 77 WS-NUM-ACT07             PIC 9(04)    COMP.                               
169610 77 WS-NUM-ACT08             PIC 9(04)    COMP.                               
170410 77 WS-NUM-ACT09             PIC 9(04)    COMP.                               
171210 77 WS-NUM-ACT10             PIC 9(04)    COMP.                               
172010                                                                              
172810 77 WS-LASTRECORDM              PIC 9(10).                                    
173610 77 WS-LASTRECORDM1             PIC 9(10).                                    
174410 77 WS-LASTRECORDM2             PIC 9(10).                                    
175210 77 WS-LASTRECORDM3             PIC 9(10).                                    
176010 77 WS-LASTRECORDM4             PIC 9(10).                                    
176810 77 WS-LASTRECORDM5             PIC 9(10).                                    
177610 77 WS-LASTRECORDM6             PIC 9(10).                                    
178410 77 WS-LASTRECORDM8             PIC 9(10).                                    
178430                                                                              
178450 01 REG-ELIMINADOS.                                                           
178470    02 WS-TPOREG                 PIC 9(02).                                   
178490    02 WS-HEADER.                                                             
178510      03 WS-FECPRO               PIC 9(08).                                   
178530      03 FILLER                  PIC X(80).                                   
178550    02 WS-DETALLE      REDEFINES WS-HEADER.                                   
178570      03 WS-SISTEMA-ARCH         PIC 9(04).                                   
178590      03 WS-NUM-CONTR            PIC 9(12).                                   
178610      03 WS-IMPORTE-ORI          PIC 9(12)V99.                                
178630      03 WS-SALDO                PIC 9(12)V99.                                
178650      03 WS-FECHA-LTECOBR        PIC 9(08).                                   
178670      03 WS-STATUS               PIC 9(02).                                   
178675      03 WS-HORA-LTECOBRO        PIC 9(06).                                   
178680      03 WS-FECHA-INICOBR        PIC 9(08).                                   
178690      03 FILLER                  PIC X(20).                                   
178710    02 WS-TRAILER     REDEFINES WS-HEADER.                                    
178730      03 WS-NUMREG               PIC 9(10).                                   
178750      03 FILLER                  PIC X(78).                                   
178770                                                                              
179210                                                                              
180010***************************************************************               
180810* CAMPOS PARA EL MANEJO DEL ARCHIVO DEL S016 CON BLOQUEOS POR                 
181610* EXPEDIENTES INCOMPLETOS PARA ACTUALIZAR EN B03.                             
182410***************************************************************               
183210 01 WS-ETIQ-ARCHBLQ.                                                          
184010    02 FILLER            PIC X(21) VALUE "(S016)S016/FILE/S500/".             
184810    02 WS-TITBLQ-CSIO    PIC 99.                                              
185610    02 FILLER            PIC X     VALUE "/".                                 
186410    02 WS-TITBLQ-CSID    PIC 99.                                              
187210    02 FILLER            PIC X(11) VALUE "/MODSTATUS/".                       
188010    02 WS-TITBLQ-FEC     PIC 9(06).                                           
188810    02 FILLER            PIC X(14) VALUE "  ON CLIENTES ".                    
189610    02 FILLER            PIC X     VALUE ".".                                 
190410                                                                              
191210 01 WS-RBLQ-HEADER.                                                           
192010    02 WS-BLQ-R00-TPOREG PIC 9(02) COMP.                                      
192810    02 WS-BLQ-R00-FECPRC PIC 9(08) COMP.                                      
193610    02 WS-BLQ-R00-SISORI PIC 9(04) COMP.                                      
194410    02 WS-BLQ-R00-CSIORI PIC 9(02) COMP.                                      
195210    02 WS-BLQ-R00-SISDES PIC 9(04) COMP.                                      
196010    02 WS-BLQ-R00-CSIDES PIC 9(02) COMP.                                      
196810    02 WS-BLQ-R00-FECREA PIC 9(08) COMP.                                      
197610    02 FILLER            PIC X(15).                                           
198410                                                                              
199210 01 WS-RBLQ-DATOS  REDEFINES  WS-RBLQ-HEADER.                                 
200010    02 WS-BLQ-R01-TPOREG   PIC 9(02) COMP.                                    
200810    02 WS-BLQ-R01-NUMPROD  PIC 9(04) COMP.                                    
201610    02 WS-BLQ-R01-NUMINST  PIC 9(04) COMP.                                    
202410    02 WS-BLQ-R01-MONEDA   PIC 9(02) COMP.                                    
203210    02 WS-BLQ-R01-SUCPROM  PIC 9(04) COMP.                                    
204010    02 WS-BLQ-R01-NUMCTO   PIC 9(12) COMP.                                    
204810    02 WS-BLQ-R01-BLOQUEO  PIC 9(02) COMP.                                    
205610    02 WS-BLQ-R01-RESTRIC  PIC 9(02) COMP.                                    
206410    02 WS-BLQ-R01-TPOMOV   PIC 9(02) COMP.                                    
207210    02 WS-BLQ-R01-PREFMDA  PIC 9(04) COMP.                                    
208010    02 WS-BLQ-R01-CTAMDA   PIC 9(08) COMP.                                    
208810    02 WS-BLQ-R01-CLIENTE  PIC 9(12) COMP.                                    
209610    02 FILLER              PIC X(01).                                         
210410                                                                              
211210 01 WS-RBLQ-TRAILER REDEFINES  WS-RBLQ-HEADER.                                
212010    02 WS-BLQ-R99-TPOREG   PIC 9(02) COMP.                                    
212810    02 WS-BLQ-R99-TOTBLQS  PIC 9(08) COMP.                                    
213610    02 WS-BLQ-R99-TOTREST  PIC 9(08) COMP.                                    
214410    02 WS-BLQ-R99-TOTREGS  PIC 9(08) COMP.                                    
215210    02 FILLER              PIC X(17).                                         
216010                                                                              
216810****************************************************************              
217610* VARIABLES MANEJADAS PARA LA CAPTURA DE HORA Y FECHAS.                       
218410****************************************************************              
219210 01 WS-FEC-CAL-AMD                    PIC 9(08).                              
220010 01 WS-FECCAL-AMD REDEFINES WS-FEC-CAL-AMD.                                   
220210    02 WS-CAL-A                       PIC 9(02).                              
220810    02 WS-CAL-AA                      PIC 9(02).                              
221610    02 WS-CAL-MM                      PIC 99.                                 
222410    02 WS-CAL-DD                      PIC 99.                                 
223210                                                                              
223410 01 WS-FEC-NODO-OP                    PIC 9(08).                              
224010 01 WS-FEC-BLQ-AMD                    PIC 9(08).                              
224810 01 RD-WS-FEC-BLQ-AMD REDEFINES WS-FEC-BLQ-AMD.                               
225610    02 WS-BLQ-AA                      PIC 9(04).                              
226410    02 WS-BLQ-MM                      PIC 99.                                 
227210    02 WS-BLQ-DD                      PIC 99.                                 
228010                                                                              
228810 01 WS-FECHA-DIA-DMA                    PIC 9(08).                            
229610 01 WS-FECHA-DIA-DMA-R REDEFINES WS-FECHA-DIA-DMA.                            
230410    02 WS-DIA-DD                        PIC 99.                               
231210    02 WS-DIA-MM                        PIC 99.                               
232010    02 WS-DIA-AA                        PIC 9(04).                            
232810                                                                              
233610 01 WS-FECHA-DIA-MDA                    PIC 9(08).                            
234410 01 WS-FECHA-DIA-MDA-R REDEFINES WS-FECHA-DIA-MDA.                            
235210    02 WS-DIA-MM1                       PIC 99.                               
236010    02 WS-DIA-DD1                       PIC 99.                               
236810    02 WS-DIA-AA1                       PIC 9(04).                            
237610                                                                              
238410 01 WS-FECHA-DIA-AMD                    PIC 9(08).                            
239210 01 WS-FECHA-DIA-AMD-R REDEFINES WS-FECHA-DIA-AMD.                            
240010    02 WS-DIA-AA2                       PIC 9(04).                            
240810    02 WS-DIA-MM2                       PIC 99.                               
241610    02 WS-DIA-DD2                       PIC 99.                               
242410                                                                              
243210 01 WS-FECHA-PRO-AMD                    PIC 9(08).                            
244010 01 WS-FECHA-PRO-AMD-R REDEFINES WS-FECHA-PRO-AMD.                            
244810    02 WS-PRO-AA                        PIC 9(04).                            
245610    02 WS-PRO-MM                        PIC 99.                               
246410    02 WS-PRO-DD                        PIC 99.                               
247210                                                                              
248010 01 WS-FECHA-PRO-DMA                    PIC 9(08).                            
248810 01 WS-FECHA-PRO-DMA-R REDEFINES WS-FECHA-PRO-DMA.                            
249610    02 WS-PRO-DD1                       PIC 99.                               
250410    02 WS-PRO-MM1                       PIC 99.                               
251210    02 WS-PRO-AA1                       PIC 9(04).                            
252010                                                                              
252210 01 WS-FECHA-PASO2                      PIC 9(08).                            
252810 01 WS-FECHA-PASO                       PIC 9(08).                            
253610 01 WS-PASO-AMD REDEFINES WS-FECHA-PASO.                                      
254410    02 WS-PASO-AA                       PIC 9(04).                            
255210    02 WS-PASO-MM                       PIC 99.                               
256010    02 WS-PASO-DD                       PIC 99.                               
256810                                                                              
257610 01 WS-HORA-01.                                                               
258410    03 WS-HORA-HMSC              PIC 9(08).                                   
259210    03 WS-HORA-HMSC-R REDEFINES  WS-HORA-HMSC.                                
260010       05 WS-HMS                 PIC 9(06).                                   
260810       05 WS-HMS-R REDEFINES WS-HMS.                                          
261610         07 WS-HH                PIC 9(02).                                   
262410         07 WS-MM                PIC 9(02).                                   
263210         07 WS-SS                PIC 9(02).                                   
264010       05 FILLER                 PIC X(02).                                   
264020                                                                              
264040 01  WS-FECHA-PROCE.                                                          
264060     02  WS-FEC-PROCE-AA               PIC 9(004).                            
264080     02  WS-FEC-PROCE-MM               PIC 9(002).                            
264100     02  WS-FEC-PROCE-DD               PIC 9(002).                            
264120 01  WS-FECHA-PROCER REDEFINES WS-FECHA-PROCE                                 
264140                                       PIC 9(08).                             
264160*                                                                             
264180 01  WS-MESES.                                                                
264200     02  FILLER     PIC X(22) VALUE "ENE ENERO           31".                 
264220     02  FILLER     PIC X(22) VALUE "FEB FEBRERO         28".                 
264240     02  FILLER     PIC X(22) VALUE "MAR MARZO           31".                 
264260     02  FILLER     PIC X(22) VALUE "ABR ABRIL           30".                 
264280     02  FILLER     PIC X(22) VALUE "MAY MAYO            31".                 
264300     02  FILLER     PIC X(22) VALUE "JUN JUNIO           30".                 
264320     02  FILLER     PIC X(22) VALUE "JUL JULIO           31".                 
264340     02  FILLER     PIC X(22) VALUE "AGO AGOSTO          31".                 
264360     02  FILLER     PIC X(22) VALUE "SEP SEPTIEMBRE      30".                 
264380     02  FILLER     PIC X(22) VALUE "OCT OCTUBRE         31".                 
264400     02  FILLER     PIC X(22) VALUE "NOV NOVIEMBRE       30".                 
264420     02  FILLER     PIC X(22) VALUE "DIC DICIEMBRE       31".                 
264440                                                                              
264460 01  WS-TABLA-MESES REDEFINES WS-MESES.                                       
264480     02 WS-TABLA-MES OCCURS 12 TIMES.                                         
264500        03 WS-TBL-MES                PIC X(03).                               
264520        03 FILLER                    PIC X(01).                               
264540        03 WS-MES-LARGO              PIC X(15).                               
264560        03 FILLER                    PIC X(01).                               
264580        03 WS-NUM-DIAS               PIC 9(02).                               
264600                                                                              
264610 01  WS-PIM-CTO.                                                              
264612     02 WS-PIM-PRD    PIC 9(04).                                              
264614     02 WS-PIM-INT    PIC 9(04).                                              
264616     02 WS-PIM-MON    PIC 9(03).                                              
264618 01  WS-PIM-PROD      REDEFINES WS-PIM-CTO.                                   
264620     02 WS-QPIM-PROD  PIC 9(11).                                              
264630     88 WS-ES-CTAPROD VALUE 00010003001.                                      
264810                                                                              
265610 01 WKS-CORR-NOR                PIC 9(01) VALUE 0.                            
265660  01 WKS-PARAMETRO.                                                           
265710   02 WKS-PARAM                 PIC 9(09).                                    
265760   02 RD-WKS-PARAM REDEFINES WKS-PARAM.                                       
265810      04 WKS-PARAM-A          PIC 9(02).                                      
265860      04 WKS-PARAM-AA         PIC 9(02).                                      
265910        88 WKS-88-AA            VALUE 0 THRU 99.                              
265960      04 WKS-PARAM-MM         PIC 9(02).                                      
266010        88 WKS-88-MM            VALUE 1 THRU 12.                              
266060      04 WKS-PARAM-DD         PIC 9(02).                                      
266110        88 WKS-88-DD            VALUE 1 THRU 31.                              
266130      04 WKS-IND-B02-ULT-ARC  PIC 9(01).                                      
266160                                                                              
266210  01 WKS-FECH                    PIC 9(01) VALUE 0.                           
266410******************************************************************            
267210*           P R O C E D U R E          D I V I S I O N.                       
268010******************************************************************            
268810 PROCEDURE DIVISION.                                                          
269610********************                                                          
270410                                                                              
271210******************************************************************            
272010****************************************************************              
272810*             R U T I N A          P R I N C I P A L.                         
273610****************************************************************              
274410****************************************************************              
275210                                                                              
276010 00000000-INICIO SECTION.                                                     
276810 00000000-PRINCIPAL.                                                          
276815     MOVE ATTRIBUTE TASKVALUE OF MYSELF TO WKS-PARAM.                         
276820     MOVE 2             TO W77-USO-LIBLJ.                                     
276825     MOVE "S500P155"    TO W77-S000-MY-ID.                                    
276830     MOVE "25MTP006"    TO W77-S000-MY-VERSION WS-0101-MTP-MSG.               
276835     MOVE "P155"        TO WS-0101-PASO-MSG B91-IDPROG.                       
276850     MOVE 0             TO WKS-CORR-NOR.                                      
277610     PERFORM 10000000-LIBRERIAS  THRU 10000000-EXIT.                          
277710     PERFORM 10000011-VALIDA-PAR THRU 10000011-EXIT.                          
277810     IF WKS-CORR-NOR = 1                                                      
278410        PERFORM 20000000-OPEN       THRU 20000000-EXIT                        
279210        PERFORM 50000000-PROCESOS   THRU 50000000-EXIT                        
280010        PERFORM 70000000-CIERRO     THRU 70000000-EXIT.                       
280810     STOP RUN.                                                                
281610                                                                              
282410                                                                              
283210                                                                              
284010                                                                              
284810                                                                              
285610                                                                              
286410****************************************************************              
287210****************************************************************              
288010*                                                                             
288810*     R U T I N A   D E    L L A M A D O   A   L A S                          
289610*  L I B R E R I A S   Q U E   S E R A N   U T I L I Z A D A S                
290410*               P O R   E L   P R O G R A M A.                                
291210*                                                                             
292010****************************************************************              
292810****************************************************************              
293610                                                                              
294410 10000000-LIBRERIAS.                                                          
295210                                                                              
296010******************************************************************            
296810* CHANGE A LA LIBRERIA DE VERSIONES.                                          
297610******************************************************************            
298410   PERFORM 10000100-VERSIONES.                                                
299210                                                                              
300010*****************************************************************             
300810* CHANGE A LA LIBRERIA L422 DE DATOS GRALES. DE CTES.                         
301610*****************************************************************             
302410   PERFORM 10000016-L422.                                                     
303210                                                                              
304010******************************************************************            
304810* CHANGE A LA LIBRARIA DE FECHAS LOCSUP PARA LA PROYECCION DE FEC.            
305610******************************************************************            
306410   PERFORM 10000006-LOCSUP.                                                   
307210                                                                              
308010******************************************************************            
308810* CHANGE A LA LIBRARIA MAPLI PARA MONITOREO DE APLICACIONES.                  
309610******************************************************************            
310410   PERFORM 1000038-S038L035.                                                  
311210                                                                              
312010 10000000-EXIT.                                                               
312810    EXIT.                                                                     
313610                                                                              
314410                                                                              
315210                                                                              
316010                                                                              
316810                                                                              
317610                                                                              
318410******************************************************************            
319210******************************************************************            
320010*                                                                             
320810*                            O P E N.                                         
321610*         R U T I N A S   P A R A   A P E R T U R A S   D E                   
322410*               B A S E   Y   A R C H I V O S.                                
323210*                                                                             
324010******************************************************************            
324810******************************************************************            
325610                                                                              
326410 20000000-OPEN.                                                               
329610                                                                              
330410      MOVE ZEROS                  TO WKS-TB-NUMACT-LIBS.                      
331210      MOVE 20                     TO WKS-NUMACT-LIB(15).                      
332010      MOVE 21                     TO WKS-NUMACT-LIB(25).                      
332810      PERFORM 20000050-CHECO-VER  THRU 20000050-EXIT.                         
333610      PERFORM 20000060-INI-MAPLI  THRU 20000060-EXIT.                         
334410      PERFORM 20000070-ACT01-BD   THRU 20000070-EXIT.                         
335210      PERFORM 20000100-ABRO-BASE  THRU 20000100-EXIT.                         
335220      PERFORM 20000150-VAL-PASO   THRU 20000150-EXIT.                         
336010      PERFORM 20000200-FECHA-PRO  THRU 20000200-EXIT.                         
336110      PERFORM 20000230-ABRO-ARCH  THRU 20000230-EXIT.                         
336810      PERFORM 20000550-FIN-ACT01  THRU 20000550-EXIT.                         
337610 20000000-EXIT.                                                               
338410     EXIT.                                                                    
339210                                                                              
340010******************************************************************            
340810* VERIFICO QUE LA VERSION QUE ESTOY CORRIENDO SEA LA DE VERSIONES.            
341610******************************************************************            
342410 20000050-CHECO-VER.                                                          
343210     PERFORM 20000100-CHECAME-VERSION.                                        
344010     IF S000-CTR-CVEERROR < 0                                                 
346410        MOVE "VER. EJECUTADA DIF. A VERSIONES" TO WS-0101-TEXT-MSG            
347210        PERFORM 70000050-MENSAJE                                              
348010        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
348810 20000050-EXIT.                                                               
349610    EXIT.                                                                     
350410                                                                              
351210******************************************************************            
352010* LIBRERIA MAPLI ENTRY POINT S038L035_01_PROG_INI .                           
352810* FUNCION : PARA INDICAR EL INICIO DE CORRIDA DE UN PROGRAMA                  
353610* Y DARSE DE ALTA EN LA LIBRERIA MAPLI.                                       
354410******************************************************************            
355210 20000060-INI-MAPLI.                                                          
356010     MOVE 1                      TO W77-ID-NUM-COPIA-MAPLI                    
356810     MOVE 1                      TO W77-ID-TPODSP-INFO-MAPLI                  
357610     MOVE 0                      TO W77-ID-ESINI-GRUPO-MAPLI                  
358410     MOVE 06                     TO W77-ID-NUM-GRUPO-MAPLI                    
359210     MOVE "BATCH DIARIO"         TO W77-ID-NOMB-LIB                           
360010     PERFORM 70000950-INI-PGM-MAPLI.                                          
360810 20000060-EXIT.                                                               
361610    EXIT.                                                                     
362410                                                                              
363210******************************************************************            
364010* PRIMERA ACT. TIPO PROC. PARA INDICAR APERTURA DE BASE.                      
364810******************************************************************            
365610 20000070-ACT01-BD.                                                           
366410   MOVE 1                                   TO W77-ID-NUMREG-PROC.            
367210   MOVE 01                                  TO W77-ID-ACTXX-MAPLI             
368010                                                  WS-NUM-ACT01.               
368810   MOVE "ABRO BASE,ARCHIVOS Y OBTENGO DAT.INI" TO W77-ID-NOMB-LIB.            
369610   MOVE "PROC. EJECUTADO DE UNICA VEZ "        TO W77-ID-TXTA-LIB.            
370410   PERFORM 70000910-INIACT-MAPLI.                                             
371210 20000070-EXIT.                                                               
372010   EXIT.                                                                      
372810                                                                              
373610******************************************************************            
374410* ABRO LA BASE DE DATOS DE UPDATE YA QUE SERA ACTUALIZADA.                    
375210******************************************************************            
376010 20000100-ABRO-BASE.                                                          
376810     OPEN UPDATE  S500BD01CAPTACION                                           
377610     ON EXCEPTION                                                             
380010        MOVE "ERROR AL ABRIR LA BASE         " TO WS-0101-TEXT-MSG            
380810        PERFORM 70000050-MENSAJE                                              
381610        CALL SYSTEM DMTERMINATE.                                              
382410                                                                              
382420    SET S500B00CTRLPASO       TO BEGINNING.                                   
383210    SET S500B02CONTROL        TO BEGINNING.                                   
384010    SET S500B03CONTRATOS      TO BEGINNING.                                   
384810    SET S500B06HISTORICO      TO BEGINNING.                                   
385610    SET S500B25PGOSPENDPE     TO BEGINNING.                                   
386410 20000100-EXIT.                                                               
386510                                                                              
386610 20000230-ABRO-ARCH.                                                          
386710*=====================                                                        
386810    OPEN  OUTPUT REGBORRADOS.                                                 
386815    IF B02-NUM-CSI = 04 AND WS-FIN-MES = 1                                    
386820       OPEN OUTPUT CPESEC.                                                    
386830                                                                              
386850                                                                              
386870 20000230-EXIT.                                                               
386890   EXIT.                                                                      
386910                                                                              
387210                                                                              
387220******************************************************************            
387230* VALIDO EL PASO DE B00 PARA VERIFICAR LA SECUENCIA DE LOS PROC.              
387240* LA BASE DEBE SER SALIDA DEL PASO 130.                                       
387250******************************************************************            
387260 20000150-VAL-PASO.                                                           
387270   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
387280   IF WS-STATUS-BASE > 0                                                      
387290     IF WS-STATUS-BASE = 1                                                    
387320       MOVE "ERROR B00CTRLPASO     VACIO    " TO WS-0101-TEXT-MSG             
387330       PERFORM 70000050-MENSAJE                                               
387340       CALL SYSTEM DMTERMINATE                                                
387350     ELSE                                                                     
387380       STRING "ERROR AL HACER LOCK A B00CTRLPASO " ,WS-STATUS-BASE            
387390              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
387400       PERFORM 70000050-MENSAJE                                               
387410       CALL SYSTEM DMTERMINATE.                                               
387420                                                                              
387430   IF B00-NUM-PASO-01 = 130 AND B00-NUM-PASO-02 = 130                         
387435      AND B00-NUM-PASO-03 = 130                                               
387440      MOVE 0 TO B00-NUM-PASO-01                                               
387580   ELSE                                                                       
387610      MOVE "ERROR BASE NO ES SALIDA DEL P130" TO WS-0101-TEXT-MSG             
387620      PERFORM 70000050-MENSAJE                                                
387630      CALL SYSTEM DMTERMINATE.                                                
387640                                                                              
387650   PERFORM 90000000-BEGIN-TRANSACTION.                                        
387660   PERFORM 90000000-B00CTRLPASO-STORE.                                        
387670   PERFORM 90000000-END-TRANSACTIONSYNC.                                      
387700 20000150-EXIT.                                                               
387710    EXIT.                                                                     
387720                                                                              
388010                                                                              
388810******************************************************************            
389610* ACCESO EL DATASET DE CONTROL PARA OBTENER LA FECHA DE PROCESO.              
390410******************************************************************            
391210 20000200-FECHA-PRO.                                                          
392010   PERFORM 90000002-B02CONTROL-FIND                                           
392810   IF WS-STATUS-BASE > 0                                                      
393610     IF WS-STATUS-BASE = 1                                                    
396010       MOVE "ERROR REG. DE CONTROL VACIO    " TO WS-0101-TEXT-MSG             
396810       PERFORM 70000050-MENSAJE                                               
397610       CALL SYSTEM DMTERMINATE                                                
398410     ELSE                                                                     
400810       STRING "ERROR AL HACER FIND A B02 " ,WS-STATUS-BASE                    
401610              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
402410       PERFORM 70000050-MENSAJE                                               
403210       CALL SYSTEM DMTERMINATE.                                               
404010                                                                              
404810     MOVE B02-FECHA-LOTE            TO WS-FECHA-PRO-AMD                       
404910                                       WS-BR-FECHA.                           
404920                                                                              
404940     MOVE B02-FECHA-LINEA           TO WS-FECHA-PROCER.                       
404960     IF WS-PRO-MM NOT = WS-FEC-PROCE-MM                                       
404980        MOVE 1                      TO WS-FIN-MES.                            
405000     IF WS-FEC-PROCE-MM = 01                                                  
405020        MOVE 12                     TO WS-FEC-PROCE-MM                        
405040        MOVE WS-NUM-DIAS (WS-FEC-PROCE-MM) TO WS-FEC-PROCE-DD                 
405060        COMPUTE WS-FEC-PROCE-AA     = WS-FEC-PROCE-AA - 1                     
405080     ELSE                                                                     
405100        COMPUTE WS-FEC-PROCE-MM = WS-FEC-PROCE-MM - 1                         
405120        MOVE WS-NUM-DIAS (WS-FEC-PROCE-MM) TO WS-FEC-PROCE-DD                 
405140        DIVIDE    WS-FEC-PROCE-AA BY 4                                        
405160        GIVING    WS-RESUL                                                    
405180        REMAINDER WS-RESIDUO                                                  
405200        IF WS-RESIDUO = 0                                                     
405220           IF WS-FEC-PROCE-MM = 02                                            
405240              ADD 1                 TO WS-FEC-PROCE-DD.                       
405260     MOVE WS-FECHA-PROCER           TO WS-CPE-FECHA.                          
405280                                                                              
405330     IF B02-ULT-ARCH-APLI(25) > 0                                             
405380        MOVE B02-ULT-ARCH-APLI(25)  TO WS-FEC-NODO-OP                         
405430     ELSE                                                                     
405480        MOVE B02-ULT-ARCH-APLI(12)  TO WS-FEC-NODO-OP.                        
405580                                                                              
405610     MOVE B02-ULT-ARCH-APLI(12)     TO WS-FEC-CAL-AMD.                        
406410     MOVE B02-ULT-ARCH-APLI(13)     TO WS-FEC-BLQ-AMD.                        
407210     MOVE B02-NUM-CSI               TO WS-TITBLQ-CSIO WS-BR-CSIO              
408010                                       WS-TITBLQ-CSID WS-BR-CSID              
408020                                       WS-CSI WS-CPE-CSIO.                    
408810     MOVE 10                        TO WS-CPE-CSID.                           
409610     IF B02-NUM-CSI = 10                                                      
410410        MOVE "VDM"       TO WS-CTE-CSI                                        
411210     ELSE                                                                     
412010        MOVE "MTY"       TO WS-CTE-CSI.                                       
412810                                                                              
413610 20000200-EXIT.                                                               
414410    EXIT.                                                                     
415210                                                                              
432010******************************************************************            
432810* MANDO LLAMAR A LA RUTINA DE SUMA Y FIN DE LA MAPLI EN LA ACT.01.            
433610******************************************************************            
434410 20000550-FIN-ACT01.                                                          
435210   MOVE WS-NUM-ACT01       TO W77-ID-ACTXX-MAPLI.                             
436010   MOVE " "                TO W77-ID-TXTA-LIB.                                
436810   PERFORM 70000950-ACT-REGPROC.                                              
437610                                                                              
438410   MOVE WS-NUM-ACT01       TO W77-ID-ACTXX-MAPLI.                             
439210   PERFORM 70000910-FIN-ACTI-MAPLI.                                           
440010 20000550-EXIT.                                                               
440810   EXIT.                                                                      
441610                                                                              
442410                                                                              
443210                                                                              
444010                                                                              
444810                                                                              
445610                                                                              
446410                                                                              
447210******************************************************************            
448010******************************************************************            
448810*                                                                             
449610* R U T I N A S   D E   L L A M A D O S   A   L I B R E R I A S.              
450410*                                                                             
451210******************************************************************            
452010******************************************************************            
452810 40000000-CALL-L422.                                                          
453610   PERFORM 20000016-L422-S500-02.                                             
454410   IF WS-S016-0102-RESULT > 0                                                 
455210        IF WS-S016-0102-RESULT = 10                                           
460010           MOVE 1                             TO WS-4VEZ                      
460810        ELSE                                                                  
461610           MOVE WS-S016-0102-RESULT            TO WS-MSG-RS                   
464010           STRING "ERROR AL ACCESAR L422  ",   WS-MSG-RS                      
464810                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
465610           PERFORM 70000050-MENSAJE                                           
466410           CALL SYSTEM DMTERMINATE.                                           
467210 40000000-EXIT.                                                               
468010    EXIT.                                                                     
468810                                                                              
469610******************************************************************            
470410* REALIZO EL LLAMADO A LAS LIBRERIA DE FECHAS PARA OBTENER LA FEC.            
471210* CON LA QUE SE DEBE PROCESAR EL ARCHIVO DE CLIENTES.                         
472010******************************************************************            
472810 40000100-CALL-FECPRO.                                                        
473610     PERFORM 20000006-LOCSUP.                                                 
474410     IF WS-S006-FUNCION > 0                                                   
475210        MOVE WS-S006-FUNCION                TO WS-MSG-RS                      
477610        STRING "ERROR AL ACCESAR LOCSUP",   WS-MSG-RS                         
478410               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
479210        PERFORM 70000050-MENSAJE                                              
480010        CALL SYSTEM DMTERMINATE.                                              
480810 40000100-EXIT.                                                               
481610     EXIT.                                                                    
482410                                                                              
483210                                                                              
484010                                                                              
484810                                                                              
485610                                                                              
486410                                                                              
487210****************************************************************              
488010****************************************************************              
488810*                                                                             
489610*                        P R O C E S O S.                                     
490410*  E J E C U C I O N   D E   T O D O S   L O S   P R O C E S O S              
491210*                    D E L   P R O G R A M A.                                 
492010*                                                                             
492810****************************************************************              
493610****************************************************************              
494410                                                                              
495210 50000000-PROCESOS.                                                           
495300     IF B02-NUM-CSI = 04 AND WS-FIN-MES = 1                                   
495400        PERFORM                  50400000-PROCESO-CPESEC THRU                 
495500                                 50400000-EXIT.                               
496010     MOVE 25                            TO W77-ID-NUMDSET-MAPLI               
496810     MOVE 01                            TO W77-ID-NUMBASE-MAPLI               
497610     PERFORM 70000600-REGS-EN-BASE.                                           
498410     MOVE 02                            TO W77-ID-ACTXX-MAPLI                 
499210                                           WS-NUM-ACT02.                      
500010     MOVE "LEO B25(PAGOS PENDIENTES)      "   TO W77-ID-NOMB-LIB              
500810     MOVE "BORRO B25-SALDO=0 Y B25-STATUS=1"  TO W77-ID-TXTA-LIB              
501610     PERFORM 70000910-INIACT-MAPLI.                                           
501710     PERFORM 50500000-GRABO-HDR.                                              
502410     PERFORM 50600000-BORRO-DIA   THRU 50600000-EXIT UNTIL                    
503210             WS-1VEZ = 1.                                                     
503310     PERFORM 51001300-GRABO-TRL.                                              
504010     MOVE WS-NUM-ACT02       TO W77-ID-ACTXX-MAPLI.                           
504810     PERFORM 70000910-FIN-ACTI-MAPLI.                                         
505610                                                                              
506410     PERFORM 50700000-ACT-CTES    THRU 50700000-EXIT UNTIL                    
507210             WS-2VEZ  = 1.                                                    
508010                                                                              
508210     MOVE WS-FECHA-PASO2 TO WS-FECHA-PASO                                     
508310                                                                              
508410     PERFORM 50700000-ASIGNA-NODO-OP.                                         
508510     PERFORM 50700000-ACT-CTES    THRU 50700000-EXIT UNTIL                    
508610             WS-2VEZ  = 1.                                                    
508810     PERFORM 50800000-ACT-BLOQ    THRU 50800000-EXIT.                         
509610                                                                              
509660 50700000-ASIGNA-NODO-OP.                                                     
509710     MOVE 0              TO WS-2VEZ                                           
509760     MOVE WS-FEC-NODO-OP TO WS-FEC-CAL-AMD                                    
509810     IF B02-NUM-CSI = 10                                                      
509860        MOVE "MTY"       TO WS-CTE-CSI                                        
509910        MOVE 04          TO WS-CSI                                            
509960     ELSE                                                                     
510010        MOVE "VDM"       TO WS-CTE-CSI                                        
510060        MOVE 10          TO WS-CSI.                                           
510110                                                                              
510410 50000000-EXIT.                                                               
511210     EXIT.                                                                    
511215                                                                              
511220****************************************************************              
511225****************************************************************              
511230*                                                                             
511235*                        P R O C E S O                                        
511240*        PARA LA GENERACION DEL ARCHIVO MENSUAL CPESEC                        
511245*                                                                             
511250****************************************************************              
511255****************************************************************              
511260                                                                              
511265 50400000-PROCESO-CPESEC.                                                     
511270     PERFORM                     50410000-GRABO-HDR-CPESEC.                   
511275     MOVE 0                      TO WS-1VEZ, WS-TOTAL-CPE.                    
511280     SET S500B03CONTRATOS        TO BEGINNING.                                
511285     PERFORM                     50420000-GENERA-CPESEC THRU                  
511290                                 50420000-EXIT UNTIL WS-1VEZ = 1.             
511295     MOVE 0                      TO WS-1VEZ.                                  
511300     SET S500B03CONTRATOS        TO BEGINNING.                                
511305     PERFORM                     50440000-GRABO-TRL-CPESEC.                   
511310                                                                              
511315 50400000-EXIT.                                                               
511320     EXIT.                                                                    
511325                                                                              
511330 50410000-GRABO-HDR-CPESEC.                                                   
511335*==========================                                                   
511340     MOVE LOW-VALUES             TO WKS-CPESEC-REG.                           
511345     MOVE 1                      TO CPE-TIP-REG.                              
511350     MOVE WS-ETIQ-CPESEC         TO CPE-NOM-ARC.                              
511355     WRITE WKS-CPESEC-REG INVALID KEY                                         
511360        MOVE "ERROR AL GRABAR HDR CPESEC " TO WS-0101-TEXT-MSG                
511365        PERFORM                  70000050-MENSAJE                             
511370        CALL SYSTEM DMTERMINATE.                                              
511375                                                                              
511380 50420000-GENERA-CPESEC.                                                      
511385*=======================                                                      
511390    PERFORM 90000003-B03CONTRATOS-FINDN.                                      
511395    IF WS-DB-NOTERROR                                                         
511397       MOVE B03-STA-BENEF    TO W77-STA-BENFE                                 
511398       MOVE B03-STATUS       TO W77-STA-CTO                                   
511400       MOVE B03-NUM-PRODUCTO TO WS-PIM-PRD                                    
511402       MOVE B03-NUM-INSTRUM  TO WS-PIM-INT                                    
511404       MOVE B03-MONEDA       TO WS-PIM-MON                                    
511405       IF B03-MARCA-CLON = 3                                                  
511406          NEXT SENTENCE                                                       
511407       ELSE                                                                   
511408       IF WS-ES-CTAPROD                                                       
511409      AND W88-CTO-VIG                                                         
511410      AND W88-NO-ART61                                                        
511415          MOVE 2                 TO CPE-TIP-REG                               
511420          MOVE B03-NUM-CONTRATO  TO WS-NUM-CONTRATO                           
511425                                    CPE-NUM-CTO                               
511430          MOVE B03-TIPO-PERSONA  TO CPE-TIP-PER                               
511435          MOVE B03-NOMBRE        TO CPE-NOM-CTE                               
511440          MOVE B03-STATUS        TO CPE-STA-CTO                               
511445          MOVE B03-TASA-ANTERIOR TO CPE-TAS-ANT                               
511450          MOVE B03-INTS-CAPIT    TO CPE-INT-CAP                               
511455          MOVE B03-IMPUESTO-RET  TO CPE-IMP-RET                               
511456          PERFORM 50450000-L422-COMXCTA                                       
511460          PERFORM 90000006-B06SXCTO-FIND                                      
511465          IF WS-DB-NOTERROR                                                   
511470             MOVE B06-CONT-COMIS(50) TO CPE-CON-COM                           
511475             MOVE B06-DIAS-CICLO     TO CPE-DIA-CIC                           
511480             MOVE B06-PROM-CICLO(12) TO CPE-PRO-CIC                           
511485             MOVE B06-TASA-BRUTA     TO CPE-TAS-BTA                           
511490             PERFORM 50430000-GRABO-DET-CPE                                   
511495          ELSE                                                                
511500          IF WS-DB-NOTFOUND                                                   
511505             MOVE 0           TO CPE-CON-COM                                  
511510                                 CPE-DIA-CIC                                  
511515                                 CPE-PRO-CIC                                  
511520                                 CPE-TAS-BTA                                  
511525                                 WS-STATUS-BASE                               
511530             PERFORM 50430000-GRABO-DET-CPE                                   
511535          ELSE                                                                
511540             STRING "ERROR AL LEER B06 EN CPESEC CTO: ",                      
511545                     WS-NUM-CONTRATO,                                         
511550                    ", DMSTATUS: ", WS-STATUS-BASE                            
511555                    DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                   
511560             PERFORM  70000050-MENSAJE                                        
511565             CALL SYSTEM DMTERMINATE                                          
511570       ELSE                                                                   
511575           NEXT SENTENCE                                                      
511580    ELSE                                                                      
511585    IF WS-DB-NOTFOUND                                                         
511590       MOVE 1                TO WS-1VEZ                                       
511595    ELSE                                                                      
511600       STRING "ERROR AL LEER B03 EN CPESEC DMSTATUS: ",                       
511605              WS-STATUS-BASE                                                  
511610              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
511615       PERFORM               70000050-MENSAJE                                 
511620       CALL SYSTEM DMTERMINATE.                                               
511625                                                                              
511630 50420000-EXIT.                                                               
511635*==============                                                               
511640     EXIT.                                                                    
511645                                                                              
511650 50430000-GRABO-DET-CPE.                                                      
511655*=======================                                                      
511660     WRITE WKS-CPESEC-REG INVALID KEY                                         
511665        STRING "ERROR AL GRABAR DET CPESEC CTO: ", WS-NUM-CONTRATO            
511670               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
511675        PERFORM 70000050-MENSAJE                                              
511680        CALL SYSTEM DMTERMINATE.                                              
511685     ADD 1                       TO WS-TOTAL-CPE.                             
511690                                                                              
511695 50440000-GRABO-TRL-CPESEC.                                                   
511700*==========================                                                   
511705     MOVE LOW-VALUES             TO WKS-CPESEC-REG.                           
511710     MOVE 99                     TO CPE-TIP-REG.                              
511715     MOVE WS-TOTAL-CPE           TO CPE-REG-DET.                              
511720     WRITE WKS-CPESEC-REG INVALID KEY                                         
511725        MOVE "ERROR AL GRABAR TRL CPESEC "   TO WS-0101-TEXT-MSG              
511730        PERFORM 70000050-MENSAJE                                              
511735        CALL SYSTEM DMTERMINATE.                                              
511740                                                                              
511750 50450000-L422-COMXCTA.                                                       
511760*======================                                                       
511770    MOVE LOW-VALUES         TO WS-S016-0101-CTR-SALIDA.                       
511780    MOVE 500                TO WS-S016-0101-CTR-NUMSIST-I.                    
511790    MOVE 155                TO WS-S016-0101-CTR-NUMPASO-I                     
511800    MOVE 1                  TO WS-S016-0101-CTA-NUMPROD-I                     
511810    MOVE 3                  TO WS-S016-0101-CTA-CVEINST-I                     
511820    MOVE B03-NUM-CONTRATO   TO WS-S016-0101-CTO-NUM-I                         
511830    PERFORM                 20000016-L422-COMXCTA.                            
511840    IF WS-S016-0101-RESULT-ORIG NOT = 0                                       
511850       MOVE 2               TO CPE-CVE-COBRO                                  
511860       MOVE 100             TO CPE-IMP-COM-CAP                                
511870    ELSE                                                                      
511880       MOVE WS-S016-0101-CVECOBRO(04) TO CPE-CVE-COBRO                        
511890       MOVE WS-S016-0101-COBCOM  (04) TO CPE-IMP-COM-CAP.                     
512010                                                                              
512020 50500000-GRABO-HDR.                                                          
512030*===================                                                          
512040    MOVE  1              TO  WS-TPOREG.                                       
512050    MOVE  B02-FECHA-LOTE TO  WS-FECPRO.                                       
512060                                                                              
512160    WRITE REG-BORRADOS FROM REG-ELIMINADOS   INVALID KEY                      
512260      MOVE "ERROR AL GRABAR HDR BORRADOS "   TO WS-0101-TEXT-MSG              
512360      PERFORM 70000050-MENSAJE                                                
512460      CALL SYSTEM DMTERMINATE.                                                
512560                                                                              
512810***************************************************************               
513610* LEO LA ESTRUCTURA DE PAGOS PENDIENTES, PARA BORRAR TODOS                    
514410* LOS REGS. CUYO SALDO ES IGUAL A 0, O SU ESTATUS = 1(ELIMINADO).             
515210***************************************************************               
516010 50600000-BORRO-DIA.                                                          
516810    PERFORM 90000025-B25PGOSPENDPE-LOCKN                                      
517610    IF WS-STATUS-BASE > 0                                                     
518410      IF WS-STATUS-BASE = 1                                                   
519210         MOVE 1 TO WS-1VEZ                                                    
520010      ELSE                                                                    
522410        STRING "ERROR AL HACER LOCK A B25 ",   WS-STATUS-BASE                 
523210               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
524010        PERFORM 70000050-MENSAJE                                              
524810        CALL SYSTEM DMTERMINATE.                                              
525610                                                                              
526410    IF WS-1VEZ = 1                                                            
527210       NEXT SENTENCE                                                          
528010    ELSE                                                                      
528810       MOVE WS-NUM-ACT02       TO W77-ID-ACTXX-MAPLI                          
529610       MOVE " "                TO W77-ID-TXTA-LIB                             
530410       PERFORM 70000950-ACT-REGPROC                                           
531210       PERFORM 50600100-BORRO      THRU 50600100-EXIT.                        
532010 50600000-EXIT.                                                               
532810   EXIT.                                                                      
533610                                                                              
534410*****************************************************************             
535210* BORRO DE LA BASE LOS REGISTROS DE PAGOS PENDIENTES.                         
536010*****************************************************************             
536810 50600100-BORRO.                                                              
537610    IF (B25-STATUS = 1 OR B25-STATUS = 2) OR                                  
537710       (B25-FECHA-LTECOBR NOT >  WS-FECHA-PRO-AMD) OR                         
537810       ((B25-SALDO = 0) AND (B25-FECHA-LTECOBR = 99999999))                   
538410       MOVE  1   TO WS-BAN-B25                                                
539210       PERFORM 51001100-ACTUALIZO THRU 51001100-EXIT                          
539310       PERFORM 51001200-GEN-ARCH  THRU 51001200-EXIT.                         
540010 50600100-EXIT.                                                               
540810   EXIT.                                                                      
541610                                                                              
542410*****************************************************************             
543210* PROCESO EL ARCHIVO PROVENIENTE DEL S016 PARA EMPATAR ALGUNOS                
544010* CAMBIOS DEL S016 VS. S500.                                                  
544810*****************************************************************             
545610 50700000-ACT-CTES.                                                           
546410    MOVE WS-FEC-CAL-AMD                     TO WS-CTE-FEC                     
547210                                               WS-FECHA-PASO2.                
548010    SET CLIENTES (TITLE)                    TO WS-ETIQ-CTE                    
548810    IF ATTRIBUTE RESIDENT OF CLIENTES IS = VALUE TRUE                         
549610       OPEN INPUT CLIENTES                                                    
550410       MOVE ATTRIBUTE LASTRECORD OF CLIENTES TO WS-LASTRECORDM1               
551210       MOVE WS-LASTRECORDM1                 TO W77-ID-NUMREG-PROC             
552010       MOVE 03                              TO W77-ID-ACTXX-MAPLI             
552810       MOVE 03                              TO WS-NUM-ACT03                   
553610       MOVE "PROC. EL ARCHIVO  DE CLIENTES  "  TO W77-ID-NOMB-LIB             
554410       MOVE "S016/FILE/CSI/FUSCTASOTS/AAMMDD"  TO W77-ID-TXTA-LIB             
555210       PERFORM 70000910-INIACT-MAPLI                                          
556010       MOVE 0                               TO WS-3VEZ                        
556020       MOVE 0                               TO WS-8VEZ                        
556810       SET S500B03CONTRATOS                 TO BEGINNING                      
557610       PERFORM 50701000-OPERO-ARC   THRU    50701000-EXIT UNTIL               
558410       WS-3VEZ = 1                                                            
559210       CLOSE CLIENTES WITH RELEASE                                            
560010       MOVE WS-NUM-ACT03       TO W77-ID-ACTXX-MAPLI                          
560810       PERFORM 70000910-FIN-ACTI-MAPLI                                        
560820       IF WS-2VEZ = 0                                                         
561610          PERFORM 50702000-PROY-FEC THRU    50702000-EXIT                     
562410          IF WS-FEC-CAL-AMD > WS-FECHA-PRO-AMD                                
563210             MOVE 1                 TO WS-2VEZ                                
564010             MOVE WS-FEC-CAL-AMD    TO WS-FECHA-PASO2                         
564020          ELSE                                                                
564030             NEXT SENTENCE                                                    
564810       ELSE                                                                   
565610          NEXT SENTENCE                                                       
566410    ELSE                                                                      
567210       MOVE 1                       TO WS-2VEZ                                
567310       MOVE 1                       TO WS-2VEZ                                
567410       STRING "ARCHIVO: "WS-ETIQ-CTE" NO ECONTRADO"                           
567510       DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                                
567610       PERFORM 70000050-MENSAJE.                                              
567710                                                                              
568010 50700000-EXIT.                                                               
568810    EXIT.                                                                     
569610                                                                              
570410*****************************************************************             
571210* PROCESO EL ARCHIVO DEL S016.                                                
572010*****************************************************************             
572810 50701000-OPERO-ARC.                                                          
572820    PERFORM 50701100-VALHEA THRU 50701100-EXIT                                
572830    IF WS-3VEZ = 0                                                            
572840       PERFORM 50701200-VALDET THRU 50701200-EXIT UNTIL WS-8VEZ= 1            
572850    ELSE                                                                      
572860       NEXT SENTENCE.                                                         
572870 50701000-EXIT.                                                               
572900    EXIT.                                                                     
572910                                                                              
587210*****************************************************************             
588010* VALIDO EL HEADER DEL ARCHIVO DE CLIENTES DE EMPATAMIENTO                    
588810*****************************************************************             
589610 50701100-VALHEA.                                                             
589620    READ CLIENTES AT END                                                      
589650         STRING "ERR ARC.(S016)FUSCTASOTS SIN HEADER "WS-ETIQ-CTE,            
589660                "NO SE APLICA ARC,LEVANTAR A.R. PARA VERIFICAR ",             
589670                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
589680         STOP WS-0101-MENSAJE                                                 
589690         MOVE " "   TO WS-0101-TEXT-MSG                                       
589700         MOVE 1     TO WS-3VEZ                                                
589710         MOVE 1     TO WS-2VEZ.                                               
589720                                                                              
589730    IF WS-3VEZ = 0                                                            
589740       MOVE WS-NUM-ACT03       TO W77-ID-ACTXX-MAPLI                          
589750       MOVE " "                TO W77-ID-TXTA-LIB                             
589760       PERFORM 70000950-ACT-REGPROC                                           
590410       IF (WS-FEC-CAL-AMD = CTE-FECPRO) AND                                   
590420          (WS-CSI = CTE-CSI)                                                  
591210          NEXT SENTENCE                                                       
592010       ELSE                                                                   
593620          STRING "ERR FECEXT E INT ARC "                                      
593625                 "(S016)FUSCTASOTS "WS-ETIQ-CTE,                              
593630                 "NO SE APLICA, LEVANTAR A.R. PARA VERIFICAR ",               
593640              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
593650          STOP WS-0101-MENSAJE                                                
593660          MOVE " " TO WS-0101-TEXT-MSG                                        
593670          MOVE 1 TO WS-3VEZ                                                   
593680          MOVE 1 TO WS-2VEZ.                                                  
596810 50701100-EXIT.                                                               
597610    EXIT.                                                                     
598410                                                                              
598420*****************************************************************             
598425* PROCESO EL DETALLE DEL ARCHIVO DEL S016.                                    
598430*****************************************************************             
598440 50701200-VALDET.                                                             
598450    READ CLIENTES AT END                                                      
598460         MOVE 1 TO WS-3VEZ WS-8VEZ.                                           
598470                                                                              
598480    IF WS-8VEZ = 0                                                            
598490       MOVE WS-NUM-ACT03       TO W77-ID-ACTXX-MAPLI                          
598500       MOVE " "                TO W77-ID-TXTA-LIB                             
598510       PERFORM 70000950-ACT-REGPROC                                           
598520       IF (CTE-PRD = 408) OR (CTE-TREG = 88)                                  
598530           NEXT SENTENCE                                                      
598540       ELSE                                                                   
598560           PERFORM 50703000-CALL    THRU 50703000-EXIT.                       
598570 50701200-EXIT.                                                               
598580    EXIT.                                                                     
598590                                                                              
599210****************************************************************              
600010* PROYECTO LA FECHA DEL SIG. ARCHIVO DE CTES. A PROCESAR                      
600810****************************************************************              
601610 50702000-PROY-FEC.                                                           
602410     MOVE WS-FEC-CAL-AMD       TO    WS-S006-FECHA1                           
603210     MOVE 1                    TO    WS-S006-FECHA2                           
604010     MOVE 13                   TO    WS-S006-FORMATO                          
604810     MOVE 13                   TO    WS-S006-FUNCION                          
605610     PERFORM 40000100-CALL-FECPRO THRU  40000100-EXIT                         
606410     MOVE WS-S006-FECHA1       TO    WS-FEC-CAL-AMD.                          
607210 50702000-EXIT.                                                               
608010     EXIT.                                                                    
608810                                                                              
609610****************************************************************              
610410* REALIZO EL LLAMADO A LA LIB422 PARA OBTENER LOS DATOS GRALES.               
611210* DEL CLIENTE Y ACTUALIZARLO EN MI BASE.                                      
612010****************************************************************              
612810 50703000-CALL.                                                               
613610     MOVE ALL @00@               TO WS-S016-0102-ENTRADA.                     
614410     MOVE 155                    TO WS-S016-0102-CTR-NUMPASO-I                
614510     MOVE CTE-PRD                TO WS-S016-0102-CTA-NUMPROD-I                
614610     MOVE CTE-INS                TO WS-S016-0102-CTA-CVEINST-I                
615210     MOVE CTE-CTA                TO WS-S016-0102-CTO-NUM-I                    
615310     MOVE CTE-PRD                TO WS-MSG-PRD                                
615410     MOVE CTE-INS                TO WS-MSG-INST                               
616010     MOVE CTE-CTA                TO WS-MSG-CTO                                
616110     MOVE CTE-PRD                TO WS-NUM-PRODUCTO                           
616210     MOVE CTE-INS                TO WS-NUM-INSTRUM                            
616810     MOVE CTE-CTA                TO WS-NUM-CONTRATO                           
617610     PERFORM 40000000-CALL-L422.                                              
618410     IF WS-4VEZ = 1                                                           
619210        MOVE 0 TO WS-4VEZ                                                     
620010     ELSE                                                                     
620810         MOVE 0                      TO WS-5VEZ                               
621610         PERFORM 50704000-BUSCO-B03  THRU 50704000-EXIT                       
621630         IF WS-5VEZ = 0                                                       
621640            PERFORM 50705000-MUEVO   THRU 50705000-EXIT.                      
622410 50703000-EXIT.                                                               
623210     EXIT.                                                                    
624010                                                                              
624810******************************************************************            
625610* CON EL CONTRATO LEIDO VOY A BUSCARLO EN LA BASE(B03) PARA PODER             
626410* ACTUALIZAR EL NUMERO DE CLIENTE, Y EL TIPO DE PERSONA CON LOS               
627210* DATOS OBTENIDOS DE LA CONSULTA AL S016.                                     
628010****************************************************************              
628810 50704000-BUSCO-B03.                                                          
629610  PERFORM 90000003-B03SXCTO-LOCK.                                             
630410  IF WS-STATUS-BASE > 0                                                       
631210     IF WS-STATUS-BASE = 1                                                    
632010         MOVE 1                             TO WS-5VEZ                        
632810     ELSE                                                                     
635210         STRING "ERROR AL HACER LOCK A B03",WS-STATUS-BASE                    
636010                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
636810         PERFORM 70000050-MENSAJE                                             
637610         CALL SYSTEM DMTERMINATE.                                             
640810 50704000-EXIT.                                                               
641610    EXIT.                                                                     
642410                                                                              
643210******************************************************************            
644010* ACTUALIZO LOS VALORES DADOS POR CTES. EN B03.                               
644810******************************************************************            
645610 50705000-MUEVO.                                                              
646410     MOVE WS-S016-0102-CVEPERS     TO B03-TIPO-PERSONA.                       
647210     MOVE WS-S016-0102-NUMCTE      TO B03-NUM-CLIENTE.                        
648010     MOVE 1                        TO WS-BAN-B03.                             
648810     PERFORM 51001100-ACTUALIZO    THRU 51001100-EXIT.                        
649610 50705000-EXIT.                                                               
650410   EXIT.                                                                      
651210                                                                              
652010*****************************************************************             
652810* ACTUALIZO EN LA BASE AQUELLOS CONTRATOS QUE DEBAN SER BLOQUEADOS            
653610* POR EXPEDIENTES INCOMPLETOS.                                                
654410*****************************************************************             
655210 50800000-ACT-BLOQ.                                                           
656010   MOVE WS-FEC-BLQ-AMD     TO WS-TITBLQ-FEC.                                  
657610   SET CTESBLOQUEOS    (TITLE)  TO WS-ETIQ-ARCHBLQ.                           
658410   IF ATTRIBUTE RESIDENT OF CTESBLOQUEOS IS = VALUE TRUE                      
659210      OPEN INPUT CTESBLOQUEOS                                                 
660010      MOVE ATTRIBUTE LASTRECORD OF CTESBLOQUEOS TO WS-LASTRECORDM2            
660810      MOVE WS-LASTRECORDM2                   TO W77-ID-NUMREG-PROC            
661610      MOVE 04                                TO W77-ID-ACTXX-MAPLI            
662410      MOVE 04                                TO WS-NUM-ACT04                  
663210      MOVE "PROC. EL ARCHIVO    DE CTESBLO   "  TO W77-ID-NOMB-LIB            
664010      MOVE "S016/FILE/S500/CSIO/CSID/MODSTATUS" TO W77-ID-TXTA-LIB            
664810      PERFORM 70000910-INIACT-MAPLI                                           
664820      MOVE 0                                 TO WS-6VEZ                       
664830      SET S500B03CONTRATOS                   TO BEGINNING                     
664835      SET S500B06HISTORICO                   TO BEGINNING                     
664840      PERFORM 50801000-OPERO-ARC    THRU     50801000-EXIT UNTIL              
664850      WS-6VEZ = 1                                                             
668810      CLOSE CTESBLOQUEOS WITH RELEASE                                         
669610      MOVE WS-NUM-ACT04                      TO W77-ID-ACTXX-MAPLI            
670410      PERFORM 70000910-FIN-ACTI-MAPLI                                         
670412      IF WS-FALLO-BLO = 0                                                     
670420         PERFORM 70000110-PROY-FEC-BLQ       THRU 70000110-EXIT.              
674410 50800000-EXIT.                                                               
675210    EXIT.                                                                     
676010                                                                              
676810****************************************************************              
677610* OPERO EL ARCHIVO DE BLOQUEOS X EXPEDIENTES INCOMPLETOS                      
678410****************************************************************              
678420 50801000-OPERO-ARC.                                                          
678430   PERFORM 50802000-VALHEA-BLQ            THRU 50802000-EXIT                  
678432   IF WS-6VEZ = 0                                                             
678450      PERFORM 50803000-VALTRA-BLQ         THRU 50803000-EXIT                  
678452      IF WS-6VEZ = 0                                                          
678460         PERFORM 50804000-VALDET-BLQ      THRU 50804000-EXIT                  
678461         UNTIL WS-7VEZ = 1                                                    
678462      ELSE                                                                    
678464         NEXT SENTENCE                                                        
678466   ELSE                                                                       
678468      NEXT SENTENCE.                                                          
678470 50801000-EXIT.                                                               
678480   EXIT.                                                                      
678490                                                                              
679100****************************************************************              
679110* VALIDO EL HEADER DEL ARCHIVO DE BLOQUEOS X EXP. INCOMPLETOS.                
679120*****************************************************************             
679210 50802000-VALHEA-BLQ.                                                         
680010     MOVE 1 TO W77-REG-BLOQ.                                                  
680810     READ CTESBLOQUEOS INTO WS-RBLQ-HEADER                                    
681610       INVALID KEY                                                            
681640         STRING "ERR AL ACCESAR HEADER ARC S016/MODSTATUS ",                  
681650                "NO SE APLICA ARC,LEVANTAR A.R. PARA VERIFICAR ",             
681660                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
681670         STOP WS-0101-MENSAJE                                                 
681680         MOVE " "   TO WS-0101-TEXT-MSG                                       
681690         MOVE 1     TO WS-6VEZ                                                
681695         MOVE 1     TO WS-FALLO-BLO.                                          
681700                                                                              
681710     IF WS-6VEZ = 0                                                           
684010        IF WS-BLQ-R00-TPOREG = 1                 AND                          
684810           WS-BLQ-R00-FECPRC = WS-FEC-BLQ-AMD    AND                          
685610           WS-BLQ-R00-SISORI = 0016              AND                          
686410           WS-BLQ-R00-CSIORI = WS-TITBLQ-CSIO    AND                          
687210           WS-BLQ-R00-SISDES = 0500              AND                          
688010           WS-BLQ-R00-CSIDES = WS-TITBLQ-CSID                                 
688810           NEXT SENTENCE                                                      
689610        ELSE                                                                  
689635           STRING "ERR DATOS HEADER ERRONEOS ARC S016/MODSTATUS ",            
689640                  "NO SE APLICA ,LEVANTAR A.R. PARA VERIFICAR ",              
689645                  DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                     
689650           STOP WS-0101-MENSAJE                                               
689655           MOVE " "   TO WS-0101-TEXT-MSG                                     
689660           MOVE 1     TO WS-6VEZ                                              
689661           MOVE 1     TO WS-FALLO-BLO                                         
689662     ELSE                                                                     
689664        NEXT SENTENCE.                                                        
689670 50802000-EXIT.                                                               
689680   EXIT.                                                                      
689690                                                                              
689700******************************************************************            
689710* VALIDO QUE EL ARCHIVO DE BLOQUEOS TENGA TRAILER.                            
689720******************************************************************            
689730 50803000-VALTRA-BLQ.                                                         
689740   MOVE ATTRIBUTE LASTRECORD OF CTESBLOQUEOS TO W77-REG-BLOQ.                 
689750   ADD 1 TO W77-REG-BLOQ.                                                     
689760   READ CTESBLOQUEOS INTO WS-RBLQ-TRAILER                                     
689770     INVALID KEY                                                              
689792       STRING "ERR AL ACCESAR TRAILER  ARC S016/MODSTATUS ",                  
689794              "NO SE APLICA ,LEVANTAR A.R. PARA VERIFICAR ",                  
689796              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
689798       STOP WS-0101-MENSAJE                                                   
689800       MOVE " "   TO WS-0101-TEXT-MSG                                         
689805       MOVE 1     TO WS-6VEZ                                                  
689807       MOVE 1     TO WS-FALLO-BLO.                                            
689810                                                                              
689830   IF WS-6VEZ = 0                                                             
689840     IF WS-BLQ-R99-TPOREG = 99                                                
689850        MOVE 1 TO W77-REG-BLOQ                                                
689860     ELSE                                                                     
689882        STRING "ERROR ARC. SIN TRAILER S016/MODSTATUS ",                      
689884               "NO SE APLICA ,LEVANTAR A.R. PARA VERIFICAR ",                 
689886                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
689888        STOP WS-0101-MENSAJE                                                  
689900        MOVE " "   TO WS-0101-TEXT-MSG                                        
689910        MOVE 1     TO WS-6VEZ                                                 
689915        MOVE 1     TO WS-FALLO-BLO                                            
689920   ELSE                                                                       
689930     NEXT SENTENCE.                                                           
690010 50803000-EXIT.                                                               
690020    EXIT.                                                                     
690030                                                                              
697610**************************************************************                
697620* OPERO EL DETALLE DEL ARC. DE BLOQUEO POR EXPEDIENTES INCOMPLETOS            
697630**************************************************************                
698410 50804000-VALDET-BLQ.                                                         
699210     ADD 1 TO W77-REG-BLOQ.                                                   
700010     READ CTESBLOQUEOS INTO  WS-RBLQ-DATOS                                    
700810          INVALID KEY MOVE 1 TO WS-6VEZ WS-7VEZ.                              
701610                                                                              
702410     IF WS-7VEZ = 0                                                           
703210        MOVE WS-NUM-ACT04       TO W77-ID-ACTXX-MAPLI                         
704010        MOVE " "                TO W77-ID-TXTA-LIB                            
704810        PERFORM 70000950-ACT-REGPROC                                          
705610        IF WS-BLQ-R01-TPOREG = 2                                              
708810           PERFORM 50805000-DAMECTO-BLQS THRU 50805000-EXIT.                  
709610 50804000-EXIT.                                                               
709620    EXIT.                                                                     
710410                                                                              
728010************************************************************                  
728810* ACTUALIZO EN B03 LOS CTOS. QUE VIENEN EN EL ARCHIVO.                        
729610************************************************************                  
730410 50805000-DAMECTO-BLQS.                                                       
731210     MOVE WS-BLQ-R01-NUMCTO  TO WS-NUM-CONTRATO.                              
732010     MOVE 0                  TO WS-5VEZ.                                      
732810     PERFORM 50704000-BUSCO-B03 THRU 50704000-EXIT                            
733610     IF WS-5VEZ = 0                                                           
743210        IF B03-TIPO-BLOQUEO = 15                                              
744010           NEXT SENTENCE                                                      
744810        ELSE                                                                  
745610           PERFORM 50806000-BUSCA-B06  THRU 50806000-EXIT                     
746410           PERFORM 50807000-MUEVE-BLQS THRU 50807000-EXIT.                    
747210 50805000-EXIT.                                                               
747220    EXIT.                                                                     
747230                                                                              
748010***********************************************************                   
748020* BUSCO EL CONTRATO EN B06 PARA ACTUALIZAR ALGUNOS CAMPOS.                    
748030***********************************************************                   
748810 50806000-BUSCA-B06.                                                          
750410     PERFORM 90000006-B06SXCTO-LOCK                                           
751210     IF WS-STATUS-BASE > 0                                                    
752010        IF WS-STATUS-BASE = 1                                                 
754410           STRING  "NO HAY CTO EN B06 ",WS-NUM-CONTRATO                       
755210              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
756010           PERFORM 70000050-MENSAJE                                           
756810           CALL SYSTEM DMTERMINATE                                            
757610        ELSE                                                                  
760010           STRING "ERR LOCK EN B06, ST=",WS-STATUS-BASE                       
760810                  " CTO=" WS-NUM-CONTRATO                                     
761610              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
762410           PERFORM 70000050-MENSAJE                                           
763210           CALL SYSTEM DMTERMINATE.                                           
763220 50806000-EXIT.                                                               
763230    EXIT.                                                                     
764010                                                                              
764810********************************************************                      
764830* ACTUALIZO LAS ESTRUCTURAS DE B03 Y B06 CON LOS CTOS QUE CUMPLEN             
764835* LAS CONDICIONES VALIDAS.                                                    
764840********************************************************                      
765610 50807000-MUEVE-BLQS.                                                         
766410     IF WS-BLQ-R01-TPOMOV = 1                                                 
767210        MOVE 1                  TO B03-STATUS                                 
768010        MOVE 66                 TO B03-TIPO-BLOQUEO                           
768810        MOVE WS-FECHA-PRO-AMD   TO B06-FEC-BLOQUEO                            
769610        MOVE 1                  TO WS-BAN-B03                                 
770410                                   WS-BAN-B06                                 
771210     ELSE                                                                     
772010     IF WS-BLQ-R01-TPOMOV = 2                                                 
772810        MOVE 17                 TO B03-RESTRICCIONES                          
773610        MOVE 1                  TO WS-BAN-B03                                 
774410        IF B03-STATUS       = 1                                               
775210       AND B03-TIPO-BLOQUEO = 66                                              
776010           NEXT SENTENCE                                                      
776810        ELSE                                                                  
777610           MOVE 66               TO B03-TIPO-BLOQUEO                          
778410           MOVE 1                TO B03-STATUS                                
779210           MOVE WS-FECHA-PRO-AMD TO B06-FEC-BLOQUEO                           
780010           MOVE 1                TO WS-BAN-B03                                
780810           MOVE 1                TO WS-BAN-B06.                               
781610                                                                              
782410     PERFORM 51001100-ACTUALIZO THRU  51001100-EXIT.                          
782420 50807000-EXIT.                                                               
783210   EXIT.                                                                      
784010                                                                              
784810*****************************************************************             
785610* ACT. LA BASE DEPENDIENDO DE LA BANDERA DEL DATASET ENCENDIDA                
786410*****************************************************************             
787210 51001100-ACTUALIZO.                                                          
788010    PERFORM 90000000-BEGIN-TRANSACTION.                                       
788020    IF WS-BAN-B00 = 1                                                         
788030      PERFORM 90000000-B00CTRLPASO-STORE                                      
788040      IF WS-STATUS-BASE > 0                                                   
788070         STRING "ERROR AL GRABAR B00CTRLPASO " ,  WS-STATUS-BASE              
788080                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
788090         PERFORM 70000050-MENSAJE                                             
788100         CALL SYSTEM DMTERMINATE                                              
788110      ELSE                                                                    
788120         MOVE 0                                TO WS-BAN-B00.                 
788130                                                                              
788810    IF WS-BAN-B02 = 1                                                         
789610      PERFORM 90000002-B02CONTROL-STORE                                       
790410      IF WS-STATUS-BASE > 0                                                   
792810         STRING "ERROR AL GRABAR B02 " ,       WS-STATUS-BASE                 
793610                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
794410         PERFORM 70000050-MENSAJE                                             
795210         CALL SYSTEM DMTERMINATE                                              
796010      ELSE                                                                    
796810         MOVE 0                                TO WS-BAN-B02.                 
797610                                                                              
798410    IF WS-BAN-B03 = 1                                                         
799210       PERFORM 90000003-B03CONTRATOS-STORE                                    
800010       IF WS-STATUS-BASE > 0                                                  
802410         STRING "ERROR AL GRABAR B03 " ,        WS-STATUS-BASE                
803210                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
804010         PERFORM 70000050-MENSAJE                                             
804810         CALL SYSTEM DMTERMINATE                                              
805610        ELSE                                                                  
806410          MOVE 0                               TO WS-BAN-B03.                 
807210                                                                              
808010     IF WS-BAN-B06 = 1                                                        
808810        PERFORM 90000006-B06HISTORICO-STORE                                   
809610        IF WS-STATUS-BASE > 0                                                 
812010          STRING "ERR STORE  B06 " , WS-STATUS-BASE                           
812810                DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                       
813610          PERFORM 70000050-MENSAJE                                            
814410          CALL SYSTEM DMTERMINATE                                             
815210         ELSE                                                                 
816010           MOVE 0                               TO WS-BAN-B06.                
816810                                                                              
817610    IF WS-BAN-B25 = 1                                                         
818410      PERFORM 90000025-B25PGOSPENDPE-DELETE                                   
819210      IF WS-STATUS-BASE > 0                                                   
821610        STRING "ERROR AL BORRAR B25 " ,        WS-STATUS-BASE                 
822410               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
823210        PERFORM 70000050-MENSAJE                                              
824010        CALL SYSTEM DMTERMINATE                                               
824810      ELSE                                                                    
825610        MOVE 0                                 TO WS-BAN-B25.                 
826410                                                                              
827210     PERFORM 90000000-END-TRANSACTIONNOAU.                                    
828010                                                                              
828810 51001100-EXIT.                                                               
829610    EXIT.                                                                     
829700                                                                              
829710 51001200-GEN-ARCH.                                                           
829720*===================                                                          
829722    ADD   1                 TO  WS-REG-BORRA.                                 
829724    MOVE LOW-VALUES         TO  REG-ELIMINADOS.                               
829725    MOVE  02                TO  WS-TPOREG.                                    
829730    MOVE  B25-NUM-CONTRATO  TO  WS-NUM-CONTR.                                 
829740    MOVE  B25-SISTEMA-ARCH  TO  WS-SISTEMA-ARCH.                              
829750    MOVE  B25-IMPORTE-ORI   TO  WS-IMPORTE-ORI.                               
829760    MOVE  B25-SALDO         TO  WS-SALDO.                                     
829770    MOVE  B25-FECHA-LTECOBR TO  WS-FECHA-LTECOBR.                             
829780    MOVE  B25-STATUS        TO  WS-STATUS.                                    
829782    MOVE  B25-HORA-LTECOBRO TO  WS-HORA-LTECOBRO.                             
829784    MOVE  B25-FECHA-INICOBR TO  WS-FECHA-INICOBR.                             
829790                                                                              
829800    WRITE REG-BORRADOS FROM REG-ELIMINADOS   INVALID KEY                      
829810      MOVE "ERROR AL GRABAR DET BORRADOS "   TO WS-0101-TEXT-MSG              
829820      PERFORM 70000050-MENSAJE                                                
829830      CALL SYSTEM DMTERMINATE.                                                
829840                                                                              
829842 51001200-EXIT.                                                               
829844    EXIT.                                                                     
829846                                                                              
829850 51001300-GRABO-TRL.                                                          
829860*===================                                                          
829865    MOVE LOW-VALUES      TO  REG-ELIMINADOS.                                  
829870    MOVE 09              TO  WS-TPOREG.                                       
829880    MOVE WS-REG-BORRA    TO  WS-NUMREG.                                       
829885                                                                              
829890    WRITE REG-BORRADOS FROM REG-ELIMINADOS   INVALID KEY                      
829900      MOVE "ERROR AL GRABAR TRL BORRADOS "   TO WS-0101-TEXT-MSG              
829910      PERFORM 70000050-MENSAJE                                                
829920      CALL SYSTEM DMTERMINATE.                                                
829980                                                                              
830410****************************************************************              
831210****************************************************************              
832010*                                                                             
832810*      R U T I N A S    F I N A L E S    D E L    P R O C E S O.              
833610*                                                                             
834410****************************************************************              
835210****************************************************************              
836010                                                                              
836810                                                                              
837610                                                                              
838410                                                                              
839210****************************************************************              
840010* EJECUTA LAS RUTINAS NECESARIAS ANTES DE FINALIZAR EL PROCESO.*              
840810****************************************************************              
841610 70000000-CIERRO.                                                             
841700    IF B02-NUM-CSI = 04 AND WS-FIN-MES = 1                                    
841800       CLOSE CPESEC WITH SAVE.                                                
842410    MOVE 1                                TO W77-ID-NUMREG-PROC.              
843210    MOVE 05                               TO W77-ID-ACTXX-MAPLI               
844010                                             WS-NUM-ACT05.                    
844810    MOVE "CIERRO BASE, ARCH.Y ACT.CONTROL(B02)" TO W77-ID-NOMB-LIB            
845610    MOVE "RUTINA DE CIERRE FINAL.             " TO W77-ID-TXTA-LIB            
846410    PERFORM 70000910-INIACT-MAPLI.                                            
847210                                                                              
847220      PERFORM 70000030-ACT-PASO       THRU   70000030-EXIT.                   
848010      PERFORM 70000050-ACT-B02        THRU   70000050-EXIT.                   
848810      PERFORM 70000100-CLOSE          THRU   70000100-EXIT.                   
849610      MOVE WS-NUM-ACT05     TO W77-ID-ACTXX-MAPLI                             
850410      MOVE " "              TO W77-ID-TXTA-LIB                                
851210      PERFORM 70000950-ACT-REGPROC.                                           
852010      CLOSE REGBORRADOS WITH SAVE.                                            
852810    MOVE WS-NUM-ACT05        TO W77-ID-ACTXX-MAPLI.                           
853610    PERFORM 70000910-FIN-ACTI-MAPLI.                                          
854410    PERFORM 70000950-FIN-PGM-MAPLI.                                           
855210 70000000-EXIT.                                                               
856010      EXIT.                                                                   
856810                                                                              
856820*****************************************************************             
856830* GRABO EL PASO QUE FINALIZO EN EL REG. DE B00CTRLPASO SI TODO FUE            
856840* CORRECTO.                                                                   
856850*****************************************************************             
856860 70000030-ACT-PASO.                                                           
856870   SET S500B00CTRLPASO TO BEGINNING.                                          
856880   PERFORM 90000000-B00CTRLPASO-LOCK.                                         
856890   IF WS-STATUS-BASE > 0                                                      
856900     IF WS-STATUS-BASE = 1                                                    
856930       MOVE "ERROR REG. B00CTRLPASO VACIO "  TO WS-0101-TEXT-MSG              
856940       PERFORM 70000050-MENSAJE                                               
856950       CALL SYSTEM DMTERMINATE                                                
856960     ELSE                                                                     
856990       STRING "ERROR AL HACER LOCK A B00",   WS-STATUS-BASE                   
857000       DELIMITED BY SIZE INTO                WS-0101-TEXT-MSG                 
857010       PERFORM 70000050-MENSAJE                                               
857020       CALL SYSTEM DMTERMINATE.                                               
857030                                                                              
857040      MOVE 155                TO B00-NUM-PASO-01  B00-NUM-PASO-02             
857045                                 B00-NUM-PASO-03.                             
857050      MOVE 1                  TO WS-BAN-B00                                   
857060      PERFORM 51001100-ACTUALIZO THRU  51001100-EXIT.                         
857070 70000030-EXIT.                                                               
857080    EXIT.                                                                     
857090                                                                              
857610*****************************************************************             
858410* GRABO EL PASO QUE FINALIZO EN EL REG. DE CONTROL SI TODO FUE                
859210* CORRECTO.                                                                   
860010*****************************************************************             
860810 70000050-ACT-B02.                                                            
861610   SET S500B02CONTROL TO BEGINNING.                                           
862410   PERFORM 90000002-B02CONTROL-LOCK                                           
863210   IF WS-STATUS-BASE > 0                                                      
864010     IF WS-STATUS-BASE = 1                                                    
866410       MOVE "ERROR REG. CONTROL VACIO "      TO WS-0101-TEXT-MSG              
867210       PERFORM 70000050-MENSAJE                                               
868010       CALL SYSTEM DMTERMINATE                                                
868810     ELSE                                                                     
871210       STRING "ERROR AL HACER LOCK A B02",   WS-STATUS-BASE                   
872010              DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                         
872810       PERFORM 70000050-MENSAJE                                               
873610       CALL SYSTEM DMTERMINATE.                                               
874410                                                                              
879210      MOVE WS-FECHA-PASO      TO B02-ULT-ARCH-APLI(12)                        
879215      MOVE WS-FECHA-PASO2     TO B02-ULT-ARCH-APLI(25)                        
879220      MOVE WS-FEC-BLQ-AMD     TO B02-ULT-ARCH-APLI(13)                        
880010      MOVE 1                  TO WS-BAN-B02                                   
880810      PERFORM 51001100-ACTUALIZO THRU  51001100-EXIT.                         
881610 70000050-EXIT.                                                               
882410    EXIT.                                                                     
883210                                                                              
884010****************************************************************              
884810* CIERRO ARCHIVO Y BASE.                                                      
885610****************************************************************              
886410 70000100-CLOSE.                                                              
887210     CLOSE S500BD01CAPTACION                                                  
888010           ON EXCEPTION                                                       
890410           MOVE "ERROR AL CERRAR LA BASE "  TO WS-0101-TEXT-MSG               
891210           PERFORM 70000050-MENSAJE                                           
892010           CALL SYSTEM DMTERMINATE.                                           
892810 70000100-EXIT.                                                               
893610    EXIT.                                                                     
894410                                                                              
895210******************************************************************            
895220* PROYECTO LA FECHA DEL SIGUIENTE ARCHIVO DE BLOQUEOS A PROCESAR.             
895230******************************************************************            
896010 70000110-PROY-FEC-BLQ.                                                       
896810     ADD 1 TO WS-BLQ-MM.                                                      
897610                                                                              
898410     IF WS-BLQ-MM > 12                                                        
899210        MOVE 1  TO WS-BLQ-MM                                                  
900010        ADD  1  TO WS-BLQ-AA.                                                 
900810                                                                              
901610     DIVIDE WS-BLQ-AA BY 4 GIVING WS-RESL-DIV                                 
902410            REMAINDER WS-ES-BISIESTO.                                         
903210                                                                              
904010     IF WS-BLQ-MM = 2                                                         
904810        IF WS-ES-BISIESTO = 0                                                 
905610           MOVE 29 TO WS-BLQ-DD                                               
906410        ELSE                                                                  
907210           MOVE 28 TO WS-BLQ-DD                                               
908010     ELSE                                                                     
908810     IF WS-BLQ-MM = 4 OR 6 OR 9 OR 11                                         
909610        MOVE 30 TO WS-BLQ-DD                                                  
910410     ELSE                                                                     
911210        MOVE 31 TO WS-BLQ-DD.                                                 
911220 70000110-EXIT.                                                               
911230    EXIT.                                                                     
911232                                                                              
911235*-----------------------                                                      
911237 10000011-VALIDA-PAR.                                                         
911240*-----------------------                                                      
911242       IF WKS-PARAM = 1                                                       
911245               STRING "PARAMETRO INVALIDO                   ",                
911247             "        FECHA : AAAAAA-MM-DD, EJEMPLO: 20080102 ",              
911250               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
911252               MOVE  "I" TO  W77-TIPO-DISP                                    
911255               PERFORM 70000050-MENSAJE                                       
911257       ELSE                                                                   
911259          IF WKS-PARAM = 0                                                    
911261             MOVE 1 TO WKS-CORR-NOR                                           
911263          ELSE                                                                
911265             IF ( WKS-PARAM NOT EQUAL 1 ) AND                                 
911267                ( WKS-PARAM NOT EQUAL 0 )                                     
911269                IF WKS-88-AA                                                  
911271                 IF  WKS-88-MM                                                
911273                  IF WKS-88-DD                                                
911275                     PERFORM 20180301-DIA                                     
911280                  ELSE                                                        
911330                      STRING "DIA INVALIDO"                                   
911380                      DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                 
911430                      MOVE  "I" TO  W77-TIPO-DISP                             
911480                      PERFORM 70000050-MENSAJE                                
911530                 ELSE                                                         
911580                       STRING "MES INVALIDO"                                  
911630                       DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                
911680                       MOVE  "I" TO  W77-TIPO-DISP                            
911730                       PERFORM 70000050-MENSAJE                               
911732                ELSE                                                          
911734                        STRING "AÑO INVALIDO"                                 
911736                        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG               
911738                        MOVE  "I" TO  W77-TIPO-DISP                           
911740                        PERFORM 70000050-MENSAJE.                             
911742 10000011-EXIT.                                                               
911744     EXIT.                                                                    
911746*--------------                                                               
911748 20180301-DIA.                                                                
911750*--------------                                                               
911751     MOVE WKS-PARAM-A   TO WS-CAL-A                                           
911752     MOVE WKS-PARAM-AA  TO WS-CAL-AA                                          
911753     MOVE WKS-PARAM-MM  TO WS-CAL-MM                                          
911754     MOVE WKS-PARAM-DD  TO WS-CAL-DD                                          
911755     MOVE WS-FECCAL-AMD TO WS-S006-FECHA1                                     
911756     MOVE 0             TO WS-S006-FECHA2                                     
911757     MOVE 13            TO WS-S006-FORMATO                                    
911758     MOVE 18            TO WS-S006-FUNCION                                    
911760     PERFORM 20000006-LOCSUP.                                                 
911762     IF WS-S006-FUNCION = 0                                                   
911764*        MOVE WS-S006-FECHA1 TO WS-FEC-CAL-AMD                                
911780        IF WS-S006-FECHA1 = 1                                                 
911782           PERFORM 20180301-ACTUALIZA                                         
911784        ELSE                                                                  
911786           STRING "FECHA INHABIL...**"                                        
911788           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                            
911790           MOVE  "I" TO  W77-TIPO-DISP                                        
911792           PERFORM 70000050-MENSAJE                                           
911794     ELSE                                                                     
911796        MOVE WS-S006-FUNCION TO WS-MSG-RS                                     
911798        STRING "FECHA INVALIDA..."                                            
911800        DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                               
911802        MOVE  "I" TO  W77-TIPO-DISP                                           
911804        PERFORM 70000050-MENSAJE.                                             
911806*-------------------                                                          
911808 20180301-ACTUALIZA.                                                          
911810*-------------------                                                          
911812   PERFORM 20180301-ABREBASE.                                                 
911814   SET S500B02CONTROL TO BEGINNING.                                           
911816   PERFORM 20180301-LOCK.                                                     
911817   PERFORM 90000000-BEGIN-TRANSACTION.                                        
911818   IF WKS-IND-B02-ULT-ARC = 0                                                 
911819      MOVE WS-FEC-CAL-AMD TO B02-ULT-ARCH-APLI(12)                            
911820   ELSE                                                                       
911821   IF WKS-IND-B02-ULT-ARC = 1                                                 
911822      MOVE WS-FEC-CAL-AMD TO B02-ULT-ARCH-APLI(25)                            
911823   ELSE                                                                       
911824   IF WKS-IND-B02-ULT-ARC = 2                                                 
911825      MOVE WS-FEC-CAL-AMD TO B02-ULT-ARCH-APLI(12),                           
911826                             B02-ULT-ARCH-APLI(25).                           
911827   PERFORM 20180301-STORE.                                                    
911834   PERFORM 90000000-END-TRANSACTIONNOAU.                                      
911836*------------------                                                           
911838 20180301-ABREBASE.                                                           
911840*------------------                                                           
911842   OPEN UPDATE  S500BD01CAPTACION                                             
911844    ON EXCEPTION                                                              
911846      MOVE "ERROR AL ABRIR LA BASE         " TO WS-0101-TEXT-MSG              
911848      PERFORM 70000050-MENSAJE                                                
911850      CALL SYSTEM DMTERMINATE.                                                
911852*------------------                                                           
911854 20180301-LOCK.                                                               
911856*------------------                                                           
911858     PERFORM 90000002-B02CONTROL-LOCK.                                        
911860     IF WS-STATUS-BASE > 0                                                    
911862        IF WS-STATUS-BASE = 1                                                 
911864           MOVE "ERROR REG. CONTROL VACIO "  TO WS-0101-TEXT-MSG              
911866           PERFORM 70000050-MENSAJE                                           
911868           CALL SYSTEM DMTERMINATE                                            
911870        ELSE                                                                  
911871           STRING "ERROR AL HACER LOCK A B02",   WS-STATUS-BASE               
911872           DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                            
911873           PERFORM 70000050-MENSAJE                                           
911874           CALL SYSTEM DMTERMINATE.                                           
911875*----------------                                                             
911880  20180301-STORE.                                                             
911885*----------------                                                             
911890    PERFORM 90000002-B02CONTROL-STORE.                                        
911895     IF WS-STATUS-BASE > 0                                                    
911900        STRING "ERROR AL GRABAR B00CTRLPASO " ,  WS-STATUS-BASE               
911905               DELIMITED BY SIZE INTO WS-0101-TEXT-MSG                        
911930        PERFORM 70000050-MENSAJE                                              
911980        CALL SYSTEM DMTERMINATE.                                              
912010                                                                              
912810****************************************************************              
913610****************************************************************              
914410* R U T I N A S    P A R A    E L   D E S P L I E G U E   D E                 
915210*                        M S G.                                               
916010****************************************************************              
916810****************************************************************              
917610                                                                              
918410                                                                              
919210                                                                              
920010                                                                              
920810****************************************************************              
921610* COPY QUE CONTIENE LAS RUTINAS DE ACCESO A LA BASE DE DATOS.                 
922410****************************************************************              
923210 COPY "S500/INC/PRO/25MTP004".                                                
924010 COPY "S500/INC/MAPLI/PRO/15MTP001".                                          
924810                                                                              
925610****************************************************************              
