000100$SET OMIT = NOT DIALOGO                                                       
000200*****************************************************************             
000300*                  FORMATOS DE DIALOGO                          *             
000400*****************************************************************             
000500* DIALOGO PARA FRAUD MANAGER ************************************             
000600                                                                              
000700 01  WS-MENSAJE-DIALOGO-FM.                                                   
000800     02 WS-HEADER-FM                 PIC X(0036).                             
000900     02 WS-HDR-AMPLIADO-FM           PIC 9(0012).                             
001000     02 FILLER                       PIC X(0019).                             
001100     02 WS-COMS-LONG-FM              PIC 9(0004).                             
001200     02 FILLER                       PIC X(0007).                             
001300     02 WS-TEXTO-FM                  PIC X(1842).                             
001400*INI FSW                  P07-120 REQ3                    ABARBOSA            
001500     02 WS-TEXTO-FM-R01 REDEFINES WS-TEXTO-FM.                                
001600        03 FILLER                 PIC X(0014).                                
001700        03 WS-DLG-FM-AUTORIZACION PIC 9(0008).                                
001800        03 FILLER                 PIC X(1820).                                
001900 01 WS-MENSAJE-DIALOGO-FM-R01     REDEFINES                                   
002000    WS-MENSAJE-DIALOGO-FM                                        .            
002100    02 WS-HDR-FM                  PIC X(0036)                    .            
002200    02 WS-HDR-FM-AMP              PIC 9(0012)                    .            
002300    02 WS-HDR-FM-SA0              PIC X(0030)                    .            
002400    02 WS-HDR-FM-SA2              PIC X(0047)                    .            
002500    02 WS-TEX-FM                  PIC X(1795)                    .            
002600                                                                              
002700 01  WS-MENSAJE-DIALOGO-S054      PIC X(1920)                    .            
002800 01  WS-MENSAJE-DIALOGO-S054-R01  REDEFINES                                   
002900     WS-MENSAJE-DIALOGO-S054                                     .            
003000     02 WS-HDR-S054               PIC X(0036)                    .            
003100     02 WS-TEX-S054               PIC X(1884)                    .            
003200                                                                              
003300 01  WS-COMS-LNG-CR               PIC 9(0004)                    .            
003305                                                                              
003310 01 WS-MENSAJE-DIALOGO-S100P030.                                              
003315    02 WS-100030-TEXTO.                                                       
003320       03 WS-100030-MCH.                                                      
003325          04 WS-100030-TCDESTINO     PIC 9(06).                               
003330          04 WS-100030-TCORIGEN      PIC 9(06).                               
003335          04 WS-100030-MARCA         PIC X(03).                               
003340          04 WS-100030-TRANCODE      PIC 9(06).                               
003345          04 WS-100030-TRANSACCION.                                           
003350             05 WS-100030-TRANSACCION-V  PIC X(05).                           
003355             05 FILLER                   PIC X(07).                           
003360          04 WS-100030-SIRH          PIC 9(04).                               
003365          04 WS-100030-MASCARA       PIC 9(01).                               
003370          04 WS-100030-NOMINA        PIC 9(08).                               
003375       03 WS-100030-MENSAJE-ORIGINAL PIC X(1920).                             
003400                                                                              
003500*FIN FSW                  P07-120 REQ3                    ABARBOSA            
003600*****************************************************************             
003700*---SIZE 36                                                                   
003800 01  WS-MENSAJE-DIALOGO.                                                      
003900     02 WS-HEADER-SECAS.                                                      
004000        04 WS-HDR-PREFIJO            PIC X.                                   
004100        04 WS-HDR-APLIDESTINO        PIC X   VALUE "0".                       
004200        04 WS-HDR-CSIDESTINO         PIC 9(02).                               
004300        04 WS-HDR-LSN.                                                        
004400           06 WS-HDR-LSNORIGEN       PIC 9(04).                               
004500*INI FSW                  P07-120 REQ3                    ABARBOSA            
004600           06 WS-HDR-LSNORIGEN-R01   REDEFINES                                
004700              WS-HDR-LSNORIGEN                                   .            
004800              08 WS-HDR-LSNORI-NOP   PIC 9(01).                               
004900              08 WS-HDR-LSNORI-COP   PIC X(03).                               
005000*FIN FSW                  P07-120 REQ3                    ABARBOSA            
005100           06 WS-HDR-LSNORIGEN-HEX   REDEFINES WS-HDR-LSNORIGEN               
005200                                     PIC 9(08) COMP.                          
005300        04 WS-HDR-STATION.                                                    
005400           06 WS-HDR-STA-TIPO        PIC X.                                   
005500           06 WS-HDR-STA-SUC         PIC 9(04).                               
005600              88 WS-VINO-DEBANCOMER  VALUE 0859.                              
005700           06 WS-HDR-STA-PRIV        PIC X.                                   
005800           06 WS-HDR-STA-CAJA        PIC 9(02).                               
005900        04 WS-HDR-CSIORIGEN          PIC 9(02).                               
006000        04 WS-HDR-COMPUT-ORIGEN      PIC 9(02).                               
006100        04 WS-HDR-NIVSEG             PIC 9(02).                               
006200        04 WS-HDR-APLIORIGEN         PIC X.                                   
006300        04 WS-HDR-RESULT             PIC 9(02).                               
006400           88 WS-A-TERMINAL          VALUE 01.                                
006500           88 WS-VINO-DEAPLICACION   VALUE 02,04,18.                          
006600           88 WS-VINO-DE3ERNIVEL     VALUE 04.                                
006700           88 WS-A-PANTALLA          VALUE 03.                                
006800           88 WS-A-3ERNIVEL          VALUE 06.                                
006900           88 WS-A-TERMINTEL         VALUE 08.                                
007000           88 WS-VINO-DETERMINAL     VALUE 11,12.                             
007100           88 WS-VINO-DETERMLOCAL    VALUE 11.                                
007200           88 WS-VINO-DETERMREMOTA   VALUE 12.                                
007300           88 WS-VINO-DETERMINTEL    VALUE 18.                                
007400           88 WS-ERROR-APLICACION    VALUE 31,32,33.                          
007500           88 WS-ERROR-ENHEADER      VALUE 21.                                
007600        04 WS-HDR-SCREEN             PIC 9(05).                               
007700        04 WS-HDR-SEGURIDAD          PIC 9(06).                               
007800                                                                              
007900     02 WS-TEXTO                     PIC X(1884).                             
008000     02 WS-TEXTO-TERMINAL REDEFINES  WS-TEXTO.                                
008100        04 WS-HDR-ACA                PIC 9(12).                               
008200        04 WS-PREFIJO REDEFINES WS-HDR-ACA.                                   
008300           06 WS-PREFIJO-CHEQUES     PIC X(02).                               
008400              88 WS-CVE-CHQ-CC       VALUE "CC".                              
008500           06 WS-PREFIJO-CHEQUES-R REDEFINES                                  
008600              WS-PREFIJO-CHEQUES.                                             
008700              08 WS-PREFIJO-CHQ      PIC X(01).                               
008800                 88 WS-CVE-CHQ-IGUAL VALUE "=".                               
008900              08 WS-PREFIJO-CHQ-FILL PIC X(01).                               
009000           06 WS-PREFIJO-FILLER      PIC X(10).                               
009100        04 WS-NOM-PANTALLA           PIC X(05).                               
009200           88 WS-CVE-50002           VALUE "50002".                           
009300           88 WS-CVE-50003           VALUE "50003".                           
009400           88 WS-CVE-50004           VALUE "50004".                           
009500           88 WS-CVE-50005           VALUE "50005".                           
009600           88 WS-CVE-50006           VALUE "50006".                           
009700           88 WS-CVE-50007           VALUE "50007".                           
009800           88 WS-CVE-50008           VALUE "50008".                           
009900           88 WS-CVE-50009           VALUE "50009".                           
010000           88 WS-CVE-50010           VALUE "50010".                           
010050           88 WS-CVE-50018           VALUE "50018".                           
010100           88 WS-CVE-50019           VALUE "50019".                           
010200           88 WS-CVE-50021           VALUE "50021".                           
010300           88 WS-CVE-50022           VALUE "50022".                           
010400           88 WS-CVE-50023           VALUE "50023".                           
010500           88 WS-CVE-50024           VALUE "50024".                           
010600           88 WS-CVE-50025           VALUE "50025".                           
010700           88 WS-CVE-50026           VALUE "50026".                           
010800           88 WS-CVE-50027           VALUE "50027".                           
010900           88 WS-CVE-50028           VALUE "50028".                           
011000           88 WS-CVE-50029           VALUE "50029".                           
011100           88 WS-CVE-50031           VALUE "50031".                           
011200           88 WS-CVE-50032           VALUE "50032".                           
011300           88 WS-CVE-50033           VALUE "50033".                           
011400           88 WS-CVE-50034           VALUE "50034".                           
011500           88 WS-CVE-50035           VALUE "50035".                           
011600           88 WS-CVE-50036           VALUE "50036".                           
011700           88 WS-CVE-50037           VALUE "50037".                           
011800           88 WS-CVE-50038           VALUE "50038".                           
011900           88 WS-CVE-50039           VALUE "50039".                           
012000           88 WS-CVE-50040           VALUE "50040".                           
012100           88 WS-CVE-50041           VALUE "50041".                           
012200           88 WS-CVE-50042           VALUE "50042".                           
012300           88 WS-CVE-50043           VALUE "50043".                           
012400           88 WS-CVE-50044           VALUE "50044".                           
012500           88 WS-CVE-50045           VALUE "50045".                           
012600           88 WS-CVE-50046           VALUE "50046".                           
012700           88 WS-CVE-50047           VALUE "50047".                           
012800           88 WS-CVE-50048           VALUE "50048".                           
012900           88 WS-CVE-50049           VALUE "50049".                           
013000           88 WS-CVE-50050           VALUE "50050".                           
013100           88 WS-CVE-50051           VALUE "50051".                           
013200           88 WS-CVE-50052           VALUE "50052".                           
013300           88 WS-CVE-50053           VALUE "50053".                           
013400           88 WS-CVE-50054           VALUE "50054".                           
013500           88 WS-CVE-50055           VALUE "50055".                           
013600           88 WS-CVE-50056           VALUE "50056".                           
013700           88 WS-CVE-50057           VALUE "50057".                           
013800           88 WS-CVE-50058           VALUE "50058".                           
013900           88 WS-CVE-50059           VALUE "50059".                           
014000           88 WS-CVE-50061           VALUE "50061".                           
014100           88 WS-CVE-50062           VALUE "50062".                           
014200           88 WS-CVE-50063           VALUE "50063".                           
014300           88 WS-CVE-50064           VALUE "50064".                           
014400           88 WS-CVE-50065           VALUE "50065".                           
014500           88 WS-CVE-50070           VALUE "50070".                           
014600           88 WS-CVE-50071           VALUE "50071".                           
014700           88 WS-CVE-50072           VALUE "50072".                           
014800           88 WS-CVE-50074           VALUE "50074".                           
014900           88 WS-CVE-50076           VALUE "50076".                           
015000           88 WS-CVE-50077           VALUE "50077".                           
015100           88 WS-CVE-50078           VALUE "50078".                           
015200           88 WS-CVE-50079           VALUE "50079".                           
015250           88 WS-CVE-50080           VALUE "50080".                           
015300           88 WS-CVE-50081           VALUE "50081".                           
015400           88 WS-CVE-50082           VALUE "50082".                           
015500           88 WS-CVE-50083           VALUE "50083".                           
015600           88 WS-CVE-50084           VALUE "50084".                           
015700           88 WS-CVE-50085           VALUE "50085".                           
015800           88 WS-CVE-50087           VALUE "50087".                           
015900           88 WS-CVE-50088           VALUE "50088".                           
016000           88 WS-CVE-50090           VALUE "50090".                           
016100           88 WS-CVE-50091           VALUE "50091".                           
016200           88 WS-CVE-50092           VALUE "50092".                           
016300           88 WS-CVE-50093           VALUE "50093".                           
016400           88 WS-CVE-50094           VALUE "50094".                           
016500           88 WS-CVE-50095           VALUE "50095".                           
016600           88 WS-CVE-50096           VALUE "50096".                           
016700           88 WS-CVE-50097           VALUE "50097".                           
016800           88 WS-CVE-50098           VALUE "50098".                           
016805*INI SRA Proy Control Depósitos y retiros Q0500Z4                             
016810           88 WS-CVE-500Z4           VALUE "500Z4".                           
016815*FIN SRA Proy Control Depósitos y retiros Q0500Z4                             
016817*FIN ECC PROY ISILOANS Q0500Z7                                                
016818           88 WS-CVE-500Z7           VALUE "500Z7".                           
016819*FIN ECC PROY ISILOANS Q0500Z7                                                
016820           88 WS-CVE-500Z1           VALUE "500Z1".                           
016830           88 WS-CVE-500Z2           VALUE "500Z2".                           
016840           88 WS-CVE-500Z3           VALUE "500Z3".                           
016900        04 WS-NOM-PANTALLA-N REDEFINES                                        
017000           WS-NOM-PANTALLA.                                                   
017100           06 WS-NP-SISTEMA          PIC 9(03).                               
017200           06 WS-NP-NUM-PANT         PIC 9(02).                               
017300        04 FILLER                    PIC X(09).                               
017400        04 WS-TEXTO-UNSTRING         PIC X(915).                              
017500        04 WS-TEXTO-UNSTRING-R REDEFINES WS-TEXTO-UNSTRING.                   
017600           06 WS-TEXTO-X-CHAR        PIC X(01) OCCURS 915 TIMES.              
017700        04 WS-TEXTO-UNSTRING-R2 REDEFINES WS-TEXTO-UNSTRING.                  
017800           06 FILLER                 PIC X(02).                               
017900           06 WS-CVE-NODO            PIC 9(02).                               
018000           06 FILLER                 PIC X(911).                              
018100        04 FILLER                    PIC X(943).                              
018102                                                                              
018104     02 WS-TEXTO-UNSTRING-R3 REDEFINES WS-TEXTO.                              
018106        04 FILLER                    PIC X(18).                               
018108        04 WS-KEY-Z7                 PIC X(01).                               
018110        04 FILLER                    PIC X(1865).                             
018200                                                                              
018300     02 WS-TEXTO-APLICACION REDEFINES WS-TEXTO.                               
018400*---SIZE 12                                                                   
018500        04 WS-HDR-AMPLIADO.                                                   
018600           06 WS-HDRAMP-TCDESTINO    PIC 9(06).                               
018700              88 WS-TC-S001-CONT     VALUE 000100.                            
018800              88 WS-TC-S001-CONS     VALUE 000101.                            
018900              88 WS-TC-CONT-NOCONT   VALUE 050010.                            
018950              88 WS-TC-CONT-NOCONT16 VALUE 050016.                            
019000              88 WS-TC-CONSULTAS     VALUE 050014.                            
019100           06 WS-HDRAMP-TCORIGEN     PIC 9(06).                               
019200              88 WS-TC-ORI-S500      VALUE 050010.                            
019300                                                                              
019400*---SIZE 30                                                                   
019500        04 WS-MSG-SA0.                                                        
019600           06 WS-SA0-COD-DESTINO          PIC 9(09).                          
019700           06 WS-SA0-COD-DESTR REDEFINES  WS-SA0-COD-DESTINO.                 
019800              08 WS-SA0-DES-APLI          PIC 9(04).                          
019900              08 WS-SA0-DES-CODIGO        PIC 9(02).                          
020000                 88 WS-COD-CONSMONETARIA  VALUE 01.                           
020100                 88 WS-COD-CARGO          VALUE 10.                           
020200                 88 WS-COD-ELIMCARGO      VALUE 11.                           
020300                 88 WS-COD-ABONO          VALUE 20.                           
020400                 88 WS-COD-ELIMABONO      VALUE 21.                           
020500                 88 WS-COD-AUTORIZACION   VALUE 30.                           
020600                 88 WS-COD-ELIMAUTORIZ    VALUE 31.                           
020700                 88 WS-COD-BAJA           VALUE 61.                           
020800                 88 WS-COD-MOVNOCONTABLE  VALUE 70.                           
020900                 88 WS-COD-ELIMNOCONTABLE VALUE 71.                           
021000                 88 WS-COD-ELIMCVES028    VALUE 72.                           
021100                 88 WS-COD-P015           VALUE 73,74.                        
021200                 88 WS-COD-CTRL           VALUE 75.                           
021300                 88 WS-COD-NOCONT-TERM    VALUE 76.                           
021400                 88 WS-COD-CONTABLE       VALUE 10,11,20,21.                  
021500                 88 WS-COD-NOCONTABLE     VALUE 30,31,70,71.                  
021600              08 WS-SA0-DES-SUBCODIGO     PIC 9(03).                          
021700           06 WS-SA0-COD-ORIGEN           PIC 9(09).                          
021800           06 WS-SA0-COD-ORIGR REDEFINES  WS-SA0-COD-ORIGEN.                  
021900              08 WS-SA0-ORI-APLI          PIC 9(04).                          
022000              08 WS-SA0-ORI-CODIGO        PIC 9(02).                          
022100                 88 WS-ORI-COD-CONTABLE   VALUE 10,11,20,21.                  
022200                 88 WS-ORI-COD-NOCONTABLE VALUE 30,31,70,71.                  
022300                 88 WS-ORI-COD-ELIMIN     VALUE 11,21.                        
022400              08 WS-SA0-ORI-SUBCODIGO     PIC 9(03).                          
022500           06 WS-SA0-DIRECCION            PIC 9(01).                          
022600              88 WS-SA0-DIR-ENVIO         VALUE 1.                            
022700              88 WS-SA0-DIR-REGRESO       VALUE 2.                            
022800              88 WS-SA0-DIR-REVOCACION    VALUE 3.                            
022900              88 WS-SA0-DIR-REGREVOCACION VALUE 4.                            
023000              88 WS-SA0-DIR-REVASIN       VALUE 5.                            
023100              88 WS-SA0-DIR-REGREVASIN    VALUE 6.                            
023200           06 WS-SA0-LONG                 PIC 9(04).                          
023300           06 WS-SA0-TIEMPO-ESPERA        PIC 9(05).                          
023400           06 WS-SA0-CODI-RESPUESTA       PIC 9(02).                          
023500              88 WS-SA0-COD-SOLICITUD     VALUE 1.                            
023600              88 WS-SA0-COD-RESPUESTA     VALUE 2.                            
023700              88 WS-SA0-COD-TIMEOUT       VALUE 3.                            
023800              88 WS-SA0-COD-ENTREGADO     VALUE 4.                            
023900              88 WS-SA0-COD-CONF-APLI     VALUE 6.                            
024000              88 WS-SA0-COD-ACEPTADO      VALUE 7.                            
024100              88 WS-SA0-COD-SEGURIDAD     VALUE 8.                            
024200              88 WS-SA0-COD-ERROR         VALUE 9.                            
024300                                                                              
024400*---SIZE 47                                                                   
024500       04 WS-MSG-SA2.                                                         
024600          06 WS-SA2-ID                   PIC X(03).                           
024700             88 WS-SA2-VALID             VALUE "000".                         
024800          06 WS-SA2-VERSIONB             PIC X(01).                           
024900             88 WS-SA2-VERSB             VALUE "B".                           
025000          06 WS-SA2-CLASE                PIC 9(01).                           
025100             88 WS-SA2-ORIGINAL          VALUE 0.                             
025200             88 WS-SA2-REPETICION        VALUE 1.                             
025300          06 WS-SA2-ESTADO               PIC 9(01).                           
025400             88 WS-SA2-NO-NECESARIO      VALUE 0.                             
025500             88 WS-SA2-APLICADA          VALUE 1.                             
025600             88 WS-SA2-RECHAZADA         VALUE 2.                             
025700          06 WS-SA2-MODO                 PIC 9(01).                           
025800             88 WS-SA2-INTERACTIVO       VALUE 1.                             
025900             88 WS-SA2-NOTIFICACION      VALUE 2.                             
026000             88 WS-SA2-CERTIFICADO       VALUE 3.                             
026100          06 WS-SA2-IDENT.                                                    
026200             08 WS-SA2-ENT-NUM-ORIGEN    PIC 9(04).                           
026300             08 WS-SA2-TIPOCAJA-ORIGEN   PIC X(01).                           
026400             08 WS-SA2-NUMCAJA-ORIGEN    PIC 9(02).                           
026500             08 WS-SA2-AUTORIZACION      PIC 9(08).                           
026600             08 WS-SA2-FECHA-TRANSAC     PIC 9(06).                           
026700             08 WS-SA2-HORA-TRANSAC      PIC 9(06).                           
026800          06 WS-SA2-MODALIDAD            PIC 9(02).                           
026900          06 WS-SA2-OPERADOR             PIC X(10).                           
027000          06 WS-SA2-OPERADOR-R REDEFINES                                      
027100             WS-SA2-OPERADOR.                                                 
027200             08 WS-SA2-ICA               PIC X(03).                           
027300             08 FILLER                   PIC X(07).                           
027400          06 WS-SA2-OPERADOR-R1 REDEFINES                                     
027500             WS-SA2-OPERADOR.                                                 
027600             08 FILLER                   PIC X(02).                           
027700             08 WS-SA2-AUT-INTERBANC     PIC 9(08).                           
027800          06 WS-SA2-OPERADOR-R2 REDEFINES                                     
027900             WS-SA2-OPERADOR.                                                 
028000             08 WS-SA2-INDEFEC           PIC 9(01).                           
028100             08 WS-SA2-INDFIRMA          PIC 9(01).                           
028200             08 FILLER                   PIC X(08).                           
028300          06 WS-SA2-OPERADOR-R3 REDEFINES                                     
028400             WS-SA2-OPERADOR.                                                 
028500             08 FILLER                   PIC X(02).                           
028600             08 WS-SA2-NOMINA-FRAUD      PIC 9(08).                           
028700          06 WS-SA2-VERS-DATOP           PIC X(01).                           
028800             88 WS-SA2-NVAVERSION        VALUE "A".                           
028900             88 WS-SA2-NVAVERSIONB       VALUE "B".                           
028950             88 WS-SA2-NVAVERSIONC       VALUE "C".                           
029000                                                                              
029100*---SIZE HASTA ANTES DE WS-SC-FILLER  372 (TOTAL=943)                         
029200       04 WS-SOL-MOVCONTABLE.                                                 
029300          06 WS-SC-CLAVE-TRANS           PIC 9(04).                           
029400          06 WS-SC-TIPMEDACC             PIC 9(02).                           
029500             88 WS-SCTM-CONTRATO         VALUE 00.                            
029600             88 WS-SCTM-CHEQUERA         VALUE 01.                            
029700             88 WS-SCTM-TARJETA          VALUE 02.                            
029800          06 WS-SC-TARJETA               PIC 9(16).                           
029900          06 WS-SC-MEDACC-CTA  REDEFINES WS-SC-TARJETA.                       
030000             08 WS-SC-NUM-SUCURSAL       PIC 9(04).                           
030100             08 WS-SC-NUM-CTA-CTO        PIC 9(12).                           
030200          06 WS-SC-IMPORTE               PIC 9(12)V99.                        
030300          06 WS-SC-MONEDA                PIC 9(03).                           
030400          06 WS-SC-REFERENCIA            PIC 9(12).                           
030500          06 WS-SC-MOV-FORZADO           PIC 9(01).                           
030600             88 WS-SC-NOFORZADO          VALUE 0.                             
030700             88 WS-SC-SIFORZADO          VALUE 1.                             
030800                                                                              
030900          06 WS-SC-FTO-VARIABLE          PIC X(1041).                         
031000********  06 WS-SC-FILLER                PIC X(320).                          
031100*****************************************************************             
031200                                                                              
031300*---SIZE HASTA ANTES DE WS-SNC-FILLER2 852 (TOTAL=943)                        
031400       04 WS-SOL-MOVNOCONTABLE REDEFINES WS-SOL-MOVCONTABLE.                  
031500          06 WS-SNC-CLAVE-TRANS          PIC 9(04).                           
031600          06 WS-SNC-TIPMEDACC            PIC 9(02).                           
031700             88 WS-SNCTM-CONTRATO        VALUE 00.                            
031800             88 WS-SNCTM-CHEQUERA        VALUE 01.                            
031900             88 WS-SNCTM-TARJETA         VALUE 02.                            
032000          06 WS-SNC-TARJETA              PIC 9(16).                           
032100          06 WS-SNC-MEDACC-CTA REDEFINES WS-SNC-TARJETA.                      
032200             08 WS-SNC-NUM-SUCURSAL      PIC 9(04).                           
032300             08 WS-SNC-NUM-CTA-CTO       PIC 9(12).                           
032400          06 WS-SNC-REFERENCIA           PIC 9(12).                           
032500          06 WS-SNC-DATOS-ACT.                                                
032600             08 WS-SNC-IMPORTE-AUTORIZACION PIC 9(12)V99.                     
032700             08 WS-SNC-BLOQUEO-DESBLOQUEO   PIC 9(02).                        
032800             08 WS-SNC-AUT-3ERNIVEL         PIC 9(08).                        
032900             08 WS-SNC-REF-INTERNACIONAL    PIC 9(23).                        
033000             08 WS-SNC-DATOS-GENERALES.                                       
033100                10 WS-SNC-NOMBRE            PIC X(36).                        
033200                10 WS-SNC-TIPO-PERSONA      PIC 9(02).                        
033300                                                                              
033400                10 WS-SNC-SEGMENTO          PIC 9(02).                        
033500                10 WS-SNC-CVEPERBNM         PIC 9(02).                        
033600                10 WS-SNC-FECHA-CORTE       PIC 9(02).                        
033700                10 WS-SNC-RESTRICCIONES     PIC 9(02).                        
033705*<INI-IBM>NOR SE AGREGA CAMPO NIVEL DE CUENTA                                 
033710                10 WS-SNC-NIVEL              PIC 9(01).                       
033800                10 WS-SNC-RESTRIC-CTACONCENT PIC 9(01).                       
033810*<FIN-IBM>NOR                                                                 
033900                10 WS-SNC-CTA-CONCENTRADORA PIC 9(02).                        
034000                10 WS-SNC-ESTACION-LB       PIC 9(04).                        
034100             08 WS-SNC-CAMBIO-PROD-MONEDA.                                    
034200                10 WS-SNC-MONEDA            PIC 9(03).                        
034300                10 WS-SNC-PRODUCTO          PIC 9(04).                        
034400                10 WS-SNC-INSTRUMENTO       PIC 9(04).                        
034500             08 WS-SNC-PREVENCION-CHEQUERA.                                   
034600                10 WS-SNC-CLAVE-PREVENCION  PIC 9(02).                        
034700                10 WS-SNC-1ERCHEQUE         PIC 9(08).                        
034800                10 WS-SNC-ULTCHEQUE         PIC 9(08).                        
034900             08 WS-SNC-CAMBIO-SUCPROM.                                        
035000                10 WS-SNC-SUCPROM           PIC 9(04).                        
035100             08 WS-SNC-CAMBIO-SECTOR.                                         
035200                10 WS-SNC-SECTOR            PIC 9(02).                        
035300             08 WS-SNC-TCORIGEN             PIC 9(06).                        
035400             08 WS-SNC-NOMINA               PIC 9(08).                        
035500             08 WS-SNC-AUTORIZACION         PIC 9(08).                        
035600             08 WS-SNC-IND-CTA-EMP          PIC 9(02).                        
035700             08 WS-SNC-MONEDA-AUT           PIC 9(03).                        
035800             08 WS-SNC-CAMB-CTOS-TRAS.                                        
035900                10 WS-SNC-CAMBCTOTRAS-CTO1  PIC 9(12).                        
036000                10 WS-SNC-CAMBCTOTRAS-CTO2  PIC 9(12).                        
036100                10 WS-SNC-CAMBCTOTRAS-CTO3  PIC 9(12).                        
036200             08 WS-SNC-NVO-NUM-TEF          PIC 9(16).                        
036300             08 WS-SNC-DISP-S054            PIC 9(07)V99.                     
036400             08 WS-SNC-TIP-AUT              PIC X(01).                        
036500             08 WS-SNC-AUT-FORZ             PIC 9(01).                        
036600             08 WS-SNC-FILLER2              PIC X(592).                       
036700          06 WS-SNC-CVE724  REDEFINES WS-SNC-DATOS-ACT.                       
036800             08 WS-SNC-C724-ESQTAR       PIC 9(02).                           
036900             08 FILLER                   PIC X(816).                          
037000          06 WS-SNC-PC        REDEFINES   WS-SNC-DATOS-ACT.                   
037100             08 WS-SNC-PC-SUC             PIC 9(004).                         
037200             08 WS-SNC-PC-CAJA            PIC 9(002).                         
037300             08 WS-SNC-PC-FECHA           PIC 9(008).                         
037400             08 WS-SNC-PC-AUTORIZ-APLOR   PIC 9(008).                         
037500             08 FILLER                    PIC X(796).                         
037600          06 WS-SNC-CVE776  REDEFINES WS-SNC-DATOS-ACT.                       
037700             08 WS-SNC-C776-O-PROD        PIC 9(004).                         
037800             08 WS-SNC-C776-O-INST        PIC 9(002).                         
037900             08 WS-SNC-C776-O-PREF        PIC 9(004).                         
038000             08 WS-SNC-C776-O-CVEMAN      PIC 9(002).                         
038100             08 WS-SNC-C776-O-RGOPAG      PIC 9(002).                         
038200             08 WS-SNC-C776-O-OPCPAG      PIC 9(002).                         
038300             08 WS-SNC-C776-O-CVEENV      PIC 9(004).                         
038400             08 WS-SNC-C776-O-EDOCTA      PIC 9(004).                         
038500             08 WS-SNC-C776-C-PROD        PIC 9(004).                         
038600             08 WS-SNC-C776-C-INST        PIC 9(004).                         
038700             08 WS-SNC-C776-C-MON         PIC 9(003).                         
038800             08 WS-SNC-C776-C-DIACORTE    PIC 9(002).                         
038900             08 FILLER                    PIC X(781).                         
039000          06 WS-SNC-CVE780 REDEFINES WS-SNC-DATOS-ACT.                        
039100             08 WS-SNC-C780-SUCPROM            PIC 9(04).                     
039200             08 WS-SNC-C780-NOMBRE             PIC X(36).                     
039300             08 WS-SNC-C780-TIPO-PERSONA       PIC 9(02).                     
039400             08 WS-SNC-C780-SEGMENTO           PIC 9(02).                     
039500             08 WS-SNC-C780-CVEPERBNM          PIC 9(02).                     
039600             08 WS-SNC-C780-FECHA-CORTE        PIC 9(02).                     
039700             08 WS-SNC-C780-RESTRICCIONES      PIC 9(02).                     
039800             08 WS-SNC-C780-CTA-CONCENTRADORA  PIC 9(02).                     
039805*<INI-IBM>NOR SE AGREGA CAMPO NIVEL DE CUENTA                                 
039810             08 WS-SNC-C780-NIVEL              PIC 9(01).                     
039900             08 WS-SNC-C780-RESTRIC-CTACONCENT PIC 9(01).                     
039905*<FIN-IBM>NOR                                                                 
040000             08 WS-SNC-C780-SECTOR             PIC 9(02).                     
040100             08 WS-SNC-C780-BLOQUEO-DESBLOQUEO PIC 9(02).                     
040200             08 WS-SNC-C780-MONEDA             PIC 9(03).                     
040300             08 WS-SNC-C780-PRODUCTO           PIC 9(04).                     
040400             08 WS-SNC-C780-INSTRUMENTO        PIC 9(04).                     
040500             08 WS-SNC-C780-NVO-NUM-TEF        PIC 9(16).                     
040600             08 WS-SNC-C780-OPCIONPAGO         PIC 9(02).                     
040700             08 WS-SNC-C780-RANGOPAGO          PIC 9(02).                     
040800             08 WS-SNC-C780-NUMCTE             PIC 9(12).                     
040900             08 WS-SNC-C780-BANCA              PIC 9(02).                     
041000             08 FILLER                         PIC X(715).                    
041100          06 WS-SNC-CVE811  REDEFINES WS-SNC-DATOS-ACT.                       
041105*<INI-IBM>NOR SE ADECUA RECEPCION DE INDICADOR DE NIVEL                       
041110             08 FILLER                   PIC X(01).                           
041200             08 WS-SNC-C811-NIVEL        PIC 9(02).                           
041205*<FIN-IBM>NOR                                                                 
041300             08 FILLER                   PIC X(815).                          
041305          06 WS-SNC-CVE935  REDEFINES WS-SNC-DATOS-ACT.                       
041310             08 WS-SNC-C935-IND-MARORD   PIC 9(02).                           
041315             08 WS-SNC-C935-IND-FECMCO   PIC 9(08).                           
041320             08 FILLER                   PIC X(808).                          
041400          06 WS-SNC-EPP-NC  REDEFINES WS-SNC-DATOS-ACT.                       
041500             08 FILLER                   PIC X(019).                          
041600             08 WS-SNC-EPP-NC-REFAD02    PIC X(035).                          
041700             08 FILLER                   PIC X(001).                          
041800             08 WS-SNC-EPP-NC-REFAD03    PIC X(035).                          
041900             08 FILLER                   PIC X(001).                          
042000             08 WS-SNC-EPP-NC-REFAD04    PIC X(035).                          
042100             08 FILLER                   PIC X(692).                          
042200          06 WS-SNC-EPP-CAN REDEFINES WS-SNC-DATOS-ACT.                       
042300             08 WS-SNC-EPP-NC-FECHCOMPEN PIC 9(008).                          
042400             08 FILLER                   PIC X(810).                          
042405          06 WS-SNC-TESOFE REDEFINES WS-SNC-DATOS-ACT.                        
042410             08 WS-SNC-TESOFE-CC-SC-IMPORTE     PIC 9(12)V99.                 
042415             08 WS-SNC-TESOFE-CC-SC-MONEDA      PIC 9(03).                    
042420             08 WS-SNC-TESOFE-CC-TIPMEDACC      PIC 9(02).                    
042425                88 WS-SNCTM-TESOFE-CC-TMDA-CTO  VALUE 00.                     
042430             08 WS-SNC-TESOFE-CC-NUM-SUCURSAL   PIC 9(04).                    
042435             08 WS-SNC-TESOFE-CC-NUM-CTA-CTO    PIC 9(12).                    
042440             08 WS-SNC-TESOFE-CC-MONEDA         PIC 9(03).                    
042445             08 WS-SNC-TESOFE-LEYENDA.                                        
042450                10 WS-SC-TESOFE-IND-LEYENDA     PIC X(02).                    
042455                10 WS-SC-TESOFE-LEYENDA         PIC X(40).                    
042460             08 FILLER                          PIC X(738).                   
042465*                                                                             
042470          06 WS-SNC-C890      REDEFINES WS-SNC-DATOS-ACT.                     
042472             08 WS-SNC-C890-RESTRICCION   PIC 9(002).                         
042474             08 FILLER                    PIC X(816).                         
042480*** <GCE-LOCK-UNLOCK> START   2019-08                                         
042482          06 WS-SNC-GCE REDEFINES WS-SNC-DATOS-ACT.                           
042484             08 WS-SNC-IMPORTE-BLOQ-GCE         PIC 9(12)V99.                 
042486             08 FILLER                          PIC X(804).                   
042488*** <GCE-LOCK-UNLOCK> END   2019-08042462                                     
042498          06 WS-SNC-FILLER0                     PIC X(241).                   
042500                                                                              
042600*---SIZE HASTA ANTES DE WS-SPR-FILLER2 12 (TOTAL=943)                         
042700       04 WS-SOL-RECHAZO  REDEFINES WS-SOL-MOVCONTABLE.                       
042800          06 WS-SRE-CLAVE-TRANS          PIC 9(04).                           
042900          06 WS-SRE-IMPORTE              PIC 9(12)V99.                        
043000          06 WS-SRE-CONTRATO             PIC 9(12).                           
043100          06 WS-SRE-AUTORIZACION         PIC 9(08).                           
043200          06 WS-SRE-PRODUCTO             PIC 9(04).                           
043300          06 WS-SRE-INSTRUM              PIC 9(02).                           
043400          06 WS-SRE-MONEDA               PIC 9(02).                           
043500          06 WS-SRE-FILLER2              PIC X(1047).                         
043600                                                                              
043700*---SIZE HASTA ANTES DE WS-SAR-FILLER2 704 (TOTAL=943)                        
043800       04 WS-SOL-ARCHIVO REDEFINES WS-SOL-MOVCONTABLE.                        
043900          06 WS-SAR-CLAVE-TRANS          PIC 9(04).                           
044000          06 WS-SAR-OCCURS OCCURS  10 TIMES.                                  
044100             08 WS-SAR-SISTEMA           PIC 9(02).                           
044200             08 WS-SAR-FECHA             PIC 9(06).                           
044300             08 WS-SAR-HHMM              PIC 9(04).                           
044400             08 WS-SAR-STATUS            PIC 9(02).                           
044500             08 WS-SAR-IMPABOC           PIC 9(12)V99.                        
044600             08 WS-SAR-IMPCARC           PIC 9(12)V99.                        
044700             08 WS-SAR-IMPABONC          PIC 9(12)V99.                        
044800             08 WS-SAR-IMPCARNC          PIC 9(12)V99.                        
044900          06 WS-SAR-FILLER2              PIC X(389).                          
045000                                                                              
045100*---SIZE HASTA ANTES DE WS-SB02-FILLER2  64 (TOTAL=943)                       
045200       04 WS-SOL-B02CTRL REDEFINES WS-SOL-MOVCONTABLE.                        
045300          06 WS-SB2-CLAVE-TRANS          PIC 9(04).                           
045400          06 WS-SB2-OCCURS OCCURS  30 TIMES.                                  
045500             08 WS-SB2-ULT-ARCH-APLI     PIC 9(06).                           
045505*EAS F5 INI FECHAS CONTROL TBINTER Y MOVSTBINTER DE DIARIO Y SEM              
045600          06 WS-SB2-FILLER2              PIC X(909).                          
045605*EAS F5 FIN FECHAS CONTROL TBINTER Y MOVSTBINTER DE DIARIO Y SEM              
045700*---SIZE HASTA ANTES DE WS-CONS-FILLER2 852 (TOTAL=943)                       
045800       04 WS-SOL-CONSULTAS REDEFINES WS-SOL-MOVCONTABLE.                      
045900          06 WS-CONS-CLAVE-TRANS         PIC 9(04).                           
046000          06 WS-CONS-ACTUAL.                                                  
046100             08 WS-CONS-TIPMEDACC        PIC 9(02).                           
046200                88 WS-CONTM-CONTRATO     VALUE 00.                            
046300                88 WS-CONTM-CHEQUERA     VALUE 01.                            
046400                88 WS-CONTM-TARJETA      VALUE 02.                            
046500             08 WS-CONS-TARJETA          PIC 9(16).                           
046600             08 WS-CONS-MEDACC-CTA REDEFINES WS-CONS-TARJETA.                 
046700                10 WS-CONS-NUM-SUCURSAL  PIC 9(04).                           
046800                10 WS-CONS-NUM-CTA-CTO   PIC 9(12).                           
046900             08 WS-CONS-FECHA-MOVEDOCTA  PIC 9(06).                           
047000             08 WS-CONS-NOMINA           PIC 9(08).                           
047100             08 WS-CONS-DATOS-ACT.                                            
047200                10 WS-CONS-REFEREN-CGOPEND PIC 9(12).                         
047300                10 WS-CONS-TIPO-CGOPEND    PIC 9(02).                         
047400                   88 WS-CONS-CGOPEND-TOTAL VALUE 00.                         
047500                   88 WS-CONS-CGOPEND-PARCI VALUE 01.                         
047600                10 WS-CONS-ULTCOMI       PIC 9(02).                           
047700                10 WS-CONS-FILLER2       PIC X(800).                          
047800             08 WS-CONS-DATOS-PCXCTA     REDEFINES                            
047900                WS-CONS-DATOS-ACT.                                            
048000                10 WS-CONS-PCXCTA-TIPO    PIC 9(002).                         
048100                10 WS-CONS-PCXCTA-FECLIN  PIC 9(008).                         
048200                10 WS-CONS-PCXCTA-AUTSEQ  PIC 9(008).                         
048300                10 WS-CONS-PCXCTA-PRIORI  PIC 9(002).                         
048400                10 WS-CONS-PCXCTA-NUMREGS PIC 9(002).                         
048500                10 WS-CONS-PCXCTA-IMPORI-TOT PIC 9(10)V99.                    
048600                10 WS-CONS-PCXCTA-SDOPND-TOT PIC 9(10)V99.                    
048700                10 WS-CONS-FILLER3        PIC X(770).                         
048710*  INI - EFD BANKING RETAIL                                                   
048720             08 WS-CONS-DATOS-B52  REDEFINES  WS-CONS-DATOS-ACT.              
048730                10 FILLER           PIC X(46).                                
048740                10 WS-CONS-B52      PIC 9(02).                                
048750                   88 WS-CONS-NO-B52     VALUE 00.                            
048760                   88 WS-CONS-SI-B52     VALUE 01.                            
048770                10 WS-CONS-FILLER6  PIC X(768).                               
048780*  FIN - EFD BANKING RETAIL                                                   
048800          06 WS-CONS-DATOS-MULTI          REDEFINES                           
048900             WS-CONS-ACTUAL.                                                  
049000             08 WS-CONS-NUM-CTAS-MULTI            PIC 9(02).                  
049100             08 WS-CONS-DATOS-MULTI-OC            OCCURS 10 TIMES.            
049200                10 WS-CONS-TIPMEDACC-MULTI        PIC 9(02).                  
049300                   88 WS-CONTM-CONTRATO-MULTI     VALUE 00.                   
049400                   88 WS-CONTM-CHEQUERA-MULTI     VALUE 01.                   
049500                   88 WS-CONTM-TARJETA-MULTI      VALUE 02.                   
049600                10 WS-CONS-TARJETA-MULTI          PIC 9(16).                  
049700                10 WS-CONS-MEDACC-CTA-MULTI       REDEFINES                   
049800                   WS-CONS-TARJETA-MULTI.                                     
049900                   12 WS-CONS-NUM-SUCURSAL-MULTI  PIC 9(04).                  
050000                   12 WS-CONS-NUM-CTA-CTO-MULTI   PIC 9(12).                  
050100                10 WS-CONS-IND-CTAVAL-MULTI       PIC X(05).                  
050200             08 WS-CONS-FILLER4                   PIC X(616).                 
050210          06 WS-CONS-FILLER5                      PIC X(241).                 
050300                                                                              
050400*---SIZE HASTA ANTES DE WS-CONS-LIG-58-FILLER 38 (TOTAL=943)                  
050500       04 WS-CONS-LIGAS-GLOB-50058 REDEFINES WS-SOL-MOVCONTABLE.              
050600          06 WS-CONS-LIG-58-OPCION        PIC 9(002).                         
050700          06 WS-CONS-LIG-58-PROD          PIC 9(004).                         
050800          06 WS-CONS-LIG-58-INST          PIC 9(004).                         
050900          06 WS-CONS-LIG-58-MONE          PIC 9(002).                         
051000          06 WS-CONS-LIG-58-IOPE          PIC 9(002).                         
051100          06 WS-CONS-LIG-58-NINV          PIC 9(006).                         
051200          06 WS-CONS-LIG-58-CTO           PIC 9(018).                         
051300          06 WS-CONS-LIG-58-FILLER        PIC X(1055).                        
051400                                                                              
051500                                                                              
051600*---SIZE HASTA ANTES DE WS-RCA-FILLER2 510 (TOTAL=943)                        
051700       04 WS-RESP-CONTABLE-OK REDEFINES WS-SOL-MOVCONTABLE.                   
051800          06 WS-RCA-PRODUCTO             PIC 9(04).                           
051900          06 WS-RCA-INSTRUMENTO          PIC 9(04).                           
052000          06 WS-RCA-MONEDA               PIC 9(03).                           
052100          06 WS-RCA-NOMBRE               PIC X(36).                           
052200          06 WS-RCA-SALDO-ACTUAL         PIC 9(14)V99.                        
052300          06 WS-RCA-SIGNO-ACTUAL         PIC X.                               
052400          06 WS-RCA-SDO-DISPONIBLE       PIC 9(14)V99.                        
052500          06 WS-RCA-REND-PERIODO         PIC 9(10)V99.                        
052600          06 WS-RCA-FECHA-CONTABLE       PIC 9(06).                           
052700          06 WS-RCA-SEQ3NIVEL            PIC 9(06).                           
052800          06 WS-RCA-SECTOR               PIC 9(02).                           
052900          06 WS-RCA-CONTRATO             PIC 9(12).                           
053000          06 WS-RCA-DISPOSICION-S408     PIC 9(12)V99.                        
053100          06 WS-RCA-GTOSCOBZA            PIC 9(06)V99.                        
053200          06 WS-RCA-IVA-GTOSCOBZA        PIC 9(06)V99.                        
053300          06 WS-RCA-SUBMEDIO             PIC X(25).                           
053400          06 WS-RCA-IMPORTE-CGO          PIC 9(12)V99.                        
053500          06 WS-RCA-SDOACTPESOS-CMD      PIC 9(14)V99.                        
053600          06 WS-RCA-USO-LC-DEVOL         PIC 9(01).                           
053700          06 WS-RCA-DISPTO-LC-DEVOL      PIC 9(12)V99.                        
053800          06 WS-RCA-IND-CTAENOBS         PIC 9(02).                           
053900          06 WS-RCA-IND-DIVERSO          PIC 9(03).                           
054000          06 WS-RCA-DESLIGADO-S408       PIC 9(01).                           
054100          06 WS-RCA-CTAOBS-CVE           PIC 9(02).                           
054200          06 WS-RCA-CTAOBS-LEYENDA       PIC X(20).                           
054300*INI FSW                  P07-410 Evolucion               ABARBOSA            
054400          06 WS-RCA-SDOAUT-PEND          PIC 9(12)V99.                        
054500*INI             P10-119  Migracion Prepagada             ABARBOSA            
054600          06 WS-RCA-FECHA-DEPNOMI        PIC 9(08).                           
054700          06 WS-RCA-NUM-TEF              PIC 9(16).                           
054800          06 WS-RCA-NUM-TEF-INFO         PIC 9(16).                           
054900          06 WS-RCA-CAMPO-DISPONIBLE     PIC X(10).                           
055000*FIN             P10-119  Migracion Prepagada             ABARBOSA            
055100*INI FSW              P10-XXX Comisiones ATM              ABARBOSA            
055200          06 WS-RCA-COMISION             PIC 9(12)V99.                        
055300*INI BSR. PERFILES DOLARES                                                    
055400          06 WS-RCA-SDODISPPESOS-CMD     PIC 9(14)V99.                        
055500          06 WS-RCA-IMPORTE-TRX-USD      PIC 9(12)V99.                        
055600          06 WS-RCA-IMPORTE-TRX-MN       PIC 9(12)V99.                        
055700          06 WS-RCA-TIPOCAMBIO-PREF      PIC 9(04)V9(04).                     
055800*FIN BSR. PERFILES DOLARES                                                    
055805*INI CUT SPEI (01/SEP/2018) PCB                                               
055810          06 WS-RCA-SALDOATRASFERIR      PIC 9(14)V99.                        
055900*         06 WS-RCA-FILLER2              PIC X(476).                          
055905*FIN CUT SPEI (01/SEP/2018) PCB                                               
055915           06 WS-RCA-SDO-AOACT-TES        PIC 9(14)V99.                       
055925           06 WS-RCA-SDO-ARACT-TES        PIC 9(14)V99.                       
055935           06 WS-RCA-SDO-DAACT-TES        PIC 9(14)V99.                       
055945           06 WS-RCA-SDO-TRACT-TES        PIC 9(14)V99.                       
055955           06 WS-RCA-SDO-TAACT-TES        PIC 9(14)V99.                       
055960           06 WS-RCA-TECHO-DIS-TES        PIC 9(14)V99.                       
055965           06 WS-RCA-IMPSOLBLO-TES        PIC 9(14)V99.                       
055975           06 WS-RCA-IND-RESET-TES        PIC 9(01).                          
055985           06 WS-RCA-IND-CTOCC-TES        PIC 9(01).                          
055988*P0133291 Update Alerts and Notifications 1  LINEA, PCB 2019OCT23*            
055990           06 WS-RCA-IND-ALERTA           PIC 9(04).                          
055992           06 WS-RCA-CODI-TIMESTAMP       PIC 9(18).                          
055993*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
055994           06 WS-RCA-MARCA-CLON           PIC 9(01).                          
055995*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
055996           06 WS-RCA-SDO-BLOQ             PIC 9(14)V99.                       
055997           06 WS-RCA-FILLER2              PIC X(548).                         
056000*FIN FSW              P10-XXX Comisiones ATM              ABARBOSA            
056100*FIN FSW                  P07-410 Evolucion               ABARBOSA            
056200                                                                              
056300*---SIZE HASTA ANTES DE WS-RCA-FILLER4-B 224 (TOTAL=943)                      
056400       04 WS-RESP-CONTABLE-OKB REDEFINES WS-SOL-MOVCONTABLE.                  
056500          06 WS-RCA-PRODUCTO-B           PIC 9(04).                           
056600          06 WS-RCA-INSTRUMENTO-B        PIC 9(04).                           
056700          06 WS-RCA-MONEDA-B             PIC 9(03).                           
056800          06 WS-RCA-NOMBRE-B             PIC X(36).                           
056900          06 WS-RCA-FILLER-B             PIC X(45).                           
057000          06 WS-RCA-FECHA-CONTABLE-B     PIC 9(08).                           
057100          06 WS-RCA-FILLER2-B            PIC X(50).                           
057200          06 WS-RCA-SUBMEDIO-B           PIC X(25).                           
057300          06 WS-RCA-FILLER3-B            PIC X(45).                           
057400          06 WS-RCA-IND-CTAENOBS-B       PIC 9(02).                           
057500          06 WS-RCA-INFIRMA-B            PIC 9(01).                           
057600          06 WS-RCA-TIPCHEQ-B            PIC 9(01).                           
057605*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
057610          06 WS-RCA-MARCA-CLON-B         PIC 9(01).                           
057615*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
057700          06 WS-RCA-FILLER4-B            PIC X(868).                          
057800                                                                              
057900*---SIZE HASTA ANTES DE WS-RNCA-FILLER2 863 (TOTAL=943)                       
058000       04 WS-RES-MOVNOCONTABLE REDEFINES WS-SOL-MOVCONTABLE.                  
058100          06 WS-RNCA-PRODUCTO            PIC 9(04).                           
058200          06 WS-RNCA-INSTRUMENTO         PIC 9(04).                           
058300          06 WS-RNCA-MONEDA              PIC 9(03).                           
058400          06 WS-RNCA-FECHA-CONTABLE      PIC 9(06).                           
058500          06 WS-RNCA-CONTRATO            PIC 9(12).                           
058600          06 WS-RNCA-SALDO-ACTUAL        PIC 9(14)V99.                        
058700          06 WS-RNCA-SIGNO-SDOACTUAL     PIC X.                               
058800          06 WS-RNCA-SALDO-DISPONIBLE    PIC 9(14)V99.                        
058900          06 WS-RNCA-DETALLE             PIC X(114).                          
059000          06 WS-RNCA-CVE776-R1 REDEFINES WS-RNCA-DETALLE.                     
059100             08 WS-RNCA-C776-O-PROD      PIC X(004).                          
059200             08 WS-RNCA-C776-O-INST      PIC X(002).                          
059300             08 WS-RNCA-C776-O-PREF      PIC X(004).                          
059400             08 WS-RNCA-C776-O-CVEMAN    PIC X(002).                          
059500             08 WS-RNCA-C776-O-RGOPAG    PIC X(002).                          
059600             08 WS-RNCA-C776-O-OPCPAG    PIC X(002).                          
059700             08 WS-RNCA-C776-O-CVEENV    PIC X(004).                          
059800             08 WS-RNCA-C776-O-EDOCTA    PIC X(004).                          
059900             08 WS-RNCA-C776-C-PROD      PIC X(004).                          
060000             08 WS-RNCA-C776-C-INST      PIC X(004).                          
060100             08 WS-RNCA-C776-C-MON       PIC X(003).                          
060200             08 WS-RNCA-C776-C-DIACORTE  PIC X(002).                          
060300             08 WS-RNCA-C776-FILLER      PIC X(077).                          
060310          06 WS-RNCA-SDOS-TES-R1 REDEFINES WS-RNCA-DETALLE.                   
060320             08 WS-RNCA-SDO-AOACT-TES    PIC 9(14)V99.                        
060330             08 WS-RNCA-SDO-ARACT-TES    PIC 9(14)V99.                        
060340             08 WS-RNCA-SDO-DAACT-TES    PIC 9(14)V99.                        
060350             08 WS-RNCA-SDO-TRACT-TES    PIC 9(14)V99.                        
060360             08 WS-RNCA-SDO-TAACT-TES    PIC 9(14)V99.                        
060365             08 WS-RNCA-TECHO-DIS-TES    PIC 9(14)V99.                        
060370             08 WS-RNCA-IMPSOLBLO-TES    PIC 9(14)V99.                        
060390             08 WS-RNCA-IND-CTOCC-TES    PIC 9(01).                           
060395             08 WS-RNCA-TES-FILLER       PIC X(01).                           
060400*P0133291 Update Alerts and Notifications 1  LINEA, PCB 2019OCT23*            
060405          06 WS-RNCA-IND-ALERTA          PIC 9(04).                           
060407          06 WS-RNCA-DIA-CORTE           PIC 9(02).                           
060409*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
060411          06 WS-RNCA-MARCA-CLON          PIC 9(01).                           
060413*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
060480          06 WS-RNCA-FILLER2             PIC X(910).                          
060500                                                                              
060600*---SIZE HASTA ANTES DE WS-RCON-FILLER2 863 (TOTAL=943)                       
060700       04 WS-RESP-CONSULTA REDEFINES WS-SOL-MOVCONTABLE.                      
060800          06 WS-RCON-PRODUCTO            PIC 9(04).                           
060900          06 WS-RCON-INSTRUMENTO         PIC 9(04).                           
061000          06 WS-RCON-MONEDA              PIC 9(03).                           
061100          06 WS-RCON-NOMBRE              PIC X(36).                           
061200          06 WS-RCON-SALDO-ACTUAL        PIC 9(14)V99.                        
061300          06 WS-RCON-SIGNO-SDOACTUAL     PIC X.                               
061400          06 WS-RCON-AUTS-PENDIENTES     PIC 9(12)V99.                        
061500          06 WS-RCON-SALDO-PENDIENTE     PIC 9(12)V99.                        
061600          06 WS-RCON-SALDO-SBC           PIC 9(12)V99.                        
061700          06 WS-RCON-SALDO-DISPONIBLE    PIC 9(14)V99.                        
061800          06 WS-RCON-REND-MES            PIC 9(10)V99.                        
061900          06 WS-RCON-FECHA-ULTMOV        PIC 9(06).                           
062000          06 WS-RCON-NUM-MOVIMIENTOS     PIC 9(05).                           
062100          06 WS-RCON-IMPCGO-DIA          PIC 9(10)V99.                        
062200          06 WS-RCON-IMPABO-DIA          PIC 9(10)V99.                        
062300          06 WS-RCON-SALDO-LCREDITO      PIC 9(12)V99.                        
062400          06 WS-RCON-FEC-1ERSGIRO        PIC 9(06).                           
062500          06 WS-RCON-MOVIMIENTOS         OCCURS 4 TIMES.                      
062600             08 WS-RCON-SUC-OPERO        PIC 9(04).                           
062700             08 WS-RCON-CAJ-OPERO        PIC 9(02).                           
062800             08 WS-RCON-AUTORIZACION     PIC 9(06).                           
062900             08 WS-RCON-CVE-MOVTO        PIC 9(04).                           
063000             08 WS-RCON-SCVE-MOVTO       PIC 9(02).                           
063100             08 WS-RCON-REFERENCIA       PIC 9(12).                           
063200             08 WS-RCON-IMPORTE          PIC 9(12)V99.                        
063300          06 WS-RCON-FECHA-CONTABLE      PIC 9(06).                           
063400          06 WS-RCON-LIM-CREDITO         PIC 9(12)V99.                        
063500          06 WS-RCON-STATUS-CONTRATO     PIC 9(02).                           
063600          06 WS-RCON-TIPO-BLOQUEO        PIC 9(02).                           
063700          06 WS-RCON-STATUS-MEDACCES     PIC 9(02).                           
063800          06 WS-RCON-SDODIPSPESOS-CMD    PIC 9(14)V99.                        
063900          06 WS-RCON-SDOACTPESOS-CMD     PIC 9(14)V99.                        
064000          06 WS-RCON-TCAMBIO             PIC 9(04)V9(04).                     
064100          06 WS-RCON-SDOCGOSXDEVOL-ST    PIC 9(12)V99.                        
064200          06 WS-RCON-IND-CTAENOBS        PIC 9(02).                           
064300          06 WS-RCON-COMIS-PENDTE        PIC 9(10)V99.                        
064400          06 WS-RCON-CTAOBS-CVE          PIC 9(02).                           
064500          06 WS-RCON-CTAOBS-LEYENDA      PIC X(20).                           
064600          06 WS-RCON-MOVIMIENTOS-C2      OCCURS  4 TIMES.                     
064700             08 WS-RCON-LEYENDA          PIC X(40).                           
064800             08 WS-RCON-REFER-CECOBAN    PIC X(07).                           
064900*INI BSR. JFP BANCANET                                                        
065000          06 WS-RCON-SDO-ANTERIOR        PIC 9(14)V99.                        
065100          06 WS-RCON-NUM-MOVSNC          PIC 9(06).                           
065200          06 WS-RCON-NUM-MOVSCGO         PIC 9(06).                           
065300          06 WS-RCON-NUM-MOVSABO         PIC 9(06).                           
065400*FIN BSR. JFP BANCANET                                                        
065500          06 WS-RCON-SDOPROT-BLOQ        PIC 9(14)V99.                        
065600          06 WS-RCON-IMPSOL-BLOQ         PIC 9(14)V99.                        
065602          06 WS-RCON-ASIGNACIONES-OTORGADAS  PIC 9(14)V99.                    
065604          06 WS-RCON-ASIGNACIONES-RECIBIDAS  PIC 9(14)V99.                    
065606          06 WS-RCON-DISPONIBLE-ASIGNADO     PIC 9(14)V99.                    
065608          06 WS-RCON-TECHO-RECIBIDO          PIC 9(14)V99.                    
065610          06 WS-RCON-TECHO-ASIGNADO          PIC 9(14)V99.                    
065612          06 WS-RCON-TECHO-DISPONIBLE        PIC 9(14)V99.                    
065614          06 WS-RCON-DISPONIBLE-ACTUAL       PIC 9(14)V99.                    
065616          06 WS-RCON-IND-RESET               PIC 9(01).                       
065640          06 WS-RCON-IND-CC                  PIC 9(01).                       
065650          06 WS-RCON-DISP-LCRED          PIC 9(12)V99.                        
065655*  INI - EFD BANKING RETAIL                                                   
065660          06 WS-RCON-ACUM-DEP-DIA        PIC 9(18)V99.                        
065665          06 WS-RCON-ACUM-DEP-MEN        PIC 9(18)V99.                        
065670          06 WS-RCON-ACUM-RET-DIA        PIC 9(18)V99.                        
065675          06 WS-RCON-ACUM-RET-MEN        PIC 9(18)V99.                        
065680          06 WS-RCON-SDO-CON-DEP         PIC 9(18)V99.                        
065685*  FIN - EFD BANKING RETAIL                                                   
065687*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
065689          06 WS-RCON-MARCA-CLON          PIC 9(01).                           
065691*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
065700*          06 WS-RCON-FILLER2             PIC X(80).                          
065750          06 WS-RCON-FILLER2             PIC X(129).                          
065800                                                                              
065900*---SIZE HASTA ANTES DE WS-RDGR-FILLER2 354 (TOTAL=943)                       
066000       04 WS-RESPUESTA-DATOS-GRALES REDEFINES WS-SOL-MOVCONTABLE.             
066100          06 WS-RDGR-NOMBRE              PIC X(36).                           
066200          06 WS-RDGR-PRODUCTO            PIC 9(04).                           
066300          06 WS-RDGR-INSTRUMENTO         PIC 9(04).                           
066400          06 WS-RDGR-INST-CONCEPTO       PIC X(40).                           
066500          06 WS-RDGR-MONEDA              PIC 9(03).                           
066600          06 WS-RDGR-NUM-CLIENTE         PIC 9(12).                           
066700          06 WS-RDGR-FECHA-APERTURA      PIC 9(06).                           
066800          06 WS-RDGR-TIPO-PERSONA        PIC 9(02).                           
066900          06 WS-RDGR-TIPO-CUENTA         PIC 9(02).                           
067000          06 WS-RDGR-SECTOR              PIC 9(02).                           
067100          06 WS-RDGR-DIA-CORTE           PIC 9(02).                           
067200          06 WS-RDGR-STATUS-CONTRATO     PIC 9(02).                           
067300             88 WS-STA-VIGENTE           VALUE 00.                            
067400             88 WS-STA-BLOQUEADO         VALUE 01.                            
067500             88 WS-STA-CANCELADO         VALUE 02,03.                         
067600          06 WS-RDGR-STACTO-CONCEPTO     PIC X(10).                           
067700          06 WS-RDGR-TIPO-BLOQUEO        PIC 9(02).                           
067800          06 WS-RDGR-STA-CAN-SDO0        PIC 9(02).                           
067900             88 WS-STC-1ERMES-SINMOV     VALUE 01.                            
068000             88 WS-STC-2DOMES-SINMOV     VALUE 02.                            
068100             88 WS-STC-3ERMES-SINMOV     VALUE 03.                            
068200          06 WS-RDGR-CTA-CONCENTRADORA   PIC 9(02).                           
068300             88 WS-RCTC-NOES-CTACONCENT  VALUE 10.                            
068400             88 WS-RCTC-SIES-CTACONCENT  VALUE 11.                            
068500          06 WS-RDGR-IND-LCREDITO        PIC 9(02).                           
068600          06 WS-RDGR-IND-2DA-REFERENCIA  PIC 9(02).                           
068700          06 WS-RDGR-MOD-VALIDA-CTACONC  PIC 9(02).                           
068800          06 WS-RDGR-RESTRICCIONES       PIC 9(02).                           
068900             88 WS-SIN-RESTRICCIONES     VALUE 01.                            
069000             88 WS-NORECIBE-ABONOS       VALUE 02.                            
069100             88 WS-NORECIBE-CHEQUES      VALUE 03.                            
069200             88 WS-NORECIBE-CARGOS       VALUE 04.                            
069300             88 WS-CARGOS-SOLOXTRASP     VALUE 05.                            
069400             88 WS-ABONOS-SOLOXTRASP     VALUE 06.                            
069500             88 WS-NORECIBE-MOVTOS       VALUE 07.                            
069600          06 WS-RDGR-REST-CONCEPTO       PIC X(20).                           
069700          06 WS-RDGR-RESTRIC-CTACONCENT  PIC 9(02).                           
069800             88 WS-RDGR-NORECIBE-MOVTOS  VALUE 01.                            
069900             88 WS-RDGR-CARGOS           VALUE 02.                            
070000          06 WS-RDGR-RESTCONC-CONCEPTO   PIC X(25).                           
070100          06 WS-RDGR-PRODUCTO-ANTERIOR   PIC 9(04).                           
070200          06 WS-RDGR-INST-ANTERIOR       PIC 9(04).                           
070300          06 WS-RDGR-FECHA-CAMBIOPROD    PIC 9(06).                           
070400          06 WS-RDGR-TRASPASOS.                                               
070500             08 WS-TRASP-CTO1            PIC 9(12).                           
070600             08 WS-TRASP-CTO2            PIC 9(12).                           
070700             08 WS-TRASP-CTO3            PIC 9(12).                           
070800          06 WS-RDGR-INDSEGLOG           PIC 9(04).                           
070900          06 WS-RDGR-STATION-LINEABMX    PIC 9(04).                           
071000          06 WS-RDGR-STATUS-MEDACCES     PIC 9(02).                           
071100          06 WS-RDGR-IND-CTAENOBS        PIC 9(02).                           
071200          06 WS-RDGR-SUC-PROMCTO         PIC 9(04).                           
071300          06 WS-RDGR-CONTRATO            PIC 9(12).                           
071400          06 WS-RDGR-IND-VALDIG-CHEQ     PIC 9(02).                           
071500          06 WS-RDGR-FECHA-APERLCINVINT  PIC 9(06).                           
071600          06 WS-RDGR-REF-MINLONG         PIC 9(02).                           
071700          06 WS-RDGR-REF-MAXLONG         PIC 9(02).                           
071800          06 WS-RDGR-REFALFA-MINLONG     PIC 9(02).                           
071900          06 WS-RDGR-REFALFA-MAXLONG     PIC 9(02).                           
072000          06 WS-RDGR-CTAOBS-CVE          PIC 9(02).                           
072100          06 WS-RDGR-CTAOBS-LEYENDA      PIC X(20).                           
072200*INI BSR. MIGRACION PREPAGADA                                                 
072300          06 WS-RDGR-TEF-COMIS           PIC 9(16).                           
072400          06 WS-RDGR-TEF-INFO            PIC 9(16).                           
072500          06 WS-RDGR-FECHA-DEPNOMI       PIC 9(08).                           
072600          06 WS-RDGR-FECHA-MIGRA         PIC 9(08).                           
072700*         06 WS-RDGR-FILLER2             PIC X(502).                          
072800*FIN BSR. MIGRACION PREPAGADA                                                 
072900*INI PCB. ESQ.REND.                                                           
073000          06 WS-RDGR-ESQ-REND            PIC 9(02).                           
073100          06 WS-RDGR-SGTO-REND           PIC 9(02).                           
073150          06 WS-RDGR-NIVE-CTA            PIC 9(02).                           
073152          06 WS-RDGR-VALREF-INTBCO       PIC 9(01).                           
073154*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
073156          06 WS-RDGR-MARCA-CLON          PIC 9(01).                           
073158*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
073200          06 WS-RDGR-FILLER2             PIC X(735).                          
073300*FIN PCB. ESQ.REND.                                                           
073400                                                                              
073500*---SIZE HASTA ANTES DE WS-REDOC-FILLER2 736 (TOTAL=943)                      
073600       04 WS-RESPUESTA-EDOCTA REDEFINES WS-SOL-MOVCONTABLE.                   
073700          06 WS-REDOC-PRODUCTO           PIC 9(04).                           
073800          06 WS-REDOC-INSTRUMENTO        PIC 9(04).                           
073900          06 WS-REDOC-MONEDA             PIC 9(03).                           
074000          06 WS-REDOC-NOMBRE             PIC X(36).                           
074100          06 WS-REDOC-SALDO-ACTUAL       PIC 9(14)V99.                        
074200          06 WS-REDOC-SIGNO-SDOACTUAL    PIC X.                               
074300          06 WS-REDOC-MOVIMIENTOS        OCCURS 24 TIMES.                     
074400             08 WS-REDOC-FECHA           PIC 9(06).                           
074500             08 WS-REDOC-TIPO            PIC X(10).                           
074600             08 WS-REDOC-IMPORTE         PIC 9(10)V99.                        
074700          06 WS-REDOC-FILLER             PIC X(357).                          
074800*---SIZE HASTA ANTES DE WS-RESR-FILLER2 258 (TOTAL=943)                       
074900       04 WS-RESP-RECHAZADA REDEFINES WS-SOL-MOVCONTABLE.                     
075000          06 WS-RESR-CLAVE-RECHAZO       PIC 9(04).                           
075100          06 WS-RESR-DETALLE-RECHAZO     PIC X(250).                          
075200          06 WS-RESR-DETALLE-RECHAZO-R REDEFINES                              
075300             WS-RESR-DETALLE-RECHAZO.                                         
075400             08 WS-RESR-CONCEPTO-RECHAZO PIC X(50).                           
075500             08 WS-RESR-STATUS-CONTRATO  PIC 9(02).                           
075600             08 WS-RESR-SALDO-ACTUAL     PIC 9(14)V99.                        
075700             08 WS-RESR-SIGNO-SDOACTUAL  PIC X.                               
075800             08 WS-RESR-SDO-DISPONIBLE   PIC 9(14)V99.                        
075900             08 WS-RESR-NOMBRE           PIC X(36).                           
076000             08 WS-RESR-FECHA-CONTABLE   PIC 9(06).                           
076100             08 WS-RESR-CONTRATO         PIC 9(12).                           
076200             08 WS-RESR-SDOACTPESOS-CMD  PIC 9(14)V99.                        
076300             08 WS-RESR-REFEREN-CGOPEND  PIC 9(12).                           
076400             08 WS-RESR-DISP-IMPRETCR    PIC 9(10)V99.                        
076500             08 WS-RESR-DISP-IMPDEPCR    PIC 9(10)V99.                        
076600             08 FILLER                   PIC X(09).                           
076700             08 WS-RESR-DETAESP          PIC X(050).                          
076800             08 WS-RESR-CVE776-R1 REDEFINES WS-RESR-DETAESP.                  
076900                10 WS-RESR-C776-O-PROD   PIC X(004).                          
077000                10 WS-RESR-C776-O-INST   PIC X(002).                          
077100                10 WS-RESR-C776-O-PREF   PIC X(004).                          
077200                10 WS-RESR-C776-O-CVEMAN PIC X(002).                          
077300                10 WS-RESR-C776-O-RGOPAG PIC X(002).                          
077400                10 WS-RESR-C776-O-OPCPAG PIC X(002).                          
077500                10 WS-RESR-C776-O-CVEENV PIC X(004).                          
077600                10 WS-RESR-C776-O-EDOCTA PIC X(004).                          
077700                10 WS-RESR-C776-C-PROD   PIC X(004).                          
077800                10 WS-RESR-C776-C-INST   PIC X(004).                          
077900                10 WS-RESR-C776-C-MON    PIC X(003).                          
078000                10 WS-RESR-C776-C-DIACORTE   PIC X(002).                      
078100                10 WS-RESR-C776-FILLER   PIC X(013).                          
078105*P0133291 Update Alerts and Notifications 1  LINEA, PCB 2019OCT23*            
078110          06 WS-RESR-IND-ALERTA          PIC 9(004).                          
078112          06 WS-RESR-CODI-TIMESTAMP      PIC 9(18).                           
078200          06 WS-RESR-FILLER2             PIC X(817).                          
078300                                                                              
078400*---SIZE HASTA ANTES DE WS-TEXTO2-RT 21 (TOTAL=943)                           
078500       04 WS-TEXTO2-RESPTERM REDEFINES WS-SOL-MOVCONTABLE.                    
078600          06 WS-RT-PRODUCTO              PIC 9(04).                           
078700          06 WS-RT-INSTRUMENTO           PIC 9(04).                           
078800          06 WS-RT-MONEDA                PIC 9(03).                           
078900          06 WS-RT-LLAVE-DIALOGO         PIC 9(06).                           
079000          06 WS-RT-SUC-PROMOTORA         PIC 9(04).                           
079100          06 WS-TEXTO2-RT                PIC X(1072).                         
079200                                                                              
079300*---SIZE HASTA ANTES DE WS-CT-FILLER 24 (TOTAL=943)                           
079400       04 WS-SOL-CONSULTA-TIME REDEFINES WS-SOL-MOVCONTABLE.                  
079500          06 WS-CT-CSI                   PIC 9(02).                           
079600          06 WS-CT-USER                  PIC 9(04).                           
079700          06 WS-CT-PASO                  PIC 9(03).                           
079800          06 WS-CT-COPIA                 PIC 9(02).                           
079900          06 WS-CT-SIG-PROC              PIC 9(03).                           
080000          06 WS-CT-PROC                  PIC 9(03).                           
080100          06 WS-CT-SIG-SUBPROC           PIC 9(03).                           
080200          06 WS-CT-MAX-MIN               PIC 9(01).                           
080300          06 WS-CT-CONT-PROC             PIC 9(03).                           
080400          06 WS-CT-FILLER                PIC X(1069).                         
080500                                                                              
080600*---SIZE HASTA ANTES DE WS-CPOSI-FILLER 847 (TOTAL=943)                       
080700       04 WS-SOL-CONSULTA-POSI REDEFINES WS-SOL-MOVCONTABLE.                  
080800          06 WS-CPOSI-CSI-NOM            PIC X(03).                           
080900          06 WS-CPOSI-CSI                PIC 9(02).                           
081000          06 WS-CPOSI-LIM-INF            PIC 9(02).                           
081100          06 WS-SOL-CPOSI-TBL OCCURS 21 TIMES.                                
081200             08 WS-CPOSI-PROD            PIC 9(04)    COMP.                   
081300             08 WS-CPOSI-INST            PIC 9(04)    COMP.                   
081400             08 WS-CPOSI-MONEDA          PIC 9(04)    COMP.                   
081500             08 WS-CPOSI-SDO-ANT         PIC 9(16)V99 COMP.                   
081600             08 WS-CPOSI-ABONOS          PIC 9(14)V99 COMP.                   
081700             08 WS-CPOSI-CARGOS          PIC 9(14)V99 COMP.                   
081800             08 WS-CPOSI-SDO-ACT         PIC 9(16)V99 COMP.                   
081900          06 WS-CPOSI-FILLER             PIC X(246).                          
082000                                                                              
082100*---SIZE HASTA ANTES DE WS-CD-FILLER 8  (TOTAL=943)                           
082200       04 WS-SOL-CONSULTA-DOLAR REDEFINES WS-SOL-MOVCONTABLE.                 
082300          06 WS-CD-MASINF                PIC 9(08).                           
082400          06 WS-CD-FILLER                PIC X(1085).                         
082500                                                                              
082600*---SIZE HASTA ANTES DE WS-CDR-FILLER 790  (TOTAL=943)                        
082700       04 WS-RES-CONSULTA-DOLAR REDEFINES WS-SOL-MOVCONTABLE.                 
082800          06 WS-RCD-OCURRENCIAS          PIC 9(02).                           
082900          06 WS-RCD-IND-MASINF           PIC 9(08).                           
083000          06 WS-RCD-DATOS OCCURS 12 TIMES.                                    
083100             08 WS-RCD-CVE-DIVISA-METAL  PIC 9(03).                           
083200             08 WS-RCD-MERCADO           PIC 9(02).                           
083300             08 WS-RCD-DENOMINACION      PIC 9(03).                           
083400             08 WS-RCD-COMPRA-TC-NORM    PIC 9(08)V9(06).                     
083500             08 WS-RCD-VTA-TC-NORM       PIC 9(08)V9(06).                     
083600             08 WS-RCD-COMPRA-TC-PREF    PIC 9(08)V9(06).                     
083700             08 WS-RCD-VTA-TC-PREF       PIC 9(08)V9(06).                     
083800             08 WS-RCD-IND-DIVISA-METAL  PIC 9(01).                           
083900          06 WS-RCD-FILLER               PIC X(303).                          
084000                                                                              
084100*---SIZE HASTA ANTES DE WS-AVISO-FILLER 73  (TOTAL=943)                       
084200       04 WS-SOL-AVISO-GCE REDEFINES WS-SOL-MOVCONTABLE.                      
084300          06 WS-AVISO-GCE                 PIC X(03).                          
084400          06 WS-BRANCH-CGE                PIC X(03).                          
084500          06 WS-STATUS-GCE                PIC X(06).                          
084600          06 WS-FECHA-PROCESO-GCE         PIC 9(08).                          
084700          06 WS-FECHA-MAQUINA-GCE         PIC 9(08).                          
084800          06 WS-HORA-MAQ-CGE              PIC 9(06).                          
084900          06 WS-AVISO-FILLER              PIC X(1059).                        
085000                                                                              
085100*---SIZE HASTA ANTES DE WS-RCCGOP-FILLER2 73 (TOTAL=943)                      
085200       04 WS-RES-CONSULTA-CGOPEND REDEFINES WS-SOL-MOVCONTABLE.               
085300          06 WS-RCCGOP-PRODUCTO           PIC 9(04).                          
085400          06 WS-RCCGOP-INSTRUMENTO        PIC 9(04).                          
085500          06 WS-RCCGOP-MONEDA             PIC 9(03).                          
085600          06 WS-RCCGOP-IMPORTE-ORI-CGO    PIC 9(12)V99.                       
085700          06 WS-RCCGOP-IMPORTE-COBRADO    PIC 9(12)V99.                       
085800          06 WS-RCCGOP-IMPORTE-DEUDOR     PIC 9(12)V99.                       
085900          06 WS-RCCGOP-FECHA-CONTABLE     PIC 9(06).                          
086000          06 WS-RCCGOP-STATUS-MEDACCES    PIC 9(02).                          
086100          06 WS-RCCGOP-REFEREN-CGOPEND    PIC 9(12).                          
086102*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
086104          06 WS-RCCGOP-MARCA-CLON         PIC 9(01).                          
086106*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
086200          06 WS-RCCGOP-FILLER2            PIC X(1019).                        
086300                                                                              
086400*---SIZE HASTA ANTES DE WS-RPCXCTA-FILLER2 852 (TOTAL=943)                    
086500       04 WS-RES-CONSULTA-PCXCTA  REDEFINES WS-SOL-MOVCONTABLE.               
086600          06 WS-RPCXCTA-TIPMEDACC         PIC 9(002).                         
086700          06 WS-RPCXCTA-NUM-SUCURSAL      PIC 9(004).                         
086800          06 WS-RPCXCTA-NUM-CTA-CTO       PIC 9(012).                         
086900          06 WS-RPCXCTA-NUMREGS           PIC 9(002).                         
087000          06 WS-RPCXCTA-CONTINUIDAD       PIC 9(002).                         
087100          06 WS-RPCXCTA-PAGOS OCCURS 10 TIMES.                                
087200             08 WS-RPCXCTA-TIPO           PIC 9(002).                         
087300             08 WS-RPCXCTA-FECLIN         PIC 9(008).                         
087400             08 WS-RPCXCTA-IMP-ORI        PIC 9(010)V99.                      
087500             08 WS-RPCXCTA-SDO-PEND       PIC 9(010)V99.                      
087600             08 WS-RPCXCTA-FECH-ULTPAGO   PIC 9(008).                         
087700             08 WS-RPCXCTA-NUM-STATUS     PIC 9(002).                         
087800                88 WS-88-RPCXCTA-STA-VIG  VALUE 0.                            
087900                88 WS-88-RPCXCTA-STA-ELI  VALUE 1.                            
088000                88 WS-88-RPCXCTA-STA-CAN  VALUE 2.                            
088100                88 WS-88-RPCXCTA-STA-PAG  VALUE 3.                            
088200                88 WS-88-RPCXCTA-STA-VEN  VALUE 4.                            
088300                88 WS-88-RPCXCTA-STA-NID  VALUE 5.                            
088400             08 WS-RPCXCTA-DESC-STATUS    PIC X(013).                         
088500             08 WS-RPCXCTA-AUTSEQ         PIC 9(008).                         
088600             08 WS-RPCXCTA-PRIORI         PIC 9(002).                         
088700             08 WS-RPCXCTA-CVECOBRO       PIC 9(004).                         
088800             08 WS-RPCXCTA-REFEREN        PIC 9(012).                         
088802*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
088804          06 WS-RPCXCTA-MARCA-CLON        PIC 9(01).                          
088806*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
088810          06 WS-RPCXCTA-FILLER2           PIC X(240).                         
088900                                                                              
089000*---SIZE HASTA ANTES DE WS-CPENXSUC-FILLER 75 (TOTAL=943)                     
089100       04 WS-SOL-CONSULTA-CPEN-XSUC REDEFINES WS-SOL-MOVCONTABLE.             
089200          06 WS-CPENXSUC-CVE-TRANS        PIC 9(04).                          
089300          06 WS-CPENXSUC-LL1-SUC-TRANS    PIC 9(04).                          
089400          06 WS-CPENXSUC-LL1-CAJ-TRANS    PIC 9(02).                          
089500          06 WS-CPENXSUC-LL1-FEC-CONTA    PIC 9(08).                          
089600          06 WS-CPENXSUC-LL1-AUT          PIC 9(08).                          
089700          06 WS-CPENXSUC-LL2-SUC-TRANS    PIC 9(04).                          
089800          06 WS-CPENXSUC-LL2-CAJ-TRANS    PIC 9(02).                          
089900          06 WS-CPENXSUC-LL2-FEC-CONTA    PIC 9(08).                          
090000          06 WS-CPENXSUC-LL2-AUT          PIC 9(08).                          
090100          06 WS-CPENXSUC-NUMREGS          PIC 9(02).                          
090200*            NUMREGS PUEDE VALER HASTA 08 INCLUSIVE                           
090300          06 WS-CPENXSUC-IND-LF           PIC 9(01).                          
090400             88 WS-CPENXSUC-IND-LOCAL     VALUE 0.                            
090500             88 WS-CPENXSUC-IND-FORANEO   VALUE 1.                            
090600          06 WS-CPENXSUC-IMP-ORI-TOT      PIC 9(10)V99.                       
090700          06 WS-CPENXSUC-SDO-PEND-TOT     PIC 9(10)V99.                       
090800          06 WS-CPENXSUC-FILLER           PIC X(1018).                        
090900                                                                              
091000*---SIZE HASTA ANTES DE WS-SBCT6-FILLER 30    (TOTAL=943)                     
091100       04 WS-SOL-CONSULTA-SBCT6 REDEFINES WS-SOL-MOVCONTABLE.                 
091200          06 WS-SBCT6-CVE-TRANS           PIC 9(04).                          
091300          06 WS-SBCT6-TIPMEDACC           PIC 9(02).                          
091400          06 WS-SBCT6-TARJETA             PIC 9(16).                          
091500          06 WS-SBCT6-MEDACC-CTA REDEFINES WS-SBCT6-TARJETA.                  
091600             08 WS-SBCT6-NUM-SUCURSAL     PIC 9(04).                          
091700             08 WS-SBCT6-NUM-CTA-CTO      PIC 9(12).                          
091800          06 WS-SBCT6-NOMINA              PIC 9(08).                          
091900          06 WS-SBCT6-FILLER              PIC X(1063).                        
092000*                                                                             
092100*---SIZE HASTA ANTES DE WS-SFM-FILLER 227  (TOTAL=943)                        
092200       04 WS-SOL-FRAUD-MANAGER  REDEFINES WS-SOL-MOVCONTABLE.                 
092300          06 WS-SFM-ID-MENSAJE.                                               
092400             08 WS-SFM-ID-FECHA             PIC 9(008).                       
092500             08 WS-SFM-ID-FOLIO             PIC 9(023).                       
092600             08 FILLER                      PIC X(019).                       
092700          06 WS-SFM-CTR-DATOS               PIC X(021).                       
092800          06 WS-SFM-REF-ID-TRANSACCION      PIC X(050).                       
092900          06 WS-SFM-NUM-BANCO               PIC 9(004).                       
093000          06 WS-SFM-NUM-CUENTA              PIC 9(017).                       
093100          06 WS-SFM-ID-CLIENTE              PIC X(020).                       
093200          06 WS-SFM-ID-TERMINAL             PIC X(020).                       
093300          06 WS-SFM-NUM-CHEQUE              PIC 9(015).                       
093400          06 WS-SFM-IMP-CHEQUE              PIC X(019).                       
093500          06 WS-SFM-IMP-CHEQUE-Z            REDEFINES                         
093600             WS-SFM-IMP-CHEQUE.                                               
093700             09 WS-SFM-IMP-CHEQUE-ENT       PIC 9(016).                       
093800             09 WS-SFM-IMP-CHEQ-POINT       PIC X(001).                       
093900             09 WS-SFM-IMP-CHEQUE-DEC       PIC 9(002).                       
094000          06 WS-SFM-FEC-TRANSACCION         PIC 9(008).                       
094100          06 WS-SFM-FEC-TRANSACCION-R REDEFINES                               
094200             WS-SFM-FEC-TRANSACCION.                                          
094300             09 WS-SFM-FEC-TRA-DD           PIC 9(002).                       
094400             09 WS-SFM-FEC-TRA-MM           PIC 9(002).                       
094500             09 WS-SFM-FEC-TRA-AAAA         PIC 9(004).                       
094600          06 WS-SFM-IND-DETECCION-FM        PIC X(001).                       
094700          06 WS-SFM-IND-REVERSA             PIC X(001).                       
094800          06 WS-SFM-IND-PRUEBA              PIC X(001).                       
094900          06 WS-SFM-FILLER                  PIC X(866).                       
095000*                                                                             
095100*---SIZE HASTA ANTES DE WS-SFM-FILLER 304  (TOTAL=943)                        
095200       04 WS-RFM-FRAUD-MANAGER  REDEFINES WS-SOL-MOVCONTABLE.                 
095300          06 WS-RFM-ID-MENSAJE.                                               
095400             08 WS-RFM-ID-FECHA             PIC 9(008).                       
095500             08 WS-RFM-ID-FOLIO             PIC 9(023).                       
095600             08 FILLER                      PIC X(019).                       
095700          06 WS-RFM-CTR-DATOS               PIC X(021).                       
095800          06 WS-RFM-CTR-RESULTADO           PIC X(050).                       
095900          06 WS-RFM-IND-ALERTA              PIC X(001).                       
096000          06 WS-RFM-CTR-BLOQUE              PIC X(001).                       
096100          06 WS-RFM-CTR-SCORE               PIC 9(005).                       
096200          06 WS-RFM-CTR-MENSAJE             PIC X(050).                       
096300          06 WS-RFM-REF-ID-TRANSACCION      PIC X(050).                       
096400          06 WS-RFM-NUM-BANCO               PIC X(004).                       
096500          06 WS-RFM-NUM-CUENTA              PIC 9(017).                       
096600          06 WS-RFM-ID-CLIENTE              PIC X(020).                       
096700          06 WS-RFM-ID-TERMINAL             PIC X(020).                       
096800          06 WS-RFM-NUM-CHEQUE              PIC 9(015).                       
096900          06 WS-RFM-FILLER                  PIC X(789).                       
097000*                                                                             
097100*---SIZE HASTA ANTES DE WS-SBCT6-FILLER 151   (TOTAL=943)                     
097200       04 WS-RESP-CONSULTA-SBCT6 REDEFINES WS-SOL-MOVCONTABLE.                
097300          06 WS-RSBCT6-PRODUCTO            PIC 9(04).                         
097400          06 WS-RSBCT6-INSTRUMENTO         PIC 9(04).                         
097500          06 WS-RSBCT6-MONEDA              PIC 9(03).                         
097600          06 WS-RSBCT6-SALDO-PENDIENTE     PIC 9(12)V99.                      
097700          06 WS-RSBCT6-SALDO-SBC-TRAD      PIC 9(12)V99.                      
097800          06 WS-RSBCT6-SALDO-SBCT6 OCCURS 6 TIMES PIC 9(12)V99.               
097900          06 WS-RSBCT6-STATUS-CONTRATO     PIC 9(02).                         
098000          06 WS-RSBCT6-STATUS-MEDACCES     PIC 9(02).                         
098100          06 WS-RSBCT6-IND-CTAENOBS        PIC 9(02).                         
098200          06 WS-RSBCT6-CTAOBS-CVE          PIC 9(02).                         
098300          06 WS-RSBCT6-CTAOBS-LEYENDA      PIC X(20).                         
098302*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
098304          06 WS-RSBCT6-MARCA-CLON          PIC 9(01).                         
098306*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
098400          06 WS-RSBCT6-FILLER              PIC X(941).                        
098500                                                                              
098600*---SIZE HASTA ANTES DE WS-RCP-FILLER 446   (TOTAL=943)                       
098700       04 WS-RESP-CONSULTA-COMPEND REDEFINES WS-SOL-MOVCONTABLE.              
098800          06 WS-RCP-ULTCOM                PIC 9(02).                          
098900          06 WS-RCP-IMPSIVA-TOTAL         PIC 9(10)V99.                       
099000          06 WS-RCP-IMPIVA-TOTAL          PIC 9(10)V99.                       
099100          06 WS-RCP-COMIS-PEND OCCURS 10 TIMES.                               
099200             08 WS-RCP-OCURRENCIA         PIC 9(02).                          
099300             08 WS-RCP-CONCEPTO           PIC X(20).                          
099400             08 WS-RCP-IMPSIVA            PIC 9(08)V99.                       
099500             08 WS-RCP-IMPIVA             PIC 9(08)V99.                       
099502*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
099504          06 WS-RCP-MARCA-CLON            PIC 9(01).                          
099506*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
099600          06 WS-RCP-FILLER                PIC X(646).                         
099700*---SIZE HASTA ANTES DE WS-RTP-FILLER  2  (TOTAL=943)                         
099800       04 WS-RTP-CONS-TIPO-PROCESO REDEFINES WS-SOL-MOVCONTABLE.              
099900          06 WS-RTP-TIPO-PROCESO          PIC 9(02).                          
100000          06 WS-RTP-FILLER                PIC X(1091).                        
100050       04 FILLER                          PIC X(702).                         
100060    02 WS-TEXTO-MENSAJE-SA2  REDEFINES   WS-TEXTO.                            
100070*--SIZE 89                                                                    
100080       04 WS-HDR-APLICACION               PIC X(089).                         
100090*         WS-HDR-FM-AMP      9(012)                                           
100100*         WS-HDR-FM-SA0      X(030)                                           
100110*         WS-HDR-FM-SA2      X(047)                                           
100120*--SIZE 1795                                                                  
100130       04 WS-TEXTO-MENSAJE                PIC X(1795).                        
100140       04 WS-TEXTO-MSG-CONSMULTI REDEFINES WS-TEXTO-MENSAJE.                  
100150          06 WS-RESP-CONS-MULTI-1         PIC X(852).                         
100160          06 WS-RESP-CONS-MULTI-2         PIC X(340).                         
100170          06 FILLER                       PIC X(603).                         
100180*                                                                             
100600*INI FSW                  P07-120 REQ3                    ABARBOSA            
100700     02 WS-TEXTO-MSG-BEL          REDEFINES                                   
100800        WS-TEXTO.                                                             
100900        04 WS-BEL-CODIGO          PIC 9(0001).                                
101000           88 W88-BEL-COD-SOL     VALUE 5.                                    
101100           88 W88-BEL-COD-RES-OK  VALUE 6.                                    
101200           88 W88-BEL-COD-RES-NOK VALUE 7.                                    
101300           88 W88-BEL-COD-RES-VAL VALUE 6, 7.                                 
101400        04 WS-BEL-COD-RES         PIC 9(0005).                                
101500        04 WS-BEL-REF-Y-DATOS     PIC X(1878).                                
101600        04 WS-BEL-REF-Y-DATOS-S   REDEFINES                                   
101700           WS-BEL-REF-Y-DATOS.                                                
101800           06 WS-SBEL-TRANSACCION PIC 9(0003).                                
101900              88 W88-SBEL-CGO         VALUE 352.                              
102000              88 W88-SBEL-ELI-CGO     VALUE 356.                              
102100           06 FILLER              PIC X(0001).                                
102200           06 WS-SBEL-DATOS       PIC X(1874).                                
102300           06 WS-SBEL-DATOS-1     REDEFINES                                   
102400              WS-SBEL-DATOS.                                                  
102500              08 WS-SBEL-NUM-TARJ PIC 9(0016).                                
102600              08 FILLER           PIC X(0001).                                
102700              08 WS-SBEL-IMPORTE  PIC 9(0010)V99.                             
102800              08 FILLER           PIC X(0001).                                
102900              08 WS-SBEL-REFERENC PIC 9(0006).                                
103000              08 FILLER           PIC X(0001).                                
103100              08 WS-SBEL-FECHA    PIC 9(0006).                                
103200              08 FILLER           PIC X(0001).                                
103300              08 WS-SBEL-HORA     PIC 9(0006).                                
103400              08 FILLER           PIC X(0028).                                
103500              08 WS-SBEL-SISTEMA  PIC X(0004).                                
103600              08 FILLER           PIC X(0001).                                
103700              08 WS-SBEL-INDICA   PIC 9(0001).                                
103800              08 WS-SBEL-FILLER   PIC X(1790).                                
103900        04 WS-BEL-REF-Y-DATOS-E1  REDEFINES                                   
104000           WS-BEL-REF-Y-DATOS.                                                
104100           06 WS-EBEL-AUTORIZ     PIC 9(0006).                                
104200           06 WS-EBEL-SALDO       PIC 9(0010)V99.                             
104300           06 WS-EBEL-SIG-SDO     PIC X(0001).                                
104400           06 WS-EBEL-FEC-APL     PIC 9(0006).                                
104500           06 WS-EBEL-REFERENC    PIC 9(0006).                                
104600           06 FILLER              PIC X(1847).                                
104700        04 WS-BEL-REF-Y-DATOS-E2  REDEFINES                                   
104800           WS-BEL-REF-Y-DATOS.                                                
104900           06 WS-EBEL-CVE-ERROR   PIC 9(0004).                                
105000              88 W88-EBEL-ERR-OK  VALUE  1,  5, 16, 20, 30, 31,               
105100                                        35, 40, 41, 42, 68.                   
105200           06 WS-EBEL-REF-ERROR   PIC 9(0006).                                
105300           06 FILLER              PIC X(1868).                                
105400*FIN FSW                  P07-120 REQ3                    ABARBOSA            
105500*INI FSW                  P09-XXX  Afews                  ABARBOSA            
105600 01 WS-SOL-AFEWS                            PIC X(1795).                      
105700 01 WS-SOL-AFEWS-R01 REDEFINES WS-SOL-AFEWS.                                  
105800    02 WS-SAF-ACCT-CTRY-CD            PIC  X(02).                             
105900    02 WS-SAF-PROD-CD                 PIC  9(05).                             
106000    02 WS-SAF-PROD-PROC-CD            PIC  X(05).                             
106100    02 WS-SAF-TXN-CHANNEL             PIC  X(05).                             
106200    02 WS-SAF-TXN-TYPE                PIC  X(04).                             
106300    02 WS-SAF-CR-DB-IND               PIC  X(01).                             
106400    02 WS-SAF-TXN-CD                  PIC  X(04).                             
106500    02 WS-SAF-ACCT-NBR                PIC  9(20).                             
106600    02 WS-SAF-ACCT-CURR-CD            PIC  X(03).                             
106700    02 WS-SAF-GRB-CUST-NBR            PIC  9(20).                             
106800    02 WS-SAF-CUST-PROF               PIC  X(03).                             
106900    02 WS-SAF-CARD-NBR                PIC  9(20).                             
107000    02 WS-SAF-GRB-RELN-NBR            PIC  9(20).                             
107100    02 WS-SAF-TXN-DATE                PIC  9(08).                             
107200    02 WS-SAF-TXN-TIME                PIC  9(06).                             
107300    02 WS-SAF-AMT-TXN-CURR            PIC  9(15)V99.                          
107400    02 WS-SAF-TXN-CURR-CD             PIC  X(03).                             
107500    02 WS-SAF-AMT-ACCT-CURR           PIC  9(15)V99.                          
107600    02 WS-SAF-BRANCH-CD               PIC  9(08).                             
107700    02 WS-SAF-TXN-CTRY                PIC  X(02).                             
107800    02 WS-SAF-TXN-STATE               PIC  X(25).                             
107900    02 WS-SAF-TXN-CITY                PIC  X(25).                             
108000    02 WS-SAF-ACQ-ID                  PIC  X(23).                             
108100    02 WS-SAF-MERCH-ID                PIC  X(15).                             
108200    02 WS-SAF-MERCH-DESC              PIC  X(40).                             
108300    02 WS-SAF-TERM-ID                 PIC  X(20).                             
108400    02 WS-SAF-TERM-ID-R REDEFINES WS-SAF-TERM-ID.                             
108500       04 WS-SAF-TRM-STA-TIPO         PIC  X(01).                             
108600       04 WS-SAF-TRM-STA-SUC          PIC  9(04).                             
108700       04 WS-SAF-TRM-STA-PRIV         PIC  X(01).                             
108800       04 WS-SAF-TRM-STA-CAJA         PIC  9(02).                             
108900       04 WS-SAF-TRM-FILLER           PIC  X(12).                             
109000    02 WS-SAF-MCC                     PIC  X(04).                             
109100    02 WS-SAF-POS-MODE                PIC  X(04).                             
109200    02 WS-SAF-RESP-CD                 PIC  X(02).                             
109300    02 WS-SAF-DECL-RSN                PIC  9(05).                             
109400    02 WS-SAF-EXP-DATE                PIC  9(04).                             
109500    02 WS-SAF-OTH-ACCT-NBR            PIC  X(34).                             
109600    02 WS-SAF-OTH-PROD-CD             PIC  9(05).                             
109700    02 WS-SAF-OTH-BANK-CD             PIC  9(08).                             
109800    02 WS-SAF-OTH-BRANCH-CD           PIC  9(08).                             
109900    02 WS-SAF-OTH-ACCT-NAME           PIC  X(40).                             
110000    02 WS-SAF-OTH-ACCT-ADD1           PIC  X(40).                             
110100    02 WS-SAF-OTH-ACCT-ADD2           PIC  X(40).                             
110200    02 WS-SAF-OTH-ACCT-CITY           PIC  X(25).                             
110300    02 WS-SAF-OTH-ACCT-STATE          PIC  X(25).                             
110400    02 WS-SAF-OTH-ACCT-CTRY           PIC  X(02).                             
110500    02 WS-SAF-OTH-ACCT-ZIP            PIC  X(12).                             
110600    02 WS-SAF-CHEQ-NBR                PIC  9(16).                             
110700    02 WS-SAF-CHEQ-STATUS             PIC  X(02).                             
110800    02 WS-SAF-DUP-CHEQ-FLAG           PIC  X(01).                             
110900    02 WS-SAF-FLOAT-DAYS              PIC  9(03).                             
111000    02 WS-SAF-ACCT-BAL                PIC  9(15)V99.                          
111100    02 WS-SAF-ACCT-LEDG-BAL           PIC  9(15)V99.                          
111200    02 WS-SAF-PERS-AMT-THRSHLD        PIC  9(15)V99.                          
111300    02 WS-SAF-IP-ADDRESS              PIC  X(25).                             
111400    02 WS-SAF-MAC-ADDRESS             PIC  X(25).                             
111500    02 WS-SAF-UNIQ-REF                PIC  X(25).                             
111600    02 WS-SAF-ACCT-STATUS             PIC  X(03).                             
111700    02 WS-SAF-ACCT-CLOSE-RSN          PIC  X(01).                             
111800    02 WS-SAF-TRM-DEP-MAT-DATE        PIC  X(10).                             
111900    02 WS-SAF-BLK-RSN-CD              PIC  X(02).                             
112000    02 WS-SAF-CASH-WITHDRAW-DYS       PIC  9(03).                             
112100    02 WS-SAF-CASH-PROC-PRD           PIC  9(03).                             
112200    02 WS-SAF-CASH-WITH-PER           PIC  9(02)V99.                          
112300    02 WS-SAF-PAY-BANK-CD             PIC  X(05).                             
112400    02 WS-SAF-PAY-BANK-NAME           PIC  X(40).                             
112500    02 WS-SAF-PAY-BRANCH-CD           PIC  X(05).                             
112600    02 WS-SAF-PAY-ACCT-NBR            PIC  X(34).                             
112700    02 WS-SAF-PAY-NAME                PIC  X(40).                             
112800    02 WS-SAF-PAY-MODE                PIC  X(07).                             
112900    02 WS-SAF-BEG-CHEQ-SRL-NBR        PIC  X(10).                             
113000    02 WS-SAF-END-CHEQ-SRL-NBR        PIC  X(10).                             
113100    02 WS-SAF-BAFES-TRAN-CODE         PIC  9(04).                             
113200    02 WS-SAF-AUTH-DESC               PIC  X(15).                             
113300    02 WS-SAF-APPROVAL-CODE           PIC  9(06).                             
113400    02 WS-SAF-ONL-ERR-RETN-MSG        PIC  X(40).                             
113500    02 WS-SAF-ADDTL-TRAN-DESC1        PIC  X(40).                             
113600    02 WS-SAF-ADDTL-TRAN-DESC2        PIC  X(40).                             
113700    02 WS-SAF-ADDTL-TRAN-DESC3        PIC  X(40).                             
113800    02 WS-SAF-ADDTL-TRAN-DESC4        PIC  X(40).                             
113900    02 WS-SAF-USER-DATA-1             PIC  X(20).                             
114000    02 WS-SAF-USER-DATA-1-R REDEFINES WS-SAF-USER-DATA-1.                     
114100       06 WS-SAF-USER-D1-COVERT       PIC  X(03).                             
114200       06 WS-SAF-USER-D1-FILLER       PIC  X(17).                             
114300    02 WS-SAF-USER-DATA-2             PIC  X(20).                             
114400*el total del texto es de 1169                           >>> Afews            
114500    02 WS-SAF-FILLER                  PIC  X(626).                            
114600                                                                              
114700*FIN FSW                  P09-XXX  Afews                  ABARBOSA            
114800                                                                              
114900*                                                                             
115000$POP OMIT                                                                     
115100$SET OMIT = NOT ESQCOMIS                                                      
115200 77  W77-IND-CB05                PIC 9(04)      COMP.                         
115300 77  W77-COB-RESUM-ANH           PIC 9(01)      COMP.                         
115400 77  W77-IND-EST                 PIC 9(01)      COMP.                         
115500 77  W77-IND-MAA                 PIC 9(01)      COMP.                         
115600 77  W77-HAY-TEF                 PIC 9(01)      COMP.                         
115700 77  W77-HAY-GPOTEF              PIC 9(01)      COMP.                         
115800 77  W77-HAY-GPOSOCIO            PIC 9(01)      COMP.                         
115900 77  W77-HAY-ESQCOMTEF           PIC 9(01)      COMP.                         
116000 77  W77-VE-ESQCTEF              PIC 9(02)      COMP.                         
116100 77  W77-ESQCOMI-S016            PIC 9(02)      COMP.                         
116200 77  W77-VIO-L422                PIC 9(02)      COMP.                         
116300 01  WKS-VAR-ESQCOMI-GRAL.                                                    
116400     02 WS-IND-ESQC              PIC 9(04)      BINARY.                       
116500     02 WS-IND-ESQC-CTO          PIC 9(04)      BINARY.                       
116600                                                                              
116700$POP OMIT                                                                     
116800$SET OMIT = NOT FECHA2000                                                     
116900******* VARIABLES PARA EL MANEJO DEL AAAA-2000 **************                 
117000 01 WKS-VARIALBES-AA-2000.                                                    
117100    02 WKS-FEC-2000-08        PIC 9(08).                                      
117200    02 RD1-WKS-FEC-2000-08    REDEFINES WKS-FEC-2000-08.                      
117300       04 WKS-AAAA-2000       PIC 9(04).                                      
117400       04 FILLER              PIC X(04).                                      
117500    02 RD2-WKS-FEC-2000-08    REDEFINES WKS-FEC-2000-08.                      
117600       04 WKS-AA1-2000        PIC 99.                                         
117700       04 WKS-FEC-2000-06     PIC 9(06).                                      
117800       04 RD-WKS-FEC-2000-06  REDEFINES WKS-FEC-2000-06.                      
117900          06 WKS-AA-2000      PIC 9(02).                                      
118000          06 WKS-MM-2000      PIC 9(02).                                      
118100          06 WKS-DD-2000      PIC 9(02).                                      
118200                                                                              
118300    02 WKS-FMAQ-2000            PIC X(10) TYPE IS NUMERIC-DATE.               
118400    02 RD-WKS-FMAQ-2000         REDEFINES WKS-FMAQ-2000.                      
118500       04 WKS-MM-FMAQ-2000      PIC 99.                                       
118600       04 FILLER                PIC X.                                        
118700       04 WKS-DD-FMAQ-2000      PIC 99.                                       
118800       04 FILLER                PIC X.                                        
118900       04 WKS-AAAA-FMAQ-2000    PIC 9(04).                                    
119000       04 RD-WKS-AAAA-FMAQ-2000 REDEFINES WKS-AAAA-FMAQ-2000.                 
119100          06 WKS-AA1-FMAQ-2000  PIC 99.                                       
119200          06 WKS-AA2-FMAQ-2000  PIC 99.                                       
119300                                                                              
119400    02 WKS-FEC-MAQ-08         PIC 9(08).                                      
119500    02 RD1-WKS-FEC-MAQ-08     REDEFINES WKS-FEC-MAQ-08.                       
119600       04 WKS-AAAA-MAQ        PIC 9(04).                                      
119700       04 FILLER              PIC X(04).                                      
119800    02 RD2-WKS-FEC-MAQ-08     REDEFINES WKS-FEC-MAQ-08.                       
119900       04 WKS-AA1-MAQ         PIC 99.                                         
120000       04 WKS-FEC-MAQ         PIC 9(06).                                      
120100       04 WKS-RD-FEC-MAQ      REDEFINES WKS-FEC-MAQ.                          
120200          06 WKS-AA-MAQ       PIC 9(02).                                      
120300          06 WKS-MM-MAQ       PIC 9(02).                                      
120400          06 WKS-DD-MAQ       PIC 9(02).                                      
120500                                                                              
120600    02 WKS-FMAQ-DMA           PIC 9(08).                                      
120700    02 RD1-WKS-FMAQ-DMA       REDEFINES WKS-FMAQ-DMA.                         
120800       04 WKS-DD-FMAQ-DMA     PIC 9(02).                                      
120900       04 WKS-MM-FMAQ-DMA     PIC 9(02).                                      
121000       04 WKS-AAAA-FMAQ-DMA   PIC 9(04).                                      
121100       04 RD1-WKS-AAAA-FMAQ-DMA REDEFINES WKS-AAAA-FMAQ-DMA.                  
121200          06 WKS-SS-FMAQ-DMA  PIC 9(02).                                      
121300          06 WKS-AA-FMAQ-DMA  PIC 9(02).                                      
121400                                                                              
121500$POP OMIT                                                                     
121600*****************************************************************             
121700*    VARIABLES PARA USO DE DISPLAYS                             *             
121800*****************************************************************             
121900* WS-0101-CODI-MSG  = FIJO 051010                               *             
122000* WS-0101-TIPO-MSG  = FIJO 02                                   *             
122100* WS-0101-SYST-MSG  = NUMERO DE SISTEMA. (S500)  FIJO           *             
122200* WS-0101-PASO-MSG  = NUMERO DE PASO     (P010)  POR PASO       *             
122300* WS-0101-MTP-MSG   = NUMERO DE VERSION (01MTP001) POR PASO     *             
122400* WS-0101-TEXT-MSG  = TEXTO DE MENSAJE (200 POSICIONES MAX)     *             
122500*                                                               *             
122600*****************************************************************             
122700 77 W77-USO-LIBLJ              PIC 9      VALUE 0.                            
122800 01 WS-0101-MENSAJE.                                                          
122900     02 WS-0101-CODI-MSG    PIC 9(06)  VALUE 051010.                          
123000     02 FILLER              PIC X      VALUE "-".                             
123100     02 WS-0101-TIPO-MSG    PIC 9(02)  VALUE 02.                              
123200     02 FILLER              PIC X      VALUE "-".                             
123300     02 WS-0101-SYST-MSG    PIC X(04)  VALUE "S500".                          
123400     02 FILLER              PIC X      VALUE "-".                             
123500     02 WS-0101-PASO-MSG    PIC X(04)  VALUE "PXXX".                          
123600     02 FILLER              PIC X      VALUE "-".                             
123700     02 WS-0101-MTP-MSG     PIC X(08)  VALUE "XXMTPXXX".                      
123800     02 RD-WS-0101-MTP-MSG  REDEFINES WS-0101-MTP-MSG.                        
123900        04 FILLER           PIC X(05).                                        
124000        04 WS-0101-NUM-MTP  PIC 9(03).                                        
124100     02 FILLER              PIC X      VALUE " ".                             
124200    02 WS-0101-TEXT-MSG    PIC X(200).                                        
124300                                                                              
124400  01 WS-VARIALBES-MSG.                                                        
124500     02 WS-MSG-N-01         PIC 9(01).                                        
124600     02 WS-MSG-N-01-2       PIC 9(01).                                        
124700     02 WS-MSG-N-02         PIC 9(02).                                        
124800     02 WS-MSG-N-02-2       PIC 9(02).                                        
124900     02 WS-MSG-N-04         PIC 9(04).                                        
125000     02 WS-MSG-N-06         PIC 9(06).                                        
125100     02 WS-MSG-N-08         PIC 9(08).                                        
125200     02 WS-MSG-N-10         PIC 9(10).                                        
125300     02 WS-MSG-N-12         PIC 9(12).                                        
125400     02 WS-MSG-N-14         PIC 9(14).                                        
125500     02 WS-MSG-N-16         PIC 9(16).                                        
125600     02 WS-MSG-CTO          PIC 9(12).                                        
125700     02 WS-MSG-CTA          PIC 9(12).                                        
125800     02 WS-MSG-IMP          PIC 9(10)V99.                                     
125900     02 WS-MSG-IMPEDIT      PIC ZZZ,ZZZ,ZZZ,ZZ9.99.                           
126000     02 WS-MSG-NUMEDIT      PIC ZZZ,ZZZ,ZZZ.                                  
126100     02 WS-MSG-PORCEDIT     PIC ZZ9.99.                                       
126200     02 WS-MSG-PRD          PIC 9(04).                                        
126300     02 WS-MSG-SUC          PIC 9(04).                                        
126400     02 WS-MSG-INST         PIC 9(04).                                        
126500     02 WS-MSG-MDA          PIC 9(03).                                        
126600     02 WS-MSG-PERS         PIC 9(02).                                        
126700     02 WS-MSG-TARIF        PIC 9(04).                                        
126800     02 WS-MSG-PASO         PIC 9(03).                                        
126900     02 WS-MSG-CVE          PIC 9(04).                                        
127000     02 WS-MSG-RS           PIC 9(04)-.                                       
127100     02 WS-MSG-X15          PIC X(15).                                        
127200                                                                              
127300************************************************************                  
127400 01 WS-0102-MENSAJE.                                                          
127500    02 FILLER               PIC X(07)   VALUE "S151RS=".                      
127600    02 WS-0102-RESU-MSG     PIC 9(5)-.                                        
127700    02 FILLER               PIC X       VALUE " ".                            
127800    02 WS-0102-PROD-MSG     PIC 9(04).                                        
127900    02 FILLER               PIC X       VALUE " ".                            
128000    02 WS-0102-INST-MSG     PIC 9(04).                                        
128100    02 FILLER               PIC X       VALUE " ".                            
128200    02 WS-0102-MONE-MSG     PIC 9(03).                                        
128300    02 FILLER               PIC X       VALUE " ".                            
128400    02 WS-0102-CTO-MSG      PIC 9(12).                                        
128500    02 FILLER               PIC X       VALUE " ".                            
128600    02 WS-0102-IMPORT-MSG.                                                    
128700       04 WS-0102-CVE-MSG      PIC 9(04).                                     
128800       04 FILLER               PIC X      VALUE " ".                          
128900       04 WS-0102-IMP-MSG      PIC ZZZ,ZZZ,ZZZ,ZZZ.ZZ.                        
129000       04 FILLER               PIC X      VALUE " ".                          
129100                                                                              
129200*****************************************************************             
129300*             VARIABLES PARA EL USO DE LA BASE                  *             
129400*****************************************************************             
129500 01  WS-TABLA-ERRORES-BASE.                                                   
129600     02 FILLER               PIC X(15) VALUE "NOT FOUND      ".               
129700     02 FILLER               PIC X(15) VALUE "DUPLICATES     ".               
129800     02 FILLER               PIC X(15) VALUE "DEADLOCK       ".               
129900     02 FILLER               PIC X(15) VALUE "DATAERROR      ".               
130000     02 FILLER               PIC X(15) VALUE "NOT LOCKED     ".               
130100     02 FILLER               PIC X(15) VALUE "KEYCHANGED     ".               
130200     02 FILLER               PIC X(15) VALUE "SYSTEMERROR    ".               
130300     02 FILLER               PIC X(15) VALUE "READONLY       ".               
130400     02 FILLER               PIC X(15) VALUE "IOERROR        ".               
130500     02 FILLER               PIC X(15) VALUE "LIMITERROR     ".               
130600     02 FILLER               PIC X(15) VALUE "OPEN ERROR     ".               
130700     02 FILLER               PIC X(15) VALUE "CLOSE ERROR    ".               
130800     02 FILLER               PIC X(15) VALUE "NORECORD       ".               
130900     02 FILLER               PIC X(15) VALUE "INUSE          ".               
131000     02 FILLER               PIC X(15) VALUE "AUDIT ERROR    ".               
131100     02 FILLER               PIC X(15) VALUE "ABORT          ".               
131200     02 FILLER               PIC X(15) VALUE "SECURITY ERROR ".               
131300     02 FILLER               PIC X(15) VALUE "VERSION ERROR  ".               
131400     02 FILLER               PIC X(15) VALUE "FATAL ERROR    ".               
131500     02 FILLER               PIC X(15) VALUE "INTEGRITY ERROR".               
131600     02 FILLER               PIC X(15) VALUE "PARAMETER ERROR".               
131700                                                                              
131800 01  WS-TABLA-ERR-DB REDEFINES WS-TABLA-ERRORES-BASE.                         
131900     02 WS-TABDB-ERROR       PIC X(15) OCCURS 21 TIMES.                       
132000                                                                              
132100 01  WS-VARIABLES-BASE.                                                       
132200     02 WS-STATUS-BASE               PIC 9(02).                               
132300        88 WS-DB-NOTERROR            VALUE 00.                                
132400        88 WS-DB-ERROR               VALUE 1 THRU 99.                         
132500        88 WS-DB-NOTFOUND            VALUE 01.                                
132600        88 WS-DB-DUPLICATES          VALUE 02.                                
132700        88 WS-DB-DEADLOCK            VALUE 03.                                
132800        88 WS-DB-DATAERROR           VALUE 04.                                
132900        88 WS-DB-NOTLOCKED           VALUE 05.                                
133000        88 WS-DB-KEYCHANGED          VALUE 06.                                
133100        88 WS-DB-SYSTEMERROR         VALUE 07.                                
133200        88 WS-DB-READONLY            VALUE 08.                                
133300        88 WS-DB-IOERROR             VALUE 09.                                
133400        88 WS-DB-LIMITERROR          VALUE 10.                                
133500        88 WS-DB-OPENERROR           VALUE 11.                                
133600        88 WS-DB-CLOSEERROR          VALUE 12.                                
133700        88 WS-DB-NORECORD            VALUE 13.                                
133800        88 WS-DB-INUSE               VALUE 14.                                
133900        88 WS-DB-AUDITERROR          VALUE 15.                                
134000        88 WS-DB-ABORT               VALUE 16.                                
134100        88 WS-DB-SECURITYERROR       VALUE 17.                                
134200        88 WS-DB-VERSIONERROR        VALUE 18.                                
134300        88 WS-DB-FATALERROR          VALUE 19.                                
134400        88 WS-DB-INTEGRITYERROR      VALUE 20.                                
134500        88 WS-DB-PARAMETERERROR      VALUE 21.                                
134600     02 WS-STATUS-BASE-ANT           PIC 9(02).                               
134700     02 WS-STATUS-BASE-AUX           PIC 9(02).                               
134800     02 WS-COBCOMI.                                                           
134900        04 WS-COMICOB-DS             PIC 9(04).                               
135000        04 WS-COMICOB-AA             PIC 9(02).                               
135100        04 WS-COMICOB-MM             PIC 9(02).                               
135200        04 WS-COMICOB-AREA.                                                   
135300           06 FILLER                 PIC 9(12) COMP.                          
135400           06 FILLER                 PIC 9(04) COMP.                          
135500           06 FILLER                 PIC 9(08)V99 COMP.                       
135600           06 FILLER                 PIC 9(08)V99 COMP.                       
135700           06 FILLER                 PIC 9(08)V99 COMP.                       
135800           06 FILLER                 PIC 9(08)V99 COMP.                       
135900           06 FILLER                 PIC 9(04) COMP.                          
136000                                                                              
136100     02 WS-LLAVE-SETS.                                                        
136200        04 WS-NUM-COPIA              PIC 9(02).                               
136300        04 WS-NUM-CSI                PIC 9(02).                               
136400        04 WS-NUM-CLIENTE            PIC 9(12).                               
136500        04 WS-NUM-CONTRATO           PIC 9(12).                               
136510        04 WS-NUM-CONTRATO-CTROL     PIC 9(12).                               
136520        04 WS-NUM-CONTRATO-SUBCT     PIC 9(12).                               
136530        04 WS-NUM-ORI-CONTRATO       PIC 9(12).                               
136600        04 WS-NUM-TARJETA            PIC 9(16).                               
136700        04 WS-FEC-MOVTO              PIC 9(08).                               
136800        04 WS-FEC-VALOR              PIC 9(08).                               
136900        04 WS-FEC-SALIDA             PIC 9(08).                               
137000        04 WS-AUTORIZACION           PIC 9(14).                               
137100        04 WS-NUM-PRODUCTO           PIC 9(04).                               
137200        04 WS-NUM-INSTRUM            PIC 9(04).                               
137300        04 WS-MONEDA                 PIC 9(03).                               
137400*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
137500        04 WS-NUM-INSTOPE            PIC 9(02).                               
137600        04 WS-NUM-INV                PIC 9(06).                               
137700        04 WS-NUM-CTO-18             PIC 9(18).                               
137800*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
137900        04 WS-MEDIO-ACCESO           PIC 9(12).                               
138000        04 WS-MEDIO-ACCESO-R REDEFINES                                        
138100           WS-MEDIO-ACCESO.                                                   
138200           06 WS-MA-SUC-CHEQUERA     PIC 9(04).                               
138300           06 WS-MA-CTA-CHEQUERA     PIC 9(08).                               
138400        04 WS-NUM-CHEQUE             PIC 9(10).                               
138500        04 WS-CLAVE-MOVTO            PIC 9(04).                               
138600        04 WS-CLAVE-COBRO            PIC 9(04).                               
138700        04 WS-LLAVE                  PIC 9(08).                               
138800        04 WS-NUM-PASO               PIC 9(03).                               
138900        04 WS-CLAVE-TRANS            PIC 9(04).                               
139000        04 WS-HHMM-ARCHIVO           PIC 9(04).                               
139100        04 WS-SIST-ARCHIVO           PIC 9(02).                               
139200        04 WS-FECHA-ARCHIVO          PIC 9(08).                               
139300        04 WS-SUC-TRANSMITE          PIC 9(04).                               
139400        04 WS-CAJA-TRANSMITE         PIC 9(02).                               
139500        04 WS-LLAVE-BANCOS           PIC 9(06).                               
139600        04 RD-WS-LLAVE-BANCOS        REDEFINES WS-LLAVE-BANCOS.               
139700           06 WS-LLAVE-BCO-ORIG      PIC 9(03).                               
139800           06 WS-LLAVE-BCO-DEST      PIC 9(03).                               
139900        04 WS-NUM-AUTTARJ            PIC 9(06).                               
140000        04 WS-MDA-OTR-BCO            PIC X(06).                               
140100        04 WS-AUT-INTERBANC          PIC 9(08).                               
140200        04 WS-IND-2DAREF             PIC 9(02).                               
140300        04 WS-REFERENCIA             PIC 9(12).                               
140400        04 WS-TIPO-PAGO              PIC 9(02).                               
140410        04 WS-TIP-OPER               PIC 9(02).                               
140420        04 WS-TIP-PER                PIC 9(02).                               
140430        04 WS-UBI-GEO                PIC 9(02).                               
140440        04 WS-FECHA-SET              PIC 9(08).                               
140450        04 WS-NUM-STATUS             PIC 9(02).                               
140460        04 WS-NUM-SEC                PIC 9(08).                               
140470        04 WS-FEC-UPDATE             PIC 9(08).                               
140480        04 WS-HORA-SET               PIC 9(08).                               
140500        04 WS-FECHA-LINEA            PIC 9(08).                               
140600**      04 WS-FECHA-MAQ              PIC 9(08).                               
140700**      04 WS-HORA-MAQ               PIC 9(06).                               
140800        04 WS-SUC-OPERADORA          PIC 9(04).                               
140900        04 WS-CAJ-OPERADORA          PIC 9(02).                               
141000        04 WS-AUTORIZ-APLOR          PIC 9(08).                               
141100        04 WS-AUT-SEQ                PIC 9(08).                               
141200        04 WS-CVE-ACUMULA            PIC 9(04).                               
141300        04 WS-NUM-TEF                PIC 9(16).                               
141400        04 WS-NUM-GPO-COM            PIC 9(04).                               
141500        04 WS-FOLIO                  PIC 9(08).                               
141600        04 WS-PRIORIDAD              PIC 9(02).                               
141700        04 WS-GPO-COM-GLOBAL         PIC 9(04).                               
141800        04 WS-NUM-GPOSOCIO           PIC 9(04).                               
141900        04 WS-NUM-BIN                PIC 9(06).                               
142000        04 WS-GRUPO                  PIC 9(10).                               
142100        04 WS-SUBGPO                 PIC 9(04).                               
142200        04 WS-NUM-MDA                PIC 9(12).                               
142300        04 WS-MODO-COBRO             PIC 9(01).                               
142310        04 WS-NUM-TIPREG             PIC 9(02).                               
142320        04 WS-FEC-MAQACT             PIC 9(08).                               
142330        04 WS-TIP-COMIS              PIC 9(01).                               
142340        04 WS-EST-ENVIO              PIC 9(02).                               
142350        04 WS-TIPO-ENVIO             PIC 9(02).                               
142360        04 WS-SUC-PROMOTORA          PIC 9(04).                               
142370        04 WS-FECHA-TRANS            PIC 9(08).                               
142380        04 WS-SIRH                   PIC 9(04).                               
142390        04 WS-NUM-PANT               PIC X(06).                               
142400        04 WS-ESTATUS-ALERTA         PIC 9(02).                               
142410        04 WS-ID-SISTEMAOR           PIC 9(05).                               
142420                                                                              
142500****************************************************************              
142600$SET OMIT = NOT TARIFACGCI                                                    
142700 01 WS-VARS-TARIFACGCI.                                                       
142800    02 WS-LLT-TARIFA                     PIC X(15).                           
142900    02 WS-LLT-PERSONA                    PIC 9(02).                           
143000    02 WS-LLT-DEFAULT                    PIC 9(06)V9(06).                     
143100    02 WS-LLT-DEFAULT-Z REDEFINES                                             
143200       WS-LLT-DEFAULT.                                                        
143300       03 WS-LLT-DEFAULT-E               PIC 9(06).                           
143400       03 WS-LLT-DEFAULT-D               PIC 9(06).                           
143500    02 WS-LLT-DEFAULT-2                  PIC 9(06)V9(06).                     
143600    02 WS-LLT-DEFAULT-Z-2 REDEFINES                                           
143700       WS-LLT-DEFAULT-2.                                                      
143800       03 WS-LLT-DEFAULT-E-2             PIC 9(06).                           
143900       03 WS-LLT-DEFAULT-D-2             PIC 9(06).                           
144000    02 WS-LLT-RESULT                     PIC 9(02).                           
144100    02 WS-LLT-FECHA-LINEA                PIC 9(08).                           
144200                                                                              
144300    02 WS-2A-TASA-S080                   PIC 9(02) COMP.                      
144400                                                                              
144500    02 WS-COMI-MON                       OCCURS 5 TIMES.                      
144600*      03 WS-COMI-GTOSCBZA               PIC 9(06)V99    COMP.                
144700       03 WS-COMI-MIN-CG                 PIC 9(06)V99    COMP.                
144800       03 WS-COMI-LIDER3-CG              PIC 9(04)V9(04) COMP.                
144900       03 WS-COMI-LIDER3-CI              PIC 9(04)V9(04) COMP.                
145000       03 WS-SIT-CG-PARC                 PIC 9(14)V9(08) COMP.                
145100       03 WS-SIT-CI-PARC                 PIC 9(04)V9(08) COMP.                
145200       03 WS-IMPMAX-DEPLAV               PIC 9(12)V99    COMP.                
145300       03 WS-IMPMAX-OPECRUZ              PIC 9(12)V99    COMP.                
145400       03 WS-COMI-CHQCER                 PIC 9(06)V99    COMP.                
145500       03 WS-COMI-CHQCAJ                 PIC 9(06)V99    COMP.                
145600                                                                              
145700    02 WS-PROCESO-FSB                    PIC X(12).                           
145800    02 WS-NUM-SM-FSB                     PIC 9(08).                           
145900    02 WS-UMBRAL-FSB                     PIC 9(08)V99.                        
146000    02 WS-UMBRAL-FSB-R REDEFINES WS-UMBRAL-FSB.                               
146100       03 WS-UMBRAL-FSB-E                PIC 9(08).                           
146200       03 WS-UMBRAL-FSB-D                PIC 9(02).                           
146300                                                                              
146400    02 WS-TC-COM                         PIC 9(04)V9(04) COMP.                
146500    02 WS-TC-VTA                         PIC 9(04)V9(04) COMP.                
146600                                                                              
146700    02 WS-FACTOR-SIT-CG                  PIC 9(02)V9(06) COMP.                
146800    02 WS-FACTOR-SIT-CG-R REDEFINES WS-FACTOR-SIT-CG.                         
146900       03 WS-FACTOR-SIT-CG-E             PIC 9(02)       COMP.                
147000       03 WS-FACTOR-SIT-CG-A             PIC 9(01)       COMP.                
147100       03 WS-FACTOR-SIT-CG-D             PIC 9(05)       COMP.                
147200    02 WS-FACTOR-SIT-CI                  PIC V9(09)      COMP.                
147300    02 WS-FACTOR-SIT-CI-R REDEFINES                                           
147400       WS-FACTOR-SIT-CI                  PIC 9(08)V9     COMP.                
147500    02 WS-SIT-CG-PARCIAL                 PIC 9(14)V9(08) COMP.                
147600    02 WS-SIT-CI-PARCIAL                 PIC      V9(08) COMP.                
147700    02 WS-SIT-CI-PARCIAL-R REDEFINES                                          
147800       WS-SIT-CI-PARCIAL                 PIC 9(08)       COMP.                
147900    02 WS-TASALIDER-MAS-3PTOS            PIC 9(04)V9(04) COMP.                
148000$POP OMIT                                                                     
148100                                                                              
148200*INI FSW                  P07-120 REQ3                    ABARBOSA            
148300$SET OMIT = NOT S000LIBFEC                                                    
148400******************************************************************            
148500*   PARAMETROS PARA LIBRERIA "S000LIBFEC" (S000/OBJECT/LIBFEC)   *            
148600*                             FECHAS                             *            
148700******************************************************************            
148800 01  WS-LIBFEC-FECHAIN            PIC  9(08).                                 
148900*    Fecha base para validar o realizar los calculos                          
149000 01  WS-LIBFEC-FECHAOUT           PIC  9(08).                                 
149100*    Fecha resultante de la validacion o calculos                             
149200*    o cambio de formato                                                      
149300 77  W77-LIBFEC-FORMIN            PIC S9(11) BINARY.                          
149400*    1) Formato AAMMDD                                                        
149500*    2) Formato AADDDD Fecha Juliana                                          
149600*    3) Formato MMDDAA                                                        
149700*    4) Formato DDMMAA                                                        
149800*    5) Formato AAAAMMDD                                                      
149900*    6) Formato AAAADDDD Fecha Juliana                                        
150000*    7) Formato MMDDAAAA                                                      
150100*    8) Formato DDMMAAAA                                                      
150200 77  W77-LIBFEC-FORMOUT           PIC S9(11) BINARY.                          
150300*    Mismas claves que el FORMIN                                              
150400 77  W77-LIBFEC-CVESEM            PIC S9(11) BINARY.                          
150500*    65) Sabado y Domingo inhabiles                                           
150600*    01) Domingo inhabil                                                      
150700*    02) Lunes inhabil                                                        
150800*    03) Domingo y lunes inhabil                                              
150900*    64) Sabado inhabil                                                       
151000*    00) Todos los dõas habiles                                               
151100 77  W77-LIBFEC-CVEFEST           PIC S9(11) BINARY.                          
151200*    01) Fechas festivas Banamex                                              
151300*    02) Fechas festivas Agencia Nueva York                                   
151400 77  W77-LIBFEC-INCREM            PIC S9(11) BINARY.                          
151500*    Numero de dias, semanas o meses a sumar o restar                         
151600*    la operacion la define el signo                                          
151700 77  W77-LIBFEC-DIANAT            PIC S9(11) BINARY.                          
151800*    Dias naturales se utiliza en la obtencion de calculo                     
151900*    entre fechas puede ser negativo                                          
152000 77  W77-LIBFEC-DIASEM            PIC S9(11) BINARY.                          
152100*    0) Domingo                                                               
152200*    1) Lunes                                                                 
152300*    2) Martes                                                                
152400*    3) Miercoles                                                             
152500*    4) Jueves                                                                
152600*    5) Viernes                                                               
152700*    6) Sabado                                                                
152800 77  W77-LIBFEC-ESTATUS           PIC S9(11) BINARY.                          
152900*    -1) Fecha Erronea                                                        
153000*    +1) Fecha correcta pero fuera de los rangos del                          
153100*        Archivo de Festivos                                                  
153200*     0) Fecha correcta y dentro de los rangos                                
153300                                                                              
153400******************************************************************            
153500*   Procedimientos                                               *            
153600******************************************************************            
153700*   Validacion y Cambio de Formato.                              *            
153800*   Validacion de fecha.                                         *            
153900*   Verificar si una fecha es habil.                             *            
154000*   Obtener siguiente fecha habil.                               *            
154100*   Obtener anterior fecha habil.                                *            
154200*   Obtener ultimo habil de un mes.                              *            
154300*   Obtener primer dia habil de un mes.                          *            
154400*   Obtener el dia de la semana.                                 *            
154500*   Obtener el ultimo del mes.                                   *            
154600*   Obtener el siguiente dia de la semana.                       *            
154700*   Obtener el anterior dia de la semana.                        *            
154800*   Obtener la fecha juliana.                                    *            
154900*   Proyectar una fecha n dias.                                  *            
155000*   Proyectar una fecha n dias habiles.                          *            
155100*   Proyectar un mes en habil.                                   *            
155200*   Proyectar una semana en habil.                               *            
155300*   Obtener diferencia entre 2 fechas.                           *            
155400*   Obtener los dias de un aùo.                                  *            
155500******************************************************************            
155600$POP OMIT                                                                     
155700*FIN FSW                  P07-120 REQ3                    ABARBOSA            
155800                                                                              
155900$SET OMIT = NOT S022TRANF                                                     
156000*****************************************************************             
156100*   PARAMETROS PARA LIBRERIA "ADMONXFERS"                       *             
156200*   ENVIO DE ARCHIVOS AL S022 (INTELAR)                         *             
156300*****************************************************************             
156400 01 WKS-ARCH-INTELAR              PIC X(73) VALUE SPACES.                     
156500 01 WS-ARCH-TRANSF                PIC X(73) VALUE SPACES.                     
156600 77 WS77-INTELAR-RESULT           PIC S9(11) BINARY.                          
156700 01 WS-RESULT-N1                  PIC 9(05)-.                                 
156800 01 WS-TRANSFERENCIA              PIC 9(01) VALUE 0.                          
156900                                                                              
157000$POP OMIT                                                                     
157100*****************************************************************             
157200$SET OMIT = NOT S006LOCSUP                                                    
157300*****************************************************************             
157400*   PARAMETROS PARA LIBRERIA "LOCSUP" (S006/OBJECT/LOCSUP)      *             
157500*                   THECALENDAR                                 *             
157600*****************************************************************             
157700                                                                              
157800 77  WS-S006-FORMATO         PIC S9(11)     BINARY.                           
157900 77  WS-S006-FUNCION         PIC S9(11)     BINARY.                           
158000                                                                              
158100*********  CAMPOS PARA FECHAS EN 8 DIGITOS  *****                             
158200 01  WS-S006-FECHA1          PIC 9(08).                                       
158300*01  WS-S006-FECHA1-NUM REDEFINES WS-S006-FECHA1  PIC 9(08).                  
158400 01  WS-S006-FECHA1-R REDEFINES                                               
158500     WS-S006-FECHA1.                                                          
158600     03 WS-S006-FECHA1-AAAA  PIC 9(04).                                       
158700     03 WS-S006-FECHA1-MM    PIC 9(02).                                       
158800     03 WS-S006-FECHA1-DD    PIC 9(02).                                       
158900 01  WS-S006-FECHA2          PIC 9(08).                                       
159000                                                                              
159100 77  WKS-88-LOCSUP           PIC 99         COMP VALUE 0.                     
159200 01 WS-STRING-84                               PIC X(084).                    
159300 01 WS-STRING-23                               PIC X(023).                    
159400 01 WS-STRING-23-N   REDEFINES WS-STRING-23    PIC 9(023).                    
159500 01 WS-STRING-23-D02 REDEFINES WS-STRING-23    PIC 9(021)V99.                 
159600 01 WS-STRING-23-D03 REDEFINES WS-STRING-23    PIC 9(020)V999.                
159700 01 WS-STRING-23-D04 REDEFINES WS-STRING-23    PIC 9(019)V9999.               
159800 77 WS-JUSTI-FUNCION                           PIC S9(11) BINARY.             
159900 77 WS-JUSTI-DECIMALES                         PIC S9(11) BINARY.             
160000                                                                              
160100****************************************************************              
160200*  WS-S006-FORMATO:     FECHAS A 6 DIGITOS   *****************                
160300*  00 =  GREGORIANA MMDDAA NO REQUIERE VERIFICACION                           
160400*  01 =  GREGORIANA MMDDAA SI REQUIERE VERIFICACION                           
160500*  02 =  GREGORIANA AAMMDD NO REQUIERE VERIFICACION                           
160600*  03 =  GREGORIANA AAMMDD SI REQUIERE VERIFICACION                           
160700*  04 =  GREGORIANA DDMMAA NO REQUIERE VERIFICACION                           
160800*  05 =  GREGORIANA DDMMAA SI REQUIERE VERIFICACION                           
160900*  06 =  JULIANA    0AADDD NO REQUIERE VERIFICACION EJEM. 095293              
161000*  07 =  JULIANA    0AADDD SI REQUIERE VERIFICACION EJEM. 095293              
161100*                                                                             
161200*  WS-S006-FORMATO:     FECHAS A 8 DIGITOS   ****************                 
161300*  12 =  GREGORIANA AAAAMMDD NO REQUIERE VERIFICACION                         
161400*  13 =  GREGORIANA AAAAMMDD SI REQUIERE VERIFICACION                         
161500*  16 =  JULIANA    0AAAADDD NO REQUIERE VERIFICACION                         
161600*  17 =  JULIANA    0AAAADDD SI REQUIERE VERIFICACION                         
161700*                                                                             
161800*  WS-S006-FUNCION:                                                           
161900*  01 = VERIFICAR UNA FECHA JULIANA (VALIDA O INVALIDA)                       
162000*  02 = NUMERO DE DIAS NATURALES ENTRE DOS FECHAS GREGORIANAS                 
162100*       REGRESA DIAS EN (WS-S0006-FECHA1 )                                    
162200*  03 = NUMERO DE DIAS NATURALES ENTRE DOS FECHAS JULIANAS                    
162300*       REGRESA DIAS EN (WS-S0006-FECHA1 )                                    
162400*  04 = CONVERTIR UNA FECHA JULIANA EN GREGORIANA                             
162500*       REGRESA FECHA EN (WS-S0006-FECHA1 )                                   
162600*            FORMATO (MMDDAAAA)                                               
162700*  05 = CONVERTIR UNA FECHA GREGORIANA EN JULIANA                             
162800*  06 = DIA DE SEMANA DE FECHA GREGORIANA                                     
162900*       (WS-S006-FECHA1:      0=DOMINGO 6=SABADO)                             
163000*  07 = DIA DE SEMANA DE FECHA JULIANA                                        
163100*       (WS-S006-FECHA1:    0=DOMINGO 6=SABADO)                               
163200*  08 = SUMAR  NNN DIAS NATURALES  A UNA FECHA GREGORIANA                     
163300*  09 = SUMAR  NNN DIAS NATURALES  A UNA FECHA JULIANA                        
163400*  10 = RESTAR NNN DIAS NATURALES  A UNA FECHA GREGORIANA                     
163500*  11 = RESTAR NNN DIAS NATURALES  A UNA FECHA JULIANA                        
163600*  13 = SUMAR  NNN DIAS HABILES    A UNA FECHA GREGORIANA                     
163700*  14 = SUMAR  NNN DIAS HABILES    A UNA FECHA JULIANA                        
163800*  15 = RESTAR NNN DIAS HABILES    A UNA FECHA GREGORIANA                     
163900*  16 = RESTAR NNN DIAS HABILES    A UNA FECHA JULIANA                        
164000*  17 = VERIFICAR SI UNA FECHA GREGORIANA ES DIA HABIL                        
164100*       (WS-S006-FECHA1:    1=HABIL 0=INHABIL)                                
164200*  18 = VERIFICAR SI UNA FECHA JULIANA    ES DIA HABIL                        
164300*       (WS-S006-FECHA1:    1=HABIL 0=INHABIL)                                
164400*  19 =                                                                       
164500*  20 = VERIFICAR UNA FECHA GREGORIANA (VALIDA O INVALIDA)                    
164600*  21 = SUMAR  NNN MESES A UNA FECHA GREGORIANA.                              
164700*  22 = RESTAR NNN MESES A UNA FECHA GREGORIANA.                              
164800****************************************************************              
164900$POP OMIT                                                                     
165000$SET OMIT = NOT S016L422                                                      
165100 77  WKS-88-S016L422                  PIC 99  COMP VALUE 0.                   
165200$POP OMIT                                                                     
165300$SET OMIT = NOT S016L422R05                                                   
165400*****************************************************************             
165500**     LIBRERIA L422   ENTRY POINT  S016_L422_B07SXCTARELCTE   **             
165600**                                                             **             
165700**     PARA CONOCER SI UN CONTRATO ES CUENTA EJE               **             
165800*****************************************************************             
165900 01  WS-S016-65-CTR-ENTRADA.                                                  
166000     02 WS-S016-65-CTA-PROD-I      PIC 9(04)     COMP.                        
166100     02 WS-S016-65-CTA-INST-I      PIC 9(04)     COMP.                        
166200     02 WS-S016-65-CTA-PREF-I      PIC 9(04)     COMP.                        
166300     02 WS-S016-65-CTA-CTO-I       PIC 9(12)     COMP.                        
166400     02 WS-S016-65-CVE-RELCTA-I    PIC 9(02)     COMP.                        
166500     02 WS-S016-65-EJE-PROD-I      PIC 9(04)     COMP.                        
166600     02 WS-S016-65-EJE-INST-I      PIC 9(04)     COMP.                        
166700     02 WS-S016-65-EJE-PREF-I      PIC 9(04)     COMP.                        
166800     02 WS-S016-65-EJE-CTO-I       PIC 9(12)     COMP.                        
166900     02 WS-S016-65-OPCION-I        PIC 9(02)     COMP.                        
167000     02 FILLER                     PIC X(034).                                
167100                                                                              
167200                                                                              
167300 01  WS-S016-65-CTR-SALIDA.                                                   
167400     02 WS-S016-65-CTR-CSI-S       PIC 9(02)     COMP.                        
167500     02 WS-S016-65-CTE-NUM-S       PIC 9(12)     COMP.                        
167600     02 WS-S016-65-CTA-PROD-S      PIC 9(04)     COMP.                        
167700     02 WS-S016-65-CTA-INST-S      PIC 9(04)     COMP.                        
167800     02 WS-S016-65-CTA-PREF-S      PIC 9(04)     COMP.                        
167900     02 WS-S016-65-CTA-CTO-S       PIC 9(12)     COMP.                        
168000     02 WS-S016-65-CVE-RELCTA-S    PIC 9(02)     COMP.                        
168100     02 WS-S016-65-CTE-PRODREL-S   PIC 9(04)     COMP.                        
168200     02 WS-S016-65-CTE-INSTREL-S   PIC 9(04)     COMP.                        
168300     02 WS-S016-65-CTE-PREFREL-S   PIC 9(04)     COMP.                        
168400     02 WS-S016-65-CTA-CTOREL-S    PIC 9(12)     COMP.                        
168500     02 WS-S016-65-CTA-FEALTA-S    PIC 9(08)     COMP.                        
168600     02 WS-S016-65-CTA-FEMODI-S    PIC 9(08)     COMP.                        
168700                                                                              
168800                                                                              
168900                                                                              
169000 77  WS77-S016-65-RESULT           PIC S9(11)    BINARY.                      
169100                                                                              
169200$POP OMIT                                                                     
169300$SET OMIT = NOT S016L422R01                                                   
169400*****************************************************************             
169500*                 LIBRERIA S016/L422                            *             
169600*                                                               *             
169700*****************************************************************             
169800*   PARAMETROS ENTRY POINT: S016_L422_COMXCTA                   *             
169900*              CONSULTA DE COMISIONES EXENTAS                   *             
170000*                                                               *             
170100*FIJOS POR INCLUDE:                                             *             
170200*  WS-S016-0101-CTR-SALIDA      = LOW-VALUES                    *             
170300*  WS-S016-0101-CTR-NUMSIST-I   = 500                           *             
170400*POR CADA PROGRAMA:                                             *             
170500*  WS-S016-0101-CTR-NUMPASO-I   = NUMERO DE PROGRAMA            *             
170600*  WS-S016-0101-CTA-NUMPROD-I   = WS03-NUM-PRODUCTO             *             
170700*  WS-S016-0101-CTA-CVEINST-I   = WS03-NUM-INSTRUM              *             
170800*  WS-S016-0101-CTO-NUM-I       = WS03-NUM-CONTRATO             *             
170900**********                                              *********             
171000*   PARAMETROS DE SALIDA   "S016_L422_COMXCTA"                  *             
171100*       REGRESA: COMISIONES EXENTAS                             *             
171200*                                                               *             
171300*   WS-S016-0101-COMISION(01)  = APERTURA                       *             
171400*   WS-S016-0101-COMISION(02)  = ANIVERSARIO                    *             
171500*   WS-S016-0101-COMISION(03)  = MANEJO DE CUENTA               *             
171600*   WS-S016-0101-COMISION(04)  = CHEQUES GIRADOS                *             
171700*   WS-S016-0101-COMISION(05)  = DISPOSICION EN CAJERO          *             
171800*   WS-S016-0101-COMISION(06)  = REPOSICION DE TARJETA          *             
171900*   WS-S016-0101-COMISION(07)  = EDO. DE CUENTA EN LINEA        *             
172000*   WS-S016-0101-COMISION(08)  = DISP. C/TARJ EN VENT.          *             
172100*   WS-S016-0101-COMISION(09)  = DISP. CAJEROS "RED"            *             
172200*   WS-S016-0101-COMISION(10)  = CONSULT. CAJEROS "RED"         *             
172300*   WS-S016-0101-NUMREPTAR     = SIN USO                        *             
172400*   WS-S016-0101-NUMCONEDO     = NUM CONSULT EDO.CTA LINEA      *             
172500*                                                               *             
172600*                                                               *             
172700* NOTA: CUANDO EL RESULT(WS-S016-0101-RESULT) NO ES = 0         *             
172800*       SE MUEVE CERO AL CAMPO WS-S016-0101-RESULT              *             
172900*       Y SE ARMAN COMISIONES AL 100 % PARA LOS 10 OCCURS       *             
173000*       EL RESULT ORIGINAL (WS-S016-0101-RESULT) SE GUARDA      *             
173100*       EN EL CAMPO WS-S016-0101-RESULT-ORIG                    *             
173200                                                                              
173300*****************************************************************             
173400 01  WS-S016-0101-CTR-ENTRADA.                                                
173500     02 WS-S016-0101-CTR-NUMSIST-I    PIC 9(04) COMP.                         
173600     02 WS-S016-0101-CTR-NUMPASO-I    PIC 9(04) COMP.                         
173700     02 WS-S016-0101-CTA-NUMPROD-I    PIC 9(04) COMP.                         
173800     02 WS-S016-0101-CTA-CVEINST-I    PIC 9(04) COMP.                         
173900     02 WS-S016-0101-CTO-NUM-I        PIC 9(16) COMP.                         
174000     02 RD-S016-0101-CTO-NUM-I REDEFINES WS-S016-0101-CTO-NUM-I.              
174100        04 WS-S016-0101-CTA-NUMPREF-I PIC 9(04) COMP.                         
174200        04 WS-S016-0101-CTA-NUM-I     PIC 9(12) COMP.                         
174300     02 WS-S016-0101-CTA-CSI-I        PIC 9(02) COMP.                         
174400     02 FILLER                        PIC X(43).                              
174500                                                                              
174600 01  WS-S016-0101-CTR-SALIDA.                                                 
174700     02 WS-S016-0101-CVE-CSI          PIC 9(02)    COMP.                      
174800     02 WS-S016-0101-NUMPROD          PIC 9(04)    COMP.                      
174900     02 WS-S016-0101-CVEINST          PIC 9(04)    COMP.                      
175000     02 WS-S016-0101-CTO-NUM.                                                 
175100        04 WS-S016-0101-CTA-NUMPREF   PIC 9(04)    COMP.                      
175200        04 WS-S016-0101-CTA-NUM       PIC 9(12)    COMP.                      
175300     02 WS-S016-0101-COMISION         OCCURS 10 TIMES.                        
175400        04 WS-S016-0101-CVECOBRO      PIC 99       COMP.                      
175500        04 WS-S016-0101-COBCOM        PIC 9(03)V99 COMP.                      
175600     02 WS-S016-0101-CVEDGA           PIC 9(02)    COMP.                      
175700     02 WS-S016-0101-FECCADUC         PIC 9(04)    COMP.                      
175800     02 WS-S016-0101-NUMREPTAR        PIC 9(04)    COMP.                      
175900     02 WS-S016-0101-NUMCONEDO        PIC 9(04)    COMP.                      
176000     02 WS-S016-0101-INDCAMB          PIC 99       COMP.                      
176100     02 WS-S016-0101-FECCADUC-2K      PIC 9(06)    COMP.                      
176200     02 FILLER                        PIC X(25).                              
176300                                                                              
176400 77  WS-S016-0101-RESULT              PIC S9(11) BINARY.                      
176500 77  WS-S016-0101-RESULT-ORIG         PIC S9(11) BINARY.                      
176600 77  WS-IND-S016                      PIC 99 BINARY.                          
176700$POP OMIT                                                                     
176800$SET OMIT = NOT S016L422R02                                                   
176900*****************************************************************             
177000*   PARAMETROS DE ENTRADA PARA ENTRY POINT: S016_L422_S500_02   *             
177100*              CONSULTA DE DATOS GENERALES                      *             
177200*                                                               *             
177300*FIJOS POR INCLUDE:                                             *             
177400* WS-S016-0102-CTR-SALIDA       = LOW-VALUES                    *             
177500* WS-S016-0102-CTR-NUMSIST-I    = 500                           *             
177600*POR CADA PROGRAMA:                                             *             
177700* WS-S016-0102-CTR-NUMPASO-I    = NUMERO DE PROGRAMA            *             
177800* WS-S016-0102-CTA-NUMPROD-I    = NUMERO DE PRODUCTO            *             
177900* WS-S016-0102-CTA-CVEINST-I    = NUMERO DE INSTRUMENTO         *             
178000* WS-S016-0102-CTO-NUM-I        = NUMERO DE CONTRATO            *             
178100*                                 O MEDIO DE ACCESO             *             
178200*                                                               *             
178300* EJEMPLOS DE MEDIO DE ACCESO:                                  *             
178400* CHEQUERA    0873/694014-6          = 0873000006940146         *             
178500* TARJETA     5290-0101-0230-1435    = 5290010102301435         *             
178600*                                                               *             
178700*****************************************************************             
178800*   PARAMETROS DE SALIDA ENTRY POINT: S016_L422_S500_02         *             
178900*       REGRESA: DATOS GENERALES                                *             
179000*                                                               *             
179100*   WS-S016-0102-NUMPRD        = NUM PRODUCTO                   *             
179200*   WS-S016-0102-NUMINST       = NUM INSTRUMENTO                *             
179300*   WS-S016-0102-NUMSUC        = SUC PROMOTORA                  *             
179400*   WS-S016-0102-CVEPERS       = TIPO DE PERSONA                *             
179500*   WS-S016-0102-CVESECTOR     = NUMERO DE SECTOR               *             
179600*   WS-S016-0102-BANCA         = NUMERO DE BANCA                *             
179700*   WS-S016-0102-CVEMON        = NUM DE MONEDA                  *             
179800*   WS-S016-0102-NOMBRE        = NOMBRE DEL CLIENTE             *             
179900*   WS-S016-0102-CVESOCFUN     = CLAVE SOCIO FUNDADOR           *             
180000*   WS-S016-0102-CVEPERBCO     = CLAVE PERSONAL DEL BANCO       *             
180100*   WS-S016-0102-NUMCTE        = NUMERO DE CLIENTE              *             
180200*   WS-S016-0102-STATUS        = STATUS DE LA CUENTA            *             
180300*                                11 OK                          *             
180400*                                12 BAJA SOLICITUD              *             
180500*                                13 BAJA POR FALLECIMIENTO      *             
180600*                                14 BLOQUEO POR ORDEN JUDICIAL  *             
180700*                                15 BAJA POR CONVENIR AL BANCO  *             
180800*                                19 BAJA ALTA ERRONEA           *             
180900*                                                               *             
181000*   WS-S016-0102-CVEUSO        = 10 ES CUENTA CONCENTRADORA     *             
181100*   WS-S016-0102-DIACORTE      = DIA DE CORTE                   *             
181200*   WS-S016-0102-FECAPER       = FECHA DE APERTURA              *             
181300*                                                               *             
181400*****************************************************************             
181500 01  WS-S016-0102-ENTRADA.                                                    
181600     02 WS-S016-0102-CTR-NUMSIST-I     PIC 9(04) COMP.                        
181700     02 WS-S016-0102-CTR-NUMPASO-I     PIC 9(04) COMP.                        
181800     02 WS-S016-0102-CTA-NUMPROD-I     PIC 9(04) COMP.                        
181900     02 WS-S016-0102-CTA-CVEINST-I     PIC 9(04) COMP.                        
182000     02 WS-S016-0102-CTO-NUM-I         PIC 9(16) COMP.                        
182100     02 RD-S016-0102-CTO-NUM-I REDEFINES WS-S016-0102-CTO-NUM-I.              
182200        03 WS-S016-0102-CTA-NUMPREF-I  PIC 9(04) COMP.                        
182300        03 WS-S016-0102-CTA-NUM-I      PIC 9(12) COMP.                        
182400     02 WS-S016-0102-CTR-OPCION-I      PIC 9(02) COMP.                        
182500     02 WS-S016-0102-CTR-NUMCSI-I      PIC 9(02) COMP.                        
182600     02 FILLER                         PIC X(42).                             
182700                                                                              
182800 01  WS-S016-0102-SALIDA.                                                     
182900     02 WS-S016-0102-REGISTRO-S.                                              
183000        03 WS-S016-0102-NUMPRD         PIC 9(04) COMP.                        
183100        03 WS-S016-0102-NUMINST        PIC 9(04) COMP.                        
183200        03 WS-S016-0102-NUMSUC         PIC 9(04) COMP.                        
183300        03 WS-S016-0102-CVEPERS        PIC 9(02) COMP.                        
183400        03 WS-S016-0102-CVESECTOR      PIC 9(02) COMP.                        
183500        03 WS-S016-0102-BANCA          PIC 9(02) COMP.                        
183600        03 WS-S016-0102-ACTBNM         PIC 9(06) COMP.                        
183700        03 WS-S016-0102-CVEMON         PIC 9(02) COMP.                        
183800        03 WS-S016-0102-NOMBRE         PIC X(55).                             
183900        03 WS-S016-0102-CVESOCFUN      PIC 9(02) COMP.                        
184000        03 WS-S016-0102-CVEPERBCO      PIC 9(02) COMP.                        
184100        03 WS-S016-0102-NUMCTE         PIC 9(12) COMP.                        
184200        03 WS-S016-0102-STATUS         PIC 9(02) COMP.                        
184300        03 WS-S016-0102-CODRFC.                                               
184400           04 WS-S016-0102-RFCALFA     PIC X(04).                             
184500           04 WS-S016-0102-RFCFECH     PIC 9(06) COMP.                        
184600           04 WS-S016-0102-RFCHOM      PIC X(05).                             
184700        03 WS-S016-0102-CVEUSO         PIC 9(02) COMP.                        
184800        03 WS-S016-0102-CVMANEJO       PIC 9(02) COMP.                        
184900        03 WS-S016-0102-INFADICTA.                                            
185000           04 WS-S016-0102-FECONSTIT   PIC 9(08) COMP.                        
185100           04 WS-S016-0102-FEPODER     PIC 9(08) COMP.                        
185200           04 WS-S016-0102-FEDICJURI   PIC 9(08) COMP.                        
185300        03 WS-S016-0102-NUMCSI         PIC 9(02) COMP.                        
185400        03 WS-S016-0102-DIACORTE       PIC 9(02) COMP.                        
185500        03 WS-S016-0102-CVENVIO        PIC 9(04) COMP.                        
185600        03 WS-S016-0102-EDIEDOCTA      PIC 9(02) COMP.                        
185700        03 WS-S016-0102-DISEDOCTA      PIC 9(02) COMP.                        
185800        03 WS-S016-0102-CVNIVRIE       PIC X(01).                             
185900        03 WS-S016-0102-USOEJECTA      PIC 9(04) COMP.                        
186000        03 WS-S016-0102-USOSCTE        PIC 9(04) COMP.                        
186100        03 WS-S016-0102-VENDNOMI       PIC 9(10) COMP.                        
186200        03 WS-S016-0102-VENDSUC        PIC 9(04) COMP.                        
186300        03 WS-S016-0102-REFENOMI       PIC 9(10) COMP.                        
186400        03 WS-S016-0102-REFECVE        PIC 9(02) COMP.                        
186500        03 WS-S016-0102-PREVNOMI       PIC 9(10) COMP.                        
186600        03 WS-S016-0102-PREVSUC        PIC 9(04) COMP.                        
186700        03 WS-S016-0102-PREVIMP        PIC 9(14) COMP.                        
186800        03 WS-S016-0102-RESTRIC        PIC 9(02) COMP.                        
186805*<INI-IBM>NOR SE AGREGA CAMPO NIVEL DE CUENTA                                 
186810        03 WS-S016-0102-NIVEL          PIC 9(01) COMP.                        
186900        03 WS-S016-0102-RESTCON        PIC 9(01) COMP.                        
186905*<FIN-IBM>NOR                                                                 
187000        03 WS-S016-0102-OPCPAGO        PIC 9(02) COMP.                        
187100        03 WS-S016-0102-RGOPAGO        PIC 9(02) COMP.                        
187200        03 WS-S016-0102-RETIMP         PIC 9(02) COMP.                        
187300        03 WS-S016-0102-FECPREV        PIC 9(06) COMP.                        
187400        03 WS-S016-0102-FECAPER        PIC 9(08) COMP.                        
187500        03 WS-S016-0102-FEULTMOD       PIC 9(08) COMP.                        
187600        03 WS-S016-0102-FECANCEL       PIC 9(08) COMP.                        
187700        03 WS-S016-0102-FERENOVA       PIC 9(08) COMP.                        
187800        03 WS-S016-0102-SITUACION      PIC X(04).                             
187900        03 WS-S016-0102-NUMPREF        PIC 9(04) COMP.                        
188000        03 WS-S016-0102-CTA-NUM        PIC 9(12) COMP.                        
188100        03 WS-S016-0102-MDACTENUM      PIC 9(12) COMP.                        
188200        03 WS-S016-0102-MDACVETIPO     PIC 9(02) COMP.                        
188300        03 WS-S016-0102-MDASUBTIPO     PIC 9(02) COMP.                        
188400        03 WS-S016-0102-MDACVETIT      PIC 9(02) COMP.                        
188500        03 WS-S016-0102-MDANUMPREF     PIC 9(04) COMP.                        
188600        03 WS-S016-0102-MDANUM         PIC 9(12) COMP.                        
188700        03 WS-S016-0102-MDAABRPROFT    PIC X(03).                             
188800        03 WS-S016-0102-MDAPTRNOMT     PIC 9(04) COMP.                        
188900        03 WS-S016-0102-MDAABRPROFC    PIC X(03).                             
189000        03 WS-S016-0102-MDAPTRNOMC     PIC 9(04) COMP.                        
189100        03 WS-S016-0102-MDANUMTALON    PIC 9(02) COMP.                        
189200        03 WS-S016-0102-MDACHQXTALON   PIC 9(02) COMP.                        
189300        03 WS-S016-0102-MDACVESTATUS   PIC 9(02) COMP.                        
189400        03 WS-S016-0102-MDAFECALTA     PIC 9(08) COMP.                        
189500        03 WS-S016-0102-MDAFECULTMOD   PIC 9(08) COMP.                        
189600        03 WS-S016-0102-MDAFECULTACC   PIC 9(08) COMP.                        
189700        03 WS-S016-0102-MDAFECVENC     PIC 9(08) COMP.                        
189800        03 WS-S016-0102-MDAFECCANCEL   PIC 9(08) COMP.                        
189900        03 WS-S016-0102-MDAFECPREV     PIC 9(06) COMP.                        
190000        03 WS-S016-0102-MDAHHPREV      PIC 9(04) COMP.                        
190100        03 WS-S016-0102-MDAHHALTA      PIC 9(04) COMP.                        
190200        03 WS-S016-0102-MDAHHULTMOD    PIC 9(04) COMP.                        
190300        03 WS-S016-0102-MDAHHULTACC    PIC 9(04) COMP.                        
190400        03 WS-S016-0102-MDAHHVENC      PIC 9(04) COMP.                        
190500        03 WS-S016-0102-MDAPERIODO     PIC 9(02) COMP.                        
190600        03 WS-S016-0102-MDASITUACION   PIC X(04).                             
190700        03 WS-S016-0102-CTECAEB        PIC 9(06) COMP.                        
190800        03 WS-S016-0102-CTECVESEXO     PIC 9(02) COMP.                        
190900        03 WS-S016-0102-CTA-TEF        PIC 9(16) COMP.                        
190920*2024R05M INI MESSANGING                                                      
190940        03 WS-S016-0102-CTA-PROD-ALER  PIC 9(02) COMP.                        
190960*       03 FILLER                      PIC X(23).                             
190980        03 FILLER                      PIC X(21).                             
191000*2024R05M FIN MESSANGING                                                      
191100                                                                              
191200                                                                              
191300 77  WS-S016-0102-RESULT               PIC S9(11) BINARY.                     
191400                                                                              
191500$POP OMIT                                                                     
191600$SET OMIT = NOT ( S016L422R03 OR S016L422R07 )                                
191700*****************************************************************             
191800* PARAMETROS PARA EL ENTRYPOINT S016_L422_B04SXCTAPRD           *             
191900*                                                               *             
192000* DATOS DE ENTRADA:                                             *             
192100*       WS-S016-0103-CTA-NUMPREF-I = WS03-SUC-PROMOTORA         *             
192200*       WS-S016-0103-CTA-NUM-I     = WS03-NUM-CONTRATO          *             
192300*       WS-S016-0103-CTA-NUMPROD-I = WS03-NUM-PRODUCTO          *             
192400*       WS-S016-0103-CTA-CVEINST-I = WS03-NUM-INSTRUM           *             
192500*       WS-S016-0103-CTR-OPCION-I  = 1                          *             
192600*                                                               *             
192700*****************************************************************             
192800 01 WS-S016-0103-ENTRADA.                                                     
192900    03 WS-S016-0103-CTA-NUMPREF-I      PIC 9(04) COMP.                        
193000    03 WS-S016-0103-CTA-NUM-I          PIC 9(12) COMP.                        
193100    03 WS-S016-0103-CTA-NUMPROD-I      PIC 9(04) COMP.                        
193200    03 WS-S016-0103-CTA-CVEINST-I      PIC 9(04) COMP.                        
193300    03 WS-S016-0103-CTR-OPCION-I       PIC 9(02) COMP.                        
193400    03 FILLER                          PIC X(47).                             
193500                                                                              
193600 01 WS-S016-0103-SALIDA.                                                      
193700    03 WS-S016-0103-CTR-NUMCSI-S       PIC 9(02) COMP.                        
193800    03 WS-S016-0103-CTA-NUMPROD-S      PIC 9(04) COMP.                        
193900    03 WS-S016-0103-CTA-CVEINST-S      PIC 9(04) COMP.                        
194000    03 WS-S016-0103-CTA-NUMSUC-S       PIC 9(04) COMP.                        
194100    03 WS-S016-0103-CTA-NUMPREF-S      PIC 9(04) COMP.                        
194200    03 WS-S016-0103-CTA-NUM-S          PIC 9(12) COMP.                        
194300    03 WS-S016-0103-CTE-NUM-S          PIC 9(12) COMP.                        
194400    03 WS-S016-0103-CTA-DIACORTE-S     PIC 9(02) COMP.                        
194500    03 WS-S016-0103-CTA-CVEMONEDA-S    PIC 9(02) COMP.                        
194600    03 WS-S016-0103-CTA-CVEENVIO-S     PIC 9(04) COMP.                        
194700    03 WS-S016-0103-CTA-EDIEDOCTA-S    PIC 9(02) COMP.                        
194800    03 WS-S016-0103-CTA-CVEMANEJO-S    PIC 9(02) COMP.                        
194900    03 WS-S016-0103-CTA-CVESTATUS-S    PIC 9(02) COMP.                        
195000    03 WS-S016-0103-CTA-CVEUSO-S       PIC 9(02) COMP.                        
195100    03 WS-S016-0103-CTA-RESTRIC-S      PIC 9(02) COMP.                        
195200    03 WS-S016-0103-CTA-RESTCON-S      PIC 9(02) COMP.                        
195300    03 WS-S016-0103-CTA-OPCPAGO-S      PIC 9(02) COMP.                        
195400    03 WS-S016-0103-CTA-RGOPAGO-S      PIC 9(02) COMP.                        
195500    03 WS-S016-0103-CTA-FECAPER-S      PIC 9(08) COMP.                        
195600    03 WS-S016-0103-CTA-FECULTMOD-S    PIC 9(08) COMP.                        
195700    03 WS-S016-0103-CTA-FECCANCEL-S    PIC 9(08) COMP.                        
195800    03 FILLER                          PIC X(20).                             
195900                                                                              
196000 77 WS-S016-0103-RESULT                PIC S9(11) BINARY.                     
196100 77 WS-TPOCOM                          PIC 9(02)  COMP.                       
196200 77 WS-MDACOM                          PIC 9(02)  COMP.                       
196300 88 W88-ESQC-TRAD                      VALUE 1.                               
196400 88 W88-ESQC-RENTA                     VALUE 2, 3, 4.                         
196500 88 W88-E0QC-TRANS                     VALUE 5, 6, 7.                         
196600 77 WS-ESQCOM                          PIC 9(04).                             
196700                                                                              
196800$POP OMIT                                                                     
196900*****************************************************************             
197000$SET OMIT = NOT S016L422R06                                                   
197100*                                                               *             
197200* ENTRYPOINT S016_L422_B09SXCTESISTIP                           *             
197300* ENTRYPOINT PARA VALIDAR SI ES QUE ESTAN DADOS DE ALTA LOS     *             
197400* SERVICIOS DE DIGITEM                                          *             
197500*****************************************************************             
197600                                                                              
197700 01 WS-S016-0106-ENTRADA.                                                     
197800    03 WS-S016-0106-CTR-NUMCSI            PIC 9(02) COMP.                     
197900    03 WS-S016-0106-CTE-NUM               PIC 9(12) COMP.                     
198000    03 WS-S016-0106-SER-NUM               PIC 9(04) COMP.                     
198100    03 WS-S016-0106-SER-CVETIPO           PIC 9(02) COMP.                     
198200    03 WS-S016-0106-OPCION                PIC 9(02) COMP.                     
198300    03 FILLER                             PIC X(48).                          
198400                                                                              
198500 01 WS-S016-0106-SALIDA.                                                      
198600    03 FILLER                             PIC X(96).                          
198700                                                                              
198800 77 WS-S016-0106-RESULT                PIC S9(11) BINARY.                     
198900                                                                              
199000****************************************************************              
199100$POP OMIT                                                                     
199200*****************************************************************             
199300$SET OMIT = NOT S016L458                                                      
199400*****************************************************************             
199500*                 LIBRERIA S016/L458 (LIGAS)                    *             
199600*                                                               *             
199700*      (S016)S016/OBJECT/L458/ACCESOBD2K/XXMTPXXX               *             
199800*                                                               *             
199900* ENTRYPOINT:                                                   *             
200000*      S016_L458_BUSCA_MDA:      REGRESA EL NUMERO DE CONTRATO  *             
200100*                                LIGADO AL MEDIO DE ACCESO:     *             
200200*                                CHEQUERA O TARJETA             *             
200300*                                                               *             
200400*      DATOS DE ENTRADA PARA CHEQUERA                           *             
200500*            WS-S016-0201-SUC-E        = SUCURSAL MEDACC        *             
200600*            WS-S016-0201-CTA-E        = CUENTA Y DIGITO        *             
200700*      DATOS DE ENTRADA PARA TARJETA                            *             
200800*            WS-S016-0201-CUENTA-E     = NUMERO DE TARJETA      *             
200900*                                                               *             
201000*            WS-S06-0201-SOL-SUBMDA    = SOLICITUD DEL SUBMEDIO *             
201100*                                        DE ACCESO              *             
201200*                                                               *             
201300*      DATOS DE SALIDA :                                        *             
201400*            WS-S016-0201-CUENTA-S     = NUMERO DE CONTRATO     *             
201500*            WS-S016-0201-CSI-S        = NUMERO DE C.S.I.       *             
201600*            WS-S016-0201-CLIENTE-S    = NUMERO DE CLIENTE      *             
201700*            WS-S016-0201-PROD-S       = NUMERO DE PRODUCTO     *             
201800*            WS-S016-0201-INST-S       = NUMERO DE INSTRUMENTO  *             
201900*            WS-S016-0201-STATUS       = ESTATUS                *             
202000*            WS-S016-0201-MDATIPO-S    = TIPO MEDIO DE ACCESO   *             
202100*            WS-S016-0201-MDASUBTIPO-S = SUBTIPO MEDIO DE ACCESO*             
202200*                                                               *             
202300*                                                               *             
202400*****************************************************************             
202500 01  WS-S016-0201-L458.                                                       
202600     02 WS-S016-0201-DMERROR.                                                 
202700        04 WS-S016-0201-CATEGORIA     PIC 9(02).                              
202800        04 WS-S016-0201-SBCATERGO     PIC 9(04).                              
202900        04 WS-S016-0201-ESTRUCTURA    PIC 9(04).                              
203000     02 WS-S016-0201-ENT-SAL          PIC X(900).                             
203100                                                                              
203200     02 RD-S016-0201-ENT-SAL REDEFINES WS-S016-0201-ENT-SAL.                  
203300                                                                              
203400        04 WS-S016-0201-ENTRADA.                                              
203500           06 WS-S016-0201-CUENTA-E   PIC 9(16)     COMP.                     
203600           06 RD-S016-0201-CUENTA-E   REDEFINES                               
203700                                      WS-S016-0201-CUENTA-E.                  
203800              08 WS-S016-0201-SUC-E   PIC 9(04)     COMP.                     
203900              08 WS-S016-0201-CTA-E   PIC 9(12)     COMP.                     
204000                                                                              
204100        04 WS-S016-0201-SALIDA.                                               
204200           06 WS-S016-0201-CUENTA-S     PIC 9(16)   COMP.                     
204300           06 RD-S016-0201-CUENTA-S     REDEFINES                             
204400                                        WS-S016-0201-CUENTA-S.                
204500              08 WS-S016-0201-SUC-S     PIC 9(04)   COMP.                     
204600              08 WS-S016-0201-CTA-S     PIC 9(12)   COMP.                     
204700           06 WS-S016-0201-CSI-S        PIC 9(02)   COMP.                     
204800           06 WS-S016-0201-CLIENTE-S    PIC 9(12)   COMP.                     
204900           06 WS-S016-0201-PROD-S       PIC 9(04)   COMP.                     
205000           06 WS-S016-0201-INST-S       PIC 9(02)   COMP.                     
205100           06 WS-S016-0201-STATUS-S     PIC 9(02)   COMP.                     
205200           06 WS-S016-0201-MDATIPO-S    PIC 9(02)   COMP.                     
205300           06 WS-S016-0201-MDASUBTIPO-S PIC 9(02)   COMP.                     
205400                                                                              
205500        04 FILLER                     PIC X(871).                             
205600                                                                              
205700 01 WS-S016-0201-RESULT               REAL.                                   
205800                                                                              
205900 77 WKS-88-S016ACCESOBD               PIC 99       COMP VALUE 0.              
206000                                                                              
206100 77 W77-DMERROR                       REAL.                                   
206200 77 W77-DMERRORTYPE                   REAL.                                   
206300 77 W77-DMSTRUCTURE                   REAL.                                   
206400                                                                              
206500****************************************************************              
206600$POP OMIT                                                                     
206700*****************************************************************             
206800$SET OMIT = NOT S016L45801                                                    
206900*****************************************************************             
207000*                 LIBRERIA S016/L458 (LIGAS)                    *             
207100*                                                               *             
207200*      (S016)S016/OBJECT/L458/ACCESOBD2K/XXMTPXXX               *             
207300*                                                               *             
207400* ENTRYPOINT:                                                   *             
207500*      S016_L458_BUSCA_MDA:      REGRESA EL NUMERO DE CONTRATO  *             
207600*                                LIGADO AL MEDIO DE ACCESO:     *             
207700*                                CHEQUERA O TARJETA             *             
207800*                                                               *             
207900*      DATOS DE ENTRADA PARA CHEQUERA                           *             
208000*            WS-S016-0201-SUC-E        = SUCURSAL MEDACC        *             
208100*            WS-S016-0201-CTA-E        = CUENTA Y DIGITO        *             
208200*      DATOS DE ENTRADA PARA TARJETA                            *             
208300*            WS-S016-0201-CUENTA-E     = NUMERO DE TARJETA      *             
208400*                                                               *             
208500*            WS-S06-0201-SOL-SUBMDA    = SOLICITUD DEL SUBMEDIO *             
208600*                                        DE ACCESO              *             
208700*                                                               *             
208800*      DATOS DE SALIDA :                                        *             
208900*            WS-S016-0201-CUENTA-S     = NUMERO DE CONTRATO     *             
209000*            WS-S016-0201-CSI-S        = NUMERO DE C.S.I.       *             
209100*            WS-S016-0201-CLIENTE-S    = NUMERO DE CLIENTE      *             
209200*            WS-S016-0201-PROD-S       = NUMERO DE PRODUCTO     *             
209300*            WS-S016-0201-INST-S       = NUMERO DE INSTRUMENTO  *             
209400*            WS-S016-0201-STATUS       = ESTATUS                *             
209500*            WS-S016-0201-MDATIPO-S    = TIPO MEDIO DE ACCESO   *             
209600*            WS-S016-0201-MDASUBTIPO-S = SUBTIPO MEDIO DE ACCESO*             
209700*                                                               *             
209800*                                                               *             
209900*****************************************************************             
210000 01  WS-S016-0201-L458.                                                       
210100     02 WS-S016-0201-DMERROR.                                                 
210200        04 WS-S016-0201-CATEGORIA     PIC 9(02).                              
210300        04 WS-S016-0201-SBCATERGO     PIC 9(04).                              
210400        04 WS-S016-0201-ESTRUCTURA    PIC 9(04).                              
210500     02 WS-S016-0201-ENT-SAL          PIC X(900).                             
210600                                                                              
210700     02 RD-S016-0201-ENT-SAL REDEFINES WS-S016-0201-ENT-SAL.                  
210800                                                                              
210900        04 WS-S016-0201-ENTRADA.                                              
211000           06 WS-S016-0201-CUENTA-E   PIC 9(16)     COMP.                     
211100           06 RD-S016-0201-CUENTA-E   REDEFINES                               
211200                                      WS-S016-0201-CUENTA-E.                  
211300              08 WS-S016-0201-SUC-E   PIC 9(04)     COMP.                     
211400              08 WS-S016-0201-CTA-E   PIC 9(12)     COMP.                     
211500           06 WS-S016-0201-OPCION-E   PIC 9(02)     COMP.                     
211600                                                                              
211700        04 WS-S016-0201-SALIDA.                                               
211800           06 WS-S016-0201-CSI-S        PIC 9(02)   COMP.                     
211900           06 WS-S016-0201-CLIENTE-S    PIC 9(12)   COMP.                     
212000           06 WS-S016-0201-PROD-S       PIC 9(04)   COMP.                     
212100           06 WS-S016-0201-INST-S       PIC 9(02)   COMP.                     
212200           06 WS-S016-0201-CUENTA-S     PIC 9(16)   COMP.                     
212300           06 RD-S016-0201-CUENTA-S     REDEFINES                             
212400              WS-S016-0201-CUENTA-S.                                          
212500              08 WS-S016-0201-SUC-S     PIC 9(04)   COMP.                     
212600              08 WS-S016-0201-CTA-S     PIC 9(12)   COMP.                     
212700           06 WS-S016-0201-MDATIPO-S    PIC 9(02)   COMP.                     
212800           06 WS-S016-0201-MDASUBTIPO-S PIC 9(02)   COMP.                     
212900           06 WS-S016-0201-STATUS-S     PIC 9(02)   COMP.                     
213000           06 WS-S016-0201-FECHALT-S    PIC 9(08)   COMP.                     
213100           06 WS-S016-0201-FECHMOD-S    PIC 9(08)   COMP.                     
213200           06 WS-S016-0201-FECHCAN-S    PIC 9(08)   COMP.                     
213300                                                                              
213400*****   04 WS-S016-0201-RESULT          PIC 9(11)   COMP.                     
213500        04 FILLER                       PIC X(858).                           
213600 01 WS-S016-0201-RESULT               REAL.                                   
213700                                                                              
213800 77 WKS-88-S016ACCESOBD               PIC 99       COMP VALUE 0.              
213900                                                                              
214000 77 W77-DMERROR                       REAL.                                   
214100 77 W77-DMERRORTYPE                   REAL.                                   
214200 77 W77-DMSTRUCTURE                   REAL.                                   
214300                                                                              
214400****************************************************************              
214500$POP OMIT                                                                     
214600****************************************************************              
214700$SET OMIT = NOT TRACES016R10                                                  
214800 01 WKSS-S016-R10.                                                            
214900    02 WKSS-S016-0201-RESULT-GPO.                                             
215000       04 WKSS-S016-0201-RESULT           PIC 9(10).                          
215100    02 WKSS-S016-0201-RESULT-DES REDEFINES                                    
215200       WKSS-S016-0201-RESULT-GPO.                                             
215300       04 WKSS-S016-0201-RESULT-ERR       PIC 9(03).                          
215400       04 WKSS-S016-0201-RESULT-TYPE      PIC 9(04).                          
215500       04 WKSS-S016-0201-RESULT-STRU      PIC 9(03).                          
215600    02 WKSS-S016-0201-CUENTA-E            PIC 9(16).                          
215700    02 WKSS-S016-0201-CSI-S               PIC 9(02).                          
215800    02 WKSS-S016-0201-CLIENTE-S           PIC 9(12).                          
215900    02 WKSS-S016-0201-PROD-S              PIC 9(04).                          
216000    02 WKSS-S016-0201-INST-S              PIC 9(02).                          
216100    02 WKSS-S016-0201-STATUS-S            PIC 9(02).                          
216200    02 WKSS-S016-0201-MDATIPO-S           PIC 9(02).                          
216300    02 WKSS-S016-0201-MDASUBTIPO-S        PIC 9(02).                          
216400$POP OMIT                                                                     
216500$SET OMIT = NOT S050L190                                                      
216600***************************************************************               
216700**   PARAMETROS LIBRERIA S050/OBJECT/L190/COBCOM            ***               
216800**   PARA OBTENER LAS CONSULTAS DE ESTADO DE CUENTA         ***               
216900***************************************************************               
217000 01  WS-S050-L190-PARAMETRO.                                                  
217100     02 WS-S050-L190-PARAM-ENTRADA.                                           
217200        04 WS-S050-L190-01-PROD           PIC 9(04)    COMP.                  
217300        04 WS-S050-L190-01-INST           PIC 9(04)    COMP.                  
217400        04 WS-S050-L190-01-CONTRATO       PIC 9(12)    COMP.                  
217500        04 WS-S050-L190-01-PROCESO        PIC 9(02)    COMP.                  
217600     02 WS-S050-L190-PARAM-SALIDA.                                            
217700        04 WS-S050-L190-01-RESULT         PIC 9(02)    COMP.                  
217800           88 W88-S050-L190-RS-OK         VALUE 01.                           
217900           88 W88-S050-L190-RS-ERR-PARM   VALUE 02.                           
218000           88 W88-S050-L190-RS-NO-INF     VALUE 04.                           
218100           88 W88-S050-L190-RS-NO-DISP    VALUE 05, 06.                       
218200        04 WS-S050-L190-01-SERV-COMIS     OCCURS 20.                          
218300           06 WS-S050-L190-01-CONTADOR    PIC 9(04)    COMP.                  
218400*             OC 01 = CONSULTA EN CAJERO CICLO ACTUAL                         
218500*             OC 02 = CONSULTA EN CAJERO CICLO ANTERIOR                       
218600*             OC 03 =                                                         
218700*             OC 04 =                                                         
218800*             OC 05 =                                                         
218900*             OC 06 =                                                         
219000*             OC 07 =                                                         
219100*             OC 08 =                                                         
219200*             OC 09 =                                                         
219300*             OC 10 =                                                         
219400*             OC 11 =                                                         
219500*             OC 12 =                                                         
219600*             OC 13 =                                                         
219700*             OC 14 =                                                         
219800*             OC 15 =                                                         
219900*             OC 16 =                                                         
220000*             OC 17 =                                                         
220100*             OC 18 =                                                         
220200*             OC 19 =                                                         
220300*             OC 20 =                                                         
220400*                                                                             
220500$POP OMIT                                                                     
220600$SET OMIT = NOT S050L191                                                      
220700***************************************************************               
220800*    PARAMETROS LIBRERIA S050/OBJECT/L191/COBCOM              *               
220900*    WKS-S050-L191-CEP-S = CORTE ESPECIAL A PAPEL             *               
221000*    WKS-S050-L191-CEM-S = CORTE ESPECIAL EN MEDIO MAGNETICO  *               
221100*    WKS-S050-L191-ECM-S = EDO/CTA  EN MEDIO MAGNETICO        *               
221200***************************************************************               
221300 01  WKS-S050-L191-PARAMETRO.                                                 
221400     02 WKS-S050-L191-PARM-ENTRADA.                                           
221500        04 WKS-S050-L191-FUNCION-I    PIC 9(01).                              
221600        04 WKS-S050-L191-KEY-I        PIC X(18).                              
221700     02 WKS-S050-L191-PARM-SALIDA.                                            
221800        04 WKS-S050-L191-RESULT-S     PIC 9(02)      COMP.                    
221900        04 WKS-S050-L191-DATOS-S      PIC X(500).                             
222000        04 RD-WKS-S050-L191-DATOS-S                                           
222100           REDEFINES WKS-S050-L191-DATOS-S.                                   
222200           06 WKS-S050-L191-MOVTOS    OCCURS 20 TIMES.                        
222300              08 WKS-S050-L191-PRD-S  PIC 9(04)      COMP.                    
222400              08 WKS-S050-L191-INS-S  PIC 9(02)      COMP.                    
222500              08 WKS-S050-L191-CTO-S  PIC 9(12)      COMP.                    
222600              08 WKS-S050-L191-CEP-S  PIC 9(04)      COMP.                    
222700              08 WKS-S050-L191-CEM-S  PIC 9(04)      COMP.                    
222800              08 WKS-S050-L191-ECM-S  PIC 9(04)      COMP.                    
222900           06 WKS-S050-L191-KEY-S     PIC X(18).                              
223000           06 FILLER                  PIC X(182).                             
223100                                                                              
223200$POP OMIT                                                                     
223300$SET OMIT = NOT S050SALDOS                                                    
223400*************** PARA LIBRERIA DE SALDOS DE CLIENTES *********                 
223500 01 WS-S016-0401-PARAMETRO.                                                   
223600    03 WS-S016-0401-NUMPROD    PIC 9(04)       COMP.                          
223700    03 WS-S016-0401-NUMINST    PIC 9(02)       COMP.                          
223800    03 WS-S016-0401-CTE        PIC 9(12)       COMP.                          
223900    03 WS-S016-0401-FILL       PIC X(32).                                     
224000 01 RD-S016-0401-PARAMETRO     REDEFINES WS-S016-0401-PARAMETRO.              
224100    03 WS-S016-0401-PROD-S     PIC 9(04)       COMP.                          
224200    03 WS-S016-0401-INST-S     PIC 9(02)       COMP.                          
224300    03 WS-S016-0401-CLI        PIC 9(12)       COMP.                          
224400    03 WS-S016-0401-RESFON     PIC 9(02)       COMP.                          
224500    03 WS-S016-0401-FONDOS     PIC 9(12)V99    COMP.                          
224600    03 WS-S016-0401-RESBINV    PIC 9(02)       COMP.                          
224700    03 WS-S016-0401-BCAINV     PIC 9(12)V99    COMP.                          
224800    03 WS-S016-0401-RESPINV    PIC 9(02)       COMP.                          
224900    03 WS-S016-0401-PLAINV     PIC 9(12)V99    COMP.                          
225000    03 WS-S016-0401-RESCME     PIC 9(02)       COMP.                          
225100    03 WS-S016-0401-SDOCME     PIC 9(12)V99    COMP.                          
225200                                                                              
225300****************************************************************              
225400$POP OMIT                                                                     
225500$SET OMIT = NOT S016L422R04                                                   
225600                                                                              
225700 01  WS-S016-0501-CTR-ENTRADA.                                                
225800     02 WS-S016-0501-CTR-NUMCSI-E            PIC 9(02) COMP.                  
225900     02 WS-S016-0501-CTR-NUMSIST-E           PIC 9(04) COMP.                  
226000     02 WS-S016-0501-CTR-NUMPASO-E           PIC 9(04) COMP.                  
226100     02 WS-S016-0501-CTR-LLAVE-E.                                             
226200         03 WS-S016-0501-CTA-NUMPROD-E       PIC 9(04) COMP.                  
226300         03 WS-S016-0501-CTA-CVEINST-E       PIC 9(04) COMP.                  
226400         03 WS-S016-0501-CTO-NUM-E.                                           
226500            05 WS-S016-0501-CTA-NUMPREF-E    PIC 9(04) COMP.                  
226600            05 WS-S016-0501-CTA-NUM-E        PIC 9(12) COMP.                  
226700         03 WS-S016-0501-MDA-CVETIPO-E       PIC 9(02) COMP.                  
226800         03 WS-S016-0501-MDA-CTONUM-E.                                        
226900            05 WS-S016-0501-MDA-NUMPREF-E    PIC 9(04) COMP.                  
227000            05 WS-S016-0501-MDA-NUM-E        PIC 9(12) COMP.                  
227100     02  WS-S016-0501-CTR-NUMREG-E           PIC 9(02) COMP.                  
227200     02  FILLER                              PIC X(33).                       
227300                                                                              
227400 01 WS-S016-0501-CTR-SALIDA.                                                  
227500    02 WS-S016-0501-CTR-NUMREG             PIC 9(02) COMP.                    
227600    02 WS-S016-0501-CTR-REGISTRO           OCCURS 05 TIMES.                   
227700       03 WS-S016-0501-CTE-NUM             PIC 9(12) COMP.                    
227800       03 WS-S016-0501-CTA-NUMPROD         PIC 9(04) COMP.                    
227900       03 WS-S016-0501-CTA-CVEINST         PIC 9(04) COMP.                    
228000       03 WS-S016-0501-CTA-NUMCTO.                                            
228100          05 WS-S016-0501-CTA-NUMPREF      PIC 9(04) COMP.                    
228200          05 WS-S016-0501-CTA-NUM          PIC 9(12) COMP.                    
228300       03 WS-S016-0501-MDA-CVETIPO         PIC 9(02) COMP.                    
228400       03 WS-S016-0501-MDA-SUBTIPO         PIC 9(02) COMP.                    
228500       03 WS-S016-0501-MDA-CVETIT          PIC 9(02) COMP.                    
228600       03 WS-S016-0501-MDA-NUMCTO.                                            
228700          05 WS-S016-0501-MDA-NUMPREF      PIC 9(04) COMP.                    
228800          05 WS-S016-0501-MDA-NUM          PIC 9(12) COMP.                    
228900       03 WS-S016-0501-MDA-ABRPROFT        PIC X(03).                         
229000       03 WS-S016-0501-CTR-PTRNOMT         PIC 9(04) COMP.                    
229100       03 WS-S016-0501-MDA-ABRPROFC        PIC X(03).                         
229200       03 WS-S016-0501-CTR-PTRNOMC         PIC 9(04) COMP.                    
229300       03 WS-S016-0501-MDA-NUMTALON        PIC 9(02) COMP.                    
229400       03 WS-S016-0501-MDA-CHQXTALON       PIC 9(02) COMP.                    
229500       03 WS-S016-0501-MDA-CVESTATUS       PIC 9(02) COMP.                    
229600       03 WS-S016-0501-MDA-FECALTA         PIC 9(08) COMP.                    
229700       03 WS-S016-0501-MDA-FECULTMOD       PIC 9(08) COMP.                    
229800       03 WS-S016-0501-MDA-FECVENC         PIC 9(08) COMP.                    
229900       03 WS-S016-0501-MDA-FECCANCEL       PIC 9(08) COMP.                    
230000       03 WS-S016-0501-MDA-FECPREV         PIC 9(06) COMP.                    
230100       03 WS-S016-0501-MDA-HHPREV          PIC 9(04) COMP.                    
230200       03 FILLER                           PIC X(21).                         
230300                                                                              
230400 77  WS-S016-0501-RESULT                   PIC S9(11) BINARY.                 
230500                                                                              
230600************************************************************                  
230700$POP OMIT                                                                     
230800$SET OMIT = NOT S016L520                                                      
230900************************************************************                  
231000*   PARAMETROS PARA LLAMAR S016/L520/S016BD02CON           *                  
231100************************************************************                  
231200 01 WS-S016-0601-L520-PARAM.                                                  
231300    02 WS-S016-0601-CTR-ENTRADA.                                              
231400       04 WS-S016-0601-E-NUMSIST        PIC 9(04)    COMP.                    
231500       04 WS-S016-0601-E-NUMPASO        PIC 9(04)    COMP.                    
231600       04 WS-S016-0601-E-OPCION         PIC 9(02)    COMP.                    
231700*         01 = MODO ASCENDENTE                                                
231800*         02 = MODO DESCENDENTE                                               
231900*         03 = CONSUL. CTES ASIGNADOS A UN EJECUTIVO                          
232000*         04 = CONSUL. INF. GRAL. DEL CLIENTE.                                
232100       04 WS-S016-0601-E-CTEINICIO      PIC 9(12)    COMP.                    
232200       04 WS-S016-0601-E-GPOTIPO        PIC 9(02)    COMP.                    
232300       04 WS-S016-0601-E-CTEULTIMO      PIC 9(12)    COMP.                    
232400       04 WS-S016-0601-E-EJENUM         PIC 9(10)    COMP.                    
232500       04 WS-S016-0601-E-RELEJECTE      PIC 9(02)    COMP.                    
232600       04 WS-S016-0601-E-CTENUMCSI      PIC 9(02)    COMP.                    
232700       04 FILLER                        PIC X(39).                            
232800                                                                              
232900    02 WS-S016-0601-CTR-SALIDA.                                               
233000       04 WS-S016-0601-S-ERROR          PIC 9(02)       COMP.                 
233100       04 WS-S016-0601-S-RESTO          PIC X(385).                           
233200       04 WS-S016-0601-S-OPC-01  REDEFINES WS-S016-0601-S-RESTO.              
233300          06 WS-S016-0601-S-REGS OCCURS 20 TIMES.                             
233400             08 WS-S016-0601-S-CTENUM   PIC 9(12)       COMP.                 
233500             08 WS-S016-0601-S-GPOTIPO  PIC 9(02)       COMP.                 
233600             08 WS-S016-0601-S-CTEREL   PIC 9(02)       COMP.                 
233700             08 WS-S016-0601-S-FEALTA   PIC 9(06)       COMP.                 
233800             08 WS-S016-0601-S-FEMOD    PIC 9(06)       COMP.                 
233900          06 WS-S016-0601-S-EJENUM      PIC 9(10)       COMP.                 
234000          06 FILLER                     PIC X(100).                           
234100                                                                              
234200       04 WS-S016-0602-S-OPC-04  REDEFINES WS-S016-0601-S-RESTO.              
234300          06 WS-S016-0602-S-SEGCAP      PIC X(02).                            
234400          06 WS-S016-0602-S-SEGCOL      PIC X(02).                            
234500          06 WS-S016-0602-S-CVEINDIV    PIC 9(02).                            
234600          06 WS-S016-0602-S-SDOPROCAP   PIC 9(12)V99   COMP.                  
234700          06 WS-S016-0602-S-SDOPROCOL   PIC 9(12)V99   COMP.                  
234800          06 WS-S016-0602-S-NUMERO      PIC 9(12)      COMP.                  
234900          06 WS-S016-0602-S-NUMCSI      PIC 9(02)      COMP.                  
235000          06 WS-S016-0602-S-NOM         PIC X(55).                            
235100          06 WS-S016-0602-S-RFC         PIC X(15).                            
235200          06 WS-S016-0602-S-STAT        PIC 9(02)      COMP.                  
235300          06 WS-S016-0602-S-CVEPERS     PIC 9(02)      COMP.                  
235400          06 WS-S016-0602-S-CVESECTOR   PIC 9(02)      COMP.                  
235500          06 WS-S016-0602-S-CVEACTBM    PIC 9(06)      COMP.                  
235600          06 WS-S016-0602-S-CVESEG      PIC 9(02)      COMP.                  
235700          06 WS-S016-0602-S-NUMOFICON   PIC 9(04)      COMP.                  
235800          06 WS-S016-0602-S-NUMUNIMER   PIC 9(04)      COMP.                  
235900          06 WS-S016-0602-S-FECALTA     PIC 9(06)      COMP.                  
236000          06 WS-S016-0602-S-FECULTMOD   PIC 9(06)      COMP.                  
236100          06 FILLER                     PIC X(271).                           
236200                                                                              
236300*****************************************************************             
236400$POP OMIT                                                                     
236500$SET OMIT = NOT S016L428                                                      
236600 77  WKS-88-S016L428                  PIC 99  COMP VALUE 0.                   
236700$POP OMIT                                                                     
236800$SET OMIT = NOT S016L428R01                                                   
236900************************************************************                  
237000*   PARAMETROS PARA LLAMAR S016/L428/B04CTAB08MDA          *                  
237100************************************************************                  
237200 01 WS-S016-0701-ENTRADA.                                                     
237300    02 WS-S016-0701-CTA-NUMPROD-E    PIC 9(04) COMP.                          
237400    02 WS-S016-0701-CTA-CVEINST-E    PIC 9(02) COMP.                          
237500    02 WS-S016-0701-CTA-NUMPREF-E    PIC 9(04) COMP.                          
237600    02 WS-S016-0701-CTA-NUM-E        PIC 9(12) COMP.                          
237700    02 WS-S016-0701-CTR-OPCION-E     PIC 9(02) COMP.                          
237800    02 WS-S016-0701-CTA-CVESTATUS-E  PIC 9(02) COMP.                          
237900    02 WS-S016-0701-MDA-CVESTATUS-E  PIC 9(02) COMP.                          
238000    02 FILLER                        PIC X(46).                               
238100                                                                              
238200 77 WS-S016-0701-RESULT                 PIC S9(11) BINARY.                    
238300$POP OMIT                                                                     
238400$SET OMIT = NOT S016L428R02                                                   
238500************************************************************                  
238600*   PARAMETROS PARA LLAMAR S016_L428_BAJA_CTA_CTA (27)     *                  
238700*   SIZE = 80 CHARACTERS                                                      
238800************************************************************                  
238900 01 WS-S016-E428-27-ENTRADA.                                                  
239000    02 WS-S016-E428-27-CTR-NUMCSI    PIC 9(002) COMP.                         
239100    02 WS-S016-E428-27-CTE-NUM       PIC 9(012) COMP.                         
239200    02 WS-S016-E428-27-CTA-NUMPRD    PIC 9(004) COMP.                         
239300    02 WS-S016-E428-27-CTA-CVEINST   PIC 9(004) COMP.                         
239400    02 WS-S016-E428-27-CTA-NUMPREF   PIC 9(004) COMP.                         
239500    02 WS-S016-E428-27-CTA-NUM       PIC 9(012) COMP.                         
239600    02 WS-S016-E428-27-CTR-CVEREL    PIC 9(002) COMP.                         
239700    02 WS-S016-E428-27-CTA-PRODREL   PIC 9(004) COMP.                         
239800    02 WS-S016-E428-27-CTA-INSTREL   PIC 9(004) COMP.                         
239900    02 WS-S016-E428-27-CTA-PREFREL   PIC 9(004) COMP.                         
240000    02 WS-S016-E428-27-CTA-CTAREL    PIC 9(012) COMP.                         
240100    02 WS-S016-E428-27-CTA-OPCION    PIC 9(002) COMP.                         
240200    02 FILLER                        PIC X(042).                              
240300                                                                              
240400 01 WS-S016-S428-27-SALIDA.                                                   
240500    02 WS-S016-S428-27-CTR-ERROR        PIC 9(04) COMP.                       
240600    02 WS-S016-S428-27-CTR-ERRORTYPE    PIC 9(04) COMP.                       
240700    02 WS-S016-S428-27-CTR-STRUCTURE    PIC 9(04) COMP.                       
240800                                                                              
240900 77 WS-S016-R428-27-RESULT           PIC S9(11) BINARY.                       
241000$POP OMIT                                                                     
241100$SET OMIT = NOT S016L428R03                                                   
241200******************************************************************            
241300****   PARAMETROS PARA EL ENTRY POINT S016_L428_B04CUENTAS (04)***            
241400******************************************************************            
241500*                                                                             
241600 77 WS-S016-R428-04-CTR-ERROR             PIC S9(11) BINARY.                  
241700*                                                                             
241800 01 WS-S016-E428-04-CTR-ENTRADA.                                              
241900    02 WS-S016-E428-04-CTA-NUMPREF        PIC 9(004) COMP.                    
242000    02 WS-S016-E428-04-CTA-NUM            PIC 9(012) COMP.                    
242100    02 WS-S016-E428-04-CTA-NUMPROD        PIC 9(004) COMP.                    
242200    02 WS-S016-E428-04-CTA-CVEINST        PIC 9(002) COMP.                    
242300    02 WS-S016-E428-04-OPCION             PIC 9(002) COMP.                    
242400    02 WS-S016-E428-04-CTA-DIACORTE       PIC 9(002) COMP.                    
242500    02 WS-S016-E428-04-CTA-CVEMONEDA      PIC 9(002) COMP.                    
242600    02 WS-S016-E428-04-CTA-CVEENVIO       PIC 9(004) COMP.                    
242700    02 WS-S016-E428-04-CTA-EDIEDOCTA      PIC 9(002) COMP.                    
242800    02 WS-S016-E428-04-CTA-DISEDOCTA      PIC 9(002) COMP.                    
242900    02 WS-S016-E428-04-CTA-CVEMANEJO      PIC 9(002) COMP.                    
243000    02 WS-S016-E428-04-CTA-CVENIVRIE      PIC X(001).                         
243100    02 WS-S016-E428-04-CTA-CVESTATUS      PIC 9(002) COMP.                    
243200    02 WS-S016-E428-04-CTA-CVEUSO         PIC 9(002) COMP.                    
243300    02 WS-S016-E428-04-CTR-USOEJECTA      PIC 9(004) COMP.                    
243400    02 WS-S016-E428-04-CTR-USOSCTE        PIC 9(004) COMP.                    
243500    02 WS-S016-E428-04-CTA-VENDNOMI       PIC 9(010) COMP.                    
243600    02 WS-S016-E428-04-CTA-VENDSUC        PIC 9(004) COMP.                    
243700    02 WS-S016-E428-04-CTA-REFENOMI       PIC 9(010) COMP.                    
243800    02 WS-S016-E428-04-CTA-REFECVE        PIC 9(002) COMP.                    
243900    02 WS-S016-E428-04-CTA-PREVNOMI       PIC 9(010) COMP.                    
244000    02 WS-S016-E428-04-CTA-PREVSUC        PIC 9(004) COMP.                    
244100    02 WS-S016-E428-04-CTA-PREVIMP        PIC 9(014) COMP.                    
244200    02 WS-S016-E428-04-CTA-RESTRINC       PIC 9(002) COMP.                    
244300    02 WS-S016-E428-04-CTA-RESTCON        PIC 9(002) COMP.                    
244400    02 WS-S016-E428-04-CTA-OPCPAGO        PIC 9(002) COMP.                    
244500    02 WS-S016-E428-04-CTA-RGOPAGO        PIC 9(002) COMP.                    
244600    02 WS-S016-E428-04-CTA-RETIMP         PIC 9(002) COMP.                    
244700    02 WS-S016-E428-04-CTA-FECAPER-2K     PIC 9(008) COMP.                    
244800    02 WS-S016-E428-04-CTA-FECCANC-2K     PIC 9(008) COMP.                    
244900    02 WS-S016-E428-04-CTA-FECRENO-2K     PIC 9(008) COMP.                    
245000    02 WS-S016-E428-04-CTA-SITUACION      PIC X(004).                         
245100    02 WS-S016-E428-04-CTA-CVEVENDE       PIC 9(002) COMP.                    
245200    02 WS-S016-E428-04-CTA-IDVENDE        PIC 9(012) COMP.                    
245300    02 WS-S016-E428-04-CTE-NUM            PIC 9(012) COMP.                    
245400    02 FILLER                             PIC X(02).                          
245500*SIZE REG X(89) no es m³ltiplo de seis.                                       
245600$POP OMIT                                                                     
245700                                                                              
245800$SET OMIT = NOT S016L428R04                                                   
245900*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
246000******************************************************************            
246100* PARAMETROS PARA EL ENTRY POINT S016_L428_M_STA_BENEFICENCIA(36)*            
246200******************************************************************            
246300 01 E428-36-CTR-ENTRADA.                                                      
246400    02 E428-36-CTA-NUMPROD        PIC  9(04)  COMP.                           
246500    02 E428-36-CTA-CVEINST        PIC  9(02)  COMP.                           
246600    02 E428-36-CTA-NUMPREF        PIC  9(04)  COMP.                           
246700    02 E428-36-CTA-NUM            PIC  9(12)  COMP.                           
246800    02 E428-36-CTR-OPCION         PIC  9(02)  COMP.                           
246900    02 E428-36-CTA-CVESTATUS      PIC  9(02)  COMP.                           
247000                                                                              
247100 01 S428-36-CTR-SALIDA.                                                       
247200    02 S428-36-CTE-NUM            PIC  9(12)  COMP.                           
247300    02 S428-36-CTA-NUMPROD        PIC  9(04)  COMP.                           
247400    02 S428-36-CTA-CVEINST        PIC  9(02)  COMP.                           
247500    02 S428-36-CTA-NUMPREF        PIC  9(04)  COMP.                           
247600    02 S428-36-CTA-NUM            PIC  9(12)  COMP.                           
247700                                                                              
247800 77 R428-36-CTR-ERROR             PIC S9(11)  BINARY.                         
247900*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
248000$POP OMIT                                                                     
248100*P0120414 CHARITY Regulatory Requirement III* 15 LINEAS PCB AG/19             
248104$SET OMIT = NOT S016L428R05                                                   
248112******************************************************************            
248116*PARAMETROS PARA EL ENTRY POINT S016_L428_M_STA_BENEFICENCIA2(40)*            
248120******************************************************************            
248124 01 E428-40-CTR-ENTRADA.                                                      
248128    02 E428-40-CTA-NUMPROD        PIC 9(04) COMP.                             
248132    02 E428-40-CTA-CVEINST        PIC 9(02) COMP.                             
248136    02 E428-40-CTA-NUMPREF        PIC 9(04) COMP.                             
248140    02 E428-40-CTA-NUM            PIC 9(12) COMP.                             
248144    02 E428-40-CTR-OPCION         PIC 9(02) COMP.                             
248148    02 E428-40-CTA-CVESTATUS      PIC 9(02) COMP.                             
248158    02 E428-40-PASO               PIC 9(03) COMP.                             
248168    02 E428-40-CAJA               PIC 9(02) COMP.                             
248180                                                                              
248184 77 R428-40-CTR-ERROR             PIC S9(11) BINARY.                          
248192$POP OMIT                                                                     
248200*$SET OMIT = NOT S041SEGURIDAD                                                
248300******************************************************************            
248400* PARAMETROS PARA LLAMAR A SEGURIDAD                                          
248500******************************************************************            
248600*77  WKS-88-SEGURIDAD                PIC 99    COMP VALUE 0.                  
248700*77  WS-S041-RESULTADO               PIC S9(11) BINARY.                       
248800*77  WS-S041-TIPERROR                PIC 9(2).                                
248900*77  WS-S041-LSN-INPUT               PIC S9(11) BINARY.                       
249000*01  WS-S041-SUC-MONITOR             PIC 9(4) VALUE 0.                        
249100*01  WS-S041-SEGURIDAD-VA            PIC 9.                                   
249200*    88 WS-88-S041-SEGURIDAD-ON      VALUE 1.                                 
249300*    88 WS-88-S041-SEGURIDAD-OFF     VALUE 0.                                 
249400*01  WS-S041-STN-SINSEG              PIC X(8) VALUE SPACES.                   
249500*01  WS-S041-MODULOS.                                                         
249600*    05 WS-S041-MODULO-4             PIC X(5) VALUE "_0004".                  
249700*    05 WS-S041-MODULO-30            PIC X(5) VALUE "_0030".                  
249800*    05 WS-S041-MODULO-50            PIC X(5) VALUE "_0050".                  
249900*    05 WS-S041-MODULO-60            PIC X(5) VALUE "_0060".                  
250000*    05 WS-S041-MODULO-98            PIC X(5) VALUE "_0098".                  
250100*    05 WS-S041-MODULO-100           PIC X(5) VALUE "_0100".                  
250200*    05 WS-S041-MODULO-200           PIC X(5) VALUE "_0200".                  
250300*    05 WS-S041-MODULO-201           PIC X(5) VALUE "_0201".                  
250400*     05 WS-S041-MODULO-202           PIC X(5) VALUE "_0202".                 
250500*    05 WS-S041-MODULO-299           PIC X(5) VALUE "_0299".                  
250600*    05 WS-S041-MODULO-371           PIC X(5) VALUE "_0371".                  
250700*77  WS-S041-LSN                     PIC S9(11) BINARY.                       
250800*01  WS-S041-STN                     PIC  X(08).                              
250900*01  WS-S041-MODULO                  PIC  X(05).                              
251000*01  WS-S041-CLAVE                   PIC  X(05).                              
251100*01  WS-S041-CLAVER REDEFINES        WS-S041-CLAVE.                           
251200*    02 WS-S041-PREFIJO              PIC X.                                   
251300*    02 WS-S041-TRANS                PIC X(4).                                
251400*77  WS-S041-IMPORTE                 PIC S9(23) BINARY.                       
251500*77  WS-S041-NIVEL                   PIC S9(11) BINARY.                       
251600*77  WS-S041-CVEOPE                  PIC S9(11) BINARY.                       
251700***************************************************************               
251800*                 LIBRERIA(S041)SEGURIDAD                     *               
251900*                                                             *               
252000*   ENTRYPOINT: TRANSACCIONVALIDA                             *               
252100*                                                             *               
252200*   DATOS DE ENTRADA:                                         *               
252300*          WS-MENSAJE-DIALOG  = DONDE SE TOMARA LSN Y STATION *               
252400*          WS-S041-MODULO     = MODULO DE SEGURIDAD ASIGNADO  *               
252500*                               A LA TRANSACCION              *               
252600*          WS-S041-TRANS      = CLAVE DE LA TRANSACCION       *               
252700*          WS-S041-IMPORTE    = IMPORTE DE LA TRANSACCION     *               
252800*          WS-S041-CAMPO1 (1) = MONEDA                        *               
252900*                                                             *               
253000*   DATOS DE SALIDA:                                          *               
253100*          WS-S041-NIVEL      = NIVEL CON EL QUE OPERO O DEBIO*               
253200*                               OPERAR LA TRANSACCION         *               
253300*          WS-S041-CVEOPE     = NUMERO DEL OPERADOR           *               
253400*          WS-S041-CAMPO2 (1) = NOMINA DEL OPERADOR           *               
253500*          WS-S041-TIPERROR   = 0 TRANSACCION OK              *               
253600*                               1 OPERADOR NO TIENE FACULTADES*               
253700*                               2 OPERADOR NO AUTORIZADO      *               
253800*      ?SI ES FIRMA MANCOMUNADA:                              *               
253900*             WS-S041-CAMPO2 (2) = NUMERO DE OPERADOR DEL     *               
254000*                                  FUNCIONARIO 1              *               
254100*             WS-S041-CAMPO2 (3) = NOMINA DEL FUNCIONARIO 1   *               
254200*             WS-S041-CAMPO2 (4) = NUMERO DE OPERADOR DEL     *               
254300*                                  FUNCIONARIO 2              *               
254400*             WS-S041-CAMPO2 (5) = NOMINA DEL FUNCIONARIO 2   *               
254500*          WS-S041-RESULTADO     = RESULTADO DEL LLAMADO      *               
254600*            0, 1 = TODO BIEN                                 *               
254700*              -1 = SEGURIDAD NO DISPONIBLE                   *               
254800*              -2 = NIVEL INSUFICIENTE DE FACULTADES          *               
254900*              -3 = TERMINAL NO ESTA FIRMADA                  *               
255000*              -4 = SEGURIDAD BLOQUEADA                       *               
255100*              -5 = APLICACION BLOQUEADA AL OPERADOR          *               
255200*              -6 = OFICINA NO ESTA EN SEGURIDAD              *               
255300*              -7 = APLICACION DESCONOCIDA                    *               
255400*              -8 = OPERADOR NO TIENE REGISTRADO EL MODULO    *               
255500*              -9 = ESTACION DESCONOCIDA, TERM S/N SUC O DEP  *               
255600*             -10 = SE FIRMO OTRO OPERADOR DIFERENTE DEL QUE  *               
255700*                   TRANSMITIO                                *               
255800*             -11 = LSN INVALIDO                              *               
255900*             -12 = OPERADOR NO ESTA FIRMADO O NO ACTIVO      *               
256000*             -17 = OFICINA FUERA DE RANGO                    *               
256100*             -18 = SEGURIDAD LEVANTANDOSE                    *               
256200***************************************************************               
256300*01  WS-S041-01                    REAL.                                      
256400*    03 WS-S041-CAMPO1             REAL  OCCURS 320 TIMES.                    
256500*    03 WS-S041-CAMPO1-R REDEFINES WS-S041-CAMPO1.                            
256600*       05 WS-S041-DIVISA          REAL.                                      
256700*       05 WS-S041-FILLER1         REAL  OCCURS 319 TIMES.                    
256800*01  WS-S041-02                    REAL.                                      
256900*    03 WS-S041-CAMPO2             REAL  OCCURS 320 TIMES.                    
257000*    03 WS-S041-CAMPO2-R REDEFINES WS-S041-CAMPO2.                            
257100*       05 WS-S041-NOMINA-OPE      REAL.                                      
257200*       05 WS-S041-NUMOPE-FUN1     REAL.                                      
257300*       05 WS-S041-NOMINA-FUN1     REAL.                                      
257400*       05 WS-S041-NUMOPE-FUN2     REAL.                                      
257500*       05 WS-S041-NOMINA-FUN2     REAL.                                      
257600*       05 WS-S041-FILLER2         REAL  OCCURS 315 TIMES.                    
257700*$POP OMIT                                                                    
257800*$SET OMIT = NOT TRACES041R01                                                 
257900*01 WKSS-S041.                                                                
258000*   02 WKSS-S041-LSN              PIC 9(08).                                  
258100*   02 WKSS-S041-STANAME          PIC X(08).                                  
258200*   02 WKSS-S041-SISTEMA          PIC X(04).                                  
258300*   02 WKSS-S041-CVETRAN          PIC X(12).                                  
258400*   02 WKSS-S041-MONEDA           PIC 9(02).                                  
258500*   02 WKSS-S041-IMPORTE          PIC S9(14)V99.                              
258600*   02 WKSS-S041-CAMPOS OCCURS 2 TIMES.                                       
258700*      03 WKSS-S041-CAMPO1        PIC 9(10).                                  
258800*      03 WKSS-S041-CAMPO2        PIC 9(10).                                  
258900*      03 WKSS-S041-CAMPO3        PIC 9(10).                                  
259000*   02 WKSS-S041-RESULTADO        PIC S9(10).                                 
259100*$POP OMIT                                                                    
259200                                                                              
259300                                                                              
259400                                                                              
259500                                                                              
259600                                                                              
259700                                                                              
259800$SET OMIT = NOT S080IVA                                                       
259900*****************************************************************             
260000*       PARAMETROS ENTRADA PARA LA LIBRERIA S080TARIFAS (IVA)   *             
260100*****************************************************************             
260200****** CAMPOS FIJOS SE LLENAN EN EL INCLUDE                     *             
260300* WS-S080-0101-NUMSIST      = SISTEMA LLAMADOR (500)            *             
260400* WS-S080-0101-OPCION       = OPCION           (30=CONSULTA IVA)*             
260500* WS-S080-0101-NUMSECC      = NUMERO SECCION   (=ZEROS)         *             
260600* WS-S080-0101-NUMPROD      = NUMERO PRODUCTO  (=1000)          *             
260700* WS-S080-0101-NUMINST      = NUMERO INSTRUM   (=02)            *             
260800* WS-S080-0101-NUMCVE       = CLAVE            (=10)            *             
260900* WS-S080-0101-NUMMONEDA    = MONEDA           (=ZEROS)         *             
261000* WS-S080-0101-TPOPERS      = TIPO DE PERSONA  (=ZEROS)         *             
261100* WS-S080-0101-TPOPLAZO     = NUMERO DE PLAZO  (=ZEROS)         *             
261200* WS-S080-0101-HORAVIG      = HORA VIG "HHMM"  (=ZEROS)         *             
261300* WS-S080-0101-VALOR-MINIMO = VALOR MINIMO     (=ZEROS)         *             
261400* WS-S080-0101-NUMREGS      = REGS A CONSULTAR (=01)            *             
261500*****************************************************************             
261600****** CAMPOS A LLENAR EN CADA PROGRAMA *************************             
261700* WS-S080-0101-NUMPASO      = NUMERO DE PROGRAMA LLAMADOR       *             
261800* WS-S080-0101-NUMSUC       = NUMERO DE SUCURSAL PROMOTORA      *             
261900* WS-S080-0101-FECHAVIG     = FECHA DE VIGENCIA(AAMMDD)         *             
262000*****************************************************************             
262100                                                                              
262200 01 WS-S080-0101-CTRL-ENTRADA.                                                
262300    03 WS-S080-0101-NUMSIST           PIC 9(04).                              
262400    03 WS-S080-0101-NUMPASO           PIC 9(04).                              
262500    03 WS-S080-0101-OPCION            PIC 9(02).                              
262600    03 WS-S080-0101-NUMSUC            PIC 9(04).                              
262700    03 WS-S080-0101-NUMSECC           PIC 9(06).                              
262800    03 WS-S080-0101-NUMPROD           PIC 9(04).                              
262900    03 WS-S080-0101-NUMINST           PIC 9(02).                              
263000    03 WS-S080-0101-NUMCVE            PIC 9(04).                              
263100    03 WS-S080-0101-NUMMONEDA         PIC 9(03).                              
263200    03 WS-S080-0101-TPOPERS           PIC 9(02).                              
263300    03 WS-S080-0101-TPOPLAZO          PIC 9(04).                              
263400    03 WS-S080-0101-FECHAVIG          PIC 9(06).                              
263500    03 WS-S080-0101-HORAVIG           PIC 9(04).                              
263600    03 WS-S080-0101-VALOR-MINIMO      PIC S9(11).                             
263700    03 WS-S080-0101-NUMREGS           PIC 9(02).                              
263800                                                                              
263900*****************************************************************             
264000*       PARAMETRO  SALIDA  PARA LA LIBRERIA S080TARIFAS (IVA)   *             
264100*****************************************************************             
264200* WS-S080-0101-VALOR-S(1)     = VALOR IVA                       *             
264300* WS-S080-0101-DECVALOR-S(1)  = NUMERO DE DECIMALES DEL (VALOR) *             
264400*                                                               *             
264500***************** CAMPOS AUXILIARES IVA *************************             
264600* WS-NETO-IVA    = IMPORTE NETO DEL IVA      (10.00  15.00).    *             
264700* WS-IMPORTE-IVA = IMPORTE IVA PARA CALCULOS (01.10  01.15)     *             
264800*****************************************************************             
264900 01 WS-S080-0101-CTRL-SALIDA.                                                 
265000    03 WS-S080-0101-REGS-ENTREGADOS   PIC 9(02).                              
265100    03 WS-S080-0101-OCCURS            OCCURS 1 TIMES.                         
265200       05 WS-S080-0101-NUMSUC-S       PIC 9(04).                              
265300       05 WS-S080-0101-NUMSEC-S       PIC 9(06).                              
265400       05 WS-S080-0101-NUMPROD-S      PIC 9(04).                              
265500       05 WS-S080-0101-NUMINST-S      PIC 9(02).                              
265600       05 WS-S080-0101-NUMCVE-S       PIC 9(04).                              
265700       05 WS-S080-0101-MONEDA-S       PIC 9(03).                              
265800       05 WS-S080-0101-TPOPERS-S      PIC 9(02).                              
265900       05 WS-S080-0101-ESCALA-S       PIC 9(02).                              
266000       05 WS-S080-0101-TPOTARIFA-S    PIC 9(02).                              
266100       05 WS-S080-0101-FECHAVIG-S     PIC 9(06).                              
266200       05 WS-S080-0101-HORAVIG-S      PIC 9(04).                              
266300       05 WS-S080-0101-IMPIVA-S       PIC S9(11).                             
266400       05 WS-S080-0101-DECIVA-S       PIC 99.                                 
266500       05 WS-S080-0101-PLAZO-S        PIC 9(04).                              
266600       05 WS-S080-0101-VALOR-S        PIC S9(11).                             
266700       05 WS-S080-0101-DECVALOR-S     PIC 9(02).                              
266800       05 WS-S080-0101-IMPMINIMO-S    PIC S9(11).                             
266900       05 WS-S080-0101-DECMINIMO-S    PIC 9(02).                              
267000       05 WS-S080-0101-IMPMAXIMO-S    PIC S9(11).                             
267100       05 WS-S080-0101-DECMAXIMO-S    PIC 9(02).                              
267200       05 WS-S080-0101-VALOR-ADD-S    PIC S9(11).                             
267300       05 WS-S080-0101-DECVALORADD-S  PIC 9(02).                              
267400       05 WS-S080-0101-IMPTORET-S     PIC S9(11).                             
267500       05 WS-S080-0101-DECIMPTO-S     PIC 9(02).                              
267600       05 WS-S080-0101-FECHA-ALTA-S   PIC 9(06).                              
267700       05 WS-S080-0101-HORA-ALTA-S    PIC 9(04).                              
267800       05 WS-S080-0101-FECHA-BAJA-S   PIC 9(06).                              
267900       05 WS-S080-0101-HORA-BAJA-S    PIC 9(04).                              
268000       05 WS-S080-0101-FECULTMOD-S    PIC 9(06).                              
268100       05 WS-S080-0101-HORAULTMOD-S   PIC 9(04).                              
268200       05 WS-S080-0101-FECHACAD-S     PIC 9(06).                              
268300       05 FILLER                      PIC X(19).                              
268400                                                                              
268500****** CAMPO DEL RESULTADO DEL CALL S080TARIFAS (IVA) ********                
268600                                                                              
268700 77 WS-S080-0101-RESULT               PIC S9(11)   BINARY.                    
268800                                                                              
268900 77 WKS-88-S080TARIFAS                PIC 99   COMP VALUE 0.                  
269000***    CAMPOS AUXILIARES LIB S080TARIFAS (IVA)   **************               
269100                                                                              
269200 01  WS-VALORES-AUX-IVA.                                                      
269300     02 WS-NETO-IVA                   PIC 9(12)V99.                           
269400     02 WS-IMPORTE-IVA                PIC 9(04)V99.                           
269500                                                                              
269600***    VALORES FIJOS PARA IVA e ISR              **************               
269700 77  WS-IVA-GRAL-ANT                  PIC 99       VALUE 15.                  
269800 77  WS-IVA-GRAL-0-ANT                PIC 9V99     VALUE 0.15.                
269900 77  WS-IVA-GRAL-1-ANT                PIC 9V99     VALUE 1.15.                
270000 77  WS-IVA-GRAL-NVO                  PIC 99       VALUE 16.                  
270100 77  WS-IVA-GRAL-0-NVO                PIC 9V99     VALUE 0.16.                
270200 77  WS-IVA-GRAL-1-NVO                PIC 9V99     VALUE 1.16.                
270300 77  WS-IVA-GRAL                      PIC 99       VALUE 16.                  
270400 77  WS-IVA-GRAL-0                    PIC 9V99     VALUE 0.16.                
270500 77  WS-IVA-GRAL-1                    PIC 9V99     VALUE 1.16.                
270600 77  WS-IVA-FRONT-ANT                 PIC 99       VALUE 10.                  
270700 77  WS-IVA-FRONT-0-ANT               PIC 9V99     VALUE 0.10.                
270800 77  WS-IVA-FRONT-1-ANT               PIC 9V99     VALUE 1.10.                
270900 77  WS-IVA-FRONT-NVO                 PIC 99       VALUE 11.                  
271000 77  WS-IVA-FRONT-0-NVO               PIC 9V99     VALUE 0.11.                
271100 77  WS-IVA-FRONT-1-NVO               PIC 9V99     VALUE 1.11.                
271200 77  WS-IVA-FRONT                     PIC 99       VALUE 11.                  
271300 77  WS-IVA-FRONT-0                   PIC 9V99     VALUE 0.11.                
271400 77  WS-IVA-FRONT-1                   PIC 9V99     VALUE 1.11.                
271500 77  WS-ISR-0-ANT                     PIC 9V99     VALUE 0.85.                
271600 77  WS-ISR-EXTR-0-ANT                PIC 9V999    VALUE 0.049.               
271700 77  WS-ISR-EXEN-USD-ANT              PIC 9(06)V99 VALUE 7887.                
271800*NOTA: CUANDO SE MODIFIQUE EL FACTOR % DE ISR LAS VARIABLES                   
271900*WS-ISR-0-NVO Y WS-ISR-0 DEBEN TENER EL VALOR ANTERIOR Y LA                   
272000*VARIABLE WS-ISR-0-2017 EL NUEVO VALOR.                                       
272100* 77  WS-ISR-0-NVO                     PIC 9V99     VALUE 0.60.               
272200 77  WS-ISR-0-NVO                     PIC 9V99     VALUE 0.50.                
272300 77  WS-ISR-EXTR-0-NVO                PIC 9V999    VALUE 0.049.               
272400 77  WS-ISR-EXEN-USD-NVO              PIC 9(06)V99 VALUE 8668.                
272500* 77  WS-ISR-0                         PIC 9V99     VALUE 0.60.               
272600 77  WS-ISR-0                         PIC 9V99     VALUE 0.50.                
272700 77  WS-ISR-EXTR-0                    PIC 9V999    VALUE 0.049.               
272800 77  WS-ISR-EXEN-USD                  PIC 9(06)V99 VALUE 8668.00.             
272900* 77  WS-ISR-0-2016                    PIC 9V99     VALUE 0.50.               
273000 77  WS-ISR-0-2017                    PIC 9V99     VALUE 0.58.                
273100 77  WS-FEC-INI-IVA-PBAS              PIC 9(08)    VALUE 20091130.            
273200 77  WS-FEC-INI-IVA-PROD              PIC 9(08)    VALUE 20100101.            
273300 77  WS-PISR-0                        PIC 9V99     VALUE 0.20.                
273400* VALOR FACTOR DE AJUSTE CAT 9991 TARIFA 254 PARA CALCULO DE ISR              
273500 77  WS-ISR-0-9991-254                PIC 99V9999 COMP.                       
273600* VALOR FACTOR DE PORCENTAJE CAT 9991 TARIFA 255 PARA EL ISR                  
273700 77  WS-PISR-0-9991-255               PIC 99V9999 COMP.                       
273800                                                                              
273900*    PARA OBTENER EL NOMBRE DEL EQUIPO                                        
274000 01  WKS-NAME-HOST.                                                           
274100     02 WKS-MY-HOST         PIC X(20).                                        
274200     02 RD-WKS-MY-HOST      REDEFINES  WKS-MY-HOST.                           
274300        04 WKS-MY-HOST-03   PIC X(04).                                        
274400        04 WKS-MY-HOST-17   PIC X(16).                                        
274500                                                                              
274600***************************************************************               
274700$POP OMIT                                                                     
274800$SET OMIT = NOT S080L700 AND NOT S080TARIFAS                                  
274900 77 WKS-88-S080BD01CON           PIC 99   COMP VALUE 0.                       
275000$POP OMIT                                                                     
275100$SET OMIT = NOT S080L700                                                      
275200*****************************************************************             
275300*           CAMPOS PARA LIBRERIA L700  SISTEMA S080             *             
275400*         PARA OBTENER NODO DE IMPRESION DE LISTADOS            *             
275500* ENTRADAS FIJOS: (EN INCLUDE)                                  *             
275600*        WS-S080-L700-ENTRADA    = AREA ENTRADA     (=ALL @00@) *             
275700*        WS-S080-L700-SALIDA     = AREA SALIDA      (=ALL @00@) *             
275800*        WS-S080-L700-SISTEMA-I  = SISTEMA LLAMADOR (=500)      *             
275900*        WS-S080-L700-CVE2-I     = CLAVE            (=02)       *             
276000*        WS-S080-L700-PROD2-I    = PRODUCTO         (=9016)     *             
276100*        WS-S080-L700-NUREG2-I   = NUM-REGS         (=01)       *             
276200*        WS-S080-L700-RESULT     = RESULTADO        (=0)        *             
276300* ENTRADAS CADA PASO:                                           *             
276400*        WS-S080-L700-PASO-I     = NUMERO DE PROGRAMA           *             
276500*        WS-S080-L700-OFNA2-I    = NUMERO DE SUCURSAL           *             
276600*                                                               *             
276700* SALIDAS:                                                      *             
276800*        WS-S080-S700-CSI-S(1)   = NODO DE IMPRESION            *             
276900*           SI EXISTE ERROR EN EL CALL                          *             
277000*           WS-S080-L700-RESULT > 0                             *             
277100*                                                               *             
277200*****************************************************************             
277300*           CAMPOS PARA LIBRERIA L700  SISTEMA S080             *             
277400*             PARA OBTENER DATOS GENERALES DE UNA OFICINA       *             
277500* ENTRADAS FIJOS: (EN INCLUDE)                                  *             
277600*        WS-S080-L700-ENTRADA    = AREA ENTRADA     (=ALL @00@) *             
277700*        WS-S080-L700-SALIDA     = AREA SALIDA      (=ALL @00@) *             
277800*        WS-S080-L700-CVE-I      = CLAVE            (=0)        *             
277900*        WS-S080-L700-RESULT     = RESULTADO        (=0)        *             
278000* ENTRADAS CADA PASO:                                           *             
278100*        WS-S080-L700-PASO-I     = NUMERO DE PROGRAMA           *             
278200*        WS-S080-L700-OFNA-I     = SUCURSAL A CONSULTAR         *             
278300*                                                               *             
278400* SALIDAS:                                                      *             
278500*        WS-S080-L700-NOMB-CORTO-S = NOMBRE CORTO               *             
278600*        WS-S080-L700-CSI-S        = CSI A QUE PERTENECE        *             
278700*                                                               *             
278800*****************************************************************             
278900 77 WS-S080-L700-SISTEMA-I            PIC S9(11)    BINARY.                   
279000 77 WS-S080-L700-PASO-I               PIC S9(11)    BINARY.                   
279100 77 WS-S080-L700-RESULT               PIC S9(11)    BINARY.                   
279200                                                                              
279300 01 WS-S080-L700-ENTRADA.                                                     
279400    02 WS-S080-L700-OFNA-I            PIC 9(04)     COMP.                     
279500    02 WS-S080-L700-CVE-I             PIC 9(02)     COMP.                     
279600    02 FILLER                         PIC X(27).                              
279700 01 RD-WS-S080-L700-ENTRADA REDEFINES WS-S080-L700-ENTRADA.                   
279800    02 WS-S080-L700-CVE2-I            PIC 9(02)     COMP.                     
279900    02 WS-S080-L700-PROD2-I           PIC 9(04)     COMP.                     
280000    02 WS-S080-L700-INST2-I           PIC 9(02)     COMP.                     
280100    02 WS-S080-L700-OFNA2-I           PIC 9(08)     COMP.                     
280200    02 WS-S080-L700-SECC2-I           PIC 9(08)     COMP.                     
280300    02 WS-S080-L700-NUREG2-I          PIC 9(02)     COMP.                     
280400    02 FILLER                         PIC X(17).                              
280500                                                                              
280600 01 WS-S080-L700-SALIDA.                                                      
280700    02 WS-S080-L700-OFNA-S            PIC 9(04)     COMP.                     
280800    02 WS-S080-L700-COMITE-S          PIC 9(04)     COMP.                     
280900    02 WS-S080-L700-AREA-S            PIC 9(04)     COMP.                     
281000    02 WS-S080-L700-DIVISION-S        PIC 9(04)     COMP.                     
281100    02 WS-S080-L700-DIRECC-S          PIC 9(04)     COMP.                     
281200    02 WS-S080-L700-GCIA-PZA-REG-S    PIC 9(04)     COMP.                     
281300    02 WS-S080-L700-OPER-COMER-S      PIC 9(04)     COMP.                     
281400    02 WS-S080-L700-TPO-OFNA-S        PIC 9(02)     COMP.                     
281500    02 WS-S080-L700-NOMB-CORTO-S      PIC X(20).                              
281600    02 WS-S080-L700-NOMB-LARGO-S      PIC X(40).                              
281700    02 WS-S080-L700-DOMICILIO-S       PIC X(36).                              
281800    02 WS-S080-L700-COLONIA-S         PIC X(24).                              
281900    02 WS-S080-L700-POBLACION-S       PIC X(20).                              
282000    02 WS-S080-L700-ZONA-POST-S       PIC 9(02)     COMP.                     
282100    02 WS-S080-L700-COD-POST-S        PIC 9(06)     COMP.                     
282200    02 WS-S080-L700-FILLER-APDO-S     PIC X(35).                              
282300    02 WS-S080-L700-ENVIO-CORRESP-S   PIC 9(02)     COMP.                     
282400    02 WS-S080-L700-TEL-OFNA-S        PIC 9(10)     COMP.                     
282500    02 WS-S080-L700-RESPON-OFNA-S     PIC X(36).                              
282600    02 FILLER                         PIC X(03).                              
282700    02 WS-S080-L700-TEL-RESP-S        PIC 9(10)     COMP.                     
282800    02 WS-S080-L700-ESTADO-S          PIC 9(02)     COMP.                     
282900    02 WS-S080-L700-CIUDAD-S          PIC 9(04)     COMP.                     
283000    02 WS-S080-L700-MPIO-S            PIC 9(04)     COMP.                     
283100    02 WS-S080-L700-REGION-S          PIC 9(02)     COMP.                     
283200    02 WS-S080-L700-ZONA-S            PIC 9(02)     COMP.                     
283300    02 WS-S080-FILLER                 PIC X(10).                              
283400    02 WS-S080-L700-CSI-S             PIC 9(02)     COMP.                     
283500    02 FILLER                         PIC X(98).                              
283600 01 RD-WS-S080-L700-SALIDA  REDEFINES WS-S080-L700-SALIDA.                    
283700    02 WS-S080-S700-NUMREG-S          PIC 9(02)     COMP.                     
283800    02 WS-S080-S700-REGISTROS-S       OCCURS 5 TIMES.                         
283900       03 WS-S080-S700-OFNA-S         PIC 9(08)     COMP.                     
284000       03 WS-S080-S700-SECC-S         PIC 9(08)     COMP.                     
284100       03 WS-S080-S700-PROD-S         PIC 9(04)     COMP.                     
284200       03 WS-S080-S700-INTR-S         PIC 9(02)     COMP.                     
284300       03 WS-S080-S700-MONEDA-S       PIC 9(02)     COMP.                     
284400       03 WS-S080-S700-NVAUT-S        PIC 9(02)     COMP.                     
284500       03 WS-S080-S700-CENTRALIZ-S    PIC 9(08)     COMP.                     
284600       03 WS-S080-S700-CSI-S          PIC 9(02)     COMP.                     
284700       03 WS-S080-S700-DIACORTE-S     PIC 9(02)     COMP.                     
284800       03 WS-S080-S700-FECALTA-S      PIC 9(06)     COMP.                     
284900       03 WS-S080-S700-FECBAJA-S      PIC 9(06)     COMP.                     
285000       03 WS-S080-S700-FECULTMOD-S    PIC 9(06)     COMP.                     
285100       03 FILLER                      PIC X(32).                              
285200    02 FILLER                         PIC X(59).                              
285300                                                                              
285400$POP OMIT                                                                     
285500$SET OMIT = NOT S080TARIFAS                                                   
285600*****************************************************************             
285700*            LIBRERIA S080L700 (S080TARIFAS) "S080BD01CON"      *             
285800*                                                               *             
285900* PARAMETROS DE ENTRADA PARA ENTRY POINT "L700_RAF_TAR"         *             
286000*                                                               *             
286100* FIJOS POR INCLUDE:                                            *             
286200*                                                               *             
286300* WS-S080-0201-SISTEMA   =  500 (SISTEMA LLAMADOR)              *             
286400* WS-S080-0201-FUNCION   =  21  (CLAVE DE CONSULTA)             *             
286500* WS-S080-0201-OFNA      =  0                                   *             
286600* WS-S080-0201-SECCION   =  0                                   *             
286700* WS-S080-0201-PLAZO     =  0                                   *             
286800*                                                               *             
286900* POR CADA PASO:                                                *             
287000*                                                               *             
287100* WS-S080-0201-NUMREGS   =  NUM-REGS SOLICITADOS (MAX 10)       *             
287200* WS-S080-0201-PASO      =  NUMERO DE PASO LLAMADOR             *             
287300* WS-S080-0201-PRODUCTO  =  NUMERO DE PRODUCTO                  *             
287400*                           9991=TASA BASE DE CALCULO           *             
287500* WS-S080-0201-INSTRUM   =  NUMERO DE INSTRUMENTO               *             
287600*                           01=TASA BASE CALCULO                *             
287700* WS-S080-0201-CVTARIF   =  CLAVE DE TARIFA                     *             
287800*                           "COMISIONES POR "                   *             
287900*                            02=CERTIFICACION DE CHEQUE         *             
288000*                            15=CHEQUE GIRADO                   *             
288100*                            16=APERTURA                        *             
288200*                            17=ANIVERSARIO                     *             
288300*                            18=MANEJO DE CUENTA                *             
288400*                            19=RETIRO CON TARJETA              *             
288500*                            23=SIT. COMPRA DE GIROS (MINIMO)   *             
288600*                            24=EXPEDICION CHEQUE DE VENTANILLA *             
288700*                            25=CHEQUE DEVULETO (INSUFONDOS)    *             
288800*                            26=DEVOL CHEQUE C.I. DEP. SBC      *             
288900*                            27=DEV COMPRA DE GIROS (MINIMO)    *             
289000*                            28=ENVIO EDO CTA A SUCURSAL        *             
289100*                            29=EDO DE CTA EN MEDIO MAGNETICO   *             
289200*                            30=CONSULTA/IMPR EDO-CTA/MOVTOS    *             
289300*                               (MES ACTUAL, MES ANTERIOR)      *             
289400*                            31=CONSULTA/IMPR MOVIMIENTOS       *             
289500*                               (DEL DIA EN SUCURSAL)           *             
289600*                            38=PREVENCION DE CHEQUE            *             
289700*                               (POR EVENTO)                    *             
289800*                            39=DEP.EN FIRME DCTO C.I.(MINIMO)  *             
289900*                            40=COPIAS FOTOSTATICAS             *             
290000*                               (POR EDO-CTA/COMPROBANTE)       *             
290100*                            41=NUMERO DE CHEQUES EXCENTOS      *             
290200*                               POR CADA DEPOSITO DE NOMINA     *             
290300*                            42=REPOSICION DE TARJETA           *             
290400*                            43=ACLARACION DE TARJETA           *             
290500*                            44=COSTO DE CHEQUERAS              *             
290600*                            45=CONSULTA DE SALDOS              *             
290700*                            46=BANCA ELECTRONICA               *             
290800*                                                               *             
290900*                                                               *             
291000*                           "TASA PAGO DE RENDIMIENTOS"         *             
291100*                            50 (POR LTE-INF/LTE-SUP/TASA       *             
291200*                                GENERAL PARA TODOS LOS INSTR)  *             
291300*                            52 (POR NUMERO DE RANGO/TASA       *             
291400*                                PARA CTA-PROD-ESPECIAL)        *             
291500*                                                               *             
291600*                           "TASAS BASE DE CALCULO"             *             
291700*                           601=C.P.P. BANXICO                  *             
291800*                           701=TASA LIDER                      *             
291900*                           803=PRIME RATE                      *             
292000*                                                               *             
292100* WS-S080-0201-MONEDA    =  NUMERO DE MONEDA                    *             
292200*                        =  0= "TASAS BASE DE CALCULO"          *             
292300*                           1= MONEDA NACIONAL                  *             
292400*                           5= DOLARES                          *             
292500* WS-S080-0201-PERSONA   =  TIPO DE PERSONA                     *             
292600*                           0= "TASAS BASE DE CALCULO"          *             
292700*                           1= PERSONA FISICA                   *             
292800*                           2= PERSONA MORAL                    *             
292900* WS-S080-0201-FECHVIG   =  FECHA DE VIGECIA (PROCESO)          *             
293000* WS-S080-0201-HORAVIG   =  HORA DE VIGECIA O CEROS             *             
293100* WS-S080-0201-IMPMIN    =  LTE-INF O NUMERO DE RANGO           *             
293200*                           0= "TASAS BASE DE CALCULO"          *             
293300*                              "COMISIONES "                    *             
293400* WS-S080-0201-NUMREGS   =  REGISTROS SOLICITADOS (MAXIMO 10)   *             
293500*                                                               *             
293600* WS-S080-0201-NIVEL     =  0 AL PRIMER CALL                    *             
293700* WS-S080-0201-FECHCTRL  =  0 AL PRIMER CALL                    *             
293800* WS-S080-0201-HORACTRL  =  0 AL PRIMER CALL                    *             
293900*                                                               *             
294000*                                                               *             
294100* SI EL CAMPO WS-S080-0201-IMPMIN SE PASA EN CEROS              *             
294200*       REGRESA LOS REGISTROS DE TODOS LOS RANGOS CORRESPON-    *             
294300*       DIENTES A LA MONEDA-PERSONA SOLICITADOS.                *             
294400* SI LOS CAMPOS WS-S080-0201-IMPMIN Y WS-S080-0201-PERSONA      *             
294500*       SE PASAN EN CERO, REGRESA LOS REGISTROS DE TODOS LOS    *             
294600*       RANGOS Y PERSONAS CORRESPONDIENTES A LA MONEDA.         *             
294700* SI LOS CAMPOS WS-S080-0201-IMPMIN, WS-S080-0201-PERSONA Y     *             
294800*       WS-S080-0201-MONEDA SE PASAN EN CEROS REGRESA LOS       *             
294900*       REGISTROS DE LOS RANGOS, PERSONAS Y MONEDAS DE LA       *             
295000*       TARIFA SOLICITADA                                       *             
295100*                                                               *             
295200* SI EL CAMPO WS-S080-0201-FECHVIG SE PASA EN CEROS, EL CAMPO   *             
295300*    WS-S080-0201-HORAVIG TAMBIEN DEBE PASARSE EN CEROS Y       *             
295400*    REGRESA LA TARIFA VIGENTE A LA FECHA Y HORA DE LA MAQUINA. *             
295500*                                                               *             
295600* SI SE PASA FECHA Y HORA DE VIGENCIA REGRESA LA TARIFA A LA    *             
295700* FECHA Y HORA SOLICITADA.                                      *             
295800*                                                               *             
295900* SI UNICAMENTE SE PASA FECHA DE VIGENCIA Y LA HORA EN CEROS    *             
296000* REGRESA LA TARIFAS A LA FECHA SOLICITADA Y LA HORA (23:59)    *             
296100* ES DECIR LA ULTIMA DE ESE DIA.                                *             
296200*                                                               *             
296300*                                                               *             
296400* DATOS DE SALIDA:                                              *             
296500*   WS-S080-0201-REGS-S     = NUMERO DE REGISTROS ENTREGADOS    *             
296600*   WS-S080-0201-PRODTAR-S  = NUMERO DE PRODUCTO                *             
296700*   WS-S080-0201-INSTAR-S   = NUMERO DE INSTRUMENTO             *             
296800*   WS-S080-0201-CVETAR-S   = CLAVE DE LA TARIFA                *             
296900*   WS-S080-0201-MONEDA-S   = MONEDA DE LA TARIFA               *             
297000*                             1= M.N                            *             
297100*                             5= DOLARES                        *             
297200*   WS-S080-0201-PERS-S     = TIPO DE PERSONA                   *             
297300*                             1=FISICA                          *             
297400*                             2=MORAL                           *             
297500*   WS-S080-0201-TASA-S     = VALOR DE LA TASA NETA             *             
297600*   WS-S080-0201-DCTASA-S   = NUMERO DE DECIMALES DE LA TASA    *             
297700*   WS-S080-0201-LTEINF-S   = LIMITE INFERIOR       (CVE 50)    *             
297800*                             NUMERO DE RANGO       (CVE 52)    *             
297900*   WS-S080-0201-DECINF-S   = DECIMALES DEL LTE-INF (CVE 50)    *             
298000*                             ZEROS EN              (CVE 52)    *             
298100*   WS-S080-0201-LTESUP-S   = LIMITE SUPRERIOR      (CVE 50)    *             
298200*   WS-S080-0201-DECSUP-S   = DECIMALES DEL LTE-SUP (CVE 50)    *             
298300*                                                               *             
298400* DATOS DE SALIDA: (COMISIONES EN GENERAL)                      *             
298500* WS-S080-0202-COMIS = VALOR DE LA COMISION.                    *             
298600* WS-S080-0202-DCCOM = NUMERO DE DECIMALES DE LA COMISION       *             
298700*                                                               *             
298800* DATOS DE SALIDA: (COMISION POR MANEJO DE CUENTA)              *             
298900* WS-S080-0203-COMIMAN = VALOR DE LA COMISION                   *             
299000* WS-S080-0203-DCCOM   = NUMERO DE DECILAMES DE LA COMISION     *             
299100* WS-S080-0203-SDOMIN  = SALDO MINIMO PARA NO COBRAR COMISION   *             
299200* WS-S080-0203-DCSDOMIN = NUMERO DE DECIMALES DEL SALDO MINIMO  *             
299300*                                                               *             
299400* DATOS DE SALIDA: (COMISION POR CHEQUE GIRADO)                 *             
299500* WS-S080-0204-COMCHG = VALOR DE LA COMISION POR CHEQUE         *             
299600* WS-S080-0204-DCCOMI = NUMERO DE DECIMALES DE LA COMISION      *             
299700* WS-S080-0204-SDOCHQEX = SDO PROMEDIO PARA EXENTAR CHEQUES     *             
299800* WS-S080-0204-DCSDOCHQEX = NUMERO DE DECIMALES DEL SDO PROM.   *             
299900* WS-S080-0204-CHQXSDO = NUMERO DE CHEQUES EXENTOS POR SDO PROM *             
300000* WS-S080-0204-CHQSLIB = CHEQUES LIBRES POR CICLO               *             
300100*                                                               *             
300200* DATOS DE SALIDA: (COMISION POR SITUACION COMPRA DE GIROS)     *             
300300* WS-S080-0205-SITFIRME = VALOR SITUACION MIMINA (EN FIRME)     *             
300400* WS-S080-0205-DCSITFRM = NUMERO DE DECIMALES SIT-ENFIRME       *             
300500* WS-S080-0205-SIT48HRS = VALOR SITUACION MINIMA (SBC 48HRS)    *             
300600* WS-S080-0205-DCSIT48H = NUMERO DE DECIMALES SIT-SBC48HRS      *             
300700*                                                               *             
300800* DATOS DE SALIDA: (COMISION POR CONSULTA EDO-CTA)              *             
300900* WS-S080-0206-ECTAVENT = COMISION EN VENTANILLA (SUCURSAL)     *             
301000* WS-S080-0206-DCECVENT = NUMERO DE DECIMALES (VENTANILLA)      *             
301100* WS-S080-0206-ECTACAJERO = COMISION EN CAJERO (CAJERO)         *             
301200* WS-S080-0206-DCECCAJERO = NUMERO DE DECIMALES (CAJERO)        *             
301300*                                                               *             
301400* DATOS DE SALIDA: (COMISION POR FOTOCOPIAS)                    *             
301500* WS-S080-0207-COPIAECTA = COMISION (POR EDO DE CTA)            *             
301600* WS-S080-0207-DCCOPECTA = NUMERO DE DECIMALES (EDO DE CTA)     *             
301700* WS-S080-0207-COPIAOTROS = COMISION (POR COMPROBANTE)          *             
301800* WS-S080-0207-DCCOPOTROS = NUMERO DE DECIMALES (COMPROBANTE)   *             
301900*                                                               *             
302000*****************************************************************             
302100*                                                               *             
302200* RESULTADOS DEL CALL:                                          *             
302300*  WS-S080-0201-RESULT  = 00 CALL OK Y NO HAY MAS REGISTROS     *             
302400*                         01 CALL OK Y    HAY MAS REGISTROS     *             
302500*                         02 REGISTRO DE SALIDA INSUFICIENTE    *             
302600*                         20 REGISTRO SOLICITADO NO EXISTE      *             
302700*                         30 CLAVE DE CONSULTA INVALIDO         *             
302800*                         33 NO ESTA DEFINIDA LA TARIFA         *             
302900*                         40 LLAVE INCOMPLETA O PARCIAL         *             
303000*                            INCORRECTA                         *             
303100*                         90 PROBLEMAS CON LA BASE DE DATOS     *             
303200*                         99 PROBLEMAS CON LA LIBRERIA          *             
303300*                                                               *             
303400*                                                               *             
303500*  CUANDO EL RESULTADO DEL CALL ES = 1 (HAY MAS REGISTROS)      *             
303600*  Y SE DESEA HACER OTRO CALL PARA TRAER LOS REGISTROS          *             
303700*  QUE SIGUEN, ES NECESARIO PLANCHAR LOS CAMPOS DEL ULTIMO      *             
303800*  REGISTRO DE SALIDA RECIBIDO AL REGISTRO DE ENTRADA:          *             
303900*                                                               *             
304000*  WS-S080-0201-NIVEL-S   =  WS-S080-0201-NIVEL                 *             
304100*  WS-S080-0201-FECHA-S   =  WS-S080-0201-FECHCTRL              *             
304200*  WS-S080-0201-HORA-S    =  WS-S080-0201-HORACTRL              *             
304300*                                                               *             
304400*****************************************************************             
304500 01  WS-S080-0201-ENTRADA.                                                    
304600     02 WS-S080-0201-SISTEMA    PIC 9(04)    COMP.                            
304700     02 WS-S080-0201-PASO       PIC 9(04)    COMP.                            
304800     02 WS-S080-0201-FUNCION    PIC 9(02)    COMP.                            
304900     02 WS-S080-0201-OFNA       PIC 9(08)    COMP.                            
305000     02 WS-S080-0201-SECCION    PIC 9(08)    COMP.                            
305100     02 WS-S080-0201-PRODUCTO   PIC 9(04)    COMP.                            
305200     02 WS-S080-0201-INSTRUM    PIC 9(02)    COMP.                            
305300     02 WS-S080-0201-CVTARIF    PIC 9(04)    COMP.                            
305400     02 WS-S080-0201-MONEDA     PIC 9(04)    COMP.                            
305500     02 WS-S080-0201-PERSONA    PIC 9(02)    COMP.                            
305600     02 WS-S080-0201-PLAZO      PIC 9(04)    COMP.                            
305700     02 WS-S080-0201-FECHVIG    PIC 9(06)    COMP.                            
305800     02 WS-S080-0201-HORAVIG    PIC 9(04)    COMP.                            
305900     02 WS-S080-0201-IMPMIN     PIC S9(11)   COMP.                            
306000     02 WS-S080-0201-NUMREGS    PIC 9(02)    COMP.                            
306100     02 WS-S080-0201-NIVEL      PIC 9(02)    COMP.                            
306200     02 WS-S080-0201-FECHCTRL   PIC 9(06)    COMP.                            
306300     02 WS-S080-0201-HORACTRL   PIC 9(04)    COMP.                            
306400     02 FILLER                  PIC X(19).                                    
306500                                                                              
306600 01  WS-S080-0201-SALIDA.                                                     
306700     02 WS-S080-0201-REGS-S           PIC 9(02)    COMP.                      
306800     02 WS-S080-0201-NIVEL-S          PIC 9(02)    COMP.                      
306900     02 WS-S080-0201-FECHA-S          PIC 9(06)    COMP.                      
307000     02 WS-S080-0201-HORA-S           PIC 9(04)    COMP.                      
307100     02 FILLER                        PIC X(23).                              
307200     02 WS-S080-0201-DATOS            OCCURS 10 TIMES.                        
307300        04 WS-S080-0201-OFNA-S        PIC 9(08)    COMP.                      
307400        04 WS-S080-0201-SECC-S        PIC 9(08)    COMP.                      
307500        04 WS-S080-0201-PRODTAR-S     PIC 9(04)    COMP.                      
307600        04 WS-S080-0201-INSTAR-S      PIC 9(02)    COMP.                      
307700        04 WS-S080-0201-CVETAR-S      PIC 9(04)    COMP.                      
307800        04 WS-S080-0201-MONEDA-S      PIC 9(04)    COMP.                      
307900        04 WS-S080-0201-PERS-S        PIC 9(02)    COMP.                      
308000        04 WS-S080-0201-ESCALA-S      PIC 9(02)    COMP.                      
308100        04 WS-S080-0201-FECHVIG-S     PIC 9(06)    COMP.                      
308200        04 WS-S080-0201-HORAVIG-S     PIC 9(04)    COMP.                      
308300        04 WS-S080-0201-CVEIVA-S      PIC 9(04)    COMP.                      
308400        04 WS-S080-0201-PLAZO-S       PIC 9(04)    COMP.                      
308500        04 WS-S080-0201-TASA-S        PIC S9(11)   COMP.                      
308600        04 WS-S080-0201-DCTASA-S      PIC 9(02)    COMP.                      
308700        04 WS-S080-0201-TPTASA-S      PIC X(02).                              
308800        04 WS-S080-0201-LTEINF-S      PIC S9(11)   COMP.                      
308900        04 WS-S080-0201-DECINF-S      PIC 9(02)    COMP.                      
309000        04 WS-S080-0201-TPVAINF-S     PIC X(02).                              
309100        04 WS-S080-0201-LTESUP-S      PIC S9(11)   COMP.                      
309200        04 WS-S080-0201-DECSUP-S      PIC 9(02)    COMP.                      
309300        04 WS-S080-0201-TPVASUP-S     PIC X(02).                              
309400        04 WS-S080-0201-VALADD-S      PIC S9(11)   COMP.                      
309500        04 WS-S080-0201-DECADD-S      PIC 9(02)    COMP.                      
309600        04 WS-S080-0201-TPVAADD-S     PIC X(02).                              
309700        04 WS-S080-0201-IRET-S        PIC S9(11)   COMP.                      
309800        04 WS-S080-0201-DCIRET-S      PIC 9(02)    COMP.                      
309900        04 WS-S080-0201-TPOIRET-S     PIC X(02).                              
310000        04 WS-S080-0201-FECALTA-S     PIC 9(06)    COMP.                      
310100        04 WS-S080-0201-HORALTA-S     PIC 9(04)    COMP.                      
310200        04 WS-S080-0201-FECBAJA-S     PIC 9(06)    COMP.                      
310300        04 WS-S080-0201-HORBAJA-S     PIC 9(04)    COMP.                      
310400        04 WS-S080-0201-FULTMD-S      PIC 9(06)    COMP.                      
310500        04 WS-S080-0201-HULTMD-S      PIC 9(04)    COMP.                      
310600        04 FILLER                     PIC X(34).                              
310700 01  RD-S080-0202-COMISIONES     REDEFINES WS-S080-0201-SALIDA.               
310800     02 FILLER                        PIC X(30).                              
310900     02 WS-S080-0202-COMISGRAL        OCCURS 10 TIMES.                        
311000        04 FILLER                     PIC X(26).                              
311100        04 WS-S080-0202-COMIS         PIC S9(11)   COMP.                      
311200        04 WS-S080-0202-DCCOM         PIC 9(02)    COMP.                      
311300        04 FILLER                     PIC X(02).                              
311400        04 FILLER                     PIC X(85).                              
311500 01  RD-S080-CV15-CVE15          REDEFINES WS-S080-0201-SALIDA.               
311600     02 FILLER                        PIC X(30).                              
311700     02 WS-S080-CV15-COMIS            OCCURS 10 TIMES.                        
311800        04 FILLER                     PIC X(26).                              
311900        04 WS-S080-CV15-COMCHG        PIC S9(11)   COMP.                      
312000        04 WS-S080-CV15-DCCOMI        PIC 9(02)    COMP.                      
312100        04 FILLER                     PIC X(02).                              
312200        04 WS-S080-CV15-SDOCHQEX      PIC S9(11)   COMP.                      
312300        04 WS-S080-CV15-DCSDOCHQEX    PIC 9(02)    COMP.                      
312400        04 FILLER                     PIC X(02).                              
312500        04 WS-S080-CV15-CHQXSDO       PIC S9(11)   COMP.                      
312600        04 FILLER                     PIC 9(02)    COMP.                      
312700        04 FILLER                     PIC X(02).                              
312800        04 WS-S080-CV15-CHQSLIB       PIC S9(11)   COMP.                      
312900        04 FILLER                     PIC 9(02)    COMP.                      
313000        04 FILLER                     PIC X(02).                              
313100        04 WS-S080-CV15-SDOEXENT      PIC S9(11)   COMP.                      
313200        04 WS-S080-CV15-DCSDOEXENT    PIC 9(02)    COMP.                      
313300        04 FILLER                     PIC X(02).                              
313400        04 FILLER                     PIC X(49).                              
313500 01  RD-S080-CV18-CVE18          REDEFINES WS-S080-0201-SALIDA.               
313600     02 FILLER                        PIC X(30).                              
313700     02 WS-S080-CV18-COMIS            OCCURS 10 TIMES.                        
313800        04 FILLER                     PIC X(26).                              
313900        04 WS-S080-CV18-COMIMAN       PIC S9(11)   COMP.                      
314000        04 WS-S080-CV18-DCCOM         PIC 9(02)    COMP.                      
314100        04 FILLER                     PIC X(02).                              
314200        04 WS-S080-CV18-SDOMIN        PIC S9(11)   COMP.                      
314300        04 WS-S080-CV18-DCSDOMIN      PIC 9(02)    COMP.                      
314400        04 FILLER                     PIC X(02).                              
314500        04 FILLER                     PIC X(76).                              
314600 01  RD-S080-CV19-CVE19      REDEFINES WS-S080-0201-SALIDA.                   
314700     02 FILLER                        PIC X(30).                              
314800     02 WS-S080-CV19-COMIS            OCCURS 10 TIMES.                        
314900        04 FILLER                     PIC X(26).                              
315000        04 WS-S080-CV19-CAJERO        PIC S9(11)   COMP.                      
315100        04 WS-S080-CV19-DCCAJERO      PIC 9(02)    COMP.                      
315200        04 FILLER                     PIC X(02).                              
315300        04 WS-S080-CV19-SUCURSAL      PIC S9(11)   COMP.                      
315400        04 WS-S080-CV19-DCSUCURSAL    PIC 9(02)    COMP.                      
315500        04 FILLER                     PIC X(02).                              
315600        04 WS-S080-CV19-SDOEXEN       PIC S9(11)   COMP.                      
315700        04 WS-S080-CV19-DCSDOEXEN     PIC 9(02)    COMP.                      
315800        04 FILLER                     PIC X(02).                              
315900        04 FILLER                     PIC X(67).                              
316000 01  RD-S080-CV23-CVE23          REDEFINES WS-S080-0201-SALIDA.               
316100     02 FILLER                        PIC X(30).                              
316200     02 WS-S080-CV23-COMIS            OCCURS 10 TIMES.                        
316300        04 FILLER                     PIC X(26).                              
316400        04 WS-S080-CV23-SITFIRME      PIC S9(11)   COMP.                      
316500        04 WS-S080-CV23-DCSITFRM      PIC 9(02)    COMP.                      
316600        04 FILLER                     PIC X(02).                              
316700        04 WS-S080-CV23-SIT48HRS      PIC S9(11)   COMP.                      
316800        04 WS-S080-CV23-DCSIT48H      PIC 9(02)    COMP.                      
316900        04 FILLER                     PIC X(02).                              
317000        04 FILLER                     PIC X(76).                              
317100 01  RD-S080-CV30-CVE30          REDEFINES WS-S080-0201-SALIDA.               
317200     02 FILLER                        PIC X(30).                              
317300     02 WS-S080-CV30-COMIS            OCCURS 10 TIMES.                        
317400        04 FILLER                     PIC X(26).                              
317500        04 WS-S080-CV30-ECTAVENT      PIC S9(11)   COMP.                      
317600        04 WS-S080-CV30-DCECVENT      PIC 9(02)    COMP.                      
317700        04 FILLER                     PIC X(02).                              
317800        04 WS-S080-CV30-EXENTOS       PIC S9(11)   COMP.                      
317900        04 FILLER                     PIC 9(02)    COMP.                      
318000        04 FILLER                     PIC X(02).                              
318100        04 FILLER                     PIC X(76).                              
318200 01  RD-S080-CV40-CVE40          REDEFINES WS-S080-0201-SALIDA.               
318300     02 FILLER                        PIC X(30).                              
318400     02 WS-S080-CV40-COMIS            OCCURS 10 TIMES.                        
318500        04 FILLER                     PIC X(26).                              
318600        04 WS-S080-CV40-COPIAECTA     PIC S9(11)   COMP.                      
318700        04 WS-S080-CV40-DCCOPECTA     PIC 9(02)    COMP.                      
318800        04 FILLER                     PIC X(02).                              
318900        04 WS-S080-CV40-COPIAOTROS    PIC S9(11)   COMP.                      
319000        04 WS-S080-CV40-DCCOPOTROS    PIC 9(02)    COMP.                      
319100        04 FILLER                     PIC X(02).                              
319200        04 FILLER                     PIC X(76).                              
319300 01  RD-S080-CV42-CVE42          REDEFINES WS-S080-0201-SALIDA.               
319400     02 FILLER                        PIC X(30).                              
319500     02 WS-S080-CV42-COMIS            OCCURS 10 TIMES.                        
319600        04 FILLER                     PIC X(26).                              
319700        04 WS-S080-CV42-REPTROBO      PIC S9(11)   COMP.                      
319800        04 WS-S080-CV42-DCREPTROBO    PIC 9(02)    COMP.                      
319900        04 FILLER                     PIC X(02).                              
320000        04 WS-S080-CV42-REPTADIC      PIC S9(11)   COMP.                      
320100        04 WS-S080-CV42-DCREPTADIC    PIC 9(02)    COMP.                      
320200        04 FILLER                     PIC X(02).                              
320300        04 WS-S080-CV42-REPTVTO       PIC S9(11)   COMP.                      
320400        04 WS-S080-CV42-DCREPTVTO     PIC 9(02)    COMP.                      
320500        04 FILLER                     PIC X(02).                              
320600        04 FILLER                     PIC X(67).                              
320700 01  RD-S080-CV43-CVE43          REDEFINES WS-S080-0201-SALIDA.               
320800     02 FILLER                        PIC X(30).                              
320900     02 WS-S080-CV43-COMIS            OCCURS 10 TIMES.                        
321000        04 FILLER                     PIC X(26).                              
321100        04 WS-S080-CV43-ACLARAC       PIC S9(11)   COMP.                      
321200        04 WS-S080-CV43-DCCOMIS       PIC 9(02)    COMP.                      
321300        04 FILLER                     PIC X(02).                              
321400        04 WS-S080-CV43-LIBRES        PIC S9(11)   COMP.                      
321500        04 FILLER                     PIC 9(02)    COMP.                      
321600        04 FILLER                     PIC X(02).                              
321700        04 FILLER                     PIC X(76).                              
321800 01  RD-S080-CV45-CVE45          REDEFINES WS-S080-0201-SALIDA.               
321900     02 FILLER                        PIC X(30).                              
322000     02 WS-S080-CV45-COMIS            OCCURS 10 TIMES.                        
322100        04 FILLER                     PIC X(26).                              
322200        04 WS-S080-CV45-CONSDO        PIC S9(11)   COMP.                      
322300        04 WS-S080-CV45-DCONSDO       PIC 9(02)    COMP.                      
322400        04 FILLER                     PIC X(02).                              
322500        04 WS-S080-CV45-SDOCONSUL     PIC S9(11)   COMP.                      
322600        04 WS-S080-CV45-DCSDOCONSUL   PIC 9(02)    COMP.                      
322700        04 FILLER                     PIC X(02).                              
322800        04 WS-S080-CV45-CONSXSDO      PIC S9(11)   COMP.                      
322900        04 FILLER                     PIC 9(02)    COMP.                      
323000        04 FILLER                     PIC X(02).                              
323100        04 WS-S080-CV45-CONSULIB      PIC S9(11)   COMP.                      
323200        04 FILLER                     PIC 9(02)    COMP.                      
323300        04 FILLER                     PIC X(02).                              
323400        04 FILLER                     PIC X(58).                              
323500 01  RD-S080-COMI-RED            REDEFINES WS-S080-0201-SALIDA.               
323600     02 FILLER                        PIC X(30).                              
323700     02 WS-S080-RED-COMIS             OCCURS 10 TIMES.                        
323800        04 FILLER                     PIC X(26).                              
323900        04 WS-S080-RED-COMRET         PIC S9(11)   COMP.                      
324000        04 WS-S080-RED-DCRET          PIC 9(02)    COMP.                      
324100        04 FILLER                     PIC X(02).                              
324200        04 WS-S080-RED-COMCONS        PIC S9(11)   COMP.                      
324300        04 WS-S080-RED-DCONS          PIC 9(02)    COMP.                      
324400        04 FILLER                     PIC X(02).                              
324500        04 WS-S080-RED-RETLIBRES      PIC S9(11)   COMP.                      
324600        04 FILLER                     PIC 9(02)    COMP.                      
324700        04 FILLER                     PIC X(02).                              
324800        04 WS-S080-RED-CONLIBRES      PIC S9(11)   COMP.                      
324900        04 FILLER                     PIC 9(02)    COMP.                      
325000        04 FILLER                     PIC X(02).                              
325100        04 FILLER                     PIC X(58).                              
325200 01  RD-S080-CV39-CVE39          REDEFINES WS-S080-0201-SALIDA.               
325300     02 FILLER                        PIC X(30).                              
325400     02 WS-S080-CV39-COMIS            OCCURS 10 TIMES.                        
325500        04 FILLER                     PIC X(26).                              
325600        04 WS-S080-CV39-ECTACAJACT    PIC S9(11)   COMP.                      
325700        04 WS-S080-CV39-DCTACAJACT    PIC 9(02)    COMP.                      
325800        04 FILLER                     PIC X(02).                              
325900        04 WS-S080-CV39-ECTACAJANT    PIC S9(11)   COMP.                      
326000        04 WS-S080-CV39-DCTACAJANT    PIC 9(02)    COMP.                      
326100        04 FILLER                     PIC X(02).                              
326200        04 WS-S080-CV39-EXTCAJACT     PIC S9(11)   COMP.                      
326300        04 FILLER                     PIC 9(02)    COMP.                      
326400        04 FILLER                     PIC X(02).                              
326500        04 WS-S080-CV39-EXTCAJANT     PIC S9(11)   COMP.                      
326600        04 FILLER                     PIC 9(02)    COMP.                      
326700        04 FILLER                     PIC X(02).                              
326800        04 FILLER                     PIC X(58).                              
326900 01  RD-S080-CV38-CVE38          REDEFINES WS-S080-0201-SALIDA.               
327000     02 FILLER                        PIC X(30).                              
327100     02 WS-S080-CV38-COMIS            OCCURS 10 TIMES.                        
327200        04 FILLER                     PIC X(26).                              
327300        04 WS-S080-CV38-CPRVSUC-1     PIC S9(11)   COMP.                      
327400        04 WS-S080-CV38-DPRVSUC-1     PIC 9(02)    COMP.                      
327500        04 FILLER                     PIC X(02).                              
327600        04 WS-S080-CV38-CPRVBCE-1     PIC S9(11)   COMP.                      
327700        04 WS-S080-CV38-DPRVBCE-1     PIC 9(02)    COMP.                      
327800        04 FILLER                     PIC X(02).                              
327900        04 WS-S080-CV38-CPRVSUC-2     PIC S9(11)   COMP.                      
328000        04 WS-S080-CV38-DPRVSUC-2     PIC 9(02)    COMP.                      
328100        04 FILLER                     PIC X(02).                              
328200        04 WS-S080-CV38-CPRVBCE-2     PIC S9(11)   COMP.                      
328300        04 WS-S080-CV38-DPRVBCE-2     PIC 9(02)    COMP.                      
328400        04 FILLER                     PIC X(02).                              
328500        04 FILLER                     PIC X(58).                              
328600 01  RD-S080-POR-CAMPOS          REDEFINES WS-S080-0201-SALIDA.               
328700     02 FILLER                        PIC X(30).                              
328800     02 WS-S080-CAMPO-COMIS           OCCURS 10 TIMES.                        
328805*ESS INI INTEGRA FEC VIG TASAS CETES 20200527                                 
328900**      04 FILLER                     PIC X(26).                              
328905        04 FILLER                     PIC X(17).                              
328910        04 WS-S080-FEC-VIGENCIA       PIC 9(06)    COMP.                      
328915        04 FILLER                     PIC X(06).                              
328920*ESS FIN INTEGRA FEC VIG TASAS CETES 20200527                                 
329000        04 WS-S080-ENT-CAMPO-01       PIC S9(11)   COMP.                      
329100        04 WS-S080-DEC-CAMPO-01       PIC 9(02)    COMP.                      
329200        04 FILLER                     PIC X(02).                              
329300        04 WS-S080-ENT-CAMPO-02       PIC S9(11)   COMP.                      
329400        04 WS-S080-DEC-CAMPO-02       PIC 9(02)    COMP.                      
329500        04 FILLER                     PIC X(02).                              
329600        04 WS-S080-ENT-CAMPO-03       PIC S9(11)   COMP.                      
329700        04 WS-S080-DEC-CAMPO-03       PIC 9(02)    COMP.                      
329800        04 FILLER                     PIC X(02).                              
329900        04 WS-S080-ENT-CAMPO-04       PIC S9(11)   COMP.                      
330000        04 WS-S080-DEC-CAMPO-04       PIC 9(02)    COMP.                      
330100        04 FILLER                     PIC X(02).                              
330200        04 WS-S080-ENT-CAMPO-05       PIC S9(11)   COMP.                      
330300        04 WS-S080-DEC-CAMPO-05       PIC 9(02)    COMP.                      
330400        04 FILLER                     PIC X(02).                              
330500        04 FILLER                     PIC X(49).                              
330600                                                                              
330700 77  WS-S080-0201-RESULT            PIC S9(11)   BINARY.                      
330800                                                                              
330900$POP OMIT                                                                     
331000$SET OMIT = NOT S080CATALOGOS                                                 
331100****************************************************************              
331200**                                                                            
331300**          CAMPOS PARA CONSULTA DEL CATALOGO 68       ******                 
331400**          CALIFICACION DE REGION POR SUCURSAL        ******                 
331500*************************************************************                 
331600 77  W77-L710-SISTEMA    PIC S9(11) BINARY.                                   
331700 77  W77-L710-PROGRAMA   PIC S9(11) BINARY.                                   
331800 77  W77-L710-RESULT     PIC S9(11) BINARY.                                   
331900 77  W77-L710-IND        PIC  9(04) BINARY.                                   
332000 77  W77-L710-SUC        PIC  9(04) COMP.                                     
332100 77  W77-FIN-L710        PIC  9(02) COMP.                                     
332200 77  W77-L710-REGION     PIC  9(02) COMP.                                     
332300 77  W77-INDCAT-L710     PIC  9(04) COMP.                                     
332400                                                                              
332500 01  WKS-L710-PARAM-ENT.                                                      
332600     02 WKS-L710-CATALOGO-E   PIC 9(06)   COMP.                               
332700     02 WKS-L710-CLAVE-E      PIC 9(02)   COMP.                               
332800     02 WKS-L710-ORDBUSQ-E    PIC 9(02)   COMP.                               
332900     02 WKS-L710-REGS-E       PIC 9(02)   COMP.                               
333000     02 WKS-L710-LLAVE1-E     PIC 9(12).                                      
333100     02 WKS-L710-LLAVE2-E     PIC 9(12).                                      
333200     02 WKS-L710-LLAVE3-E     PIC 9(12).                                      
333300     02 WKS-L710-LLAVE4-E     PIC 9(12).                                      
333400     02 WKS-L710-LLAVE5-E     PIC 9(12).                                      
333500     02 WKS-L710-LLAVE6-E     PIC 9(12).                                      
333600     02 WKS-L710-FVIG-E       PIC 9(06)    COMP.                              
333700     02 WKS-L710-FINI-CON-E   PIC 9(06)    COMP.                              
333800     02 WKS-L710-NIVEL-E      PIC 9(02)    COMP.                              
333900     02 FILLER                PIC X(11).                                      
334000                                                                              
334100 01  WKS-L710-PARAM-SAL.                                                      
334200     02 WKS-L710-REGS-S       PIC 9(02)   COMP.                               
334300     02 WKS-L710-CATALOGO-S   PIC 9(06)   COMP.                               
334400     02 WKS-L710-FINI-CON-S   PIC 9(06)   COMP.                               
334500     02 WKS-L710-NIVEL-S      PIC 9(02)   COMP.                               
334600     02 FILLER                PIC X(22).                                      
334700     02 WKS-L710-REGISTRO     OCCURS 10 TIMES.                                
334800        04 WKS-L710-DATOS     PIC 9(12) OCCURS 28 TIMES.                      
334900        04 WKS-L710-FALT-S    PIC 9(06) COMP.                                 
335000        04 WKS-L710-FBAJ-S    PIC 9(06) COMP.                                 
335100        04 WKS-L710-FULT-S    PIC 9(06) COMP.                                 
335200        04 WKS-L710-FVIG-S    PIC 9(06) COMP.                                 
335300        04 FILLER             PIC X(42).                                      
335400                                                                              
335500*************************************************************                 
335600**                                                                            
335700**      CAMPOS PARA CONSULTA DEL CATALOGO 916          ******                 
335800**      CALIFICACION DE SUCURSALES FACULTADAS X ADMWIN ******                 
335900*************************************************************                 
336000 77  W77-L710-SISTEMA-SIGLAS      PIC  X(04).                                 
336100     88 W77-L710-SISTEMA-S000     VALUE "S000".                               
336200     88 W77-L710-SISTEMA-S500     VALUE "S500".                               
336300                                                                              
336400 01  WKS-L710-CD-PARAM-ENT.                                                   
336500     02 WKS-L710-CD-CATALOGO-E    PIC 9(06)   COMP.                           
336600     02 WKS-L710-CD-CLAVE-E       PIC 9(02)   COMP.                           
336700     02 WKS-L710-CD-ORDBUSQ-E     PIC 9(02)   COMP.                           
336800     02 WKS-L710-CD-REGS-E        PIC 9(02)   COMP.                           
336900     02 WKS-L710-CD-LLAVE1-E      PIC X(12).                                  
337000     02 WKS-L710-CD-LLAVE2-E      PIC X(12).                                  
337100     02 WKS-L710-CD-LLAVE3-E      PIC X(12).                                  
337200     02 WKS-L710-CD-LLAVE4-E      PIC X(12).                                  
337300     02 WKS-L710-CD-LLAVE5-E      PIC X(12).                                  
337400     02 WKS-L710-CD-LLAVE6-E      PIC X(12).                                  
337500     02 WKS-L710-CD-FVIG-E        PIC 9(06)    COMP.                          
337600     02 WKS-L710-CD-FINI-CON-E    PIC 9(06)    COMP.                          
337700     02 WKS-L710-CD-NIVEL-E       PIC 9(02)    COMP.                          
337800     02 FILLER                    PIC X(11).                                  
337900                                                                              
338000 01  WKS-L710-CD-PARAM-SAL.                                                   
338100     02 WKS-L710-CD-REGS-S        PIC 9(02)   COMP.                           
338200     02 WKS-L710-CD-CATALOGO-S    PIC 9(06)   COMP.                           
338300     02 WKS-L710-CD-FINI-CON-S    PIC 9(06)   COMP.                           
338400     02 WKS-L710-CD-NIVEL-S       PIC 9(02)   COMP.                           
338500     02 FILLER                    PIC X(22).                                  
338600     02 WKS-L710-CD-REGISTRO     OCCURS 10 TIMES.                             
338700        04 WKS-L710-CD-DATOS      PIC X(12) OCCURS 28 TIMES.                  
338800        04 WKS-L710-CD-DATOS-I REDEFINES                                      
338900           WKS-L710-CD-DATOS      PIC 9(12) OCCURS 28 TIMES.                  
339000        04 WKS-L710-CD-FALT-S     PIC 9(06) COMP.                             
339100        04 WKS-L710-CD-FBAJ-S     PIC 9(06) COMP.                             
339200        04 WKS-L710-CD-FULT-S     PIC 9(06) COMP.                             
339300        04 WKS-L710-CD-FVIG-S     PIC 9(06) COMP.                             
339400        04 FILLER                 PIC X(42).                                  
339500                                                                              
339600                                                                              
339700*************************************************************                 
339800**      CAMPOS PARA CONSULTA DEL CATALOGO 198          ******                 
339900**      BINES VALIDOS PARA TRANSFER                    ******                 
340000*************************************************************                 
340100 01  WKS-L710-BT-PARAM-ENT.                                                   
340200     02 WKS-L710-BT-CATALOGO-E    PIC 9(06) COMP.                             
340300     02 WKS-L710-BT-CLAVE-E       PIC 9(02) COMP.                             
340400     02 WKS-L710-BT-ORDBUSQ-E     PIC 9(02) COMP.                             
340500     02 WKS-L710-BT-REGS-E        PIC 9(02) COMP.                             
340600     02 WKS-L710-BT-LLAVE1-E      PIC X(12).                                  
340700     02 WKS-L710-BT-LLAVE2-E      PIC X(12).                                  
340800     02 WKS-L710-BT-LLAVE3-E      PIC X(12).                                  
340900     02 WKS-L710-BT-LLAVE4-E      PIC X(12).                                  
341000     02 WKS-L710-BT-LLAVE5-E      PIC X(12).                                  
341100     02 WKS-L710-BT-LLAVE6-E      PIC X(12).                                  
341200     02 WKS-L710-BT-FVIG-E        PIC 9(06) COMP.                             
341300     02 WKS-L710-BT-FINI-CON-E    PIC 9(06) COMP.                             
341400     02 WKS-L710-BT-NIVEL-E       PIC 9(02) COMP.                             
341500     02 FILLER                    PIC X(11).                                  
341600                                                                              
341700 01  WKS-L710-BT-PARAM-SAL.                                                   
341800     02 WKS-L710-BT-REGS-S        PIC 9(02) COMP.                             
341900     02 WKS-L710-BT-CATALOGO-S    PIC 9(06) COMP.                             
342000     02 WKS-L710-BT-FINI-CON-S    PIC 9(06) COMP.                             
342100     02 WKS-L710-BT-NIVEL-S       PIC 9(02) COMP.                             
342200     02 FILLER                    PIC X(22).                                  
342300     02 WKS-L710-BT-REGISTRO     OCCURS 10 TIMES.                             
342400        04 WKS-L710-BT-DATOS1     PIC X(12).                                  
342500        04 WKS-L710-BT-DATOS1-I REDEFINES                                     
342600           WKS-L710-BT-DATOS1     PIC 9(12).                                  
342700        04 WKS-L710-BT-DATOS2     PIC X(12).                                  
342800        04 WKS-L710-BT-DATOS2-I REDEFINES                                     
342900           WKS-L710-BT-DATOS2     PIC 9(12).                                  
343000        04 WKS-L710-BT-DATOS3     PIC X(12).                                  
343100        04 WKS-L710-BT-DATOS3-I REDEFINES                                     
343200           WKS-L710-BT-DATOS3     PIC 9(12).                                  
343300        04 WKS-L710-BT-DATOS4     PIC X(12).                                  
343400        04 WKS-L710-BT-DATOS4-I REDEFINES                                     
343500           WKS-L710-BT-DATOS4     PIC 9(12).                                  
343600        04 WKS-L710-BT-DATOS5     PIC X(12).                                  
343700        04 WKS-L710-BT-DATOS5-I REDEFINES                                     
343800           WKS-L710-BT-DATOS5     PIC 9(12).                                  
343900        04 WKS-L710-BT-DATOS6     PIC X(12).                                  
344000        04 WKS-L710-BT-DATOS6-I REDEFINES                                     
344100           WKS-L710-BT-DATOS6     PIC 9(12).                                  
344200        04 WKS-L710-BT-FALT-S     PIC 9(06) COMP.                             
344300        04 WKS-L710-BT-FBAJ-S     PIC 9(06) COMP.                             
344400        04 WKS-L710-BT-FULT-S     PIC 9(06) COMP.                             
344500        04 WKS-L710-BT-FVIG-S     PIC 9(06) COMP.                             
344600        04 WKS-L710-BT-LEYENDA    PIC X(300).                                 
344700        04 FILLER                 PIC X(69).                                  
344800                                                                              
344900                                                                              
345000                                                                              
345100                                                                              
345200                                                                              
345300                                                                              
345400                                                                              
345500$POP OMIT                                                                     
345600$SET OMIT = NOT S100L012                                                      
345700***************************************************************               
345800*   PARAMETROS DE LA LIBRERIA S100L012                        *               
345900*   PARA MANEJO DE ASINCRONO PARA ELIMINACIONES               *               
346000***************************************************************               
346100 77  W77-S100-L012-FOLIO      PIC S9(11)     BINARY.                          
346200 77  W77-S100-L012-MAX-SZ     PIC S9(11)     BINARY.                          
346300 77  W77-S100-L012-MSG-SZ     PIC S9(11)     BINARY.                          
346400 77  W77-S100-L012-ESTADO     PIC S9(11)     BINARY.                          
346500 77  W77-S100-L012-RESULT     PIC S9(11)     BINARY.                          
346600 77  W77-S100-L012-TIEMPO-VIG PIC S9(11)     BINARY.                          
346700                                                                              
346800 01  WKS-S100-L012-MENSAJE    PIC X(1920).                                    
346900 01  WKS-S100-L012-MENSAJE-R REDEFINES WKS-S100-L012-MENSAJE.                 
347000     03 FILLER                PIC X(66).                                      
347100     03 WKS-S100-L012-MSGDIR  PIC 9(01).                                      
347200     03 FILLER                PIC X(1853).                                    
347300                                                                              
347400$POP OMIT                                                                     
347500$SET OMIT = NOT S500L093                                                      
347600***************************************************************               
347700*   PARAMETROS DE LA LIBRERIA S500L093                        *               
347800*   PARA MANEJO DE ASINCRONO-FRAUD-MGR PARA ELIMINACIONES     *               
347900***************************************************************               
348000 77  W77-S500-L093-FOLIO      PIC S9(11)     BINARY.                          
348100 77  W77-S500-L093-MAX-SZ     PIC S9(11)     BINARY.                          
348200 77  W77-S500-L093-MSG-SZ     PIC S9(11)     BINARY.                          
348300 77  W77-S500-L093-ESTADO     PIC S9(11)     BINARY.                          
348400 77  W77-S500-L093-RESULT     PIC S9(11)     BINARY.                          
348500 77  W77-S500-L093-TIEMPO-VIG PIC S9(11)     BINARY.                          
348600                                                                              
348700 01  WKS-S500-L093-MENSAJE    PIC X(1920).                                    
348800 01  WKS-S500-L093-MENSAJE-R REDEFINES WKS-S500-L093-MENSAJE.                 
348900     03 FILLER                PIC X(36).                                      
349000     03 WKS-S500-L093-TCDEST  PIC 9(06).                                      
349100     03 WKS-S500-L093-TCORIG  PIC 9(06).                                      
349200     03 FILLER                PIC X(18).                                      
349300     03 WKS-S500-L093-MSGDIR  PIC 9(01).                                      
349400     03 FILLER                PIC X(1853).                                    
349500                                                                              
349600$POP OMIT                                                                     
349700$SET OMIT = NOT S100VERSIONES                                                 
349800*****************************************************************             
349900*                                                               *             
350000*       PARAMETROS PARA LA LIBRERIA DE CONTROL DE VERSIONES     *             
350100*                                                               *             
350200*****************************************************************             
350300 77  WKS-88-CTLVERS        PIC 99      COMP  VALUE 0.                         
350400 77  W77-S000-MY-ID        PIC X(12).                                         
350500 77  W77-S000-MY-VERSION   PIC X(08).                                         
350600 01  S000-CTR-LIBID     PIC X(12).                                            
350700 01  S000-CTR-NOMLIB    PIC X(72).                                            
350800 01  S000-CTR-CVEERROR  PIC S9(11)  BINARY.                                   
350900*****************************************************************             
351000$POP OMIT                                                                     
351100$SET OMIT = NOT S100LIBPRINTER                                                
351200*****************************************************************             
351300*             LIBRERIA  S100LIBPRINTER                          *             
351400*             "LIB-PRINTER" TO BYFUNCTION.                      *             
351500*                                                               *             
351600* PARAMETROS DE ENTRADA PARA ENTRY POINT: DAME_IMPRESORA        *             
351700*                                                               *             
351800* FIJOS POR INCLUDE:                                            *             
351900*   WS-S100-0101-STANAME-ID = WS-HDR-STATION (HEADER DIALOGO)   *             
352000*                                                               *             
352100*****************************************************************             
352200                                                                              
352300 01 WS-S100-0101-STANAME-ID        PIC X(08).                                 
352400 77 WS-S100-0101-RESULT-STA        PIC S9(11)  BINARY.                        
352500 77 WKS-88-ESTACIONES              PIC 99      COMP VALUE 0.                  
352600****************************************************************              
352700$POP OMIT                                                                     
352800$SET OMIT = NOT S127L010                                                      
352900*****************************************************************             
353000*                                                               *             
353100*   PARAMETRO PARA LA LIBRERIA L010 DEL S127 PARA CONSULTA DEL  *             
353200*   STATUS DE UN CHEQUE DEL MEDIO DE ACCESO                     *             
353300*   Y SABER SI LA CUENTA ESTA EN OBSERVACION POR FRAUDE O NO.   *             
353400*                                                               *             
353500*****************************************************************             
353600*                                                                             
353700**** PARAMETRO DE ENTRADA L010 ENTRY POINT: S127L010CONCHEQ  ****             
353800*                                                               *             
353900*    WS-S127-0101-NUMSIST-I    = NUMERO DE SISTEMA LLAMADOR     *             
354000*    WS-S127-0101-NUMPASO-I    = NUMERO DE PROGRAMA LLAMADOR    *             
354100*    WS-S127-0101-NUMPREF-I    = NUMERO DE SUCURSAL MED/ACCESO  *             
354200*    WS-S127-0101-NUMCTA-I     = NUMERO DE CUENTA Y DIGITO      *             
354300*    WS-S127-0101-NUMCHEQUE-I  = NUMERO DE CHEQUE A CONSULTAR   *             
354400*    WS-S127-0101-IMPORTE-I    = IMPORTE DEL CHEQUE             *             
354500*    WS-S127-0101-SUCMOV-I     = SUCURSAL QUE OPERA             *             
354600*    WS-S127-0101-NOMIMOV-I    = NOMINA QUE OPERA               *             
354700*    WS-S127-0101-CAJMOV-I     = CAJA QUE OPERA                 *             
354800*    WS-S127-0101-INDVAL-CHVV-I = 1 VALIDACION DIGITOS CHVV     *             
354900*                                 9 SIN VALIDACION DIGITOS CHVV *             
355000*    WS-S127-0101-DIGITOCHVV   = LOS TRES DIGITOS DEL CHVV      *             
355100*    WS-S127-0101-BANCO        = BANCO (NO LO USAMOS)           *             
355200*    WS-S127-0101-INDVALCBOLT  = 0  SIN VALIDACION POR CRITERIOS*             
355300*                                1  VALIDACION CON CHECKBOLT    *             
355400*                                2  VALIDACION SIN CHECKBOLT    *             
355500*                                3  SIN VALID FOLIO CHECKBOLT   *             
355600*                                10 SOLICITUD DEL CHECKBOLT(S711*             
355700*    WS-S127-0101-CHECKBOLT    = FOLIO DE CHECKBOLT ALFANUMERICO*             
355800*    WS-S127-0101-STALERTA     = STATUS DE ALERTA               *             
355900*                                00  SIN ALERTA                 *             
356000*                                01  IN PROGRESS                *             
356100*                                02  RETURN                     *             
356200*                                03  PAY                        *             
356300*                                04  PAGADO SIN ALERTA(Return   *             
356400*                                05  PAGO FORZADO(TimeOut)      *             
356500*                                06  PAGUESE CON ALERTA         *             
356600*                                07  PAGO CON FRAUDE            *             
356700*                                08  CALL                       *             
356800*                                                               *             
356900*****************************************************************             
357000                                                                              
357100 01  WS-S127-0101-CTR-ENTRADA.                                                
357200     02 WS-S127-0101-NUMSIST-I             PIC 9(04)      COMP.               
357300     02 WS-S127-0101-NUMPASO-I             PIC 9(04)      COMP.               
357400     02 WS-S127-0101-NUMPREF-I             PIC 9(04)      COMP.               
357500     02 WS-S127-0101-NUMCTA-I              PIC 9(12)      COMP.               
357600     02 WS-S127-0101-NUMCHEQUE-I           PIC 9(08)      COMP.               
357700     02 WS-S127-0101-IMPORTE-I             PIC 9(14)V99   COMP.               
357800     02 WS-S127-0101-SUCMOV-I              PIC 9(04)      COMP.               
357900     02 WS-S127-0101-NOMIMOV-I             PIC 9(10)      COMP.               
358000     02 WS-S127-0101-CAJMOV-I              PIC 9(02)      COMP.               
358100     02 WS-S127-0101-INDVAL-CHVV-I         PIC 9(01)      COMP.               
358200     02 WS-S127-0101-DIGITOCHVV            PIC 9(03)      COMP.               
358300     02 WS-S127-0101-BANCO                 PIC 9(03)      COMP.               
358400     02 WS-S127-0101-INDVALCBOLT-I         PIC 9(03)      COMP.               
358500     02 WS-S127-0101-CHECKBOLT-I           PIC X(09).                         
358600     02 WS-S127-0101-STALERTA-I            PIC 9(02)      COMP.               
358700     02 WS-S127-0101-VALCHQSALT-TRAD-I     PIC 9(01)      COMP.               
358800* 0 - NO VALIDA CHEQUE SALTADO TRADICIONAL                                    
358900* 1 -    VALIDA CHEQUE SALTADO TRADICIONAL                                    
359000* 2 -    FORZA  CHEQUE SALTADO TRADICIONAL                                    
359100     02 WS-S127-0101-VALCHQSALT-CRED-I     PIC 9(01)      COMP.               
359200* 0 - NO VALIDA CHEQUE SALTADO CREDICHEQUE                                    
359300* 1 -    VALIDA CHEQUE SALTADO CREDICHEQUE                                    
359400* 2 -    FORZA  CHEQUE SALTADO CREDICHEQUE                                    
359500     02 FILLER                             PIC X(311).                        
359600                                                                              
359700**** PARAMETRO DE SALIDA  L010 ENTRY POINT: S127L010CONCHEQ  ****             
359800*                                                                             
359900*    WS-S127-0101-NUMSIST    = NUMERO DE SISTEMA                              
360000*    WS-S127-0101-NUMPASO    = NUMERO DE PASO                                 
360100*    WS-S127-0101-NUMPREF    = NUMERO DE SUCURSAL MED/ACCESO                  
360200*    WS-S127-0101-NUMCTA     = NUMERO CUENTA Y DIGITO                         
360300*    WS-S127-0101-NUMCHEQUE  = NUMERO DEL CHEQUE                              
360400*    WS-S127-0101-STATUSCHEQ: 00 = NO EXISTE EL CHEQUE                        
360500*                             01 = LIBERADO NO COBRADO                        
360600*                             02 = PROTEGIDO                                  
360700*                             03 = CANCELADO                                  
360800*                             04 = PREVENIDO                                  
360900*                             05 = CERTIFICADO                                
361000*                             06 = PROTEGIDO CON IMPORTE                      
361100*                             07 = REBOCADO                                   
361200*                             08 = NO LIBERADO (SI EXISTE)                    
361300*                             09 = PAGADO                                     
361400*    WS-S127-0101-LIMITE     = IMPORTE LIMITE PERMITIDO POR                   
361500*                              EL CHEQUE O LA CUENTA                          
361600*          SI STATUS CHECHE = 6    ES LIMITE POR CHEQUE                       
361700*          SI STATUS CHECHE = OTRO ES LIMITE POR CUENTA                       
361800*    WS-S127-0101-INDSEGLOG                                                   
361900*    WS-S127-0101-CVEOBS :    01 = CTA SIN CVE DE OBSERVACION                 
362000*                             02 = CTA CON CVE DE OBSERVACION                 
362100*    WS-S127-0101-FECALTOBS   FECHA EN QUE INICIA LA OBSERVACION              
362200*    WS-S127-0101-RESVALCHVV :                                                
362300*                01 = SIN INSUMOS VALIDACION CHVV                             
362400*                02 = CON VALIDACION CON CHVV CORRECTO                        
362500*                91 = CON VALIDACION CON CHVV INCORRECTO                      
362600*    WS-S127-0101-RESVALCBOLT :                                               
362700*                01 = CON VALIDACION, CHECKBOLT CORRECTO O                    
362800*                     CUANDO ES FORZADO O CONTINGENCIA                        
362900*                02 = CON VALIDACION, CHECKBOLT INCORRECTO                    
363000*                03 = CON VALIDACION, CHECKBOLT NO PROPORCIONADO              
363100*                04 = CON VALIDACION, CHEQUE SIN CHECKBOLT                    
363200*                05 = CON VALIDACION, CHEQUE CON CHECKBOLT NO                 
363300*                     DISPONIBLE                                              
363400*    WS-S127-0101-CHECKBOLT   : FOLIO DE CHECKBOLT (S711)                     
363500*                                                                             
363600*    WS-S127-0101-PROTECCION  :                                               
363700*                00 = DESPROTEGIDO                                            
363800*                01 = DESPROTEGIDO                                            
363900*                02 = PROTEGIDO POR PRECAMARA                                 
364000*                03 = FIRMA VARIADA                                           
364100*                                                                             
364200*    WS-S127-0101-MDASUBTIPO                                                  
364300*    WS-S127-0101-IMAGEN                                                      
364400*    WS-S127-0101-BENEFICIARIO                                                
364500*    WS-S127-0101-STALERTA                                                    
364600*                                                                             
364700*    WS-S127-RESULT: 00 = CONSULTA OK                                         
364800*                    02 = OPCION INVALIDA                                     
364900*                    03 = REGISTRO DE SALIDA INSUFICIENTE                     
365000*                    04 = PARAMETRO INVALIDO                                  
365100*                    10 = NO EXISTE CHEQUERA (NOT FOUND)                      
365200*                    13 = NUMERO DE CHEQUE FUERA DE RANGO                     
365300*                 88-99 = PROBLEMAS EN LA BASE                                
365400*                                                                             
365500****************************************************************              
365600                                                                              
365700 01  WS-S127-0101-CTR-SALIDA.                                                 
365800     02 WS-S127-0101-NUMSIST               PIC 9(04)      COMP.               
365900     02 WS-S127-0101-NUMPASO               PIC 9(04)      COMP.               
366000     02 WS-S127-0101-NUMPREF               PIC 9(04)      COMP.               
366100     02 WS-S127-0101-NUMCTA                PIC 9(12)      COMP.               
366200     02 WS-S127-0101-NUMCHEQUE             PIC 9(08)      COMP.               
366300     02 WS-S127-0101-STATUSCHEQ            PIC 9(02)      COMP.               
366400     02 WS-S127-0101-LIMITE                PIC 9(12)V99   COMP.               
366500     02 WS-S127-0101-INDSEGLOG             PIC 9(02)      COMP.               
366600        88 WS-S127-88-NSL-NOVAL            VALUE  0.                          
366700        88 WS-S127-88-NSL-PAG              VALUE  1.                          
366800        88 WS-S127-88-NSL-PAGINEX          VALUE  2.                          
366900        88 WS-S127-88-NSL-PAGINEXNOLIB     VALUE  3.                          
367000        88 WS-S127-88-NSL-INEX             VALUE  4.                          
367100     02 WS-S127-0101-CVEOBS                PIC 9(02)      COMP.               
367200     02 WS-S127-0101-FECALTOBS             PIC 9(08)      COMP.               
367300     02 WS-S127-0101-RESVALCHVV            PIC 9(02)      COMP.               
367400     02 WS-S127-0101-RESVALCBOLT           PIC 9(02)      COMP.               
367500     02 WS-S127-0101-CHECKBOLT             PIC X(09).                         
367600     02 WS-S127-0101-PROTECCION            PIC 9(02)      COMP.               
367700     02 WS-S127-0101-MDASUBTIPO            PIC 9(02)      COMP.               
367800     02 WS-S127-0101-IMAGEN                PIC 9(02)      COMP.               
367900     02 WS-S127-0101-BENEFICIARIO          PIC X(55).                         
368000     02 WS-S127-0101-STALERTA              PIC 9(02)      COMP.               
368100     02 WS-S127-0101-CHQ-IMP               PIC 9(12)V99   COMP.               
368200*INI FSW                  P07-120 REQ3                    ABARBOSA            
368300     02 WS-S127-0101-CHQ-INDCRED           PIC 9(02)      COMP.               
368400*FIN FSW                  P07-120 REQ3                    ABARBOSA            
368500     02 WS-S127-0101-IND-ACTCHQSAL         PIC 9(01)      COMP.               
368600* Dato de bypass para enviarse a la L020:                                     
368700* 0 - No actualizar Pivote                                                    
368800* 1 - Actualizar Pivote tradicional                                           
368900* 2 - No paso la validaciÿn se debe rechazar                                  
369000* 3 - Actualizar Pivote credicheque                                           
369100     02 FILLER                             PIC 9(01)      COMP.               
369200     02 FILLER                             PIC X(251).                        
369300                                                                              
369400*****************************************************************             
369500* ENTRY POINT S127L010CONCVEOBS DE LA LIBRERIA L010 DEL S127 QUE*             
369600* PROPORCIONA LA CONSULTA DE EXCLUSIVAMENTE LA CLAVE DE OBSERVA-*             
369700* CION PARA CONSULTAS DEL S500 VIA SUBSET DE UN MEDIO DE ACCESO *             
369800* DADO EL NUMERO DE ESTE (VIA SUBSET).                          *             
369900*                                                               *             
370000*****************************************************************             
370100*                                                                             
370200**** PARAMETRO DE ENTRADA L010 ENTRY POINT: S127L010CONCVEOBS ***             
370300*                                                               *             
370400* WS-S127-E010-09-NUMSIST = NUMERO DE SISTEMA                   *             
370500* WS-S127-E010-09-NUMPASO = NUMERO DE PASO                      *             
370600* WS-S127-E010-09-NUMPREF = NUMERO DE SUCURSAL MED/ACCESO       *             
370700* WS-S127-E010-09-NUMCTA  = NUMERO CUENTA Y DIGITO              *             
370800* WS-S127-E010-09-SUCMOV  = SUCURSAL QUE OPERA (NO REQUERIDO)   *             
370900* WS-S127-E010-09-NOMIMOV = NOMINA QUE OPERA   (NO REQUERIDO)   *             
371000* WS-S127-E010-09-CAJMOV  = CAJA QUE OPERA     (NO REQUERIDO)   *             
371100*****************************************************************             
371200                                                                              
371300 01 WS-S127-L010-09-CTR-ENTRADA.                                              
371400    02 WS-S127-E010-09-NUMSIST            PIC 9(04)  COMP.                    
371500    02 WS-S127-E010-09-NUMPASO            PIC 9(04)  COMP.                    
371600    02 WS-S127-E010-09-NUMPREF            PIC 9(04)  COMP.                    
371700    02 WS-S127-E010-09-NUMCTA             PIC 9(12)  COMP.                    
371800    02 WS-S127-E010-09-SUCMOV             PIC 9(04)  COMP.                    
371900    02 WS-S127-E010-09-NOMIMOV            PIC 9(10)  COMP.                    
372000    02 WS-S127-E010-09-CAJMOV             PIC 9(02)  COMP.                    
372100    02 FILLER                             PIC X(80).                          
372200                                                                              
372300$SET OMIT = NOT TRACES127R02                                                  
372400 01 WKSS-S127-L010-09-CTR-ENTRADA.                                            
372500    02 WKSS-S127-E010-09-NUMSIST          PIC 9(04).                          
372600    02 WKSS-S127-E010-09-NUMPASO          PIC 9(04).                          
372700    02 WKSS-S127-E010-09-NUMPREF          PIC 9(04).                          
372800    02 WKSS-S127-E010-09-NUMCTA           PIC 9(12).                          
372900    02 WKSS-S127-E010-09-SUCMOV           PIC 9(04).                          
373000    02 WKSS-S127-E010-09-NOMIMOV          PIC 9(10).                          
373100    02 WKSS-S127-E010-09-CAJMOV           PIC 9(02).                          
373200$POP OMIT                                                                     
373300                                                                              
373400**** PARAMETRO DE SALIDA  L010 ENTRY POINT: S127L010CONCVEOBS ***             
373500*                                                               *             
373600* WS-S127-S010-09-NUMSIST   = NUMERO DE SISTEMA                 *             
373700* WS-S127-S010-09-NUMPASO   = NUMERO DE PASO                    *             
373800* WS-S127-S010-09-NUMPREF   = NUMERO DE SUCURSAL MED/ACCESO     *             
373900* WS-S127-S010-09-NUMCTA    = NUMERO CUENTA Y DIGITO            *             
374000* WS-S127-S010-09-SUCMOV    = SUCURSAL QUE OPERA                *             
374100* WS-S127-S010-09-NOMIMOV   = NOMINA QUE OPERA                  *             
374200* WS-S127-S010-09-CAJMOV    = CAJA QUE OPERA                    *             
374300* WS-S127-S010-09-CVEOBS    = 01 CUENTA SIN CLAVE DE OBSERVACION*             
374400*                             02 CUENTA CON CLAVE DE OBSERVACION*             
374500* WS-S127-S010-09-FECALTOBS = FECHA DE INICIO DE OBSERVACION    *             
374600*                                                               *             
374700* WS-S127-L010-09-RESULT    = 00 CONSULTA O.K. (VERIFICAR DATO  *             
374800*                                DE CVE DE OBSERVACION)         *             
374900*                           = 10 NOT-FOUND (LA CUENTA NO TIENE  *             
375000*                                CLAVE DE OBSERVACION)          *             
375100*                           = > 10 ERROR DE LA BASE             *             
375200*                                                               *             
375300*                                                               *             
375400*****************************************************************             
375500                                                                              
375600 01 WS-S127-L010-09-CTR-SALIDA.                                               
375700    02 WS-S127-S010-09-NUMSIST            PIC 9(04)  COMP.                    
375800    02 WS-S127-S010-09-NUMPASO            PIC 9(04)  COMP.                    
375900    02 WS-S127-S010-09-NUMPREF            PIC 9(04)  COMP.                    
376000    02 WS-S127-S010-09-NUMCTA             PIC 9(12)  COMP.                    
376100    02 WS-S127-S010-09-SUCMOV             PIC 9(04)  COMP.                    
376200    02 WS-S127-S010-09-NOMIMOV            PIC 9(10)  COMP.                    
376300    02 WS-S127-S010-09-CAJMOV             PIC 9(02)  COMP.                    
376400    02 WS-S127-S010-09-CVEOBS             PIC 9(02)  COMP.                    
376500    02 WS-S127-S010-09-FECALTOBS          PIC 9(08)  COMP.                    
376600    02 FILLER                             PIC X(75).                          
376700                                                                              
376800$SET OMIT = NOT TRACES127R02                                                  
376900 01 WKSS-S127-L010-09-CTR-SALIDA.                                             
377000    02 WKSS-S127-L010-09-RESULT           PIC 9(04).                          
377100    02 WKSS-S127-S010-09-NUMSIST          PIC 9(04).                          
377200    02 WKSS-S127-S010-09-NUMPASO          PIC 9(04).                          
377300    02 WKSS-S127-S010-09-NUMPREF          PIC 9(04).                          
377400    02 WKSS-S127-S010-09-NUMCTA           PIC 9(12).                          
377500    02 WKSS-S127-S010-09-SUCMOV           PIC 9(04).                          
377600    02 WKSS-S127-S010-09-NOMIMOV          PIC 9(10).                          
377700    02 WKSS-S127-S010-09-CAJMOV           PIC 9(02).                          
377800    02 WKSS-S127-S010-09-CVEOBS           PIC 9(02).                          
377900    02 WKSS-S127-S010-09-FECALTOBS        PIC 9(08).                          
378000$POP OMIT                                                                     
378100                                                                              
378200*************** CAMPO PARA EL RESULTADO DE LA L010  *************             
378300                                                                              
378400 77 WS-S127-L010-09-RESULT                PIC S9(11) BINARY.                  
378500 77  WS-S127-RESULT        PIC S9(11) BINARY.                                 
378600 77  WKS-88-S127L010       PIC 99     COMP VALUE 0.                           
378700****************************************************************              
378800$POP OMIT                                                                     
378900$SET OMIT = NOT S127L020                                                      
379000******************************************************************            
379100*                                                                *            
379200* PARAMETRO PARA LA  LIBRERIA L020 DEL S127 LA CUAL PROPORCIONA  *            
379300* LA ACTUALIZACION DEL ESTATUS DE CHEQUES Y RANGOS DE CHEQUES    *            
379400*                                                23-OCT-06 A.C.R.*            
379500******************************************************************            
379600                                                                              
379700**** PARAMETRO ENTRADA L020 ENTRY POINT: S127L020ACTRANGOCHEQ ****            
379800                                                                              
379900*    WS-S127-0202-NUMSIST-I      = NUMERO DE SISTEMA LLAMADOR                 
380000*    WS-S127-0202-NUMPASO-I      = NUMERO PROGRAMA LLAMADOR                   
380100*    WS-S127-0202-NUMPREF-I      = NUMERO DE SUCURSAL MED/ACCESO              
380200*    WS-S127-0202-NUMCTA-I       = NUMERO DE CUENTA Y DIGITO                  
380300*    WS-S127-0202-FOLINI-I       = NUMERO DE CHEQUE INICIAL                   
380400*    WS-S127-0202-FOLFIN-I       = NUMERO DE CHEQUE FINAL                     
380500*    WS-S127-0202-STACHQ-INI-I   = 99 (VALOR FIJO "IMPERATIVO")               
380600*    WS-S127-0202-STACHQ-FIN-I   = NUEVO STATUS A GRABAR                      
380700*    WS-S127-0202-SUCMOV-I       = SUCURSAL QUE OPERO                         
380800*    WS-S127-0202-NOMIMOV-I      = NUMERO NOMINA QUE OPERO  (0)               
380900*    WS-S127-0202-NUMCAJA-I      = NUMERO DE CAJA QUE OPERO (0)               
381000*    WS-S127-0202-IMPORTE-I      = IMPORTE DEL CHEQUE                         
381100*    WS-S127-0202-NUMAUT-I       = AUTORIZACION                               
381200*    WS-S127-0202-MDAFECEMI-I    = FECHA DE EMISION                           
381300*    WS-S127-0202-MDACOMI-I      = COMISION                                   
381400*    WS-S127-0202-STALERTA-I     = STATUS DE LA ALERTA                        
381500*        00   -       SIN ALERTA                                              
381600*        01   -       IN PROGRESS                                             
381700*        02   -       RETURN                                                  
381800*        03   -       PAY                                                     
381900*        04   -       PAGADO SIN ALERTA(Return)                               
382000*        05   -       PAGO FORZADO(TimeOut)                                   
382100*        06   -       PAGUESE CON ALERTA                                      
382200*        07   -       PAGO CON FRAUDE                                         
382300*        08   -       CALL                                                    
382400*    WS-S127-0202-CVETRAN-I      = FUNCION                                    
382500*        901  -       Actualiza Estatus del Cheque                            
382600*        902  -       Actualiza Estatus de Alerta                             
382700*        903  -       Actualiza Estatus Cheque y Estatus Alerta               
382800                                                                              
382900******************************************************************            
383000 01 WS-S127-0202-CTR-ENTRADA.                                                 
383100    02 WS-S127-0202-NUMSIST-I          PIC 9(04) COMP.                        
383200    02 WS-S127-0202-NUMPASO-I          PIC 9(04) COMP.                        
383300    02 WS-S127-0202-NUMPREF-I          PIC 9(04) COMP.                        
383400    02 WS-S127-0202-NUMCTA-I           PIC 9(12) COMP.                        
383500    02 WS-S127-0202-FOLINI-I           PIC 9(08) COMP.                        
383600    02 WS-S127-0202-FOLFIN-I           PIC 9(08) COMP.                        
383700    02 WS-S127-0202-STACHQ-INI-I       PIC 9(02) COMP.                        
383800    02 WS-S127-0202-STACHQ-FIN-I       PIC 9(02) COMP.                        
383900    02 WS-S127-0202-SUCMOV-I           PIC 9(04) COMP.                        
384000    02 WS-S127-0202-NOMIMOV-I          PIC 9(10) COMP.                        
384100    02 WS-S127-0202-NUMCAJA-I          PIC 9(02) COMP.                        
384200    02 WS-S127-0202-IMPORTE-I          PIC 9(14)V99 COMP.                     
384300    02 WS-S127-0202-NUMAUT-I           PIC 9(06) COMP.                        
384400    02 WS-S127-0202-MDAFECEMI-I        PIC 9(08) COMP.                        
384500    02 WS-S127-0202-MDACOMI-I          PIC 9(01).                             
384600    02 WS-S127-0202-STALERTA-I         PIC 9(02) COMP.                        
384700    02 WS-S127-0202-CVETRAN-I          PIC 9(03) COMP.                        
384800    02 WS-S127-0202-IND-ACTCHQSAL-I    PIC 9(01) COMP.                        
384900* Dato de bypass recibido en la S127L010:                                     
385000* 0 - No actualizar Pivote                                                    
385100* 1 - Actualizar Pivote tradicional                                           
385200* 2 - Eliminaciÿn de Pivote                                                  
385300* 3 - Actualizar Pivote credicheque                                           
385400    02 FILLER                          PIC X(491).                            
385500******************************************************************            
385600****** PARAMETRO SALIDA  L020 ENTRY POINT: S127L020ACTRANGOCHEQ **            
385700******************************************************************            
385800 01 WS-S127-0202-CTR-SALIDA.                                                  
385900    02 WS-S127-0202-NUMSIST            PIC 9(04) COMP.                        
386000    02 WS-S127-0202-NUMPASO            PIC 9(04) COMP.                        
386100    02 WS-S127-0202-NUMPREF            PIC 9(04) COMP.                        
386200    02 WS-S127-0202-NUMCTA             PIC 9(12) COMP.                        
386300    02 WS-S127-0202-FOLINI             PIC 9(08) COMP.                        
386400    02 WS-S127-0202-FOLFIN             PIC 9(08) COMP.                        
386500    02 WS-S127-0202-STACHQ-INI         PIC 9(02) COMP.                        
386600    02 WS-S127-0202-STACHQ-FIN         PIC 9(02) COMP.                        
386700    02 WS-S127-0202-SUCMOV             PIC 9(04) COMP.                        
386800    02 WS-S127-0202-NOMIMOV            PIC 9(10) COMP.                        
386900    02 WS-S127-0202-NUMCAJA            PIC 9(02) COMP.                        
387000    02 WS-S127-0202-NUMACT             PIC 9(08) COMP.                        
387100    02 WS-S127-0202-NUMAUT             PIC 9(06) COMP.                        
387200    02 FILLER                          PIC X(65).                             
387300                                                                              
387400*****************************************************************             
387500* ENTRY POINT S127L020ACTGLOB                                                 
387600*****************************************************************             
387700**** PARAMETRO DE ENTRADA L020 ENTRY POINT: S127L020ACTGLOB  ****             
387800*****************************************************************             
387900 01 WS-S127-0203-CTR-ENTRADA.                                                 
388000    02 WS-S127-0203-NUMSIST-I              PIC 9(04) COMP.                    
388100    02 WS-S127-0203-NUMPASO-I              PIC 9(04) COMP.                    
388200    02 WS-S127-0203-NUMDATO-I              PIC 9(02) COMP.                    
388300    02 WS-S127-0203-ULTFOLIO-I             PIC 9(10) COMP.                    
388400    02 WS-S127-0203-NUMCSI-I               PIC 9(02) COMP.                    
388500    02 WS-S127-0203-FECBD-I                PIC 9(06) COMP.                    
388600    02 WS-S127-0203-STATUSBD-I             PIC 9(02) COMP.                    
388700    02 FILLER                              PIC X(185).                        
388800                                                                              
388900*****************************************************************             
389000**** PARAMETRO DE SALIDA  L020 ENTRY POINT: S127L020ACTGLOB  ****             
389100*****************************************************************             
389200 01 WS-S127-0203-CTR-SALIDA                PIC X(200).                        
389300                                                                              
389400****  CAMPO DE RESULTADO DEL CALL DE LIBRARIA L020 *************              
389500                                                                              
389600 77 WS-S127-ERROR        PIC S9(11) BINARY.                                   
389700 77 WKS-88-S127L020      PIC 99     COMP   VALUE 0.                           
389800                                                                              
389900*****************************************************************             
390000* ENTRY POINT S127L020ACTPROTCHEQ                                             
390100*****************************************************************             
390200** PARAMETRO DE ENTRADA L020 ENTRY POINT: S127L020ACTPROTCHEQ  **             
390300*****************************************************************             
390400 01 WKS-E020-CTR-ENTRADA.                                                     
390500    02 WKS-E020-CTR-NUMSIST            PIC 9(04) COMP.                        
390600    02 WKS-E020-CTR-NUMPASO            PIC 9(04) COMP.                        
390700    02 WKS-E020-MDA-NUMPREF            PIC 9(04) COMP.                        
390800    02 WKS-E020-MDA-NUM                PIC 9(12) COMP.                        
390900    02 WKS-E020-MDA-FOLINI             PIC 9(08) COMP.                        
391000    02 WKS-E020-MDA-FOLFIN             PIC 9(08) COMP.                        
391100    02 WKS-E020-CHQ-PROTECCION         PIC 9(02) COMP.                        
391200*      01 - Desprotegido.                                                     
391300*      02 - Protegido Precamara                                               
391400    02 WKS-E020-CTR-SUCMOV             PIC 9(04) COMP.                        
391500    02 WKS-E020-CTR-NOMIMOV            PIC 9(10) COMP.                        
391600    02 WKS-E020-CTR-NUMCAJA            PIC 9(02) COMP.                        
391700    02 WKS-E020-CTR-NUMAUT             PIC 9(06) COMP.                        
391800    02 WKS-E020-CTR-TMOVBIT            PIC 9(02) COMP.                        
391900*      02 - Movimiento de proteccion cheque                                   
392000    02 FILLER                          PIC X(507).                            
392100                                                                              
392200*****************************************************************             
392300** PARAMETRO DE SALIDA  L020 ENTRY POINT: S127L020ACTPROTCHEQ  **             
392400*****************************************************************             
392500 01 WKS-S020-CTR-SALIDA.                                                      
392600    02 WKS-S020-CTR-NUMSIST            PIC 9(04) COMP.                        
392700    02 WKS-S020-CTR-NUMPASO            PIC 9(04) COMP.                        
392800    02 WKS-S020-MDA-NUMPREF            PIC 9(04) COMP.                        
392900    02 WKS-S020-MDA-NUM                PIC 9(12) COMP.                        
393000    02 WKS-S020-CTR-NUMAUT             PIC 9(06) COMP.                        
393100    02 WKS-S020-CTR-NUMCHQACT          PIC 9(04) COMP.                        
393200    02 FILLER                          PIC X(223).                            
393300                                                                              
393400****  CAMPO DE RESULTADO DEL CALL DE LIBRARIA L020 *************              
393500 77 WKS-R020-RESULT                    PIC S9(11) BINARY.                     
393600                                                                              
393700                                                                              
393800****************************************************************              
393900$POP OMIT                                                                     
394000$SET OMIT = NOT ELISTACHEQS127L020                                            
394100*  OBJETIVO :                                                                 
394200*  ACTUALIZAR LA SITUACION FINAL DE UN CHEQUE EN BASE AL STATUS               
394300*  ANTERIOR OBTENIDODEL ULTIMO MOVIMIENTO PARA CUENTA-CHEQUE EN               
394400*  LA BITACORA DIARIA (B09) EN LUGAR DEL STATUS FINAL PASADO EN               
394500*  EL PARAMETRO.                                                              
394600*                                                                             
394700*  ENTRY POINT  S127L020ELISTACHEQ                                            
394800 01 E020-02-CTR-ENTRADA.                                                      
394900    02 E020-02-CTR-NUMSIST        PIC 9(04) COMP.                             
395000    02 E020-02-CTR-NUMPASO        PIC 9(04) COMP.                             
395100    02 E020-02-MDA-NUMPREF        PIC 9(04) COMP.                             
395200    02 E020-02-MDA-NUM            PIC 9(12) COMP.                             
395300    02 E020-02-CTR-FOLINI         PIC 9(08) COMP.                             
395400    02 E020-02-CTR-FOLFIN         PIC 9(08) COMP.                             
395500    02 E020-02-MDA-STACHQ-INI     PIC 9(02) COMP.                             
395600    02 E020-02-MDA-STACHQ-FIN     PIC 9(02) COMP.                             
395700    02 E020-02-CTR-SUCMOV         PIC 9(04) COMP.                             
395800    02 E020-02-CTR-NOMIMOV        PIC 9(10) COMP.                             
395900    02 E020-02-CTR-NUMCAJA        PIC 9(02) COMP.                             
396000    02 E020-02-MDA-IMPORTE        PIC 9(14)V99 COMP.                          
396100    02 E020-02-CTR-NUMAUT         PIC 9(06) COMP.                             
396200    02 E020-02-MDA-FECEMI         PIC 9(08) COMP.                             
396300    02 E020-02-MDA-COMISION       PIC 9(01).                                  
396400    02 E020-02-CHQ-STALERTA       PIC 9(02) COMP.                             
396500    02 E020-02-CHQ-CVE-TRAN       PIC 9(03) COMP.                             
396600    02 E020-02-IND-ACTCHQSAL-I    PIC 9(01) COMP.                             
396700* Dato de bypass recibido en la S127L010:                                     
396800* 0 - No actualizar Pivote                                                    
396900* 1 - Actualizar Pivote tradicional                                           
397000* 2 - Eliminaciÿn de Pivote                                                 
397100* 3 - Actualizar Pivote credicheque                                           
397200    02 FILLER                     PIC X(491).                                 
397300                                                                              
397400 01 S020-02-CTR-SALIDA.                                                       
397500    02 S020-02-CTR-NUMSIST        PIC 9(04) COMP.                             
397600    02 S020-02-CTR-NUMPASO        PIC 9(04) COMP.                             
397700    02 S020-02-MDA-NUMPREF        PIC 9(04) COMP.                             
397800    02 S020-02-MDA-NUM            PIC 9(12) COMP.                             
397900    02 S020-02-CTR-FOLINI         PIC 9(08) COMP.                             
398000    02 S020-02-CTR-FOLFIN         PIC 9(08) COMP.                             
398100    02 S020-02-MDA-STACHQ-INI     PIC 9(02) COMP.                             
398200    02 S020-02-MDA-STACHQ-FIN     PIC 9(02) COMP.                             
398300    02 S020-02-CTR-SUCMOV         PIC 9(04) COMP.                             
398400    02 S020-02-CTR-NOMIMOV        PIC 9(10) COMP.                             
398500    02 S020-02-CTR-NUMCAJA        PIC 9(02) COMP.                             
398600    02 S020-02-CTR-NUMACT         PIC 9(08) COMP.                             
398700    02 S020-02-CTR-NUMAUT         PIC 9(06) COMP.                             
398800    02 FILLER                     PIC X(65).                                  
398900                                                                              
399000 77 R020-02-CTR-ERROR             PIC S9(11) BINARY.                          
399100*    00    ACTUALIZACION CORRECTA  01-09   ERROR EN PARAMETRO                 
399200*    10-19 ERROR INSTRUCCION DMSII 90-99   BD CON PROBLEMAS O                 
399300*                                          NO DISPONIBLE                      
399400$POP OMIT                                                                     
399500                                                                              
399600$SET OMIT = NOT S127L070                                                      
399700*****************************************************************             
399800*                                                               *             
399900*   PARAMETRO PARA LA LIBRERIA L070 DEL S127 PARA CONTROLAR EL  *             
400000*   ACCESO A LA BASE DE DATOS S127BD02PREVEN                    *             
400100*                                                               *             
400200*****************************************************************             
400300**** PARAMETRO DE ENTRADA L070 ENTRY POINT: S127L070CONGLOBALES *             
400400*****************************************************************             
400500 01 WS-S127-0301-CTR-ENTRADA               PIC X(808).                        
400600                                                                              
400700*****************************************************************             
400800**** PARAMETRO DE SALIDA  L070 ENTRY POINT: S127L070CONGLOBALES *             
400900*****************************************************************             
401000 01 WS-S127-0301-CTR-SALIDA.                                                  
401100    02 WS-S127-0301-ULTFOLIO               PIC 9(10) COMP.                    
401200    02 WS-S127-0301-CSIBD                  PIC 9(02) COMP.                    
401300    02 WS-S127-0301-FECBD                  PIC 9(08) COMP.                    
401400    02 WS-S127-0301-STATUSBD               PIC 9(02) COMP.                    
401500    02 WS-S127-0301-NUMUAT                 PIC 9(06) COMP.                    
401600    02 FILLER                              PIC X(794).                        
401700                                                                              
401800 77 WS-S127-L030-ERROR                     PIC S9(11) BINARY.                 
401900                                                                              
402000****************************************************************              
402100$POP OMIT                                                                     
402200$SET OMIT = NOT S151REGISTRA  AND  NOT S151SALDOS                             
402300****************************************************************              
402400 77 WKS-88-REGISTRAS500     PIC 99     COMP VALUE 0.                          
402500 77  W77-NUM-MOVS-GEN       PIC 9(02)  COMP   VALUE 0.                        
402600 77  W77-NUM-MOVS-ENV       PIC 9(02)  COMP   VALUE 0.                        
402700 77  W77-TOT-MOVS-GEN       PIC 9(08)  COMP   VALUE 0.                        
402800 77  W77-TOT-MOVS-ENV       PIC 9(08)  COMP   VALUE 0.                        
402900 77  W77-NUM-CALL-S151      PIC 9(06)  COMP   VALUE 0.                        
403000****************************************************************              
403100$POP OMIT                                                                     
403200$SET OMIT = NOT S151REGISTRA                                                  
403300***************************************************************               
403400*                 LIBRERIA(S151)ACTBD                         *               
403500*                                                             *               
403600*  (S151)S151/OBJECT/L002/REGISTRAS500                        *               
403700*                                                             *               
403800*  ENTRYPOINT : CARGAMOV1                                     *               
403900*                                                             *               
404000*  DATOS DE ENTRADA                                           *               
404100*           WS-S151-0101-FUNCION-I: 1 ENVIAR                  *               
404200*                                   2 ELIMINAR                *               
404300*                                  11 INICIO DE MOVTO         *               
404400*                                  11 FIN    DE MOVTO         *               
404500*                                  21 BORRA POR PASO          *               
404600*                                  22 BORRA POR AUTORIZACION  *               
404700*                                  31 REBLOQUEO  50 REGISTROS *               
404800*                                  32 REBLOQUEO  01 REGISTROS *               
404900*                                                             *               
405000*           WS-S151-0101-CVETRAN-I( )                         *               
405100*           WS-S151-0101-INDLEY-I ( )                         *               
405200*           WS-S151-0101-CVELEY-I ( )                         *               
405300*           WS-S151-0101-ESQCON-I ( )                         *               
405400*           WS-S151-0101-IMPORTE-I( )                         *               
405500*           WS-S151-0101-LEYENDA-I( )                         *               
405600*           WS-S151-0101-REFNUM-I : REFERENCIA                *               
405700*           WS-S151-0101-FECCONT-I: FECHA CONTABLE            *               
405800*           WS-S151-0101-FECVA-I  : FECHA DEL MOVIMIENTO      *               
405900*           WS-S151-0101-AUTAPL-I : AUTORIZACION              *               
406000*           WS-S151-0101-REFS151-ELI-I : REF S151 A ELIMINAR  *               
406100*           WS-S151-0101-REFS151-ANT-I :REF. DE CONTINUACION  *               
406200*                                      WS-S151-0101-REFS151   *               
406300*           WS-S151-0101-FECMOV-I      :FECHA DEL MOVIMIENTO  *               
406400*           WS-S151-0101-HORAMOV-I     :HORA DEL MOVIMIENTO   *               
406500*           WS-S151-0101-SGIRO-I  :IND. SI GENERO SOBREGIRO   *               
406600*                                  SOLO EN CARGOS             *               
406700*                 SGIRO-I = 2 PARA LINEAS VENCIDAS:10,20      *               
406800*                 SGIRO-I = 1 PARA LINEAS VIGENTES: 1         *               
406900*           WS-S151-0101-TIPO-PROC-I:                         *               
407000*                 1:10   LINEA                                *               
407100*                                                             *               
407200*           WS-S151-0101-ORIGEN-I:                            *               
407300*                 1 LOCAL                                     *               
407400*                 2 FORANEO ENVIADO                           *               
407500*                 3 FORANEO RECIBIDO                          *               
407600*                                                             *               
407700*  DATASETS:                                                  *               
407800*          WS-S500B03CONTRATOS.                               *               
407900*          WS-S500B02CONTROL.                                 *               
408000*                                                             *               
408100*   WS-MENSAJE-DIALOGO PARA LINEA                             *               
408200*                                                             *               
408300*   NOTA:                                                     *               
408400*       LOS DATOS DE ENTRADA  -I SERAN INICIALIZADOS AL FINAL *               
408500*       DE LA RUTINA.                                         *               
408600***************************************************************               
408700***************************************************************               
408800*       LIBRERIA DEL SISTEMA S151                             *               
408900***************************************************************               
409000*     01  ACTBD   01 CARGAMOV1                                *               
409100***************************************************************               
409200                                                                              
409300$SET OMIT = NOT S151REGISTRA1                                                 
409400 01  WS-S151-0101-MOVIMIENTOS      WITH LOWER-BOUNDS.                         
409500     03 WS-S151-0101-FUNCION       PIC  9(2)      COMP.                       
409600        88 WS-S151-0101-REGMOV     VALUE  1.                                  
409700        88 WS-S151-0101-ELIMOV     VALUE  2.                                  
409800        88 WS-S151-0101-INICIO     VALUE 11.                                  
409900        88 WS-S151-0101-FIN        VALUE 12.                                  
410000        88 WS-S151-0101-ELIPASO    VALUE 21.                                  
410100        88 WS-S151-0101-ELIAUT     VALUE 22.                                  
410200        88 WS-S151-0101-BLO50      VALUE 31.                                  
410300        88 WS-S151-0101-BLO01      VALUE 32.                                  
410400     03 WS-S151-0101-SISTEMA       PIC  9(04)     COMP.                       
410500     03 WS-S151-0101-PRODUCT       PIC  9(04)     COMP.                       
410600     03 WS-S151-0101-INSTRUMENTO   PIC  9(02)     COMP.                       
410700     03 WS-S151-0101-SUCPROM       PIC  9(04)     COMP.                       
410800     03 WS-S151-0101-CUENTA        PIC  9(16)     COMP.                       
410900     03 WS-S151-0101-IMPTE1.                                                  
411000        05 WS-S151-0101-CVETRAN1   PIC  9(04)     COMP.                       
411100        05 WS-S151-0101-INDLEY1    PIC  9(02)     COMP.                       
411200        05 WS-S151-0101-ESQCON1    PIC  9(04)     COMP.                       
411300        05 WS-S151-0101-IMPORTE1   PIC  9(14)V99  COMP.                       
411400     03 WS-S151-0101-IMPTE2.                                                  
411500        05 WS-S151-0101-CVETRAN2   PIC  9(04)     COMP.                       
411600        05 WS-S151-0101-INDLEY2    PIC  9(02)     COMP.                       
411700        05 WS-S151-0101-ESQCON2    PIC  9(04)     COMP.                       
411800        05 WS-S151-0101-IMPORTE2   PIC  9(14)V99  COMP.                       
411900     03 WS-S151-0101-IMPTE3.                                                  
412000        05 WS-S151-0101-CVETRAN3   PIC  9(04)     COMP.                       
412100        05 WS-S151-0101-INDLEY3    PIC  9(02)     COMP.                       
412200        05 WS-S151-0101-ESQCON3    PIC  9(04)     COMP.                       
412300        05 WS-S151-0101-IMPORTE3   PIC  9(14)V99  COMP.                       
412400     03 WS-S151-0101-IMPTE4.                                                  
412500        05 WS-S151-0101-CVETRAN4   PIC  9(04)     COMP.                       
412600        05 WS-S151-0101-INDLEY4    PIC  9(02)     COMP.                       
412700        05 WS-S151-0101-ESQCON4    PIC  9(04)     COMP.                       
412800        05 WS-S151-0101-IMPORTE4   PIC  9(14)V99  COMP.                       
412900     03 WS-S151-0101-IMPTE5.                                                  
413000        05 WS-S151-0101-CVETRAN5   PIC  9(04)     COMP.                       
413100        05 WS-S151-0101-INDLEY5    PIC  9(02)     COMP.                       
413200        05 WS-S151-0101-ESQCON5    PIC  9(04)     COMP.                       
413300        05 WS-S151-0101-IMPORTE5   PIC  9(14)V99  COMP.                       
413400     03 WS-S151-0101-FECMOV        PIC  9(08)     COMP.                       
413500     03 WS-S151-0101-HORAMOV       PIC  9(06)     COMP.                       
413600     03 WS-S151-0101-FECCONT       PIC  9(08)     COMP.                       
413700     03 WS-S151-0101-FECVA         PIC  9(08)     COMP.                       
413800     03 WS-S151-0101-AUTAPL        PIC  9(08)     COMP.                       
413900     03 WS-S151-0101-AUT3NIV       PIC  9(08)     COMP.                       
414000     03 WS-S151-0101-REFNUM        PIC  9(20)     COMP.                       
414100     03 WS-S151-0101-REFNUM-R REDEFINES                                       
414200        WS-S151-0101-REFNUM.                                                  
414300        05 WS-S151-0101-REFNUM-INDEFEC PIC 9(02)  COMP.                       
414400        05 WS-S151-0101-REFNUM-CHVV    PIC 9(04)  COMP.                       
414500        05 WS-S151-0101-REFNUM-REFE    PIC 9(14)  COMP.                       
414600     03 WS-S151-0101-MEDACC.                                                  
414700        05 WS-S151-0101-CVEMEDACC  PIC  9(02)     COMP.                       
414800           88 WS-S151-0101-DOC     VALUE 1.                                   
414900           88 WS-S151-0101-PLAS    VALUE 2.                                   
415000        05 WS-S151-0101-SUCMEDACC  PIC  9(04)     COMP.                       
415100        05 WS-S151-0101-CTAMEDACC  PIC  9(16)     COMP.                       
415200     03 WS-S151-0101-MEDENTR       PIC  9(02)     COMP.                       
415300        88 WS-S151-0101-TERMCTE    VALUE 00.                                  
415400        88 WS-S151-0101-PCCTE      VALUE 01.                                  
415500        88 WS-S151-0101-VIDEO      VALUE 02.                                  
415600        88 WS-S151-0101-AUDIO      VALUE 03.                                  
415700        88 WS-S151-0101-PCAUTO     VALUE 04.                                  
415800        88 WS-S151-0101-CAJERO     VALUE 05.                                  
415900        88 WS-S151-0101-DISPEN     VALUE 06.                                  
416000        88 WS-S151-0101-VENTAINT   VALUE 07.                                  
416100        88 WS-S151-0101-EMIDOC     VALUE 08.                                  
416200        88 WS-S151-0101-RECDOC     VALUE 09.                                  
416300        88 WS-S151-0101-VENTANILLA VALUE 20.                                  
416400        88 WS-S151-0101-BACKOF     VALUE 21.                                  
416500        88 WS-S151-0101-PLATAFORMA VALUE 22.                                  
416600        88 WS-S151-0101-VENTSUC    VALUE 23.                                  
416700        88 WS-S151-0101-EJETEL     VALUE 40.                                  
416800        88 WS-S151-0101-TRANAUT    VALUE 50.                                  
416900        88 WS-S151-0101-TRANAUT-OB VALUE 51.                                  
417000        88 WS-S151-0101-PUNTVTA    VALUE 60.                                  
417100     03 WS-S151-0101-SUCS028       PIC  9(04)     COMP.                       
417200     03 WS-S151-0101-CAJS028       PIC  9(02)     COMP.                       
417300     03 WS-S151-0101-SUCOPER       PIC  9(04)     COMP.                       
417400     03 WS-S151-0101-CAJOPER       PIC  9(02)     COMP.                       
417500     03 WS-S151-0101-SUCTRAN       PIC  9(04)     COMP.                       
417600     03 WS-S151-0101-CAJTRAN       PIC  9(02)     COMP.                       
417700     03 WS-S151-0101-NOMINA-OPE    PIC  9(08)     COMP.                       
417800     03 WS-S151-0101-ORIGEN        PIC  9(02)     COMP.                       
417900        88 WS-S151-0101-LOCAL      VALUE 1.                                   
418000        88 WS-S151-0101-FORENV     VALUE 2.                                   
418100        88 WS-S151-0101-FORREC     VALUE 3.                                   
418200     03 WS-S151-0101-MONEDA        PIC  9(04)     COMP.                       
418300     03 WS-S151-0101-REFS151       PIC  9(08)     COMP.                       
418400     03 WS-S151-0101-REFS151-ELI   PIC  9(08)     COMP.                       
418500     03 WS-S151-0101-REFS151-ANT   PIC  9(08)     COMP.                       
418600     03 WS-S151-0101-TIPO-PROC     PIC  9(02)     COMP.                       
418700        88 WS-S151-0101-P010       VALUE 1.                                   
418800        88 WS-S151-0101-BATCH      VALUE 20.                                  
418900        88 WS-S151-0101-MENSUAL    VALUE 30.                                  
419000     03 WS-S151-0101-SGIRO           PIC  9(02)     COMP.                     
419100     03 WS-S151-0101-CVEAVISO        PIC  9(04)     COMP.                     
419200     03 WS-S151-0101-IND-EDOCTA      PIC  9(02)     COMP.                     
419300     03 WS-S151-0101-IND-DATOS-ADIC  PIC  9(02)     COMP.                     
419400     03 WS-S151-0101-CVE-DEVOL-CONS  PIC  9(02)     COMP.                     
419500     03 WS-S151-0101-FEC-ULTMOV      PIC  9(08)     COMP.                     
419600     03 RD-WS-S151-0101-FEC-ULTMOV   REDEFINES                                
419700           WS-S151-0101-FEC-ULTMOV.                                           
419800        05 WS-S151-0101-NUM-RENGLON  PIC  9(02)     COMP.                     
419900        05 WS-S151-0101-ACTIVIDAD    PIC  9(06)     COMP.                     
420000     03 WS-S151-0101-SECTOR          PIC  9(02)     COMP.                     
420100     03 WS-S151-0101-BANCA           PIC  9(02)     COMP.                     
420200                                                                              
420300**   03 WS-S151-0101-FIL-FUTURO      PIC  X(07).                              
420400     03 WS-S151-0101-ESTACION-LB     PIC  9(08)     COMP.                     
420500     03 WS-S151-0101-BCO-ORI         PIC  9(03)     COMP.                     
420600     03 WS-S151-0101-BCO-DES         PIC  9(03)     COMP.                     
420700                                                                              
420800     03 WS-S151-0101-NODORI          PIC  9(02)     COMP.                     
420900     03 WS-S151-0101-USO-S151        PIC  9(10)     COMP.                     
421000     03 WS-S151-0101-DATOS-ADIC.                                              
421100        05 WS-S151-0101-NUMFUN1      PIC  9(08)     COMP.                     
421200        05 WS-S151-0101-NUMFUN2      PIC  9(08)     COMP.                     
421300        05 WS-S151-0101-SISORI       PIC  9(04)     COMP.                     
421400        05 WS-S151-0101-PRDORI       PIC  9(04)     COMP.                     
421500        05 WS-S151-0101-INSTORI      PIC  9(02)     COMP.                     
421600        05 WS-S151-0101-CVETRAORI    PIC  9(04)     COMP.                     
421700        05 WS-S151-0101-CTO-ORIG     PIC  9(20)     COMP.                     
421800        05 WS-S151-0101-REFEREN.                                              
421900           07 WS-S151-0101-TIPINST   PIC  9(01)     COMP.                     
422000           07 WS-S151-0101-IDINST    PIC  9(07)     COMP.                     
422100           07 WS-S151-0101-FECREF    PIC  9(04)     COMP.                     
422200           07 WS-S151-0101-LOCFIS    PIC  9(15)     COMP.                     
422300           07 WS-S151-0101-DIGITO    PIC  9(01)     COMP.                     
422400        05 WS-S151-0101-REFERENR REDEFINES WS-S151-0101-REFEREN.              
422500           07 WS-S151-0101-REFINT    PIC  9(23) COMP.                         
422600           07 WS-S151-0101-REFINT2   PIC  9(05) COMP.                         
422700        05 WS-S151-0101-REFERENR2 REDEFINES WS-S151-0101-REFEREN.             
422800           07 WS-S151-0101-REFPZA    PIC  9(03) COMP.                         
422900           07 WS-S151-0101-REFSUC    PIC  9(03) COMP.                         
423000           07 WS-S151-0101-REFTERM   PIC  X(04).                              
423100           07 WS-S151-0101-REFAUT    PIC  9(06) COMP.                         
423200           07 WS-S151-0101-REFVFIR   PIC  9(01) COMP.                         
423300           07 WS-S151-0101-REFTCHQ   PIC  9(01) COMP.                         
423400           07 FILLER                 PIC  X(03).                              
423500        05 WS-S151-0101-REDS500.                                              
423600           07 WS-S151-0101-CVE-DEVOL    PIC  9(04) COMP.                      
423700           07 WS-S151-0101-FEC-DEVOL    PIC  9(08) COMP.                      
423800           07 WS-S151-0101-BCO-DEVOL    PIC  9(04) COMP.                      
423900           07 WS-S151-0101-NOM-ORDENA   PIC  X(30).                           
424000           07 WS-S151-0101-CAUSA-ORDEN  PIC  X(50).                           
424100           07 WS-S151-0101-SUC-ORDENA   PIC  9(04) COMP.                      
424200           07 WS-S151-0101-CTA-CONCENT  PIC  9(02) COMP.                      
424300           07 FILLER                    PIC  X(04).                           
424400           07 WS-S151-0101-INDTAR       PIC  9(02) COMP.                      
424500        05 WS-S151-0101-REDS500-R REDEFINES                                   
424600           WS-S151-0101-REDS500.                                              
424700           07 WS-S151-0101-TARJETA      PIC 9(16) COMP.                       
424800           07 FILLER                    PIC X(88).                            
424900        05 WS-S151-0101-LEYENDA1     PIC  X(40).                              
425000        05 WS-S151-0101-LEYENDA2     PIC  X(40).                              
425100        05 WS-S151-0101-LEYENDA3     PIC  X(40).                              
425200        05 WS-S151-0101-LEYENDA4     PIC  X(40).                              
425300        05 WS-S151-0101-LEYENDA5     PIC  X(40).                              
425400        05 WS-S151-0101-SALDO-INI    PIC  S9(15)V99 COMP.                     
425500        05 WS-S151-0101-FILLXAPLI    PIC  X(10).                              
425600                                                                              
425700* CAMPOS MIENTRAS EL S151 DEFINE EL FTO PARA CITIDIRECT                       
425800        77 WS-S151-0101-NUM-CTE      PIC 9(12) COMP.                          
425900                                                                              
426000        77 WS-S151-0101-NOMBRE        PIC X(36).                              
426100*       77 WS-S151-0101-NOM-CTE       PIC X(36).                              
426200                                                                              
426300        77 WS-S151-0101-CD-IND-ABSERV PIC 9(02) COMP.                         
426400                                                                              
426405*INI BNE INDICADOR ME13595                                                    
426500*       77 WS-S151-0101-SERVCITIDIREC PIC 9(02) COMP.                         
426505        77 WS-S151-0101-IND-BNE       PIC 9(01) COMP.                         
426510        77 WS-S151-0101-SERVCITIDIREC PIC 9(01) COMP.                         
426515*FIN BNE INDICADOR ME13595                                                    
426600*       77 WS-S151-0101-CD-SERVICIO   PIC 9(02) COMP.                         
426700                                                                              
426800        77 WS-S151-0101-CD-SUREF-CTE  PIC X(16).                              
426900*       77 WS-S151-0101-CD-REF-CTE    PIC X(16).                              
427000                                                                              
427100        77 WS-S151-0101-CD-AUT-NIO    PIC X(16).                              
427200                                                                              
427300        77 WS-S151-0101-REF-ADC-01    PIC X(35).                              
427400*       77 WS-S151-0101-REF-ADI-1     PIC X(35).                              
427500                                                                              
427600        77 WS-S151-0101-REF-ADC-02    PIC X(35).                              
427700*       77 WS-S151-0101-REF-ADI-2     PIC X(35).                              
427800                                                                              
427900        77 WS-S151-0101-REF-ADC-03    PIC X(35).                              
428000*       77 WS-S151-0101-REF-ADI-3     PIC X(35).                              
428100                                                                              
428200        77 WS-S151-0101-REF-ADC-04    PIC X(35).                              
428300*       77 WS-S151-0101-REF-ADI-4     PIC X(35).                              
428400                                                                              
428500* CAMPOS PARA MANEJAR EL NUEVO FORMATO DEL S151                               
428600        77 WS-S151-0101-FORMATO         PIC  9(02)    COMP.                   
428700           88 WS-S151-0101-FTO-975      VALUE  1.                             
428800        77 WS-S151-0101-SERVICIO        PIC  9(02)    COMP.                   
428900        77 WS-S151-0101-TIPOOPER        PIC  X(01).                           
429000        77 WS-S151-0101-AGRPDESVPROD    PIC  9(04)    COMP.                   
429100        77 WS-S151-0101-AGRPDESVINST    PIC  9(04)    COMP.                   
429200        77 WS-S151-0101-SIRHDESV        PIC  9(04)    COMP.                   
429300        77 WS-S151-0101-LIBROCONT       PIC  9(02)    COMP.                   
429400        77 WS-S151-0101-CVEDESVIO1      PIC  9(04)    COMP.                   
429500        77 WS-S151-0101-GUIDESVIO1      PIC  9(04)    COMP.                   
429600        77 WS-S151-0101-CVEDESVIO2      PIC  9(04)    COMP.                   
429700        77 WS-S151-0101-GUIDESVIO2      PIC  9(04)    COMP.                   
429800        77 WS-S151-0101-CVEDESVIO3      PIC  9(04)    COMP.                   
429900        77 WS-S151-0101-GUIDESVIO3      PIC  9(04)    COMP.                   
430000        77 WS-S151-0101-CVEDESVIO4      PIC  9(04)    COMP.                   
430100        77 WS-S151-0101-GUIDESVIO4      PIC  9(04)    COMP.                   
430200        77 WS-S151-0101-CVEDESVIO5      PIC  9(04)    COMP.                   
430300        77 WS-S151-0101-GUIDESVIO5      PIC  9(04)    COMP.                   
430400        77 WS-S151-0101-FECVENCIMIENTO   PIC 9(08)    COMP.                   
430500        77 WS-S151-0101-PLAZO            PIC  9(04)   COMP.                   
430600        77 WS-S151-0101-NODODEST         PIC  9(02)   COMP.                   
430700        77 WS-S151-0101-REFERORI         PIC  9(18)   COMP.                   
430800        77 WS-S151-0101-CVEINTERCMPNY    PIC  9(06)   COMP.                   
430900        77 WS-S151-0101-FILIAL           PIC  X(05).                          
431000        77 WS-S151-0101-TIPOCHEQUE       PIC  9(02)   COMP.                   
431100        77 WS-S151-0101-MOTIVO-DEVOL     PIC  X(30).                          
431200        77 WS-S151-0101-NOM-CORT-BCO     PIC  X(20).                          
431300        77 WS-S151-0101-REF-CECOBAN      PIC  X(07).                          
431400        77 WS-S151-0101-NUM-ORD-PAGO     PIC  9(18)   COMP.                   
431500        77 WS-S151-0101-NOMINAMAKER      PIC  9(14)   COMP.                   
431600        77 WS-S151-0101-NOMINACHKR       PIC  9(14)   COMP.                   
431700        77 WS-S151-0101-NOM-BENEFI       PIC  X(50).                          
431800        77 WS-S151-0101-CVE-RASTREO      PIC  X(30).                          
431900        77 WS-S151-0101-FECH-PAGO        PIC  9(08)   COMP.                   
432000                                                                              
432100$POP OMIT                                                                     
432200                                                                              
432300$SET OMIT = NOT S151REGISTRA2                                                 
432400 01  WS-S151-0101-MOVIMIENTOS              WITH LOWER-BOUNDS.                 
432500     03 WS-S151-0101-FUNCION               PIC  9(2)      COMP.               
432600        88 WS-S151-0101-REGMOV             VALUE  1.                          
432700        88 WS-S151-0101-ELIMOV             VALUE  2.                          
432800        88 WS-S151-0101-INICIO             VALUE 11.                          
432900        88 WS-S151-0101-FIN                VALUE 12.                          
433000        88 WS-S151-0101-ELIPASO            VALUE 21.                          
433100        88 WS-S151-0101-ELIAUT             VALUE 22.                          
433200        88 WS-S151-0101-BLO50              VALUE 31.                          
433300        88 WS-S151-0101-BLO01              VALUE 32.                          
433400     03 WS-S151-0101-FORMATO               PIC  9(02)     COMP.               
433500        88 WS-S151-0101-FTO-975            VALUE  1.                          
433600     03 WS-S151-0101-SISTEMA               PIC  9(04)     COMP.               
433700     03 WS-S151-0101-PRODUCT               PIC  9(04)     COMP.               
433800     03 WS-S151-0101-INSTRUMENTO           PIC  9(02)     COMP.               
433900*INI BCM         P09-XXX Alertas y Notificaciones         PCB                 
434000**   Los siguientes datos se sustituyen por SERVICIO-ALERTA.                  
434100**       en el proyecto Alertas y Notificaciones                              
434200**   03 WS-S151-0101-SERVICIO              PIC  9(02)     COMP.               
434300**   03 WS-S151-0101-TIPOOPER              PIC  X(01).                        
434400     03 WS-S151-0101-SERVICIO-ALERTA       PIC  9(04)     COMP.               
434500*FIN BCM         P09-XXX Alertas y Notificaciones         PCB                 
434600     03 WS-S151-0101-CD-IND-ABSERV         PIC  9(02)     COMP.               
434700     03 WS-S151-0101-AGRPDESVPROD          PIC  9(04)     COMP.               
434800     03 WS-S151-0101-AGRPDESVINST          PIC  9(04)     COMP.               
434900     03 WS-S151-0101-SIRHDESV              PIC  9(04)     COMP.               
435000     03 WS-S151-0101-LIBROCONT             PIC  9(02)     COMP.               
435100     03 WS-S151-0101-IMPTE1.                                                  
435200        05 WS-S151-0101-CVETRAN1           PIC  9(06)     COMP.               
435300        05 WS-S151-0101-INDLEY1            PIC  9(02)     COMP.               
435400        05 WS-S151-0101-ESQCON1            PIC  9(04)     COMP.               
435500        05 WS-S151-0101-IMPORTE1           PIC  9(16)V99  COMP.               
435600        05 WS-S151-0101-CVEDESVIO1         PIC  9(04)     COMP.               
435700        05 WS-S151-0101-GUIDESVIO1         PIC  9(04)     COMP.               
435800     03 WS-S151-0101-IMPTE2.                                                  
435900        05 WS-S151-0101-CVETRAN2           PIC  9(06)     COMP.               
436000        05 WS-S151-0101-INDLEY2            PIC  9(02)     COMP.               
436100        05 WS-S151-0101-ESQCON2            PIC  9(04)     COMP.               
436200        05 WS-S151-0101-IMPORTE2           PIC  9(16)V99  COMP.               
436300        05 WS-S151-0101-CVEDESVIO2         PIC  9(04)     COMP.               
436400        05 WS-S151-0101-GUIDESVIO2         PIC  9(04)     COMP.               
436500     03 WS-S151-0101-IMPTE3.                                                  
436600        05 WS-S151-0101-CVETRAN3           PIC  9(06)     COMP.               
436700        05 WS-S151-0101-INDLEY3            PIC  9(02)     COMP.               
436800        05 WS-S151-0101-ESQCON3            PIC  9(04)     COMP.               
436900        05 WS-S151-0101-IMPORTE3           PIC  9(16)V99  COMP.               
437000        05 WS-S151-0101-CVEDESVIO3         PIC  9(04)     COMP.               
437100        05 WS-S151-0101-GUIDESVIO3         PIC  9(04)     COMP.               
437200     03 WS-S151-0101-IMPTE4.                                                  
437300        05 WS-S151-0101-CVETRAN4           PIC  9(06)     COMP.               
437400        05 WS-S151-0101-INDLEY4            PIC  9(02)     COMP.               
437500        05 WS-S151-0101-ESQCON4            PIC  9(04)     COMP.               
437600        05 WS-S151-0101-IMPORTE4           PIC  9(16)V99  COMP.               
437700        05 WS-S151-0101-CVEDESVIO4         PIC  9(04)     COMP.               
437800        05 WS-S151-0101-GUIDESVIO4         PIC  9(04)     COMP.               
437900     03 WS-S151-0101-IMPTE5.                                                  
438000        05 WS-S151-0101-CVETRAN5           PIC  9(06)     COMP.               
438100        05 WS-S151-0101-INDLEY5            PIC  9(02)     COMP.               
438200        05 WS-S151-0101-ESQCON5            PIC  9(04)     COMP.               
438300        05 WS-S151-0101-IMPORTE5           PIC  9(16)V99  COMP.               
438400        05 WS-S151-0101-CVEDESVIO5         PIC  9(04)     COMP.               
438500        05 WS-S151-0101-GUIDESVIO5         PIC  9(04)     COMP.               
438600     03 WS-S151-0101-MONEDA                PIC  9(04)     COMP.               
438700     03 WS-S151-0101-ORIGEN                PIC  9(02)     COMP.               
438800        88 WS-S151-0101-LOCAL              VALUE 1.                           
438900        88 WS-S151-0101-FORENV             VALUE 2.                           
439000        88 WS-S151-0101-FORREC             VALUE 3.                           
439100     03 WS-S151-0101-REFNUM-INDEFEC        PIC  9(02)     COMP.               
439200     03 WS-S151-0101-SGIRO                 PIC  9(02)     COMP.               
439300     03 WS-S151-0101-IND-EDOCTA            PIC  9(02)     COMP.               
439305*INI INDICADOR BNE ME13595                                                    
439400*    03 WS-S151-0101-SERVCITIDIREC         PIC  9(02)     COMP.               
439410     03 WS-S151-0101-IND-BNE               PIC  9(01)     COMP.               
439420     03 WS-S151-0101-SERVCITIDIREC         PIC  9(01)     COMP.               
439430*FIN INDICADOR BNE ME13595                                                    
439500     03 WS-S151-0101-IND-DATOS-ADIC        PIC  9(02)     COMP.               
439600     03 WS-S151-0101-NUM-RENGLON           PIC  9(02)     COMP.               
439700     03 WS-S151-0101-FECVENCIMIENTO        PIC 9(08)      COMP.               
439800     03 WS-S151-0101-PLAZO                 PIC  9(04)     COMP.               
439900     03 WS-S151-0101-FEC-ULTMOV            PIC  9(08)     COMP.               
440000     03 WS-S151-0101-BCO-ORI               PIC  9(05)     COMP.               
440100     03 WS-S151-0101-BCO-DES               PIC  9(05)     COMP.               
440200     03 WS-S151-0101-NODORI                PIC  9(02)     COMP.               
440300     03 WS-S151-0101-NODODEST              PIC  9(02)     COMP.               
440400     03 WS-S151-0101-SISORI                PIC  9(04)     COMP.               
440500     03 WS-S151-0101-PRDORI                PIC  9(04)     COMP.               
440600     03 WS-S151-0101-INSTORI               PIC  9(02)     COMP.               
440700     03 WS-S151-0101-CVETRAORI             PIC  9(06)     COMP.               
440800     03 WS-S151-0101-REFERORI              PIC  9(18)     COMP.               
440900     03 WS-S151-0101-NUM-CTE               PIC  9(12)     COMP.               
441000     03 WS-S151-0101-SECTOR                PIC  9(02)     COMP.               
441100     03 WS-S151-0101-SUCPROM               PIC  9(04)     COMP.               
441200     03 WS-S151-0101-CUENTA                PIC  9(16)     COMP.               
441300     03 WS-S151-0101-MEDACC.                                                  
441400        05 WS-S151-0101-CVEMEDACC          PIC  9(04)     COMP.               
441500           88 WS-S151-0101-DOC             VALUE 1.                           
441600           88 WS-S151-0101-PLAS            VALUE 2.                           
441700        05 WS-S151-0101-SUCMEDACC          PIC  9(04)     COMP.               
441800        05 WS-S151-0101-CTAMEDACC          PIC  9(16)     COMP.               
441900     03 WS-S151-0101-MEDENTR               PIC  9(02)     COMP.               
442000        88 WS-S151-0101-TERMCTE            VALUE 00.                          
442100        88 WS-S151-0101-PCCTE              VALUE 01.                          
442200        88 WS-S151-0101-VIDEO              VALUE 02.                          
442300        88 WS-S151-0101-AUDIO              VALUE 03.                          
442400        88 WS-S151-0101-PCAUTO             VALUE 04.                          
442500        88 WS-S151-0101-CAJERO             VALUE 05.                          
442600        88 WS-S151-0101-DISPEN             VALUE 06.                          
442700        88 WS-S151-0101-VENTAINT           VALUE 07.                          
442800        88 WS-S151-0101-EMIDOC             VALUE 08.                          
442900        88 WS-S151-0101-RECDOC             VALUE 09.                          
443000        88 WS-S151-0101-VENTANILLA         VALUE 20.                          
443100        88 WS-S151-0101-BACKOF             VALUE 21.                          
443200        88 WS-S151-0101-PLATAFORMA         VALUE 22.                          
443300        88 WS-S151-0101-VENTSUC            VALUE 23.                          
443400        88 WS-S151-0101-EJETEL             VALUE 40.                          
443500        88 WS-S151-0101-TRANAUT            VALUE 50.                          
443600        88 WS-S151-0101-TRANAUT-OB         VALUE 51.                          
443700        88 WS-S151-0101-PUNTVTA            VALUE 60.                          
443800     03 WS-S151-0101-CVEINTERCMPNY         PIC  9(06)     COMP.               
443900*INI BCM        P09-XXX Alertas y Notificaciones          PCB                 
444000**   El siguiente dato se sustituyo por GRUPO-SOC Y BIN-TAR                   
444100**      en el proyecto Alertas y notificaciones.                              
444200**   03 WS-S151-0101-FILIAL                PIC  X(05)                         
444300     03 WS-S151-0101-GRUPO-SOC             PIC  9(04)     COMP.               
444400     03 WS-S151-0101-BIN-TAR               PIC  9(06)     COMP.               
444500*FIN BCM         P09-XXX Alertas y Notificaciones         PCB                 
444600     03 WS-S151-0101-REFNUM                PIC  9(18)     COMP.               
444700     03 WS-S151-0101-AUTAPL                PIC  9(18)     COMP.               
444800     03 WS-S151-0101-AUT3NIV               PIC  9(10)     COMP.               
444900     03 WS-S151-0101-CD-AUT-NIO            PIC  X(16).                        
445000     03 WS-S151-0101-REFS151               PIC  9(08)     COMP.               
445100     03 WS-S151-0101-REFS151-ELI           PIC  9(08)     COMP.               
445200     03 WS-S151-0101-REFS151-ANT           PIC  9(08)     COMP.               
445300     03 WS-S151-0101-TIPO-PROC             PIC  9(02)     COMP.               
445400        88 WS-S151-0101-P010               VALUE 1.                           
445500        88 WS-S151-0101-BATCH              VALUE 20.                          
445600        88 WS-S151-0101-MENSUAL            VALUE 30.                          
445700     03 WS-S151-0101-FECMOV                PIC  9(08)     COMP.               
445800     03 WS-S151-0101-HORAMOV               PIC  9(06)     COMP.               
445900     03 WS-S151-0101-FECCONT               PIC  9(08)     COMP.               
446000     03 WS-S151-0101-FECVA                 PIC  9(08)     COMP.               
446100     03 WS-S151-0101-SUCS028               PIC  9(04)     COMP.               
446200     03 WS-S151-0101-CAJS028               PIC  9(04)     COMP.               
446300     03 WS-S151-0101-SUCOPER               PIC  9(04)     COMP.               
446400     03 WS-S151-0101-CAJOPER               PIC  9(04)     COMP.               
446500     03 WS-S151-0101-SUCTRAN               PIC  9(04)     COMP.               
446600     03 WS-S151-0101-CAJTRAN               PIC  9(04)     COMP.               
446700     03 WS-S151-0101-REFVFIR               PIC  9(02)     COMP.               
446800     03 WS-S151-0101-NOMINA-OPE            PIC  9(14)     COMP.               
446900     03 WS-S151-0101-CVEAVISO              PIC  9(04)     COMP.               
447000     03 WS-S151-0101-BANCA                 PIC  9(02)     COMP.               
447100     03 WS-S151-0101-ESTACION-LB           PIC  9(04)     COMP.               
447200     03 WS-S151-0101-REFNUM-CHVV           PIC  9(04)     COMP.               
447300     03 WS-S151-0101-TIPOCHEQUE            PIC  9(02)     COMP.               
447400     03 WS-S151-0101-CTA-CONCENT           PIC  9(02)     COMP.               
447500     03 WS-S151-0101-CVE-DEVOL             PIC  9(04)     COMP.               
447600     03 WS-S151-0101-FEC-DEVOL             PIC  9(08)     COMP.               
447700     03 WS-S151-0101-MOTIVO-DEVOL          PIC  X(30).                        
447800     03 WS-S151-0101-BCO-DEVOL             PIC  9(04)     COMP.               
447900     03 WS-S151-0101-NOM-CORT-BCO          PIC  X(20).                        
448000     03 WS-S151-0101-NOM-ORDENA            PIC  X(30).                        
448100     03 WS-S151-0101-CAUSA-ORDEN           PIC  X(50).                        
448200     03 WS-S151-0101-SUC-ORDENA            PIC  9(04)     COMP.               
448300     03 WS-S151-0101-REF-CECOBAN           PIC  X(07).                        
448400     03 WS-S151-0101-NUM-ORD-PAGO          PIC  9(18)     COMP.               
448500     03 WS-S151-0101-CTO-ORIG              PIC  9(20)     COMP.               
448600     03 FILLER                             PIC  9(01) COMP.                   
448700     03 WS-S151-0101-REFINT                PIC  9(23) COMP.                   
448800     03 FILLER                             PIC  X(04).                        
448900     03 WS-S151-0101-NUMFUN1               PIC  9(14)     COMP.               
449000     03 WS-S151-0101-NUMFUN2               PIC  9(14)     COMP.               
449100*INI BCM         P09-XXX Alertas y Notificaciones         PCB                 
449200**   Los siguientes datos se sustituyeron por SALDO-FINAL y                   
449300**   FILLER-ALFA en el proyecto Alertas y notificaciones                      
449400**   03 WS-S151-0101-NOMINAMAKER           PIC  9(14)     COMP.               
449500**   03 WS-S151-0101-NOMINACHKR            PIC  9(14)     COMP.               
449600     03 WS-S151-0101-SALDO-FINAL           PIC S9(15)V99  COMP.               
449700     03 WS-S151-0101-FILLER-ALFA           PIC  X(05).                        
449800*FIN BCM         P09-XXX Alertas y Notificaciones         PCB                 
449900     03 WS-S151-0101-CD-SUREF-CTE          PIC X(16).                         
450000     03 WS-S151-0101-REF-ADC-01            PIC X(35).                         
450100     03 WS-S151-0101-REF-ADC-02            PIC X(35).                         
450200     03 WS-S151-0101-REF-ADC-03            PIC X(35).                         
450300     03 WS-S151-0101-REF-ADC-04            PIC X(35).                         
450400     03 WS-S151-0101-LEYENDA1              PIC  X(40).                        
450500     03 WS-S151-0101-LEYENDA2              PIC  X(40).                        
450600     03 WS-S151-0101-LEYENDA3              PIC  X(40).                        
450700     03 WS-S151-0101-LEYENDA4              PIC  X(40).                        
450800     03 WS-S151-0101-LEYENDA5              PIC  X(40).                        
450900     03 WS-S151-0101-NOMBRE                PIC  X(36).                        
451000     03 WS-S151-0101-NOM-BENEFI            PIC  X(50).                        
451100     03 WS-S151-0101-CVE-RASTREO           PIC  X(30).                        
451200     03 WS-S151-0101-FECH-PAGO             PIC  9(08)     COMP.               
451300*    03 WS-S151-0101-FILXAPL-REG2          PIC  X(530).                       
451350     03 WS-S151-0101-FILXAPL-REG2          PIC  X(636).                       
451400     03 WS-S151-0101-FILXAPL-REG2-R REDEFINES                                 
451500        WS-S151-0101-FILXAPL-REG2.                                            
451600        05 WS-S151-0101-FILXAPL-R2-B01     PIC  X(053).                       
451700        05 WS-S151-0101-FILXAPL-R2-B02     PIC  X(053).                       
451800        05 WS-S151-0101-FILXAPL-R2-B03     PIC  X(053).                       
451900        05 WS-S151-0101-FILXAPL-R2-B04     PIC  X(053).                       
452000        05 WS-S151-0101-FILXAPL-R2-B05     PIC  X(053).                       
452100        05 WS-S151-0101-FILXAPL-R2-B06     PIC  X(053).                       
452200        05 WS-S151-0101-FILXAPL-R2-B07     PIC  X(053).                       
452300        05 WS-S151-0101-FILXAPL-R2-B08     PIC  X(053).                       
452400        05 WS-S151-0101-FILXAPL-R2-B09     PIC  X(053).                       
452500        05 WS-S151-0101-FILXAPL-R2-B10     PIC  X(053).                       
452505        05 WS-S151-0101-FILXAPL-R2-B11     PIC  X(053).                       
452510        05 WS-S151-0101-FILXAPL-R2-B12     PIC  X(053).                       
452600                                                                              
452700 77 WS-S151-0101-INDTAR          PIC  9(02)     COMP.                         
452800 77 WS-S151-0101-TIPINST         PIC  9(01)     COMP.                         
452900 77 WS-S151-0101-IDINST          PIC  9(07)     COMP.                         
453000 77 WS-S151-0101-CVE-DEVOL-CONS  PIC  9(02)     COMP.                         
453100 77 WS-S151-0101-FECREF          PIC  9(04)     COMP.                         
453200 77 WS-S151-0101-USO-S151        PIC  9(10)     COMP.                         
453300 77 WS-S151-0101-LOCFIS          PIC  9(15)     COMP.                         
453400 77 WS-S151-0101-REFEREN         PIC  X(14).                                  
453500 77 WS-S151-0101-TARJETA         PIC  9(16)     COMP.                         
453600 77 WS-S151-0101-SALDO-INI       PIC  S9(15)V99 COMP.                         
453700 77 WS-S151-0101-DIGITO          PIC  9(01)     COMP.                         
453710 77 WS-BAND-ENV-SPID-S151        PIC  9(01)     COMP.                         
453720 77 WS-PROC-ENV-SPID-S151        PIC  9(02)     COMP.                         
453800*INI PFG                                                                      
453900 77 WS-PROCESA-PFG-UA            PIC 9(01) COMP VALUE 0.                      
454000 88 WS-88-PROC-UA                VALUE 1.                                     
454100 77 WS-PROCESA-PFG-UB            PIC 9(01) COMP VALUE 0.                      
454200 88 WS-88-PROC-UB                VALUE 1.                                     
454300 77 WS-PROCESA-PFG-UC            PIC 9(01) COMP VALUE 0.                      
454400 88 WS-88-PROC-UC                VALUE 1.                                     
454500*FIN PFG                                                                      
454600 77 WS-PROCESA-ID-NEGOCIO        PIC 9(01) COMP VALUE 0.                      
454700 88 WS-88-PROC-NEGOCIO           VALUE 1.                                     
454702 77 WS-PROCESA-SPID              PIC 9(01) COMP VALUE 0.                      
454704 88 WS-88-PROC-SPID              VALUE 1.                                     
454706*INI 2308 EXTENDED NETWORK                                                    
454708 77 WS-IND-EXTNET                PIC 9(01).                                   
454710 88 WS-88-IND-EXTNET             VALUE 1.                                     
454712*FIN 2308 EXTENDED NETWORK                                                    
454800$ POP OMIT                                                                    
454900                                                                              
455000 77  WS-S151-0101-STATUS             PIC S9(11) BINARY.                       
455100     88 WS-S151-0101-OK              VALUE 0.                                 
455200     88 WS-S151-0101-ESIST           VALUE 1.                                 
455300     88 WS-S151-0101-EFUNCION        VALUE 2.                                 
455400     88 WS-S151-0101-ETRANSAC        VALUE 3.                                 
455500     88 WS-S151-0101-EFECCONT        VALUE 4.                                 
455600     88 WS-S151-0101-ESUCPROM        VALUE 5.                                 
455700     88 WS-S151-0101-ESUCOPE         VALUE 6.                                 
455800     88 WS-S151-0101-ENOCATA         VALUE 7.                                 
455900     88 WS-S151-0101-EREFS151        VALUE 8.                                 
456000     88 WS-S151-0101-ENOEXMOV        VALUE 9.                                 
456100     88 WS-S151-0101-EORIGEN         VALUE 10.                                
456200     88 WS-S151-0101-ESUCS028        VALUE 11.                                
456300                                                                              
456400***************************************************************               
456500*    CAMPOS DE WORKING PARA MANEJO DE MOVIMIENTOS AL S151     *               
456600***************************************************************               
456700 77  WS-S151-CTRIND                  PIC 9(11) BINARY.                        
456800 77  WS-S151-CTRSTA                  PIC 9(11) BINARY.                        
456900 77  WS-S151-SW                      PIC 9(11) BINARY.                        
457000 77  WS-S151-IND                     PIC 9(11) BINARY.                        
457100***************************************************************               
457200*   VARIABLE DE ENTRADA                                                       
457300***************************************************************               
457400 01  WS-S151-INPUT.                                                           
457500     03 WS-S151-01-CVES-I            OCCURS 30 TIMES.                         
457600        05 WS-S151-0101-CVETRAN-I       PIC 9(4)      COMP.                   
457700        88 WS88-S151-0101-CVENOCONT-I   VALUE 500 THRU 699, 889,              
457703                                              942,943,944,                    
457705*          COMISION DE SERVICIO               P0108059 MM68927 INI            
457710                                              895,896,897,898,                
457712                                              899,900,903,904,914.            
457715*                                             P0108059 MM68927 FIN            
457800        05 WS-S151-0101-INDLEY-I        PIC 9(02)     COMP.                   
457900        05 WS-S151-0101-IMPORTE-I       PIC 9(14)V99  COMP.                   
458000        05 WS-S151-0101-LEYENDA-I.                                            
458100           07 WS-S151-0101-REFLEY-I     PIC 9(10).                            
458200           07 WS-S151-0101-RF2LEY-I     PIC 9(10).                            
458300           07 WS-S151-0101-RESLEY-I     PIC X(20).                            
458400        05 WS-S151-0101-ESQCON-I        PIC  9(04)     COMP.                  
458500     03 WS-S151-0101-FUNCION-I          PIC  9(02)     COMP.                  
458600     03 WS-S151-0101-PRODUCT-I          PIC  9(04)     COMP.                  
458700     03 WS-S151-0101-INSTRUMENTO-I      PIC  9(02)     COMP.                  
458800     03 WS-S151-0101-SUCPROM-I          PIC  9(04)     COMP.                  
458900     03 WS-S151-0101-CUENTA-I           PIC  9(16)     COMP.                  
459000     03 WS-S151-0101-FECMOV-I           PIC  9(08)     COMP.                  
459100     03 WS-S151-0101-HORAMOV-I          PIC  9(06)     COMP.                  
459200     03 WS-S151-0101-FECCONT-I          PIC  9(08)     COMP.                  
459300     03 WS-S151-0101-FECVA-I            PIC  9(08)     COMP.                  
459400     03 WS-S151-0101-AUTAPL-I           PIC  9(08)     COMP.                  
459500     03 WS-S151-0101-AUT3NIV-I          PIC  9(08)     COMP.                  
459600     03 WS-S151-0101-REFNUM-I           PIC  9(20)     COMP.                  
459700     03 WS-S151-0101-REFNUM-RI REDEFINES                                      
459800        WS-S151-0101-REFNUM-I.                                                
459900        05 WS-S151-0101-REFNUM-INDEFEC-I PIC 9(02)     COMP.                  
460000        05 WS-S151-0101-REFNUM-CHVV-I    PIC 9(04)     COMP.                  
460100        05 WS-S151-0101-REFNUM-REFE-I    PIC 9(14)     COMP.                  
460200     03 WS-S151-0101-MEDACC-I.                                                
460300        05 WS-S151-0101-CVEMEDACC-I     PIC  9(02)     COMP.                  
460400        05 WS-S151-0101-SUCMEDACC-I     PIC  9(04)     COMP.                  
460500        05 WS-S151-0101-CTAMEDACC-I     PIC  9(16)     COMP.                  
460600     03 WS-S151-0101-MEDENTR-I          PIC  9(02)     COMP.                  
460700     03 WS-S151-0101-SUCS028-I          PIC  9(04)     COMP.                  
460800     03 WS-S151-0101-CAJS028-I          PIC  9(02)     COMP.                  
460900     03 WS-S151-0101-SUCOPER-I          PIC  9(04)     COMP.                  
461000     03 WS-S151-0101-CAJOPER-I          PIC  9(02)     COMP.                  
461100     03 WS-S151-0101-SUCTRAN-I          PIC  9(04)     COMP.                  
461200     03 WS-S151-0101-CAJTRAN-I          PIC  9(02)     COMP.                  
461300     03 WS-S151-0101-NOMINA-OPE-I       PIC  9(08)     COMP.                  
461400     03 WS-S151-0101-ORIGEN-I           PIC  9(02)     COMP.                  
461500     03 WS-S151-0101-MONEDA-I           PIC  9(04)     COMP.                  
461600     03 WS-S151-0101-REFS151-I          PIC  9(08)     COMP.                  
461700     03 WS-S151-0101-REFS151-ELI-I      PIC  9(08)     COMP.                  
461800     03 WS-S151-0101-REFS151-ANT-I      PIC  9(08)     COMP.                  
461900     03 WS-S151-0101-TIPO-PROC-I        PIC  9(02)     COMP.                  
462000     03 WS-S151-0101-SGIRO-I            PIC  9(02)     COMP.                  
462100     03 WS-S151-0101-CVEAVISO-I         PIC  9(04)     COMP.                  
462200     03 WS-S151-0101-IND-EDOCTA-I       PIC  9(02)     COMP.                  
462300     03 WS-S151-0101-IND-DATOS-ADIC-I   PIC  9(02)     COMP.                  
462400     03 WS-S151-0101-CVE-DEVOL-CONS-I   PIC  9(02)     COMP.                  
462500     03 WS-S151-0101-FEC-ULTMOV-I       PIC  9(08)     COMP.                  
462600     03 RD-WS-S151-0101-FEC-ULTMOV-I    REDEFINES                             
462700        WS-S151-0101-FEC-ULTMOV-I.                                            
462800        05 WS-S151-0101-NUM-RENGLON-I   PIC  9(02)     COMP.                  
462900        05 WS-S151-0101-ACTIVIDAD-I     PIC  9(06)     COMP.                  
463000     03 WS-S151-0101-SECTOR-I           PIC  9(02)     COMP.                  
463100     03 WS-S151-0101-BANCA-I            PIC  9(02)     COMP.                  
463200                                                                              
463300***  03 WS-S151-0101-FIL-FUTURO-I       PIC  X(07).                           
463400***  03 FILLER                          PIC  X(03).                           
463500     03 WS-S151-0101-ESTACION-LB-I      PIC  9(08)     COMP.                  
463600     03 WS-S151-0101-BCO-ORI-I          PIC  9(03)     COMP.                  
463700     03 WS-S151-0101-BCO-DES-I          PIC  9(03)     COMP.                  
463800***  03 FILLER                          PIC  X(01).                           
463900                                                                              
464000     03 WS-S151-0101-NODORI-I           PIC  9(02)     COMP.                  
464100     03 WS-S151-0101-USO-S151-I         PIC  9(10)     COMP.                  
464200     03 WS-S151-0101-DATOS-ADIC-I.                                            
464300        05 WS-S151-0101-NUMFUN1-I       PIC  9(08)     COMP.                  
464400        05 WS-S151-0101-NUMFUN2-I       PIC  9(08)     COMP.                  
464500        05 WS-S151-0101-SISORI-I        PIC  9(04)     COMP.                  
464600        05 WS-S151-0101-PRDORI-I        PIC  9(04)     COMP.                  
464700        05 WS-S151-0101-INSTORI-I       PIC  9(02)     COMP.                  
464800        05 WS-S151-0101-CVETRAORI-I     PIC  9(04)     COMP.                  
464900        05 WS-S151-0101-CTO-ORIG-I      PIC  9(20)     COMP.                  
465000        05 WS-S151-0101-REFEREN-I.                                            
465100           07 WS-S151-0101-TIPINST-I    PIC  9(01)     COMP.                  
465200           07 WS-S151-0101-IDINST-I     PIC  9(07)     COMP.                  
465300           07 WS-S151-0101-FECREF-I     PIC  9(04)     COMP.                  
465400           07 WS-S151-0101-LOCFIS-I     PIC  9(15)     COMP.                  
465500           07 WS-S151-0101-DIGITO-I     PIC  9(01)     COMP.                  
465600        05 WS-S151-0101-REFERENR-I REDEFINES                                  
465700           WS-S151-0101-REFEREN-I.                                            
465800           07 WS-S151-0101-REFINT-I     PIC  9(23)     COMP.                  
465900           07 WS-S151-0101-REFINT2-I    PIC  9(05)     COMP.                  
466000        05 WS-S151-0101-REFERENR2-I REDEFINES                                 
466100           WS-S151-0101-REFEREN-I.                                            
466200           07 WS-S151-0101-REFPZA-I     PIC  9(03)     COMP.                  
466300           07 WS-S151-0101-REFSUC-I     PIC  9(03)     COMP.                  
466400           07 WS-S151-0101-REFTERM-I    PIC  X(04).                           
466500           07 WS-S151-0101-REFAUT-I     PIC  9(06)     COMP.                  
466600           07 WS-S151-0101-REFVFIR-I    PIC  9(01)     COMP.                  
466700           07 WS-S151-0101-REFTCHQ-I    PIC  9(01)     COMP.                  
466800           07 FILLER                    PIC  X(03).                           
466900        05 WS-S151-0101-CVE-DEVOL-I     PIC  9(04)     COMP.                  
467000        05 WS-S151-0101-FEC-DEVOL-I     PIC  9(08)     COMP.                  
467100        05 WS-S151-0101-BCO-DEVOL-I     PIC  9(04)     COMP.                  
467200        05 WS-S151-0101-NOM-ORDENA-I    PIC  X(30).                           
467300        05 WS-S151-0101-CAUSA-ORDEN-I   PIC  X(50).                           
467400        05 WS-S151-0101-SUC-ORDENA-I    PIC  9(04)     COMP.                  
467500        05 WS-S151-0101-CTA-CONCENT-I   PIC  9(02)     COMP.                  
467600        05 WS-S151-0101-INDTAR-I        PIC  9(02)     COMP.                  
467700        05 WS-S151-0101-TARJETA-I       PIC  9(16)     COMP.                  
467800        05 WS-S151-0101-SALDO-INI-I     PIC  S9(15)V99 COMP.                  
467900                                                                              
468000        05 WS-S151-0101-NUM-CTE-I       PIC 9(12) COMP.                       
468100        05 WS-S151-0101-NOMBRE-I        PIC X(36).                            
468200        05 WS-S151-0101-CD-IND-ABSERV-I PIC 9(02) COMP.                       
468205*INI INDICADOR BNE ME13595                                                    
468300*       05 WS-S151-0101-SERVCITIDIREC-I PIC 9(02) COMP.                       
468305        05 WS-S151-0101-IND-BNE-I       PIC 9(01) COMP.                       
468310        05 WS-S151-0101-SERVCITIDIREC-I PIC 9(01) COMP.                       
468315*FIN INDICADOR BNE ME13595                                                    
468400        05 WS-S151-0101-CD-SUREF-CTE-I  PIC X(16).                            
468500        05 WS-S151-0101-CD-AUT-NIO-I    PIC X(16).                            
468600        05 WS-S151-0101-REF-ADC-01-I    PIC X(35).                            
468700        05 WS-S151-0101-REF-ADC-02-I    PIC X(35).                            
468800        05 WS-S151-0101-REF-ADC-03-I    PIC X(35).                            
468900        05 WS-S151-0101-REF-ADC-04-I    PIC X(35).                            
469000                                                                              
469100* CAMPOS PARA MANEJAR EL NUEVO FORMATO DEL S151                               
469200        05 WS-S151-0101-FORMATO-I       PIC  9(02)    COMP.                   
469300           88 WS-S151-0101-FTO-975-I    VALUE  1.                             
469400        05 WS-S151-0101-SERVICIO-ALERTA-I   PIC 9(04) COMP.                   
469500        05 WS-S151-0101-AGRPDESVPROD-I  PIC  9(04)    COMP.                   
469600        05 WS-S151-0101-AGRPDESVINST-I  PIC  9(04)    COMP.                   
469700        05 WS-S151-0101-SIRHDESV-I      PIC  9(04)    COMP.                   
469800        05 WS-S151-0101-LIBROCONT-I     PIC  9(02)    COMP.                   
469900        05 WS-S151-0101-CVEDESVIO1-I    PIC  9(04)    COMP.                   
470000        05 WS-S151-0101-GUIDESVIO1-I    PIC  9(04)    COMP.                   
470100        05 WS-S151-0101-CVEDESVIO2-I    PIC  9(04)    COMP.                   
470200        05 WS-S151-0101-GUIDESVIO2-I    PIC  9(04)    COMP.                   
470300        05 WS-S151-0101-CVEDESVIO3-I    PIC  9(04)    COMP.                   
470400        05 WS-S151-0101-GUIDESVIO3-I    PIC  9(04)    COMP.                   
470500        05 WS-S151-0101-CVEDESVIO4-I    PIC  9(04)    COMP.                   
470600        05 WS-S151-0101-GUIDESVIO4-I    PIC  9(04)    COMP.                   
470700        05 WS-S151-0101-CVEDESVIO5-I    PIC  9(04)    COMP.                   
470800        05 WS-S151-0101-GUIDESVIO5-I    PIC  9(04)    COMP.                   
470900        03 WS-S151-0101-FECVENCIMIENTO-I PIC 9(08)    COMP.                   
471000        03 WS-S151-0101-PLAZO-I          PIC  9(04)   COMP.                   
471100        03 WS-S151-0101-NODODEST-I       PIC  9(02)   COMP.                   
471200        03 WS-S151-0101-REFERORI-I       PIC  9(18)   COMP.                   
471300        03 WS-S151-0101-CVEINTERCMPNY-I  PIC  9(06)   COMP.                   
471400        03 WS-S151-0101-GRUPO-SOC-I      PIC  9(04)   COMP.                   
471500        03 WS-S151-0101-BIN-TAR-I        PIC  9(06)   COMP.                   
471600        03 WS-S151-0101-TIPOCHEQUE-I     PIC  9(02)   COMP.                   
471700        03 WS-S151-0101-MOTIVO-DEVOL-I   PIC  X(30).                          
471800        03 WS-S151-0101-NOM-CORT-BCO-I   PIC  X(20).                          
471900        03 WS-S151-0101-REF-CECOBAN-I    PIC  X(07).                          
472000        03 WS-S151-0101-NUM-ORD-PAGO-I   PIC  9(18)   COMP.                   
472100        03 WS-S151-0101-SALDO-FINAL-I    PIC S9(15)V99 COMP.                  
472200        03 WS-S151-0101-FILLER-ALFA-I    PIC  X(05).                          
472300        03 WS-S151-0101-NOM-BENEFI-I     PIC  X(50).                          
472400        03 WS-S151-0101-CVE-RASTREO-I    PIC  X(30).                          
472500        03 WS-S151-0101-FECH-PAGO-I      PIC  9(08)   COMP.                   
472600        03 WS-S151-0101-FILXAPL-REG2-I   PIC  X(636).                         
472700                                                                              
472800     03 WS-S151-SALDO-INI               PIC  S9(15)V99.                       
472900     03 WS-S151-SALDO-FIN               PIC  S9(15)V99.                       
473000     03 WS-S151-MANDA-SDOINI            PIC  9(01).                           
473100                                                                              
473200     03 WS-S151-IND-SEC                 PIC 9(02).                            
473300                                                                              
473400*01  WS-GEN-FECHA-MAQ                 PIC 9(6).                               
473500*01  WS-GEN-FECHA-MAQ-RED REDEFINES   WS-GEN-FECHA-MAQ.                       
473600*    02 WS-GEN-FECMAQ-AA              PIC 99.                                 
473700*    02 WS-GEN-FECMAQ-MM              PIC 99.                                 
473800*    02 WS-GEN-FECMAQ-DD              PIC 99.                                 
473900*                                                                             
474000*01  WS-GEN-HORA-HMSC-01.                                                     
474100*    03 WS-GEN-HORA-HMSC-N            PIC 9(8).                               
474200*    03 WS-GEN-HORA-HMSC REDEFINES    WS-GEN-HORA-HMSC-N.                     
474300*       05 WS-GEN-HORA-HMS-N          PIC 9(6).                               
474400*       05 WS-GEN-HORA-HMS REDEFINES  WS-GEN-HORA-HMS-N.                      
474500*          07 WS-GEN-HORA-HM-N        PIC 9(4).                               
474600*          07 WS-GEN-HORA-HM-NR REDEFINES WS-GEN-HORA-HM-N.                   
474700*             09 WS-GEN-HORA-H-N      PIC 9(2).                               
474800*             09 WS-GEN-HORA-M-N      PIC 9(2).                               
474900*          07 WS-GEN-HORA-S-N         PIC 9(2).                               
475000*       05 FILLER                     PIC 9(2).                               
475100$POP OMIT                                                                     
475200$SET OMIT = NOT S151SALDOS                                                    
475300*****************************************************************             
475400*     LIBRERIA (S151)S151/OBJECT/L002/REGISTRAS500              *             
475500*                                                               *             
475600* PARAMETROS DE ENTRADA PARA ENTRY POINT "CARGASALDOS"          *             
475700*                                                               *             
475800* WS-S151-0103-FUNCION:                                         *             
475900*         80= INICIO                                            *             
476000*         81= REGISTRO DE SALDOS                                *             
476100*         82= FIN                                               *             
476200*                                                               *             
476300* WS-S151-0103-SISTEMA   =  500              (FIJO POR INCLUDE) *             
476400* WS-S151-0103-PRODUCTO  =  NUMERO DE PRODUCTO                  *             
476500* WS-S151-0103-INSTRUM   =  NUMERO DE INSTRUMENTO               *             
476600* WS-S151-0103-CONTRATO  =  NUMERO DE CONTRATO                  *             
476700* WS-S151-0103-ID-EDOCTA:                                       *             
476800*              00=UNICAMENTE REGISTRO DE SALDOS                 *             
476900*              01=ACTIVOS Y GENERA EDO. CTA.                    *             
477000*              02=CANCELADO EN EL MES Y GENERA EDO. CTA.        *             
477100*              03=INACTIVO Y GENERA EDO. CTA.                   *             
477200*              04=INACTIVO Y NO SE GENERA EDO. CTA.             *             
477300*                                                               *             
477400* WS-S151-0103-FECHA-SDO = FECHA CONTABLE.                      *             
477500* WS-S151-0103-INICICLO  = FECHA INICIO DE CICLO                *             
477600* WS-S151-0103-FINCICLO  = FECHA FIN    DE CICLO                *             
477700* WS-S151-0103-FECULTMOV = FECHA DEL ULTIMO MOVIMIENTO          *             
477800* WS-S151-0103-ID-REG:                                          *             
477900*              00=ULTIMO  REGISTRO POR CONTRATO                 *             
478000*              01=EL SIGUIENTE REGISTRO PERTENECE AL CONTRATO   *             
478100*                 DE ESTE REGISTRO                              *             
478200*                                                               *             
478300* WS-S151-0103-DATOS      OCCURS 13 TIMES.                      *             
478400*   WS-S151-0103-CVE-DTO  = NUMERO DE CLAVE    (VER ANEXO       *             
478500*   WS-S151-0103-IMP-DTO  = IMPORTE DEL DATO    PARA CLAVES)    *             
478600*                                                               *             
478700* WS-S151-0103-DIAS-CICLO  = NUMERO DE DIAS EN EL CICLO         *             
478800* WS-S151-0103-DIAS-ANUAL  = NUMERO DE DIAS EN EL AµO           *             
478900* WS-S151-0103-TASA-NETA   = TASA DE REND NETA  EN EL CICLO     *             
479000* WS-S151-0103-TASA-BRUTA  = TASA DE REND BRUTA EN EL CICLO     *             
479100* WS-S151-0103-TASA-ANUAL  = TASA DE REND NETA EN EL AµO        *             
479200* WS-S151-0103-TERM-LB     = WS03-NUM-TERM-LB (FIJO POR INCLUDE)*             
479300* WS-S151-0103-ESCTACONC   = WS03-CTA-CONCENT (FIJO POR INCLUDE)*             
479400* WS-S151-0103-MONEDA      = B03-MONEDA                         *             
479500* WS-S151-0103-GENEDOCTA   = B03-GEN-EDOCTA                     *             
479600* WS-S151-0103-SERVCITIDIREC = B03-SERVCITIDIREC                *             
479700* WS-S151-0103-PROD-CTO-ORI  = PROD     CTA ORIG CTA GLOBAL L040*             
479800* WS-S151-0103-INST-CTO-ORI  = INST     CTA ORIG CTA GLOBAL L040*             
479900* WS-S151-0103-MONE-CTO-ORI  = MONE     CTA ORIG CTA GLOBAL L040*             
480000* WS-S151-0103-CTO-CTO-ORI   = CTO/TARJ CTA ORIG CTA GLOBAL L040*             
480100*                                                               *             
480200*****************************************************************             
480300* RESULTADO DEL CALL:                                           *             
480400*  WS-S151-0103-RESULT:                                         *             
480500*                 00=SALDO RECIBIDO OK                          *             
480600*                 02=FUNCION INVALIDA                           *             
480700*                 04=FECHA DE SALDOS DIFERENTE A                *             
480800*                    FECHA CONTABLE.                            *             
480900*                                                               *             
481000*                                                               *             
481100*****************************************************************             
481200 01  WS-S151-0103-SALDOS         WITH LOWER-BOUNDS.                           
481300     02 WS-S151-0103-FUNCION           PIC 9(02)        COMP.                 
481400     02 WS-S151-0103-SISTEMA           PIC 9(04)        COMP.                 
481500     02 WS-S151-0103-PRODUCTO          PIC 9(04)        COMP.                 
481600     02 WS-S151-0103-INSTRUM           PIC 9(04)        COMP.                 
481700     02 WS-S151-0103-CONTRATO          PIC 9(20)        COMP.                 
481800     02 WS-S151-0103-ID-EDOCTA         PIC 9(02)        COMP.                 
481900     02 WS-S151-0103-FECHA-SDO         PIC 9(08)        COMP.                 
482000     02 WS-S151-0103-INICICLO          PIC 9(08)        COMP.                 
482100     02 WS-S151-0103-FINCICLO          PIC 9(08)        COMP.                 
482200     02 WS-S151-0103-FECULTMOV         PIC 9(08)        COMP.                 
482300     02 WS-S151-0103-ID-REG            PIC 9(02)        COMP.                 
482400     02 WS-S151-0103-DATOS.                                                   
482489**                                                                            
482490** se cambia el occ de  13 A 30, (340 digitos mas, 170 bytes) **              
482491** se modifica filler final de 17 a 21 bytes                  **              
482500        03 WS-S151-0103-CVEIMP         OCCURS 30 TIMES.                       
482600           04 WS-S151-0103-CVE-DTO     PIC 9(04)        COMP.                 
482700           04 WS-S151-0103-IMP-DTO     PIC S9(13)V99    COMP.                 
482701**                                                                            
482800     02 WS-S151-0103-CORTES.                                                  
482900        03 WS-S151-0103-DIAS-CICLO     PIC 9(03)        COMP.                 
483000        03 WS-S151-0103-DIAS-ANUAL     PIC 9(03)        COMP.                 
483100        03 WS-S151-0103-TASA-NETA      PIC 9(04)V9(04)  COMP.                 
483200        03 WS-S151-0103-TASA-BRUTA     PIC 9(04)V9(04)  COMP.                 
483300        03 WS-S151-0103-TASA-ANUAL     PIC 9(04)V9(04)  COMP.                 
483400        03 WS-S151-0103-TERM-LB        PIC 9(04)        COMP.                 
483500        03 WS-S151-0103-ESCTACONC      PIC 9(02)        COMP.                 
483600        03 WS-S151-0103-MONEDA         PIC 9(02)        COMP.                 
483700     02 WS-S151-0103-GENEDOCTA         PIC 9.                                 
483720*INI INDICADOR BNE ME13595                                                    
483740     02 WS-S151-0103-IND-BNE           PIC 9(01)        COMP.                 
483800     02 WS-S151-0103-SERVCITIDIREC     PIC 9(01)        COMP.                 
483802*FIN INDICADOR BNE ME13595                                                    
483900     02 WS-S151-0103-PROD-CTO-ORI      PIC 9(04)        COMP.                 
484000     02 WS-S151-0103-INST-CTO-ORI      PIC 9(04)        COMP.                 
484100     02 WS-S151-0103-MONE-CTO-ORI      PIC 9(02)        COMP.                 
484200     02 WS-S151-0103-CTO-CTO-ORI       PIC 9(16)        COMP.                 
484300     02 WS-S151-0103-FILLER            PIC X(21).                             
484400                                                                              
484500 77  WS-S151-0103-RESULT               PIC S9(11)       BINARY.               
484600                                                                              
484700*****************************************************************             
484800$POP OMIT                                                                     
484900$SET OMIT = NOT S151TOTCVE                                                    
485000*****************************************************************             
485100*      LIBRERIA (S151)S151/OBJECT/L040/TOTXCVETRAS500           *             
485200*                                                               *             
485300* PARAMETROS DE ENTRADA:                                        *             
485400*  WS-S151-0301-FUNCION     (TOTALES POR )                      *             
485500*     00=INICIO                                                 *             
485600*     01=SISTEMA/BCO-ORIG/BCO-DEST                              *             
485700*     02=SISTEMA/BCO-ORIG/BCO-DEST/PROD                         *             
485800*     03=SISTEMA/BCO-ORIG/BCO-DEST/PROD/INST                    *             
485900*     04=SISTEMA/BCO-ORIG/BCO-DEST/MONEDA                       *             
486000*     05=SISTEMA/BCO-ORIG/BCO-DEST/PROD/MONEDA                  *             
486100*     06=SISTEMA/BCO-ORIG/BCO-DEST/PROD/INST/MONEDA             *             
486200*     07=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA                      *             
486300*     08=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA/PROD                 *             
486400*     09=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA/PROD/INST            *             
486500*     10=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA/MONEDA               *             
486600*     11=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA/PROD/MONEDA          *             
486700*     12=PROCESO/BCO-ORIG/BCO-DEST/SISTEMA/PROD/INST/MONEDA     *             
486800*                                                               *             
486900*  WS-S151-0301-FECHA    (HASTA LOS ULTIMOS 3 MESES DE LA       *             
487000*                         FECHA DE PROCESO)                     *             
487100*                                                               *             
487200*  WS-S151-0301-SISTEMA  = 500 (FIJO POR INCLUDE)               *             
487300*                                                               *             
487400*  WS-S151-0301-BCOORIG  = NUMERO DE BANCO ORIGEN               *             
487500*                                                               *             
487600*  WS-S151-0301-BCODEST  = NUMERO DE BANCO DESTINO              *             
487700*                                                               *             
487800*  WS-S151-0301-PRODUCTO = NUMERO DE PRODUCTO                   *             
487900*                                                               *             
488000*  WS-S151-0301-INSTRUMENTO = NUMERO DE INSTRUMENTO             *             
488100*                                                               *             
488200*  WS-S151-0301-PASO    = NUMERO DE PASO DONDE INICIA O         *             
488300*                         CONTINUA LA BUSQUEDA                  *             
488400*                                                               *             
488500*  WS-S151-0301-MONEDA  = NUMERO DE MONEDA DONDE INICIA O       *             
488600*                         CONTINUA LA BUSQUEDA                  *             
488700*                                                               *             
488800*  WS-S151-0301-CLAVE   = NUMERO DE CLAVE DONDE INICIA O        *             
488900*                         CONTINUA LA BUSQUEDA                  *             
489000*                                                               *             
489100*  WS-S151-0301-ESQCONT = NUMERO DE ESQUEMA CONTABLE DONDE      *             
489200*                         INICIA O CONTINUA LA BUSQUEDA         *             
489300*                                                               *             
489400*                                                               *             
489500*  PARAMETROS DE SALIDA:                                        *             
489600*   WS-S151-0301-IMPORTES     = OCCURS 100 TIMES.               *             
489700*     WS-S151-0301-PASO-S     = NUMERO DE PASO                  *             
489800*     WS-S151-0301-MONEDA-S   = NUMERO DE MONEDA                *             
489900*     WS-S151-0301-CLAVE-S    = NUMERO DE CLAVE                 *             
490000*     WS-S151-0301-ESQCONT-S  = NUMERO DE ESQUEMA CONTABLE      *             
490100*     WS-S151-0301-NUMMOVS-S  = NUMERO DE MOVIMIENTOS           *             
490200*     WS-S151-0301-IMPMOVS-S  = IMPORTE DE MOVIMIENTOS          *             
490300*     WS-S151-0301-BCOORIG-S  = NUMERO DE BANCO ORIGEN          *             
490400*     WS-S151-0301-BCODEST-S  = NUMERO DE BANCO DESTINO         *             
490500*                                                               *             
490600* DESPUES DE CADA CALL ACTUALIZA LOS CAMPOS:                    *             
490700*     WS-S151-0301-PASO    = WS-S151-0301-PASO-S                *             
490800*     WS-S151-0301-MONEDA  = WS-S151-0301-MONEDA-S              *             
490900*     WS-S151-0301-CLAVE   = WS-S151-0301-CLAVE-S               *             
491000*     WS-S151-0301-ESQCONT = WS-S151-0301-ESQCONT-S             *             
491100*     WS-S151-0301-BCOORIG = WS-S151-0301-BCOORIG-S             *             
491200*     WS-S151-0301-BCODEST = WS-S151-0301-BCODEST-S             *             
491300* PARA DECIDIR SI SE QUIERE OTRO CALL PARA MAS TOTALES          *             
491400*                                                               *             
491500*****************************************************************             
491600* RESULTADOS DEL CALL:                                          *             
491700* WS-S151-0301-RESULT = 00= SOLICITUD OK                        *             
491800*                       01= FUNCION INVALIDA                    *             
491900*                       02= FECHA DE SOLICITUD INVALIDA         *             
492000*                       03= SISTEMA SIN TOTALES                 *             
492100*                       04= PRODUCTO SIN TOTALES                *             
492200*                       05= INSTRUMENTO SIN TOTALES             *             
492300*                       06= BD DIARIA NO DISPONIBLE             *             
492400*                       07= BD DE SALDOS NO DISPONIBLE          *             
492500*                       99= FIN DE DATOS                        *             
492600*                                                               *             
492700*****************************************************************             
492800 01  WS-S151-0301-TOTCVES.                                                    
492900     02 WS-S151-0301-FUNCION          PIC 9(02)      COMP.                    
493000     02 WS-S151-0301-FECHA            PIC 9(08)      COMP.                    
493100     02 WS-S151-0301-SISTEMA          PIC 9(04)      COMP.                    
493200     02 WS-S151-0301-PRODUCTO         PIC 9(04)      COMP.                    
493300     02 WS-S151-0301-INSTRUMENTO      PIC 9(04)      COMP.                    
493400     02 WS-S151-0301-PASO             PIC 9(04)      COMP.                    
493500     02 WS-S151-0301-BCOORIG          PIC 9(03)      COMP.                    
493600     02 WS-S151-0301-BCODEST          PIC 9(03)      COMP.                    
493700     02 WS-S151-0301-MONEDA           PIC 9(04)      COMP.                    
493800     02 WS-S151-0301-CLAVE            PIC 9(04)      COMP.                    
493900     02 WS-S151-0301-ESQCONT          PIC 9(04)      COMP.                    
494000     02 WS-S151-0301-SALIDA.                                                  
494100        03 WS-S151-0301-IMPORTES      OCCURS 100 TIMES.                       
494200           04 WS-S151-0301-PASO-S     PIC 9(04)      COMP.                    
494300           04 WS-S151-0301-MONEDA-S   PIC 9(04)      COMP.                    
494400           04 WS-S151-0301-CLAVE-S    PIC 9(04)      COMP.                    
494500           04 WS-S151-0301-ESQCONT-S  PIC 9(04)      COMP.                    
494600           04 WS-S151-0301-NUMMOVS-S  PIC 9(08)      COMP.                    
494700           04 WS-S151-0301-IMPMOVS-S  PIC S9(13)V99  COMP.                    
494800           04 WS-S151-0301-BCOORIG-S  PIC 9(03)      COMP.                    
494900           04 WS-S151-0301-BCODEST-S  PIC 9(03)      COMP.                    
495000                                                                              
495100 77  WS-S151-0301-RESULT          PIC S9(11)  BINARY.                         
495200 77  WKS-88-TOTXCVETRAS500        PIC 99      COMP VALUE 0.                   
495300*****************************************************************             
495400$POP OMIT                                                                     
495500$SET OMIT = NOT S272LIBORDES                                                  
495600****************************************************************              
495700*    PARAMETROS PARA LA LIBRERIA S272LIBORDES                 **              
495800****************************************************************              
495900 01  WS-S272-0101-IDENTIDAD.                                                  
496000     02 WS-S272-0101-NIVEL        PIC 9(02) VALUE 02.                         
496100     02 WS-S272-0101-NIPENT       PIC 9(02) VALUE 04.                         
496200     02 WS-S272-0101-PRODUCTO     PIC 9(08) VALUE 00000001.                   
496300     02 WS-S272-0101-TIPELE       PIC 9(02) VALUE 06.                         
496400     02 WS-S272-0101-ELE          PIC 9(02) VALUE 01.                         
496500                                                                              
496600 01  WS-S272-0102-USUARIO-CTRL    PIC X(18) VALUE "S001".                     
496700                                                                              
496800 01  WS-S272-0103-NOMBRE-CTRL     PIC X(40) VALUE                             
496900                                  "S001/FILE/ARCH/CTRL".                      
497000                                                                              
497100 01  WS-S272-0104-DISCO-CTRL      PIC X(18) VALUE "S067REMESAS".              
497200                                                                              
497300 77  WS-S272-RESULT               PIC 9(11) BINARY VALUE 0.                   
497400                                                                              
497500****************************************************************              
497600$POP OMIT                                                                     
497700$SET OMIT = NOT S408LINCRED                                                   
497800*****************************************************************             
497900*                LIBRERIA(S408) LINCRED                         *             
498000*                                                               *             
498100*  (S408)S408/OBJECT/L011/LINCRED   ON CREDITO                  *             
498200*  (S408)S408/OBJECT/L018/CONSULTAS ON CREDITO                  *             
498300*                                                               *             
498400*  SEUDONIMO EN CONTROL DE VERSIONES   "S408L011LCRD"           *             
498500*  SEUDONIMO EN CONTROL DE VERSIONES   "S408L018CONS"           *             
498600*                                                               *             
498700*  ENTRY POINT "CONTROL"                            FUNCION     *             
498800*   HABILITA.......................................... 10       *             
498900*   DESHABILITA....................................... 20       *             
499000*   AVISO DEL S500 (LINEAS DE SERVICIO) .............. 36       *             
499100*   AVISO DEL S500.................................... 37       *             
499200*                                                               *             
499300*  ENTRY POINT "OPERCRED"                                       *             
499400*   CONSULTA SIMPLE................................... 11       *             
499500*   CONSULTA Y COMPARA................................ 12       *             
499600*   CONSULTA TOTALES DEL DIA.......................... 13       *             
499700*   DISPOSICION NORMAL................................ 23       *             
499800*   DISPOSICION FORZADA............................... 24       *             
499900*   DISPOSICION POR DEVOLUCION........................ 25       *             
500000*   DISPOSICION NORMAL (LINEAS DE SERVICIO) .......... 26       *             
500100*   AVISO DE DEVOLUCION (LINEAS DE SERVICIO) ......... 30       *             
500200*   PAGO (ABONO)...................................... 35       *             
500300*   ELIM UNA TRANSACCION DEL DIA...................... 42       *             
500400*   ELIM UNA TRANSACCION DEL DIA (LINEAS DE SERVICIO). 43       *             
500500*   ELIM HASTA PASO/SUBPROCESO(INCLUIDOS)............. 45       *             
500600*   ELIM HASTA PASO(INCLUIDO)......................... 46       *             
500700*   ELIM HASTA AUTORIZACION(NO INCLUIDA) Y SUBPROCESO. 48       *             
500702*   BLOQUEO DE SALDO.................................. 53       *             
500704*   DESBLOQUEO DE SALDO............................... 54       *             
500800*****************************************************************             
500900*                                                               *             
501000*  LISTA DE RESULTADOS DEL LLAMADO (WS-S408-STATUS)             *             
501100*  00    OPERACION EXISTOSA                                     *             
501200*  01    FUNCION YA REALIZADA                                   *             
501300*  02    NUMERO DE SISTEMA LLAMADOR EN CEROS                    *             
501400*  03    NO HABILITO LIBRERIA POR ESTAR EN LATENCIA,            *             
501500*        LA LIBRERIA ES ACTIVADA PERO SE QUEDA DESHABILITADA    *             
501600*  04    NUMERO DE PASO LLAMADOR EN CEROS                       *             
501700*  05    NO MANDO MENSAJE DE FIN DE DIA EL S500                 *             
501800*  06    CONTRATO INEXISTENTE                                   *             
501900*  07    FONDOS INSUFICIENTES                                   *             
502000*  08    NO EXISTE REGISTRO DE TOTALES                          *             
502100*  09    SUC PROMOTORA O SUC OPERADORA EN CEROS                 *             
502200*  10    FECHA ILEGAL(NO SE USA)                                *             
502300*  11    IMPORTE EN CEROS                                       *             
502400*  12    CREDITO CASTIGADO                                      *             
502500*  13    AUTORIZACION INEXISTENTE                               *             
502600*  14    TRANSACCION YA ELIMINADA O ELIMINACION MISMA           *             
502700*  15    EL NUMERO DE CONTRATO NO COINCIDE                      *             
502800*  16    EL IMPORTE NO COINCIDE                                 *             
502802*  33    TRANSACCION FUERA DE HORARIO                           *             
502900*  51    REINICIO: INCONGRUENCIA AL RECUPERAR CANCELACION 45    *             
503000*  52    REINICIO: INCONGRUENCIA AL RECUPERAR CANCELACION 48    *             
503100*  53    REINICIO: CLAVE DE CANCELACION ILEGAL AL RECUPERAR     *             
503200*  58    FIN DE DIA YA HECHO, ENCONTRO GLOBALES EN FUNCION      *             
503300*        FIN DE DIA                                             *             
503400*  64    ERROR AL CARGAR TASAS EN LIBRERIA DEL S080             *             
503500*  65    PRODUCTO NO COINCIDE CON EL CONTRATO                   *             
503600*  67    PRODUCTO INEXISTENTE                                   *             
503700*  68    MONEDA INVALIDA                                        *             
503800*  70    DIA DE CORTE INVALIDO                                  *             
503900*  73    LIBRERIA HABILITADA BAJO USER DIFERENTE DE S408        *             
504000*  74    INICIO DIA (ESTADO 0,4) CON LOGS PRESENTES             *             
504100*  75    ERROR DMS AL DAR BEGIN TRANSACTION                     *             
504200*  77    INCONGRUENCIA AL RECONSTRUIR MOVIMIENTO                *             
504300*  81    NO EXISTE LA LOG1                                      *             
504400*  82    LA LOG1 CONTIENE CSI O FECHA ILEGAL EN REG 0           *             
504500*  83    NO EXISTE LA LOG2 (EN PACK LOGS)                       *             
504600*  84    LA LOG2 CONTIENE CSI O FECHA ILEGAL EN REG 0           *             
504700*  85    LOG1 Y LOG2 DE DIFERENTE TAMAµO                        *             
504800*  86    ULTIMO AUTO EN LOGS DIFERENTE DE ULTIMO EN BASE(B14)   *             
504900*  87    REINICIO: ULTIMO AUTO EN B14 DIFERENTE                 *             
505000*                  DE REINICIO (B91)                            *             
505100*  88    REINICIO: ULTIMO AUTO EN LOGS DIFERENTE                *             
505200*                  DE ULTIMO AUTO EN B14                        *             
505300*  89    REINICIO: TRANSACCION EN RECUPERACION DIO UN ERROR     *             
505400*                  (VER DISPLAY)                                *             
505500*  90    FUNCION ILEGAL                                         *             
505600*  91    LA LIBRERIA YA ESTA HABILITADA                         *             
505700*  92    ERROR AL ABRIR LA BASE                                 *             
505800*  93    ERROR AL ABRIR GLOBALES                                *             
505900*  94    FECHA DE PROCESO INVALIDA                              *             
506000*  95    INICIO DE DIA CON AUTORIZACION DIFERENTE DE 0 (B14)    *             
506100*  96    LIBRERIA NO HABILITADA                                 *             
506200*  97    ERROR AL CERRAR LA BASE                                *             
506300*  98    CLIENTE EN CEROS                                       *             
506400*  99    ERROR FATAL,  PUEDE SUCEDER POR:                       *             
506500*           *- ERROR DMSII EN ESTADO DE TRANSACCION             *             
506600*                    O AL BUSCAR UN REGISTRO.                   *             
506700*               REVISAR EN EL DISPLAY QUE SE EMITE, EL NUMERO   *             
506800*               DE LINEA DE LA FUENTE DONDE SE PRODUJO EL ERROR *             
506900*               ASI COMO EL TIPO Y CATEGORIA DEL ERROR Y EL     *             
507000*               NUMERO DE ESTRUCTURA.                           *             
507100*           *-  HUBO MAS DE UN MILLON DE TRANSACCIONES EN       *             
507200*               UN DIA (SE AGOTA EL NUMERO DE AUTORIZACION).    *             
507202* 151    ERROR EN LLAMADO AL S151                               *             
507300*****************************************************************             
507400*    PARAMETROS DE ENTRADA-SALIDA DE LA LIBRERIA                *             
507500*                                                               *             
507600*   01) WS-S408-FUNCION......FUNCION REQUERIDA                  *             
507700*   02) WS-S408-SISTEMA......SISTEMA ORIGEN                     *             
507800*   03) WS-S408-PASO.........PASO LLAMADOR                      *             
507900*   04) WS-S408-FECPRO.......FECHA DE PROCESO                   *             
508000*   05) WS-S408-SUCOPER......SUCURSAL/OPERADORA                 *             
508100*   06) WS-S408-CAJA.........CAJA OPERADORA                     *             
508200*   07) WS-S408-CONTRATO.....NUM.CONTRATO                       *             
508300*   08) WS-S408-NUMLIN.......NUM.LINEA                          *             
508400*   09) WS-S408-CLIENTE......NUM.CLIENTE                        *             
508500*   10) WS-S408-SUCPROM......SUC/PROMOTORA                      *             
508600*   11) WS-S408-PRD..........NUM.PRODUCTO                       *             
508700*   12) WS-S408-INS..........NUM.INSTRUMENTO                    *             
508800*   13) WS-S408-RECOVERY.....CLAVE DE RECOVERY                  *             
508900*                            00=NO EN ESTADO DE RECUPERACION    *             
509000*                            01=SI EN ESTADO DE RECUPERACION    *             
509100*   14) WS-S408-AUTS500......AUTORIZACION SIST/LLAMADOR         *             
509200*   15) WS-S408-FECVA........FECHA VALOR                        *             
509300*   16) WS-S408-TIPOTRAN.....TIPO DE TRANSACCION                *             
509400*   17) WS-S408-AUTS408......AUTORIZACION S408                  *             
509500*   18) WS-S408-TIPOCTA......TIPO DE CUENTA                     *             
509600*                                                               *             
509700*   19) WS-S408-IMPORTE......IMPORTE DEL MOVIMIENTO             *             
509800*   20) WS-S408-IMPAUT.......IMPORTE DE AUTORIZACIONES          *             
509900*   21) WS-S408-IMP-EXCEDIDO...EXCESO(CARGO/ABONO)              *             
510000*   22) WS-S408-LIMITE.......LIMITE DE LINEA                    *             
510100*   23) WS-S408-SALDO........SALDO DISPUESTO                    *             
510200*   24) WS-S408-IMPXDISP.....SALDO POR DISPONER                 *             
510300*   25) WS-S408-IMPORIG......IMPORTE ORIGINAL DEL CHEQUE        *             
510400*   26) WS-S408-SECTOR.......NUM. SECTOR                        *             
510500*   27) WS-S408-MONEDA.......TIPO DE MONEDA                     *             
510600*   28) WS-S408-DIACORTE.....DIA DE CORTE                       *             
510700*   29) WS-S408-TIPOPROCESO..TIPO DE PROCESO                    *             
510800*   30) WS-S408-SUBPROCESO...SUB-PROCESO                        *             
510900*   31) WS-S408-FECHATRA.....FECHA DE TRANSAC.P/C X HRS         *             
511000*   32) WS-S408-HORATRA......HORA PARA CALCULO X HORA           *             
511100*   33) WS-S408-REFTRA.......REFE PARA CALCULO X HORA           *             
511200*   34) WS-S408-BANCO........NUMERO DE BANCO                    *             
511300*   35) WS-S408-TASA1........TASA 1 PARA LINEAS DE SERV.        *             
511400*   36) WS-S408-TASA2........TASA 2 PARA LINEAS DE SERV.        *             
511500*   37) WS-S408-RESEXIST.....RESULT DE EXISTENCIA DE LINEAS     *             
511600*   38) WS-S408-LINERROR.....NUMERO DE LINEA DE ERROR           *             
511700*   39) WS-S408-IMPDEVOL.....IMPORTE DE DEVOLUCIONES            *             
511800*   40) WS-S408-NUMDEVOL.....NUMERO DE DEVOLUCIONES             *             
511900*   41) WS-S408-FILLER1......CAMPO DISPONIBLE                   *             
512000*                                                               *             
512100*       REDEFINICION A PARTIR DE WS-S408-IMPORTE(19)            *             
512200*                                                               *             
512300*   42) WS-S408-NUMCAR.......NUMERO  DE CARGOS                  *             
512400*   43) WS-S408-IMPCAR.......IMPORTE DE CARGOS                  *             
512500*   44) WS-S408-NUMABO.......NUMERO  DE ABONOS                  *             
512600*   45) WS-S408-IMPABO.......IMPORTE DE ABONOS                  *             
512700*   46) WS-S408-FILLER.......CAMPO DISPONIBLE                   *             
512800*                                                               *             
512900*       CAMPO DE RESPUESTA DE LIBRERIA NIVEL 77                 *             
513000*                                                               *             
513100*   47) WS-S408-STATUS.......RESULTADO DE LLAMADO               *             
513200*                                                               *             
513300*       NOTA:FORMATO  DE FECHAS (AAMMDD)                        *             
513400*---------------------------------------------------------------*             
513500*  10: HABILITA                                                 *             
513600*      ENTRADA:                                                 *             
513700*   01)  WS-S408-FUNCION = 10                                   *             
513800*   04)  WS-S408-FECPRO  = FECHA DE PROCESO                     *             
513900*                                                               *             
514000*      SALIDA :                                                 *             
514100*   47)  WS-S408-STATUS--> RESULTADO                            *             
514200*        (0, 3, 51, 52, 53, 58, 73, 74, 75,(81-95) )            *             
514300*---------------------------------------------------------------*             
514400*  20: DESHABILITA                                              *             
514500*      ENTRADA:                                                 *             
514600*   01)  WS-S408-FUNCION  = 20                                  *             
514700*                                                               *             
514800*      SALIDA:                                                  *             
514900*   47)  WS-S408-STATUS----> RESULTADO                          *             
515000*        ( 0, 5, 73, 75, 90, 96, 97)                            *             
515100*---------------------------------------------------------------*             
515200*  36: AVISO DEL S500 (LINEAS DE SERVICIO)                      *             
515300*      ENTRADA:                                                 *             
515400*   01) WS-S408-FUNCION  = 36                                   *             
515500*                                                               *             
515600*      SALIDA:                                                  *             
515700*   47)  WS-S408-STATUS----> RESULTADO                          *             
515800*        ( 0, 1, 73, 75, 90, 96)                                *             
515900*---------------------------------------------------------------*             
516000*  37: AVISO DEL S500                                           *             
516100*      ENTRADA:                                                 *             
516200*   01) WS-S408-FUNCION  = 37                                   *             
516300*                                                               *             
516400*      SALIDA:                                                  *             
516500*   47)  WS-S408-STATUS----> RESULTADO                          *             
516600*        ( 0, 1, 73, 75, 90, 96)                                *             
516700*---------------------------------------------------------------*             
516800*  11: CONSULTA DE SALDO (SIMPLE)                               *             
516900*      ENTRADA:                                                 *             
517000*   01) WS-S408-FUNCION  = 11                                   *             
517100*   02) WS-S408-SISTEMA  = NUM/SISTEMA                          *             
517200*   03) WS-S408-PASO     = NUM/PASO                             *             
517300*   04) WS-S408-FECPRO   = FECHA/PROCESO                        *             
517400*   07) WS-S408-CONTRATO = NUMERO DE CONRATO                    *             
517500*   08) WS-S408-NUMLIN   = NUMERO DE LINEA(FIJO X INCLUDE=00)   *             
517600*   11) WS-S408-PRD      = NUMERO/PRODUCTO                      *             
517700*   12) WS-S408-INS      = NUMERO/INSTRUMENTO                   *             
517800*   16) WS-S408-TIPOTRAN = 0                                    *             
517900*   18) WS-S408-TIPOCTA  = 0                                    *             
518000*   27) WS-S408-MONEDA   = NUMERO/MONEDA                        *             
518100*                                                               *             
518200*      SALIDA:                                                  *             
518300*   04) WS-S408-FECPRO............FECHA DE PRIMER SOBREGIRO     *             
518400*   19) WS-S408-IMPORTE...........GASTOS DE COBRANZA E IVA      *             
518500*   20) WS-S408-IMPAUT............MORATORIOS E IVA              *             
518600*   21) WS-S408-IMP-EXCEDIDO......INTERESES NORMALES  E IVA     *             
518700*   22) WS-S408-LIMITE............LIMITE DE CREDITO             *             
518800*   23) WS-S408-SALDO.............SALDO DISPUESTO               *             
518900*   24) WS-S408-IMPXDISP..........SALDO POR DISPONER            *             
519000*   25) WS-S408-IMPORIG...........SALDO TOTAL                   *             
519100*   31) WS-S408-FECHATRA..........FECHA DE ULTIMO SOBREGIRO     *             
519200*   34) WS-S408-LIN-CTOINV .......CONTRATO DE INVERSION         *             
519300*   35) WS-S408-LIN-NUMINV .......NUMERO DE INVERSION           *             
519400*   37) WS-S408-RESEXIST..........INDICADOR PARA S500           *             
519500*                                  0=NINGUNA                    *             
519600*                                  1=DISPOSICION Y PAGO         *             
519700*                                  2=SOLO PAGO                  *             
519800*                                 99=IGNORAR                    *             
519900*   39) WS-S408-IMPDEVOL..........IMPORTE DE DEVOLUCIONES       *             
519910*   48) WS-S408-BLOQGCE...........SALDO BLOQUEADO GCE S408      *             
520000*   47) WS-S408-STATUS............RESULTADO                     *             
520100*       ( 0, 2, 4, 6, 64, 65, 67, 68, 73, 90, 96)               *             
520200*---------------------------------------------------------------*             
520300*  12: CONSULTA Y COMPARA                                       *             
520400*      ENTRADA:                                                 *             
520500*   01) WS-S408-FUNCION  = 12                                   *             
520600*   02) WS-S408-SISTEMA  = NUM/SISTEMA                          *             
520700*   03) WS-S408-PASO     = NUM/PASO                             *             
520800*   04) WS-S408-FECPRO   = FECHA/PROCESO                        *             
520900*   07) WS-S408-CONTRATO = NUMERO DE CONRATO                    *             
521000*   11) WS-S408-PRD      = NUMERO/PRODUCTO                      *             
521100*   12) WS-S408-INS      = NUMERO/INSTRUMENTO                   *             
521200*   16) WS-S408-TIPOTRAN = 0                                    *             
521300*   18) WS-S408-TIPOCTA  = 0                                    *             
521400*   19) WS-S408-IMPORTE  = IMPORTE DEL MOVIMIENTO               *             
521500*   20) WS-S408-IMPAUT   = IMPORTE DE AUTORIZACIONES            *             
521600*   27) WS-S408-MONEDA   = NUMERO/MONEDA                        *             
521700*                                                               *             
521800*      SALIDA :                                                 *             
521900*   21) WS-S408-IMP-EXCEDIDO....EXCESO DEL SALDO                *             
522000*   37) WS-S408-RESEXIST..........INDICADOR PARA S500           *             
522100*                                  0=NINGUNA                    *             
522200*                                  1=DISPOSICION Y PAGO         *             
522300*                                  2=SOLO PAGO                  *             
522400*                                 99=IGNORAR                    *             
522500*   47) WS-S408-STATUS............RESULTADO                     *             
522600*       ( 0, 2, 4, 6, 7, 64, 65, 67, 68, 73, 90, 96)            *             
522700*---------------------------------------------------------------*             
522800*  13: CONSULTA DE TOTALES DEL DIA                              *             
522900*      ENTRADA:                                                 *             
523000*   01) WS-S408-FUNCION     = 13                                *             
523100*   02) WS-S408-SISTEMA     = NUM/SISTEMA                       *             
523200*   03) WS-S408-PASO        = NUM/PASO                          *             
523300*   04) WS-S408-FECPRO      = FECHA/PROCESO                     *             
523400*   11) WS-S408-PRD         = NUMERO/PRODUCTO                   *             
523500*   12) WS-S408-INS         = NUMERO/INSTRUMENTO                *             
523600*   16) WS-S408-TIPOTRAN    = 0                                 *             
523700*   18) WS-S408-TIPOCTA     = 0                                 *             
523800*   27) WS-S408-MONEDA      = NUMERO/MONEDA                     *             
523900*   29) WS-S408-TIPOPROCESO =TIPO DE PROCESO                    *             
524000*                                                               *             
524100*      SALIDA :                                                 *             
524200*   42)  WS-S408-NUMCAR--------> NUMERO DE CARGOS               *             
524300*   43)  WS-S408-IMPCAR--------> IMPORTE DE CARGOS              *             
524400*   44)  WS-S408-NUMABO--------> NUMERO DE ABONOS               *             
524500*   45)  WS-S408-IMPABO--------> IMPORTE DE ABONOS              *             
524600*   47)  WS-S408-STATUS--------> RESULTADO                      *             
524700*        ( 0, 2, 4, 64, 68, 73, 90, 96)                         *             
524800*---------------------------------------------------------------*             
524900*  16: CONSULTA SIMPLE (LINEAS DE SERVICIO)                     *             
525000*      ENTRADA:                                                 *             
525100*   01) WS-S408-FUNCION       = 16                              *             
525200*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
525300*   03) WS-S408-PASO          = NUM/PASO                        *             
525400*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
525500*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
525600*   08) WS-S408-NUMLIN        = NUM.LINEA (SI SE CONS. EN ESPEC.*             
525700*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
525800*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
525900*   16) WS-S408-TIPOTRAN      = TIPO TRAN (1 COBRO INMEDIATO    *             
526000*                                          2 COMPRA DE GIROS)   *             
526100*   18) WS-S408-TIPOCTA       = 0                               *             
526200*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
526300*                                                               *             
526400*      SALIDA :                                                 *             
526500*   04) WS-S408-FECPRISOB     = FECHA DE PRIMERA DISPOSICION    *             
526600*   22) WS-S408-LIN-LIMITE    = LIMITE DE LINEA DE SERVICIO     *             
526700*   23) WS-S408-LIN-SALDO     = SALDO DISPUESTO                 *             
526800*   24) WS-S408-LIN-IMPXDISP  = SALDO POR DISPONER              *             
526900*   25) WS-S408-MOV-SDOTOTAL  = SALDO TOTAL                     *             
527000*   31) WS-S408-FECULTSOB     = FECHA DE ULTIMA DISPOSICION     *             
527100*   39) WS-S408-LIN-IMPDEVOL  = IMPORTE DE DEVOLUCIONES         *             
527200*   40) WS-S408-LIN-NUMDEVOL  = NUMERO DE DEVOLUCIONES          *             
527300*   47) WS-S408-STATUS        = RESULTADO DE LLAMADO            *             
527400*       ( 0, 2, 4, 6, 64, 65, 67, 68, 73, 90, 96)               *             
527500*                                                               *             
527600*---------------------------------------------------------------*             
527700*  23: DISPOSICION (CARGO NORMAL)                               *             
527800*      ENTRADA:                                                 *             
527900*   01) WS-S408-FUNCION       = 23                              *             
528000*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
528100*   03) WS-S408-PASO          = NUM/PASO                        *             
528200*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
528300*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
528400*   06) WS-S408-CAJA          = CAJA/OPERADORA                  *             
528500*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
528600*   10) WS-S408-SUCPROMB      = SUCURSAL/PROMOTORA              *             
528700*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
528800*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
528900*   16) WS-S408-TIPOTRAN      = 0                               *             
529000*   18) WS-S408-TIPOCTA       = 0                               *             
529100*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
529200*   20) WS-S408-IMPAUT        = IMPORTE DE AUTORIZACIONES       *             
529300*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
529400*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
529500*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
529600*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
529700*                                                               *             
529800*      SALIDA :                                                 *             
529900*   17) WS-S408-AUTS408-----------> AUTORIZACION S408           *             
530000*   21) WS-S408-IMP-EXCEDIDO------> EXCESO(CARGO/ABONO)         *             
530100*   22) WS-S408-LIMITE------------> LIMITE DE LINEA             *             
530200*   23) WS-S408-SALDO-------------> SALDO DISPUESTO             *             
530300*   24) WS-S408-IMPXDISP----------> SALDO POR DISPONER          *             
530400*   37) WS-S408-RESEXIST----------> INDICADOR PARA S500         *             
530500*                                    0=NINGUNA                  *             
530600*                                    1=DISPOSICION Y PAGO       *             
530700*                                    2=SOLO PAGO                *             
530800*                                   99=IGNORAR                  *             
530900*   47) WS-S408-STATUS------------> RESULTADO                   *             
531000*       ( 0,2,4,7,9,11,64,65,67,68,73,90,94,96,99)              *             
531100*---------------------------------------------------------------*             
531200*  24: DISPOSICION (CARGO FORZADO)                              *             
531300*      ENTRADA:                                                 *             
531400*   01) WS-S408-FUNCION       = 24                              *             
531500*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
531600*   03) WS-S408-PASO          = NUM/PASO                        *             
531700*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
531800*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
531900*   06) WS-S408-CAJA          = CAJA/OPERADORA                  *             
532000*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
532100*   09) WS-S408-CLIENTE       = NUM.CLIENTE                     *             
532200*   10) WS-S408-SUCPROMB      = SUCURSAL/PROMOTORA              *             
532300*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
532400*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
532500*   16) WS-S408-TIPOTRAN      = 0                               *             
532600*   18) WS-S408-TIPOCTA       = TIPO DE CUENTA                  *             
532700*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
532800*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
532900*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
533000*   28) WS-S408-DIACORTE      = DIA DE CORTE                    *             
533100*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
533200*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
533300*                                                               *             
533400*      SALIDA :                                                 *             
533500*   08) WS-S408-NUMLIN-------> INDICADOR UTILIZACION LINEA      *             
533600*                              AUTOMATICA(=1)                   *             
533700*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
533800*   20) WS-S408-IMPAUT-------> IMP. DISPUESTO DE LA LINEA AUT.  *             
533900*   22) WS-S408-LIMITE-------> LIMITE DE LINEA                  *             
534000*   23) WS-S408-SALDO--------> SALDO DISPUESTO                  *             
534100*   24) WS-S408-IMPXDISP-----> SALDO POR DISPONER               *             
534200*   37) WS-S408-RESEXIST-----> INDICADOR PARA S500              *             
534300*                               0=NINGUNA                       *             
534400*                               1=DISPOSICION Y PAGO            *             
534500*                               2=SOLO PAGO                     *             
534600*                              99=IGNORAR                       *             
534700*   47) WS-S408-STATUS-------> RESULTADO                        *             
534800*       ( 0,2,4,6,7,9,11,64,65,67,68,70,73,90,94,96,98,99)      *             
534900*---------------------------------------------------------------*             
535000*  25: DISPOSICION POR DEVOLUCION                               *             
535100*      ENTRADAS:                                                *             
535200*   01) WS-S408-FUNCION       = 25                              *             
535300*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
535400*   03) WS-S408-PASO          = NUM/PASO                        *             
535500*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
535600*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
535700*   06) WS-S408-CAJA          = CAJA/OPERADORA                  *             
535800*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
535900*   09) WS-S408-CLIENTE       = NUM.CLIENTE                     *             
536000*   10) WS-S408-SUCPROMB      = SUCURSAL/PROMOTORA              *             
536100*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
536200*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
536300*   16) WS-S408-TIPOTRAN      = TIPO DE TRANSACCION             *             
536400*                               1=COBRO INMEDIATO               *             
536500*                               2=SALVO BUEN COBRO              *             
536600*                               3=DOCUMENTOS SIN TRANSM.        *             
536700*   18) WS-S408-TIPOCTA       = TIPO DE CUENTA                  *             
536800*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
536900*   25) WS-S408-IMPORIG       = IMPORTE ORIGINAL DEL CHEQUE     *             
537000*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
537100*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
537200*   28) WS-S408-DIACORTE      = DIA DE CORTE                    *             
537300*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
537400*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
537500*   33) WS-S408-REFTRA        = NUM. REFERENCIA DEL CHEQUE      *             
537600*   34) WS-S408-BANCO         = NUMERO DE BANCO                 *             
537700*                                                               *             
537800*      SALIDAS:                                                 *             
537900*   08) WS-S408-NUMLIN-------> INDICADOR UTILIZACION LINEA      *             
538000*                              AUTOMATICA(=1)                   *             
538100*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
538200*   20) WS-S408-IMPAUT-------> IMP. DISPUSTO DE LA LINEA AUT.   *             
538300*   22) WS-S408-LIMITE-------> LIMITE DE LINEA                  *             
538400*   23) WS-S408-SALDO--------> SALDO DISPUESTO                  *             
538500*   24) WS-S408-IMPXDISP-----> SALDO POR DISPONER               *             
538600*   37) WS-S408-RESEXIST-----> INDICADOR PARA S500              *             
538700*                               0=NINGUNA                       *             
538800*                               1=DISPOSICION Y PAGO            *             
538900*                               2=SOLO PAGO                     *             
539000*                              99=IGNORAR                       *             
539100*   47) WS-S408-STATUS-------> RESULTADO                        *             
539200*       ( 0,2,4,6,7,9,11,64,65,67,68,70,73,90,94,96,98,99)      *             
539300*---------------------------------------------------------------*             
539400*  26: DISPOSICION NORMAL (LINEAS DE SERVICIO)                  *             
539500*      ENTRADA:                                                 *             
539600*   01) WS-S408-FUNCION       = 26                              *             
539700*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
539800*   03) WS-S408-PASO          = NUM/PASO                        *             
539900*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
540000*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
540100*   06) WS-S408-CAJA          = CAJA OPERADORA                  *             
540200*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
540300*   10) WS-S408-SUCPROM       = SUC/PROMOTORA                   *             
540400*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
540500*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
540600*   16) WS-S408-TIPOTRAN      = TIPO TRAN (1 COBRO INMEDIATO    *             
540700*                                          2 COMPRA DE GIROS)   *             
540800*   18) WS-S408-TIPOCTA       = 0                               *             
540900*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
541000*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
541100*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
541200*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
541300*                                                               *             
541400*      SALIDA :                                                 *             
541500*   17) WS-S408-AUTS408       = AUTORIZACION S408               *             
541600*   21) WS-S408-IMP-EXCEDIDO  = EXCESO(CARGO)                   *             
541700*   22) WS-S408-LIN-LIMITE    = LIMITE DE LINEA                 *             
541800*   23) WS-S408-LIN-SALDO     = SALDO DISPUESTO                 *             
541900*   24) WS-S408-LIN-IMPXDISP  = SALDO POR DISPONER              *             
542000*   35) WS-S408-LIN-TASAOTRBAN = TASA OTROS BANCOS              *             
542100*   47) WS-S408-STATUS        = RESULTADO                       *             
542200*       ( 0, 2, 6, 7, 9, 11, 64, 65, 67, 68, 73, 90, 94, 96, 99)*             
542300*---------------------------------------------------------------*             
542400*  30: AVISO DE DEVOLUCION (LINEAS DE SERVICIO)                 *             
542500*      ENTRADA:                                                 *             
542600*   01) WS-S408-FUNCION       = 30                              *             
542700*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
542800*   03) WS-S408-PASO          = NUM/PASO                        *             
542900*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
543000*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
543100*   06) WS-S408-CAJA          = CAJA OPERADORA                  *             
543200*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
543300*   10) WS-S408-SUCPROM       = SUC/PROMOTORA                   *             
543400*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
543500*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
543600*   16) WS-S408-TIPOTRAN      = TIPO TRAN (1 COBRO INMEDIATO    *             
543700*                                          2 COMPRA DE GIROS)   *             
543800*   18) WS-S408-TIPOCTA       = TIPO CTA. (1 INCREMENTAR        *             
543900*                                         (2 ELIMINAR           *             
544000*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
544100*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
544200*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
544300*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
544400*                                                               *             
544500*      SALIDA :                                                 *             
544600*   47) WS-S408-STATUS        = RESULTADO                       *             
544700*       ( 0, 2, 6, 9, 11, 65, 67, 68, 73, 90, 94, 96, 99)       *             
544800*---------------------------------------------------------------*             
544900*  35: PAGO L.C.   (ABONO)                                      *             
545000*      ENTRADA:                                                 *             
545100*   01) WS-S408-FUNCION       = 35                              *             
545200*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
545300*   03) WS-S408-PASO          = NUM/PASO                        *             
545400*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
545500*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
545600*   06) WS-S408-CAJA          = CAJA/OPERADORA                  *             
545700*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
545800*   10) WS-S408-SUCPROMB      = SUCURSAL/PROMOTORA              *             
545900*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
546000*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
546100*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
546200*   26) WS-S408-SECTOR        = NUM. SECTOR                     *             
546300*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
546400*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
546500*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
546600*                                                                             
546700*      SALIDA:                                                  *             
546800*   17) WS-S408-AUTS408-----------> AUTORIZACION S408           *             
546900*   20) WS-S408-IMPAUT------------> IMP. PAGADO A LIN. DE DEVOL *             
547000*   21) WS-S408-IMP-EXCEDIDO------> EXCEDIDO DEL ABONO          *             
547100*   22) WS-S408-LIMITE------------> LIMITE DE CREDITO           *             
547200*   23) WS-S408-SALDO-------------> SALDO DISPUESTO             *             
547300*   24) WS-S408-IMPXDISP----------> SALDO POR DISPONER          *             
547400*   37) WS-S408-RESEXIST----------> INDICADOR PARA S500         *             
547500*                                    0=NINGUNA                  *             
547600*                                    1=DISPOSICION Y PAGO       *             
547700*                                    2=SOLO PAGO                *             
547800*                                   99=IGNORAR                  *             
547900*   47) WS-S408-STATUS------------> RESULTADO                   *             
548000*       ( 0,2,4,6,9,11,12,64,65,67,68,73,90,94,96,99)           *             
548100*---------------------------------------------------------------*             
548200*  42: ELIMINACION DE CUALQUIER TRANSACCION                     *             
548300*      ENTRADA:                                                 *             
548400*   01) WS-S408-FUNCION       = 42                              *             
548500*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
548600*   03) WS-S408-PASO          = NUM/PASO                        *             
548700*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
548800*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
548900*   06) WS-S408-CAJA          = CAJA/OPERADORA                  *             
549000*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
549100*   10) WS-S408-SUCPROMB      = SUCURSAL/PROMOTORA              *             
549200*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
549300*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
549400*   17) WS-S408-AUTS408       = AUTORIZACION S408               *             
549500*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
549600*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
549700*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
549800*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
549900*                                                               *             
550000*      SALIDA :                                                 *             
550100*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
550200*   37) WS-S408-RESEXIST-----> INDICADOR PARA S500              *             
550300*                               0=NINGUNA                       *             
550400*                               1=DISPOSICION Y PAGO            *             
550500*                               2=SOLO PAGO                     *             
550600*                              99=IGNORAR                       *             
550700*   47) WS-S408-STATUS-------> RESULTADO                        *             
550800*       ( 0,2,4,9,13,14,15,16,64,65,67,68,73,77,90,94,96,99)    *             
550900*---------------------------------------------------------------*             
551000*  43: ELIMINACION DE CUALQUIER TRANSACCION (LINEAS DE SERVICIO)*             
551100*      ENTRADA:                                                 *             
551200*   01) WS-S408-FUNCION       = 43                              *             
551300*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
551400*   03) WS-S408-PASO          = NUM/PASO                        *             
551500*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
551600*   05) WS-S408-SUCOPER       = SUCURSAL/OPERADORA              *             
551700*   06) WS-S408-CAJA          = CAJA OPERADORA                  *             
551800*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
551900*   10) WS-S408-SUCPROM       = SUC/PROMOTORA                   *             
552000*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
552100*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
552200*   16) WS-S408-TIPOTRAN      = 0                               *             
552300*   17) WS-S408-AUTS408       = AUTORIZACION S408               *             
552400*   18) WS-S408-TIPOCTA       = 0                               *             
552500*   19) WS-S408-IMPORTE       = IMPORTE DEL MOVIMIENTO          *             
552600*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
552700*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
552800*                                                               *             
552900*      SALIDA :                                                 *             
553000*   17) WS-S408-AUTS408       = AUTORIZACION S408               *             
553100*   47) WS-S408-STATUS        = RESULTADO                       *             
553200*( 0,2,4,9,13,14,15, 16, 64, 65, 67, 68, 73, 77, 90, 94, 96, 99)*             
553300*---------------------------------------------------------------*             
553400*  45: ELIMIN REGRESIVA HASTA UN PASO/SUBPROCESO (INCLUIDO)     *             
553500*      ENTRADA:                                                 *             
553600*   01) WS-S408-FUNCION       = 45                              *             
553700*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
553800*   03) WS-S408-PASO          = NUM/PASO                        *             
553900*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
554000*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
554100*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
554200*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
554300*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
554400*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
554500*                                                               *             
554600*      SALIDA :                                                 *             
554700*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
554800*   33) WS-S408-REFTRA-------> NUMERO DE MOVTOS ELIMINADOS      *             
554900*   47) WS-S408-STATUS-------> RESULTADO                        *             
555000*       ( 0,2,4,64,65,67,73,77,90,94,96,99)                     *             
555100*---------------------------------------------------------------*             
555200*  46: ELIMINACION REGRESIVA HASTA UNA PASO(INCLUIDO)           *             
555300*      ENTRADAS:                                                *             
555400*   01) WS-S408-FUNCION       = 46                              *             
555500*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
555600*   03) WS-S408-PASO          = NUM/PASO                        *             
555700*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
555800*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
555900*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
556000*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
556100*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
556200*                                                               *             
556300*      SALIDAS:                                                 *             
556400*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
556500*   33) WS-S408-REFTRA-------> NUMERO DE MOVTOS ELIMINADOS      *             
556600*   45) WS-S408-STATUS-------> RESULTADO                        *             
556700*       ( 0,2,4,64,65,67,73,77,90,94,96,99)                     *             
556800*---------------------------------------------------------------*             
556900*  48: ELIMIN REGRESIVA HASTA UNA AUTORIZACION (NO INCLUIDA)    *             
557000*             Y SUBPROCESO                                      *             
557100*      ENTRADAS:                                                *             
557200*   01) WS-S408-FUNCION       = 48                              *             
557300*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
557400*   03) WS-S408-PASO          = NUM/PASO                        *             
557500*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
557600*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
557700*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
557800*   17) WS-S408-AUTS408       = AUTORIZACION S408               *             
557900*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
558000*   29) WS-S408-TIPOPROCESO   = TIPO DE PROCESO                 *             
558100*   30) WS-S408-SUBPROCESO    = SUB-PROCESO                     *             
558200*                                                               *             
558300*      SALIDA :                                                 *             
558400*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
558500*   33) WS-S408-REFTRA-------> NUMERO DE MOVTOS ELIMINADOS      *             
558600*   47) WS-S408-STATUS-------> RESULTADO                        *             
558700*       (0,2,4,13,14,64,65,67,73,77,90,94,96,99)                *             
558800*                                                               *             
558900*---------------------------------------------------------------*             
559000*  51: AVISO PARA CANCELACION DE CONTRATO                       *             
559100*      ENTRADAS:                                                *             
559200*   01) WS-S408-FUNCION       = 51                              *             
559300*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
559400*   03) WS-S408-PASO          = NUM/PASO                        *             
559500*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
559600*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
559700*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
559800*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
559900*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
560000*                                                               *             
560100*      SALIDAS:                                                 *             
560200*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
560300*   45) WS-S408-STATUS-------> RESULTADO                        *             
560400*       ( 0,2,4,06,18,19,94)                                    *             
560500*                                                               *             
560600*---------------------------------------------------------------*             
560700*  52: AVISO PARA REACTIVACION DE CONTRATO                      *             
560800*      ENTRADAS:                                                *             
560900*   01) WS-S408-FUNCION       = 52                              *             
561000*   02) WS-S408-SISTEMA       = NUM/SISTEMA                     *             
561100*   03) WS-S408-PASO          = NUM/PASO                        *             
561200*   04) WS-S408-FECPRO        = FECHA/PROCESO                   *             
561300*   07) WS-S408-CONTRATO      = NUMERO DE CONTRATO              *             
561400*   11) WS-S408-PRD           = NUM.PRODUCTO                    *             
561500*   12) WS-S408-INS           = NUM.INSTRUMENTO                 *             
561600*   27) WS-S408-MONEDA        = TIPO DE MONEDA                  *             
561700*                                                               *             
561800*      SALIDAS:                                                 *             
561900*   17) WS-S408-AUTS408------> AUTORIZACION S408                *             
562000*   45) WS-S408-STATUS-------> RESULTADO                        *             
562100*       ( 0,2,4,06,20,94, ..... )                               *             
562200*                                                               *             
562300*---------------------------------------------------------------*             
562302*  53: BLOQUEO DE SALDO                                         *             
562304*      ENTRADA:                                                 *             
562306*   01) WS-S408-FUNCION.......= 53                              *             
562308*   02) WS-S408-SISTEMA.......= NUM/SISTEMA                     *             
562310*   03) WS-S408-PASO..........= NUM/PASO                        *             
562312*   04) WS-S408-FECPRO........= FECHA/PROCESO                   *             
562314*   05) WS-S408-SUCOPER.......= SUCURSAL/OPERADORA              *             
562316*   06) WS-S408-CAJA..........= CAJA OPERADORA                  *             
562318*   07) WS-S408-CONTRATO......= NUMERO DE CONRATO               *             
562320*   10) WS-S408-SUCPROM.......= SUC/PROMOTORA                   *             
562322*   11) WS-S408-PRD...........= NUMERO/PRODUCTO                 *             
562324*   12) WS-S408-INS...........= NUMERO/INSTRUMENTO              *             
562326*   16) WS-S408-TIPOTRAN......= 0                               *             
562328*   18) WS-S408-TIPOCTA.......= 0                               *             
562330*   19) WS-S408-IMPORTE.......= IMPORTE SOLICITADO DE BLOQUEO   *             
562332*   26) WS-S408-SECTOR........= NUM. SECTOR                     *             
562334*   27) WS-S408-MONEDA........= NUMERO/MONEDA                   *             
562336*                                                               *             
562338*      SALIDA:                                                  *             
562340*   17) WS-S408-AUTS408.......= AUTORIZACION S408               *             
562342*   22) WS-S408-LIMITE........= LIMITE DE CREDITO               *             
562344*   23) WS-S408-SALDO.........= IMPORTE BLOQUEADO               *             
562346*   24) WS-S408-IMPXDISP......= SALDO POR DISPONER              *             
562348*   37) WS-S408-RESEXIST......= INDICADOR PARA S500             *             
562350*                               00=NINGUNA                      *             
562352*                               01=DISPOSICION Y PAGO           *             
562354*                               02=SOLO PAGO                    *             
562356*                               99=IGNORAR                      *             
562358*   47) WS-S408-STATUS........= RESULTADO                       *             
562360*       ( 0, 2, 4, 7, 9, 11, 33, 67, 68, 94, 99, 151)           *             
562362*                                                               *             
562400*---------------------------------------------------------------*             
562402*  54: DESBLOQUEO DE SALDO                                      *             
562404*      ENTRADA:                                                 *             
562406*   01) WS-S408-FUNCION.......= 54                              *             
562408*   02) WS-S408-SISTEMA.......= NUM/SISTEMA                     *             
562410*   03) WS-S408-PASO..........= NUM/PASO                        *             
562412*   04) WS-S408-FECPRO........= FECHA/PROCESO                   *             
562414*   05) WS-S408-SUCOPER.......= SUCURSAL/OPERADORA              *             
562416*   06) WS-S408-CAJA..........= CAJA OPERADORA                  *             
562418*   07) WS-S408-CONTRATO......= NUMERO DE CONRATO               *             
562420*   10) WS-S408-SUCPROM.......= SUC/PROMOTORA                   *             
562422*   11) WS-S408-PRD...........= NUMERO/PRODUCTO                 *             
562424*   12) WS-S408-INS...........= NUMERO/INSTRUMENTO              *             
562426*   16) WS-S408-TIPOTRAN......= 0                               *             
562428*   18) WS-S408-TIPOCTA.......= 0                               *             
562430*   19) WS-S408-IMPORTE.......= IMPORTE BLOQUEADO EN S500       *             
562432*   20) WS-S408-IMPAUT........= IMPORTE SOLICITADO GCE          *             
562434*   26) WS-S408-SECTOR........= NUM. SECTOR                     *             
562436*   27) WS-S408-MONEDA........= NUMERO/MONEDA                   *             
562438*   29) WS-S408-TIPOPROCESO...= TIPO DE PROCESO                 *             
562440*                               0=DESBLOQUEO POR DIALOGO        *             
562442*                               1=DESBLOQUEO POR PANTALLA       *             
562444*                                                               *             
562446*      SALIDA:                                                  *             
562448*   17) WS-S408-AUTS408.......= AUTORIZACION S408               *             
562450*   22) WS-S408-LIMITE........= LIMITE DE CREDITO               *             
562452*   23) WS-S408-SALDO.........= IMPORTE DESBLOQUEADO S408       *             
562454*   24) WS-S408-IMPXDISP......= SALDO POR DISPONER              *             
562456*   37) WS-S408-RESEXIST......= INDICADOR PARA S500             *             
562458*                               00=NINGUNA                      *             
562460*                               01=DISPOSICION Y PAGO           *             
562462*                               02=SOLO PAGO                    *             
562464*                               99=IGNORAR                      *             
562466*   47) WS-S408-STATUS........= RESULTADO                       *             
562468*       ( 0, 2, 4, 7, 9, 11, 33, 67, 68, 94, 99, 151)           *             
562470*                                                               *             
562600*****************************************************************             
562700*                                                                             
562800*****************************************************************             
562810*  EN TODOS LOS LLAMADOS SE MUEVEN FIJOS POR INCLUDE LOS        *             
562820*  SIGUIENTES CAMPOS: (BATCH Y LINEA)                           *             
562830*****************************************************************             
562900*     WS-S408-SISTEMA   = 500                                   *             
563000*     WS-S408-CONTRATO  = WS03-NUM-CONTRATO                     *             
563100*     WS-S408-NUMLIN    = 0                                     *             
563200*     WS-S408-CLIENTE   = WS03-NUM-CLIENTE                      *             
563300*     WS-S408-SUCPROM   = WS03-SUC-PROMOTORA                    *             
563400*     WS-S408-TIPOCTA   = 2=SOCIO FUNDADOR ( CTAS MAESTRAS)     *             
563500*                         1=TODAS LAS DEMAS                     *             
563600*     WS-S408-PRD       = WS03-NUM-PRODUCTO                     *             
563700*     WS-S408-INS       = WS03-NUM-INSTRUM                      *             
563800*     WS-S408-MONEDA    = WS03-MONEDA                           *             
563900*     WS-S408-DIACORTE  = WS03-DIA-CORTE                        *             
564000*     WS-S408-SECTOR    = WS03-SECTOR                           *             
564100*                                                               *             
564200*     WS-S408-FTO       = WS-S408-FTO-RECHA                     *             
564300*****************************************************************             
564400*         VARIABLES DE LA LIBRERIA DE CREDITO S408              *             
564500*****************************************************************             
564600 01  WS-S408-FTO                   WITH LOWER-BOUNDS.                         
564700     03 WS-S408-FUNCION            PIC 9(04)       COMP.                      
564800     03 WS-S408-SISTEMA            PIC 9(04)       COMP.                      
564900     03 WS-S408-PASO               PIC 9(04)       COMP.                      
565000     03 WS-S408-FECPRO             PIC 9(06)       COMP.                      
565100     03 WS-S408-SUCOPER            PIC 9(04)       COMP.                      
565200     03 WS-S408-CAJA               PIC 9(02)       COMP.                      
565300     03 WS-S408-CONTRATO           PIC 9(12)       COMP.                      
565400     03 WS-S408-NUMLIN             PIC 9(04)       COMP.                      
565500     03 WS-S408-CLIENTE            PIC 9(12)       COMP.                      
565600     03 WS-S408-SUCPROM            PIC 9(04)       COMP.                      
565700     03 WS-S408-PRD                PIC 9(04)       COMP.                      
565800     03 WS-S408-INS                PIC 9(04)       COMP.                      
565900     03 WS-S408-RECOVERY           PIC 9(02)       COMP.                      
566000        88 WS-S408-RC-ON           VALUE 1.                                   
566100        88 WS-S408-RC-OFF          VALUE 0.                                   
566200     03 WS-S408-AUTS500            PIC 9(12)       COMP.                      
566300     03 WS-S408-FECVA              PIC 9(06)       COMP.                      
566400     03 WS-S408-TIPOTRAN           PIC 9(02)       COMP.                      
566500     03 WS-S408-AUTS408            PIC 9(08)       COMP.                      
566600     03 WS-S408-TIPOCTA            PIC 9(02)       COMP.                      
566700     03 WS-S408-SALDOS.                                                       
566800        05 WS-S408-IMPORTE         PIC 9(12)V99    COMP.                      
566900        05 WS-S408-IMPAUT          PIC 9(12)V99    COMP.                      
567000        05 WS-S408-IMP-EXCEDIDO    PIC 9(12)V99    COMP.                      
567100        05 WS-S408-LIMITE          PIC 9(12)V99    COMP.                      
567200        05 WS-S408-SALDO           PIC 9(12)V99    COMP.                      
567300        05 WS-S408-IMPXDISP        PIC 9(12)V99    COMP.                      
567400        05 WS-S408-IMPORIG         PIC 9(12)V99    COMP.                      
567500        05 WS-S408-SECTOR          PIC 9(02)       COMP.                      
567600        05 WS-S408-MONEDA          PIC 9(04)       COMP.                      
567700        05 WS-S408-DIACORTE        PIC 9(02)       COMP.                      
567800        05 WS-S408-TIPOPROCESO     PIC 9(02)       COMP.                      
567900        05 WS-S408-SUBPROCESO      PIC 9(02)       COMP.                      
568000        05 WS-S408-FECHATRA        PIC 9(06)       COMP.                      
568100        05 WS-S408-HORATRA         PIC 9(04)       COMP.                      
568200        05 WS-S408-REFTRA          PIC 9(12)       COMP.                      
568300        05 WS-S408-BANCO           PIC 9(04)       COMP.                      
568400        05 WS-S408-TASA1           PIC 9(03)V9999  COMP.                      
568500        05 WS-S408-TASA2           PIC 9(03)V9999  COMP.                      
568600        05 WS-S408-RESEXIST        PIC 9(02)       COMP.                      
568700        05 WS-S408-LINERROR        PIC 9(12)       COMP.                      
568800        05 WS-S408-IMPDEVOL        PIC 9(12)V99    COMP.                      
568900        05 WS-S408-NUMDEVOL        PIC 9(04)       COMP.                      
569000        05 WS-S408-TIPOPERS        PIC 9(02)       COMP.                      
569010        05 WS-S408-BLOQGCE         PIC 9(12)V99    COMP.                      
569100        05 WS-S408-FILLER1         PIC X(03).                                 
569200     03 WS-S408-TOTALES REDEFINES  WS-S408-SALDOS.                            
569300        05 WS-S408-NUMCAR          PIC 9(12)       COMP.                      
569400        05 WS-S408-IMPCAR          PIC 9(14)V99    COMP.                      
569500        05 WS-S408-NUMABO          PIC 9(12)       COMP.                      
569600        05 WS-S408-IMPABO          PIC 9(14)V99    COMP.                      
569700        05 WS-S408-FILLER          PIC X(74).                                 
569800                                                                              
569900                                                                              
570000 77  WS-S408-STATUS     PIC 9(11)  BINARY.                                    
570100 77  WKS-88-LINCRED     PIC 99     COMP  VALUE 0.                             
570200 01  WS-S408-FTO-RECHA  PIC X(120).                                           
570300$POP OMIT                                                                     
570400*INI LIN-EFECT                                            JEP                 
570500$SET OMIT = NOT S408LINEFEC                                                   
570600*****************************************************************             
570700*                LIBRERIA(S408) LINEFECT                        *             
570800*                                                               *             
570900*  (S408)S408/OBJECT/L070/10MTP001  ON CREDITO                  *             
571000*                                                               *             
571100*  SEUDONIMO EN CONTROL DE VERSIONES   "S408L070LEFE"           *             
571200*  ENTRY POINT "S408LINEFE"                                     *             
571300*   ABONO EN EFECTIVO................................. 01       *             
571400*   REVERSO ABONO EN EFECTIVO......................... 02       *             
571500*****************************************************************             
571600*  LISTA DE RESULTADOS DEL LLAMADO (WS-S408-LE-STATUS)          *             
571700*  00    OPERACION EXISTOSA (DEPOSITO/ELIMINACION DEPOSITO)     *             
571800*  01    FUNCION NO VALIDA                                      *             
571900*  02    NO SE APLICA ELIMINACION, NO HAY MOVIMIENTO A ELIMINAR *             
572000*  03    IMPORTE EN 0 O INVALIDO                                *             
572100*  04    MONEDA DIFERENTE A 01 O 05                             *             
572200*  05    SALDO DE LA LINEA EN EFECTIVO MENOR AL DEPOSITO        *             
572300*  06    SISTEMA INVALIDO                                       *             
572400*  07    NO EXISTE CLIENTE                                      *             
572500*  08    MOVIMIENTO ELIMINADO ANTERIORMENTE                     *             
572600*  09    NO EXISTE MONTO AUTORIZADO PARA EL CLIENTE             *             
572700*  10    DEPOSITO CON AUTORIZACION REALIZADO ANTERIORMENTE      *             
572800*****************************************************************             
572900*    PARAMETROS DE ENTRADA-SALIDA DE LA LIBRERIA                *             
573000*   01) WS-S408-LE-FUNCION......FUNCION REQUERIDA               *             
573100*   02) WS-S408-LE-SISTEMA......SISTEMA ORIGEN                  *             
573200*   03) WS-S408-LE-SUCOPER......SUCURSAL/OPERADORA              *             
573300*   04) WS-S408-LE-CAJA.........CAJA OPERADORA                  *             
573400*   05) WS-S408-LE-NOMINA.......NOMINA OPERADOR                 *             
573500*   06) WS-S408-LE-TMACCE.......TIPO MEDIO ACCESO               *             
573600*   07) WS-S408-LE-OPERALFA.....OPER.ALFA                       *             
573700*   08) WS-S408-LE-AUTS500......AUTORIZACION SIST/LLAMADOR      *             
573800*   09) WS-S408-LE-HORATRA......HORA PARA CALCULO X HORA        *             
573900*   10) WS-S408-LE-IMPORTE......IMPORTE DEL MOVIMIENTO          *             
574000*   11) WS-S408-LE-FECHATRA.....FECHA DE TRANSAC.P/C X HRS      *             
574100*   12) WS-S408-LE-MONEDA.......TIPO DE MONEDA                  *             
574200*   13) WS-S408-LE-FOLIO........FOLIO LINEA EFECTIVO            *             
574300*   14) WS-S408-LE-CONTRATO.....NUM.CONTRATO                    *             
574400*   15) WS-S408-LE-PRD..........NUM.PRODUCTO                    *             
574500*   16) WS-S408-LE-INS..........NUM.INSTRUMENTO                 *             
574600*                                                               *             
574700*       CAMPO DE RESPUESTA DE LIBRERIA NIVEL 77                 *             
574800*                                                               *             
574900*   17) WS-S408-SAL-LE-AUTS408......AUTORIZACION S408           *             
575000*   18) WS-S408-SAL-LE-MONTDISP.....MONTO DISPONIBLE            *             
575100*   19) WS-S408-SAL-LE-RESULT.......RESULT S408LINEFE           *             
575200*   20) WS-S408-LE-STATUS.......RESULTADO DE LLAMADO            *             
575300*                                                               *             
575400*---------------------------------------------------------------*             
575500*  1: ABONO EN EFECTIVO                                         *             
575600*      ENTRADA:                                                 *             
575700*   01) WS-S408-LE-FUNCION  = 1                                 *             
575800*   02) WS-S408-LE-SISTEMA  = SISTEMA ORIGEN                    *             
575900*   03) WS-S408-LE-SUCOPER  = SUCURSAL/OPERADORA                *             
576000*   04) WS-S408-LE-CAJA     = CAJA OPERADORA                    *             
576100*   05) WS-S408-LE-NOMINA   = NOMINA OPERADOR                   *             
576200*   06) WS-S408-LE-TMACCE   = TIPO MEDIO ACCESO                 *             
576300*   07) WS-S408-LE-OPERALFA = OPER.ALFA                         *             
576400*   08) WS-S408-LE-AUTS500  = AUTORIZACION SIST/LLAMADOR        *             
576500*   09) WS-S408-LE-HORATRA  = HORA PARA CALCULO X HORA          *             
576600*   10) WS-S408-LE-IMPORTE  = IMPORTE DEL MOVIMIENTO            *             
576700*   11) WS-S408-LE-FECHATRA = FECHA DE TRANSAC.P/C X HRS        *             
576800*   12) WS-S408-LE-MONEDA   = TIPO DE MONEDA                    *             
576900*   13) WS-S408-LE-FOLIO    = FOLIO LINEA EFECTIVO              *             
577000*   14) WS-S408-LE-CONTRATO = NUM.CONTRATO                      *             
577100*   15) WS-S408-LE-PRD      = NUM.PRODUCTO                      *             
577200*   16) WS-S408-LE-INS      = NUM.INSTRUMENTO                   *             
577300*      SALIDA:                                                  *             
577400*   17) WS-S408-SAL-LE-AUTS408......AUTORIZACION S408           *             
577500*   18) WS-S408-SAL-LE-MONTDISP.....MONTO DISPONIBLE            *             
577600*   19) WS-S408-SAL-LE-RESULT.......RESULT S408LINEFE           *             
577700*   20) WS-S408-LE-STATUS.......RESULTADO DE LLAMADO            *             
577800*       ( 0, 1, 2, 3, 4, 5, 6, 7)                               *             
577900*---------------------------------------------------------------*             
578000*  1: REVERSO ABONO EN EFECTIVO                                 *             
578100*      ENTRADA:                                                 *             
578200*   01) WS-S408-LE-FUNCION  = 2                                 *             
578300*   02) WS-S408-LE-SISTEMA  = SISTEMA ORIGEN                    *             
578400*   03) WS-S408-LE-SUCOPER  = SUCURSAL/OPERADORA                *             
578500*   04) WS-S408-LE-CAJA     = CAJA OPERADORA                    *             
578600*   05) WS-S408-LE-NOMINA   = NOMINA OPERADOR                   *             
578700*   06) WS-S408-LE-TMACCE   = TIPO MEDIO ACCESO                 *             
578800*   07) WS-S408-LE-OPERALFA = OPER.ALFA                         *             
578900*   08) WS-S408-LE-AUTS500  = AUTORIZACION SIST/LLAMADOR        *             
579000*   09) WS-S408-LE-HORATRA  = HORA PARA CALCULO X HORA          *             
579100*   10) WS-S408-LE-IMPORTE  = IMPORTE DEL MOVIMIENTO            *             
579200*   11) WS-S408-LE-FECHATRA = FECHA DE TRANSAC.P/C X HRS        *             
579300*   12) WS-S408-LE-MONEDA   = TIPO DE MONEDA                    *             
579400*   13) WS-S408-LE-FOLIO    = FOLIO LINEA EFECTIVO              *             
579500*   14) WS-S408-LE-CONTRATO = NUM.CONTRATO                      *             
579600*   15) WS-S408-LE-PRD      = NUM.PRODUCTO                      *             
579700*   16) WS-S408-LE-INS      = NUM.INSTRUMENTO                   *             
579800*      SALIDA:                                                  *             
579900*   17) WS-S408-SAL-LE-AUTS408......AUTORIZACION S408           *             
580000*   18) WS-S408-SAL-LE-MONTDISP.....MONTO DISPONIBLE            *             
580100*   19) WS-S408-SAL-LE-RESULT.......RESULT S408LINEFE           *             
580200*   20) WS-S408-LE-STATUS.......RESULTADO DE LLAMADO            *             
580300*       ( 0, 1, 2, 3, 4, 5, 6, 7)                               *             
580400*---------------------------------------------------------------*             
580500*****************************************************************             
580600*         VARIABLES DE LA LIBRERIA DE EFECTIVO S408             *             
580700*****************************************************************             
580800 01  WS-S408-LE-FTO                   WITH LOWER-BOUNDS.                      
580900     03 WS-S408-LE-FUNCION            PIC 9(04)       COMP.                   
581000     03 WS-S408-LE-SISTEMA            PIC 9(04)       COMP.                   
581100     03 WS-S408-LE-SUCOPER            PIC 9(04)       COMP.                   
581200     03 WS-S408-LE-CAJA               PIC 9(04)       COMP.                   
581300     03 WS-S408-LE-NOMINA             PIC 9(08)       COMP.                   
581400     03 WS-S408-LE-TMACCE             PIC 9(06)       COMP.                   
581500     03 WS-S408-LE-OPERALFA           PIC X(12).                              
581600     03 WS-S408-LE-AUTS500            PIC 9(14)       COMP.                   
581700     03 WS-S408-LE-HORATRA            PIC 9(08)       COMP.                   
581800     03 WS-S408-LE-IMPORTE            PIC 9(18)V99    COMP.                   
581900     03 WS-S408-LE-FECHATRA           PIC 9(08)       COMP.                   
582000     03 WS-S408-LE-MONEDA             PIC 9(02)       COMP.                   
582100     03 WS-S408-LE-FOLIO              PIC 9(18)       COMP.                   
582200     03 WS-S408-LE-CONTRATO           PIC 9(16)       COMP.                   
582300     03 WS-S408-LE-PRD                PIC 9(04)       COMP.                   
582400     03 WS-S408-LE-INS                PIC 9(04)       COMP.                   
582500     03 WS-S408-LE-CLAVE-TRANS        PIC 9(04)       COMP.                   
582600 01 WS-S408-SAL-LE-FTO                WITH LOWER-BOUNDS.                      
582700     03 WS-S408-SAL-LE-AUTS408        PIC 9(08)       COMP.                   
582800     03 WS-S408-SAL-LE-MONTDISP       PIC 9(18)V99    COMP.                   
582900     03 WS-S408-SAL-LE-RESULT         PIC 9(02)       COMP.                   
583000 77  WS-S408-LE-STATUS                PIC 9(11)  BINARY.                      
583100 77  WKS-88-LINEFEC                   PIC 99     COMP  VALUE 0.               
583200$POP OMIT                                                                     
583300*FIN LIN-EFECT                                            JEP                 
583400$SET OMIT = NOT S408L018                                                      
583500*****************************************************************             
583600 01  WS-S408L018-FTO                   WITH LOWER-BOUNDS.                     
583700     03 WS-S408L018-FUNCION            PIC 9(04)       COMP.                  
583800     03 WS-S408L018-SISTEMA            PIC 9(04)       COMP.                  
583900     03 WS-S408L018-PASO               PIC 9(04)       COMP.                  
584000     03 WS-S408L018-FECPRO             PIC 9(08)       COMP.                  
584100     03 WS-S408L018-SUCOPER            PIC 9(04)       COMP.                  
584200     03 WS-S408L018-CAJA               PIC 9(02)       COMP.                  
584300     03 WS-S408L018-CONTRATO           PIC 9(12)       COMP.                  
584400     03 WS-S408L018-NUMLIN             PIC 9(04)       COMP.                  
584500     03 WS-S408L018-CLIENTE            PIC 9(12)       COMP.                  
584600     03 WS-S408L018-SUCPROM            PIC 9(04)       COMP.                  
584700     03 WS-S408L018-PRD                PIC 9(04)       COMP.                  
584800     03 WS-S408L018-INS                PIC 9(04)       COMP.                  
584900     03 WS-S408L018-RECOVERY           PIC 9(02)       COMP.                  
585000     03 WS-S408L018-AUTS500            PIC 9(12)       COMP.                  
585100     03 WS-S408L018-FECVA              PIC 9(08)       COMP.                  
585200     03 WS-S408L018-TIPOTRAN           PIC 9(02)       COMP.                  
585300     03 WS-S408L018-AUTS408            PIC 9(08)       COMP.                  
585400     03 WS-S408L018-TIPOCTA            PIC 9(02)       COMP.                  
585500     03 WS-S408L018-SALDOS.                                                   
585600        05 WS-S408L018-IMPORTE         PIC 9(12)V99    COMP.                  
585700        05 WS-S408L018-IMPAUT          PIC 9(12)V99    COMP.                  
585800        05 WS-S408L018-IMP-EXCE        PIC 9(12)V99    COMP.                  
585900        05 WS-S408L018-LIMITE          PIC 9(12)V99    COMP.                  
586000        05 WS-S408L018-SALDO           PIC 9(12)V99    COMP.                  
586100        05 WS-S408L018-IMPXDISP        PIC 9(12)V99    COMP.                  
586200        05 WS-S408L018-IMPORIG         PIC 9(12)V99    COMP.                  
586300        05 WS-S408L018-SECTOR          PIC 9(02)       COMP.                  
586400        05 WS-S408L018-MONEDA          PIC 9(04)       COMP.                  
586500        05 WS-S408L018-DIACORTE        PIC 9(02)       COMP.                  
586600        05 WS-S408L018-TIPOPROCESO     PIC 9(02)       COMP.                  
586700        05 WS-S408L018-SUBPROCESO      PIC 9(02)       COMP.                  
586800        05 WS-S408L018-FECHATRA        PIC 9(08)       COMP.                  
586900        05 WS-S408L018-HORATRA         PIC 9(04)       COMP.                  
587000        05 WS-S408L018-REFTRA          PIC 9(12)       COMP.                  
587100        05 WS-S408L018-BANCO           PIC 9(04)       COMP.                  
587200        05 WS-S408L018-TASA1           PIC 9(03)V9999  COMP.                  
587300        05 WS-S408L018-TASA2           PIC 9(03)V9999  COMP.                  
587400        05 WS-S408L018-RESEXIST        PIC 9(02)       COMP.                  
587500        05 WS-S408L018-LINERROR        PIC 9(12)       COMP.                  
587600        05 WS-S408L018-IMPDEVOL        PIC 9(12)V99    COMP.                  
587700        05 WS-S408L018-NUMDEVOL        PIC 9(04)       COMP.                  
587800        05 WS-S408L018-FILLER1         PIC X(08).                             
587900     03 WS-S408L018-TOTALES REDEFINES  WS-S408L018-SALDOS.                    
588000        05 WS-S408L018-NUMCAR          PIC 9(12)       COMP.                  
588100        05 WS-S408L018-IMPCAR          PIC 9(14)V99    COMP.                  
588200        05 WS-S408L018-NUMABO          PIC 9(12)       COMP.                  
588300        05 WS-S408L018-IMPABO          PIC 9(14)V99    COMP.                  
588400        05 WS-S408L018-FILLER          PIC X(72).                             
588500                                                                              
588600                                                                              
588700 77  WS-S408L018-STATUS     PIC 9(11)  BINARY.                                
588800$POP OMIT                                                                     
588900$SET OMIT = NOT S500L010                                                      
589000*****************************************************************             
589100*                   LIBRERIA L010CONTROL                        *             
589200*                                                               *             
589300*    (S500)S500/OBJECT/L010/CONTROL/01MTP001 ON CAPTACION       *             
589400*                                                               *             
589500* ENTRYPOINTS:                                                  *             
589600*    INICIO : ASIGNA EL NUMERO DE COPIA A CADA COPIA DEL        *             
589700*             PROGRAMA P010                                     *             
589800*                                                               *             
589900*      DATOS DE ENTRADA :                                       *             
590000*            WS-S500-NUM-PASO                                   *             
590100*            WS-S500-NUM-MEZCLA                                 *             
590200*      DATOS DE SALIDA  :                                       *             
590300*            WS-S500-NUM-COPIA                                  *             
590400*            WS-S500-BASE-A-USAR                                *             
590500*            WS-S500-RESULTADO                                  *             
590600*                                                               *             
590700*    SOLICITUDCTO : VERIFICA SI LA COPIA QUE SOLICITA PUEDE     *             
590800*                   USAR UN CONTRATO ESPECIFICADO.              *             
590900*                                                               *             
591000*      DATOS DE ENTRADA :                                       *             
591100*            WS-S500-NUM-PASO                                   *             
591200*            WS-S500-NUM-MEZCLA                                 *             
591300*            WS-S500-NUM-COPIA                                  *             
591400*            WS-S500-CONTRATO                                   *             
591500*            WS-S500-SOL-AUTORIZ                                *             
591600*      DATOS DE SALIDA :                                        *             
591700*            WS-S500-BASE-A-USAR                                *             
591800*            WS-S500-AUTORIZACION                               *             
591900*            WS-S500-IND-APLISDOPEND                            *             
592000*            WS-S500-RESULTADO                                  *             
592100*                                                               *             
592200*    LIBERACTOS : LIBERA LOS CONTRATOS QUE ESTABA USANDO        *             
592300*                 LA COPIA ESPECIFICADA.                        *             
592400*                                                               *             
592500*      DATOS DE ENTRADA :                                       *             
592600*            WS-S500-NUM-PASO                                   *             
592700*            WS-S500-NUM-MEZCLA                                 *             
592800*            WS-S500-NUM-COPIA                                  *             
592900*      DATOS DE SALIDA :                                        *             
593000*            WS-S500-RESULTADO                                  *             
593100*                                                               *             
593200*****************************************************************             
593300 77  WKS-88-S500L010CTRL             PIC 99   COMP VALUE 0.                   
593400 01  WS-S500-FTOL010.                                                         
593500     02 WS-S500-NUM-PASO              PIC 9(02).                              
593600     02 WS-S500-NUM-MEZCLA            PIC 9(04).                              
593700     02 WS-S500-NUM-COPIA             PIC 9(02).                              
593800     02 WS-S500-CONTRATO              PIC 9(12).                              
593900     02 WS-S500-SOL-AUTORIZ           PIC 9(01).                              
594000*       0 = NO SE SOLICITA NUM DE AUTORIZACION                                
594100*       1 = SI SE SOLICITA NUM DE AUTORIZACION                                
594200     02 WS-S500-BASE-A-USAR           PIC 9(01).                              
594300        88 WS-S500-BDORIG             VALUE 1.                                
594400        88 WS-S500-BDAUX              VALUE 2.                                
594500        88 WS-S500-AMBAS              VALUE 3.                                
594600     02 WS-S500-AUTORIZACION          PIC 9(08).                              
594700     02 WS-S500-IND-APLISDOPEND       PIC 9(01).                              
594800        88 WS-S500-NO-APLSDPEND       VALUE 1.                                
594900        88 WS-S500-SI-APLSDPEND       VALUE 2.                                
595000     02 WS-S500-RESULTADO             PIC 9(02).                              
595100*       01 = NUMERO DE MEZCLA NO ACTIVA                                       
595200*       02 = NUMERO DE PASO INVALIDO                                          
595300*       03 = NO HAY NUMERO DE COPIA DISPONIBLE (MAS DE 3 COPIAS)              
595400*       04 = NUMERO DE CONTRATO SOLICITADO EN CEROS                           
595500*       05 = NUMERO DE COPIA NO DADA DE ALTA                                  
595600*       06 = COPIA CON MAS DE CUATRO CONTRATOS                                
595700*       07 = EL CONTRATO ESTA OCUPADO POR LA MISMA COPIA QUE                  
595800*            LO ESTA SOLICITANDO                                              
595900*       08 = EL CONTRATO ESTA OCUPADO Y YA PASARON 2 SEGS EN                  
596000*            ESPERA.                                                          
596100*       09 = NUMERO DE COPIA INVALIDO (FUERA DE RANGO)                        
596200*       10 = NUMERO DE MEZCLA INVALIDO                                        
596300*                                                                             
596400*01 WS-FTO-IN-SOLAUTDIA.                                                      
596500*   02 WS-I-SAD-PASO              PIC 9(02).                                  
596600*   02 WS-I-SAD-COPIA             PIC 9(02).                                  
596700*   02 WS-I-SAD-INDAUT            PIC 9(01).                                  
596800*   02 WS-I-SAD-INDFOR            PIC 9(01).                                  
596900*                                                                             
597000*01 WS-FTO-OUT-SOLAUTDIA.                                                     
597100*   02 WS-O-SAD-AUT               PIC 9(06).                                  
597200*   02 WS-O-SAD-SEQDIAL           PIC 9(06).                                  
597300*                                                                             
597400*77 WS-SOLAUTDIA-RESULT           PIC 9(02).                                  
597500                                                                              
597600$POP OMIT                                                                     
597700$SET OMIT = NOT S500L020                                                      
597800*****************************************************************             
597900*           LIBRERIA S500/OBJECT/L020/CONSULTAS                 *             
598000*****************************************************************             
598100*  PARAMETROS DE ENTRADA PARA CONSULTA DE DATOS GENERALES       *             
598200*                ENTRY POINT: S500L020CONTRATO                  *             
598300*                                                               *             
598400* FIJOS POR INCLUDE:                                            *             
598500*  WS-S500-L020-FUNCION       = 1                               *             
598600*  WS-S500-L020-MOVSADD       = 0                               *             
598700* POR CADA PROGRAMA:                                            *             
598800*  WS-S500-L020-TPOMEDACC     = 0(CTO) 1(CHEQUERA) 2(TARJETA)   *             
598900*  WS-S500-L020-MEDACC        = CTO O CHEQUERA O TARJETA        *             
599000*                                                               *             
599100*****************************************************************             
599200*  PARAMETROS DE ENTRADA PARA CONSULTA DE SALDOS                *             
599300*                ENTRY POINT: S500L020CONTRATO                  *             
599400*                                                               *             
599500* FIJOS POR INCLUDE:                                            *             
599600*  WS-S500-L020-FUNCION       = 2                               *             
599700* POR CADA PROGRAMA:                                            *             
599800*  WS-S500-L020-TPOMEDACC     = 0(CTO) 1(CHEQUERA) 2(TARJETA)   *             
599900*  WS-S500-L020-MEDACC        =   CTO    CHEQUERA    TARJETA    *             
600000*  WS-S500-L020-MOVSADD       = 0(SIN LOS ULTIMOS 4 MOVTOS)     *             
600100*                             = 1(CON LOS ULTIMOS 4 MOVTOS)     *             
600200*****************************************************************             
600300*  PARAMETROS DE ENTRADA PARA CONSULTA EDO.CTA AHORROS          *             
600400*                ENTRY POINT: S500L020EDOCTAAHO                 *             
600500*                                                               *             
600600* FIJOS POR INCLUDE:                                            *             
600700*                                                               *             
600800* POR CADA PROGRAMA:                                            *             
600900*  WS-S500-L020-CONTRATO      = NUMERO DE CONTRATO              *             
601000*  WS-S500-L020-NUMMOVS       = NUMERO DE MOVIMIENTOS           *             
601100*  WS-S500-L020-FECINI        = FECHA INICIAL DE MOVIMIENTOS    *             
601200*****************************************************************             
601300*  PARAMETROS DE ENTRADA PARA CAMBIO DE PROCESO                 *             
601400*                ENTRY POINT: S500L020CAMBPROC                  *             
601500*                                                               *             
601600* FIJOS POR INCLUDE:                                            *             
601700*  WS-S500-L020-FUNCION       = 1                               *             
601800* POR CADA PROGRAMA:                                            *             
601900*                                                               *             
602000*****************************************************************             
602100*   RESULTS QUE REGRESA LA LIBRARY                             *              
602200*           0- CALL OK                                         *              
602300*           1- REGISTRO DE SALIDA INSIFICIENTE                 *              
602400*           2- FUNCION INVALIDA                                *              
602500*           3- NO EXISTE REGISTRO                              *              
602600*           4- ERROR EN DMSII, SE MANDA A LA LOG MIX           *              
602700*              EL ERROR.                                       *              
602800*           5- REINTENTE MAS TARDE                             *              
602900*           6- EL CONTRATO NO PERTENECE AL CSI;                *              
603000*           7- ESTADOS DE CUENTA SOLO PARA AHORROS             *              
603100*           8- ERROR CALL S408                                 *              
603200*           9- MEDIO DE ACCESO INEXISTENTE                     *              
603300*          10- ERROR CALL S151                                 *              
603400*          11- NO EXISTEN FACTORES DE CG Y CI                  *              
603500****************************************************************              
603600*77  WS-S500-L020-RESULT                PIC 9(11) BINARY.                     
603700*                                                                             
603800*                                                                             
603900*01 WS-S500-0205-I-COMCGCI           WITH LOWER-BOUNDS.                       
604000*   03 WS-S500-0205-I-FUN            PIC 9(02).                               
604100*   03 WS-S500-0205-I-SITCG1         PIC 9(14)V9(08).                         
604200*   03 WS-S500-0205-I-SITCI1         PIC 9(04)V9(08).                         
604300*   03 WS-S500-0205-I-LIDERCG1       PIC 9(04)V9(04).                         
604400*   03 WS-S500-0205-I-MINCG1         PIC 9(06)V99.                            
604500*   03 WS-S500-0205-I-LIDERCI1       PIC 9(04)V9(04).                         
604600*   03 WS-S500-0205-I-SITCG5         PIC 9(14)V9(08).                         
604700*   03 WS-S500-0205-I-SITCI5         PIC 9(04)V9(08).                         
604800*   03 WS-S500-0205-I-LIDERCG5       PIC 9(04)V9(04).                         
604900*   03 WS-S500-0205-I-MINCG5         PIC 9(06)V99.                            
605000*   03 WS-S500-0205-I-LIDERCI5       PIC 9(04)V9(04).                         
605100*                                                                             
605200*01 WS-S500-0205-O-COMCGCI           WITH LOWER-BOUNDS.                       
605300*   03 WS-S500-0205-O-SITCG1         PIC 9(14)V9(08).                         
605400*   03 WS-S500-0205-O-SITCI1         PIC 9(04)V9(08).                         
605500*   03 WS-S500-0205-O-LIDERCG1       PIC 9(04)V9(04).                         
605600*   03 WS-S500-0205-O-MINCG1         PIC 9(06)V99.                            
605700*   03 WS-S500-0205-O-LIDERCI1       PIC 9(04)V9(04).                         
605800*   03 WS-S500-0205-O-SITCG5         PIC 9(14)V9(08).                         
605900*   03 WS-S500-0205-O-SITCI5         PIC 9(04)V9(08).                         
606000*   03 WS-S500-0205-O-LIDERCG5       PIC 9(04)V9(04).                         
606100*   03 WS-S500-0205-O-MINCG5         PIC 9(06)V99.                            
606200*   03 WS-S500-0205-O-LIDERCI5       PIC 9(04)V9(04).                         
606300*                                                                             
606400*                                                                             
606500$POP OMIT                                                                     
606600$ SET OMIT = NOT S500L030                                                     
606700******************************************************************            
606800* LIBRERIA S500/OBJECT/LO30/TIEMPOS                              *            
606900*                                                                *            
607000* RESULTÀS QUE REGRESA LA LIBRERIA:                              *            
607100*                                                                *            
607200*   1- USER, PASO, COPIA NO DADO DE ALTA.                        *            
607300*   2- INTENTANDO INICIAR PROCESO CUANDO EXISTE PROCESO EN CURSO.*            
607400*   3- INTENTANDO TERMINAR UN PROCESO CUANDO NO EXISTE PROCESO   *            
607500*      EN CURSO.                                                 *            
607600*   4- EL INDICADOR DE INICIO/FIN DE PROCESO NO ES 1 O 2.        *            
607700*   5- INTENTANDO INICIAR UN SUBPROCESO CUANDO EXISTE SUBPROCESO *            
607800*      EN CURSO.                                                 *            
607900*   6- INTENTANDO TERMINAR UN SUBPROCESO CUANDO NO EXISTE SUBPROC*            
608000*      EN CURSO.                                                 *            
608100*   7- INTENTANDO ACCESAR UN SUBPROCESO CUANDO NO EXISTE PROCESO *            
608200*      EN CURSO.                                                 *            
608300*   8- TIPO DE PROCESO INVALIDO.                                 *            
608400*   9- FUNCION INVALIDA.                                         *            
608500*  10- PROCESO FUERA DE RANGO.                                   *            
608600*                                                                *            
608700* ENTRYPOINTS:                                                   *            
608800*                                                                *            
608900*  S500L030INICIO: DA DE ALTA AL PROCESO LLAMADOR                *            
609000*      DATOS DE ENTRADA:                                         *            
609100*            WS-S500-0301-I-INICIO                               *            
609200*      RESULTS:                                                  *            
609300*                                                                *            
609400*                                                                *            
609500*  S500L030PROCESO: EL PROGRAMA LLAMADOR DEBERA HACER UN LLAMADO *            
609600*                   A ESTE ENTRYPOINT EN CADA ENTRADA Y SALIDA DE*            
609700*                   UN PROCESO.                                  *            
609800*      DATOS DE ENTRADA:                                         *            
609900*            WS-S500-0302-PROCESO                                *            
610000*      RESULTS: 1,2,3,4,5,6,7,8                                  *            
610100*                                                                *            
610200*  S500L030CONSUL: CONSULTA                                      *            
610300*                                                                *            
610400*      FUNCION 1:                                                *            
610500*      DATOS DE ENTRADA:                                         *            
610600*            WS-S500-0303-I                                      *            
610700*      DATOS DE SALIDA:                                          *            
610800*            WS-S500-0303-O                                      *            
610900*                                                                *            
611000*      FUNCION 2:                                                *            
611100*      DATOS DE ENTRADA:                                         *            
611200*            WS-S500-0303-I                                      *            
611300*      DATOS DE SALIDA:                                          *            
611400*            WS-S500-0303-O                                      *            
611500*                                                                *            
611600*      FUNCION 3:                                                *            
611700*      DATOS DE ENTRADA:                                         *            
611800*            WS-S500-0303-I                                      *            
611900*      DATOS DE SALIDA:                                          *            
612000*            WS-S500-0303-O                                      *            
612100*                                                                *            
612200*      RESULTS: 1,10                                             *            
612300******************************************************************            
612400 01 WS-S500-0300-I                         PIC X(54).                         
612500                                                                              
612600 01 WS-S500-0301-I-INICIO REDEFINES WS-S500-0300-I.                           
612700    03 WS-S500-0301-I-USER                 PIC 9(04).                         
612800    03 WS-S500-0301-I-PASO                 PIC 9(03).                         
612900    03 WS-S500-0301-I-COPIA                PIC 9(02).                         
613000    03 FILLER                              PIC X(45).                         
613100                                                                              
613200 01 WS-S500-0302-I-PROCESOS REDEFINES WS-S500-0300-I.                         
613300    03 WS-S500-0302-I-USER                 PIC 9(04).                         
613400    03 WS-S500-0302-I-PASO                 PIC 9(03).                         
613500    03 WS-S500-0302-I-COPIA                PIC 9(02).                         
613600    03 WS-S500-0302-I-PROCESO              PIC 9(03).                         
613700    03 WS-S500-0302-I-TIPOPROC             PIC 9(01).                         
613800    03 WS-S500-0302-I-INIFINPROC           PIC 9(01).                         
613900    03 WS-S500-0302-I-HORA                 PIC 9(06).                         
614000    03 WS-S500-0302-I-INFVAR               PIC X(24).                         
614100    03 WS-S500-0302-I-INFVAR-R REDEFINES                                      
614200       WS-S500-0302-I-INFVAR.                                                 
614300       05 WS-S500-0302-I-CTO               PIC 9(12).                         
614400       05 WS-S500-0302-I-AUT               PIC 9(12).                         
614500    03 WS-S500-0302-I-NOM-PROC             PIC X(10).                         
614600                                                                              
614700 01 WS-S500-0303-I-CONSUL1 REDEFINES WS-S500-0300-I.                          
614800    03 WS-S500-0302-I-FUNCION1             PIC 9(02).                         
614900    03 WS-S500-0302-I-USER1                PIC 9(04).                         
615000    03 WS-S500-0302-I-PASO1                PIC 9(03).                         
615100    03 WS-S500-0302-I-COPIA1               PIC 9(02).                         
615200    03 WS-S500-0302-I-PROC1                PIC 9(03).                         
615300    03 WS-S500-0302-I-NOPROC1              PIC 9(03).                         
615400    03 FILLER                              PIC X(37).                         
615500 01 WS-S500-0303-I-CONSUL2 REDEFINES WS-S500-0300-I.                          
615600    03 WS-S500-0302-I-FUNCION2             PIC 9(02).                         
615700    03 WS-S500-0302-I-USER2                PIC 9(04).                         
615800    03 WS-S500-0302-I-PASO2                PIC 9(03).                         
615900    03 WS-S500-0302-I-COPIA2               PIC 9(02).                         
616000    03 WS-S500-0302-I-PROC2                PIC 9(03).                         
616100    03 WS-S500-0302-I-MAXMIN2              PIC 9(01).                         
616200    03 WS-S500-0302-I-SIGSPROC2            PIC 9(03).                         
616300    03 WS-S500-0302-I-NOSPROC2             PIC 9(03).                         
616400    03 FILLER                              PIC X(33).                         
616500 01 WS-S500-0303-I-CONSUL3 REDEFINES WS-S500-0300-I.                          
616600    03 WS-S500-0302-I-FUNCION3             PIC 9(02).                         
616700    03 WS-S500-0302-I-USER3                PIC 9(04).                         
616800    03 WS-S500-0302-I-PASO3                PIC 9(03).                         
616900    03 WS-S500-0302-I-COPIA3               PIC 9(02).                         
617000    03 FILLER                              PIC X(43).                         
617100                                                                              
617200 01 WS-S500-0300-O                         PIC X(806).                        
617300 01 WS-S500-0303-O-CONSUL1 REDEFINES WS-S500-0300-O.                          
617400    03 WS-S500-0302-O-FIN1                 PIC 9(01).                         
617500    03 WS-S500-0302-O-PROCESOS OCCURS 7 TIMES.                                
617600       05 WS-S500-0302-O-PROC1             PIC 9(03).                         
617700       05 WS-S500-0302-O-NOM-PROC1         PIC X(10).                         
617800       05 WS-S500-0302-O-ET1               PIC 9(08).                         
617900       05 WS-S500-0302-O-IO1               PIC 9(08).                         
618000       05 WS-S500-0302-O-P1                PIC 9(08).                         
618100       05 WS-S500-0302-O-NOTRAN1           PIC 9(08).                         
618200       05 WS-S500-0302-O-TXSEG1            PIC 9(08).                         
618300       05 WS-S500-0302-O-TXSEGPROM1        PIC 9(08).                         
618400       05 WS-S500-0302-O-MAX-HORA1         PIC 9(06).                         
618500       05 WS-S500-0302-O-MAX-ET1           PIC 9(08).                         
618600       05 WS-S500-0302-O-MAX-IO1           PIC 9(08).                         
618700       05 WS-S500-0302-O-MAX-P1            PIC 9(08).                         
618800       05 WS-S500-0302-O-MAX-LL1.                                             
618900          07 WS-S500-0302-O-MAX-CTO1       PIC 9(12).                         
619000          07 WS-S500-0302-O-MAX-AUT1       PIC 9(12).                         
619100                                                                              
619200 01 WS-S500-0303-0-CONSUL2 REDEFINES WS-S500-0300-O.                          
619300    03 WS-S500-0302-O-PROC2                PIC 9(03).                         
619400    03 WS-S500-0302-O-NOM-PROC2            PIC X(10).                         
619500    03 WS-S500-0302-O-HORA2                PIC 9(06).                         
619600    03 WS-S500-0302-O-ET2                  PIC 9(08).                         
619700    03 WS-S500-0302-O-IO2                  PIC 9(08).                         
619800    03 WS-S500-0302-O-P2                   PIC 9(08).                         
619900    03 WS-S500-0302-O-FIN2                 PIC 9(01).                         
620000    03 WS-S500-0302-O-LL2.                                                    
620100       05 WS-S500-0302-O-CTO2              PIC 9(12).                         
620200       05 WS-S500-0302-O-AUT2              PIC 9(12).                         
620300    03 WS-S500-0302-O-GPO2                 OCCURS 20 TIMES.                   
620400       05 WS-S500-0302-O-SP-SPROC2         PIC 9(03).                         
620500       05 WS-S500-0302-O-SP-NOM-SPROC2     PIC X(10).                         
620600       05 WS-S500-0302-O-SP-ET2            PIC 9(08).                         
620700    03 FILLER                              PIC X(318).                        
620800 01 WS-S500-0303-0-CONSUL3 REDEFINES WS-S500-0300-O.                          
620900    03 WS-S500-0302-O-PROC3                PIC 9(03).                         
621000    03 WS-S500-0302-O-NOM-PROC3            PIC X(10).                         
621100    03 WS-S500-0302-O-SPROC3               PIC 9(03).                         
621200    03 WS-S500-0302-O-NOM-SPROC3           PIC X(10).                         
621300    03 WS-S500-0302-O-HORA3                PIC 9(06).                         
621400    03 WS-S500-0302-O-ID3                  PIC X(24).                         
621500    03 FILLER                              PIC X(750).                        
621600                                                                              
621700 77 WS-S500L030-RESULT                     PIC 9(04).                         
621800****************************************************************              
621900*             L I S T A  D E  P R O C E S O S                  *              
622000****************************************************************              
622100* P014  NO DE PROCESO       PROCESO                            *              
622200*                   1       BUSCAMDA                           *              
622300*                   2       L020CONTRA                         *              
622400*                   3       L020FILECO                         *              
622500*                   4       50021                              *              
622600*                   5       50022                              *              
622700*                   6       50023                              *              
622800*                   7       SDODLG                             *              
622900*                   8       RECEIVCOMS                         *              
623000*                   9       ESPERACOMS                         *              
623100*                  10       SEGURIDAD                          *              
623200*                  11       S127L010CV                         *              
623300*                  12       L020FILEFR                         *              
623400*                                                              *              
623500* L020              1       OPERCRED                           *              
623600*                   2       BUSCA_MDA                          *              
623700*                   3       CONS_4ULT                          *              
623800*                                                              *              
623900* P010              1       THECALENDA                         *              
624000*                   2       JUSTIFIER                          *              
624100*                   3       S016COMXCT                         *              
624200*                   4       S016S500_0                         *              
624300*                   5       SALDOS                             *              
624400*                   6       TRANSACCIO                         *              
624500*                   7       BUSCA_MDA                          *              
624600*                   8       DAME_IMPRE                         *              
624700*                   9       S127L010CO                         *              
624800*                   10      S127L020AC                         *              
624900*                   11      CARGAMOV1                          *              
625000*                   12      OPERCRED                           *              
625100*                   13      L010SOLCTO                         *              
625200*                   14      L010LIBERA                         *              
625300*                   15      L010SOLAUT                         *              
625400*                   16      L010GRABAL                         *              
625500*                   17      L010RECHAZ                         *              
625600*                   18      GRABABASE                          *              
625700*                   19      FORTRANSEN                         *              
625800*                   20      CARGOS                             *              
625900*                   21      ABONOS                             *              
626000*                   22      CANCELACIO                         *              
626100*                   23      NO CONTABL                         *              
626200*                   24      FORTRANSRE                         *              
626300*                   25      ELIMINACIO                         *              
626400*                   26      P015CTRL                           *              
626500*                   27      ELIDEVOL                           *              
626600*                   28      S127L010CV                         *              
626700*                   29      ESCRIBEICA                         *              
626800*                   30      SENDCOMS                           *              
626900*                   31      S016L428R1                         *              
627000*                   32      CTOOCUPADO                         *              
627100*                   33      BRINCOAUTO                         *              
627150*                   34      L050DYR                            *              
627200$POP OMIT                                                                     
627300$SET OMIT = NOT S500L040                                                      
627400*****************************************************************             
627500*  LIBRERIA S500/OBJECT/L040   LIGA TARJ-CTO-TARJ DE BD04      **             
627600*****************************************************************             
627700 77  WS-S500-L040-RESULT         PIC 9(11) BINARY.                            
627800 88  W88-S500-L040-RS-OK         VALUE 0.                                     
627900 88  W88-S500-L040-RS-NOEXISTE   VALUE 1.                                     
628000 88  W88-S500-L040-RS-NOOK       VALUE 2.                                     
628100                                                                              
628200 77  W77-LIGA-S500L040           PIC 9(02).                                   
628300                                                                              
628400$SET OMIT = NOT S500L040R01                                                   
628500*  ENTRY-POINT S500L040_FECHA_S111.                                           
628600*  NO UTILIZA PARAMETRO DE ENTRADA                                            
628700*  PARAMETRO DE SALIDA ENTRY-POINT S500L040_FECHA_S111.                       
628800 01  WS-S500-L040-SALIDA-01.                                                  
628900     02 WS-S500-L040-01-FECHA-S  PIC 9(08).                                   
629000     02 WS-S500-L040-01-NODO-S   PIC 9(02).                                   
629100     02 FILLER                   PIC X(02).                                   
629200$POP OMIT                                                                     
629300$SET OMIT = NOT S500L040R02                                                   
629400*  ENTRY-POINT S500L040_DAME-TARJETA.                                         
629500*  PARAMETRO ENTRADA:                                                         
629600 01  WS-S500-L040-ENTRADA-02.                                                 
629700     02 WS-S500-L040-02-CTO-I    PIC 9(12).                                   
629800     02 FILLER                   PIC X(24).                                   
629900*  PARAMETRO SAIDA:                                                           
630000 01  WS-S500-L040-SALIDA-02.                                                  
630100     02 WS-S500-L040-02-TARJ-S   PIC 9(16).                                   
630200     02 WS-S500-L040-02-CTO-S    PIC 9(12).                                   
630300     02 WS-S500-L040-02-SUCP-S   PIC 9(04).                                   
630400     02 WS-S500-L040-02-CSI-S    PIC 9(02).                                   
630500     02 FILLER                   PIC X(02).                                   
630600$POP OMIT                                                                     
630700$SET OMIT = NOT S500L040R03                                                   
630800*  ENTRY-POINT S500L040_DAME-CONTRATO.                                        
630900*  PARAMETRO ENTRADA:                                                         
631000 01  WS-S500-L040-ENTRADA-03.                                                 
631100     02 WS-S500-L040-03-TARJ-I   PIC 9(16).                                   
631200     02 FILLER                   PIC X(22).                                   
631300*  PARAMETRO SAIDA:                                                           
631400 01  WS-S500-L040-SALIDA-03.                                                  
631500     02 WS-S500-L040-03-CTO-S    PIC 9(12).                                   
631600     02 WS-S500-L040-03-TARJ-S   PIC 9(16).                                   
631700     02 WS-S500-L040-03-SUCP-S   PIC 9(04).                                   
631800     02 WS-S500-L040-03-CSI-S    PIC 9(02).                                   
631900     02 FILLER                   PIC X(02).                                   
632000$POP OMIT                                                                     
632100*INI BSR. MIGRACION PREPAGADA  //LIGA TARJETA-TEF-TARJETA BD04//              
632200$SET OMIT = NOT S500L040R04                                                   
632300*  ENTRY-POINT S500L040_DAME_TEF.                                             
632400*  PARAMETRO ENTRADA:                                                         
632500 01  WS-S500-L040-ENTRADA-04.                                                 
632600     02 WS-S500-L040-04-TARJ-I     PIC 9(16).                                 
632700     02 FILLER                     PIC X(32).                                 
632800*  PARAMETRO SALIDA:                                                          
632900 01  WS-S500-L040-SALIDA-04.                                                  
633000     02 WS-S500-L040-04-TARJ-S     PIC 9(16).                                 
633100     02 WS-S500-L040-04-TEF-INFO-S PIC 9(16).                                 
633200     02 WS-S500-L040-04-ASG-PAGO-S PIC 9(02).                                 
633300     02 WS-S500-L040-04-MDE-S      PIC 9(02).                                 
633400     02 FILLER                     PIC X(10).                                 
633500$POP OMIT                                                                     
633600*FIN BSR. MIGRACION PREPAGADA                                                 
633700*INI R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
633800$SET OMIT = NOT S500L040R05                                                   
633900*  ENTRY-POINT S500L040_DAME-CTAORIG.                                         
634000*  PARAMETRO ENTRADA: (SIZE 36 BYTES)                                         
634100 01  WS-S500-L040-ENTRADA-05.                                                 
634200     02 WS-S500-L040-05-PROD-I    PIC 9(04).                                  
634300     02 WS-S500-L040-05-INST-I    PIC 9(04).                                  
634400     02 WS-S500-L040-05-MONE-I    PIC 9(02).                                  
634500     02 WS-S500-L040-05-CTO-I     PIC 9(12).                                  
634600     02 FILLER                    PIC X(14).                                  
634700                                                                              
634800*  PARAMETRO SALIDA:  (SIZE 140 BYTES)                                        
634900 01  WS-S500-L040-SALIDA-05.                                                  
635000     02 WS-S500-L040-05-PROD-S    PIC 9(04).                                  
635100     02 WS-S500-L040-05-INST-S    PIC 9(04).                                  
635200     02 WS-S500-L040-05-MONE-S    PIC 9(02).                                  
635300     02 WS-S500-L040-05-IOPE-S    PIC 9(02).                                  
635400     02 WS-S500-L040-05-NINV-S    PIC 9(06).                                  
635500     02 WS-S500-L040-05-CTO-S     PIC 9(18).                                  
635600     02 WS-S500-L040-05-CTO-S016  PIC 9(14).                                  
635700     02 WS-S500-L040-05-SUCPRO-S  PIC 9(04).                                  
635800     02 WS-S500-L040-05-NOMBRE-S  PIC X(36).                                  
635900     02 WS-S500-L040-05-FECGLB-S  PIC 9(08).                                  
636000     02 WS-S500-L040-05-FECBEN-S  PIC 9(08).                                  
636100     02 WS-S500-L040-05-STATUS-S  PIC 9(02).                                  
636200     02 WS-S500-L040-05-IMPGLB-S  PIC 9(14)V99.                               
636300     02 WS-S500-L040-05-IMPBEN-S  PIC 9(14)V99.                               
636400***  02 FILLER                    PIC X(02).                                  
636500                                                                              
636600$POP OMIT                                                                     
636700                                                                              
636800$SET OMIT = NOT S500L040R06                                                   
636900*  ENTRY-POINT S500L040_DAME-CTAGLB.                                          
637000*    RAMETRO ENTRADA: (SIZE 36 BYTES)                                         
637100 01  WS-S500-L040-ENTRADA-06.                                                 
637200     02 WS-S500-L040-06-PROD-I    PIC 9(04).                                  
637300     02 WS-S500-L040-06-INST-I    PIC 9(04).                                  
637400     02 WS-S500-L040-06-MONE-I    PIC 9(02).                                  
637500     02 WS-S500-L040-06-IOPE-I    PIC 9(02).                                  
637600     02 WS-S500-L040-06-NINV-I    PIC 9(06).                                  
637700     02 WS-S500-L040-06-CTO-I     PIC 9(18).                                  
637800                                                                              
637900                                                                              
638000*  PARAMETRO SALIDA:  (SIZE 140 BYTES)                                        
638100 01  WS-S500-L040-SALIDA-06.                                                  
638200     02 WS-S500-L040-06-PROD-S    PIC 9(04).                                  
638300     02 WS-S500-L040-06-INST-S    PIC 9(04).                                  
638400     02 WS-S500-L040-06-MONE-S    PIC 9(02).                                  
638500     02 WS-S500-L040-06-CTO-S     PIC 9(12).                                  
638600     02 WS-S500-L040-06-CTO-S016  PIC 9(14).                                  
638700     02 WS-S500-L040-06-SUCPRO-S  PIC 9(04).                                  
638800     02 WS-S500-L040-06-NOMBRE-S  PIC X(36).                                  
638900     02 WS-S500-L040-06-FECGLB-S  PIC 9(08).                                  
639000     02 WS-S500-L040-06-FECBEN-S  PIC 9(08).                                  
639100     02 WS-S500-L040-06-STATUS-S  PIC 9(02).                                  
639200     02 WS-S500-L040-06-IMPGLB-S  PIC 9(14)V99.                               
639300     02 WS-S500-L040-06-IMPBEN-S  PIC 9(14)V99.                               
639400     02 FILLER                    PIC X(14).                                  
639500$POP OMIT                                                                     
639600*FIN R3-2011-BENEII       (Beneficencia F2)               ABARBOSA            
639700$SET OMIT = NOT S500L040R07                                                   
639800* ENTRY POINT: S500L040ARCHDISP                                               
639900* FORMATO DE ENTRADA (SIZE 155 BYTES)                                         
640000  01 WS-FTO-IN-ARCHDISP.                                                      
640100     03 WS-I-AD-FUNCION                   PIC 9(01).                          
640200     03 WS-I-AD-NUMREG                    PIC 9(08).                          
640300     03 WS-I-AD-NUMCOPIA                  PIC 9(02).                          
640400     03 WS-I-AD-MIX                       PIC 9(06).                          
640500     03 WS-I-AD-FECLIN                    PIC 9(08).                          
640600     03 WS-I-AD-MSG                       PIC X(130).                         
640700     03 WS-I-AD-MSG-R REDEFINES WS-I-AD-MSG.                                  
640800        05 WS-I-AD-TIPO-REG               PIC 9(01).                          
640900        05 WS-I-AD-NUM-SEC                PIC 9(08).                          
641000        05 WS-I-AD-SUC                    PIC 9(04).                          
641100        05 WS-I-AD-CAJA                   PIC 9(02).                          
641200        05 WS-I-AD-NUMTRAN                PIC 9(08).                          
641300        05 WS-I-AD-CLAVE-TRANS            PIC 9(04).                          
641400        05 WS-I-AD-TIPO-MOV               PIC 9(01).                          
641500        05 WS-I-AD-TIPMEDACC              PIC 9(02).                          
641600        05 WS-I-AD-TARJETA                PIC 9(16).                          
641700        05 WS-I-AD-IMPORTE                PIC 9(14)V99.                       
641800        05 WS-I-AD-MONEDA                 PIC 9(03).                          
641900        05 WS-I-AD-REFERENCIA             PIC 9(12).                          
642000        05 WS-I-AD-ESTADO                 PIC 9(01).                          
642100        05 WS-I-AD-CLAVE-RECH             PIC 9(04).                          
642200        05 WS-I-AD-DESC-RECH              PIC X(48).                          
642300*                                                                             
642400* FORMATO DE SALIDA (SIZE 235 BYTES)                                          
642500*                                                                             
642600  01 WS-FTO-OUT-ARCHDISP.                                                     
642700     03 WS-O-AD-ARCHDISP                  PIC X(889).                         
642800     03 WS-O-AD-FUNCION1   REDEFINES WS-O-AD-ARCHDISP.                        
642900        05 WS-O-AD-EXISTE                 PIC 9(01).                          
643000        05 WS-O-AD-FILLER                 PIC X(888).                         
643100     03 WS-O-AD-FUNCION2-3 REDEFINES WS-O-AD-ARCHDISP.                        
643200        05 WS-O-AD-FINADISP               PIC 9(01).                          
643300        05 WS-O-AD-NUMREG                 PIC 9(08).                          
643400        05 WS-O-AD-MSG                    PIC X(880).                         
643500        05 WS-O-AD-MSG-R-C REDEFINES WS-O-AD-MSG.                             
643600           07 WS-O-AD-TIPO-REG            PIC 9(01).                          
643700           07 WS-O-AD-NUM-SEC             PIC 9(08).                          
643800           07 WS-O-AD-SUC                 PIC 9(04).                          
643900           07 WS-O-AD-CAJA                PIC 9(02).                          
644000           07 WS-O-AD-NUMTRAN             PIC 9(08).                          
644100           07 WS-O-AD-CLAVE-TRANS         PIC 9(04).                          
644200           07 WS-O-AD-TIPO-MOV            PIC 9(01).                          
644300           07 WS-O-AD-TIPMEDACC           PIC 9(02).                          
644400           07 WS-O-AD-TARJETA             PIC 9(16).                          
644500           07 WS-O-AD-IMPORTE             PIC 9(14)V99.                       
644600           07 WS-O-AD-MONEDA              PIC 9(03).                          
644700           07 WS-O-AD-REFERENCIA          PIC 9(12).                          
644800           07 WS-O-AD-MOV-FORZADO         PIC 9(01).                          
644900           07 WS-O-AD-FTO-VARIABLE.                                           
645000              09 WS-O-AD-FTO-VARIABLE-1   PIC X(800).                         
645100              09 WS-O-AD-FTO-VARIABLE-2   PIC X(002).                         
645200                                                                              
645300* ENTRY POINT: S500L040CAMBASE                                                
645400* FORMATO DE ENTRADA (SIZE 1 BYTES)                                           
645500  01 WS-FTO-IN-CAMBASE.                                                       
645600     03 WS-I-CB-FUNCION                   PIC 9(01).                          
645700                                                                              
645800 77 WS-L040-RESULT07                      PIC 9(02).                          
645900$POP OMIT                                                                     
646000                                                                              
646100$SET OMIT = NOT S500L040R10                                                   
646200*  ENTRY-POINT S500L040_CONINFOCTE.                                           
646300*  PARAMETRO ENTRADA:                                                         
646400 01  WS-S500-L040-ENTRADA-10.                                                 
646500     02 WS-S500-L040-10-CTE-I             PIC 9(12).                          
646600                                                                              
646700*  PARAMETRO SALIDA:                                                          
646800 01  WS-S500-L040-SALIDA-10.                                                  
646900     02 WS-S500-L040-10-CTE-S             PIC 9(12).                          
647000     02 WS-S500-L040-10-FEC-S             PIC 9(08).                          
647100     02 WS-S500-L040-10-STA-S             PIC 9(02).                          
647200     02 WS-S500-L040-10-CTO-S             PIC 9(12).                          
647300     02 WS-S500-L040-10-SIS-S             PIC 9(04).                          
647400     02 WS-S500-L040-10-PRD-S             PIC 9(04).                          
647500     02 WS-S500-L040-10-INS-S             PIC 9(04).                          
647600     02 WS-S500-L040-10-MON-S             PIC 9(02).                          
647700     02 WS-S500-L040-10-INSOP-S           PIC 9(02).                          
647800     02 WS-S500-L040-10-NINV-S            PIC 9(06).                          
647900     02 WS-S500-L040-10-STABENF-S         PIC 9(02).                          
648000$POP OMIT                                                                     
648100                                                                              
648150$POP OMIT                                                                     
648152                                                                              
648154$SET OMIT = NOT S500L081                                                      
648156******************************************************************            
648158* LIBRERIA S500/OBJECT/L081                                      *            
648160*                                                                *            
648162* ENTRYPOINTS                                                    *            
648164*   S500L081INICIO       PRIMER LLAMADO A LA LIBRERIA            *            
648166*   S500L081CONSULTACTO  CONSULTA DATOS DE CONTRATO              *            
648168*   S500L081HIS          ENVIO DE HIS                            *            
648170*                                                                *            
648172* RESULT DE LA LIBRERIA                                          *            
648174*   01 FUNCION NO VALIDA                                         *            
648176*   02 TIPO DE MEDIO DE ACCESO NO VALIDO                         *            
648178*   03 MEDIO DE ACCESO NO VALIDO                                 *            
648180*   04 NUMERO DE OCURRENCIA NO VALIDO                            *            
648182*   05 TIPO DE REGISTRO NO VALIDO                                *            
648184*   06 CSI NO VALIDO                                             *            
648186*   07 ORIGEN NO VALIDO                                          *            
648188*   08 AGRUPADOR NO VALIDO                                       *            
648190*   09 INDIC DE CTA ORDENANTE NO VALIDO                          *            
648192*   10 HI NO VALIDO                                              *            
648194*   11 SISTEMA NO VALIDO                                         *            
648196*   12 PASO NO VALIDO                                            *            
648198*   13 BASE DE DATOS NO DISPONIBLE                               *            
648200*   14 REGITRO DE CONTROL NO EXISTE                              *            
648202*   15 REGISTRO DE CONTRATO NO EXISTE                            *            
648204*   16 ERROR EN BASE DE DATOS                                    *            
648206*   17 LLAMADO S016 DESACTIVADO                                  *            
648208*   18 LLAMADO S016 ERRONEO                                      *            
648210*   19 NO HA INICIADO LIBRERIA                                   *            
648212*   20 FECHA DE PROCESO NO VALIDA                                *            
648214*   21 FECHA DE CTA ORDENTANTE NO VALIDA                         *            
648216*   22 HORA CTA ORDENANTE NO VALIDA                              *            
648218******************************************************************            
648220 77 WS-S500L081-RESULT                   PIC 9(02).                           
648222 77 WS-S500L081-RESULT-INI               PIC 9(02).                           
648223 77 WS-S500L081-RESULT-CTO               PIC 9(02).                           
648224                                                                              
648226*ENTRYPOINT S500L081INICIO                                                    
648228*                                                                             
648230 01 WS-S500L081-INI-I WITH LOWER-BOUNDS.                                      
648232    02 WS-S500L081-1-SIS-I               PIC 9(04).                           
648234    02 WS-S500L081-1-PAS-I               PIC 9(02).                           
648236                                                                              
648238*ENTRYPOINT S500L081HIS                                                       
648240*                                                                             
648242 01 WS-S500L081-HIS-I WITH LOWER-BOUNDS.                                      
648244    02 WS-S500L081-2-NUM-I               PIC 9(04).                           
648246                                                                              
648248*ENTRYPOINT S500L081CONSULTACTO                                               
648250*                                                                             
648252 01 WS-S500L081-CONCTO-I WITH LOWER-BOUNDS.                                   
648254    02 WS-S500L081-3-FUNCION-I          PIC 9(02).                            
648256    02 WS-S500L081-3-TIPMEDACC-I        PIC 9(02).                            
648258    02 WS-S500L081-3-TARJETA-I          PIC 9(16).                            
648260    02 WS-S500L081-3-CTACTO                                                   
648262       REDEFINES WS-S500L081-3-TARJETA-I.                                     
648264       03 WS-S500L081-3-SUC-I           PIC 9(04).                            
648266       03 WS-S500L081-3-CTACTO-I        PIC 9(12).                            
648268    02 FILLER                           PIC 9(12).                            
648270*                                                                             
648272 01 WS-S500L081-CONCTO-O WITH LOWER-BOUNDS.                                   
648274    02 WS-S500L081-3-DATOS-O            PIC X(802).                           
648276    02 WS-S500L081-3-MARCA-O                                                  
648278       REDEFINES WS-S500L081-3-DATOS-O.                                       
648280       03 WS-S500L081-3-IND-MARORD-O    PIC 9(02).                            
648282       03 WS-S500L081-3-IND-FECMCO-O    PIC 9(08).                            
648284       03 FILLER                        PIC X(792).                           
648286$POP OMIT                                                                     
648300                                                                              
648302******************************************************************            
648304* LIBRERIA S500/OBJECT/L050/VALDYR                               *            
648306*                                                                *            
648308* RESULT QUE REGRESA LA LIBRERIA:                                *            
648310*                                                                *            
648312*   0- OK.                                                       *            
648314*   1- FUNCION INCORRECTA                                        *            
648316*   2- INDICADOR BATCH-LINEA INCORRECTO                          *            
648318*   3- TIPO DE PROCESO NO VALIDO PARA LA FUNCION SOLICITADA      *            
648320*   4- NUMERO DE COPIA INVALIDA                                  *            
648322*   5- CLIENTE EN CEROS                                          *            
648324*   6- IMPORTE EN CEROS                                          *            
648326*   7- IND_DEP_RET ERRONEO                                       *            
648328*   8- IND MOV FORZADO ERRONEO                                   *            
648330*   9- CLIENTE BLOQUEADO RETIRO EFECTIVO                         *            
648332*  10- LIMITE DE RETIRO DIARIO ALCANZADO                         *            
648334*  11- LIMITE DE RETIRO MENSUAL ALCANZADO                        *            
648336*                                                                *            
648338* ENTRYPOINTS:                                                   *            
648340*                                                                *            
648342*  S500L050VALDYR: UTILIZADO PARA LAS SIGUIENTES FUNCIONES       *            
648344*      1.- LEVANTAR LA LIBRERIA POR PRIMERA VEZ                  *            
648346*      2.- ALTA DE MOVIMIENTOS, PARA VALIDACION DE LIMITES       *            
648348*      3.- ELIMINACION DE MOVIMIENTOS                            *            
648350*      4.- CAMBIO DE PROCESO (LINEA, BATCH, PRELINEA, CIERRA BD) *            
648352*                                                                *            
648354*      DATOS DE ENTRADA:                                         *            
648356*            WS-S500-0501-I                                      *            
648358*                                                                *            
648360*      DATOS DE SALIDA:                                          *            
648362*            WS-S500-0501-O                                      *            
648364*                                                                *            
648366*      RESULTS:                                                  *            
648368*            WS-S500L050-RESULT                                  *            
648370*                                                                *            
648372******************************************************************            
648374 77 WS-S500L050-RESULT                     PIC 9(04).                         
648375                                                                              
648376 01 WS-S500-0501-I                    PIC X(56) WITH LOWER-BOUNDS.            
648378 01 WS-S500-0501-I-VALDYR REDEFINES WS-S500-0501-I.                           
648380    03 WS-S500-0501-I-FUNCION              PIC 9(02).                         
648382    03 WS-S500-0501-I-NUM-CLIENTE          PIC 9(12).                         
648384    03 WS-S500-0501-I-IMPORTE              PIC 9(16)V99.                      
648386    03 WS-S500-0501-I-IND-DYR              PIC 9(02).                         
648388       88 WS-S500-0501-I-DEPOSITO          VALUE 1.                           
648390       88 WS-S500-0501-I-RETIRO            VALUE 2.                           
648392    03 WS-S500-0501-I-BANCO-EMISOR         PIC 9(04).                         
648394    03 WS-S500-0501-I-MOV-FORZADO          PIC 9(02).                         
648396       88 WS-S500-0501-I-NOFORZADO         VALUE 0.                           
648398       88 WS-S500-0501-I-SIFORZADO         VALUE 1.                           
648400    03 WS-S500-0501-I-TIPO-PROCESO         PIC 9(02).                         
648402       88 WS-S500-0501-I-LINEA             VALUE 0.                           
648404       88 WS-S500-0501-I-BATCH             VALUE 1.                           
648405       88 WS-S500-0501-I-PRELINEA          VALUE 2.                           
648406       88 WS-S500-0501-I-CIERRA-BD         VALUE 3.                           
648407    03 WS-S500-0501-I-COPIA                PIC 9(02).                         
648408    03 WS-S500-0501-I-SUCOPER              PIC 9(04).                         
648409    03 WS-S500-0501-I-CAJOPER              PIC 9(02).                         
648410*INI ECC CONTROL DYR FII                                                      
648411    03 WS-S500-0501-I-TIPPERCTE            PIC 9(02).                         
648412    03 WS-S500-0501-I-UBICGEOCTE           PIC 9(02).                         
648413    03 WS-S500-0501-I-CSICTE               PIC 9(02).                         
648414*FIN ECC CONTROL DYR FII                                                      
648416****03 FILLER                              PIC X(07).                         
648418                                                                              
648420 01 WS-S500-0501-O                    PIC X(22) WITH LOWER-BOUNDS.            
648422                                                                              
648424 01 WS-S500-0501-O-VALDYR REDEFINES WS-S500-0501-O.                           
648426    03 WS-S500-0501-O-IND-RIESGO           PIC 9(02).                         
648428    03 WS-S500-0501-O-SALDO-CONG           PIC 9(16)V99.                      
648430    03 WS-S500-0501-O-IND-VALIDACION       PIC 9(02).                         
648432       88 WS-S500-0501-I-FUNC-03           VALUE 0.                           
648434       88 WS-S500-0501-I-VAL-GUARDA        VALUE 1.                           
648436       88 WS-S500-0501-I-NOVAL-NOGUARDA    VALUE 2.                           
648438       88 WS-S500-0501-I-VALIDA-NOGUARDA   VALUE 3.                           
648440       88 WS-S500-0501-I-ELIM-SIN-GUARDA   VALUE 4.                           
648441    03 WS-S500-0501-O-IND-SUP-LIM          PIC 9(02).                         
648443       88 WS-S500-0501-I-NO-SUPLIM-DEP     VALUE 0.                           
648445       88 WS-S500-0501-I-SUPLIM-D-DEP      VALUE 1.                           
648447       88 WS-S500-0501-I-SUPLIM-M-DEP      VALUE 2.                           
648449       88 WS-S500-0501-I-SUPLIM-DYM-DEP    VALUE 3.                           
648452****03 FILLER                              PIC X(24).                         
648453                                                                              
648454 01 WS-RESULT-S500L050                     PIC 9(04).                         
648464    88 WS-ERROR-FOR-ACUM-DYR               VALUE 5,6,7,8,12,15.               
648473 01 WS-IND-VALIDACION-S500L050             PIC 9(02).                         
648474                                                                              
648500 01 WS-S500-0502-I                    PIC X(06) WITH LOWER-BOUNDS.            
648510 01 WS-S500-0502-I-VALDYR REDEFINES WS-S500-0502-I.                           
648512    03 WS-S500-0502-I-NUMHI           PIC 9(06).                              
648514                                                                              
649000$SET OMIT = NOT S080BANCOS                                                    
649010*****************************************************************             
649012*                  SISTEMA : S080 ESTRUCTURA                    *             
649014*                 LIBRERIA : L700 CONSULTA                      *             
649016*                   MANUAL : USUARIO                            *             
649018*              ENTRY POINT : L700_CONSUL_DESC                   *             
649029* IDENTIFICADOR EN CTLVERS : S080BD01CON                        *             
649100*                                                               *             
649200* EL CATALOGO DE BANCOS DEL PAIS ES EL NUM. 168, EL  CUAL  SOLO *             
649300* TIENE UNA LLAVE (EL NUMERO DE BANCO) Y SU DESCRIPCION (NOMBRE *             
649400* DEL BANCO).                                                   *             
649500*                                                               *             
649600* FUNCION DEL ENTRY POINT:                                      *             
649700*                                                               *             
649800* CON ESTA CONSULTA SE OBTIENE LA INFORMACION REFERENTE  A  LOS *             
649900* REGISTROS DE DETALLE DE  UN  CATALOGO  DESCRIPTIVO;  DONDE  A *             
650000* PARTIR DE UN NUMERO DE CATALOGO Y LA CLAVE DE REGISTRO Y/O LA *             
650100* CLAVE DE REGISTRO ASOCIADO, SE PROPORCIONAN LAS DESCRIPCIONES *             
650200* SOLICITADAS.                                                  *             
650300*                                                               *             
650400* SI SE QUIERE CONSULTAR  A  PARTIR  DEL  PRIMER  REGISTRO  DEL *             
650500* CATALOGO, LA CLAVE DE REGISTRO / CLAVE DE  REGISTRO  ASOCIADO *             
650600* DEBE SER CERO.                                                *             
650700*                                                               *             
650800* PARAMETROS DE ENTRADA:                                        *             
650900*                                                               *             
651000* WS-S080-L700CD-SISTEMA-I     = NUMERO DE SISTEMA LLAMADOR     *             
651100* WS-S080-L700CD-NUMPROG-I     = NUMERO DE PROGRAMA LLAMADOR    *             
651200* WS-S080-L700CD-PARAMETROW-ENT = AREA DE ENTRADA                *            
651300*   WS-S080-L700CD-CATALOGO-I  = NUMERO DE CATALOGO A CONSULTAR *             
651400*   WS-S080-L700CD-CLAVE-CONS-I= CLAVE DE CONSULTA              *             
651500*                                20 = REGISTROS (LA UNICA HOYDIA*             
651600*   WS-S080-L700CD-ORDEN-BUSCA-I   =BAJO QUE ORDEN SE REALIZA   *             
651700*                                   LA BUSQUEDA                 *             
651800*                                   01 CLAVE DE REGISTRO        *             
651900*                                   02 CLAVE DE REGISTRO ASOCIAD*             
652000*   WS-S080-L700CD-NUM-REGS-I  = NUMERO DE REGISTROS SOLICITADOS*             
652100*   WS-S080-L700CD-CVE-REG-I   = CLAVE DE ELEMENTO SOLICITADO   *             
652200*   WS-S080-L700CD-CVE-REG-ASO-I=CLAVE DE ELEMENTO ASOCIADO     *             
652300*   WS-S080-L700CD-NIVEL-INI-I = NIVEL POR EL CUAL SE REALIZARA *             
652400*           LA BUSQUEDA. ESTE ES UN DATO PROPORCIONADO  POR  LA *             
652500*           LIBRERIA, POR LO  TANTO ,  EN  LA  PRIMERA  LLAMADA *             
652600*           DEBERA LLEVAR CERO Y EN LAS SIGUIENTES SE LE MOVERA *             
652700*           EL QUE REGRESE LA LIBRERIA.                         *             
652800*   WS-S080-L700CD-FEC-INI-CONS-I=FECHA DE CONSULTA.            *             
652900*   FILLER                                                      *             
653000*                                                               *             
653100* PARAMETROS DE SALIDA:                                         *             
653200*                                                               *             
653300* WS-S080-L700CD-RESULT        = RESULTADO DE LA CONSULTA       *             
653400*         00  OPERACION REALIZADA OK Y NO EXISTEN MAS REGISTROS *             
653500*         01  OPERACION REALIZADA OK Y EXISTEN MAS REGISTROS    *             
653600*         02  LONGITUD DEL PARAMETRO DE SALIDA INSUFICIENTE     *             
653700*         20  NO EXISTE REGISTRO                                *             
653800*         30  OPCION INVALIDA                                   *             
653900*         33  NO EXISTE CATALOGO (REGISTRO DE CONTROL)          *             
654000*         40  CATALOGO NO TIENE ESTA LLAVE DE ACCESO            *             
654100*         90  PROBLEMAS CON LA BASE DE DATOS                    *             
654200*         99  LIBRERIA EN PROBLEMAS                             *             
654300* WS-S080-L700CD-PARAMETRO-SAL                                  *             
654400*   WS-S080-L700CD-NUM-REGS-S  = NUMERO DE REGISTROS REGRESADOS *             
654500*   WS-S080-L700CD-CATALOGO-S  = NUM DE CATALOGO CONSULTADO     *             
654600*   WS-S080-L700CD-FEC-INI-CONS-S= FECHA DE CONSULTA REALIZADA  *             
654700*   WS-S080-L700CD-NIVEL-INI-S = NIVEL PARA SIGUIENTE BUSQUEDA  *             
654800*   WS-S080-L700CD-REGISTROS-S                                  *             
654900*                  OCCURS DEPENDING ON WS-S080-L700CD-NUM-REGS-S*             
655000*     WS-S080-L700CD-CVE-REG-S = CLAVE DEL REGISTRO             *             
655100*     WS-S080-L700CD-CVE-REG-ASO-S= CLAVE DEL REGISTRO ASOCIADO *             
655200*     WS-S080-L700CD-TXT-LARGO-S= DESCRIPCION LARGA             *             
655300*     WS-S080-L700CD-TXT-CORTO-S = DESCRIPCION CORTA            *             
655400*     WS-S080-L700CD-TXT-PANTALLA-S = DESCRIPCION PARA          *             
655500*                                   PRESENTACION EN PANTALLA    *             
655600*     WS-S080-L700CD-TXT-ABRV-S = ABREVIATURA                   *             
655700*     WS-S080-L700CD-FEC-ALTA-S = FECHA DE ALTA DEL REGISTRO    *             
655800*     WS-S080-L700CD-FEC-BAJA-S = FECHA DE BAJA DEL REGISTRO    *             
655900*     WS-S080-L700CD-FEC-ULTMOD-S = FECHA DE ULTIMA MODIFICACION*             
656000*     FILLER                                                    *             
656100*                                                               *             
656200*                                                               *             
656300*****************************************************************             
656400                                                                              
656500 77 WS-S080-L700CD-SISTEMA-I              PIC S9(11) BINARY.                  
656600 77 WS-S080-L700CD-NUMPROG-I              PIC S9(11) BINARY.                  
656700 01 WS-S080-L700CD-PARAMETRO-ENT.                                             
656800    02 WS-S080-L700CD-CATALOGO-I          PIC 9(06) COMP.                     
656900    02 WS-S080-L700CD-CLAVE-CONS-I        PIC 9(02) COMP.                     
657000    02 WS-S080-L700CD-ORDEN-BUSCA-I       PIC 9(02) COMP.                     
657100    02 WS-S080-L700CD-NUM-REGS-I          PIC 9(02) COMP.                     
657200    02 WS-S080-L700CD-CVE-REG-I           PIC X(12).                          
657300    02 WS-S080-L700CD-CVE-REG-ASO-I       PIC X(12).                          
657400    02 WS-S080-L700CD-NIVEL-INI-I         PIC 9(02) COMP.                     
657500    02 WS-S080-L700CD-FEC-INI-CONS-I      PIC 9(06) COMP.                     
657600    02 FILLER                             PIC X(14).                          
657700                                                                              
657800 77 WS-S080-L700CD-RESULT                 PIC S9(11) BINARY.                  
657900 01 WS-S080-L700CD-PARAMETRO-SAL.                                             
658000    02 WS-S080-L700CD-NUM-REGS-S          PIC 9(02) COMP.                     
658100    02 WS-S080-L700CD-CATALOGO-S          PIC 9(06) COMP.                     
658200    02 WS-S080-L700CD-FEC-INI-CONS-S      PIC 9(06) COMP.                     
658300    02 WS-S080-L700CD-NIVEL-INI-S         PIC 9(02) COMP.                     
658400    02 WS-S080-L700CD-REGISTROS-S OCCURS 1 TO 10                              
658500                      DEPENDING ON WS-S080-L700CD-NUM-REGS-S.                 
658600       03 WS-S080-L700CD-CVE-REG-S        PIC X(12).                          
658700       03 WS-S080-L700CD-CVE-REG-ASO-S    PIC X(12).                          
658800       03 WS-S080-L700CD-TXT-LARGO-S      PIC X(40).                          
658900       03 WS-S080-L700CD-TXT-CORTO-S      PIC X(20).                          
659000       03 WS-S080-L700CD-TXT-PANTALLA-S   PIC X(12).                          
659100       03 WS-S080-L700CD-TXT-ABRV-S       PIC X(05).                          
659200       03 WS-S080-L700CD-FEC-ALTA-S       PIC 9(06) COMP.                     
659300       03 WS-S080-L700CD-FEC-BAJA-S       PIC 9(06) COMP.                     
659400       03 WS-S080-L700CD-FEC-ULTMOD-S     PIC 9(06) COMP.                     
659500       03 FILLER                          PIC X(10).                          
659600                                                                              
659700$POP OMIT                                                                     
659800$SET OMIT = NOT S016L422R08                                                   
659900*********************************************************                     
660000***    PARAMETROS  S016_L422_CON_XMEDIO  (78)         ***                     
660100****   CONSULTA B08MEDIOS                              **                     
660200*********************************************************                     
660300 77  R422-78-CTR-ERROR                    PIC S9(11) BINARY.                  
660400                                                                              
660500 01  E422-78-CTR-ENTRADA.                                                     
660600     03 E422-78-MDA-NUMERO                PIC 9(016) COMP.                    
660700     03 E422-78-MDA-RED     REDEFINES     E422-78-MDA-NUMERO.                 
660800        05 E422-78-MDA-NUMPREF            PIC 9(004) COMP.                    
660900        05 E422-78-MDA-NUM                PIC 9(012) COMP.                    
661000     03 FILLER                            PIC X(052).                         
661100                                                                              
661200 01  S422-78-CTR-SALIDA.                                                      
661300     03 S422-78-CTR-NUMCSI                PIC  9(002) COMP.                   
661400     03 S422-78-CTE-NUM                   PIC  9(012) COMP.                   
661500     03 S422-78-CTA-NUMPROD               PIC  9(004) COMP.                   
661600     03 S422-78-CTA-CVEINST               PIC  9(002) COMP.                   
661700     03 S422-78-CTA-NUMPREF               PIC  9(004) COMP.                   
661800     03 S422-78-CTA-NUM                   PIC  9(012) COMP.                   
661900     03 S422-78-MDA-CVETIPO               PIC  9(002) COMP.                   
662000     03 S422-78-MDA-SUBTIPO               PIC  9(002) COMP.                   
662100     03 S422-78-MDA-CVETIT                PIC  9(002) COMP.                   
662200     03 S422-78-MDA-NUMPREF               PIC  9(004) COMP.                   
662300     03 S422-78-MDA-NUM                   PIC  9(012) COMP.                   
662400     03 S422-78-MDA-ABRPROFT              PIC  X(003).                        
662500     03 S422-78-CTR-PTRNOMT               PIC  9(004) COMP.                   
662600     03 S422-78-MDA-ABRPROFC              PIC  X(003).                        
662700     03 S422-78-CTR-PTRNOMC               PIC  9(004) COMP.                   
662800     03 S422-78-MDA-NUMTALON              PIC  9(002) COMP.                   
662900     03 S422-78-MDA-CHQXTALON             PIC  9(002) COMP.                   
663000     03 S422-78-MDA-CVEPIN                PIC  9(006) COMP.                   
663100     03 S422-78-MDA-CVESTATUS             PIC  9(002) COMP.                   
663200     03 S422-78-MDA-FECALTA-2K            PIC  9(008) COMP.                   
663300     03 S422-78-MDA-FECULTMOD-2K          PIC  9(008) COMP.                   
663400     03 S422-78-MDA-FECULTACC-2K          PIC  9(008) COMP.                   
663500     03 S422-78-MDA-FECVENC-2K            PIC  9(008) COMP.                   
663600     03 S422-78-MDA-FECCANCEL-2K          PIC  9(008) COMP.                   
663700     03 S422-78-MDA-FECPREV               PIC  9(006) COMP.                   
663800     03 S422-78-MDA-FECMODPIN-2K          PIC  9(008) COMP.                   
663900     03 S422-78-MDA-HHPREV                PIC  9(004) COMP.                   
664000     03 S422-78-MDA-HHALTA                PIC  9(004) COMP.                   
664100     03 S422-78-MDA-HHULTMOD              PIC  9(004) COMP.                   
664200     03 S422-78-MDA-HHULTACC              PIC  9(004) COMP.                   
664300     03 S422-78-MDA-HHVENC                PIC  9(004) COMP.                   
664400     03 S422-78-MDA-PERIODO               PIC  9(002) COMP.                   
664500     03 S422-78-MDA-SITUACION             PIC  X(004).                        
664600     03 FILLER                            PIC  X(021).                        
664700                                                                              
664800                                                                              
664900 01  S422-78-RCTR-SALIDA REDEFINES S422-78-CTR-SALIDA.                        
665000     03 S422-78-CTR-ERROR                 PIC 9(004) COMP.                    
665100     03 S422-78-CTR-ERRORTYPE             PIC 9(004) COMP.                    
665200     03 S422-78-CTR-STRUCTURE             PIC 9(004) COMP.                    
665300     03 FILLER                            PIC 9(102) COMP.                    
665400                                                                              
665500$POP OMIT                                                                     
665600$SET OMIT = NOT S016L422R09                                                   
665700********************************************************                      
665800*  PARAMETROS               S016_L422_CTASREL (07)   ***                      
665900*  CONSULTA B07CTACTA, MULTIPLE (NUMREG E/S)         ***                      
666000********************************************************                      
666100 01 E422-07-CTR-ENTRADA.                                                      
666200    02 E422-07-CTR-NUMCSI           PIC 9(02) COMP.                           
666300    02 E422-07-CTR-NUMSIST          PIC 9(04) COMP.                           
666400    02 E422-07-CTR-NUMPASO          PIC 9(04) COMP.                           
666500    02 E422-07-CTE-NUM              PIC 9(12) COMP.                           
666600    02 E422-07-CTA-NUMPROD          PIC 9(04) COMP.                           
666700    02 E422-07-CTA-CVEINST          PIC 9(04) COMP.                           
666800    02 E422-07-CTO-NUM.                                                       
666900          05 E422-07-CTA-NUMPREF    PIC 9(04) COMP.                           
667000          05 E422-07-CTA-NUM        PIC 9(12) COMP.                           
667100    02 E422-07-CTA-NUMPRODREL       PIC 9(04) COMP.                           
667200    02 E422-07-CTA-CVEINSTREL       PIC 9(04) COMP.                           
667300    02 E422-O7-CTA-CTONUMREL.                                                 
667400          05 E422-07-CTA-NUMPREFREL PIC 9(04) COMP.                           
667500          05 E422-07-CTA-NUMREL     PIC 9(12) COMP.                           
667600    02 E422-07-CTR-CVERELCTA        PIC 9(02) COMP.                           
667700    02 E422-07-CTR-NUMREG           PIC 9(02) COMP.                           
667800    02 FILLER                       PIC X(18).                                
667900** SIZE ENTRADA X(60)                                                         
668000 01 S422-07-CTR-SALIDA.                                                       
668100    02 S422-07-CTR-NUMREG           PIC 9(02) COMP.                           
668200    02 S422-07-CTR-REGISTRO  OCCURS 50 TIMES.                                 
668300       03 S422-07-CTR-NUMCSI        PIC 9(02) COMP.                           
668400       03 S422-07-CTE-NUM           PIC 9(12) COMP.                           
668500       03 S422-07-CTA-NUMPROD       PIC 9(04) COMP.                           
668600       03 S422-07-CTA-CVEINST       PIC 9(02) COMP.                           
668700       03 S422-07-CTO-NUM.                                                    
668800          05 S422-07-CTA-NUMPREF    PIC 9(04) COMP.                           
668900          05 S422-07-CTA-NUM        PIC 9(12) COMP.                           
669000       03 S422-07-CTR-CVERELCTA     PIC 9(02) COMP.                           
669100       03 S422-07-CTA-NUMPRODREL    PIC 9(04) COMP.                           
669200       03 S422-07-CTA-CVEINSTREL    PIC 9(02) COMP.                           
669300       03 S422-07-CTA-CTONUMREL.                                              
669400          05 S422-07-CTA-NUMPREFREL PIC 9(04) COMP.                           
669500          05 S422-07-CTA-NUMREL     PIC 9(12) COMP.                           
669600       03 S422-07-CTA-FECALTA-2K    PIC 9(08) COMP.                           
669700       03 S422-07-CTA-FECULTMOD-2K  PIC 9(08) COMP.                           
669800       03 FILLER                    PIC X(34).                                
669900                                                                              
670000                                                                              
670100 77  R422-07-CTR-ERROR              PIC S9(11) BINARY.                        
670200$POP OMIT                                                                     
670300$SET OMIT = NOT S016L422R10                                                   
670400********************************************************                      
670500*  PARAMETROS          S016_L422_B48INTERC_CTE       ***                      
670600*  CONSULTA CLAVE INTERCOMPANY S422-10-CVE-INTERC    ***                      
670700********************************************************                      
670800 01 E422-10-CTR-ENTRADA.                                                      
670900    02 E422-10-CTE-NUM              PIC 9(12)  COMP.                          
671000    02 FILLER                       PIC X(004).                               
671100                                                                              
671200                                                                              
671300 01 S422-10-CTR-SALIDA.                                                       
671400    02 S422-10-CTE-NUM              PIC 9(12)  COMP.                          
671500    02 S422-10-CVE-INTERC           PIC 9(05)  COMP.                          
671600    02 S422-10-FEC-ALTA             PIC 9(08)  COMP.                          
671700    02 S422-10-FEC-ULTMOD           PIC 9(08)  COMP.                          
671800    02 S422-10-CVE-STATUS           PIC 9(02)  COMP.                          
671900                                                                              
672000 77 R422-10-CTR-ERROR               PIC S9(11) BINARY.                        
672100                                                                              
672200$POP OMIT                                                                     
672300*INI FSW                  P07-120 REQ3                    ABARBOSA            
672400$SET OMIT = NOT S016L422R11                                                   
672500********************************************************                      
672600*  PARAMETROS          S016_L422_B07SXCTARELCREDCH   ***                      
672700*  CONSULTA CREDICHEQUERA                            ***                      
672800********************************************************                      
672900 01 E422-127-CTR-ENTRADA.                                                     
673000    03 E422-127-CTA-NUMPROREL     PIC 9(004) COMP.                            
673100    03 E422-127-CTA-CVEINSREL     PIC 9(004) COMP.                            
673200    03 E422-127-CTA-NUMPREREL     PIC 9(004) COMP.                            
673300    03 E422-127-CTA-NUMREL        PIC 9(012) COMP.                            
673400    03 E422-127-OPCION            PIC 9(002) COMP.                            
673500    03 FILLER                     PIC X(54).                                  
673600                                                                              
673700 01 S422-127-CTR-SALIDA.                                                      
673800    03 S422-127-CTR-NUMCSI        PIC 9(002) COMP.                            
673900    03 S422-127-CTE-NUM           PIC 9(012) COMP.                            
674000    03 S422-127-CTA-NUMPROD       PIC 9(004) COMP.                            
674100    03 S422-127-CTA-CVEINST       PIC 9(004) COMP.                            
674200    03 S422-127-CTA-NUMCTO        PIC 9(016) COMP.                            
674300    03 S422-127-CTA-NUMCTORED REDEFINES S422-127-CTA-NUMCTO.                  
674400       05 S422-127-CTA-NUMPREF    PIC 9(004) COMP.                            
674500       05 S422-127-CTA-NUM        PIC 9(012) COMP.                            
674600    03 S422-127-CTR-CVERELCTA     PIC 9(002) COMP.                            
674700    03 S422-127-CTA-NUMPROREL     PIC 9(004) COMP.                            
674800    03 S422-127-CTA-CVEINSREL     PIC 9(004) COMP.                            
674900    03 S422-127-CTA-NUMCTOREL     PIC 9(016) COMP.                            
675000    03 S422-127-CTA-NUMCTORELRED REDEFINES S422-127-CTA-NUMCTOREL.            
675100       05 S422-127-CTA-NUMPREREL  PIC 9(004) COMP.                            
675200       05 S422-127-CTA-NUMREL     PIC 9(012) COMP.                            
675300    03 S422-127-CTA-FECALTA       PIC 9(008) COMP.                            
675400    03 S422-127-CTA-FECULTMOD     PIC 9(008) COMP.                            
675500                                                                              
675600 77 R422-127-CTR-ERROR            PIC S9(11) BINARY.                          
675700                                                                              
675800$POP OMIT                                                                     
675900*FIN FSW                  P07-120 REQ3                    ABARBOSA            
676000$SET OMIT = NOT S016L422R12                                                   
676100*****************************************************************             
676200* PARAMETROS PARA ENTRY POINT S016_L422_B08SXCTECTATIPOTIT (96)**             
676300*  AMPLIACI¿N DEL S016_L422_CTAMEDIO (61)                    ****             
676400*  YA QUE UTILIZA el MDA-CVETIT UN ELEMENTO MAS EN LA LLAVE     *             
676500*****************************************************************             
676600*   PARAMETRO DE ENTRADA :                                                    
676700                                                                              
676800           01    E422-96-CTR-ENTRADA.                                         
676900             02    E422-96-CTA-NUMPROD          PIC 9(04) COMP.               
677000* N³mero de producto del que se desea la inf.                                 
677100             02    E422-96-CTA-CVEINST          PIC 9(04) COMP.               
677200* Clave del instrumento que se desea conocer                                  
677300             02    E422-96-CTA-NUMPREF          PIC 9(04) COMP.               
677400*Prefijo de la cuenta                                                         
677500             02    E422-96-CTA-NUM              PIC 9(12) COMP.               
677600* Numero de la cuenta                                                         
677700             02    E422-96-MDA-CVETIPO          PIC 9(02) COMP.               
677800* Numero de clave relativa                                                    
677900             02    E422-96-OPCION               PIC 9(02) COMP.               
678000* Clave de opcion seleccionada                                                
678100*   00  Cualquier cuenta que encuentres                                       
678200*   10   "  y con llave completa.                                             
678300*   01  Cuenta MDA-CVESTATUS = 21                                             
678400*   11   "  y con llave completa.                                             
678500*   02  Cuenta MDA_CVESTATUS NEQ 21                                           
678600*   12   "  y con llave completa.                                             
678700             02    E422-96-CTR-NUMCSI           PIC 9(02) COMP.               
678800             02    E422-96-CTE-NUM              PIC 9(12) COMP.               
678900             02    E422-96-MDA-CVETIT           PIC 9(02) COMP.               
679000             02    FILLER                       PIC X(33).                    
679100                                                                              
679200                                                                              
679300* SIZE ENTRADA X(60)                                                          
679400*--------- PARAMETRO DE SALIDA                                                
679500                                                                              
679600   01  S422-96-CTR-SALIDA.                                                    
679700        02 S422-96-CTR-REGISTRO.                                              
679800           03 S422-96-CTR-ERR.                                                
679900              04 S422-96-CTR-ERROR        PIC 9(04) COMP.                     
680000              04 S422-96-CTR-ERRORTIPO    PIC 9(04) COMP.                     
680100              04 S422-96-CTR-ESTRUCTURA   PIC 9(04) COMP.                     
680200           03 S422-96-CTR-NUMCSI          PIC 9(02) COMP.                     
680300           03 S422-96-CTE-NUM             PIC 9(12) COMP.                     
680400           03 S422-96-CTA-NUMPROD         PIC 9(04) COMP.                     
680500           03 S422-96-CTA-CVEINST         PIC 9(02) COMP.                     
680600           03 S422-96-CTA-NUMCTO.                                             
680700              04 S422-96-CTA-NUMPREF      PIC 9(04) COMP.                     
680800              04 S422-96-CTA-NUM          PIC 9(12) COMP.                     
680900           03 S422-96-MDA-CVETIPO         PIC 9(02) COMP.                     
681000           03 S422-96-MDA-SUBTIPO         PIC 9(02) COMP.                     
681100           03 S422-96-MDA-CVETIT          PIC 9(02) COMP.                     
681200           03 S422-96-MDA-NUMCTO.                                             
681300              04 S422-96-MDA-NUMPREF      PIC 9(04) COMP.                     
681400              04 S422-96-MDA-NUM          PIC 9(12) COMP.                     
681500           03 S422-96-MDA-NUMTALON        PIC 9(02) COMP.                     
681600           03 S422-96-MDA-CHQXTALON       PIC 9(02) COMP.                     
681700           03 S422-96-MDA-CVEPIN          PIC 9(06) COMP.                     
681800           03 S422-96-MDA-CVESTATUS       PIC 9(02) COMP.                     
681900           03 S422-96-MDA-FECALTA-2K      PIC 9(08) COMP.                     
682000           03 S422-96-MDA-FECULTMOD-2K    PIC 9(08) COMP.                     
682100           03 S422-96-MDA-FECCANCEL-2K    PIC 9(08) COMP.                     
682200           03 S422-96-MDA-FECMODPIN-2K    PIC 9(08) COMP.                     
682300           03 FILLER                      PIC X(27).                          
682400* SIZE SALIDA X(84).                                                          
682500                                                                              
682600                                                                              
682700*  RESULTADO DE LA CONSULTA :                                                 
682800          77  R422-96-CTR-ERROR           PIC S9(11) BINARY.                  
682900                                                                              
683000$POP OMIT                                                                     
683100*                                                                             
683200$SET OMIT = NOT S016L422R13                                                   
683300*****************************************************************             
683400* ENTRY POINT S016_L422_B04XCTECTA_PROD18                       *             
683500* DE LIBRERIA S016L422 PARA SABER SI UN CLIENTE TIENE "PERMISO" *             
683600* PARA OPERAR DEPOSITOS A SU CUENTA EN EFECTIVO CON MONEDA      *             
683700* ESTRANJERA                                                    *             
683800*****************************************************************             
683900 01 E422-114-CTR-ENTRADA.                                                     
684000    03 E422-114-CTR-FILLER                PIC 9(004) COMP.                    
684100    03 E422-114-CTE-NUM                   PIC 9(012) COMP.                    
684200    03 E422-114-CTA-NUMPROD               PIC 9(004) COMP.                    
684300    03 E422-114-CTA-CVEINST               PIC 9(002) COMP.                    
684400    03 E422-114-RGOPAGO                   PIC 9(002) COMP.                    
684500                                                                              
684600 01 S422-114-CTR-SALIDA.                                                      
684700    03 S422-114-CTR-FILLER                PIC 9(004) COMP.                    
684800    03 S422-114-CTE-NUM                   PIC 9(012) COMP.                    
684900    03 S422-114-CTA-NUMPROD               PIC 9(004) COMP.                    
685000    03 S422-114-CTA-CVEINST               PIC 9(002) COMP.                    
685100    03 S422-114-RGOPAGO                   PIC 9(002) COMP.                    
685200    03 S422-114-STATUS                    PIC 9(002) COMP.                    
685300 01 S422-114-RCTR-SALIDA REDEFINES S422-114-CTR-SALIDA.                       
685400    03 S422-114-CTR-ERROR                 PIC 9(004) COMP.                    
685500    03 S422-114-CTR-ERRORTYPE             PIC 9(004) COMP.                    
685600    03 S422-114-CTR-STRUCTURE             PIC 9(004) COMP.                    
685700                                                                              
685800 77 R422-114-CTR-ERROR                    PIC S9(11) BINARY.                  
685900*   0     CONSULTA OK - EL CLIENTE SI TIENE "PERMISO" PARA RECIBIR            
686000*                       DEPOSITOS EN MONEDA ENTRANJERA.                       
686100*   11    CONSULTA OK - LA CONSULTA FUE EXITOSA PERO EL CLIENTE               
686200*                       NO TIENE "PERMISO " PARA RECIBIR DEPOSITOS            
686300*                       EN MONEDA EXTRANJERA.                                 
686400*   XX    ERROR       - DESPLEGAR EL ERROR EN DISPLAY A LOG.                  
686500                                                                              
686600$POP OMIT                                                                     
686601                                                                              
686602$SET OMIT = NOT S016L422R14                                                   
686603*****************************************************************             
686604* ENTRY POINT S016_L422_B77PORTABNOM                            *             
686605* DE LIBRERIA S016L422 PARA SABER SI UN CLIENTE TIENE CONTRATADO*             
686606* EL SERVICIO DE PORTABILIDAD                                   *             
686607*****************************************************************             
686608 01 E422-167-CTR-ENTRADA.                                                     
686609    02 E422-167-OPCION                  PIC 9(02) COMP.                       
686610*     01 =  CONSULTA POR NUMERO DE CLIENTE                                    
686611*     02 =  PAGINACION DE LA OPCION 1                                         
686612*     03 =  CONSULTA POR NUMERO DE TARJETA O CHEQUERA                         
686613*     04 =  PAGINACION OPCION 3                                               
686614*     05 =  CONSULTA POR NUMERO DE CLIENTE Y NUMERO DE TARJETA                
686615     02 E422-167-CTE-NUM                 PIC 9(12) COMP.                      
686616     02 E422-167-MDA-NUMCTO              PIC 9(16) COMP.                      
686618     02 E422-167-MDA-NUMCTO-R REDEFINES E422-167-MDA-NUMCTO.                  
686620        04 E422-167-MDA-NUMPREF          PIC 9(04) COMP.                      
686622        04 E422-167-MDA-NUM              PIC 9(12) COMP.                      
686624     02 E422-167-CTR-FPROALTA            PIC 9(08) COMP.                      
686626 01 S422-167-CTR-SAL.                                                         
686628    02 S422-167-NUM-CTE                  PIC 9(12) COMP.                      
686630    02 S422-167-CONTINUACION             PIC 9(02) COMP.                      
686632*      01 = SI HAY MAS REGISTROS                                              
686634*      00 = NO HAY MAS REGISTROS                                              
686636    02 S422-167-OCCURS                   OCCURS 03 TIMES.                     
686638       04 S422-167-MDA-NUMPREF           PIC 9(04) COMP.                      
686640       04 S422-167-MDA-NUM               PIC 9(12) COMP.                      
686642       04 S422-167-MDA-TIP               PIC 9(02) COMP.                      
686644       04 S422-167-CTA-BANCO             PIC 9(04) COMP.                      
686646       04 S422-167-CLABE-TAR             PIC 9(20) COMP.                      
686648       04 S422-167-CTR-SOEID             PIC X(10).                           
686650       04 S422-167-CTR-FOLIO.                                                 
686652          06 S422-167-CTR-FOLIOK         PIC 9(15) COMP.                      
686654          06 S422-167-CTR-CERO           PIC 9(01) COMP.                      
686656       04 S422-167-CTR-FECALTA           PIC 9(08) COMP.                      
686658       04 S422-167-CTR-FPROALTA          PIC 9(08) COMP.                      
686660       04 S422-167-CTR-FECULTMOD         PIC 9(08) COMP.                      
686662       04 S422-167-CTR-VACIO             PIC 9(08) COMP.                      
686664       04 S422-167-CTR-BANCO2            PIC 9(06) COMP.                      
686666       04 S422-167-CTR-FOLIOALT          PIC X(30).                           
686668       04 S422-167-CTR-FOLIOBAJ          PIC X(30).                           
686670       04 S422-167-CTR-CVESTATUS         PIC 9(02) COMP.                      
686672       04 S422-167-CTA-NUMCTO.                                                
686674          06  S422-167-CTA-NUMPREF       PIC 9(04) COMP.                      
686676          06  S422-167-CTA-NUM           PIC 9(12) COMP.                      
686678       04 S422-167-CTA-NUMPROD           PIC 9(04) COMP.                      
686680       04 S422-167-CTA-CVEINST           PIC 9(02) COMP.                      
686682                                                                              
686684 77 R422-167-CTR-ERROR                   PIC S9(11) BINARY.                   
686686                                                                              
686688$POP OMIT                                                                     
686700                                                                              
686800$SET OMIT = NOT CRONOS                                                        
686900 01 WKS-FEC-CONV-AAMD                     PIC 9(08).                          
687000 01 WKS-FEC-CONV-AAMD-R REDEFINES WKS-FEC-CONV-AAMD.                          
687100    02 WKS-FEC-CONV-AAMD-AAAA             PIC 9(04).                          
687200    02 WKS-FEC-CONV-AAMD-AAAA-R REDEFINES WKS-FEC-CONV-AAMD-AAAA.             
687300       03 WKS-FEC-CONV-AAMD-AAAA-SS       PIC 9(02).                          
687400       03 WKS-FEC-CONV-AAMD-AAAA-DD       PIC 9(02).                          
687500    02 WKS-FEC-CONV-AAMD-MM               PIC 9(02).                          
687600    02 WKS-FEC-CONV-AAMD-DD               PIC 9(02).                          
687700                                                                              
687800$POP OMIT                                                                     
687900$SET OMIT = NOT GENERALSUPPORT                                                
688000 01 WKS-ARRAY-FEC-Y-HRA-MAQ       PIC X(21) WITH LOWER-BOUNDS.                
688100 01 WKS-FEC-Y-HRA-MAQ                     PIC X(21).                          
688200 01 WKS-FEC-Y-HRA-MAQ-R REDEFINES WKS-FEC-Y-HRA-MAQ.                          
688300    02 WKS-FEC-MAQ-AAMD                   PIC 9(08).                          
688400    02 WKS-FEC-MAQ-AAMD-R REDEFINES WKS-FEC-MAQ-AAMD.                         
688500       04 WKS-FEC-MAQ-AAMD-AAAA           PIC 9(04).                          
688600       04 WKS-FEC-MAQ-AAMD-MM             PIC 9(02).                          
688700       04 WKS-FEC-MAQ-AAMD-DD             PIC 9(02).                          
688800    02 WKS-HRA-MAQ-HMSC                   PIC 9(08).                          
688900    02 WKS-HRA-MAQ-HMSC-R REDEFINES WKS-HRA-MAQ-HMSC.                         
689000       03 WKS-HRA-MAQ-HMS                 PIC 9(06).                          
689100       03 WKS-HRA-MAQ-HMS-R REDEFINES WKS-HRA-MAQ-HMS.                        
689200          04 WKS-HRA-MAQ-HM               PIC 9(04).                          
689300          04 WKS-HRA-MAQ-HM-R REDEFINES WKS-HRA-MAQ-HM.                       
689400             05 WKS-HRA-MAQ-HH            PIC 9(02).                          
689500             05 WKS-HRA-MAQ-MM            PIC 9(02).                          
689600          04 WKS-HRA-MAQ-SS               PIC 9(02).                          
689700       03 WKS-HRA-MAQ-CC                  PIC 9(02).                          
689800    02 FILLER                             PIC X(05).                          
689900                                                                              
690000$POP OMIT                                                                     
690100                                                                              
690200                                                                              
690300$SET OMIT = NOT ( S500L020 OR S500L02N )                                      
690400***********************************************************                   
690500* ENTRY_POINTS DE LA LIBRERIA DE CONSULTAS DEL S500       *                   
690600*                                                         *                   
690700*                                                         *                   
690800***********************************************************                   
690900 01 WS-S500L020-INPUT                     WITH LOWER-BOUNDS.                  
691000    03 FILLER                             PIC X(90).                          
691100                                                                              
691200$SET OMIT = NOT S500L02NR01                                                   
691300 01 WS-S500L020-0101-CTO          REDEFINES WS-S500L020-INPUT.                
691400    03 WS-S500L020-0101-FUNCION           PIC 9(02) COMP.                     
691500    03 WS-S500L020-0101-TIPOMDA           PIC 9(02) COMP.                     
691600    03 WS-S500L020-0101-MDA               PIC 9(16) COMP.                     
691700    03 WS-S500L020-0101-MDA-R REDEFINES                                       
691800       WS-S500L020-0101-MDA.                                                  
691900       05 WS-S500L020-0101-SUCPROM        PIC 9(04) COMP.                     
692000       05 WS-S500L020-0101-CTA            PIC 9(12) COMP.                     
692100    03 WS-S500L020-0101-MOVSAD            PIC 9(02) COMP.                     
692150    03 WS-S500L020-0101-IN-B52            PIC 9(02) COMP.                     
692170    03 WS-S500L020-0101-INDCON            PIC 9(01) COMP.                     
692200    03 FILLER                             PIC X(77).                          
692300$POP OMIT                                                                     
692400                                                                              
692500$SET OMIT = NOT S500L02NR02                                                   
692600 01 WS-S500L020-0102-EDOCTA       REDEFINES WS-S500L020-INPUT.                
692700    03 WS-S500L020-0102-CONTRATO          PIC 9(12) COMP.                     
692800    03 WS-S500L020-0102-NUMMOVS           PIC 9(02) COMP.                     
692900    03 WS-S500L020-0102-FECMOV            PIC 9(06) COMP.                     
692910    03 WS-S500L020-0102-INDCON            PIC 9(01) COMP.                     
693000    03 FILLER                             PIC X(79).                          
693100$POP OMIT                                                                     
693200                                                                              
693300$SET OMIT = NOT S500L020R01                                                   
693400 01 WS-S500L020-0103-GRABAFILECON REDEFINES WS-S500L020-INPUT.                
693500    03 WS-S500L020-0103-FUNCION           PIC 9(02).                          
693600    03 WS-S500L020-0103-SUCPROM           PIC 9(04).                          
693700    03 WS-S500L020-0103-CONTRATO          PIC 9(12).                          
693800    03 WS-S500L020-0103-TIPO-MDA          PIC 9(02).                          
693900    03 WS-S500L020-0103-MDA               PIC 9(16).                          
694000    03 WS-S500L020-0103-MDE               PIC 9(02).                          
694100    03 WS-S500L020-0103-NOMINA            PIC 9(10).                          
694200    03 WS-S500L020-0103-NOM-ESTACION      PIC X(08).                          
694300    03 WS-S500L020-0103-FECCON            PIC 9(08).                          
694400    03 WS-S500L020-0103-HORACON           PIC 9(06).                          
694500    03 WS-S500L020-0103-PRODUCTO          PIC 9(04).                          
694600    03 WS-S500L020-0103-INSTRUMENTO       PIC 9(04).                          
694700    03 WS-S500L020-0103-MONEDA            PIC 9(03).                          
694800    03 WS-S500L020-0103-COMISION          PIC 9(01).                          
694900    03 WS-S500L020-0103-CVETRAN           PIC 9(04).                          
695000*FIN FSW              P10-XXX Comisiones ATM              ABARBOSA            
695100    03 WS-S500L020-0103-IND-REG           PIC 9(01).                          
695200    03 FILLER                             PIC X(03).                          
695300*FIN FSW              P10-XXX Comisiones ATM              ABARBOSA            
695400$POP OMIT                                                                     
695500                                                                              
695600$SET OMIT = NOT S500L020R02                                                   
695700 01 WS-S500L020-0104-CAMBPROC     REDEFINES WS-S500L020-INPUT.                
695800    03 WS-S500L020-0104-FUNCION           PIC 9(02) COMP.                     
695900    03 FILLER                             PIC X(89).                          
696000$POP OMIT                                                                     
696100                                                                              
696200$SET OMIT = NOT S500L02NR05                                                   
696300 01 WS-S500L020-0105-COMISION     REDEFINES WS-S500L020-INPUT.                
696400    03 WS-S500L020-0105-SUCPROM           PIC 9(04) COMP.                     
696500    03 WS-S500L020-0105-CTO               PIC 9(12) COMP.                     
696600    03 WS-S500L020-0105-ULTCOM            PIC 9(02) COMP.                     
696700    03 WS-S500L020-0105-NUMREG            PIC 9(02) COMP.                     
696710    03 WS-S500L020-0105-INDCON            PIC 9(01) COMP.                     
696800    03 FILLER                             PIC X(79).                          
696900$POP OMIT                                                                     
697000                                                                              
697100$SET OMIT = NOT S500L02NR08                                                   
697200 01 WS-S500L020-0108-CGOPEND      REDEFINES WS-S500L020-INPUT.                
697300    03 WS-S500L020-0108-CONTRATO          PIC 9(12) COMP.                     
697400    03 WS-S500L020-0108-TIPO-PAGO         PIC 9(02) COMP.                     
697500    03 WS-S500L020-0108-REFERENCIA        PIC 9(12) COMP.                     
697550    03 WS-S500L020-0108-INDCON            PIC 9(01) COMP.                     
697600    03 FILLER                             PIC X(76).                          
697700$POP OMIT                                                                     
697705$SET OMIT = NOT LIBS084                                                       
697710******INI POSTMORTEM                                                          
697715 01 WS-S500L020-L011-S084            REDEFINES WS-S500L020-INPUT.             
697720    03 WS-S500L020-L011-FUNCION         PIC 9(02)    COMP.                    
697725    03 WS-S500L020-L011-SISORIGEN       PIC 9(04)    COMP.                    
697730    03 WS-S500L020-L011-FECHA           PIC 9(08)    COMP.                    
697735    03 WS-S500L020-L011-CTE             PIC 9(12)    COMP.                    
697740    03 WS-S500L020-IMP-A-EXENTAR        PIC 9(12)V99 COMP.                    
697745    03 WS-S500L020-IMP-OBTENIDO         PIC 9(12)V99 COMP.                    
697750    03 WS-S500L020-RESULT-L011          PIC 9(02)    COMP.                    
697755    03 FILLER                           PIC X(34).                            
697760******FIN POSTMORTEM                                                          
697765$POP OMIT                                                                     
697800 01 WS-S500L020-INPUT2                    WITH LOWER-BOUNDS.                  
697900    03 FILLER                             PIC X(540).                         
698000                                                                              
698100$SET OMIT = NOT S500L020R04                                                   
698200 01 WS-S500L020-0122-FILEFRAUDES    REDEFINES WS-S500L020-INPUT2.             
698300    03 WS-S500L020-0122-FUNCION                PIC 9(02).                     
698400    03 WS-S500L020-0122-PANTALLA               PIC X(05).                     
698500    03 WS-S500L020-0122-OPCION                 PIC X(01).                     
698600    03 WS-S500L020-0122-NOMINA                 PIC 9(08).                     
698700    03 WS-S500L020-0122-FECHA                  PIC 9(08).                     
698800    03 WS-S500L020-0122-HORA                   PIC 9(06).                     
698900    03 WS-S500L020-0122-CSI                    PIC 9(02).                     
699000    03 WS-S500L020-0122-NOM-ESTACION           PIC 9(08).                     
699100    03 WS-S500L020-0122-TIPO-MDA               PIC 9(02).                     
699200    03 WS-S500L020-0122-DATO-PANTALLA          PIC X(498).                    
699300   03 WS-FILLER-Q0500021 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
699400       05 WS-S500L020-0116-SUC-PROMOTORA       PIC 9(04).                     
699500       05 WS-S500L020-0116-NUM-MDA             PIC 9(16).                     
699600       05 WS-S500L020-0116-SDO-DISP            PIC 9(16)V99.                  
699700       05 WS-S500L020-0116-SDO-LINCRED         PIC 9(14)V99.                  
699800       05 WS-S500L020-0116-IMPDEVOL            PIC 9(12)V99.                  
699900       05 WS-S500L020-0116-SDO-PENDIENTE       PIC 9(12)V99.                  
700000       05 WS-S500L020-0116-SDO-SBC             PIC 9(12)V99.                  
700100       05 WS-S500L020-0116-SDO-PENDBLOQ        PIC 9(12)V99.                  
700200       05 WS-S500L020-0116-STATUS-CTO          PIC 9(02).                     
700300       05 WS-S500L020-0116-CONC-STA-CTO        PIC X(10).                     
700400       05 WS-S500L020-0116-NUM-MOVS            PIC 9(06).                     
700500       05 WS-S500L020-0116-IMP-CGOSDIA         PIC 9(10)V99.                  
700600       05 WS-S500L020-0116-IMP-ABOSDIA         PIC 9(10)V99.                  
700700       05 WS-S500L020-0116-NUM-PROD            PIC 9(04).                     
700800       05 WS-S500L020-0116-NUM-INST            PIC 9(04).                     
700900       05 WS-S500L020-0116-MONEDA              PIC 9(04).                     
701000       05 WS-S5002010-0116-FILLER              PIC X(334).                    
701100    03 WS-FILLER-Q050022 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
701200       05 WS-S500L020-0117-SUC-PROMOTORA       PIC 9(04).                     
701300       05 WS-S500L020-0117-NUM-MDA             PIC 9(16).                     
701400       05 WS-S500L020-0117-NOMBRE              PIC X(36).                     
701500       05 WS-S500L020-0117-NUM-PRODUCTO        PIC 9(04).                     
701600       05 WS-S500L020-0117-NUM-INSTRUM         PIC 9(04).                     
701700       05 WS-S500L020-0117-NOMBRE-INST         PIC X(40).                     
701800       05 WS-S500L020-0117-SDO-DISP            PIC 9(16)V99.                  
701900       05 WS-S500L020-0117-STATUS-CTO          PIC 9(02).                     
702000       05 WS-S500L020-0117-CONC-STA-CTO        PIC X(10).                     
702100       05 WS-S500L020-0117-STATUS-MDA          PIC 9(02).                     
702200       05 WS-S500L020-0117-CONC-STA-MDA        PIC X(10).                     
702300       05 WS-S500L020-0117-SDO-LINCRED         PIC 9(14)V99.                  
702400       05 WS-S500L020-0117-MES-PROM-MIN        PIC 9(01).                     
702500       05 WS-S500L020-0117-MES-ABO-EXCE        PIC 9(01).                     
702600       05 WS-S500L020-0117-FEC-ULTMOV          PIC 9(08).                     
702700       05 WS-S500L020-0117-FEC-1ER-SOB         PIC 9(08).                     
702800       05 WS-S500L020-0117-IMPDEVOL            PIC 9(12)V99.                  
702900       05 WS-S500L020-0117-SDO-PENDIENTE       PIC 9(12)V99.                  
703000       05 WS-S500L020-0117-IMPDEPCR-DIA        PIC 9(10)V99.                  
703100       05 WS-S500L020-0117-IMPRETCR-DIA        PIC 9(10)V99.                  
703200       05 WS-S500L020-0117-OPE-STAND           PIC 9(04).                     
703300       05 WS-S500L020-0117-AUT-PENDIENTE       PIC 9(12)V99.                  
703400       05 WS-S500L020-0117-TC-LINEA            PIC 9(04)V9(04).               
703500       05 WS-S500L020-0117-SDO-ACTUAL          PIC 9(16)V99.                  
703600       05 WS-S500L020-0117-CTA-OPCPAGO         PIC 9(02).                     
703700       05 WS-S500L020-0117-CONC-OPCPAGO        PIC X(016).                    
703800       05 WS-S500L020-0117-CTA-RGOPAGO         PIC 9(02).                     
703900       05 WS-S500L020-0117-CONC-RGOPAGO        PIC X(016).                    
704000       05 WS-S500L020-0117-INTS-CAPIT          PIC 9(11)V99.                  
704100       05 WS-S500L020-0117-SDO-SBC             PIC 9(12)V99.                  
704200       05 WS-S500L020-0117-SDO-PENDBLOQ        PIC 9(12)V99.                  
704300       05 WS-S500L020-0117-NUMDEP-CICLO        PIC 9(06).                     
704400       05 WS-S500L020-0117-IMPDEP-CICLO        PIC 9(12)V99.                  
704500       05 WS-S500L020-0117-IMPDEPSR-DIA        PIC 9(12)V99.                  
704600       05 WS-S500L020-0117-IMP-CGOSDIA         PIC 9(10)V99.                  
704700       05 WS-S500L020-0117-NUM-MOVSCGO         PIC 9(06).                     
704800       05 WS-S500L020-0117-IMPDEPSR-CIC        PIC 9(12)V99.                  
704900       05 WS-S500L020-0117-IMP-ABOSDIA         PIC 9(10)V99.                  
705000       05 WS-S500L020-0117-NUM-MOVSABO         PIC 9(06).                     
705100       05 WS-S500L020-0117-IMP-STAND           PIC 9(08)V99.                  
705200       05 WS-S500L020-0117-SDOPROT-BLOQ        PIC 9(16)V99.                  
705300       05 WS-S500L020-0117-MONEDA              PIC 9(04).                     
705400       05 WS-S5002010-0117-FILLER              PIC X(29).                     
705500    03 WS-FILLER-Q050023 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
705600       05 WS-S500L020-0118-SUC-PROMOTORA       PIC 9(04).                     
705700       05 WS-S500L020-0118-NUM-MDA             PIC 9(16).                     
705800       05 WS-S500L020-0118-NOMBRE              PIC X(36).                     
705900       05 WS-S500L020-0118-NUM-CLIENTE         PIC 9(12).                     
706000       05 WS-S500L020-0118-FEC-APERTURA        PIC 9(08).                     
706100       05 WS-S500L020-0118-SUC-CTO             PIC 9(04).                     
706200       05 WS-S500L020-0118-CONTRATO            PIC 9(12).                     
706300       05 WS-S500L020-0118-NUM-PRODUCTO        PIC 9(04).                     
706400       05 WS-S500L020-0118-NUM-INSTRUM         PIC 9(04).                     
706500       05 WS-S500L020-0118-PRODUCTO-ANT        PIC 9(04).                     
706600       05 WS-S500L020-0118-INSTRUM-ANT         PIC 9(04).                     
706700       05 WS-S500L020-0118-FEC-CAMBPROD        PIC 9(08).                     
706800       05 WS-S500L020-0118-NUM-RESTR           PIC 9(02).                     
706900       05 WS-S500L020-0118-DES-RESTR           PIC X(22).                     
707000       05 WS-S500L020-0118-DIA-CORTE           PIC 9(02).                     
707100       05 WS-S500L020-0118-TIPO-CUENTA         PIC 9(02).                     
707200       05 WS-S500L020-0118-DES-CTA             PIC X(22).                     
707300       05 WS-S500L020-0118-FECUMOV-CTE         PIC 9(08).                     
707400       05 WS-S500L020-0118-NUM-TEF             PIC 9(16).                     
707500       05 WS-S500L020-0118-TRAS-CTO1           PIC 9(12).                     
707600       05 WS-S500L020-0118-TRAS-CTO2           PIC 9(12).                     
707700       05 WS-S500L020-0118-TRAS-CTO3           PIC 9(12).                     
707800       05 WS-S500L020-0118-MESES-SINMOV        PIC 9(03).                     
707900       05 WS-S5002010-0118-FILLER              PIC X(269).                    
708000    03 WS-S500L020-0119-50025 REDEFINES                                       
708100                                WS-S500L020-0122-DATO-PANTALLA.               
708200       05 WS-S500L020-0119-SUC-PROMOTORA       PIC 9(04).                     
708300       05 WS-S500L020-0119-NUM-MDA             PIC 9(16).                     
708400       05 WS-S500L020-0119-CTA-CONCENT         PIC 9(02).                     
708500       05 WS-S500L020-0119-ESTACION-LB         PIC 9(04).                     
708600       05 WS-S500L020-0119-REST-CTACONCE       PIC 9(02).                     
708700       05 WS-S500L020-0119-CONC-CTACONCE       PIC X(20).                     
708800       05 WS-S500L020-0119-NUM-PROD            PIC 9(04).                     
708900       05 WS-S500L020-0119-NUM-INST            PIC 9(04).                     
709000       05 WS-S500L020-0119-MONEDA              PIC 9(04).                     
709100       05 WS-S5002010-0119-FILLER              PIC X(438).                    
709200    03 WS-S500L020-0120-50028 REDEFINES                                       
709300                                   WS-S500L020-0122-DATO-PANTALLA.            
709400       05 WS-S500L020-0120-SUC-PROMOTORA       PIC 9(04).                     
709500       05 WS-S500L020-0120-NUM-MDA             PIC 9(16).                     
709600       05 WS-S5002010-0120-FILLER              PIC X(478).                    
709700    03 WS-S500L020-0121-50064 REDEFINES                                       
709800                                   WS-S500L020-0122-DATO-PANTALLA.            
709900       05 WS-S500L020-0121-SUC-PROMOTORA       PIC 9(04).                     
710000       05 WS-S500L020-0121-NUM-MDA             PIC 9(16).                     
710100       05 WS-S500L020-0121-NOMBRE              PIC X(40).                     
710200       05 WS-S5002010-0121-FILLER              PIC X(438).                    
710300    03 WS-FILLER-Q050058 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
710400       05 WS-S500-L040-0123-LLAVE              PIC 9(02).                     
710500       05 WS-S500-L040-0123-PROD               PIC 9(04).                     
710600       05 WS-S500-L040-0123-INST               PIC 9(04).                     
710700       05 WS-S500-L040-0123-MONE               PIC 9(02).                     
710800       05 WS-S500-L040-0123-IOPE               PIC 9(02).                     
710900       05 WS-S500-L040-0123-NINV               PIC 9(06).                     
711000       05 WS-S500-L040-0123-CTO                PIC 9(16).                     
711100       05 WS-S500-L040-0123-LIGA               PIC X(10).                     
711200       05 WS-S500-L040-0123-CTO-S016           PIC 9(12).                     
711300       05 WS-S500-L040-0123-SUCPRO             PIC 9(04).                     
711400       05 WS-S500-L040-0123-NOMBRE             PIC X(36).                     
711500       05 WS-S500-L040-0123-STATUS             PIC 9(02).                     
711600       05 WS-S500-L040-0123-LEY-TRASP          PIC X(19).                     
711700       05 WS-S500-L040-0123-FECGLB             PIC 9(08).                     
711800       05 WS-S500-L040-0123-IMPGLB             PIC 9(14)V99.                  
711900       05 WS-S500-L040-0123-FEC-ART61          PIC 9(08).                     
712000       05 WS-S500-L040-0123-FECBEN             PIC 9(08).                     
712100       05 WS-S500-L040-0123-IMPBEN             PIC 9(14)V99.                  
712200       05 WS-S500-L040-0123-FILLER             PIC X(323).                    
712300    03 WS-FILLER-Q050029 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
712400       05 WS-S500L020-0125-SUC-PROMOTORA       PIC 9(04).                     
712500       05 WS-S500L020-0125-NUM-MDA             PIC 9(16).                     
712600       05 WS-S500L020-0125-MONEDA              PIC 9(04).                     
712700       05 WS-S500L020-0125-FILLER              PIC X(474).                    
712800    03 WS-FILLER-Q050051 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
712900       05 WS-S500L020-0126-SUC-PROMOTORA       PIC 9(04).                     
713000       05 WS-S500L020-0126-NUM-MDA             PIC 9(16).                     
713100       05 WS-S500L020-0126-FILLER              PIC X(478).                    
713200    03 WS-FILLER-Q050027 REDEFINES WS-S500L020-0122-DATO-PANTALLA.            
713300       05 WS-S500L020-0127-SUC-PROMOTORA       PIC 9(04).                     
713400       05 WS-S500L020-0127-NUM-MDA             PIC 9(16).                     
713500       05 WS-S500L020-0127-SUC-TRANS           PIC 9(04).                     
713600       05 WS-S500L020-0127-CAJ-TRANS           PIC 9(02).                     
713700       05 WS-S500L020-0127-FECCONTAB           PIC 9(08).                     
713800       05 WS-S500L020-0127-FILLER              PIC X(464).                    
713805    03 WS-S500L020-0128-50018 REDEFINES                                       
713810                                WS-S500L020-0122-DATO-PANTALLA.               
713815       05 WS-S500L020-0128-SUC-PROMOTORA       PIC 9(04).                     
713820       05 WS-S500L020-0128-NUM-MDA             PIC 9(16).                     
713825       05 WS-S500L020-0128-CTA-CONCENT         PIC 9(02).                     
713830       05 WS-S500L020-0128-SDO-TRECI-TES       PIC 9(14)V99.                  
713835       05 WS-S500L020-0128-SDO-TASIG-TES       PIC 9(14)V99.                  
713840       05 WS-S500L020-0128-SDO-AOTOR-TES       PIC 9(14)V99.                  
713845       05 WS-S500L020-0128-SDO-ARECI-TES       PIC 9(14)V99.                  
713850       05 WS-S500L020-0128-SDO-DACTU-TES       PIC 9(14)V99.                  
713855       05 WS-S500L020-0128-NUM-CTOCC-TES       PIC 9(12).                     
713860       05 WS-S500L020-0128-IND-RESET-TES       PIC 9(02).                     
713865       05 WS-S5002010-0128-FILLER              PIC X(382).                    
713900                                                                              
714000$POP OMIT                                                                     
714100                                                                              
714200 01 WS-S500L020-OUTPUT                    WITH LOWER-BOUNDS.                  
714300    03 FILLER                             PIC X(820).                         
714400                                                                              
714500$SET OMIT = NOT S500L02NR01                                                   
714600 01 WS-S500L020-0201-DATGEN       REDEFINES WS-S500L020-OUTPUT.               
714700    03 WS-S500L020-0201-SUC-PROMOTORA     PIC 9(04) COMP.                     
714800    03 WS-S500L020-0201-NUM-CONTRATO      PIC 9(12) COMP.                     
714900    03 WS-S500L020-0201-NUM-CLIENTE       PIC 9(12) COMP.                     
715000    03 WS-S500L020-0201-NUM-PRODUCTO      PIC 9(04) COMP.                     
715100    03 WS-S500L020-0201-NUM-INSTRUM       PIC 9(04) COMP.                     
715200    03 WS-S500L020-0201-MONEDA            PIC 9(04) COMP.                     
715300    03 WS-S500L020-0201-CTA-CONCENT       PIC 9(02) COMP.                     
715400    03 WS-S500L020-0201-FEC-APERTURA      PIC 9(06) COMP.                     
715500    03 WS-S500L020-0201-DIA-CORTE         PIC 9(02) COMP.                     
715600    03 WS-S500L020-0201-TIPO-PERSONA      PIC 9(02) COMP.                     
715700    03 WS-S500L020-0201-SECTOR            PIC 9(02) COMP.                     
715800    03 WS-S500L020-0201-STATUS-CTO        PIC 9(02) COMP.                     
715900    03 WS-S500L020-0201-TIPO-BLOQUEO      PIC 9(02) COMP.                     
716000    03 WS-S500L020-0201-RESTRICCIONES     PIC 9(02) COMP.                     
716100    03 WS-S500L020-0201-REST-CTACONCE     PIC 9(02) COMP.                     
716200    03 WS-S500L020-0201-IND-2DAREF        PIC 9(02) COMP.                     
716300    03 WS-S500L020-0201-MODVALI-CTCON     PIC 9(02) COMP.                     
716400    03 WS-S500L020-0201-IND-LINCREDIT     PIC 9(02) COMP.                     
716500    03 WS-S500L020-0201-NOMBRE            PIC X(36).                          
716600    03 WS-S500L020-0201-TIPO-CUENTA       PIC 9(02) COMP.                     
716700    03 WS-S500L020-0201-FEC-CAMBPROD      PIC 9(06) COMP.                     
716800    03 WS-S500L020-0201-PRODUCTO-ANT      PIC 9(04) COMP.                     
716900    03 WS-S500L020-0201-INSTRUM-ANT       PIC 9(04) COMP.                     
717000    03 WS-S500L020-0201-STA-CANCEL        PIC 9(02) COMP.                     
717100    03 WS-S500L020-0201-CTOS-DETRASP      OCCURS 3 TIMES.                     
717200       05 WS-S500L020-0201-TRAS-CTO       PIC 9(12) COMP.                     
717300    03 WS-S500L020-0201-ESTACION-LB       PIC 9(04) COMP.                     
717400    03 WS-S500L020-0201-MODULO-DIGI       PIC 9(02) COMP.                     
717500    03 WS-S500L020-0201-NIVSEG-CHEQ       PIC 9(02) COMP.                     
717600    03 WS-S500L020-0201-NOMBRE-INST       PIC X(40).                          
717700    03 WS-S500L020-0201-STATUS-MDA        PIC 9(02) COMP.                     
717800    03 WS-S500L020-0201-FEC-CORTE1        PIC 9(06) COMP.                     
717900    03 WS-S500L020-0201-FEC-LCINV         PIC 9(06) COMP.                     
718000    03 WS-S500L020-0201-REF-MINLONG       PIC 9(02) COMP.                     
718100    03 WS-S500L020-0201-REF-MAXLONG       PIC 9(02) COMP.                     
718200    03 WS-S500L020-0201-REFALF-MINLON     PIC 9(02) COMP.                     
718300    03 WS-S500L020-0201-REFALF-MAXLON     PIC 9(02) COMP.                     
718400    03 WS-S500L020-0201-SERVCITIDIREC     PIC 9(02) COMP.                     
718500    03 WS-S500L020-0201-NUM-TEF           PIC 9(16) COMP.                     
718600    03 WS-S500L020-0201-FECHA-DEPNOMI     PIC 9(08) COMP.                     
718700    03 WS-S500L020-0201-ESQ-TARIFARIO     PIC 9(01) COMP.                     
718800    03 WS-S500L020-0201-MDA-ASIGNADOS     PIC 9(01) COMP.                     
718900    03 WS-S500L020-0201-RESUMEN-MCC       PIC 9(01) COMP.                     
719000    03 WS-S500L020-0201-GEN-EDOCTA        PIC 9(01) COMP.                     
719100    03 WS-S500L020-0201-CTO-BCAINST       PIC 9(01) COMP.                     
719200    03 WS-S500L020-0201-NUM-GPOSOCIO      PIC 9(04) COMP.                     
719300    03 WS-S500L020-0201-NUM-BIN           PIC 9(06) COMP.                     
719400    03 WS-S500L020-0201-PRODUCTO-NVO      PIC 9(04) COMP.                     
719500    03 WS-S500L020-0201-INSTRUM-NVO       PIC 9(04) COMP.                     
719600    03 WS-S500L020-0201-IND-ALERTA        PIC 9(04) COMP.                     
719700*INI BSR. MIGRACION PREPAGADA                                                 
719800    03 WS-S500L020-0201-NUM-TEF-INFO      PIC 9(16) COMP.                     
719900*FIN BSR. MIGRACION PREPAGADA                                                 
720000*INI BSR. BENEFICENCIA                                                        
720100    03 WS-S500L020-0201-FECH-BENEF        PIC 9(08) COMP.                     
720200    03 WS-S500L020-0201-STA-BENEF         PIC 9(01) COMP.                     
720300*FIN BSR. BENEFICENCIA                                                        
720400*INI BSR. MIGRACION/MIGRACION                                                 
720500    03 WS-S500L020-0201-MIGR-S111         PIC 9(01) COMP.                     
720600    03 WS-S500L020-0201-IMPSOL-BLOQ       PIC 9(16)V99 COMP.                  
720700    03 WS-S500L020-0201-FECUMOV-CTE       PIC 9(08) COMP.                     
720800*FIN BSR. MIGRACION/MIGRACION                                                 
720900*INI MIO R1-2015 BORRADO DE COMISIONES.                                       
721000    03 WS-S500L020-0201-CTA-EJE           PIC 9(01) COMP.                     
721100    03 WS-S500L020-0201-CONSDO-S408       PIC 9(01) COMP.                     
721200    03 WS-S500L020-0201-MESES-SINMOV      PIC 9(03) COMP.                     
721300    03 WS-S500L020-0201-FECHA-MIGRA       PIC 9(08) COMP.                     
721400*   03 FILLER                             PIC X(489).                         
721500*INI EVM R10-2017 CUENTA EXPRESS.                                             
721600    03 WS-S500L020-0201-NIVEL-CTAEXP      PIC 9(04) COMP.                     
721700*   03 FILLER                             PIC X(487).                         
721800*FIN EVM R10-2017 CUENTA EXPRESS.                                             
721900*INI PCB R10M-2018                                                            
722000    03 WS-S500L020-0201-ESQ-REND          PIC 9(02) COMP.                     
722100    03 WS-S500L020-0201-SGTO-REND         PIC 9(02) COMP.                     
722110    03 WS-S500L020-0201-NUM-CTOCC-TES     PIC 9(12) COMP.                     
722120    03 WS-S500L020-0201-SERV-GBNP         PIC 9(01) COMP.                     
722145*INI SRA MARCA CUENTA INTERMEDIACION                                          
722150    03 WS-S500L020-0201-IND-CTAINTER      PIC 9(01) COMP.                     
722155*FIN SRA MARCA CUENTA INTERMEDIACION                                          
722157    03 WS-S500L020-0201-VALREF-INTBCO     PIC 9(01) COMP.                     
722158*INI LP39629 INDBNE                                                           
722159    03 WS-S500L020-0201-INDIVBNE          PIC 9(02) COMP.                     
722161*FIN LP39629 INDBNE                                                           
722171    03 WS-S500L020-0201-MARCA-CLON        PIC 9(01) COMP.                     
722181    03 WS-S500L020-0201-FECHA-CLON        PIC 9(08) COMP.                     
722182*INI ENVIO STATUS B12P                                                        
722183    03 WS-S500L020-0201-RESULT-L070       PIC 9(02) COMP.                     
722184    03 WS-S500L020-0201-STATUS-B12P       PIC 9(02) COMP.                     
722185*FIN ENVIO STATUS B12P                                                        
722200    03 FILLER                             PIC X(575).                         
722300*FIN PCB R10M-2018                                                            
722400 01 WS-S500L020-0202-SALDOS       REDEFINES WS-S500L020-OUTPUT.               
722500    03 WS-S500L020-0202-SUC-PROMOTORA     PIC 9(04) COMP.                     
722600    03 WS-S500L020-0202-NUM-CONTRATO      PIC 9(12) COMP.                     
722700    03 WS-S500L020-0202-NUM-CLIENTE       PIC 9(12) COMP.                     
722800    03 WS-S500L020-0202-NOMBRE-INSTR      PIC X(40).                          
722900    03 WS-S500L020-0202-NUM-PRODUCTO      PIC 9(04) COMP.                     
723000    03 WS-S500L020-0202-NUM-INSTRUM       PIC 9(04) COMP.                     
723100    03 WS-S500L020-0202-MONEDA            PIC 9(04) COMP.                     
723200    03 WS-S500L020-0202-SDO-ACTUAL        PIC 9(16)V99 COMP.                  
723300    03 WS-S500L020-0202-SDO-PENDIENTE     PIC 9(12)V99 COMP.                  
723400    03 WS-S500L020-0202-SDO-SBC           PIC 9(12)V99 COMP.                  
723500    03 WS-S500L020-0202-SDO-SBC5DIAS   PIC 9(12)V99 COMP OCCURS 5.            
723600    03 WS-S500L020-0202-AUT-PENDIENTE     PIC 9(12)V99 COMP.                  
723700    03 WS-S500L020-0202-SDO-PROTEGIDO     PIC 9(12)V99 COMP.                  
723800    03 WS-S500L020-0202-SDO-DISP         PIC 9(16)V99 COMP.                   
723900    03 WS-S500L020-0202-SDO-LINCRED      PIC 9(14)V99 COMP.                   
724000    03 WS-S500L020-0202-COMI-PEND        PIC 9(10)V99 COMP.                   
724100    03 WS-S500L020-0202-FEC-ULTMOV       PIC 9(06) COMP.                      
724200    03 WS-S500L020-0202-FEC-1ER-SOB      PIC 9(06) COMP.                      
724300    03 WS-S500L020-0202-INTS-CAPIT       PIC S9(11)V99 COMP.                  
724400    03 WS-S500L020-0202-NUM-MOVS         PIC 9(06) COMP.                      
724500    03 WS-S500L020-0202-NOMBRE           PIC X(36).                           
724600    03 WS-S500L020-0202-IMP-CGOSDIA      PIC 9(10)V99 COMP.                   
724700    03 WS-S500L020-0202-IMP-ABOSDIA      PIC 9(10)V99 COMP.                   
724800    03 WS-S500L020-0202-MOVSAD           OCCURS 4 TIMES.                      
724900       05 WS-S500L020-0202-SUC-TRANS     PIC 9(04) COMP.                      
725000       05 WS-S500L020-0202-CAJ-TRANS     PIC 9(02) COMP.                      
725100       05 WS-S500L020-0202-AUTORIZ       PIC 9(06) COMP.                      
725200       05 WS-S500L020-0202-CLAVE-MOVTO   PIC 9(04) COMP.                      
725300       05 WS-S500L020-0202-REFER-NUME    PIC 9(12) COMP.                      
725400       05 WS-S500L020-0202-IMPORTE       PIC 9(14)V99 COMP.                   
725500    03 WS-S500L020-0202-FEC-CONTABLE     PIC 9(06) COMP.                      
725600    03 WS-S500L020-0202-LIMITE-CREDIT    PIC 9(10)V99 COMP.                   
725700    03 WS-S500L020-0202-STATUS-CTO       PIC 9(02) COMP.                      
725800    03 WS-S500L020-0202-STATUS-MDA       PIC 9(02) COMP.                      
725900    03 WS-S500L020-0202-TIPO-BLOQUEO     PIC 9(02) COMP.                      
726000    03 WS-S500L020-0202-SDO-DISP-MN      PIC 9(16)V99 COMP.                   
726100    03 WS-S500L020-0202-SDO-ACT-MN       PIC 9(16)V99 COMP.                   
726200*INI BSR. PERFILES DOLARES                                                    
726300*   03 WS-S500L020-0202-TCAMBIO          PIC 9(04)V9(04) COMP.                
726400    03 WS-S500L020-0202-TC-LINEA         PIC 9(04)V9(04) COMP.                
726500*FIN BSR. PERFILES DOLARES                                                    
726600    03 WS-S500L020-0202-IMPDEVOL         PIC 9(12)V99 COMP.                   
726700    03 WS-S500L020-0202-SERVCITIDIREC    PIC 9(02)    COMP.                   
726800    03 WS-S500L020-0202-MOVSAD-C2        OCCURS 4 TIMES.                      
726900       05 WS-S500L020-0202-LEYENDA       PIC X(40).                           
727000       05 WS-S500L020-0202-REFER-CECOBAN PIC X(07).                           
727100    03 WS-S500L020-0202-AUTORIZ-1        PIC 9(08) COMP.                      
727200    03 WS-S500L020-0202-AUTORIZ-2        PIC 9(08) COMP.                      
727300    03 WS-S500L020-0202-AUTORIZ-3        PIC 9(08) COMP.                      
727400    03 WS-S500L020-0202-AUTORIZ-4        PIC 9(08) COMP.                      
727500    03 WS-S500L020-0202-FEC-ULTMOV-OR    PIC 9(06) COMP.                      
727600    03 WS-S500L020-0202-NUMDEP-CICLO     PIC 9(06) COMP.                      
727700    03 WS-S500L020-0202-IMPDEP-CICLO     PIC 9(12)V99 COMP.                   
727800    03 WS-S500L020-0202-MES-PROM-MIN     PIC 9(01) COMP.                      
727900    03 WS-S500L020-0202-MES-ABO-EXCE     PIC 9(01) COMP.                      
728000    03 WS-S500L020-0202-IMPDEPSR-DIA     PIC 9(12)V99 COMP.                   
728100    03 WS-S500L020-0202-IMPDEP-CTAEXP    PIC 9(12)V99 COMP.                   
728200    03 WS-S500L020-0202-IMPRETCR-DIA     PIC 9(10)V99 COMP.                   
728300    03 WS-S500L020-0202-IMPDEPCR-DIA     PIC 9(10)V99 COMP.                   
728400*INI BSR. JFP BANCANET                                                        
728500    03 WS-S500L020-0202-NUM-MOVSNC       PIC 9(06)    COMP.                   
728600    03 WS-S500L020-0202-NUM-MOVSCGO      PIC 9(06)    COMP.                   
728700    03 WS-S500L020-0202-NUM-MOVSABO      PIC 9(06)    COMP.                   
728800    03 WS-S500L020-0202-SDO-ANTERIOR     PIC 9(16)V99 COMP.                   
728900*   03 FILLER                            PIC X(89).                           
729000*FIN BSR. JFP BANCANET                                                        
729100                                                                              
729200*INI R4 STAND AGREGA 2 CAMPOS DE LA 50022 PARA LA L020        -YCY            
729300    03 WS-S500L020-0202-IMP-STAND        PIC 9(08)V99 COMP.                   
729400    03 WS-S500L020-0202-OPE-STAND        PIC 9(04) COMP.                      
729500    03 WS-S500L020-0202-MIGR-S111        PIC 9(01) COMP.                      
729600*   03 WS-S500L020-0202-FILLER           PIC 9(01) COMP.                      
729700*   03 FILLER                            PIC X(81).                           
729800*FIN R4 STAND                                                 -YCY            
729900                                                                              
730000*INI MIO R2-2014 BLOQUEO PARCIAL X ORDEN JUDICIAL.                            
730100    03 WS-S500L020-0202-SDOPROT-BLOQ     PIC 9(16)V99 COMP.                   
730200    03 WS-S500L020-0202-IMPSOL-BLOQ      PIC 9(16)V99 COMP.                   
730300*   03 WS-S500L020-0202-FILLER           PIC 9(01) COMP.                      
730400*   03 FILLER                            PIC X(63).                           
730500*FIN MIO R2-2014 BLOQUEO PARCIAL X ORDEN JUDICIAL.                            
730600                                                                              
730700    03 WS-S500L020-0202-CGO-PENDSAB      PIC  9(12)V99 COMP.                  
730800*   03 WS-S500L020-0202-FILLER           PIC  9(01)    COMP.                  
730900*   03 FILLER                            PIC  X(56).                          
731000                                                                              
731100*INI EVM R10-2017 CUENTA EXPRESS.                                             
731200    03 WS-S500L020-0202-VALOR-UDI        PIC  9(08)    COMP.                  
731300*   03 WS-S500L020-0202-FILLER           PIC  9(01)    COMP.                  
731400*   03 FILLER                            PIC  X(52).                          
731500*FIN EVM R10-2017 CUENTA EXPRESS.                                             
731502*INI ECC P0119773 TESOFE CONTROL ACCOUNT & ALIAS                              
731504    03 WS-S500L020-0202-NUM-CTOCC-TES    PIC  9(12)    COMP.                  
731506    03 WS-S500L020-0202-CTA-CONCENT      PIC  9(02)    COMP.                  
731508    03 WS-S500L020-0202-IND-RESET-TES    PIC  9(02)    COMP.                  
731510    03 WS-S500L020-0202-SDO-TRACT-TES    PIC S9(14)V99 COMP.                  
731512    03 WS-S500L020-0202-SDO-TAACT-TES    PIC S9(14)V99 COMP.                  
731514    03 WS-S500L020-0202-SDO-AOACT-TES    PIC S9(14)V99 COMP.                  
731516    03 WS-S500L020-0202-SDO-ARACT-TES    PIC S9(14)V99 COMP.                  
731518    03 WS-S500L020-0202-SDO-DAACT-TES    PIC S9(14)V99 COMP.                  
731520    03 WS-S500L020-0202-IMPSOLBLO-TES    PIC S9(14)V99 COMP.                  
731522    03 WS-S500L020-0202-USO-CTANT-TES    PIC  9(02)    COMP.                  
731524    03 WS-S500L020-0202-NUM-SUCCC-TES    PIC  9(04)    COMP.                  
731525    03 WS-S500L020-0202-SDO-DISPLCRED    PIC S9(12)V99 COMP.                  
731526*   03 WS-S500L020-0202-FILLER           PIC  9(01)    COMP.                  
731527*  INI - EFD BANKING RETAIL                                                   
731528*    03 FILLER                            PIC  X(03).                         
731529    03 WS-S500L020-0202-ACUM-DEP-DIA     PIC 9(18)V99  COMP.                  
731530    03 WS-S500L020-0202-ACUM-DEP-MEN     PIC 9(18)V99  COMP.                  
731531    03 WS-S500L020-0202-ACUM-RET-DIA     PIC 9(18)V99  COMP.                  
731532    03 WS-S500L020-0202-ACUM-RET-MEN     PIC 9(18)V99  COMP.                  
731533    03 WS-S500L020-0202-SDO-CON-DEP      PIC 9(18)V99  COMP.                  
731534    03 WS-S500L020-0202-MARCA-CLON       PIC 9(01)     COMP.                  
731535    03 FILLER                            PIC X(53).                           
731536                                                                              
731537*INI ECC P0119773 TESOFE CONTROL ACCOUNT & ALIAS                              
731700 01 WS-S500L020-0203-SDO-PARCIAL  REDEFINES WS-S500L020-OUTPUT.               
731800    03 WS-S500L020-0203-SUC-PROMOTORA     PIC 9(04) COMP.                     
731900    03 WS-S500L020-0203-NUM-CONTRATO      PIC 9(12) COMP.                     
732000    03 WS-S500L020-0203-SDO-PENDIENTE     PIC 9(12)V99 COMP.                  
732100    03 WS-S500L020-0203-SDO-SBC           PIC 9(12)V99 COMP.                  
732200    03 WS-S500L020-0203-SDO-DISP          PIC 9(16)V99 COMP.                  
732300    03 WS-S500L020-0203-SDO-LINCRED       PIC 9(14)V99 COMP.                  
732400    03 WS-S500L020-0203-NUM-MOVS          PIC 9(06) COMP.                     
732500    03 WS-S500L020-0203-IMP-CGOSDIA       PIC 9(10)V99 COMP.                  
732600    03 WS-S500L020-0203-IMP-ABOSDIA       PIC 9(10)V99 COMP.                  
732700    03 WS-S500L020-0203-LIMITE-CREDIT     PIC 9(10)V99 COMP.                  
732800    03 WS-S500L020-0203-STATUS-CTO        PIC 9(02) COMP.                     
732900    03 WS-S500L020-0203-STATUS-MDA        PIC 9(02) COMP.                     
733000    03 WS-S500L020-0203-TIPO-BLOQUEO      PIC 9(02) COMP.                     
733100    03 WS-S500L020-0203-SDO-DISP-MN       PIC 9(16)V99 COMP.                  
733200    03 WS-S500L020-0203-IMPDEVOL          PIC 9(12)V99 COMP.                  
733300    03 WS-S500L020-0203-NUM-PRODUCTO      PIC 9(04) COMP.                     
733400    03 WS-S500L020-0203-NUM-INSTRUM       PIC 9(04) COMP.                     
733500    03 WS-S500L020-0203-MONEDA            PIC 9(04) COMP.                     
733600    03 WS-S500L020-0203-SDO-PENDBLOQ      PIC 9(12)V99 COMP.                  
733700    03 WS-S500L020-0203-SERVCITIDIREC     PIC 9(02) COMP.                     
733800    03 WS-S500L020-0203-MIGR-S111         PIC 9(01) COMP.                     
733900    03 WS-S500L020-0203-SDO-PROTE-VC      PIC 9(14)V99 COMP.                  
733950    03 WS-S500L020-0203-CTA-CONCENT       PIC  9(02)   COMP.                  
733952*** <GCE-LOCK-UNLOCK> START   2019-08                                         
733954    03 WS-S500L020-0203-SDO-LOCK-GCE      PIC 9(12)V99 COMP.                  
734000*   03 WS-S500L020-0203-FILLER            PIC 9(01) COMP.                     
734100*   03 FILLER                             PIC X(590).                         
734102*** <GCE-LOCK-UNLOCK> END   2019-08                                           
734104*INI ECC CONTROL DE DEPOSITOS Y RETIROS                                       
734106    03 WS-S500L020-0203-SDO-CONG-DYR      PIC 9(12)V99 COMP.                  
734108    03 WS-S500L020-0203-FILLER            PIC 9(01) COMP.                     
734110    03 FILLER                             PIC X(676).                         
734112*FIN ECC CONTROL DE DEPOSITOS Y RETIROS                                       
734200$POP OMIT                                                                     
734300                                                                              
734400$SET OMIT = NOT S500L02NR02                                                   
734500 01 WS-S500L020-0204-EDOCTA       REDEFINES WS-S500L020-OUTPUT.               
734600    03 WS-S500L020-0204-NUM-SUCURSAL      PIC 9(04)  COMP.                    
734700    03 WS-S500L020-0204-NUM-CONTRATO      PIC 9(12)  COMP.                    
734800    03 WS-S500L020-0204-PRODUCTO          PIC 9(04)  COMP.                    
734900    03 WS-S500L020-0204-INSTRUMENTO       PIC 9(04)  COMP.                    
735000    03 WS-S500L020-0204-MONEDA            PIC 9(04)  COMP.                    
735100    03 WS-S500L020-0204-SDOACT            PIC 9(16)V99 COMP.                  
735200    03 WS-S500L020-0204-NOMBRE            PIC X(36).                          
735300    03 WS-S500L020-0204-NUMMOVS           PIC 9(02)  COMP.                    
735400    03 WS-S500L020-0204-MOVS              OCCURS 20 TIMES.                    
735500       05 WS-S500L020-0204-FECMOV         PIC 9(06)  COMP.                    
735600       05 WS-S500L020-0204-CVEMOV         PIC 9(04)  COMP.                    
735700       05 WS-S500L020-0204-IMPMOV         PIC 9(12)V99 COMP.                  
735800    03 FILLER                             PIC X(500).                         
735900$POP OMIT                                                                     
736000                                                                              
736100$SET OMIT = NOT S500L020R03                                                   
736200 01 WS-S500L020-0205-FECHA        REDEFINES WS-S500L020-OUTPUT.               
736300    03 WS-S500L020-0205-FECCONT-AMD       PIC 9(06).                          
736400    03 WS-S500L020-0205-CONT-S127         PIC 9(01).                          
736500    03 FILLER                             PIC X(793).                         
736600$POP OMIT                                                                     
736700                                                                              
736800$SET OMIT = NOT S500L02NR05                                                   
736900 01 WS-S500L020-0207-COMISION REDEFINES WS-S500L020-OUTPUT.                   
737000    03 WS-S500L020-0207-ULTCOM            PIC 9(02)    COMP.                  
737100    03 WS-S500L020-0207-TOTAL             PIC 9(10)V99 COMP.                  
737200    03 WS-S500L020-0207-COMIS             OCCURS 10 TIMES.                    
737300       05 WS-S500L020-0207-OCURRE         PIC 9(02)    COMP.                  
737400       05 WS-S500L020-0207-CONCEPTO       PIC X(20).                          
737500       05 WS-S500L020-0207-IMPSIVA        PIC 9(08)V99 COMP.                  
737502*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
737504    03 WS-S500L020-0207-MARCA-CLON        PIC 9(01)    COMP.                  
737506*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
737600    03 FILLER                             PIC X(533).                         
737700$POP OMIT                                                                     
737800                                                                              
737900$SET OMIT = NOT S500L02NR08                                                   
738000 01 WS-S500L020-0208-CGOPEND      REDEFINES WS-S500L020-OUTPUT.               
738100    03 WS-S500L020-0208-PRODUCTO          PIC 9(04)    COMP.                  
738200    03 WS-S500L020-0208-INSTRUMENTO       PIC 9(04)    COMP.                  
738300    03 WS-S500L020-0208-MONEDA            PIC 9(04)    COMP.                  
738400    03 WS-S500L020-0208-IMP-ORI-CGO       PIC 9(12)V99 COMP.                  
738500    03 WS-S500L020-0208-IMP-COBRADO       PIC 9(12)V99 COMP.                  
738600    03 WS-S500L020-0208-IMP-DEUDOR        PIC 9(12)V99 COMP.                  
738602*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
738604    03 WS-S500L020-0208-MARCA-CLON        PIC 9(01)    COMP.                  
738606*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
738700    03 FILLER                             PIC X(772).                         
738800$POP OMIT                                                                     
738900                                                                              
739000$SET OMIT = NOT S500L02NR11                                                   
739100 01 WS-S500L020-0211-SBCT6-YTRAD  REDEFINES WS-S500L020-OUTPUT.               
739200    03 WS-S500L020-0211-PRODUCTO             PIC 9(04) COMP.                  
739300    03 WS-S500L020-0211-INSTRUMENTO          PIC 9(04) COMP.                  
739400    03 WS-S500L020-0211-MONEDA               PIC 9(04) COMP.                  
739500    03 WS-S500L020-0211-STATUS-CTO           PIC 9(02) COMP.                  
739600    03 WS-S500L020-0211-SDO-PEND             PIC 9(12)V99 COMP.               
739700    03 WS-S500L020-0211-SBCTRAD              PIC 9(12)V99 COMP.               
739800    03 WS-S500L020-0211-SBCT6 OCCURS 6 TIMES PIC 9(12)V99 COMP.               
739802*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
739804    03 WS-S500L020-0211-MARCA-CLON           PIC 9(01)    COMP.               
739806*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
739900    03 FILLER                                PIC X(736).                      
740000$POP OMIT                                                                     
740010$SET OMIT = NOT LIBS084                                                       
740020******INI POSTMORTEM                                                          
740030 01 WS-S500L020-L011-R-S084       REDEFINES WS-S500L020-OUTPUT.               
740040    03 WS-S500L020-L011-IMP-EXCENTO             PIC 9(12)V99 COMP.            
740050    03 FILLER                                   PIC X(700).                   
740060******FIN POSTMORTEM                                                          
740070$POP OMIT                                                                     
740100                                                                              
740200$SET OMIT = NOT S500L02NR04                                                   
740300 01 WS-S500L020-0206-POSICION WITH LOWER-BOUNDS.                              
740400    03 WS-S500L020-0206-TBL OCCURS 30 TIMES.                                  
740500       05 WS-S500L020-0206-PROD           PIC 9(04)    COMP.                  
740600       05 WS-S500L020-0206-INST           PIC 9(04)    COMP.                  
740700       05 WS-S500L020-0206-MON            PIC 9(04)    COMP.                  
740800       05 WS-S500L020-0206-SDO-ANT        PIC 9(16)V99 COMP.                  
740900       05 WS-S500L020-0206-ABONOS         PIC 9(14)V99 COMP.                  
741000       05 WS-S500L020-0206-CARGOS         PIC 9(14)V99 COMP.                  
741100       05 WS-S500L020-0206-SDO-ACT        PIC 9(16)V99 COMP.                  
741200*   03 FILLER                             PIC X(58).                          
741300$POP OMIT                                                                     
741400                                                                              
741500$SET OMIT = NOT S500L02NR09                                                   
741600 01 WS-S500L020-0109-CPENDXSUC WITH LOWER-BOUNDS.                             
741700    03 WS-S500L020-0109-SUC-TRANS         PIC 9(04)    COMP.                  
741800    03 WS-S500L020-0109-CAJ-TRANS         PIC 9(02)    COMP.                  
741900    03 WS-S500L020-0109-FEC-CONTA         PIC 9(08)    COMP.                  
742000    03 WS-S500L020-0109-AUT               PIC 9(08)    COMP.                  
742100    03 WS-S500L020-0109-HSUC-TRANS        PIC 9(04)    COMP.                  
742200    03 WS-S500L020-0109-HCAJ-TRANS        PIC 9(02)    COMP.                  
742300    03 WS-S500L020-0109-HFEC-CONTA        PIC 9(08)    COMP.                  
742400    03 WS-S500L020-0109-HAUT              PIC 9(08)    COMP.                  
742500    03 WS-S500L020-0109-NUMREGS           PIC 9(02)    COMP.                  
742600    03 WS-S500L020-0109-HCTO              PIC 9(12)    COMP.                  
742700                                                                              
742800 01 WS-S500L020-0209-CPENDXSUC WITH LOWER-BOUNDS.                             
742900    03 WS-S500L020-0209-NUMREGS           PIC 9(02)    COMP.                  
743000    03 WS-S500L020-0209-CONTINUACION      PIC 9(02)    COMP.                  
743100    03 WS-S500L020-0209-TBL OCCURS 10 TIMES.                                  
743200       05 WS-S500L020-0209-AUT            PIC 9(08)    COMP.                  
743300       05 WS-S500L020-0209-CAJ            PIC 9(02)    COMP.                  
743400       05 WS-S500L020-0209-TIPO-PAGO      PIC 9(02)    COMP.                  
743500       05 WS-S500L020-0209-FEC-ALTA       PIC 9(08)    COMP.                  
743600       05 WS-S500L020-0209-NOMINA         PIC 9(12)    COMP.                  
743700       05 WS-S500L020-0209-SUC            PIC 9(04)    COMP.                  
743800       05 WS-S500L020-0209-CONTRATO       PIC 9(12)    COMP.                  
743900       05 WS-S500L020-0209-TIPO-MEDACC    PIC 9(02)    COMP.                  
744000       05 WS-S500L020-0209-MEDACC         PIC 9(16)    COMP.                  
744100       05 WS-S500L020-0209-IMP-ORI        PIC 9(10)V99 COMP.                  
744200       05 WS-S500L020-0209-SDO-PEND       PIC 9(10)V99 COMP.                  
744300                                                                              
744400$POP OMIT                                                                     
744500                                                                              
744600$SET OMIT = NOT S500L02NR10                                                   
744700 01 WS-S500L020-0110-CPENDXCTA WITH LOWER-BOUNDS.                             
744800    03 WS-S500L020-0110-CONTRATO          PIC 9(12)    COMP.                  
744900    03 WS-S500L020-0110-FEC-CONTA         PIC 9(08)    COMP.                  
745000    03 WS-S500L020-0110-TIPO-PAGO         PIC 9(02)    COMP.                  
745100    03 WS-S500L020-0110-AUT               PIC 9(08)    COMP.                  
745200    03 WS-S500L020-0110-NUMREGS           PIC 9(02)    COMP.                  
745300    03 WS-S500L020-0110-PRIORIDAD         PIC 9(02)    COMP.                  
745400    03 WS-S500L020-0110-MODO-COBRO        PIC 9(02)    COMP.                  
745410    03 WS-S500L020-0110-INDCON            PIC 9(01)    COMP.                  
745500                                                                              
745600 01 WS-S500L020-0210-CPENDXCTA WITH LOWER-BOUNDS.                             
745700    03 WS-S500L020-0210-NUMREGS           PIC 9(02)    COMP.                  
745800    03 WS-S500L020-0210-CONTINUACION      PIC 9(02)    COMP.                  
745900    03 WS-S500L020-0210-NOMINA            PIC 9(12)    COMP.                  
746000    03 WS-S500L020-0210-NOMBRE            PIC X(36).                          
746100    03 WS-S500L020-0210-TBL OCCURS 10 TIMES.                                  
746200       04 WS-S500L020-0210-TIPO-PAGO      PIC 9(02)    COMP.                  
746300       04 WS-S500L020-0210-FEC-ALTA       PIC 9(08)    COMP.                  
746400       04 WS-S500L020-0210-SUC            PIC 9(04)    COMP.                  
746500       04 WS-S500L020-0210-CAJ            PIC 9(02)    COMP.                  
746600       04 WS-S500L020-0210-IMP-ORI        PIC 9(10)V99 COMP.                  
746700       04 WS-S500L020-0210-SDO-PEND       PIC 9(10)V99 COMP.                  
746800       04 WS-S500L020-0210-FEC-ULTPAGO    PIC 9(08)    COMP.                  
746900       04 WS-S500L020-0210-STATUS         PIC 9(02)    COMP.                  
747000       04 WS-S500L020-0210-AUT            PIC 9(08)    COMP.                  
747100       04 WS-S500L020-0210-PRIORIDAD      PIC 9(02)    COMP.                  
747200       04 WS-S500L020-0210-REFERENCIA     PIC 9(12)    COMP.                  
747300       04 WS-S500L020-0210-CLAVE-COBRO    PIC 9(04)    COMP.                  
747400       04 WS-S500L020-0210-FEC-LIMCOBR    PIC 9(08)    COMP.                  
747500       04 WS-S500L020-0210-HRA-LIMCOBR    PIC 9(06)    COMP.                  
747600       04 WS-S500L020-0210-MODO-COBRO     PIC 9(02)    COMP.                  
747650       04 WS-S500L020-0210-FEC-INI-CO     PIC 9(08)    COMP.                  
747652*INI EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
747654    03 WS-S500L020-0210-MARCA-CLON        PIC 9(01)    COMP.                  
747656*FIN EXTNET 2310 RESPUESTAS CON MARCA CLON                                    
747700                                                                              
747800$POP OMIT                                                                     
747900                                                                              
748000$SET OMIT = NOT S500L02NR12                                                   
748100 01 WS-S500L020-0112-SALCPE WITH LOWER-BOUNDS.                                
748200    03 WS-S500L020-0112-CTO               PIC 9(12)    COMP.                  
748300                                                                              
748400 01 WS-S500L020-0212-SALCPE WITH LOWER-BOUNDS.                                
748500    03 WS-S500L020-0212-IMPTO-RET         PIC  9(10)V99  COMP.                
748600    03 WS-S500L020-0212-TPO-PER           PIC  9(02)     COMP.                
748700    03 WS-S500L020-0212-STATUS            PIC  9(01)     COMP.                
748800    03 WS-S500L020-0212-INTS-CAPIT        PIC S9(10)V99  COMP.                
748900    03 WS-S500L020-0212-TAS-ANT           PIC  9(04)V999 COMP.                
749000    03 WS-S500L020-0212-TAS-ANT-ANT       PIC  9(04)V999 COMP.                
749100    03 WS-S500L020-0212-NOMBRE            PIC  X(40).                         
749200    03 WS-S500L020-0212-DIAS-CICLO        PIC  9(02)     COMP.                
749300    03 WS-S500L020-0212-CONT-COMIS50      PIC  9(06)     COMP.                
749400    03 WS-S500L020-0212-IMPUESTO-RET      PIC  9(12)     COMP.                
749500    03 WS-S500L020-0212-PROM-CICLO12      PIC  9(12)V99  COMP.                
749600    03 WS-S500L020-0212-TASA-BRUTA        PIC  9(04)V999 COMP.                
749700                                                                              
749800$POP OMIT                                                                     
749900                                                                              
750000$SET OMIT = NOT S500L02NR13                                                   
750100 01 WS-S500L020-0113-CONPASO WITH LOWER-BOUNDS.                               
750200    03 WS-S500L020-0113-PASO              PIC 9(03)    COMP.                  
750300                                                                              
750400 01 WS-S500L020-0213-CONPASO WITH LOWER-BOUNDS.                               
750500    03 WS-S500L020-0213-NUM-PASO-01       PIC 9(03)    COMP.                  
750600    03 WS-S500L020-0213-NUM-PASO-02       PIC 9(03)    COMP.                  
750700    03 WS-S500L020-0213-TIPO-PROCESO      PIC 9(01)    COMP.                  
750800    03 WS-S500L020-0213-TERMINO           PIC 9(01)    COMP.                  
750900                                                                              
751000$POP OMIT                                                                     
751100                                                                              
751200$SET OMIT = NOT S500L02NR14                                                   
751300 01 WS-S500L020-0114-GRUPOCPE WITH LOWER-BOUNDS.                              
751400    03 WS-S500L020-0114-NUMREGS           PIC 9(02)    COMP.                  
751500    03 WS-S500L020-0114-GRUPO             PIC 9(10)    COMP.                  
751600    03 WS-S500L020-0114-PREFIJO           PIC X(06).                          
751700                                                                              
751800 01 WS-S500L020-0214-GRUPOCPE WITH LOWER-BOUNDS.                              
751900    03 WS-S500L020-0214-NUMREGS           PIC 9(02)    COMP.                  
752000    03 WS-S500L020-0214-CONTINUACION      PIC 9(02)    COMP.                  
752100    03 WS-S500L020-0214-TBL OCCURS 12 TIMES.                                  
752200       04 WS-S500L020-0214-GRUPO          PIC 9(10)    COMP.                  
752300       04 WS-S500L020-0214-NOMBRE         PIC X(40).                          
752400       04 WS-S500L020-0214-OPCION         PIC 9(02)    COMP.                  
752500       04 WS-S500L020-0214-RANGO          PIC 9(02)    COMP.                  
752600       04 WS-S500L020-0214-FULACT         PIC 9(08)    COMP.                  
752700       04 WS-S500L020-0214-STATUS         PIC 9(02)    COMP.                  
752800                                                                              
752900$POP OMIT                                                                     
753000                                                                              
753100$SET OMIT = NOT S500L02NR15                                                   
753200 01 WS-S500L020-0115-CUENTACPE WITH LOWER-BOUNDS.                             
753300    03 WS-S500L020-0115-NUMREGS           PIC 9(02)    COMP.                  
753400    03 WS-S500L020-0115-GRUPO             PIC 9(10)    COMP.                  
753500    03 WS-S500L020-0115-SGRUPO            PIC 9(04)    COMP.                  
753600    03 WS-S500L020-0115-MDA               PIC 9(12)    COMP.                  
753700                                                                              
753800 01 WS-S500L020-0215-CUENTACPE WITH LOWER-BOUNDS.                             
753900    03 WS-S500L020-0215-NUMREGS           PIC 9(02)    COMP.                  
754000    03 WS-S500L020-0215-CONTINUACION      PIC 9(02)    COMP.                  
754100    03 WS-S500L020-0215-GRUPO             PIC 9(10)    COMP.                  
754200    03 WS-S500L020-0215-NOMBRE            PIC X(40).                          
754300    03 WS-S500L020-0215-OPCION            PIC 9(02)    COMP.                  
754400    03 WS-S500L020-0215-RANGO             PIC 9(02)    COMP.                  
754500    03 WS-S500L020-0215-STAGPO            PIC 9(02)    COMP.                  
754600    03 WS-S500L020-0215-TBL OCCURS 30 TIMES.                                  
754700       04 WS-S500L020-0215-SUBGPO         PIC 9(04)    COMP.                  
754800       04 WS-S500L020-0215-MDA            PIC 9(12)    COMP.                  
754900       04 WS-S500L020-0215-SPROCTO        PIC 9(04)    COMP.                  
755000       04 WS-S500L020-0215-CTO            PIC 9(12)    COMP.                  
755100       04 WS-S500L020-0215-CSI            PIC 9(02)    COMP.                  
755200       04 WS-S500L020-0215-TPOPER         PIC 9(02)    COMP.                  
755300       04 WS-S500L020-0215-STAMDA         PIC 9(02)    COMP.                  
755400                                                                              
755500$POP OMIT                                                                     
755600$SET OMIT = NOT S500L02NR16                                                   
755700                                                                              
755800**                                                                            
755900 01 WS-S500L020-0216-TIPROC               WITH LOWER-BOUNDS.                  
756000    03 WS-S500L020-0216-TIPO-PROCESO      PIC 9(02)    COMP.                  
756100                                                                              
756200$POP OMIT                                                                     
756210                                                                              
756220$SET OMIT = NOT S500L02NR17                                                   
756230 01 WS-S500L020-1110-FECHACLONA WITH LOWER-BOUNDS.                            
756240    03 WS-S500L020-1110-FECHA             PIC 9(08)    COMP.                  
756250    03 FILLER                             PIC X(52).                          
756260 77 WKS-S500L020-1110-FECHA               PIC 9(08).                          
756270$POP OMIT                                                                     
756300                                                                              
756400 77 WS-S500L020-RESULT                    PIC 9(11) BINARY.                   
756500                                                                              
756600****************************************************************              
756700*   RESULTS QUE REGRESA LA LIBRARY                             *              
756800*           1- REGISTRO DE SALIDA INSUFICIENTE                 *              
756900*           2- FUNCION INVALIDA                                *              
757000*           3- NO EXISTE REGISTRO                              *              
757100*           4- ERROR EN DMSII, SE MANDA A LA LOG MIX           *              
757200*              EL ERROR.                                       *              
757300*           5- REINTENTE MAS TARDE                             *              
757400*           6- EL CONTRATO NO PERTENECE AL CSI                 *              
757500*           7- EL EDOCTA EL SOLO PARA CTOS DE AHORROS          *              
757600*           8- ERROR CALL S408                                 *              
757700*                                                              *              
757800*  RESULTS POR ENTRY POINT:                                    *              
757900*    S500L020CONTRATO                                          *              
758000*       FUNCION 1, RESULTS: 0,2,3,4,5.                         *              
758100*       FUNCION 2, RESULTS: 0,2,3,4,5,6,8.                     *              
758200*       FUNCION 3, RESULTS: 0,2,3,4,5,6,8.                                    
758300*                                                              *              
758400*    S500L020EDOCTAAHO                                         *              
758500*                  RESULTS: 0,1,3,4,5,7.                       *              
758600*                                                              *              
758700*    S500L020CAMBPROC                                          *              
758800*                  RESULTS: 0,2,4.                             *              
758900*                                                              *              
759000*    S500L020FILECON                                           *              
759100*                  RESULTS: 0,1,2.                             *              
759200*                                                                             
759300*    S500L020COMPEND                                                          
759400*                  RESULTS: 0,2,3,4,5,6.                                      
759500****************************************************************              
759600                                                                              
759700                                                                              
759800$POP OMIT                                                                     
759805                                                                              
759810$SET OMIT = NOT LIBCONSUMERPROXY                                              
759815 01 WS-AGE-WIN-NAME.                                                          
759820    03 WS-AGENDA-NAME            PIC X(17).                                   
759825    03 FILLER                    PIC X(4) VALUE " OF ".                       
759830    03 WS-WINDOW-NAME            PIC X(17).                                   
759835 01 WS-CONSUMER-AGENDA-NAME      PIC X(17) VALUE "COBOLCONSUMER".             
759840 01 WS-CONSUMER-WINDOW-NAME      PIC X(17) VALUE "COBOLCONSUMER".             
759845 01 WS-CONSUMER-PROGRAM-NAME     PIC X(17) VALUE "COBOLCONSUMER". 187500      
759850 01 WS-PROXY-AGENDA-NAME         PIC X(17) VALUE "OUTEPO".                    
759855 01 WS-PROXY-WINDOW-NAME         PIC X(17) VALUE "COBOLPROXY".                
759860 01 WS-PROXY-PROGRAM-NAME        PIC X(17) VALUE "COBOLPROXY".                
759865 77 WS-CONSUMER-AGENDA-DESG      REAL.                                        
759870 77 WS-CONSUMER-PROGRAM-DESG     REAL.                                        
759875 77 WS-PROXY-AGENDA-DESG         REAL.                                        
759880 77 WS-PROXY-PROGRAM-DESG        REAL.                                        
759885$POP OMIT                                                                     
759890                                                                              
759900$SET OMIT = NOT SYSTEMLIBCOMSXATMI                                            
760000                                                                              
760100 01  WS-XATMI-PROG-NAME          PIC X(17) WITH LOWER-BOUNDS.                 
760200 77  WS-XATMI-RSLT               PIC S9(11) BINARY.                           
760300$POP OMIT                                                                     
760400$SET OMIT = NOT S080DATOS                                                     
760500*********************************************************                     
760600***   CAMPOS PARA LA CARGA DE DATOS DEL S080 A MEMORIA **                     
760700*********************************************************                     
760800*INI FSW                  P09-XXX  Afews                  ABARBOSA            
760900 77  WS-IND-IMPGLO             PIC 9(01).                                     
761000*FIN FSW                  P09-XXX  Afews                  ABARBOSA            
761100 77  W77-IND-S080              PIC 9(04)   COMP   VALUE 0.                    
761200 77  W77-FIN-S080              PIC 9(02)   COMP   VALUE 0.                    
761300                                                                              
761400 77 WKS-S080-IMPCORR-CARGO     PIC 9(10)V99.                                  
761500 77 WKS-S080-IMPCORR-ABONO     PIC 9(10)V99.                                  
761600                                                                              
761700 77 WS-IMPCORR-CARGO           PIC 9(10).                                     
761800 77 WS-IMPCORR-ABONO           PIC 9(10).                                     
761900                                                                              
762000 01  WKS-S080-DATOS-IN.                                                       
762100     02 WKS-S080-NUMPASO       PIC 9(04)        COMP.                         
762200     02 WKS-S080-FECHA         PIC 9(08)        COMP.                         
762300     02 WKS-S080-NUMSUC        PIC 9(04)        COMP.                         
762400                                                                              
762500 01  WKS-S080-DATOS-SAL.                                                      
762600     02 WKS-S080-INDOPE        PIC 9(02)        COMP.                         
762700     88 W88-SUC-SI-OPERA       VALUE 1.                                       
762800     88 W88-SUC-NO-OPERA       VALUE 0.                                       
762900     02 WKS-S080-SUC-FACXADMWIN   PIC 9(02)     COMP.                         
763000     02 WKS-S080-CENT-INTERCAMBIO-IND PIC 9(02) COMP.                         
763100     02 WKS-S080-NUMCSI        PIC 9(02)        COMP.                         
763200     88 W88-S080-CSI-MTY       VALUE 04.                                      
763300     88 W88-S080-CSI-VDM       VALUE 10.                                      
763400     02 WKS-S080-TIPO-OFI      PIC 9(02)        COMP.                         
763500     02 WKS-S080-SBTP-OFI      PIC 9(02)        COMP.                         
763600     02 WKS-S080-IVA0          PIC V99.                                       
763700     02 WKS-S080-IVA1          PIC 9(02)V99     COMP.                         
763800     88 W88-S080-ES-IVA10      VALUE 1.10, 1.11.                              
763900     88 W88-S080-ES-IVA15      VALUE 1.15, 1.16.                              
764000     02 WKS-S080-TPO-IVA       PIC 9(02)        COMP.                         
764100     88 W88-S080-TIVA-10       VALUE 01.                                      
764200     88 W88-S080-TIVA-15       VALUE 02.                                      
764300     02 WKS-S080-NODO-IMP      PIC 9(02)        COMP.                         
764400     02 WKS-S080-RGNTASA       PIC 9(02)        COMP.                         
764500     02 WKS-S080-NOMCORTO      PIC X(20).                                     
764600                                                                              
764700     02 WKS-S080-STA-DATO      PIC 9(02)        COMP.                         
764800     88 W88-S080-DATO-OK       VALUE 0.                                       
764900*       SUC OPERATIVA RANGO 71                                                
765000     88 W88-S080-STA-NOOK      VALUE 1.                                       
765100*       SUC NO OPERATIVA                                                      
765200     88 W88-S080-STA-INV       VALUE 2.                                       
765300*       NUM/SUC SOLICITADO INVALIDO                                           
765400                                                                              
765500***  CAMPOS PARA EL MANEJO DE FM.                                             
765600     02 WKS-S080-INDFM         PIC 9(02)        COMP.                         
765700     02 WKS-S080-IMPFM         PIC 9(08)V99     COMP.                         
765800                                                                              
765900*INI FSW                  P09-XXX  Afews                  ABARBOSA            
766000 01 WKS-S080-INDFMGLO                      PIC 9(02)    COMP.                 
766100*FIN FSW                  P09-XXX  Afews                  ABARBOSA            
766200 01 WKS-S080-IMPFMGLO                      PIC 9(08)V99 COMP.                 
766300 01 WKS-S080-IMPFMGLOMN                    PIC 9(08)V99 COMP.                 
766400 01 WS-IMPORTEFM.                                                             
766500    02 WS-IMPORTE-FM                       PIC 9(12) COMP.                    
766600    02 WS-IMP-FM REDEFINES WS-IMPORTE-FM.                                     
766700       03 WS-IMPO-FM                       PIC 9(11) COMP.                    
766800       03 WS-DECI-FM                       PIC 9(1)  COMP.                    
766900                                                                              
767000     02 WKS-S080-RS-CARGA      PIC 9(02)        COMP.                         
767100     88 W88-S080-SIN-ERR       VALUE 00.                                      
767200*       CARGA COMPLETA SIN ERROR                                              
767300                                                                              
767400     88 W88-S080-ERR-IVAS      VALUE 01.                                      
767500*       CARGA COMPLETA Y                                                      
767600*       ALGUNA SUC/VALIDA SIN IVA CALIFICADO                                  
767700*       CARGA 15% POR DEFAULT                                                 
767800                                                                              
767900     88 W88-S080-ERR-SUC       VALUE 02.                                      
768000*       CARGA INCOMPLETA                                                      
768100*       LIB/S080 REGRESA NUM/SUC EN CEROS                                     
768200                                                                              
768300     88 W88-S080-ERR-S080      VALUE 80, 90, 99.                              
768400*       CARGA INCOMPLETA                                                      
768500*       80=LIBRERIA NO DISPONIBLE                                             
768600*       90=PROBLEMAS EN BASE DEL S080                                         
768700*       99=LIBRERIA CON PROBLEMAS                                             
768800                                                                              
768900 01 WKS-S080-IMP-CORRESPONSALES.                                              
769000    02 WKS-S080-IMPCORR-CGO                   PIC 9(12) COMP.                 
769100    02 WKS-S080-IMPCORR-CGO-R  REDEFINES WKS-S080-IMPCORR-CGO.                
769200       03 WKS-S080-IMPCORR-CGO-ENT            PIC 9(11) COMP.                 
769300       03 WKS-S080-IMPCORR-CGO-DEC            PIC 9(1)  COMP.                 
769400                                                                              
769500    02 WKS-S080-IMPCORR-ABO                   PIC 9(12) COMP.                 
769600    02 WKS-S080-IMPCORR-ABO-R  REDEFINES WKS-S080-IMPCORR-ABO.                
769700       03 WKS-S080-IMPCORR-ABO-ENT            PIC 9(11) COMP.                 
769800       03 WKS-S080-IMPCORR-ABO-DEC            PIC 9(1)  COMP.                 
769900                                                                              
770000*INI             P10-119  Migracion Prepagada             ABARBOSA            
770100 01  WS-IND                       PIC  9(02).                                 
770200 01  WS-BIN-IND                   PIC  9(04).                                 
770300 01  WKS-BINES-TABLA.                                                         
770400     02 WKS-BIN-TBL       OCCURS  1000 TIMES.                                 
770500        03 WKS-BIN-NUM            PIC  9(06) COMP.                            
770600        03 WKS-BIN-PROD           PIC  9(04) COMP.                            
770700        03 WKS-BIN-INST           PIC  9(02) COMP.                            
770800        03 WKS-BIN-MONEDA         PIC  9(04) COMP.                            
770900        03 WKS-BIN-RASG-DEP-S274  PIC  9(02) COMP.                            
771000        03 WKS-BIN-RASG-DEP-INI   PIC  9(02) COMP.                            
771100        03 WKS-BIN-ASIG-C111      PIC  9(02) COMP.                            
771200        03 WKS-BIN-ASIG-C730      PIC  9(02) COMP.                            
771300        03 WKS-BIN-ASIG-C704      PIC  9(02) COMP.                            
771400        03 WKS-BIN-RASIG-C704     PIC  9(02) COMP.                            
771500        03 WKS-BIN-RASIG-C735     PIC  9(02) COMP.                            
771600        03 WKS-BIN-DATO-12        PIC  9(02) COMP.                            
771700        03 WKS-BIN-DATO-13        PIC  9(02) COMP.                            
771800        03 WKS-BIN-DATO-14        PIC  9(02) COMP.                            
771900        03 WKS-BIN-DATO-15        PIC  9(02) COMP.                            
771902                                                                              
771904*INI ECC TESOFE II SIRH                                                       
771906 01 WS-SIRH-IND                   PIC  9(04).                                 
771908   01 WKS-SIRH-TABLA.                                                         
771910     02 WKS-SIRH-TBL      OCCURS 1 TO 500 TIMES                               
771912        INDEXED BY WS-TEM-IND8.                                               
771914        03 WKS-SIRH-NUM            PIC  9(04) COMP.                           
771916*FIN ECC TESOFE II SIRH                                                       
772000*INI SRA CONTROL DYR FASE II CAT1807                                          
772002 01 WS-SIRH-POS                PIC  9(05) VALUE 0.                            
772004 01 WKS-SIRH-CAT1807-TABLA.                                                   
772006   02 WKS-SIRH-CAT1807-TABL    OCCURS 10000 TIMES.                            
772008     03 WKS-NUM-SIRH           PIC 9(04) COMP.                                
772010     03 WKS-NUM-CAJA           PIC 9(02) COMP.                                
772012     03 WKS-NUM-SIRH-ESQU      PIC 9(01) COMP.                                
772014 01 WS-SIST-POS                PIC  9(04) VALUE 0.                            
772016 01 WKS-SIST-CAT1807-TABLA.                                                   
772018   02 WKS-SIST-CAT1807-TABL    OCCURS 9999 TIMES.                             
772020     03 WKS-NUM-SIST           PIC 9(04) COMP.                                
772022     03 WKS-NUM-SIST-ESQU      PIC 9(01) COMP.                                
772024 01 WKS-S080-DATOS-CAT1807.                                                   
772026   02 WKS-S080-IND-REG          PIC 9(01).                                    
772027   02 WKS-S080-SIST             PIC 9(04).                                    
772028   02 WKS-S080-SIRH-SIST        PIC 9(04).                                    
772029   02 WKS-S080-SIRH             PIC 9(04).                                    
772030   02 WKS-S080-CAJA             PIC 9(02).                                    
772032   02 WKS-S080-ESQ              PIC 9(01).                                    
772034*FIN SRA CONTROL DYR FASE II CAT1807                                          
772050*CAMBIO LLAVE SIST Y SIRH CAT1807                     BRANCHES INI            
772052 77 WS-SISTSIRH-POS             PIC  9(05) VALUE 0.                           
772054 01 WKS-SS-CAT1807-TABLA.                                                     
772056    02 WKS-SS-CAT1807-TABL    OCCURS 10000 TIMES.                             
772058       03 WKS-NUM-SIST-SS       PIC 9(04) COMP.                               
772060       03 WKS-NUM-SIRH-SS       PIC 9(04) COMP.                               
772062       03 WKS-NUM-ESQU-SS       PIC 9(01) COMP.                               
772064*CAMBIO LLAVE SIST Y SIRH CAT1807                     BRANCHES FIN            
772100 01  WKS-S080-DATOS-SAL-BIN.                                                  
772200     02 WKS-S080-BIN              PIC  9(06).                                 
772300     02 WKS-S080-PROD             PIC  9(04).                                 
772400     02 WKS-S080-INST             PIC  9(02).                                 
772500     02 WKS-S080-MONEDA           PIC  9(04).                                 
772600     02 WKS-S080-RASG-DEP-S274    PIC  9(02).                                 
772700     02 WKS-S080-RASG-DEP-INI     PIC  9(02).                                 
772800     02 WKS-S080-ASIG-C111        PIC  9(02).                                 
772900     02 WKS-S080-ASIG-C730        PIC  9(02).                                 
773000     02 WKS-S080-ASIG-C704        PIC  9(02).                                 
773100     02 WKS-S080-RASIG-C704       PIC  9(02).                                 
773200     02 WKS-S080-RASIG-C735       PIC  9(02).                                 
773300     02 WKS-S080-DATO-12          PIC  9(02).                                 
773400     02 WKS-S080-DATO-13          PIC  9(02).                                 
773500     02 WKS-S080-DATO-14          PIC  9(02).                                 
773600     02 WKS-S080-DATO-15          PIC  9(02).                                 
773700                                                                              
773800*FIN             P10-119  Migracion Prepagada             ABARBOSA            
773900                                                                              
774000*INI BSR. TRANSFER/CATALOGO BINES                                             
774100 01  WS-IND-BIN-CTAMOVIL          PIC  9(04).                                 
774200 77  WS-VAL-BIN-CTAMOVIL          PIC  9(01).                                 
774300 88 WS-HAY-BIN-CTAMOVIL           VALUE  01.                                  
774400                                                                              
774500                                                                              
774600 01  WKS-BINES-CTAMOVIL.                                                      
774700     02 WKS-TBL-BIN-CTAMOVIL      OCCURS  0500 TIMES.                         
774800        03 WKS-BIN-NUM-MOVIL      PIC  9(06) COMP.                            
774900        03 WKS-BIN-EMISOR-MOVIL   PIC  X(12).                                 
775000        03 WKS-BIN-ESTATUS-MOVIL  PIC  X(12).                                 
775100        03 WKS-BIN-USO-MOVIL      PIC  X(12).                                 
775200        03 WKS-BIN-DESCRIP-MOVIL  PIC  X(60).                                 
775300                                                                              
775400 01  WKS-S080-DATOS-BIN-MOVIL.                                                
775500     02 WKS-S080-BIN-MOVIL        PIC  9(06).                                 
775600     02 WKS-S080-EMISOR-MOVIL     PIC  X(12).                                 
775700     02 WKS-S080-ESTATUS-MOVIL    PIC  X(12).                                 
775800     02 WKS-S080-USO-MOVIL        PIC  X(12).                                 
775900     02 WKS-S080-DESCRIP-MOVIL    PIC  X(60).                                 
776000                                                                              
776100 01  WKS-BIN-CAT198.                                                          
776200     02 WKS-BIN-TRANSFER          PIC X(12).                                  
776300     02 WKS-BIN-TRANSFER-I        REDEFINES                                   
776400        WKS-BIN-TRANSFER.                                                     
776500        03 WKS-PREF-TRANSFER      PIC 9(03).                                  
776600        03 WKS-NUM-BIN-TRANSFER   PIC 9(06).                                  
776700        03 WKS-SUF-TRANSFER       PIC 9(03).                                  
776800                                                                              
776900*FIN BSR. TRANSFER/CATALOGO BINES                                             
777000**********************************************************                    
777100 01  WS-IND-NIV                   PIC  9(04).                                 
777200 01  WS-NIV-IND                   PIC  9(04).                                 
777300 01  WKS-NIVEL-TABLA.                                                         
777400     02 WKS-NIV-TBL       OCCURS  3000 TIMES.                                 
777500        03 WKS-NIV-PROD           PIC  9(04) COMP.                            
777600        03 WKS-NIV-INST           PIC  9(02) COMP.                            
777700        03 WKS-NIV-MONEDA         PIC  9(04) COMP.                            
777800        03 WKS-NIV-NUMERO         PIC  9(02) COMP.                            
777900        03 WKS-NIV-TIPOPER        PIC  9(02) COMP.                            
778000        03 WKS-NIV-LIMITE         PIC  9(12) COMP.                            
778100                                                                              
778200 01  WKS-S080-DATOS-SAL-NIV.                                                  
778300     02 WKS-S080-NIV-PROD         PIC  9(04).                                 
778400     02 WKS-S080-NIV-INST         PIC  9(02).                                 
778500     02 WKS-S080-NIV-MONEDA       PIC  9(04).                                 
778600     02 WKS-S080-NIV-NUMERO       PIC  9(02).                                 
778700     02 WKS-S080-NIV-TIPOPER      PIC  9(02).                                 
778800     02 WKS-S080-NIV-LIMITE       PIC  9(12).                                 
778900                                                                              
779000 01  WS-NIV-MONEDA                PIC  9(04).                                 
779100 01  WS-NIV-TIPO-PER              PIC  9(02).                                 
779200 01  WS-NIV-LIMITE                PIC  9(12)V9(02).                           
779300 01  WS-NIV-LIMITE-UDI            PIC  9(12)V9(02).                           
779400                                                                              
779500 01  WKS-TABLA-S080-01.                                                       
779600     02 WKS-TB-S080-XSUC-01          OCCURS 9999.                             
779700        04 WKS-TB-S080-NUMSUC-01     PIC 9(04)     COMP.                      
779800        04 WKS-TB-S080-OPERA-01      PIC 9(02)     COMP.                      
779900        04 WKS-TB-S080-CSI-01        PIC 9(02)     COMP.                      
780000        04 WKS-TB-S080-TPOFNA-01     PIC 9(02)     COMP.                      
780100        04 WKS-TB-S080-SBTPOFNA-01   PIC 9(02)     COMP.                      
780200                                                                              
780300 01  WKS-TABLA-S080-01B.                                                      
780400     02 WKS-TB-S080-XSUC-01B         OCCURS 9999.                             
780500        04 WKS-TB-S080-IVA0-01       PIC 9(00)V99  COMP.                      
780600        04 WKS-TB-S080-IVA1-01       PIC 9(02)V99  COMP.                      
780700        04 WKS-TB-S080-NODO-01       PIC 9(02)     COMP.                      
780800        04 WKS-TB-S080-INDFM-01      PIC 9(02)     COMP.                      
780900                                                                              
781000 01  WKS-TABLA-S080-01C.                                                      
781100     02 WKS-TB-S080-XSUC-01C         OCCURS 9999.                             
781200        04 WKS-TB-S080-IMPFM-01      PIC 9(08)V99  COMP.                      
781300                                                                              
781400 01 WKS-TABLA-S080-02.                                                        
781500    02 WKS-TB-S080-XSUC-02          OCCURS 3000.                              
781600       04 WKS-TB-S080-NCORTO-01     PIC X(20).                                
781700                                                                              
781800 01 WKS-TABLA-S080-02B.                                                       
781900    02 WKS-TB-S080-XSUC-02B         OCCURS 3000.                              
782000       04 WKS-TB-S080-NCORTO-02     PIC X(20).                                
782100                                                                              
782200 01 WKS-TABLA-S080-02C.                                                       
782300    02 WKS-TB-S080-XSUC-02C         OCCURS 3000.                              
782400       04 WKS-TB-S080-NCORTO-03     PIC X(20).                                
782500                                                                              
782600 01 WKS-TABLA-S080-02D.                                                       
782700    02 WKS-TB-S080-XSUC-02D         OCCURS 1000.                              
782800       04 WKS-TB-S080-NCORTO-04     PIC X(20).                                
782900                                                                              
783000 01  WKS-TB-REGION-TASA.                                                      
783100      02 WKS-TB-REGION-SUC          OCCURS 9999.                              
783200         04 WKS-TB-REGION           PIC 9(02)   COMP.                         
783300         04 WKS-TBS080-INDSUC       PIC 9(04)   COMP.                         
783400                                                                              
783500 01  WKS-TB-REGION-A-S080.                                                    
783600      02 WKS-TB-REGION-TASAS        OCCURS  20.                               
783700         04 WKS-TB-RG-S080          PIC 99      COMP.                         
783800         04 WKS-TB-SIN-TASA         PIC 9(02)   COMP OCCURS 30.               
783900                                                                              
784000                                                                              
784100***************************************************************               
784200$POP OMIT                                                                     
784300$SET OMIT = NOT S080L100                                                      
784400*******************************************************                       
784500***   CAMPOS PARA DATOS GENERALES DE SUC            ***                       
784600***   ENTRY-POINT L120_NEXT_OFICINA                 ***                       
784700***               L100_CONS_OFICINAS                ***                       
784800*******************************************************                       
784900 77  WS-S080L100-SISTEMA-I            PIC S9(11)    BINARY.                   
785000 77  WS-S080L100-PASO-I               PIC S9(11)    BINARY.                   
785100 77  WS-S080L100-RESULT               PIC S9(11)    BINARY.                   
785200                                                                              
785300 01  WKS-S080L100-ENTRADA.                                                    
785400     02 WKS-S080-L100-CVERGO-E     PIC 9(02)    COMP.                         
785500     88 W88-S080-L100-OPERA        VALUE 71.                                  
785600     88 W88-S080-L100-NOCONT       VALUE 72.                                  
785700     88 W88-S080-L100-OPECOMER     VALUE 60.                                  
785800     88 W88-S080-L100-PZAREGDIS    VALUE 50.                                  
785900     88 W88-S080-L100-DIRECCION    VALUE 40.                                  
786000     88 W88-S080-L100-DIVISION     VALUE 30.                                  
786100     88 W88-S080-L100-AREAS        VALUE 20.                                  
786200     88 W88-S080-L100-COMITES      VALUE 10.                                  
786300     02 WKS-S080-L100-NUMOFI-E     PIC 9(04)    COMP.                         
786400     02 WKS-S080-L100-TPOCON-E     PIC 9(02)    COMP.                         
786500     88 W88-S080-L100-XOFNA        VALUE 0.                                   
786600     88 W88-S080-L100-XALFA        VALUE 25.                                  
786700     02 FILLER                     PIC X(27).                                 
786800                                                                              
786900***  SALIDA SIZE 360 BYTES ************************************               
787000 01  WKS-S080L100-SALIDA              PIC X(360).                             
787100 01  RD-WKS-S080L100-SALIDA REDEFINES WKS-S080L100-SALIDA.                    
787200     02 WKS-S080-L100-NUMOFI-S        PIC 9(04)     COMP.                     
787300     02 WKS-S080-L100-CVERGO-S        PIC 9(02)     COMP.                     
787400     02 WKS-S080-L100-COMITE-S        PIC 9(04)     COMP.                     
787500     02 WKS-S080-L100-AREA-S          PIC 9(04)     COMP.                     
787600     02 WKS-S080-L100-DIVISI-S        PIC 9(04)     COMP.                     
787700     02 WKS-S080-L100-DIRECC-S        PIC 9(04)     COMP.                     
787800     02 WKS-S080-L100-PZRGDI-S        PIC 9(04)     COMP.                     
787900     02 WKS-S080-L100-OPCIAL-S        PIC 9(04)     COMP.                     
788000     02 WKS-S080-L100-TP-OFI-S        PIC 9(02)     COMP.                     
788100     02 WKS-S080-L100-NCORTO-S        PIC X(20).                              
788200     02 WKS-S080-L100-NLARGO-S        PIC X(40).                              
788300     02 WKS-S080-L100-DOMI-S          PIC X(36).                              
788400     02 WKS-S080-L100-COLO-S          PIC X(24).                              
788500     02 WKS-S080-L100-POBLA-S         PIC X(20).                              
788600     02 WKS-S080-L100-ZNPOST-S        PIC 9(02)     COMP.                     
788700     02 WKS-S080-L100-CODPOST-S       PIC 9(06)     COMP.                     
788800     02 WKS-S080-L100-APD-POST-S.                                             
788900        04 WKS-S080-L100-AGCIA-S      PIC X(04).                              
789000        04 WKS-S080-L100-NAPDO-S      PIC X(08).                              
789100        04 WKS-S080-L100-CPAPDO-S     PIC 9(06)     COMP.                     
789200        04 WKS-S080-L100-POB-APD-S    PIC X(20).                              
789300     02 WKS-S080-L100-ENVCORR-S       PIC 9(02)     COMP.                     
789400     02 WKS-S080-L100-TELOFI-S        PIC 9(10)     COMP.                     
789500     02 WKS-S080-L100-NOMRESP-S       PIC X(36).                              
789600     02 WKS-S080-L100-ALTRESP-S       PIC 9(06)     COMP.                     
789700     02 WKS-S080-L100-TELRESP-S       PIC 9(10)     COMP.                     
789800     02 WKS-S080-L100-ESTADO-S        PIC 9(02)     COMP.                     
789900     02 WKS-S080-L100-CIUDAD-S        PIC 9(04)     COMP.                     
790000     02 WKS-S080-L100-DELEG-S         PIC 9(04)     COMP.                     
790100     02 WKS-S080-L100-REGION-S        PIC 9(02)     COMP.                     
790200     02 WKS-S080-L100-ZONA-S          PIC 9(02)     COMP.                     
790300     02 WKS-S080-L100-ZNECON-S        PIC X(04).                              
790400     02 WKS-S080-L100-ZNSALA-S        PIC 9(02)     COMP.                     
790500     02 WKS-S080-L100-LBCOMEX-S       PIC 9(08)     COMP.                     
790600     02 WKS-S080-L100-NIV-AUT-S       PIC 9(02)     COMP.                     
790700     02 WKS-S080-L100-NUMCSI-S         PIC 9(02)     COMP.                    
790800     02 WKS-S080-L100-CCITARJ-S        PIC 9(08)     COMP.                    
790900     02 WKS-S080-L100-SUCREP1-S        PIC 9(08)     COMP.                    
791000     02 WKS-S080-L100-SUCREP2-S        PIC 9(08)     COMP.                    
791100     02 WKS-S080-L100-CTAUNICA-S       PIC 9(08)     COMP.                    
791200     02 WKS-S080-L100-BANCA-S          PIC 9(02)     COMP.                    
791300     02 WKS-S080-L100-ALTA-S           PIC 9(06)     COMP.                    
791400     02 WKS-S080-L100-BAJA-S           PIC 9(06)     COMP.                    
791500     02 WKS-S080-L100-MODI-S           PIC 9(06)     COMP.                    
791600     02 WKS-S080-L100-ACID-S           PIC 9(08)     COMP.                    
791700     02 WKS-S080-L100-TPINMB-S         PIC X(01).                             
791800     02 WKS-S080-L100-CVINMB-S         PIC X(07).                             
791900     02 WKS-S080-L100-SBT-OFI-S        PIC 9(02)     COMP.                    
792000     02 WKS-S080-L100-NOMIGTE-S        PIC 9(10)     COMP.                    
792100     02 FILLER                         PIC X(53).                             
792200                                                                              
792300$POP OMIT                                                                     
792400$SET OMIT = NOT S080L700UDIS                                                  
792500****************************************************************              
792600***  PARAMETROS PARA OBTENER CALCULO                           *              
792700***  DE UDIS  A PESOS (WKS-S080-UDI-TPOPE=02)                  *              
792800***  DE PESOS A UDIS  (WKS-S080-UDI-TPOPE=01)                  *              
792900***  EL VALOR DE LA UDI REGRESA EN (WKS-S080-UDI-TPOCAMB)      *              
793000****************************************************************              
793100                                                                              
793200 77 W77-S080-RS-UDIS           PIC S9(11) BINARY.                             
793300                                                                              
793400 01 WKS-S080-PARAM-UDIS.                                                      
793500    04 WKS-S080-UDI-CVE        PIC  9(02).                                    
793600***    DE ENTRADA ENVIAR  21                                                  
793700***    DE SALIDA  REGRESA 21                                                  
793800    04 WKS-S080-UDI-TPOPE      PIC  9(01).                                    
793900***    01= DE PESOS A UDIS, 02= DE UDIS A PESOS                               
794000***    DE ENTRADA ENVIAR  02 (DE UDIS A PESOS)                                
794100***    DE SALIDA  REGRESA 02 (DE UDIS A PESOS)                                
794200    04 WKS-S080-UDI-IMPMN      PIC  9(12)V99.                                 
794300***    DE ENTRADA ENVIAR CEROS                                                
794400***    DE SALIDA  REGRESA EL IMPORTE EN M.N. DE UDIS SOLICITADAS              
794500    04 WKS-S080-UDI-IMPUDI     PIC  9(12)V99.                                 
794600***    DE ENTRADA ENVIAR  1.00    (UNA UDI)                                   
794700***    DE SALIDA  REGRESA 1.00    (UNA UDI)                                   
794800    04 WKS-S080-UDI-FECVIG     PIC  9(06).                                    
794900***    DE ENTRADA ENVIAR FECHA AAMMDD (NO DEBE SER CEROS)                     
795000***    DE SALIDA REGRESA FECHA DE VIGENCIA AAMMDD                             
795100    04 WKS-S080-UDI-TPOCAMB    PIC  9(11).                                    
795200***    DE ENTRADA ENVIAR CEROS                                                
795300***    DE SALIDA  REGRESA VALOR UDI (GUARDAR CON 6 DECIMALES)                 
795400    04 WKS-S080-UDI-DCTPCAMB   PIC  9(02).                                    
795500***    DE ENTRADA ENVIAR CEROS                                                
795600***    DE SALIDA REGRESA DECIMALES DE CAMPO WKS-S080-UDI-TPOCAMB              
795700$POP OMIT                                                                     
795800***************************************************************               
795900                                                                              
796000$SET OMIT = NOT S080CAT253                                                    
796100*************************************************************                 
796200*TABLA DE SUCURSALES FACULTADAS PARA TRANSMITIR X ADMWIN                      
796300 01  WKS-TB-CENT-INTERCAMBIO.                                                 
796400     02 WKS-TB-CENT-INTERCAMBIO-O         OCCURS 9999.                        
796500        04 WKS-TB-CENT-INTERCAMBIO-IND    PIC 9(02) COMP.                     
796600$POP OMIT                                                                     
796700                                                                              
796800$SET OMIT = NOT SYSTEMLIBCOMSTRANSIT                                          
796900 77 WS-TOLTP-SD                 REAL.                                         
797000 77 WS-TOLTP-BD                 REAL.                                         
797100                                                                              
797200 01 WS-TOLTP-BUFFER             PIC X(3000) WITH LOWER-BOUNDS.                
797300 01 WS-TOLTP-BUFFER-R REDEFINES WS-TOLTP-BUFFER.                              
797400     03 WS-TOLTP-BUF-RESULT     PIC   9(06).                                  
797500     03 WS-TOLTP-BUF-INFO       PIC X(2994).                                  
797600 01 WS-TOLTP-BUFFER-SERVICIO REDEFINES WS-TOLTP-BUFFER.                       
797700     03 WS-TOLTP-BUF-SERVICIO   PIC X(0002).                                  
797800     03 WS-TOLTP-BUF-SIN-SERV   PIC X(2998).                                  
797820 01 INPUT-HEADER WITH LOWER-BOUNDS.                                           
797840   02 IH-WORDS OCCURS 36.                                                     
797860      03 IH-WORD           REAL.                                              
797900                                                                              
798000 77 WS-TOLTP-BUFFER-INVAL       PIC S9(11)  BINARY VALUE -2.                  
798100 77 WS-TOLTP-CDESG              REAL.                                         
798200 77 WS-TOLTP-ERR-XATMI          PIC S9(11)  BINARY.                           
798300 77 WS-TOLTP-ERR-XATMI-DISP     PIC 9(4)    DISPLAY.                          
798400 77 WS-TOLTP-ERR-UNISYS         PIC S9(11)  BINARY.                           
798500 77 WS-TOLTP-ERR-UNISYS-DISP    PIC 9(4)    DISPLAY.                          
798600 77 WS-TOLTP-FLAGS              REAL.                                         
798700 77 WS-TOLTP-FUNCION-XATMI      PIC X(11)   VALUE SPACES.                     
798800 77 WS-TOLTP-RESULT             PIC S9(11)  BINARY.                           
798900 77 WS-TOLTP-J                  PIC S9(11)  BINARY.                           
799000 77 WS-TOLTP-J-DISPLAY          PIC 9(1)    DISPLAY.                          
799100 77 WS-TOLTP-K                  PIC S9(11)  BINARY.                           
799200 77 WS-TOLTP-LEN                PIC S9(11)  BINARY.                           
799300 77 WS-TOLTP-LEN-DISPLAY        PIC 9(4)    DISPLAY.                          
799400 77 WS-TOLTP-NAME               PIC X(16).                                    
799500 77 WS-TOLTP-NULO               PIC X(1)    VALUE @00@.                       
799600 77 WS-TOLTP-RCODE              PIC S9(11)  BINARY VALUE 0.                   
799700*77 WS-TOLTP-RVAL               PIC S9(11)  BINARY.                           
799800 01 WS-TOLTP-SCRATCH.                                                         
799900    02 WS-TOLTP-SCRATCH-02      PIC X(256).                                   
800000    02 WS-TOLTP-SCRATCH-RED REDEFINES                                         
800100       WS-TOLTP-SCRATCH-02 PIC X(1) OCCURS 256.                               
800200 01 WS-TOLTP-SCRATCH2           PIC X(256)  VALUE SPACES.                     
800300 77 WS-TOLTP-SERV-DESC          PIC S9(11)  BINARY VALUE -1.                  
800400 77 WS-TOLTP-SUBTIPO            PIC X(16).                                    
800500 77 WS-TOLTP-SVC                REAL.                                         
800600 77 WS-TOLTP-TIPO               PIC X(8).                                     
800700*77 WS-TOLTP-TPFAIL             PIC S9(11)  BINARY VALUE 1.                   
800800 77 WS-TOLTP-TPSUCCESS          PIC S9(11)  BINARY VALUE 0.                   
800900 77 WS-TOLTP-UNO                PIC S9(11)  BINARY VALUE 1.                   
801000 77 WS-TOLTP-X-OCTET-BD         REAL.                                         
801100$POP OMIT                                                                     
801200$SET OMIT = NOT S041SEGURIDAD                                                 
801300******************************************************************            
801400*             LIBRERIA: SEGURIDAD (DEL S041)                     *            
801500*                                                                *            
801600* ENTRY_POINT : VALIDA_FACULTAD                                  *            
801700* TIPO        : INTEGER                                          *            
801800* DESCRIPCION : ESTE ENTRY_POINT SE DEBERA DE USAR EN LAS APLICA-*            
801900*               CIONES PARA DETERMINAR SI EL OPERADOR FIRMADO EN *            
802000*               LA TERMINAL DESDE DONDE SE RECIBIO EL MENSAJE,   *            
802100*               TIENE O NO LA FACULTAD REQUERIDA PARA EFECTUAR LA*            
802200*               TRANSACCION.                                     *            
802300* DATOS DE ENTRADA :                                             *            
802400*   WS-S041-LSN    : (LOGICAL STATION  UMBER) NUMERO LOGICO DONDE*            
802500*                    SE ORIGINA EL MENSAJE A  LA  APLICACION,  EL*            
802600*                    CUAL SE TOMA DEL  HEADER  DE  COMUNICACIONES*            
802700*                    DEL MENSAJE ORIGINAL. ES IMPORTANTE CONSIDE-*            
802800*                    RAR EL MANEJO DE LSN HEXADECIMAL.           *            
802900*   WS-S041-STANAME: (STATION NAME) NOMBRE DE ESTACION  DONDE  SE*            
803000*                    ORIGINA EL MENSAJE A LA APLICACION , EL CUAL*            
803100*                    SE DEBE TOMAR DEL HEADER DE COMUNICACIONES. *            
803200*   WS-S041-SISTEMA: ES EL NUMERO ASIGNADO AL SISTEMA. P/EJ.S041,*            
803300*                    S080,S018,.. ETC.                           *            
803400*   WS-S041-CVETRAN: ES LA CLAVE DE LA TRANSACCION ACORDADA  PRE-*            
803500*                    VIAMENTE ENTRE SEGURIDAD  INFORMATICA  Y  EL*            
803600*                    DESARROLLADOR DE LA APLICACION.             *            
803700*   WS-S041-MONEDA : CLAVE  DE  LA  MONEDA  CORRESPONDIENTE  ( DE*            
803800*                    ACUERDO A CATALOGO DE MONEDAS) EN  QUE  ESTA*            
803900*                    ESPECIFICADO EL IMPORTE.                    *            
804000*   WS-S041-IMPORTE: PARA TRANSACCIONES MONETARIA :              *            
804100*                         <> MONTO REAL DE LA TRANSACCION        *            
804200*                    PARA TRANSACCIONES NO MONETARIAS            *            
804300*                         <> CERO                                *            
804400*                                                                *            
804500* DATOS DE SALIDA  :                                             *            
804600*   NOMINA-OPE     : NUMERO DE NOMINA DEL OPERADOR FIRMADO EN  LA*            
804700*                    TERMINAL DESDE DONDE SE GENERO  LA  TRANSAC-*            
804800*                    CION.                                       *            
804900*   WS-S041-NOMINA-FUN1 Y WS-S041-NOMINA-FUN2                    *            
805000*                  : SI LA OPERACION  SE  REALIZO  FUERA  DE  LAS*            
805100*                    FACULTADES DEL OPERADOR, CON FIRMA  MANCOMU-*            
805200*                    NADA : INDICA EL NUMERO  DE  NOMINA  DE  LOS*            
805300*                    FUNCIONARIOS QUE MANCOMUNARON.              *            
805400*   WS-S041-RESULTADO : NUMERO DE RESULTADO DEL LLAMADO.         *            
805500*                                                                *            
805600*     0   TRANSACCION ACEPTADA                                   *            
805700*     1   TRANSACCION ACEPTADA CON MANCOMUNACION                 *            
805800*    -2   NIVEL DE FACULTADES QUE TIENE EL OPERADOR NO ES        *            
805900*         SUFICIENTE                                             *            
806000*    -3   EL OPERADOR NO TIENE CALIFICADO EL MODULO EN SEGURIDAD *            
806100*    -4   ESTA TRANSACCION REQUIERE QUE EXISTA UNA FIRMA         *            
806200*         MANCOMUNADA                                            *            
806300*    -5   ESTA TRANSACCION NO SE PERMITE HACER EN ESTA OFICINA   *            
806400*    -6   PROBLEMAS CON LA LIBRERIA DE SEGURIDAD EN EL MODULO DE *            
806500*         VALIDACION DE FACULTADES.                              *            
806600*    -7   LA ESTACION QUE PASO LA APLICACION NO ESTA FIRMADA     *            
806700*    -8   OFICINA NO INTEGRADA EN SEGURIDAD                      *            
806800*    -9   SEGURIDAD EN PROCESO DE INICIALIZACION                 *            
806900*    -10  LOS PARAMETROS QUE ENVIO LA APLICACION ESTAN ERRONEOS  *            
807000*    -11  NO EXISTE REGISTRO PARA ESTA TRANSACCION               *            
807100*                                                                *            
807200*                                                                *            
807300******************************************************************            
807400                                                                              
807500************* INPUT DATA                                                      
807600 01 WS-S041-INPUT.                                                            
807700    03 WS-S041-LSN                PIC 9(08).                                  
807800    03 WS-S041-STANAME            PIC X(08).                                  
807900    03 WS-S041-SISTEMA            PIC X(04).                                  
808000    03 WS-S041-CVETRAN            PIC X(12).                                  
808100    03 WS-S041-MONEDA             PIC 9(02).                                  
808200    03 WS-S041-FILLER             PIC X(27).                                  
808300 77 WS-S041-IMPORTE               PIC S9(23) BINARY.                          
808400                                                                              
808500************* OUTPUT DATA                                                     
808600 77 WS-S041-RESULTADO             PIC S9(11) BINARY.                          
808700*** ARREGLO DE TRABAJO PARA LIB, ADEMAS SE ENVIAN CAMPOS DE SALIDA            
808800 01 WS-S041-ARRAY1                REAL.                                       
808900    03 WS-S041-ELEMENTO1          REAL OCCURS 320 TIMES.                      
809000 01 WS-S041-ARRAY2                REAL.                                       
809100    03 WS-S041-ELEMENTO2          REAL OCCURS 320 TIMES.                      
809200    03 WS-S041-ELEMENTO2-R REDEFINES WS-S041-ELEMENTO2.                       
809300       05 WS-S041-NOMINA-OPE      REAL.                                       
809400       05 WS-S041-NOMINA-FUN1     REAL.                                       
809500       05 WS-S041-NOMINA-FUN2     REAL.                                       
809600       05 WS-S041-FILLER2         REAL OCCURS 317 TIMES.                      
809700                                                                              
809800******* VARIABLES DE APOYO PARA SEGURIDAD                                     
809900 77 WS-S041-LSN-INPUT             PIC S9(11) BINARY.                          
810000 01 WS-S041-SEGURIDAD-VA          PIC 9.                                      
810100    88 WS-88-S041-SEGURIDAD-ON    VALUE 1.                                    
810200    88 WS-88-S041-SEGURIDAD-OFF   VALUE 0.                                    
810300 01 WS-SEGURIDAD-VARS.                                                        
810400    02 WS-CLAVE-SEGURIDAD         PIC X(12).                                  
810500    02 WS-CLAVE-SEGURIDAD-R REDEFINES WS-CLAVE-SEGURIDAD.                     
810600       03 WS-CS-PREF              PIC X(02).                                  
810700       03 WS-CS-PANT              PIC X(05).                                  
810800       03 WS-CS-PANT-R REDEFINES WS-CS-PANT.                                  
810900          04 WS-PANT-500          PIC 9(03).                                  
811000          04 WS-PANT-NUM          PIC 9(02).                                  
811100             88 WS-88-PANT-SIN-MDA   VALUE 48,61 THRU 65,                     
811200                                           85,87,88,90 THRU 98.               
811300       03 WS-CS-RESTO             PIC X(05).                                  
811400    02 WS-CVESEG-OPC              PIC X(01).                                  
811500    02 WS-CVESEG-OPC2             PIC X(01).                                  
811600    02 WS-CVESEG-PANT             PIC X(05).                                  
811700    02 WS-CVESEG-CLAVE            PIC 9(04).                                  
811800                                                                              
811900                                                                              
812000$POP OMIT                                                                     
812100$SET OMIT = NOT TRACES041R01                                                  
812200 01 WKSS-S041.                                                                
812300    02 WKSS-S041-LSN              PIC 9(08).                                  
812400    02 WKSS-S041-STANAME          PIC X(08).                                  
812500    02 WKSS-S041-SISTEMA          PIC X(04).                                  
812600    02 WKSS-S041-CVETRAN          PIC X(12).                                  
812700    02 WKSS-S041-MONEDA           PIC 9(02).                                  
812800    02 WKSS-S041-IMPORTE          PIC S9(14)V99.                              
812900    02 WKSS-S041-CAMPOS OCCURS 2 TIMES.                                       
813000       03 WKSS-S041-CAMPO1        PIC 9(10).                                  
813100       03 WKSS-S041-CAMPO2        PIC 9(10).                                  
813200       03 WKSS-S041-CAMPO3        PIC 9(10).                                  
813300    02 WKSS-S041-RESULTADO        PIC S9(10).                                 
813400    02 WKSS-S041-RES-SIGNO        PIC X.                                      
813500    02 WKSS-S041-RES-NUMERO       PIC 9(02).                                  
813600$POP OMIT                                                                     
813700                                                                              
813800$SET OMIT = NOT S080CATDESC                                                   
813900******************************************************************            
814000*             LIBRERIA: S080BD01CON                              *            
814100*                                                                *            
814200* ENTRY_POINT : L700_CONSUL_DESC                                 *            
814300* TIPO        :                                                  *            
814400* DESCRIPCION : CONSULTA DE CATALOGOS DESCRIPTIVOS DEL S080      *            
814500*                                                                *            
814600*                                                                *            
814700*                                                                *            
814800******************************************************************            
814900 01 WKS-VARIABLES-CATDESC.                                                    
815000    02 WKS-CD-REGS-EN-CATALOGO-VA         PIC 9(02) COMP.                     
815100       88 WKS-NOMAS-REGS-EN-CATALOGO      VALUE 1.                            
815200    02 WKS-CD-PRIMER-CONSULTA-VA          PIC 9(02) COMP.                     
815300       88 WKS-ES-PRIMER-CONSULTA          VALUE 0.                            
815400    02 WKS-CD-REGS-EN-CAT                 PIC 9(04) COMP.                     
815500    02 WKS-CD-REG-IND                     PIC 9(04) BINARY.                   
815600    02 WKS-CD-RESULT-FMT                  PIC 9(04).                          
815700    02 WKS-CD-FEC-ALTA-FMT                PIC 9(06).                          
815800    02 WKS-CD-FEC-BAJA-FMT                PIC 9(06).                          
815900    02 WKS-CD-FEC-ULTMOD-FMT              PIC 9(06).                          
816000    02 WKS-CDL700-SISTEMA                 PIC 9(04).                          
816100    02 WKS-CDL700-PROGRAMA                PIC 9(04).                          
816200    02 WKS-CDL700-CATALOGO                PIC 9(06).                          
816300       88 WKS-CDL700-LYECTAOBS-CAT        VALUE 1095.                         
816400       88 WKS-CDL700-NOMBREBCOS-CAT       VALUE 168.                          
816500    02 WKS-CDL700-FEC-CONSULTA            PIC 9(08).                          
816600    02 WKS-CDL700-CVE-CONSULTA            PIC 9(02).                          
816700    02 WKS-CDL700-ORDEN-BUSCA             PIC 9(02).                          
816800    02 WKS-CDL700-NIVEL-INI               PIC 9(04).                          
816900    02 WKS-CDL700-CVE-REG                 PIC X(12).                          
817000    02 WKS-CDL700-CVE-REG-ASO             PIC X(12).                          
817100$POP OMIT                                                                     
817200                                                                              
817300$SET OMIT = NOT S080CATDESC                                                   
817400 77 WS-S080-CDL700-SISTEMA-I              PIC S9(11) BINARY.                  
817500 77 WS-S080-CDL700-NUMPROG-I              PIC S9(11) BINARY.                  
817600 01 WS-S080-CDL700-PARAMETRO-ENT.                                             
817700    02 WS-S080-CDL700-CATALOGO-I          PIC 9(06) COMP.                     
817800    02 WS-S080-CDL700-CLAVE-CONS-I        PIC 9(02) COMP.                     
817900    02 WS-S080-CDL700-ORDEN-BUSCA-I       PIC 9(02) COMP.                     
818000    02 WS-S080-CDL700-NUM-REGS-I          PIC 9(02) COMP.                     
818100    02 WS-S080-CDL700-CVE-REG-I           PIC X(12).                          
818200    02 WS-S080-CDL700-CVE-REG-ASO-I       PIC X(12).                          
818300    02 WS-S080-CDL700-NIVEL-INI-I         PIC 9(02) COMP.                     
818400    02 WS-S080-CDL700-FEC-INI-CONS-I      PIC 9(06) COMP.                     
818500    02 FILLER                             PIC X(14).                          
818600                                                                              
818700 77 WS-S080-CDL700-RESULT                 PIC S9(11) BINARY.                  
818800 01 WS-S080-CDL700-PARAMETRO-SAL.                                             
818900    02 WS-S080-CDL700-NUM-REGS-S          PIC 9(02) COMP.                     
819000    02 WS-S080-CDL700-CATALOGO-S          PIC 9(06) COMP.                     
819100    02 WS-S080-CDL700-FEC-INI-CONS-S      PIC 9(06) COMP.                     
819200    02 WS-S080-CDL700-NIVEL-INI-S         PIC 9(02) COMP.                     
819300    02 WS-S080-CDL700-REGISTROS-S OCCURS 1 TO 10                              
819400                      DEPENDING ON WS-S080-CDL700-NUM-REGS-S.                 
819500       03 WS-S080-CDL700-CVE-REG-S        PIC X(12).                          
819600       03 WS-S080-CDL700-CVE-REG-ASO-S    PIC X(12).                          
819700       03 WS-S080-CDL700-TXT-LARGO-S      PIC X(40).                          
819800       03 WS-S080-CDL700-TXT-CORTO-S      PIC X(20).                          
819900       03 WS-S080-CDL700-TXT-PANTALLA-S   PIC X(12).                          
820000       03 WS-S080-CDL700-TXT-ABRV-S       PIC X(05).                          
820100       03 WS-S080-CDL700-FEC-ALTA-S       PIC 9(06) COMP.                     
820200       03 WS-S080-CDL700-FEC-BAJA-S       PIC 9(06) COMP.                     
820300       03 WS-S080-CDL700-FEC-ULTMOD-S     PIC 9(06) COMP.                     
820400       03 FILLER                          PIC X(10).                          
820500$POP OMIT                                                                     
820600                                                                              
820700$SET OMIT = NOT S8BANCOS                                                      
820800******************************************************************            
820900*    VARIABLES PARA CARGAR EL CATALOGO DESCRIPTIVO DE BANCOS     *            
821000*    CON SU NUMERO Y SU NOMBRE.                                  *            
821100*                                                                *            
821200******************************************************************            
821300 01 WKS-VARIABLES-BANCOS.                                                     
821400    02 WKS-EXISTE-BANCO-VA                PIC 9(02) COMP.                     
821500       88 WKS-EXISTE-BANCO                VALUE 1.                            
821600    02 WKS-BCO-IND                        PIC 9(04) BINARY.                   
821700    02 WKS-NUM-BCO                        PIC 9(08) COMP.                     
821800                                                                              
821900 01 WKS-BANCOS-TABLA.                                                         
822000    02 WKS-BANCOS-TBL OCCURS 120 TIMES.                                       
822100       03 WKS-BCO-CLAVE                   PIC 9(08) COMP.                     
822200       03 WKS-BCO-NOMBRE                  PIC X(40).                          
822300$POP OMIT                                                                     
822400$SET OMIT = NOT S080CTAOBSLEY                                                 
822500******************************************************************            
822600*    VARIABLES PARA CARGAR EL CATALOGO DESCRIPTIVO DE LEYENDAS   *            
822700*    DE LAS CUENTAS EN OBSERVACION EN EL S127                    *            
822800*                                                                *            
822900******************************************************************            
823000 01 WKS-VARIABLES-CTAOBSLEY.                                                  
823100    02 WKS-CTAOBS-IND                     PIC 9(04) BINARY.                   
823200                                                                              
823300 01 WKS-LEYENDAS-CTAOBS-TABLA.                                                
823400    02 WKS-LEYCTAOBS-TBL OCCURS 10 TIMES.                                     
823500       03 WKS-CTAOBS-CVE                  PIC 9(04) COMP.                     
823600       03 WKS-CTAOBS-IND-PANT             PIC 9(04) BINARY.                   
823700       03 WKS-CTAOBS-LEYENDA              PIC X(20).                          
823800                                                                              
823900$POP OMIT                                                                     
824000$SET OMIT = NOT S000LIBLJ                                                     
824100*****************************************************************             
824200**   Tipos de displays segun el campo W77-TIPO-DISP             *             
824300**   "I" = a pantalla y Log  no acumula mensajes                *             
824400**   "O" = a pantalla y Log  no acumula mensajes  se va a STOP  *             
824500**   "E" = solo a log        si acumula mensajes                *             
824600**   "X" = solo a log        si acumula mensajes                *             
824700**   "X" puede ser cualquier otro valor incluso espacio         *             
824800**   por default tiene "E" para enviar solo a log               *             
824900*****************************************************************             
825000 77 W77-TIPO-DISP     PIC X     VALUE "E".                                    
825100 77 CONTADOR-LJ       PIC 9(11) BINARY VALUE 0.                               
825200 01 MENSAJE-LJ.                                                               
825300    02 SISTEMA-LJ     PIC X(04).                                              
825400    02 FILLER         PIC X VALUE "/".                                        
825500    02 PASO-LJ        PIC X(04).                                              
825600    02 FILLER         PIC X VALUE "/".                                        
825700    02 MTP-LJ         PIC 9(03).                                              
825800    02 FILLER         PIC X VALUE ":".                                        
825900    02 TIPO-LJ        PIC X.                                                  
826000    02 FILLER         PIC X VALUE ">".                                        
826100    02 CODIGO-LJ      PIC 9(06).                                              
826200    02 FILLER         PIC X VALUE "<".                                        
826300    02 TEXTO-LJ       PIC X(200).                                             
826400$POP OMIT                                                                     
826500                                                                              
826505$SET OMIT = NOT VALIMP                                                        
826510*-----------------------------------------------------------------            
826515 77 WS-VALIMP-RESULT           PIC 9(02).                                     
826520 01 WS-VALIMP-IN.                                                             
826525    02 WS-VALIMP-IN-T          PIC X(01) OCCURS 24 TIMES.                     
826530 77 WS-VALIMP-IN-I             PIC 9(02).                                     
826535 01 WS-VALIMP-IN-X             PIC X(01).                                     
826540    88 WS88-VALIMP-IN-X-ESPACIO    VA " ".                                    
826545    88 WS88-VALIMP-IN-X-NUMERO     VA "0","1","2","3","4",                    
826550                                      "5","6","7","8","9".                    
826555    88 WS88-VALIMP-IN-X-PUNTO      VA ".".                                    
826560    88 WS88-VALIMP-IN-X-COMA       VA ",".                                    
826565 01 WS-VALIMP-IN-9             REDEFINES WS-VALIMP-IN-X                       
826570                               PIC X(01).                                     
826575 01 WS-VALIMP-IN-A             PIC X(01).                                     
826580    88 WS88-VALIMP-IN-A-ESPACIO    VA " ".                                    
826585    88 WS88-VALIMP-IN-A-NUMERO     VA "0","1","2","3","4",                    
826590                                      "5","6","7","8","9".                    
826595    88 WS88-VALIMP-IN-A-PUNTO      VA ".".                                    
826600    88 WS88-VALIMP-IN-A-COMA       VA ",".                                    
826605 01 WS-VALIMP-OUT              PIC 9(16)V9(02).                               
826610 01 WS-VALIMP-OUT-R            REDEFINES WS-VALIMP-OUT.                       
826615    02 WS-VALIMP-OUT-E         PIC 9(01) OCCURS 16.                           
826620    02 WS-VALIMP-OUT-D         PIC 9(01) OCCURS 02.                           
826625 77 WS-VALIMP-E-N              PIC 9(02).                                     
826630 77 WS-VALIMP-E-I              PIC 9(02).                                     
826635 77 WS-VALIMP-D-I              PIC 9(02).                                     
826640 77 WS-VALIMP-AREA             PIC 9(01).                                     
826645 77 WS-VALIMP-PUNTO            PIC 9(01).                                     
826650 77 WS-VALIMP-COMA             PIC 9(01).                                     
826655$POP OMIT                                                                     
826700                                                                              
826800                                                                              
826900                                                                              
827000                                                                              
827100                                                                              
827200                                                                              
827300                                                                              
827400$SET OMIT = NOT LIBMAPLI                                                      
827500*****************************************************************             
827600**********  CAMPOS PARA LIBRERIA MAPLI  *************************             
827700*****************************************************************             
827800 77  W77-ID-ERR-LIB-MAPLI        PIC 9(02)   VALUE 0.                         
827900 77  W77-ID-PGM-MAPLI            PIC 9(04)   VALUE 0.                         
828000 77  W77-ID-NUM-COPIA-MAPLI      PIC 9(02)   VALUE 0.                         
828100 77  W77-ID-TPODSP-INFO-MAPLI    PIC 9(02)   VALUE 0.                         
828200 77  W77-ID-ESINI-GRUPO-MAPLI    PIC 9(02)   VALUE 0.                         
828300 77  W77-ID-NUM-GRUPO-MAPLI      PIC 9(02)   VALUE 0.                         
828400 77  W77-ID-ACTXX-MAPLI          PIC 9(04)   VALUE 0.                         
828500 77  W77-ID-ENACT-MAPLI          PIC 9(04)   VALUE 0.                         
828600 77  W77-ID-NOMB-LIB             PIC X(40).                                   
828700 77  W77-ID-TXTA-LIB             PIC X(40).                                   
828800 77  W77-ID-NUMREG-PROC          PIC 9(08)   VALUE 0.                         
828900 77  W77-ID-NUMDSET-MAPLI        PIC 9(02)   VALUE 0.                         
829000 77  W77-ID-NUMBASE-MAPLI        PIC 9(02)   VALUE 0.                         
829100                                                                              
829200 01  WKS-TB-NUMACT-LIBS.                                                      
829300     02 WKS-NUMACT-LIB           PIC 9(04)  OCCURS 500 TIMES.                 
829400                                                                              
829500 01  WKS-TAB-ID-BASES.                                                        
829600     02 WKS-ID-BASE-01  PIC X(40) VALUE                                       
829700                     "(S500)S500BD01CAPTACION ON CAPTACION.   ".              
829800     02 WKS-ID-BASE-02  PIC X(40) VALUE                                       
829900                     "(S500)S500BD02AUXILIAR ON CAPTACION.    ".              
830000     02 WKS-ID-BASE-03  PIC X(40) VALUE                                       
830100                     "(S500)S500BD03MSGAAPLI ON CAPTACION.    ".              
830200     02 WKS-ID-BASE-04  PIC X(40) VALUE                                       
830300                     "(S500)S500BD04TARJETAS ON CAPTACION.    ".              
830400 01  RD-WKS-TAB-ID-BASES REDEFINES WKS-TAB-ID-BASES.                          
830500     02 WKS-ID-BASE-MAPLI PIC X(40) OCCURS 4 TIMES.                           
830600                                                                              
830700****************************************************************              
830800 01  WKS-TAB-ID-DATASET.                                                      
830900     02 DATASET-01     PIC X(17) VALUE "S500B01CONTROL   ".                   
831000     02 DATASET-02     PIC X(17) VALUE "S500B02CONTROL   ".                   
831100     02 DATASET-03     PIC X(17) VALUE "S500B03CONTRATOS ".                   
831200     02 DATASET-04     PIC X(17) VALUE "S500B04MOVIMIENTO".                   
831300     02 DATASET-05     PIC X(17) VALUE "S500B05INSTRUMEN ".                   
831400     02 DATASET-06     PIC X(17) VALUE "S500B06HISTORICO ".                   
831500     02 DATASET-07     PIC X(17) VALUE "S500B07MOVDIA    ".                   
831600     02 DATASET-08     PIC X(17) VALUE "S500B08DEVOLUCION".                   
831700     02 DATASET-09     PIC X(17) VALUE "S500B09CIFRAS    ".                   
831800     02 DATASET-10     PIC X(17) VALUE "S500B10DIALOGO   ".                   
831900     02 DATASET-11     PIC X(17) VALUE "S500B11FVALOR    ".                   
832000     02 DATASET-12     PIC X(17) VALUE "S500B12COMPEN    ".                   
832100     02 DATASET-13     PIC X(17) VALUE "S500B13MOVCVES   ".                   
832200     02 DATASET-14     PIC X(17) VALUE "S500B14TOTCVES   ".                   
832300     02 DATASET-15     PIC X(17) VALUE "S500B15ARCHIVO   ".                   
832400     02 DATASET-16     PIC X(17) VALUE "S500B16TABLAS    ".                   
832500     02 DATASET-17     PIC X(17) VALUE "S500B17CVESXFUN  ".                   
832600     02 DATASET-18     PIC X(17) VALUE "S500B18CVESXINST ".                   
832700     02 DATASET-19     PIC X(17) VALUE "S500B19CANCELA   ".                   
832800     02 DATASET-20     PIC X(17) VALUE "S500B20DEVMENSUAL".                   
832900     02 DATASET-21     PIC X(17) VALUE "S500B21INTERBANC ".                   
833000     02 DATASET-22     PIC X(17) VALUE "S500B22ESQCONT   ".                   
833100     02 DATASET-23     PIC X(17) VALUE "S500B23MODULOS   ".                   
833200     02 DATASET-24     PIC X(17) VALUE "S500B24PAGOSPEND ".                   
833300     02 DATASET-25     PIC X(17) VALUE "S500B25PGOSPENDPE".                   
833400     02 DATASET-26     PIC X(17) VALUE "S500B26SDOSBC    ".                   
833500     02 DATASET-27     PIC X(17) VALUE "S500B27MOVSBC    ".                   
833600     02 DATASET-28     PIC X(17) VALUE "S500B28COMICOB   ".                   
833700     02 DATASET-29     PIC X(17) VALUE "S500B29COMICOB   ".                   
833800     02 DATASET-30     PIC X(17) VALUE "S500B30COMICOB   ".                   
833900     02 DATASET-31     PIC X(17) VALUE "S500B31COMICOB   ".                   
834000     02 DATASET-32     PIC X(17) VALUE "S500B32COMICOB   ".                   
834100     02 DATASET-33     PIC X(17) VALUE "S500B33COMICOB   ".                   
834200     02 DATASET-34     PIC X(17) VALUE "S500B34COMICOB   ".                   
834300     02 DATASET-35     PIC X(17) VALUE "S500B35NUMTEF    ".                   
834400     02 DATASET-36     PIC X(17) VALUE "S500B36GRUPOCOM  ".                   
834500     02 DATASET-37     PIC X(17) VALUE "S500B37GRUPOCPE  ".                   
834600     02 DATASET-38     PIC X(17) VALUE "S500B38SUBGPOS   ".                   
834700     02 DATASET-39     PIC X(17) VALUE "S500B39CTASCPE   ".                   
834800     02 DATASET-40     PIC X(17) VALUE "S500B40BINGPOPREP".                   
834900     02 DATASET-41     PIC X(17) VALUE "S500B41BIN       ".                   
835000     02 DATASET-42     PIC X(17) VALUE "S500B42GPO       ".                   
835100     02 DATASET-43     PIC X(17) VALUE "S500B43NUMGPOSOC ".                   
835200     02 DATASET-44     PIC X(17) VALUE "S500B44CTOSEVOL  ".                   
835300     02 DATASET-45     PIC X(17) VALUE "S500B45GPOSOCREND".                   
835400     02 DATASET-46     PIC X(17) VALUE "S500B46DIALOGO   ".                   
835500     02 DATASET-47     PIC X(17) VALUE "S500B47MOVDIA    ".                   
835600     02 DATASET-48     PIC X(17) VALUE "S500B48CTOSGCE   ".                   
835700     02 DATASET-49     PIC X(17) VALUE "S500B49COMPENDEPP".                   
835800     02 DATASET-50     PIC X(17) VALUE "S500B50LIGASTESO ".                   
835810     02 DATASET-51     PIC X(17) VALUE "S500B52CTRLDEPRET".                   
835815     02 DATASET-52     PIC X(17) VALUE "                 ".                   
835820     02 DATASET-53     PIC X(17) VALUE "                 ".                   
835825     02 DATASET-54     PIC X(17) VALUE "                 ".                   
835830     02 DATASET-55     PIC X(17) VALUE "                 ".                   
835900                                                                              
836000 01  R-WKS-TAB-ID-DATASET REDEFINES WKS-TAB-ID-DATASET.                       
836100     02 WKS-ID-DSET01-MAPLI PIC X(17) OCCURS 55 TIMES.                        
836200                                                                              
836300************************************************************                  
836400 01  WKS-TAB-ID-DSET-02.                                                      
836500     02 DSETB02-01     PIC X(17) VALUE "S500B01ACONTROL  ".                   
836600     02 DSETB02-02     PIC X(17) VALUE "S500B02ACONTROL  ".                   
836700     02 DSETB02-03     PIC X(17) VALUE "S500B03AUXCTOS   ".                   
836800     02 DSETB02-04     PIC X(17) VALUE "S500B04AUXMOVTOS ".                   
836900     02 DSETB02-05     PIC X(17) VALUE "                 ".                   
837000     02 DSETB02-06     PIC X(17) VALUE "                 ".                   
837100     02 DSETB02-07     PIC X(17) VALUE "                 ".                   
837200     02 DSETB02-08     PIC X(17) VALUE "                 ".                   
837300     02 DSETB02-09     PIC X(17) VALUE "                 ".                   
837400     02 DSETB02-10     PIC X(17) VALUE "S500B10AUXDIAL   ".                   
837500     02 DSETB02-11     PIC X(17) VALUE "                 ".                   
837600     02 DSETB02-12     PIC X(17) VALUE "                 ".                   
837700     02 DSETB02-13     PIC X(17) VALUE "S500B13AMOVCVES  ".                   
837800     02 DSETB02-14     PIC X(17) VALUE "                 ".                   
837900     02 DSETB02-15     PIC X(17) VALUE "                 ".                   
838000     02 DSETB02-16     PIC X(17) VALUE "                 ".                   
838100     02 DSETB02-17     PIC X(17) VALUE "                 ".                   
838200     02 DSETB02-18     PIC X(17) VALUE "                 ".                   
838300     02 DSETB02-19     PIC X(17) VALUE "                 ".                   
838400     02 DSETB02-20     PIC X(17) VALUE "                 ".                   
838500     02 DSETB02-21     PIC X(17) VALUE "S500B21AUXINTBCO ".                   
838600     02 DSETB02-22     PIC X(17) VALUE "                 ".                   
838700     02 DSETB02-23     PIC X(17) VALUE "                 ".                   
838800     02 DSETB02-24     PIC X(17) VALUE "                 ".                   
838900     02 DSETB02-25     PIC X(17) VALUE "                 ".                   
839000     02 DSETB02-26     PIC X(17) VALUE "S500B26AUXSDOSBC ".                   
839100     02 DSETB02-27     PIC X(17) VALUE "                 ".                   
839200     02 DSETB02-28     PIC X(17) VALUE "                 ".                   
839300     02 DSETB02-29     PIC X(17) VALUE "                 ".                   
839400     02 DSETB02-30     PIC X(17) VALUE "                 ".                   
839500     02 DSETB02-31     PIC X(17) VALUE "                 ".                   
839600     02 DSETB02-32     PIC X(17) VALUE "                 ".                   
839700     02 DSETB02-33     PIC X(17) VALUE "                 ".                   
839800     02 DSETB02-34     PIC X(17) VALUE "                 ".                   
839900     02 DSETB02-35     PIC X(17) VALUE "                 ".                   
840000     02 DSETB02-36     PIC X(17) VALUE "                 ".                   
840100     02 DSETB02-37     PIC X(17) VALUE "                 ".                   
840200     02 DSETB02-38     PIC X(17) VALUE "                 ".                   
840300     02 DSETB02-39     PIC X(17) VALUE "                 ".                   
840400     02 DSETB02-40     PIC X(17) VALUE "                 ".                   
840500     02 DSETB02-41     PIC X(17) VALUE "                 ".                   
840600     02 DSETB02-42     PIC X(17) VALUE "                 ".                   
840700     02 DSETB02-43     PIC X(17) VALUE "                 ".                   
840800     02 DSETB02-44     PIC X(17) VALUE "                 ".                   
840900     02 DSETB02-45     PIC X(17) VALUE "                 ".                   
841000     02 DSETB02-46     PIC X(17) VALUE "S500B46AUXDIAL   ".                   
841100     02 DSETB02-47     PIC X(17) VALUE "S500B47AUXMOVDIA ".                   
841200     02 DSETB02-48     PIC X(17) VALUE "                 ".                   
841300     02 DSETB02-49     PIC X(17) VALUE "                 ".                   
841400     02 DSETB02-50     PIC X(17) VALUE "                 ".                   
841500                                                                              
841600                                                                              
841700 01  R-WKS-TAB-ID-DSET-02 REDEFINES WKS-TAB-ID-DSET-02.                       
841800     02 WKS-ID-DSET02-MAPLI PIC X(17) OCCURS 50 TIMES.                        
841900                                                                              
842000********************************************************                      
842100 01  WKS-TAB-ID-DSET-03.                                                      
842200     02 DSETB03-01     PIC X(17) VALUE "S500B01MMOVSFM   ".                   
842300     02 DSETB03-02     PIC X(17) VALUE "                 ".                   
842400     02 DSETB03-03     PIC X(17) VALUE "                 ".                   
842500     02 DSETB03-04     PIC X(17) VALUE "                 ".                   
842600     02 DSETB03-05     PIC X(17) VALUE "                 ".                   
842700     02 DSETB03-06     PIC X(17) VALUE "                 ".                   
842800     02 DSETB03-07     PIC X(17) VALUE "                 ".                   
842900     02 DSETB03-08     PIC X(17) VALUE "                 ".                   
843000     02 DSETB03-09     PIC X(17) VALUE "                 ".                   
843100     02 DSETB03-10     PIC X(17) VALUE "                 ".                   
843200     02 DSETB03-11     PIC X(17) VALUE "                 ".                   
843300     02 DSETB03-12     PIC X(17) VALUE "                 ".                   
843400     02 DSETB03-13     PIC X(17) VALUE "                 ".                   
843500     02 DSETB03-14     PIC X(17) VALUE "                 ".                   
843600     02 DSETB03-15     PIC X(17) VALUE "                 ".                   
843700                                                                              
843800 01  R-WKS-TAB-ID-DSET-03 REDEFINES WKS-TAB-ID-DSET-03.                       
843900     02 WKS-ID-DSET03-MAPLI PIC X(17) OCCURS 15 TIMES.                        
844000                                                                              
844100**********************************************************                    
844200 01  WKS-TAB-ID-DSET-04.                                                      
844300     02 DSETB04-01     PIC X(17) VALUE "S500B01PCONTROL  ".                   
844400     02 DSETB04-02     PIC X(17) VALUE "                 ".                   
844500     02 DSETB04-03     PIC X(17) VALUE "S500B03PREALTAS  ".                   
844600     02 DSETB04-04     PIC X(17) VALUE "S500B04PTEF      ".                   
844700     02 DSETB04-05     PIC X(17) VALUE "S500B05PHISCTAGLB".                   
844800     02 DSETB04-06     PIC X(17) VALUE "                 ".                   
844900     02 DSETB04-07     PIC X(17) VALUE "                 ".                   
845000     02 DSETB04-08     PIC X(17) VALUE "S500B08PCTRARRIBO".                   
845100     02 DSETB04-09     PIC X(17) VALUE "S500B09PMOTOR    ".                   
845200     02 DSETB04-10     PIC X(17) VALUE "                 ".                   
845300                                                                              
845400 01  R-WKS-TAB-ID-DSET-04 REDEFINES WKS-TAB-ID-DSET-04.                       
845500     02 WKS-ID-DSET04-MAPLI PIC X(17) OCCURS 10 TIMES.                        
845600                                                                              
845700$POP OMIT                                                                     
845800$SET OMIT = NOT HOSTNAME                                                      
845900******************************************************************            
846000*    VARIABLES PARA OBTENER EL NOMBRE DEL EQUIPO                 *            
846100******************************************************************            
846200 01  WS-DATOS-HOST.                                                           
846300     02 WS-DH-NUM-CSI           PIC  9(002).                                  
846400     02 WS-DH-NOM-EQUIPO        PIC  X(010).                                  
846500        88 WS-DH-HOSTNAME-PBA   VALUE "ACYPBETA. ", "VDMBETA.  ",             
846550                                      "CACYPBET. ", "CVDMBET.  ".             
846600        88 WS-DH-HOSTNAME-SIT   VALUE "SITBETA.  ", "VDMBETA.  ",             
846650                                                    "CVDMBET.  ".             
846700        88 WS-DH-HOSTNAME-UAT   VALUE "MONALFA.  ", "ACYPGAMA. ",             
846800                                      "VDMKAPPA. ", "ACYPOMEGA.",             
846850                                      "CMONALF.  ", "CACYPGAM. ".             
846900        88 WS-DH-HOSTNAME-PROD  VALUE "MONBETA.  ", "VDMALFA.  ",             
846950                                      "CMONBET.  ", "CVDMALF.  ".             
847000        88 WS-DH-HOSTNAME-VDM   VALUE "VDMBETA.  ", "ACYPGAMA. ",             
847100                                      "ACYPOMEGA.", "VDMALFA.  ",             
847120                                      "CVDMBET.  ", "CACYPGAM. ",             
847140                                      "CVDMALF.  ".                           
847200        88 WS-DH-HOSTNAME-MTY   VALUE "ACYPBETA. ", "MONALFA.  ",             
847300                                      "VDMKAPPA. ", "MONBETA.  ",             
847400                                      "SITBETA.  ",                           
847420                                      "CACYPBET. ", "CMONALF.  ",             
847440                                      "CMONBET.  ".                           
847500        88 WS-DH-HOSTNAME-PBA-32 VALUE "VDMBETA.  ","CVDMBET.  ".             
847510        88 WS-DH-HOSTNAME-DAH    VALUE "VDMBETA.  ", "ACYPGAMA. ",            
847520                                       "ACYPOMEGA.", "VDMALFA.  ",            
847530                                       "ACYPBETA. ", "MONALFA.  ",            
847540                                       "VDMKAPPA. ", "MONBETA.  ",            
847550                                       "SITBETA.  ".                          
847560        88 WS-DH-HOSTNAME-CAM     VALUE "CVDMBET.  ","CACYPGAM. ",            
847570                                        "CVDMALF.  ","CMONBET.  ",            
847580                                        "CACYPBET. ","CMONALF.  ".            
847600     02 WS-DH-NOM-CSI           PIC  X(026).                                  
847700     02 WS-DH-LINEA-BATCH       PIC  X(005).                                  
847800                                                                              
847900$POP OMIT                                                                     
848000$SET OMIT = NOT VALHOSTNAME                                                   
848100 01 SW-RUTEA-DESARROLLO    PIC 9(01) VALUE ZEROES.                            
848200 01 SW-RUTEA-S711-VA       PIC 9(01) VALUE ZEROES.                            
848300    88 SW-RUTEA-S711       VALUE 1.                                           
848400$POP OMIT                                                                     
848410                                                                              
848420$SET OMIT = NOT S500L070                                                      
848430 77 WS-S500L070-RESULT     PIC 9(11)   BINARY.                                
848440                                                                              
848450 01 WS-S500L070-INPUT                     WITH LOWER-BOUNDS.                  
848460    03 WS-S500L070-I-SISTEMA     PIC 9(04) COMP.                              
848470    03 WS-S500L070-I-TIP-LLA     PIC 9(01) COMP.                              
848480    03 WS-S500L070-I-TIP-MDA     PIC 9(01) COMP.                              
848490    03 WS-S500L070-I-MDA         PIC 9(12) COMP.                              
848500    03 WS-S500L070-I-PRODUCT     PIC 9(04) COMP.                              
848510    03 WS-S500L070-I-INSTRUM     PIC 9(04) COMP.                              
848520    03 FILLER                    PIC X(47).                                   
848530                                                                              
848540 77 WKS-S500L070-I-SISTEMA       PIC 9(04).                                   
848550 77 WKS-S500L070-I-TIP-LLA       PIC 9(01).                                   
848560 77 WKS-S500L070-I-TIP-MDA       PIC 9(01).                                   
848570 77 WKS-S500L070-I-MDA           PIC 9(12).                                   
848580 77 WKS-S500L070-I-PRODUCT       PIC 9(04).                                   
848590 77 WKS-S500L070-I-INSTRUM       PIC 9(04).                                   
848600                                                                              
848610 01 WS-S500L070-OUTPUT                     WITH LOWER-BOUNDS.                 
848620    03 WS-S500L070-O-SISTEMA     PIC 9(04) COMP.                              
848630    03 WS-S500L070-O-TIP-LLA     PIC 9(01) COMP.                              
848640    03 WS-S500L070-O-TIP-MDA     PIC 9(01) COMP.                              
848650    03 WS-S500L070-O-MDA         PIC 9(12) COMP.                              
848660    03 WS-S500L070-O-SUC-PROM    PIC 9(04) COMP.                              
848670    03 WS-S500L070-O-PROD        PIC 9(04) COMP.                              
848680    03 WS-S500L070-O-INST        PIC 9(04) COMP.                              
848690    03 WS-S500L070-O-MONE        PIC 9(02) COMP.                              
848700    03 WS-S500L070-O-FILLER      PIC 9(01) COMP.                              
848710    03 WS-S500L070-O-CSI         PIC 9(02) COMP.                              
848720    03 WS-S500L070-O-SUC-PRF     PIC 9(04) COMP.                              
848730    03 WS-S500L070-O-CLIENTE     PIC 9(12) COMP.                              
848735    03 WS-S500L070-O-STATUS      PIC 9(02) COMP.                              
848740    03 WS-S500L070-O-FEC-ALTA    PIC 9(08) COMP.                              
848745    03 FILLER                    PIC X(29).                                   
848750$POP OMIT                                                                     
848800                                                                              
