100000*ADMWIN-----------------------------------------------------------            
100100 01 MYSELF-USERCODE.                                                          
100200    02 FILLER                        PC X(01) VA "S".                         
100300    02 MYSELF-USERCOD-999            PC 9(03) VA 500.                         
100400 77 COMS-HDR-CSI                     PC 9(02).                                
100500 77 COMS-AMP-PASSER                  PC 9(02) VA 70.                          
100600 77 COMS-AMP-PASACT                  PC 9(02).                                
100700 01 COMS-MENSAJES.                                                            
100800    02 COMS-MENSAJES-OC              OC 2 TIMES.                              
100900       03 COMS-MENSAJE.                                                       
101000          04 COMS-HDR-PRE            PC X(01).                                
101100          04 COMS-HDR-APLDES         PC X(01).                                
101200          04 COMS-HDR-CSIDES         PC 9(02).                                
101300          04 COMS-HDR-LSN1           PC X(01).                                
101400          04 COMS-HDR-LSNSUB         PC 9(02) COMP.                           
101500          04 FILLER                  PC 9(02) COMP.                           
101600          04 COMS-HDR-LSN2           PC X(01).                                
101700          04 COMS-HDR-STATIP         PC X(01).                                
101800          04 COMS-HDR-STASUC         PC X(04).                                
101900          04 COMS-HDR-STAPRI         PC X(01).                                
102000          04 COMS-HDR-STACAJ         PC X(02).                                
102100          04 COMS-HDR-CSIORI         PC 9(02).                                
102200          04 COMS-HDR-COMORI         PC X(02).                                
102300          04 COMS-HDR-NIVSEG         PC X(02).                                
102400          04 COMS-HDR-APLORI         PC X(01).                                
102500          04 COMS-HDR-RESULT         PC 9(02).                                
102600          04 COMS-HDR-SCREEN         PC X(05).                                
102700          04 COMS-HDR-SEGURIDAD      PC X(06).                                
102800          04 COMS-AMP-DES0           PC 9(01).                                
102900          04 COMS-AMP-DESSIS         PC 9(03).                                
103000          04 COMS-AMP-DESPAS         PC 9(02).                                
103100          04 COMS-AMP-ORI0           PC 9(01).                                
103200          04 COMS-AMP-ORISIS         PC 9(03).                                
103300          04 COMS-AMP-ORIPAS         PC 9(02).                                
103400          04 COMS-SA0-DESAPL         PC 9(04).                                
103500          04 COMS-SA0-DESCOD         PC 9(02).                                
103600          04 COMS-SA0-DESSUB         PC 9(03).                                
103700          04 COMS-SA0-ORIAPL         PC 9(04).                                
103800          04 COMS-SA0-ORICOD         PC 9(02).                                
103900          04 COMS-SA0-ORISUB         PC 9(03).                                
104000          04 COMS-SA0-DIRECCION      PC 9(01).                                
104100          04 COMS-SA0-LONG           PC 9(04).                                
104200          04 COMS-SA0-TIMEOUT        PC 9(05).                                
104300          04 COMS-SA0-CODRES         PC 9(02).                                
104400          04 COMS-SA2-ID             PC 9(03).                                
104500          04 COMS-SA2-VERSION        PC X(01).                                
104600          04 COMS-SA2-CLASE          PC 9(01).                                
104700          04 COMS-SA2-ESTADO         PC 9(01).                                
104800          04 COMS-SA2-MODO           PC 9(01).                                
104900          04 COMS-SA2-SUCURSAL       PC 9(04).                                
105000          04 COMS-SA2-TIPO           PC X(01).                                
105100          04 COMS-SA2-CAJA           PC X(02).                                
105200          04 COMS-SA2-AUTO           PC 9(08).                                
105300          04 COMS-SA2-FECHA          PC 9(06).                                
105400          04 COMS-SA2-HORA           PC 9(06).                                
105500          04 COMS-SA2-MODALIDAD      PC 9(02).                                
105600          04 COMS-SA2-OPERADOR       PC X(10).                                
105700          04 COMS-SA2-VERDAT         PC X(01).                                
105800          04 COMS-APL-DATOS          PC X(2875).                              
105900*-----------------------------------------------------------------            
106000                                                                              
200000*ADMWIN-----------------------------------------------------------            
200100 000-ADMWIN-INICIO.                                                           
200200     IF WS-DH-NOM-EQUIPO = "VDMBETA.  " OR "CVDMBET.  "                       
200300        MOVE 10 TO COMS-HDR-CSI                                               
200400     ELSE                                                                     
200500        MOVE 32 TO COMS-HDR-CSI.                                              
200600 000-ADMWIN-RECEIVE.                                                          
200700     IF COMS-AMP-ORIPAS(1) = COMS-AMP-PASSER                                  
200800        MOVE COMS-MENSAJE(1)       TO COMS-MENSAJE(2)                         
200900        MOVE LOW-VALUES            TO COMS-MENSAJE(1)                         
201000        MOVE COMS-APL-DATOS(2)     TO COMS-MENSAJE(1).                        
201100 000-ADMWIN-SEND.                                                             
201200     IF  COMS-HDR-LSN1(1) = @F0@ AND COMS-HDR-LSN2(1) = @0F@                  
201300     AND COMS-HDR-RESULT(1) = 01 OR 03 OR 07                                  
201400        MOVE COMS-MENSAJE(1)       TO COMS-MENSAJE(2)                         
201500        MOVE LOW-VALUES            TO COMS-MENSAJE(1)                         
201600        MOVE "F"                   TO COMS-HDR-PRE(1)                         
201700        MOVE "0"                   TO COMS-HDR-APLDES(1)                      
201800        MOVE COMS-HDR-CSIORI(2)    TO COMS-HDR-CSIDES(1)                      
201900        MOVE @F0@                  TO COMS-HDR-LSN1(1)                        
202000        MOVE COMS-HDR-LSNSUB(2)    TO COMS-HDR-LSNSUB(1)                      
202100        MOVE @0F@                  TO COMS-HDR-LSN2(1)                        
202200        MOVE COMS-HDR-STATIP(2)    TO COMS-HDR-STATIP(1)                      
202300        MOVE COMS-HDR-STASUC(2)    TO COMS-HDR-STASUC(1)                      
202400        MOVE COMS-HDR-STAPRI(2)    TO COMS-HDR-STAPRI(1)                      
202500        MOVE COMS-HDR-STACAJ(2)    TO COMS-HDR-STACAJ(1)                      
202600        MOVE COMS-HDR-CSI          TO COMS-HDR-CSIORI(1)                      
202700        MOVE "10"                  TO COMS-HDR-COMORI(1)                      
202800        MOVE "00"                  TO COMS-HDR-NIVSEG(1)                      
202900        MOVE "0"                   TO COMS-HDR-APLORI(1)                      
203000        MOVE 02                    TO COMS-HDR-RESULT(1)                      
203100        MOVE "00000"               TO COMS-HDR-SCREEN(1)                      
203200        MOVE "000000"              TO COMS-HDR-SEGURIDAD(1)                   
203300        MOVE 0                     TO COMS-AMP-DES0(1)                        
203400        MOVE 500                   TO COMS-AMP-DESSIS(1)                      
203500        MOVE COMS-AMP-PASSER       TO COMS-AMP-DESPAS(1)                      
203600        MOVE 0                     TO COMS-AMP-ORI0(1)                        
203700        MOVE 500                   TO COMS-AMP-ORISIS(1)                      
203800        MOVE COMS-AMP-PASACT       TO COMS-AMP-ORIPAS(1)                      
203900        MOVE 0500                  TO COMS-SA0-DESAPL(1)                      
204000        MOVE 01                    TO COMS-SA0-DESCOD(1)                      
204100        MOVE 002                   TO COMS-SA0-DESSUB(1)                      
204200        MOVE 0500                  TO COMS-SA0-ORIAPL(1)                      
204300        MOVE 01                    TO COMS-SA0-ORICOD(1)                      
204400        MOVE 002                   TO COMS-SA0-ORISUB(1)                      
204500        MOVE 2                     TO COMS-SA0-DIRECCION(1)                   
204600        ADD  125                   TO COMS-OUT-TEXT-LENGTH                    
204700        MOVE COMS-OUT-TEXT-LENGTH  TO COMS-SA0-LONG(1)                        
204800        MOVE 00090                 TO COMS-SA0-TIMEOUT(1)                     
204900        MOVE 00                    TO COMS-SA0-CODRES(1)                      
205000        MOVE 000                   TO COMS-SA2-ID(1)                          
205100        MOVE "B"                   TO COMS-SA2-VERSION(1)                     
205200        MOVE 0                     TO COMS-SA2-CLASE(1)                       
205300        MOVE 1                     TO COMS-SA2-ESTADO(1)                      
205400        MOVE 1                     TO COMS-SA2-MODO(1)                        
205500        MOVE COMS-HDR-STASUC(2)    TO COMS-SA2-SUCURSAL(1)                    
205600        MOVE COMS-HDR-STAPRI(2)    TO COMS-SA2-TIPO(1)                        
205700        MOVE COMS-HDR-STACAJ(2)    TO COMS-SA2-CAJA(1)                        
205800        MOVE 00000001              TO COMS-SA2-AUTO(1)                        
205900        MOVE 000000                TO COMS-SA2-FECHA(1)                       
206000        MOVE 000000                TO COMS-SA2-HORA(1)                        
206100        MOVE 01                    TO COMS-SA2-MODALIDAD(1)                   
206200        MOVE "0000000000"          TO COMS-SA2-OPERADOR(1)                    
206300        MOVE "B"                   TO COMS-SA2-VERDAT(1)                      
206400        MOVE COMS-MENSAJE(2)       TO COMS-APL-DATOS(1).                      
206500*-----------------------------------------------------------------            
