000200$SET ERRORLIST                                                                
000300$SET LIST STACK LINEINFO MAP FREE ERRORLIMIT=150                              
000400$SET DIALOGO S500L010 S100VERSIONES TITPROGCTLVERS                            
000405$SET S006LOCSUP                                                               
000410$SET SYSTEMLIBCOMS                                                            
000420$SET BDB00R21                                                                 
000430$SET BDB00R01 BDB00R02 BDB00R03                                               
000440$SET BDB02R01 BDB02R02 BDB02R03                                               
000450$SET GENERALSUPPORT CRONOS                                                    
000460$SET S016L422 S016L422R03 S016L422R08 S016L422R09                             
000465$SET S500L040 S500L040R03                                                     
000470*$SET XREF                                                                    
000475$SET HOSTNAME                                                                 
001100******************************************************************            
001200*      I   D   E   N   T   I   F   I   C   A   T   I   O   N     *            
001300******************************************************************            
001400 IDENTIFICATION DIVISION.                                                     
001500 PROGRAM-ID.              DISPERSADOR.                                        
001600 AUTHOR.                  GRUPO DE CAPTACION.                                 
001700 DATE-WRITTEN.            DICIEMBRE 1993  AGOSTO 2002.                        
001800 DATE-COMPILED.                                                               
001900 INSTALLATION.            INGENIERIA DE SISTEMAS                              
002000                          CENTRO DE DESARROLO LEON.                           
002100 SECURITY.                                                                    
002200*                                                                             
002300 ENVIRONMENT DIVISION.                                                        
002400 CONFIGURATION SECTION.                                                       
002500*SOURCE-COMPUTER.         A10.                                                
002600*OBJECT-COMPUTER.         A10.                                                
002700                                                                              
002800 INPUT-OUTPUT SECTION.                                                        
002900 FILE-CONTROL.                                                                
003000* ARCHIVO ESTANDAR PARA DISPERSION DE MOVTOS                                  
003100     SELECT OPTIONAL DISPS087                                                 
003200                     ASSIGN TO DISK                                           
003300                     ORGANIZATION IS SEQUENTIAL                               
003400                     ACCESS MODE IS RANDOM                                    
003500                     ACTUAL KEY IS WS-LLAVE-DISPS087.                         
003600                                                                              
003700     SELECT OPTIONAL DISPS152                                                 
003800                     ASSIGN TO DISK                                           
003900                     ORGANIZATION IS SEQUENTIAL                               
004000                     ACCESS MODE IS RANDOM                                    
004100                     ACTUAL KEY IS WS-LLAVE-DISPS152.                         
004120                                                                              
004140*NOR-INI CONCILIACION EAS-HUB                                                 
004160     SELECT EAS-HUB                                                           
004180              ASSIGN TO    DISK                                               
004200              ORGANIZATION IS SEQUENTIAL                                      
004220              ACCESS MODE  IS RANDOM                                          
004240              ACTUAL KEY   IS WS-LLAVE-EASH.                                  
004260*NOR-FIN                                                                      
004400                                                                              
004410*    ARCHIVO DE SALDOS PENDIENTES                                             
004420     SELECT OPTIONAL SALDOSPEN                                                
004430                     ASSIGN TO DISK                                           
004440                     ORGANIZATION IS SEQUENTIAL                               
004450                     ACCESS MODE IS RANDOM                                    
004460                     ACTUAL KEY IS WS-LLAVE-SALDOSPEN.                        
004470                                                                              
004500* ARCHIVO DEL SISTEMA TARJETA * CAJEROS                       *               
004600     SELECT OPTIONAL MOVTBINT                                                 
004700        ASSIGN       TO DISK                                                  
004800        ORGANIZATION IS SEQUENTIAL                                            
004900        ACCESS MODE  IS RANDOM                                                
005000        ACTUAL KEY   IS WS-LLAVE-TBINT.                                       
005010* ARCHIVO DEL SISTEMA TARJETA * CAJEROS  (SEMANAL)            *               
005020     SELECT OPTIONAL MOVTBINTSEM                                              
005030        ASSIGN       TO DISK                                                  
005050        ACCESS MODE  IS RANDOM                                                
005060        ACTUAL KEY   IS WS-LLAVE-TBINTSEM.                                    
005070* ARCHIVO DE IMPRESORA DE DIFERENCIAS ENTRE TARJETAS Y CLIENTES               
005080     SELECT R-TARJETAS ASSIGN TO PRINTER.                                     
005100* ARCHIVOS SORTEADO Y ORDENADO DEL SISTEMA DE TARJETA/CAJERO  *               
005200     SELECT   SORTEO-CM                                                       
005300              ASSIGN TO SORT DISK.                                            
005400     SELECT ORDENADO-CM                                                       
005500              ASSIGN TO    DISK                                               
005600              ORGANIZATION IS SEQUENTIAL                                      
005700              ACCESS MODE  IS RANDOM                                          
005800              ACTUAL KEY   IS WS-LLAVE-ORDCM.                                 
005820*    SELECT ORDENADO-SP                                                       
005840*             ASSIGN TO    DISK                                               
005860*             ORGANIZATION IS SEQUENTIAL                                      
005880*             ACCESS MODE  IS RANDOM                                          
005900*             ACTUAL KEY   IS WS-LLAVE-ORDSP.                                 
005920*                                                                             
005940     SELECT CTRLARCH                                                          
005960              ASSIGN TO    DISK                                               
005980              ORGANIZATION IS SEQUENTIAL                                      
006000              ACCESS MODE  IS RANDOM                                          
006020              ACTUAL KEY   IS WS-LLAVE-CTRL.                                  
006040                                                                              
006100******************************************************************            
006200*        D   A   T   A         D   I   V   I   S   I   O   N     *            
006300******************************************************************            
006400 DATA DIVISION.                                                               
006500 FILE SECTION.                                                                
006600 FD MOVTBINT                                                                  
006700    VALUE OF DEPENDENTSPECS      TRUE                                         
006800    RECORD CONTAINS    240 CHARACTERS                                         
006900*** VALUE OF TITLE IS W-ETIQ-MOVTBINT                                         
007000    DATA RECORD    IS    REG-MOVTBINT.                                        
007100 01 REG-MOVTBINT         PIC   X(240).                                        
007110*                                                                             
007120 FD MOVTBINTSEM                                                               
007130    VALUE OF DEPENDENTSPECS      TRUE                                         
007140    RECORD CONTAINS    240 CHARACTERS                                         
007150    BLOCK  CONTAINS     30 RECORDS                                            
007160    DATA RECORD    IS    REG-MOVTBINTSEM.                                     
007170 01 REG-MOVTBINTSEM      PIC   X(240).                                        
007200*                                                                             
007210 FD R-TARJETAS                                                                
007220     VALUE OF TITLE IS CARATULA.                                              
007230 01 REG-TARJETAS          PIC X(132).                                         
007300*                                                                             
008100 SD SORTEO-CM                                                                 
008200    BLOCK  CONTAINS 10 RECORDS                                                
008300    RECORD CONTAINS 390 CHARACTERS.                                           
008400 01 REG-SORTEO-CM.                                                            
008500    03 SORTEO-TIPREG           PIC X.                                         
008600    03 SORTEO-CLAVE            PIC 9(04)  COMP.                               
008700    03 SORTEO-FILLER           PIC 9(12)  COMP.                               
008800    03 SORTEO-PRIORIDAD        PIC 9(02)  COMP.                               
008900    03 SORTEOCM-RESTO          PIC X(380).                                    
009000 FD ORDENADO-CM                                                               
009100    BLOCK  CONTAINS 10 RECORDS                                                
009200    RECORD CONTAINS 390 CHARACTERS                                            
009300****VALUE OF TITLE  W-ETIQ-ORDENADO.                                          
009350    DATA RECORD IS REG-ORDENADO.                                              
009400*                                                                             
009500 01 REG-ORDENADO.                                                             
009600    02 REG-ORDENADO-TR                  PIC X.                                
009700*** "1"                                                                       
009800    02 REG-ORDENADO-CTR.                                                      
009900       03 REG-ORDENADO-HEADER           PIC 9(12) COMP.                       
010000       03 REG-ORDENADO-FECHA            PIC 9(08) COMP.                       
010100       03 REG-ORDENADO-NODO             PIC 9(02) COMP.                       
010200       03 REG-ORDENADO-HORA             PIC 9(08) COMP.                       
010300       03 REG-ORDENADO-1ERF-87          PIC 9(08) COMP.                       
010400       03 REG-ORDENADO-1ERF-PE          PIC 9(08) COMP.                       
010500       03 REG-ORDENADO-1ERF-TAR         PIC 9(08) COMP.                       
010550       03 REG-ORDENADO-1ERF-TARSEM      PIC 9(08) COMP.                       
010570       03 REG-ORDENADO-1ERF-EAS         PIC 9(08) COMP.                       
010590       03 REG-ORDENADO-1ERF-EASSEM      PIC 9(08) COMP.                       
010600       03 REG-ORDENADO-1ERF             PIC 9(08) COMP.                       
010700       03 REG-ORDENADO-ULTF-87          PIC 9(08) COMP.                       
010800       03 REG-ORDENADO-ULTF-PE          PIC 9(08) COMP.                       
010900       03 REG-ORDENADO-ULTF-TAR         PIC 9(08) COMP.                       
010950       03 REG-ORDENADO-ULTF-TARSEM      PIC 9(08) COMP.                       
010970       03 REG-ORDENADO-ULTF-EAS         PIC 9(08) COMP.                       
010990       03 REG-ORDENADO-ULTF-EASSEM      PIC 9(08) COMP.                       
011000       03 REG-ORDENADO-ULTF             PIC 9(08) COMP.                       
011100       03 FILLER                        PIC X(318).                           
011200*                                                                             
011300*** "2"                                                                       
011400    02 REG-ORDENADO-TB REDEFINES REG-ORDENADO-CTR.                            
011500       03 ORDENADO-TB-CLAVE              PIC  9(04)    COMP.                  
011600          88 ORD-CVE-P015                VALUE 1,2,10 THRU 16.                
011700          88 ORD-CVE-ELIM                VALUE 534.                           
011800          88 ORD-CVE-ABONOS              VALUE 1000 THRU 1999.                
011900          88 ORD-CVE-ABOAUT              VALUE 3000,3001,3019,                
011910                                               3024.                          
012000          88 ORD-CVE-CARGOS              VALUE 2000 THRU 2999.                
012100          88 ORD-CVE-CGOAUT              VALUE 4000,4009,4053 THRU            
012150                                                    4055.                     
012170          88 ORD-CVE-ISR-CGOAUT          VALUE 4009.                          
012180          88 ORD-CVE-VOUCHER-NAL         VALUE 2139.                          
012200          88 ORD-CVE-AUTORIZ             VALUE 526, 527.                      
012210          88 ORD-CVE-D-COMIS             VALUE 584,585,613,615,               
012215                                               700,701.                       
012300          88 ORD-CVE-FINLINEA            VALUE 008.                           
012400          88 ORD-CVE-PRELINEA            VALUE 009.                           
012500          88 ORD-CVE-FINPRELI            VALUE 010.                           
012600          88 ORD-CVE-RECHAZOS            VALUE 001 THRU 002.                  
012610*         AL MOVER LAS VARIABLES DE DIALOGO EN CLAVES NO CONTABLES            
012620*         PROVENIENTES DEL P015, LOS P010 TIENEN  UN  IF  BOOLEANO            
012630*         POR CLAVE, ASI QUE, CADA QUE SE ENVIA UNA NUEVA CLAVE NO            
012640*         CONTABLE POR EL P015, SE DEBE DE DAR DE ALTA EN ESTE  IF            
012650*         DEL P010 (PA 492790).DE NO HACERLO LA TRANSACCION SE                
012660*         RECHAZA POR EL ERROR 2107 "FALTA TIPO DE MONEDA".                   
012700          88 ORD-CVE-NCONT               VALUE 500 THRU 533,                  
012750                                               535 THRU 999.                  
012800       03 ORDENADO-TB-TIPERROR           PIC  9(02)    COMP.                  
012900          88 ORD-TB-NOENVIADO            VALUE 0.                             
013000          88 ORD-TB-ENVIADO              VALUE 1.                             
013100          88 ORD-TB-CONFOK               VALUE 2.                             
013200          88 ORD-TB-CONFNOK              VALUE 3.                             
013300       03 ORDENADO-TB-NUMERROR           PIC  9(04)    COMP.                  
013400       03 ORDENADO-TB-STAELIM            PIC  9(02)    COMP.                  
013500       03 ORDENADO-TB-NERRORELI          PIC  9(04)    COMP.                  
013600       03 ORDENADO-TB-PRIORIDAD          PIC  9(02)    COMP.                  
013700       03 ORDENADO-TB-NUMCONT            PIC  9(12)    COMP.                  
013800       03 ORDENADO-TB-NUMTB              PIC  9(16)    COMP.                  
013900       03 ORDENADO-TB-NUMTBR   REDEFINES ORDENADO-TB-NUMTB.                   
014000         05 ORDENADO-NUMTB-14           PIC  9(14)    COMP.                   
014100         05 ORDENADO-NUMTB-RESTO        PIC  9(02)    COMP.                   
014200       03 ORDENADO-TB-SUCPROM            PIC  9(04)    COMP.                  
014300       03 ORDENADO-TB-CTACHEQ            PIC  9(08)    COMP.                  
014400       03 ORDENADO-TB-REFDOCTO           PIC  9(10)    COMP.                  
014500       03 ORDENADO-TB-IMPORTE            PIC  9(12)V99 COMP.                  
014600       03 ORDENADO-TB-ORIGEN             PIC  9(02)    COMP.                  
014700       03 ORDENADO-TB-SUCBANCO           PIC  9(04)    COMP.                  
014800       03 ORDENADO-TB-CAJA               PIC  9(04)    COMP.                  
014900       03 ORDENADO-TB-SEQ                PIC  9(04)    COMP.                  
015000       03 ORDENADO-TB-CAUSA              PIC  9(02)    COMP.                  
015100       03 ORDENADO-TB-FECHA              PIC  9(08)    COMP.                  
015200       03 ORDENADO-TB-FECHAR REDEFINES ORDENADO-TB-FECHA.                     
015300          06 ORDENADO-TB-FECMOV-AAAA     PIC  9(04)    COMP.                  
015400          06 ORDENADO-TB-FECMOV-MM       PIC  9(02)    COMP.                  
015500          06 ORDENADO-TB-FECMOV-DD       PIC  9(02)    COMP.                  
015600       03 ORDENADO-TB-NODO               PIC  9(02)    COMP.                  
015700       03 ORDENADO-TB-PRODUCTO           PIC  9(04)    COMP.                  
015800       03 ORDENADO-TB-LEYENDA            PIC  X(40).                          
015900       03 ORDENADO-TB-TIPOELIM           PIC  9(01)    COMP.                  
016000       03 ORDENADO-TB-MOVAELIM           PIC  9(01)    COMP.                  
016100       03 ORDENADO-TB-AUTORIZ            PIC  9(08)    COMP.                  
016200       03 ORDENADO-TB-REFINTNAL          PIC  X(23) .                         
016220       03 ORDENADO-TB-REFINTNAL-N REDEFINES                                   
016240          ORDENADO-TB-REFINTNAL          PIC  9(23).                          
016300       03 ORDENADO-TB-INDLEY             PIC  9(02)    COMP.                  
016400       03 ORDENADO-TB-AUTLOG             PIC  9(08)    COMP.                  
016500       03 ORDENADO-TB-INSTRUM            PIC  9(02)    COMP.                  
016600       03 ORDENADO-TB-MONEDA             PIC  9(02)    COMP.                  
016700       03 ORDENADO-TB-CVETRAN2           PIC  9(04)    COMP.                  
016800       03 ORDENADO-TB-IMPORTE2           PIC  9(10)V99 COMP.                  
016850       03 ORDENADO-TB-CTAMAE-VA          PIC  9(02)    COMP.                  
016855          88 ORD-TB-OTROS-MOVTOS         VALUE 0.                             
016860          88 ORD-TB-CTAMAEMN-EN-MN       VALUE 1.                             
016870          88 ORD-TB-CTAMAEDLS-EN-MN      VALUE 2.                             
016880          88 ORD-TB-CTAMAEDLS-EN-DLS     VALUE 3.                             
016890       03 ORDENADO-TB-SUC-RCHAZO         PIC  9(04)    COMP.                  
016892*INI BSR. MONEDA ORIGEN                                                       
016894       03 ORDENADO-TB-INTCODIGO-MONEDA   PIC  9(04)    COMP.                  
016896       03 ORDENADO-TB-INTIMP-DLLS        PIC  9(08)V99 COMP.                  
016900*      SE INCLUYE EL TIPO DE AUTORIZACION QUE VIENE DE TARJETAS               
016910*      PARA QUE SEA ENVIADO AL PASO P010 MEDIANTE EL FORMATO                  
016920*      VARIABLE "uW".                                                         
016930       03 ORDENADO-TB-TIP-AUT            PIC X(01).                           
016940          88 WS88-ORDENADO-TB-TIP-AUT    VALUE "N", "V", "C", "P".            
016945       03 ORDENADO-TB-ID-NEGOCIO         PIC 9(08) COMP.                      
016947*INI-STEFANINI TIPO DE CAMBIO                                                 
016949       03 ORDENADO-TB-TC-BANXICO         PIC 9(05)V9(06).                     
016951       03 ORDENADO-TB-MARK-UP-EMI        PIC 9(04)V9(04).                     
016953       03 ORDENADO-TB-TC-VALMER          PIC 9(05)V9(06).                     
016955*INI EAS FASE 3                                                               
016960       03 ORDENADO-TB-IMP-AUT            PIC 9(12)V99    COMP.                
016965       03 ORDENADO-TB-ORI-EAS            PIC 9(02)       COMP.                
016970*      03 FILLER                         PIC X(197).                          
016975*FIN EAS FASE 3                                                               
016976*INI EAS FASE 4                                                               
016977       03 ORDENADO-TB-INSTITUCION-ID     PIC  9(04)      COMP.                
016978       03 ORDENADO-TB-INTAPLICACION-ID   PIC  9(04)      COMP.                
016979       03 ORDENADO-TB-INTAUTH-CODE       PIC  X(06)          .                
016980       03 FILLER                         PIC  X(187)         .                
016981*FIN EAS FASE 4                                                               
016982*FIN-STEFANINI TIPO DE CAMBIO                                                 
016985*FIN BSR. MONEDA ORIGEN                                                       
017000*                                                                             
017100*** "3"  RECHAZOS                                                             
017200*** "4"                                                                       
017300 02 REG-ORDENADO-ARCH  REDEFINES REG-ORDENADO-CTR.                            
017400    03 ORDENADO-AR-CLAVE              PIC  9(04)    COMP.                     
017500    03 ORDENADO-AR-TIPERROR           PIC  9(02)    COMP.                     
017600    03 ORDENADO-AR-NUMERROR           PIC  9(04)    COMP.                     
017700    03 ORDENADO-AR-STAELIM            PIC  9(02)    COMP.                     
017800    03 ORDENADO-AR-NERRORELI          PIC  9(04)    COMP.                     
017900    03 ORDENADO-OC  OCCURS 10 TIMES.                                          
018000        08 ORDENADO-AR-SISTEMA        PIC 9(02)     COMP.                     
018100        08 ORDENADO-AR-FECHA          PIC 9(08)     COMP.                     
018200        08 ORDENADO-AR-HHMM           PIC 9(04)     COMP.                     
018300        08 ORDENADO-AR-STATUS         PIC 9(02)     COMP.                     
018400        08 ORDENADO-AR-IMPABOC        PIC 9(12)V99  COMP.                     
018500        08 ORDENADO-AR-IMPCARC        PIC 9(12)V99  COMP.                     
018600        08 ORDENADO-AR-IMPABONC       PIC 9(12)V99  COMP.                     
018700        08 ORDENADO-AR-IMPCARNC       PIC 9(12)V99  COMP.                     
018800    03 ORDENADO-FILLER                PIC X(21).                              
018900*** "5"                                                                       
019000 02 REG-ORDENADO-B02 REDEFINES REG-ORDENADO-CTR.                              
019100       03 ORDENADO-B02-CLAVE          PIC  9(04)    COMP.                     
019200       03 ORDENADO-B02-TIPERROR       PIC  9(02)    COMP.                     
019300       03 ORDENADO-B02-NUMERROR       PIC  9(04)    COMP.                     
019400       03 ORDENADO-B02-STAELIM        PIC  9(02)    COMP.                     
019500       03 ORDENADO-B02-NERRORELI      PIC  9(04)    COMP.                     
019600       03 ORDENADO-B02-OC OCCURS 30 TIMES.                                    
019700          05 ORDENADO-B02-ULT-ARCH    PIC 9(08) COMP.                         
019800       03 FILLER                      PIC X(261).                             
019900*** "9"                                                                       
020000 02 REG-ORDENADO-TRL REDEFINES REG-ORDENADO-CTR.                              
020100       03 REG-ORDENADO-TRAILER          PIC 9(06)    COMP.                    
020200       03 REG-ORDENADO-NUMTRL           PIC 9(08)    COMP.                    
020300       03 REG-ORDENADO-IMPTRL           PIC 9(20)V99 COMP.                    
020400       03 FILLER                        PIC X(371).                           
020403                                                                              
020406*NOR-INI CONCILIACION EAS-HUB                                                 
020409 FD EAS-HUB                                                                   
020412    BLOCK  CONTAINS 60 RECORDS                                                
020415    RECORD CONTAINS 240 CHARACTERS                                            
020418    DATA RECORD IS REG-HUB.                                                   
020421*                                                                             
020424 01 REG-HUB.                                                                  
020427    02 REG-HUB-TR                  PIC 9(02).                                 
020430*** "01"                                                                      
020433    02 REG-HUB-HDR.                                                           
020436       03 REG-HUB-FECHA            PIC 9(08).                                 
020439       03 REG-HUB-SISORI           PIC X(04).                                 
020442       03 REG-HUB-SISDES           PIC X(04).                                 
020445       03 REG-HUB-DESC             PIC X(45).                                 
020448       03 REG-HUB-HDR-SPACES       PIC X(177).                                
020451*** "02"                                                                      
020454    02 REG-HUB-REG REDEFINES REG-HUB-HDR.                                     
020457       03 HUB-TB-SUCPROM           PIC  9(04).                                
020460       03 HUB-TB-NUMCONT           PIC  9(12).                                
020463       03 HUB-TB-NUMTB             PIC  9(16).                                
020466       03 HUB-TB-PRODUCTO          PIC  9(04).                                
020469       03 HUB-TB-INSTRUM           PIC  9(04).                                
020472       03 HUB-TB-CLAVE             PIC  9(04).                                
020475       03 HUB-TB-IMPORTE           PIC  9(12)V99.                             
020478       03 HUB-TB-REFINTNAL         PIC  X(23).                                
020481       03 HUB-TB-REFINTNAL-N REDEFINES                                        
020484          HUB-TB-REFINTNAL         PIC  9(23).                                
020487       03 HUB-TB-CAJA              PIC  9(02).                                
020490       03 HUB-TB-FECHA             PIC  9(08).                                
020493       03 HUB-TB-FECHAR REDEFINES HUB-TB-FECHA.                               
020496          06 HUB-TB-FECMOV-AAAA    PIC  9(04).                                
020499          06 HUB-TB-FECMOV-MM      PIC  9(02).                                
020502          06 HUB-TB-FECMOV-DD      PIC  9(02).                                
020505       03 HUB-TB-NUMERROR          PIC  9(04).                                
020508       03 HUB-TB-CAUSAERR          PIC  X(20).                                
020511       03 HUB-TB-REF3              PIC  X(35).                                
020514       03 HUB-TB-REF3-R REDEFINES HUB-TB-REF3.                                
020517          05 HUB-TB-INTAUTH-CODE   PIC  X(06).                                
020520          05 HUB-SPACES-1          PIC  X(01).                                
020523          05 HUB-TB-NUMTB-REF3     PIC  9(16).                                
020526          05 HUB-SPACES-2          PIC  X(12).                                
020529       03 HUB-TB-REF4              PIC  X(35).                                
020532       03 HUB-TB-REF4-R REDEFINES HUB-TB-REF4.                                
020535          05 HUB-TB-REFINTNAL-REF4 PIC  X(23).                                
020538          05 HUB-SPACES-3          PIC  X(01).                                
020541          05 HUB-TB-INSTITUCION-ID PIC  9(04).                                
020544          05 HUB-DIAG-1            PIC  X(01).                                
020547          05 HUB-TB-INTAPLICACION-ID PIC 9(04).                               
020550          05 HUB-SPACES-4          PIC  X(02).                                
020553       03 REG-HUB-REG-SPACES       PIC  X(53).                                
020556*** "09"                                                                      
020559 02 REG-HUB-TRL REDEFINES REG-HUB-HDR.                                        
020562       03 REG-HUB-REGOK            PIC 9(09).                                 
020565       03 REG-HUB-REGNOOK          PIC 9(09).                                 
020568       03 REG-HUB-TRL-SPACES       PIC X(220).                                
020571*NOR-FIN                                                                      
020574                                                                              
020595 FD DISPS087                                                                  
020600    VALUE OF DEPENDENTSPECS TRUE                                              
020700    RECORD CONTAINS     90 CHARACTERS                                         
020800    VALUE OF TITLE  W-ETIQ-DISPS087.                                          
020900*                                                                             
021000 01 WS-REG-DISPS087.                                                          
021100    02 WS-DISP87-TIPREG          PIC    X.                                    
021200    02 WS-DIS-HEADER.                                                         
021300       03 WS-DISP87-SISORI          PIC 9(04)  COMP.                          
021400       03 WS-DISP87-SISDES          PIC 9(04)  COMP.                          
021500       03 WS-DISP87-FECARC          PIC 9(06)  COMP.                          
021600       03 FILLER                  PIC X(82).                                  
021700    02 WS-DIS-DETALLE REDEFINES WS-DIS-HEADER.                                
021800       03 WS-DISP87-TIPMACC         PIC 9(02) COMP.                           
021900       03 WS-DISP87-CUENTA          PIC 9(16) COMP.                           
022000       03 WS-DISP87-CUENTAR REDEFINES WS-DISP87-CUENTA.                       
022100           04 WS-DISP87-SUCPROM     PIC 9(04) COMP.                           
022200           04 WS-DISP87-CTA         PIC 9(12) COMP.                           
022300           04 WS-DISP87-CTA-R  REDEFINES WS-DISP87-CTA.                       
022400              05 WS-DISP87-CTASUC   PIC 9(05) COMP.                           
022500              05 WS-DISP87-CTACTA   PIC 9(07) COMP.                           
022600       03 WS-DISP87-PRODUCTO        PIC 9(04) COMP.                           
022700       03 WS-DISP87-INSTRUM         PIC 9(02) COMP.                           
022800       03 WS-DISP87-CVETRAN         PIC 9(04) COMP.                           
022900       03 WS-DISP87-REFERENCIA      PIC 9(10) COMP.                           
023000       03 WS-DISP87-CTAORI          PIC 9(12) COMP.                           
023100       03 WS-DISP87-IMPORTE         PIC 9(12)V99 COMP.                        
023200       03 WS-DISP87-INDLEY          PIC 9(02)  COMP.                          
023300       03 WS-DISP87-LEYENDA         PIC X(40).                                
023400       03 WS-DISP87-SUCINI          PIC 9(04) COMP.                           
023500       03 WS-DISP87-CAJAINI         PIC 9(02) COMP.                           
023550       03 WS-DISP87-MONEDA          PIC 9(02) COMP.                           
023600       03 FILLER                    PIC X(12).                                
023700    02 WS-DIS-TRAILER REDEFINES WS-DIS-HEADER.                                
023800       03 WS-DISP87-NUMREG          PIC 9(6) COMP.                            
023900       03 WS-DISP87-IMPTOT          PIC 9(16)V99 COMP.                        
024000       03 FILLER                  PIC X(77).                                  
024100*FD OPERADOS      .                                                           
024200 FD DISPS152                                                                  
024300    VALUE OF DEPENDENTSPECS TRUE                                              
024400    RECORD CONTAINS     90 CHARACTERS                                         
024500    VALUE OF TITLE  W-ETIQ-DISPS152.                                          
024600*                                                                             
024700 01 WS-REG-DISPS152.                                                          
024800    02 WS-DIS152-TIPREG          PIC    X.                                    
024900    02 WS-DIS152-HEADER.                                                      
025000       03 WS-DIS152-SISORI          PIC 9(04)  COMP.                          
025100       03 WS-DIS152-SISDES          PIC 9(04)  COMP.                          
025200       03 WS-DIS152-FECARC          PIC 9(06)  COMP.                          
025300       03 FILLER                  PIC X(82).                                  
025400    02 WS-DIS152-DETALLE REDEFINES WS-DIS152-HEADER.                          
025500       03 WS-DIS152-TIPMACC         PIC 9(02) COMP.                           
025600       03 WS-DIS152-CUENTA          PIC 9(16) COMP.                           
025700       03 WS-DIS152-CUENTAR REDEFINES WS-DIS152-CUENTA.                       
025800           04 WS-DIS152-SUCPROM     PIC 9(04) COMP.                           
025900           04 WS-DIS152-CTA         PIC 9(12) COMP.                           
026000       03 WS-DIS152-PRODUCTO        PIC 9(04) COMP.                           
026100       03 WS-DIS152-INSTRUM         PIC 9(02) COMP.                           
026200       03 WS-DIS152-CVETRAN         PIC 9(04) COMP.                           
026300       03 WS-DIS152-REFERENCIA      PIC 9(10) COMP.                           
026400       03 WS-DIS152-CTAORI          PIC 9(12) COMP.                           
026500       03 WS-DIS152-IMPORTE         PIC 9(12)V99 COMP.                        
026600       03 WS-DIS152-INDLEY          PIC 9(02) COMP.                           
026700       03 WS-DIS152-LEYENDA         PIC X(40).                                
026800       03 WS-DIS152-SUCINI          PIC 9(04) COMP.                           
026900       03 WS-DIS152-CAJAINI         PIC 9(02) COMP.                           
027000       03 WS-DIS152-CVETRAN2        PIC 9(04) COMP.                           
027100       03 WS-DIS152-IMPORTE2        PIC 9(10)V99 COMP.                        
027200       03 FILLER                    PIC X(05).                                
027300    02 WS-DIS152-TRAILER REDEFINES WS-DIS152-HEADER.                          
027400       03 WS-DIS152-NUMREG          PIC 9(6) COMP.                            
027500       03 WS-DIS152-IMPTOT          PIC 9(16)V99 COMP.                        
027600       03 FILLER                  PIC X(77).                                  
027700                                                                              
027702*FD ORDENADO-SP                                                               
027704*   RECORD CONTAINS 390 CHARACTERS                                            
027706*   BLOCK  CONTAINS 10 RECORDS                                                
027708*   VALUE OF TITLE  W-ETIQ-ORDENADO-SP.                                       
027710*                                                                             
027712*01 REG-ORDENADO-SP.                                                          
027714*   02 REG-ORDSP-TIPO-REG                 PIC X.                              
027716*   02 REG-ORD-SP-INFO                    PIC X(389).                         
027718**** "1"                                                                      
027720*   02 REG-ORD-SP-HEADER REDEFINES REG-ORD-SP-INFO.                           
027722*      03 REG-ORDSP-HDR-FECHA             PIC 9(08) COMP.                     
027724*      03 REG-ORDSP-HDR-NODO              PIC 9(02) COMP.                     
027726*      03 REG-ORDSP-HDR-FEC-MAQ           PIC 9(08) COMP.                     
027728*      03 REG-ORDSP-HDR-HRA-MAQ           PIC 9(08) COMP.                     
027730*      03 FILLER                          PIC X(376).                         
027732**** "2"                                                                      
027734*   02 REG-ORD-SP-MOVS REDEFINES REG-ORD-SP-INFO.                             
027736*      03 REG-ORDSP-MOV-CLAVE             PIC 9(04) COMP.                     
027738*      03 REG-ORDSP-MOV-TIPERROR          PIC 9(02) COMP.                     
027740*         88 REG-ORDSPMOV-NOENVIADO       VALUE 0.                            
027742*         88 REG-ORDSPMOV-ENVIADO         VALUE 1.                            
027744*         88 REG-ORDSPMOV-CONFOK          VALUE 2.                            
027746*         88 REG-ORDSPMOV-CONFNOK         VALUE 3.                            
027748*      03 REG-ORDSP-MOV-NUMERROR          PIC 9(04) COMP.                     
027750*      03 REG-ORDSP-MOV-STAELIM           PIC 9(02) COMP.                     
027752*      03 REG-ORDSP-MOV-NERRORELI         PIC 9(04) COMP.                     
027754*      03 REG-ORDSP-MOV-PRIORIDAD         PIC 9(02) COMP.                     
027756*      03 REG-ORDSP-MOV-CONTRATO          PIC 9(12) COMP.                     
027758*      03 REG-ORDSP-MOV-SUCPROM           PIC 9(04) COMP.                     
027760*      03 REG-ORDSP-MOV-IMPORTE           PIC 9(12)V99 COMP.                  
027762*      03 REG-ORDSP-MOV-SUCBANCO          PIC 9(04) COMP.                     
027764*      03 REG-ORDSP-MOV-CAJA              PIC 9(04) COMP.                     
027766*      03 REG-ORDSP-MOV-FECHA             PIC 9(08) COMP.                     
027768*      03 REG-ORDSP-MOV-PRODUCTO          PIC 9(04) COMP.                     
027770*      03 REG-ORDSP-MOV-INSTRUM           PIC 9(02) COMP.                     
027772*      03 REG-ORDSP-MOV-MONEDA            PIC 9(02) COMP.                     
027774*      03 REG-ORDSP-MOV-AUTORIZ           PIC 9(06) COMP.                     
027776*      03 REG-ORDSP-MOV-INDLEY            PIC 9(02) COMP.                     
027778*      03 REG-ORDSP-MOV-LEYENDA           PIC X(33).                          
027780*      03 FILLER                          PIC X(316).                         
027782**** "2"                                                                      
027784*   02 REG-ORD-SP-TRL REDEFINES REG-ORD-SP-INFO.                              
027786*      03 REG-ORDSP-TRL-NUMREG            PIC 9(08) COMP.                     
027788*      03 REG-ORDSP-TRL-IMPTOT            PIC 9(16)V99 COMP.                  
027790*      03 FILLER                          PIC X(376).                         
027792                                                                              
027800 FD SALDOSPEN                                                                 
027802    VALUE OF DEPENDENTSPECS TRUE                                              
027804    RECORD CONTAINS 90 CHARACTERS                                             
027806    BLOCK  CONTAINS 60 RECORDS                                                
027808    VALUE OF TITLE W-ETIQ-SALDOSPEN.                                          
027810                                                                              
027820 01 WS-REG-SALDOSPEN.                                                         
027826    02 WS-REG-SDOPEN-TIP-REG              PIC 9(02).                          
027828       88 WS-REG-SP-TP-HEADER             VALUE 1.                            
027830       88 WS-REG-SP-TP-TRL                VALUE 9.                            
027832       88 WS-REG-SP-TP-MOV                VALUE 2 THRU 8.                     
027834    02 WS-REG-SDOPEN-DATOS                PIC X(88).                          
027836    02 WS-REG-SDOPEN-HEADER REDEFINES WS-REG-SDOPEN-DATOS.                    
027838       03 WS-REG-SP-HDR-FEC               PIC 9(08) COMP.                     
027840       03 WS-REG-SP-HDR-HRA-MAQ           PIC 9(08) COMP.                     
027842       03 WS-REG-SP-HDR-FEC-MAQ           PIC 9(08) COMP.                     
027844       03 WS-REG-SP-HDR-CSI-ORI           PIC 9(02) COMP.                     
027846       03 WS-REG-SP-HDR-CSI-DES           PIC 9(02) COMP.                     
027847       03 WS-REG-SP-HDR-NUMCOPY           PIC 9(02) COMP.                     
027848       03 FILLER                          PIC X(73).                          
027850    02 WS-REG-SDOPEN-MOVTOS REDEFINES WS-REG-SDOPEN-DATOS.                    
027852       03 WS-REG-SP-MOV-MDA               PIC 9(02) COMP.                     
027854       03 WS-REG-SP-MOV-SUCPROM-MDA       PIC 9(04) COMP.                     
027856       03 WS-REG-SP-MOV-CONTRATO          PIC 9(12) COMP.                     
027858       03 WS-REG-SP-MOV-CLAVE             PIC 9(04) COMP.                     
027859*         0638 PASAR SDO. PDTE AL ACTUAL                                      
027860       03 WS-REG-SP-MOV-IMPORTE           PIC 9(12)V99 COMP.                  
027862       03 WS-REG-SP-MOV-PROD              PIC 9(04) COMP.                     
027864       03 WS-REG-SP-MOV-INST              PIC 9(04) COMP.                     
027866       03 WS-REG-SP-MOV-MONEDA            PIC 9(04) COMP.                     
027868       03 WS-REG-SP-MOV-IND-LEY           PIC 9(02) COMP.                     
027870       03 WS-REG-SP-MOV-LEYENDA           PIC X(40).                          
027872       03 FILLER                          PIC X(23).                          
027874    02 WS-REG-SDOPEN-TRL REDEFINES WS-REG-SDOPEN-DATOS.                       
027876       03 WS-REG-SP-TRL-NUM-REGS          PIC 9(08) COMP.                     
027878       03 WS-REG-SP-TRL-IMP               PIC 9(16)V99 COMP.                  
027880       03 FILLER                          PIC X(75).                          
027882                                                                              
027900 FD CTRLARCH                                                                  
027920    BLOCK  CONTAINS 180 RECORDS                                               
027940    RECORD CONTAINS  36 CHARACTERS                                            
027960****VALUE OF TITLE  W-ETIQ-CTRLARCH                                           
027980    DATA RECORD IS REG-CTRL.                                                  
028000*                                                                             
028020 01 REG-CTRL.                                                                 
028040    02 REG-CTRL-TR                      PIC 9(02).                            
028060*** "01"                                                                      
028080    02 REG-CTRL-HDR.                                                          
028100       03 REG-CTRL-SISTEMA              PIC X(04).                            
028120       03 REG-CTRL-PASO-DESTINO         PIC X(04).                            
028140       03 REG-CTRL-FECHA                PIC 9(08).                            
028160       03 REG-CTRL-CSI                  PIC 9(02).                            
028180       03 FILLER                        PIC X(16).                            
028200*                                                                             
028220*** "03"                                                                      
028240    02 REG-CTRL-DET REDEFINES REG-CTRL-HDR.                                   
028260       03 REG-CTRL-LLAVE                 PIC  9(08).                          
028280       03 REG-CTRL-TOT-REG               PIC  9(10).                          
028300       03 REG-CTRL-CAP-MAX               PIC  9(10).                          
028320       03 FILLER                         PIC  X(06).                          
028340                                                                              
028400******************************************************************            
028410*                    DATA BASE SECTION                                        
028420******************************************************************            
028430                                                                              
028440 DATA-BASE SECTION.                                                           
028450 DB S500BD01CAPTACION.                                                        
028460                                                                              
028500******************************************************************            
028600*   W   O   R   K   I   N   G    -    S   T   O   R   A   G   E  *            
028700******************************************************************            
028800 WORKING-STORAGE SECTION.                                                     
028900 COPY "S500/INC/WOR/26MTP001".                                                
029000 COPY "S500/INC/L010/26MTP001" FROM 100 TO 99999.                             
029040     COPY "(S000)S000/UTILITY/DESPLIEGA/FTE/CCW ON PACK.".                    
029045                                                                              
029100 77 WS-MONITOREO                      PIC 9.                                  
029200    88 MON-NOACTIVADO                 VALUE 0.                                
029300    88 MON-ACTIVADO                   VALUE 1.                                
029400 77 WS-END-OF-PROGRAM                 PIC 9.                                  
029410 77 WS-ORDENADO-ULTF-87               PIC 9(08).                              
029420 77 WS-ORDENADO-ULTF-PE               PIC 9(08).                              
029430 77 WS-ORDENADO-ULTF-TAR              PIC 9(08).                              
029500 77 WS-NUM-CTOANT                   PIC 9(12).                                
029600 77 WS-LOCK-CTO                       PIC 9.                                  
029610 77 WS-R422-ERROR-FMT                 PIC 9(10).                              
029620 77 WS-R422-TARJETA                   PIC 9(16).                              
029630 77 WS-R422-CONTRATO                  PIC 9(12).                              
029800 77 WS-87                             PIC 9(02).                              
029900 77 WS-152                            PIC 9(02).                              
030000 77 WS-IND-ERROR                      PIC S9(02).                             
030100 77 WS-IMP-87                         PIC 9(16)V99.                           
030200 77 WS-NUM-87                         PIC 9(08).                              
030300 77 WS-IMP-152                        PIC 9(16)V99.                           
030400 77 WS-NUM-152                        PIC 9(08).                              
030500 77 WS-TAR                            PIC 9(02).                              
030600 77 WS-SORT                           PIC 9(02).                              
030700 77 WS-IND-RECH                       PIC 9(02).                              
030800 77 WS-REG-FISICOS                    PIC 9(08).                              
030900 77 WS-REG-TRAILER                    PIC 9(08).                              
031000 77 WS-IMP-FISICOS                    PIC 9(16)V99.                           
031100 77 WS-IMP-TRAILER                    PIC 9(16)V99.                           
031200 77 WS-GLO-NUMREG                     PIC 9(08).                              
031300 77 WS-GLO-IMPREG                     PIC 9(16)V99.                           
031302*NOR-INI CONCILIACION EAS-HUB                                                 
031304 77 WKS-TB-CLAVE                      PIC 9(04).                              
031306 77 WKS-TB-PRIORIDAD                  PIC 9(02).                              
031308 01 WKS-TB-CAJA-ARCH                  PIC 9(04).                              
031310 01 WKS-TB-CAJA-ARCH-R REDEFINES WKS-TB-CAJA-ARCH.                            
031312    03 WKS-TB-CEROS                   PIC 9(02).                              
031314    03 WKS-TB-CAJA                    PIC 9(02).                              
031316 77 WS-EASHUB-NUMREG-OK               PIC 9(09).                              
031318 77 WS-EASHUB-NUMREG-NOOK             PIC 9(16)V99.                           
031320 77 WS-LLAVE-EASH                     PIC 9(08).                              
031322 77 WKS-HAY-ARCH-ORDCM             PIC 9(01) VA ZEROES.                       
031324                                                                              
031326 77 WKS-TB-TIPERROR                   PIC 9(02).                              
031328 01 WS-WFLP197.                                                               
031330    02 FILLER                         PIC X(11) VA "BEGIN JOB; ".             
031332    02 FILLER                         PIC X(26) VA                            
031334             "JOBSUMMARY=UNCONDITIONAL; ".                                    
031336    02 FILLER                         PIC X(40) VA                            
031338              "FAMILY DISK = CAPTACION OTHERWISE DISK; ".         166460      
031340    02 WS-TIT-LOTE-ACCE               PIC X(30).                              
031342    02 FILLER                         PIC X(06) VA "START ".                  
031344    02 WS-WFLP197-LOTE                PIC X(41) VA SPACES.                    
031346    02 FILLER                         PIC X(01) VA "(".                       
031348    02 FILLER                         PIC X(01) VALUE QUOTES.                 
031350    02 WS-WFLP197-PARAM               PIC X(11).                              
031352    02 FILLER                         PIC X(01) VA " ".                       
031354    02 WS-WFLP197-FECHA               PIC 9(08).                              
031356    02 FILLER                         PIC X(01) VALUE QUOTES.                 
031358    02 FILLER                         PIC X(11) VA "); END JOB.".             
031360 01 WKS-FECHA-MAQ8                    PIC 9(08).                              
031362 01 WKS-FECHA-MAQ8-R   REDEFINES WKS-FECHA-MAQ8.                              
031364    03 WKS-FEC-MAQ-CC                 PIC 9(02).                              
031366    03 WKS-FECHA-MAQ                  PIC 9(06).                              
031368    03 WKS-FECHA-MAQ-R  REDEFINES  WKS-FECHA-MAQ.                             
031370       05 WKS-FEC-MAQ-AA              PIC 9(02).                              
031372       05 WKS-FEC-MAQ-MM              PIC 9(02).                              
031374       05 WKS-FEC-MAQ-DD              PIC 9(02).                              
031379 77 WS-SS-LIBRE                       PIC 9(01).                              
031384 77 WS-SEC                            PIC 9(02).                              
031389 77 WS-DIA-SEM                        PIC 9(01).                              
031394*NOR-FIN                                                                      
031400 77 WS-LLAVE-TBINT                    PIC 9(11) BINARY.                       
031450 77 WS-LLAVE-TBINTSEM                 PIC 9(11) BINARY.                       
031500 77 WS-LLAVE-CHQS                     PIC 9(11) BINARY.                       
031600 77 WS-LLAVE-DISPS087                 PIC 9(11) BINARY.                       
031700 77 WS-LLAVE-DISPS152                 PIC 9(11) BINARY.                       
031800 77 WS-LLAVE-ORDCM                    PIC 9(08).                              
031850*77 WS-LLAVE-ORDSP                    PIC 9(08).                              
031900 77 WS-LLAVE-ORDCM-PTE                PIC 9(08).                              
032000 77 WS-LLAVE-CONF                     PIC 9(08).                              
032100 77 WS-INVKEY-CONF                    PIC 9.                                  
032150 77 WS-LLAVE-SALDOSPEN                PIC 9(08).                              
032160 77 WS-LLAVE-CTRL                     PIC 9(08).                              
032200 77 WS-TB-TIPERROR                    PIC 9(02).                              
032300 77 WS-TB-NUMERROR                    PIC 9(04).                              
032400 77 WS-POINTER                        PIC 9(03).                              
032500 77 WS-FECHA                          PIC 9(06).                              
032600 77 WS-INDLEY                         PIC 9(02).                              
032700 77 WS-LEYENDA                        PIC X(40).                              
032800 77 WS-TIPMEDACC                      PIC 9(02).                              
032900 77 WS-CONTRATO-AUX                   PIC 9(12).                              
033000 77 WS-IMPORTE2                       PIC 9(12)V99.                           
033100 77 WS-CVETRAN2                       PIC 9(04).                              
033110*PARA EL PROYECTO DE IMPORTE DE RENDIMIENTO BRUTO EN ADDENDA, EL              
033120*S500P015 RECIBIRA DEL ARCHIVO DE DISPERSI¿N DEL P330 UNA NUEVA               
033130*CLAVE NO CONTABLE PARA QUE SE DISPERSE AL S500P010                           
033140 77 WS-CVETRAN-NCS152                 PIC 9(04).                              
033150   88 WS-CVE-NCADDENDA               VALUE 0810.                              
033200 01 WS-TARJETA                        PIC 9(16).                              
033300 01 WS-CHEQUES REDEFINES WS-TARJETA.                                          
033400    02 WS-SUCCH                       PIC 9(04).                              
033500    02 WS-CTACH                       PIC 9(12).                              
033600 77 WS-AUTORIZ                        PIC 9(06).                              
033650 77 WS-AUTORIZ-8                      PIC 9(08).                              
033700 77 WS-SISORI                         PIC 9(04).                              
033800 77 WS-EOF-ORDCM                      PIC 9(02).                              
033900 77 WS-EOF-ORDPTE                     PIC 9(02).                              
034000 77 WS-EOF-CTOS                       PIC 9(02).                              
034100 77 WS-EOF-ARCH                       PIC 9(02).                              
034200 77 WS-FND-ARCH                       PIC 9(02).                              
034300 77 WS-EOF-DIAL                       PIC 9(02).                              
034400 77 WS-EOF-MOVS                       PIC 9(02).                              
034500 77 WS-EOF-MOVS-LOCK                  PIC 9(02).                              
034600 77 WS-EOF-SORT                       PIC 9(02).                              
034700 77 WS-NODO                           PIC 9(02).                              
034800 77 WS-OFCH                           PIC 9(02).                              
034900 77 WS-OFTC                           PIC 9(02).                              
035000 77 WS-OF87                           PIC 9(02).                              
035100 77 WS-OF152                          PIC 9(02).                              
035200 77 WS-EOF-CHQS                       PIC 9(02).                              
035300 77 WS-EOF-MOVTB                      PIC 9(02).                              
035350 77 WS-EOF-MOVTBSEM                   PIC 9(02).                              
035400 77 WS-REGISTROS                      PIC 9(08).                              
035500 77 WS-CARGOS                         PIC 9(16)V99.                           
035600 77 WS-ABONOS                         PIC 9(16)V99.                           
035700 77 WS-ENTERADO                       PIC XX.                                 
035800 77 WS-MENSAJE                        PIC X(10).                              
035900 77 WS-TIPO-ELIM                      PIC 9(02).                              
035950 77 WS-AREASIZE                       PIC 9(11) VALUE 0.                      
036000 77 WS-LASTREC                        PIC 9(11) VALUE 0.                      
036100 77 WS-MAXRECSIZE                     PIC 9(11) VALUE 0.                      
036200 77 WS-RESIDUO                        PIC 9(11) VALUE 0.                      
036300 77 WS-WORDSORT                       PIC 9(12) VALUE 0.                      
036310 77 W77-TOT-REGS                      PIC 9(11) VALUE 0.                      
036320 77 W77-MAXRECSIZE                    PIC 9(11) VALUE 0.                      
036330 77 W77-UNITS                         PIC 9(11) VALUE 0.                      
036340 77 W77-DISK-SIZE                     PIC 9(11) VALUE 0.                      
036350 77 W77-MEMORY-SIZE                   PIC 9(11) VALUE 0.                      
036400 77 WS-CVE-RESP                       PIC 9(04).                              
036500 77 WS-SGDA-VUELTA                    PIC 9(01)  VALUE 0.                     
036600 77 WS-IND-TR                         PIC 9(02).                              
036700 77 WS-ULTREG-ENV                     PIC 9(08).                              
036800 77 WS-ULTREG-REC                     PIC 9(08).                              
036820 77 WS-ULTREG-REC-ANT                 PIC 9(08) VALUE 0.                      
036840 77 WS-ULTREG-REC-IGUAL               PIC 9(02) VALUE 0.                      
036900 77 WS-MY-VALUE                       PIC 9(02) VALUE 0.                      
037000 77 WS-FIN-ANORMAL                    PIC 9      VALUE 0.                     
037100 77 WS-ABRI-BASEORI                   PIC 9      VALUE 0.                     
037200 77 WS-ABRI-BASEAUX                   PIC 9      VALUE 0.                     
037300 77 WS-CVEREC-ABO                     PIC 9(04).                              
037400 77 WS-CVEREC-CGO                     PIC 9(04).                              
037500 77 WS-ULTREG-ORDCM                   PIC 9(08)  VALUE 1.                     
037600 77 WS-PORC-ENVIO                     PIC 9(02).                              
037700**                                                                            
037800 77 WS-APLINCLUDE-RESULT              PIC S9(11) BINARY.                      
037900 77 WS-ESPERACOMS-TIEMPO              PIC S9(11) BINARY VALUE 60.             
038000 77 WS-ESPERACOMS-TIPO-EVENTO         PIC S9(11) BINARY.                      
038100 77 WS-OUTPUT-DESIGNATOR              REAL.                                   
038200 77 WS-OUTPUT-NOMBRE                  PIC X(30)                               
038300                                      VALUE "OUPUT OF LINEA.".                
038400 77 WS-COMS-RESULT                    PIC S9(11) BINARY.                      
038500 77 WS-NO-APL                         PIC X(30).                              
038600 77 WS-NO-APL-DESG                    REAL.                                   
038700 77 WS-MI-PROGRAMA                    PIC X(30).                              
038800 77 WS-MI-PROGRAMA-DESG               REAL.                                   
038900 77 WS-AG-SALIDA                      PIC X(30).                              
039000 77 WS-AG-SALIDA-DESG                 REAL.                                   
039100 77 WS-COMS-DEF-STA-NAME              PIC X(14).                              
039200 77 WS-DEFAULTSTATION-DESG            REAL.                                   
039300 77 WS-COMS-IN-STATUS-KEY-I           PIC 9(20).                              
039400 77 WS-COMS-IN-FUNCTION-STATUS-I      PIC 9(20).                              
039500 77 WS-COMS-IN-TEXT-LENGTH-I          PIC 9(20).                              
039600 77 WS-COMS-OUT-STATUS-KEY-I          PIC 9(20).                              
039601*INI BSR. MONEDA ORIGEN                                                       
039602 77 WS-IMPDLLS-ORI                    PIC 9(08)V99.                           
039603 77 WS-CODMONEDA-ORI                  PIC 9(03).                              
039604 77 WS-FILLER-ORI                     PIC X(22).                              
039605*FIN BSR. MONEDA ORIGEN                                                       
039606 01 WS-ID-NEGOCIO                     PIC 9(08).                              
039610                                                                              
039615*INI-STEFANINI TIPO DE CAMBIO                                                 
039620 01  WS-AGRUPADOR-TC                  PIC X(30).                              
039625 01  WS-AGRUPADOR-TC-R REDEFINES WS-AGRUPADOR-TC.                             
039630     03 WS-TCAM-BANX                  PIC X(11).                              
039635     03 WS-TCAM-BANX-R REDEFINES WS-TCAM-BANX PIC 9(05)V9(06).                
039640     03 WS-TCAM-COM                   PIC X(08).                              
039645     03 WS-TCAM-COM-R  REDEFINES WS-TCAM-COM  PIC 9(04)V9(04).                
039650     03 WS-TCAM-VALM                  PIC X(11).                              
039655     03 WS-TCAM-VALM-R REDEFINES WS-TCAM-VALM PIC 9(05)V9(06).                
039660 01  WS-FILLER-TC                     PIC X(05) VALUE SPACES.                 
039665*FIN-STEFANINI TIPO DE CAMBIO                                                 
039670*INI EAS FASE 3                                                               
039675 01  WS-IMPORTE-AUTO                  PIC 9(12)V99.                           
039680 01  WS-ORIGEN-EAS                    PIC 9(02).                              
039685*FIN EAS FASE 3                                                               
039686*INI EAS FASE 4                                                               
039687 01  WS-INSTITUCION-ID-NVO            PIC 9(04).                              
039688 01  WS-INTAPLICACION-ID              PIC 9(04).                              
039689 01  WS-INTAUTH-CODE                  PIC X(06).                              
039690 01  WS-NUMTB                         PIC 9(16).                              
039691 01  WS-REFINTNAL                     PIC X(23).                              
039693 01  WS-FILLER-02                     PIC X(02).                              
039695 01  WS-FILLER-12                     PIC X(12).                              
039697*FIN EAS FASE 4                                                               
039698                                                                              
039699*INI-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
039700 77  WS-DISPERSACPE                   PIC 9(01) VALUE 0.                      
039701                                                                              
039702 01 WKS-LLAVE-MSG-12              PIC 9(08).                                  
039704 01 WKS-MSG-12-CONFIRMADO-VA      PIC 9(02) COMP VALUE 0.                     
039706    88 WKS-MSG-12-CONFIRMADO      VALUE 1.                                    
039708 01 WKS-MSG-12-ENVIADO-VA         PIC 9(02) COMP VALUE 0.                     
039808    88 WKS-MSG-12-ENVIADO         VALUE 1.                                    
039908                                                                              
041110 01 WS-DISP.                                                                  
041120    02 WS-DISPLAY                 PIC X(852).                                 
041130    02 WS-DISPLAYR REDEFINES WS-DISPLAY.                                      
041140       03 WS-DISPLAY1             PIC X(200).                                 
041150       03 WS-DISPLAY2             PIC X(200).                                 
041160       03 WS-DISPLAY3             PIC X(200).                                 
041170       03 WS-DISPLAY4             PIC X(200).                                 
041180       03 WS-DISPLAY5             PIC X(052).                                 
041600                                                                              
041700 01 WS-TOTAL-RECHAZOS.                                                        
041750    02 WS-TOTREC-PIM OCCURS 4 TIMES.                                          
041800       03 WS-TOTREC-PRIO OCCURS 10 TIMES.                                     
041850          04 WS-TOTREC-MONEDA OCCURS 3 TIMES.                                 
041900             06 WS-TOTRECABO      PIC 9(10)V99.                               
042000             06 WS-TOTRECCGO      PIC 9(10)V99.                               
042100                                                                              
042200 01 WS-NUMEROS-OCCAS.                                                         
042300    02 FILLER PIC X(28) VALUE "0900090009000904090109010904".                 
042400    02 FILLER PIC X(12) VALUE "090009000907".                                 
042500 01 WS-NUM-OCCAS REDEFINES WS-NUMEROS-OCCAS.                                  
042600    02 WS-OCCAS OCCURS 10 TIMES     PIC 9(04).                                
042700                                                                              
044200*                                                                             
044300 01 WS-COMS-DESIGNATOR-ARRAY            REAL.                                 
044400    02 WS-COMS-DESG                     REAL OCCURS 10 TIMES.                 
044500 01 WS-COMS-INTEGER-ARRAY               USAGE BINARY.                         
044600    02 WS-COMS-INT                     PIC S9(11) OCCURS 20 TIMES.            
044700 01 WS-COMS-REAL-ARRAY                  REAL.                                 
044800    02 WS-COMS-REAL                     REAL OCCURS 30 TIMES.                 
044900                                                                              
045000 01 WS-SOPCOM-COMANDO                   PIC X(30).                            
045100 01 WS-SOPCOM-TRABAJO                   PIC X(132).                           
045200                                                                              
045300 01 WS-APLINCLUDE-ID.                                                         
045400    02 WS-APLINCLUDE-SISTEMA            PIC X(04).                            
045500    02 WS-APLINCLUDE-PASO               PIC X(14).                            
045600 01 WS-APLINCLUDE-PARAMETRO.                                                  
045700    02 WS-APLINCLUDE-PAR-1              PIC X(15).                            
045800    02 WS-APLINCLUDE-PAR-2              PIC X(15).                            
045900 01 WS-APLINCLUDE-SCRATCH               COMP.                                 
046000    02 WS-APLINCLUDE-SCR                PIC S9(11).                           
046100                                                                              
046110**********************************************************                    
046120*   VARS PARA LA RUTINA DE CHEQUEO DEL P015 EN CTLVERS   *                    
046130**********************************************************                    
046200 01 VERSIONES-PROG.                                                           
046220    02 WKS-ID-P015                PIC X(08) VALUE "S500P015".                 
046240                                                                              
046260    02 WKS-TITULO-PROG            PIC X(72).                                  
046280    02 WKS-TITULO-PROG-R REDEFINES WKS-TITULO-PROG.                           
046300       03 FILLER                  PIC X.                                      
046320       03 WKS-TP-SISTEMA          PIC X(04).                                  
046340       03 FILLER                  PIC X.                                      
046360       03 WKS-TP-SUBDIR           PIC X(12).                                  
046380       03 WKS-TP-PASO             PIC X(04).                                  
046400       03 FILLER                  PIC X.                                      
046420       03 WKS-TP-VERSION          PIC X(08).                                  
046440       03 WKS-TP-VERSION-R REDEFINES WKS-TP-VERSION.                          
046460          04 WKS-TP-RELEASE       PIC X(02).                                  
046480          04 FILLER               PIC X(03).                                  
046500          04 WKS-TP-MTP           PIC X(03).                                  
046520       03 FILLER                  PIC X(04).                                  
046540       03 WKS-TP-PACK             PIC X(12).                                  
046560       03 FILLER                  PIC X(25).                                  
046580                                                                              
046600    02 WKS-VERIFICA-VERSIONES     PIC S9  VALUE 0.                            
046620       88 WKS-88-VERS-SIN-ERROR           VALUE 0.                            
046640       88 WKS-88-VERS-ERR-SI-CONTINUO     VALUE 1 THRU 3.                     
046660       88 WKS-88-VERS-ERR-NO-CONTINUO     VALUE -1 THRU -3.                   
046680                                                                              
047000**********************************************************                    
047100*   VARS PARA LA RUTINA DE ESPERARSE N MINUTOS           *                    
047150**********************************************************                    
047200 01 WKS-VARS-ESPERA.                                                          
047300    02 WKS-MINUTOS-A-ESPERAR      PIC 9(04) VALUE 03.                         
047400    02 WKS-ESPERO-VA              PIC 9(02) COMP.                             
047450       88 WKS-PASARON-N-MIN       VALUE 1.                                    
047500    02 WKS-ESTAMOS-EN-ESPERA-VA   PIC 9(02) COMP.                             
047550       88 WKS-ESTAMOS-EN-ESPERA   VALUE 1.                                    
047700    02 WS-ESPERA-COCIENTE         PIC 9(02).                                  
047900    02 WS-ESPERA-RESIDUO          PIC 9(02).                                  
048220    02 WS-HORA-HH-INI-ESP         PIC 9(02).                                  
048240    02 WS-HORA-HH-FIN-ESP         PIC 9(02).                                  
048260    02 WKS-ULTMSG                 PIC 9(08).                                  
048280    02 WS-HORA-MM-INI-ESP         PIC 9(02).                                  
048285    02 WS-HORA-MM-FIN-ESP         PIC 9(02).                                  
049300                                                                              
050000 01 WS-FECHA-TAR-ANT                    PIC 9(08).                            
051000 01 WS-FECHA-TARSEM-ANT                 PIC 9(08).                            
052000 01 WKS-DISP-S087                       PIC 9(02) VALUE 0.                    
059500 01 WS-ULTFECHA-TAR                     PIC 9(08).                            
059910 01 WS-ULTFECHA-TARSEM                  PIC 9(08).                            
059955 01 WKS-PROXFECHA-TARSEM                PIC 9(08).                            
060000 01 WS-ULTFECHA-87                      PIC 9(08).                            
060500 01 WS-ULTFECHA-152                     PIC 9(08).                            
060505 01 WS-ULTFECHA-EAS                     PIC 9(08).                            
060510 01 WS-ULTFECHA-EASSEM                  PIC 9(08).                            
060515 01 WS-EAS-TAR                          PIC 9(01).                            
060520    88 WS-PROC-TAR  VALUE 1.                                                  
060525    88 WS-PROC-EAS  VALUE 2.                                                  
060530 01 WS-ETIQ-EAS-TAR                     PIC X(45).                            
060535 01 WS-ETIQ-FECHA                       PIC 9(06).                            
060540 01 WS-FECHA-EAS-TAR                    PIC 9(08).                            
060545 01 WS-FECHA-S111-HUB                   PIC 9(08).                            
060920 01 WS-HRA-SEQ                          PIC 9(06).                            
060940 01 WS-HRA-SEQ-R REDEFINES WS-HRA-SEQ.                                        
060960    02 WS-HORA-SEQ                      PIC 9(04).                            
060980    02 FILLER                           PIC 9(02).                            
061000 01 WS-HORA.                                                                  
061100    02 WS-HORA-1                        PIC 9(8).                             
061200    02 WS-HORA-2 REDEFINES WS-HORA-1.                                         
061300       09 WS-H                          PIC 9(2).                             
061400       09 WS-M                          PIC 9(2).                             
061450       09 WS-S                          PIC 9(2).                             
061500       09 FILLER                        PIC X(2).                             
061600    02 WS-HORA-3 REDEFINES WS-HORA-1.                                         
061700       09 WS-HHMMSS                     PIC 9(6).                             
061800       09 FILLER                        PIC X(2).                             
061805***************************************************************               
061810*   ETIQUETA DEL ARCHIVO DE TASKFILE                          *               
061815***************************************************************               
061820 01 WKS-TASKFILE-NOMBRE.                                                      
061825    02 FILLER             PIC X(60) VALUE "FILE TASKFILE (USERBACK            
061830-                         "UPNAME=TRUE,TITLE=S500/TASKFILE/P015/".            
061835    02 WKS-TASKFILE-FEC   PIC 9(06).                                          
061840    02 FILLER             PIC X(01) VALUE "/".                                
061845    02 WKS-TASKFILE-MIX   PIC 9(07).                                          
061850    02 FILLER             PIC X(02) VALUE ");".                               
061855                                                                              
061900***************************************************************               
062000*   ETIQUETA DEL ARCHIVO DEL S087                             *               
062100***************************************************************               
063100 01 W-ETIQ-DISPS087.                                                          
063300    02 FILLER             PIC X(16) VALUE "S087/FILE/S500/".                  
063500    02 W-ETIQ-D87-CSIO    PIC 99/.                                            
063700    02 W-ETIQ-D87-CSID    PIC 99.                                             
063800    02 FILLER             PIC X(10) VALUE "/MOVSDISP/".                       
064000    02 W-ETIQ-D87-FECHA   PIC 9(06).                                          
064100    02 W-ETIQ-D87-FECHAR REDEFINES W-ETIQ-D87-FECHA.                          
064200       04 W-ETIQ-D87-ANO  PIC 9(02).                                          
064300       04 W-ETIQ-D87-MES  PIC 9(02).                                          
064400       04 W-ETIQ-D87-DIA  PIC 9(02).                                          
064500    02 FILLER             PIC X(01) VALUE ".".                                
064550                                                                              
064580***************************************************************               
064585*   ETIQUETA DEL ARCHIVO DEL S152                             *               
064590***************************************************************               
064600 01 W-ETIQ-DISPS152.                                                          
064800    02 FILLER             PIC X(18) VALUE "S152/FILE/S500/12/".               
065200    02 W-ETIQ-DIS-CSID    PIC 99.                                             
065300    02 FILLER             PIC X(10) VALUE "/MOVSDISP/".                       
065500    02 W-ETIQ-DIS-FECHA   PIC 9(06).                                          
065600    02 W-ETIQ-DIS-FECHAR REDEFINES W-ETIQ-DIS-FECHA.                          
065700       04 W-ETIQ-DIS-ANO  PIC 9(02).                                          
065800       04 W-ETIQ-DIS-MES  PIC 9(02).                                          
065900       04 W-ETIQ-DIS-DIA  PIC 9(02).                                          
066000    02 FILLER             PIC X(01) VALUE ".".                                
066002                                                                              
066005**************************************************************                
066007*   ETIQUETA DEL ARCHIVO ORDENADO DE SALDOS PENDIENTES       *                
066009**************************************************************                
066011 01 W-ETIQ-SALDOSPEN.                                                         
066013    02 FILLER                   PIC X(15) VALUE "S500/FILE/S500/".            
066015    02 W-ETIQ-SP-CSIO           PIC 99/.                                      
066019    02 W-ETIQ-SP-CSID           PIC 9(02).                                    
066021    02 FILLER                   PIC X(11) VALUE "/SALDOPEND/".                
066023    02 W-ETIQ-SP-FECHA          PIC 9(06).                                    
066025    02 W-ETIQ-SP-FECHA-R REDEFINES W-ETIQ-SP-FECHA.                           
066027       03 W-ETIQ-SP-FEC-AA      PIC 9(02).                                    
066029       03 W-ETIQ-SP-FEC-MM      PIC 9(02).                                    
066031       03 W-ETIQ-SP-FEC-DD      PIC 9(02).                                    
066032    02 FILLER                   PIC X(01) VALUE "/".                          
066033    02 W-ETIQ-SP-SEQ            PIC 99.                                       
066034    02 FILLER                   PIC X(01) VALUE ".".                          
066035                                                                              
066100**************************************************************                
066200*   ETIQUETA DEL ARCHIVO DE TARJETA                          *                
066300**************************************************************                
067600 01 W-ETIQ-MOVTBINTNVA.                                                       
067700    02 FILLER                           PIC X(18) VALUE                       
067800       "S500/FILE/S500/10/".                                                  
067900    02 W-ETIQ-TB-CSI                    PIC 9(02).                            
068000    02 FILLER                           PIC X(13) VALUE                       
068100       "/MOVSTBINTER/".                                                       
068200    02 W-ETIQ-TB-FECHA                  PIC 9(06).                            
068300    02 WS-ETIQ-FECHA-TB-R REDEFINES W-ETIQ-TB-FECHA.                          
068400       04 W-ETIQ-TB-ANO                 PIC 9(02).                            
068500       04 W-ETIQ-TB-MES                 PIC 9(02).                            
068600       04 W-ETIQ-TB-DIA                 PIC 9(02).                            
068700    02 FILLER                           PIC X(01) VALUE ".".                  
068701                                                                              
068702**************************************************************                
068703*   ETIQUETA DEL ARCHIVO DE TARJETA EAS                      *                
068704**************************************************************                
068705 01 W-ETIQ-MOVTBINTNVAE.                                                      
068706    02 FILLER                           PIC X(18) VALUE                       
068707       "S500/FILE/S500/10/".                                                  
068708    02 W-ETIQ-TBE-CSI                   PIC 9(02).                            
068709    02 FILLER                           PIC X(16) VALUE                       
068710       "/MOVSTBINTEREAS/".                                                    
068711    02 W-ETIQ-TBE-FECHA                 PIC 9(06).                            
068712    02 WS-ETIQ-FECHA-TBE-R REDEFINES W-ETIQ-TBE-FECHA.                        
068713       04 W-ETIQ-TBE-ANO                PIC 9(02).                            
068714       04 W-ETIQ-TBE-MES                PIC 9(02).                            
068715       04 W-ETIQ-TBE-DIA                PIC 9(02).                            
068716    02 FILLER                           PIC X(01) VALUE ".".                  
068717                                                                              
068718**************************************************************                
068720*   ETIQUETA DEL ARCHIVO DE TARJETA SEMANAL                  *                
068730**************************************************************                
068740 01 W-ETIQ-MOVTBINTSEM.                                                       
068750    02 FILLER                           PIC X(18) VALUE                       
068760       "S500/FILE/S500/10/".                                                  
068770    02 W-ETIQ-TBSEM-CSI                 PIC 9(02).                            
068780    02 FILLER                           PIC X(16) VALUE                       
068790       "/MOVSTBINTERSEM/".                                                    
068800    02 W-ETIQ-TBSEM-FECHA               PIC 9(06).                            
068810    02 WS-ETIQ-FECHA-TBSEM-R REDEFINES W-ETIQ-TBSEM-FECHA.                    
068820       04 W-ETIQ-TBSEM-ANO              PIC 9(02).                            
068830       04 W-ETIQ-TBSEM-MES              PIC 9(02).                            
068840       04 W-ETIQ-TBSEM-DIA              PIC 9(02).                            
068850    02 FILLER                           PIC X(01) VALUE ".".                  
068852                                                                              
068854**************************************************************                
068856*   ETIQUETA DEL ARCHIVO DE TARJETA SEMANAL EAS              *                
068858**************************************************************                
068860 01 W-ETIQ-MOVTBINTEASSEM.                                                    
068862    02 FILLER                           PIC X(18) VALUE                       
068864       "S500/FILE/S500/10/".                                                  
068866    02 W-ETIQ-TBESEM-CSI                PIC 9(02).                            
068868    02 FILLER                           PIC X(19) VALUE                       
068870       "/MOVSTBINTERSEMEAS/".                                                 
068872    02 W-ETIQ-TBESEM-FECHA              PIC 9(06).                            
068874    02 WS-ETIQ-FECHA-TBESEM-R REDEFINES W-ETIQ-TBESEM-FECHA.                  
068876       04 W-ETIQ-TBESEM-ANO             PIC 9(02).                            
068878       04 W-ETIQ-TBESEM-MES             PIC 9(02).                            
068880       04 W-ETIQ-TBESEM-DIA             PIC 9(02).                            
068882    02 FILLER                           PIC X(01) VALUE ".".                  
068884                                                                              
068886*                                                                             
068900**************************************************************                
068920*   ETIQUETA DEL ARCHIVO ORDENADO DE S087,S152,TARJ Y TARJS  *                
068940**************************************************************                
068960 01 W-ETIQ-ORDENADO.                                                          
068980    02 FILLER                           PIC X(15) VALUE                       
069000       "S500/FILE/S500/".                                                     
069020    02 W-ETIQ-ORD-CSIO                  PIC 9(02)/.                           
069040    02 W-ETIQ-ORD-CSID                  PIC 9(02).                            
069060    02 FILLER                           PIC X(12)                             
069080                      VALUE "/DISPERSION/".                                   
069100    02 W-ETIQ-ORD-FECHA                 PIC 9(06).                            
069120    02 WS-ETIQ-FECHA-ORD-R REDEFINES W-ETIQ-ORD-FECHA.                        
069140       04 W-ETIQ-ORD-ANO                PIC 9(02).                            
069160       04 W-ETIQ-ORD-MES                PIC 9(02).                            
069180       04 W-ETIQ-ORD-DIA                PIC 9(02).                            
069200    02 FILLER                           PIC X(01) VALUE "/".                  
069220    02 W-ETIQ-ORD-SEQ                   PIC 9(04).                            
069240    02 FILLER                           PIC X(01) VALUE ".".                  
069250                                                                              
069300**************************************************************                
069305*   ETIQUETA DEL ARCHIVO ORDENADO DE SALDOS PENDIENTES       *                
069310**************************************************************                
069315 01 W-ETIQ-ORDENADO-SP.                                                       
069320    02 FILLER                   PIC X(15)                                     
069322                                VALUE "S500/FILE/S500/".                      
069325    02 W-ETIQ-ORD-SP-CSIO       PIC 99/.                                      
069330    02 W-ETIQ-ORD-SP-CSID       PIC 9(02).                                    
069335    02 FILLER                   PIC X(14) VALUE "/DISPERSIONSP/".             
069340    02 W-ETIQ-ORD-SP-FECHA      PIC 9(06).                                    
069345    02 W-ETIQ-ORD-SP-FECHA-R REDEFINES W-ETIQ-ORD-SP-FECHA.                   
069350       03 W-ETIQ-ORD-SP-FEC-AA  PIC 9(02).                                    
069355       03 W-ETIQ-ORD-SP-FEC-MM  PIC 9(02).                                    
069360       03 W-ETIQ-ORD-SP-FEC-DD  PIC 9(02).                                    
069365    02 FILLER                   PIC X(01) VALUE ".".                          
069370                                                                              
069375*NOR-INI CONCILIACION EAS-HUB                                                 
069380**************************************************************                
069385*   ETIQUETA DEL ARCHIVO EAS-HUB                             *                
069390**************************************************************                
069395 01 W-ETIQ-EAS-HUB.                                                           
069400    02 FILLER                           PIC X(15) VALUE                       
069405       "S500/FILE/INTS/".                                                     
069410    02 W-ETIQ-HUB-BUZON                 PIC X(08) VALUE                       
069415       "50035S01".                                                            
069420    02 FILLER                           PIC X(01) VALUE "/".                  
069425    02 W-ETIQ-HUB-CSI                   PIC 9(02).                            
069430    02 FILLER                           PIC X(01) VALUE "/".                  
069435    02 W-ETIQ-HUB-FECHA                 PIC 9(08).                            
069440    02 WS-ETIQ-FECHA-HUB-R REDEFINES W-ETIQ-HUB-FECHA.                        
069445       04 W-ETIQ-ORD-ANO                PIC 9(04).                            
069450       04 W-ETIQ-ORD-MES                PIC 9(02).                            
069455       04 W-ETIQ-ORD-DIA                PIC 9(02).                            
069460    02 FILLER                           PIC X(08) VALUE                       
069462       "/CONHUB.".                                                            
069464*    02 WS-ETIQ-HUB-SS                   PIC 9(02).                           
069466*    02 FILLER                           PIC X(01) VALUE ".".                 
069468* 01 W-ETIQ-EAS-HUB-SS-R REDEFINES W-ETIQ-EAS-HUB-SS.                         
069470*    02 W-ETIQ-EAS                       PIC X(42).                           
069472*    02 FILLER                           PIC X(04).                           
069474                                                                              
069476* 01 W-ETIQ-EAS-HUB.                                                          
069478*    02 W-ETIQ-HUB-NOM                   PIC X(42).                           
069480*    02 FILLER                           PIC X(01) VALUE ".".                 
069490 77 WKS-HAY-ARCH-EAS                    PIC 9(01).                            
069495*NOR-FIN                                                                      
069500**************************************************************                
069600*   ETIQUETA DEL ARCHIVO CTRLARCH PARA CONTRO DE ARCHIVOS    *                
069700**************************************************************                
069800 01 W-ETIQ-CTRLARCH.                                                          
069900    02 FILLER                           PIC X(28) VALUE                       
070000       "S500/FILE/S500/CTRLARCHP104/".                                        
070100    02 W-ETIQ-CTRL-CSIO                 PIC 9(02)/.                           
070200    02 W-ETIQ-CTRL-FECHA                PIC 9(08).                            
070300    02 WS-ETIQ-FECHA-CTRL-R REDEFINES W-ETIQ-CTRL-FECHA.                      
070400       04 W-ETIQ-CTRL-ANO               PIC 9(04).                            
070500       04 W-ETIQ-CTRL-MES               PIC 9(02).                            
070600       04 W-ETIQ-CTRL-DIA               PIC 9(02).                            
070700    02 FILLER                           PIC X(01) VALUE ".".                  
070805                                                                              
070810***********************************************************                   
070815*               CARATULA PARA LOS BACKUPS                 *                   
070820***********************************************************                   
070825 01  CARATULA.                                                                
070830     03 FILLER           PIC X(15) VA "S500/LIST/P015/".                      
070835     03 CARAT-CSI        PIC 9(02).                                           
070840     03 CARAT-SUBNODO    PIC 9(02) VA 0.                                      
070845     03 FILLER           PIC X(01) VA "/".                                    
070850     03 CARAT-CIFRA      PIC X(01) VA "R".                                    
070855     03 CARAT-MNEMOSEC   PIC 9(03).                                           
070857     03 FILLER           PIC X(01) VA "/".                                    
070860     03 CARAT-FECHA      PIC 9(06).                                           
070865     03 FILLER           PIC X(01) VA "/".                                    
070870     03 CARAT-MIX        PIC 9(07).                                           
070875     03 FILLER           PIC X(01) VA "/".                                    
070880     03 CARAT-SEC        PIC 9(03) VA 001.                                    
070885     03 CARAT-MNEMO      PIC X(08) VA "TARJETAS".                             
070890*    03 CARAT-MNEMOSEC   PIC 9(04).                                           
070895     03 FILLER           PIC X(01) VA ".".                                    
070900                                                                              
070905 01 WKS-VARS-IMPRESION.                                                       
070910     02 WKS-I-RENGLON     PIC 9(02) VALUE 65.                                 
070915     02 WKS-I-HOJA        PIC 9(04) VALUE 0.                                  
070920     02 WKS-HUBO-REGS-VA  PIC 9(06) VALUE 0.                                  
070922     02 WKS-IND-TM        PIC 9(02).                                          
070924     02 WKS-IND-ID        PIC 9(02).                                          
070925     02 WKS-ERROR-VA      PIC 9(02).                                          
070930        88 WKS-SIN-ERROR       VALUE 00.                                      
070935        88 WKS-ERROR-78        VALUE 01.                                      
070940        88 WKS-ERROR-07        VALUE 02.                                      
070945                                                                              
070950 01 WKS-TABLA-DIFERENCIAS.                                                    
070955    02 WKS-TBL-D-TIPOMOV OCCURS 3 TIMES.                                      
070960       03 WKS-TBL-D-IGUDIF OCCURS 2 TIMES.                                    
070965          04 WKS-TD-NUM   PIC 9(08) COMP.                                     
070970          04 WKS-TD-IMP   PIC 9(14)V99 COMP.                                  
070972                                                                              
070974 01 WKS-TBL-TIPOMOV.                                                          
070976    02 FILLER     PIC X(15) VALUE "NO CONTABLES   ".                          
070978    02 FILLER     PIC X(15) VALUE "CONTABLES      ".                          
070980    02 FILLER     PIC X(15) VALUE "          TOTAL".                          
070982                                                                              
070984 01 WKS-TBL-TIPOMOV-R REDEFINES WKS-TBL-TIPOMOV.                              
070986    02 WKS-T-TM OCCURS 3 TIMES PIC X(15).                                     
070988                                                                              
070990                                                                              
071000******************************************************************            
071010* FORMATOS PARA ENCABEZADOS Y DETALLES DEL BACKUP                *            
071050******************************************************************            
071060 01 WKS-ENCA-1.                                                               
071070     02 FILLER            PIC X(51) VALUE SPACES.                             
071080     02 FILLER            PIC X(29) VALUE                                     
071090        "BANCO NACIONAL DE MEXICO S.A.".                                      
071100 01 WKS-ENCA-2.                                                               
071110     02 FILLER            PIC X(19) VALUE "  S500-P015-CTODIF-".              
071120     02 WKS-E2-SEQ        PIC 9(04)B(17).                                     
071130     02 FILLER            PIC X(53) VALUE                                     
071140     "  DIFERENCIAS DE CONTRATOS ENTRE TARJETAS Y CLIENTES ".                 
071150     02 FILLER            PIC X(21) VALUE "               FECHA ".            
071160     02 WKS-OPE-DD        PIC Z9.                                             
071170     02 FILLER            PIC X VALUE "/".                                    
071180     02 WKS-OPE-MM        PIC 9(02).                                          
071190     02 FILLER            PIC X VALUE "/".                                    
071200     02 WKS-OPE-AA        PIC 9(04).                                          
071210 01 WKS-ENCA-3.                                                               
071220     02 FILLER            PIC X(10) VALUE "  PROCESO ".                       
071230     02 WKS-PRO-DD        PIC Z9.                                             
071240     02 FILLER            PIC X VALUE "/".                                    
071250     02 WKS-PRO-MM        PIC 9(02).                                          
071260     02 FILLER            PIC X VALUE "/".                                    
071270     02 WKS-PRO-AA        PIC 9(04)B(04).                                     
071280     02 WKS-PRO-HH        PIC Z9.                                             
071290     02 FILLER            PIC X VALUE ":".                                    
071300     02 WKS-PRO-MI        PIC 9(02).                                          
071310     02 FILLER            PIC X VALUE ":".                                    
071320     02 WKS-PRO-SS        PIC 9(02).                                          
071330     02 FILLER            PIC X(82) VALUE SPACES.                             
071340     02 FILLER            PIC X(05) VALUE "HOJA ".                            
071350     02 WKS-HOJA          PIC Z,ZZ9.                                          
071352 01 WKS-ENCA-DET-1.                                                           
071354    02 FILLER             PIC X(56) VALUE                                     
071356       "      ARCHIVO DE TARJETAS          ENTRY_POINT  S016_L42".            
071358    02 FILLER             PIC X(56) VALUE                                     
071360       "2_XMEDIO      ENTRY_POINT S016_L422_CTASREL             ".            
071362    02 FILLER             PIC X(20) VALUE SPACES.                             
071364 01 WKS-ENCA-DET-2.                                                           
071366    02 FILLER             PIC X(56) VALUE                                     
071368       "       TARJETA         CONTRATO      ERR    CONTRATO    ".            
071370    02 FILLER             PIC X(56) VALUE                                     
071372       "NO. DE CLIENTE  ERR    CONTRATO   CLAVE         IMPORTE ".            
071374    02 FILLER             PIC X(20) VALUE SPACES.                             
071376 01 WKS-ENCA-TOTALES.                                                         
071378    02 FILLER             PIC X(56) VALUE                                     
071380       "        TIPO DE MOVIMIENTO             IGUALES          ".            
071382    02 FILLER             PIC X(56) VALUE                                     
071384       "                      DIFERENTES                        ".            
071386    02 FILLER             PIC X(20) VALUE SPACES.                             
071400 01 WKS-DETALLE-1.                                                            
071410    02 WD1-TARJ-TB        PIC BB9(16)B(3).                                    
071420    02 WD1-CTO-TB         PIC Z(11)9B(02).                                    
071430    02 WD1-78-ERR         PIC Z(04)9B(02).                                    
071440    02 WD1-78-CTO         PIC Z(11)9B(02).                                    
071450    02 WD1-78-CTE         PIC Z(11)9B(02).                                    
071460    02 WD1-07-ERR         PIC Z(04)9B(02).                                    
071470    02 WD1-07-CTO         PIC Z(11)9B(02).                                    
071475    02 WD1-CVE-CM         PIC Z(03)9B(02).                                    
071480    02 WD1-IMP-CM         PIC ZZZ,ZZZ,ZZZ,ZZ9.99B(01).                        
071482    02 WD1-LG-ERR         PIC Z(01)9B(01).                                    
071483    02 WD1-LG-CTO         PIC Z(11)9B(01).                                    
071485                                                                              
071490 01 WKS-TOTAL-DET-1.                                                          
071495    02 WTD1-TIPO-MOV      PIC B(10)X(15)B(05).                                
071500    02 WTD1-IGU-NUM       PIC ZZ,ZZZ,ZZ9B(05).                                
071505    02 WTD1-IGU-IMP       PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99B(05).                     
071510    02 WTD1-DIF-NUM       PIC ZZ,ZZZ,ZZ9B(05).                                
071515    02 WTD1-DIF-IMP       PIC ZZ,ZZZ,ZZZ,ZZZ,ZZ9.99B(25).                     
071520                                                                              
071600 01 WKS-DET-NO-HUBO-MOVS.                                                     
071610    02 FILLER             PIC X(51) VALUE SPACES.                             
071620    02 FILLER             PIC X(30) VALUE                                     
071630       "NO HUBO MOVIMIENTOS DIFERENTES".                                      
071640    02 FILLER             PIC X(51) VALUE SPACES.                             
073100*                                                                             
073110 01 WS-CTR-ARCDISP                      PIC 9(12).                            
073120 01 WS-CTR-ARCDISPR REDEFINES WS-CTR-ARCDISP.                                 
073130    02 WS-CTR-ADFECHA                   PIC 9(08).                            
073140    02 WS-CTR-ADSEQ                     PIC 9(04).                            
073200*                                                                             
073300 01 WS-ERRORES-L010.                                                          
073400    03 FILLER               PIC X(40) VALUE                                   
073500             "ALGUNA  DE LAS COPIAS SE ESTA LEVANTANDO".                      
073600    03 FILLER               PIC X(40) VALUE                                   
073700             "ERROR EN BASE DE DATOS                  ".                      
073800    03 FILLER               PIC X(40) VALUE                                   
073900             "EL PROCESO EN CURSO NO ES LINEA         ".                      
074000    03 FILLER               PIC X(40) VALUE                                   
074100             "INDICADOR DE DISPERSION INVALIDO        ".                      
074200    03 FILLER               PIC X(40) VALUE                                   
074300             "INDICADOR DE ELIMINACION DE DISP INVALID".                      
074400    03 FILLER               PIC X(40) VALUE                                   
074500             "NO HAY DIALOGO FORANEO                  ".                      
074600    03 FILLER               PIC X(40) VALUE                                   
074700             "ALGUNA COPIA ESTA EN WAIT O FUERA DE MZC".                      
074800    03 FILLER               PIC X(40) VALUE                                   
074900             "AUN NO ESTOY EN PREBATCH                ".                      
075000    03 FILLER               PIC X(40) VALUE                                   
075100             "OCURRIO UN ERROR EN PREBATCH            ".                      
075200    03 FILLER               PIC X(40) VALUE                                   
075300             "HRA O FEC INVALIDA PARA CORRER PREBATCH ".                      
075400    03 FILLER               PIC X(40) VALUE                                   
075500             "BASE AUXILIAR NO INICIALIZADA           ".                      
075600    03 FILLER               PIC X(40) VALUE                                   
075700             "EL PROCESO EN CURSO NO ES PRELINEA      ".                      
075800    03 FILLER               PIC X(40) VALUE                                   
075900             "EL BATCH AUN NO HA TERMINADO            ".                      
076000    03 FILLER               PIC X(40) VALUE                                   
076100             "ERROR AL INICIALIZAR BASE ORIGINAL      ".                      
076200    03 FILLER               PIC X(40) VALUE                                   
076300             "FUNCION INVALIDA                        ".                      
076400    03 FILLER               PIC X(40) VALUE                                   
076500             "ESTOY EN RECUPERACION                   ".                      
076600    03 FILLER               PIC X(40) VALUE                                   
076700             "REGISTRO INEXISTENTE EN LOG             ".                      
076800 01 WS-ERRORES-L010R REDEFINES WS-ERRORES-L010.                               
076900    03 WS-ERR-L010          PIC X(40) OCCURS 17 TIMES.                        
077000 01 WS-MESES.                                                                 
077100    03 FILLER                PIC X(12) VALUE "ENERO     31".                  
077200    03 FILLER                PIC X(12) VALUE "FEBRERO   28".                  
077300    03 FILLER                PIC X(12) VALUE "MARZO     31".                  
077400    03 FILLER                PIC X(12) VALUE "ABRIL     30".                  
077500    03 FILLER                PIC X(12) VALUE "MAYO      31".                  
077600    03 FILLER                PIC X(12) VALUE "JUNIO     30".                  
077700    03 FILLER                PIC X(12) VALUE "JULIO     31".                  
077800    03 FILLER                PIC X(12) VALUE "AGOSTO    31".                  
077900    03 FILLER                PIC X(12) VALUE "SEPTIEMBRE30".                  
078000    03 FILLER                PIC X(12) VALUE "OCTUBRE   31".                  
078100    03 FILLER                PIC X(12) VALUE "NOVIEMBRE 30".                  
078200    03 FILLER                PIC X(12) VALUE "DICIEMBRE 31".                  
078300 01 WS-TABLA-MESES   REDEFINES WS-MESES.                                      
078400    03 WS-TABLA-MESES-DET OCCURS 12 TIMES.                                    
078500       04 WS-MES-CORTO       PIC X(03).                                       
078600       04 WS-FILLER          PIC X(07).                                       
078700       04 WS-DIAS-MES        PIC 9(02).                                       
078800 01 WS-CAMPOS-DELABASE.                                                       
078900    02 WS-STA-DISP                    PIC 9(02).                              
078920    02 WKS-ELI-MEDACC                 PIC 9(01).                              
078940       88 WKS-EM-CTO-DE-TARJETAS      VALUE 1.                                
078942       88 WKS-EM-CTO-DE-TAR-S016      VALUE 2.                                
078950    02 WS-TC-TCAMBIO                  PIC 9(04)V9(04).                        
078960    02 WKS-USA-TIPO-AUT-VA            PIC 9(01).                              
078970       88 WKS-NO-USA-TIPO-AUT         VALUE 0.                                
078980       88 WKS-SI-USA-TIPO-AUT         VALUE 1.                                
079000    02 WS-ELI-MEDACC                   PIC 9(02).                             
079100    02 WS-IND-ELIDISP                   PIC 9(01).                            
079200    02 WS-TIPO-PROCESO                 PIC 9(01).                             
079300       88 WS-TP-LINEA                   VALUE 0.                              
079400       88 WS-TP-BATCH                   VALUE 1, 2.                           
079500    02 WS-CTR-CONTNAUT                  PIC 9(08).                            
079600 01 WS-CAMPOS-MSG.                                                            
079700    02 WS-MSG-COMISION1                 PIC 9(12)V99.                         
079800    02 WS-MSG-COMISION2                 PIC 9(12)V99.                         
079900    02 WS-MSG-IMPTE-BRUTO               PIC 9(14)V99.                         
080400                                                                              
080500** COPIAS DE FORMATO DE TARJETA **                                            
080600 01  WS-REG-MOVTBINTER.                                                       
080700     02 REG-MOVTBINT-CTL-NVO.                                                 
080800        03 MOVTBINT-NUM-SYS-NVO         PIC X(04).                            
080900        03 MOVTBINT-SYST-NVO            PIC 9(07).                            
081000        03 MOVTBINT-FECHA-NVO-TAR       PIC 9(06).                            
081100       03 MOVTBINT-FETAR-RED-NVO REDEFINES MOVTBINT-FECHA-NVO-TAR.            
081200           05 MOVTBINT-TAR-DIA-NVO      PIC 9(02).                            
081300           05 MOVTBINT-TAR-MES-NVO      PIC 9(02).                            
081400           05 MOVTBINT-TAR-ANO-NVO      PIC 9(02).                            
081500        03 MOVTBINT-FECHA-NVO-CAJ       PIC 9(06).                            
081600       03 MOVTBINT-FECAJ-RED-NVO REDEFINES MOVTBINT-FECHA-NVO-CAJ.            
081700           05 MOVTBINT-CAJ-DIA-NVO      PIC 9(02).                            
081800           05 MOVTBINT-CAJ-MES-NVO      PIC 9(02).                            
081900           05 MOVTBINT-CAJ-ANO-NVO      PIC 9(02).                            
082000        03 MOVTBINTER-CTAUNICA-NVO      PIC 9(03).                            
082100        03 MOVTBINT-CSI-NVO             PIC 9(02).                            
082200        03 MOVTBINT-TIP-ARCH            PIC 9(01).                            
082300        03 MOVTBINT-INDICADOR-NVO       PIC 9(01).                            
082400        03 FILLER                       PIC X(210).                           
082405     02 REG-MOVTBINTER-CTLSEM  REDEFINES REG-MOVTBINT-CTL-NVO.                
082410        03 MOVTBINT-NUM-SYS-SEM         PIC X(04).                            
082415        03 MOVTBINT-NOM-SYS-SEM         PIC 9(07).                            
082420        03 MOVTBINT-FEC-SYS-SEM         PIC 9(06).                            
082425        03 MOVTBINT-FEC-SYS-SEM-R REDEFINES MOVTBINT-FEC-SYS-SEM.             
082430           05 MOVTBINT-FEC-DIA-SEM      PIC 9(02).                            
082435           05 MOVTBINT-FEC-MES-SEM      PIC 9(02).                            
082440           05 MOVTBINT-FEC-ANO-SEM      PIC 9(02).                            
082445        03 MOVTBINTER-CTAUNICA-SEM      PIC 9(03).                            
082450        03 MOVTBINT-CSI-SEM             PIC 9(02).                            
082455        03 MOVTBINT-TIP-ARCH-SEM        PIC 9(01).                            
082460        03 FILLER                       PIC 9(06).                            
082465        03 MOVTBINT-INDICADOR-SEM       PIC 9(01).                            
082470        03 FILLER                       PIC X(210).                           
082500     02 REG-MOVTBINTER-NVO  REDEFINES REG-MOVTBINT-CTL-NVO.                   
082600        03 MOVTBINT-CVETRANS-NVO        PIC 9(04).                            
082605*INI EAS FASE 3                                                               
082610           88 MOVTBINT-CVES-NOCONT      VALUE 0001 THRU 0999.                 
082615           88 MOVTBINT-CVES-ABONOS      VALUE 1000 THRU 1999.                 
082620           88 MOVTBINT-CVES-ABOAUT      VALUE 3000 THRU 3999.                 
082625           88 MOVTBINT-CVES-CARGOS      VALUE 2000 THRU 2999.                 
082630           88 MOVTBINT-CVES-CGOAUT      VALUE 4000 THRU 4999.                 
082635           88 MOVTBINT-CVES-D-COMIS     VALUE 0584,0585,                      
082640                                              0613,0615,                      
082645                                              0700,0701.                      
082650           88 MOVTBINT-CVES-D-CGOEXT    VALUE 2131,2132,                      
082655                                              2139.                           
082660*FIN EAS FASE 3                                                               
082700        03 MOVTBINT-NUMTB               PIC 9(16).                            
082800        03 MOVTBINT-TB REDEFINES MOVTBINT-NUMTB.                              
082900           05 MOVTBINT-TB1              PIC 9(04).                            
083000           05 MOVTBINT-TB2              PIC 9(04).                            
083100           05 MOVTBINT-TB3              PIC 9(04).                            
083200           05 MOVTBINT-TB4              PIC 9(04).                            
083220        03 MOVTBINT-CMD REDEFINES MOVTBINT-NUMTB.                             
083240           05 MOVTBINT-BIN              PIC 9(06).                            
083242*             CTAMAX                                                          
083244              88 MOVTINT-BIN-DPAGO            VALUE 854873.                   
083246              88 MOVTINT-BIN-PERFIL-EJECUTIVO VALUE 525678.                   
083260*             88 MOVTINT-BIN-CTAMAE-DLS     VALUE 429505.                     
083265              88 MOVTINT-BIN-TARJ-SKY       VALUE 602089.                     
083266              88 MOVTINT-BIN-VISA-CLASICA   VALUE 520698.                     
083268              88 MOVTINT-BIN-VISA-ORO       VALUE 520694.                     
083269*PERF. UNIV. 88 MOVTINT-BIN-MASTERCARD-GOLD-DEBIT-USE VALUE 524711            
083270              88 MOVTINT-BIN-MASTERCARD-CLA VALUE 441545.                     
083272              88 MOVTINT-BIN-MASTERCARD-ORO VALUE 441549.                     
083274              88 MOVTINT-BIN-CTASREL        VALUE 602089,520698,              
083276                             520694,441545,441549.                            
083278              88 MOVTINT-BIN-TARJPREP       VALUE 554492.                     
083279*INI BSR. PERFILES DOLARES                                                    
083280              88 MOVTINT-BIN-CTAMAE-DLS     VALUE 404313, 522912.             
083281*FIN BSR. PERFILES DOLARES                                                    
083298           05 MOVTBINT-RESTO            PIC 9(10).                            
083300        03 MOVTBINT-NUM-CTE-CM          PIC 9(12) COMP.                       
083400        03 MOVTBINT-NUMCTE-C-M REDEFINES MOVTBINT-NUM-CTE-CM.                 
083500           05 MOVTBINT-NUMCTE-CM        PIC 9(11) COMP.                       
083600           05 MOVTBINT-ROLL-OVER        PIC 9(01) COMP.                       
083700        03 MOVTBINT-IMPBRUTO-NVO        PIC 9(12)V99.                         
083800        03 MOVTBINT-COMIS-NVO           PIC 9(12).                            
083900        03 MOVTBINT-IMPNETO-NVO         PIC 9(12).                            
084000        03 MOVTBINT-FECHMOVAMD-NVO      PIC 9(06) COMP.                       
084100      03 MOVTBINT-MOVFECAMD-NVO REDEFINES MOVTBINT-FECHMOVAMD-NVO.            
084200           05 MOVTBINT-FECMOVAA-NVO     PIC 9(02) COMP.                       
084300           05 MOVTBINT-FECMOVMM-NVO     PIC 9(02) COMP.                       
084400           05 MOVTBINT-FECMOVDD-NVO     PIC 9(02) COMP.                       
084500        03 MOVTBINT-SUCURSAL-NVO        PIC 9(04) COMP.                       
084600        03 MOVTBINT-REFNAL-NVO          PIC 9(05).                            
084700        03 MOVTBINT-FECHPROC-NVO        PIC 9(04).                            
084800        03 MOVTBINT-CVEAUT-NVO          PIC X(01).                            
084900        03 MOVTBINT-NEGPOB-NVO          PIC X(40).                            
085000        03 MOVTBINT-CVEPAIS-NVO         PIC X(03).                            
085100        03 MOVTBINT-IMPDLLS-VNO         PIC 9(08)V99.                         
085200        03 MOVTBINT-REFINTNAL-NVO       PIC X(23).                            
085300   03 MOVTBINT-INTERNACIONAL-NVO REDEFINES MOVTBINT-REFINTNAL-NVO.            
085400           05 MOVTBINT-MICFILM-NVO      PIC X(01).                            
085500           05 MOVTBINT-BCAACEP-NVO      PIC 9(06).                            
085600           05 MOVTBINT-FECHCAP-NVO      PIC 9(04).                            
085700           05 MOVTBINT-LOCFILM-NVO.                                           
085800              07 MOVTBINT-NUMBATCH-NVO  PIC 9(05).                            
085900              07 MOVTBINT-NUMBOLETA-NVO PIC 9(06).                            
086000              07 MOVTBINT-DGTOVERIF-NVO PIC 9(01).                            
086100        03 MOVTBINT-CODMONEDA-NVO       PIC 9(03).                            
086200        03 MOVTBINT-CVE-CONFLIN         PIC 9(01).                            
086300        03 MOVTBINT-REF-SECLIN          PIC 9(06) COMP.                       
086305*          88 MOVTBINT-CVES-NOCONT      VALUE 000001 THRU 000999.             
086310*          88 MOVTBINT-CVES-ABONOS      VALUE 001000 THRU 001999.             
086315*          88 MOVTBINT-CVES-ABOAUT      VALUE 003000 THRU 003999.             
086320*          88 MOVTBINT-CVES-CARGOS      VALUE 002000 THRU 002999.             
086325*          88 MOVTBINT-CVES-CGOAUT      VALUE 004000 THRU 004999.             
086350*          88 MOVTBINT-CVES-D-COMIS     VALUE 000584,000585,                  
086355*                                             000613,000615,                  
086356*                                             000700,000701.                  
086360*          88 MOVTBINT-CVES-D-CGOEXT    VALUE 002131,002132,                  
086370*                                             002139.                         
086400        03 MOVTBINT-TAR-CAJ             PIC 9(01).                            
086450        03 MOVTBINT-ID-NEGOCIO          PIC 9(08).                            
086452*INI-STEFANINI TIPO DE CAMBIO                                                 
086454        03 MOVTBINT-TC-BANXICO          PIC 9(05)V9(06).                      
086456        03 MOVTBINT-MARK-UP-EMISOR      PIC 9(04)V9(04).                      
086458        03 MOVTBINT-TC-VALMER           PIC 9(05)V9(06).                      
086460*INI EAS FASE 3                                                               
086465        03 MOVTBINT-IMPTAUT-NVO         PIC 9(12)V99.                         
086470        03 MOVTBINT-ORIGEAS-NVO         PIC 9(02).                            
086475*       03 FILLER                       PIC X(23).                            
086480*FIN EAS FASE 3                                                               
086482*INI EAS FASE 4                                                               
086484        03 MOVTBINT-INSTITUCION-ID-NVO    PIC 9(04).                          
086486        03 MOVTBINT-INTAPLICACION-ID-NVO  PIC 9(04).                          
086488        03 MOVTBINT-INTAUTH-CODE-NVO      PIC X(06).                          
086490        03 FILLER                         PIC X(09).                          
086492*FIN EAS FASE 4                                                               
086494*FIN-STEFANINI TIPO DE CAMBIO                                                 
086500     02 REG-MOVTBINT-TRAIL REDEFINES REG-MOVTBINT-CTL-NVO.                    
086600        03 MOVTBINT-TTREG               PIC X(01).                            
086700        03 MOVTBINT-NUMREG              PIC 9(06) COMP.                       
086800        03 MOVTBINT-TOTBRUTO            PIC 9(12)V99 COMP.                    
086900        03 MOVTBINT-TOTCOMIS            PIC 9(14) COMP.                       
087000        03 MOVTBINT-TOTNETO             PIC 9(14) COMP.                       
087100        03 FILLER                       PIC X(215).                           
087200*** FORMATO DE DIALOGO CON LA LIB. CTESPROD*****                              
087500                                                                              
090000*** VARIABLES PARA MANEJO DE DISPLAYS                     ****                
090100 01 WKS-VARS-DISPLAYS.                                                        
090200    02 WKS-TIPO-LJ                        PIC X.                              
090300    02 WKS-CODIGO-LJ                      PIC 9(06).                          
090400    02 WKS-DISP87-FECARC                  PIC 9(06).                          
090500    02 WKS-DIS152-FECARC                  PIC 9(06).                          
090550    02 WKS-SDOPEN-FECARC                  PIC 9(08).                          
090555    02 WKS-SDOPEN-NUMCOPY                 PIC 9(02).                          
090600    02 WKS-MOVTBINT-TOTBRUTO              PIC 9(12)V99.                       
090700    02 WKS-COMS-OUT-STATUS-KEY            PIC 9(10).                          
090800    02 WKS-ESPERACOMS-TIPO-EVENTO         PIC 9(10).                          
090900    02 WKS-DMCATEGORY                     PIC 9(03).                          
091000    02 WKS-DMERRORTYPE                    PIC 9(03).                          
091100    02 WKS-DMSTRUCTURE                    PIC 9(03).                          
091200    02 WKS-COMS-IN-STATUS-KEY             PIC 9(08).                          
091300                                                                              
106900 01 AREA-TARIFAS-COMUN      WITH LOWER-BOUNDS.                                
107000    02 WS-TARIFA-FUNCION    PIC 9(02).                                        
107100    02 WS-TARIFA-INST       PIC 9(04).                                        
107200    02 WS-TARIFA-PERS       PIC 9(02).                                        
107300    02 WS-TARIFA-FECHA      PIC 9(06).                                        
107400    02 WS-TARIFA-MONEDA     PIC 9(02).                                        
107500    02 WS-TARIFAS-ADA-NVAS.                                                   
107600       03 WS-TARIFA-APERT    PIC 9(08)V99 COMP.                               
107700       03 WS-TARIFA-ANIV     PIC 9(08)V99 COMP.                               
107800       03 WS-TARIFA-MANEJO   PIC 9(08)V99 COMP.                               
107900       03 WS-TARIFA-SDOMAN   PIC 9(08)V99 COMP.                               
108000       03 WS-TARIFA-CHQGIR   PIC 9(08)V99 COMP.                               
108100       03 WS-TARIFA-SDOCHQ   PIC 9(08)V99 COMP.                               
108200       03 WS-TARIFA-RETCAJ   PIC 9(08)V99 COMP.                               
108300       03 WS-TARIFA-CONCAJ   PIC 9(08)V99 COMP.                               
108400       03 WS-TARIFA-CONVEN   PIC 9(08)V99 COMP.                               
108500       03 WS-TARIFA-DEV54    PIC 9(08)V99 COMP.                               
108600       03 WS-TARIFA-DVENT    PIC 9(08)V99 COMP.                               
108700       03 WS-TARIFA-CHEXEN   PIC 9(06).                                       
108800    02 FILLER                PIC X(1058).                                     
108900 01 WS-TARIFA-RESULT         PIC S9(11)   COMP.                               
108910                                                                              
109002 01 WKS-VARIABLES-CTAMAE-DLS.                                                 
109004    02 WKS-MOVTO-A-CTAMAE-VA      PIC 9(01).                                  
109006       88 WKS-MOVTO-A-CTAMAEMN-EN-MN      VALUE 1.                            
109008       88 WKS-MOVTO-A-CTAMAEDLS-EN-MN     VALUE 2.                            
109010       88 WKS-MOVTO-A-CTAMAEDLS-EN-DLS    VALUE 3.                            
109012    02 WKS-IND-MONEDA             PIC 9(01).                                  
109014    02 WKS-IND-TOTREC-PIM         PIC 9(01).                                  
109016                                                                              
109100**********************************************                                
109200* COPY DE VARIABLES THE CALENDAR             *                                
109300**********************************************                                
109400 77  WS-FUNCION                      PIC S9(11) BINARY.                       
109500 77  WS-FORMATO                      PIC S9(11) BINARY.                       
109600 01  WS-FECHA1                       PIC 9(08).                               
110100 01  WS-FECHA1-A   REDEFINES WS-FECHA1 PIC X(08).                             
110200 01  WS-FECHA2                         PIC 9(08).                             
111800********************FIN THE CALENDAR****************************              
112000 01 WS-FECHA-LIN                  PIC 9(08).                                  
112010 01 WS-FECHA-LIN-R REDEFINES WS-FECHA-LIN.                                    
112020     02 WS-FEC-LIN-AAAA           PIC 9(04).                                  
112030     02 WS-FEC-LIN-MM             PIC 9(02).                                  
112040     02 WS-FEC-LIN-DD             PIC 9(02).                                  
112050                                                                              
113610 01 WKS-FEC-MAQ-MDA                    PIC 9(06).                             
113620 01 WKS-FEC-MAQ-MDA-R REDEFINES WKS-FEC-MAQ-MDA.                              
113630    02 WKS-FEC-MAQ-MDA-MM              PIC 9(02).                             
113640    02 WKS-FEC-MAQ-MDA-DD              PIC 9(02).                             
113650    02 WKS-FEC-MAQ-MDA-AA              PIC 9(02).                             
113660                                                                              
114700                                                                              
114800 77 WS-ERROR                        PIC 9(02).                                
114900 01 WS-ERROR-MOVSCM .                                                         
115000    02  WS-AC-MOVSCM                PIC X.                                    
115100    02  WS-APLI-MOVSCM              PIC 9.                                    
115200    02  WS-FIN-MOVSCM               PIC 9.                                    
115202****************************************************************              
115204*   VARIABLES PARA RUTINA DE PROYECCION DE FECHAS PARA         *              
115206*   PROXIMOS ARCHIVOS A DISPERSAR                              *              
115208****************************************************************              
115210 01 WKS-SIG-FECS-A-DISP.                                                      
115212    02 WKS-ARCH-A-DISP                    PIC 9(02) COMP.                     
115214       88 WKS-PROYECTO-FEC-87             VALUE 1.                            
115216       88 WKS-PROYECTO-FEC-152            VALUE 2.                            
115218       88 WKS-PROYECTO-FEC-TAR            VALUE 3.                            
115220       88 WKS-PROYECTO-FEC-TARSEM         VALUE 4.                            
115222    02 WKS-FEC-A-PROYECTAR-AAMD           PIC 9(08).                          
115224    02 WKS-FEC-A-PROYECTAR-AAMD-R REDEFINES                                   
115226                                  WKS-FEC-A-PROYECTAR-AAMD.                   
115228       03 WKS-FEC-A-PROY-AAAA             PIC 9(04).                          
115230       03 WKS-FEC-A-PROY-MM               PIC 9(02).                          
115232       03 WKS-FEC-A-PROY-DD               PIC 9(02).                          
115234    02 WKS-FEC-PROYECTADA-AAMD            PIC 9(08).                          
115236    02 WKS-FEC-PROYECTADA-AAMD-R REDEFINES                                    
115238                                 WKS-FEC-PROYECTADA-AAMD.                     
115240       03 WKS-FEC-PROY-AAAA               PIC 9(04).                          
115242       03 WKS-FEC-PROY-MM                 PIC 9(02).                          
115244       03 WKS-FEC-PROY-DD                 PIC 9(02).                          
115246    02 WS-FECHA-CAL1                      PIC 9(08).                          
115248    02 WS-FECHA-CAL2                      PIC 9(08).                          
115250    02 WS-CONTADOR1                       PIC 9(02).                          
115252    02 WS-CONTADOR2                       PIC 9(02).                          
115254    02 WKS-FIN-DE-SEMANA                  PIC 9(02).                          
115256                                                                              
115300******************************************************************            
115310*         ERRORES                                                *            
115320******************************************************************            
115330 01 WKS-ERRORES.                                                              
115340    02 ERROR-0001                      PIC X(44) VALUE                        
115350       "ERROR DE VERSIONES Y SE DECIDE NO SEGUIR0001".                        
115360    02 ERROR-0002                      PIC X(44) VALUE                        
115370       "ERROR NO SE PERMITE DISPERSAR EN BATCH  0002".                        
115380    02 ERROR-0003                      PIC X(44) VALUE                        
115390       "STATUS DE DISPERSION SDO PEND INVALIDO  0003".                        
115400    02 ERROR-0004                      PIC X(44) VALUE                        
115410       "NO SE PUDO ABRIR LA BASE DE DATOS       0004".                        
115420    02 ERROR-0005                      PIC X(44) VALUE                        
115430       "ERROR AL LEER EL REGISTRO B02 DE LA BASE0005".                        
115440    02 ERROR-0006                      PIC X(44) VALUE                        
115450       "ERROR AL HACER LOCK A REGISTRO B02      0006".                        
115460    02 ERROR-0007                      PIC X(44) VALUE                        
115470       "ERROR AL HACER STORE A REGISTRO B02     0007".                        
115480    02 ERROR-0008                      PIC X(44) VALUE                        
115490       "ERROR EN BEGIN TRANSACTION              0008".                        
115500    02 ERROR-0009                      PIC X(44) VALUE                        
115510       "ERROR EN END TRANSACTION                0009".                        
115520    02 ERROR-0010                      PIC X(44) VALUE                        
115530       "ERROR EN END TRANSACTION SYNC           0010".                        
115540    02 ERROR-0011                      PIC X(44) VALUE                        
115550       "ERROR AL CERRAR LA BASE DE DATOS        0011".                        
115560    02 ERROR-0012                      PIC X(44) VALUE                        
115570       "ERROR AL GRABAR REG HEADER ORDENADO-CM  0012".                        
115580    02 ERROR-0013                      PIC X(44) VALUE                        
115590       "ERROR AL GRABAR REG HEADER ORDENADO-SP  0013".                        
115600    02 ERROR-0014                      PIC X(44) VALUE                        
115610       "ERROR AL GRABAR REG HEADER CTRLARCH     0014".                        
115620    02 ERROR-0015                      PIC X(44) VALUE                        
115630       "                                        0015".                        
115640    02 ERROR-0016                      PIC X(44) VALUE                        
115650       "                                        0016".                        
115660    02 ERROR-0017                      PIC X(44) VALUE                        
115670       "                                        0017".                        
115680    02 ERROR-0018                      PIC X(44) VALUE                        
115690       "                                        0018".                        
115700    02 ERROR-0019                      PIC X(44) VALUE                        
115710       "                                        0019".                        
115720    02 ERROR-0020                      PIC X(44) VALUE                        
115730       "                                        0020".                        
115740    02 ERROR-NNNN                      PIC X(44) VALUE                        
115750       "                                        NNNN".                        
115760                                                                              
115770 01 WKS-TABLA-ERRORES REDEFINES WKS-ERRORES.                                  
115780    02 WKS-TBL-ERRORES OCCURS 21.                                             
115790       03 WKS-ERROR-TXT                   PIC X(40).                          
115800       03 WKS-ERROR-NUM                   PIC 9(04).                          
115810                                                                              
115820 01 WKS-ERROR-PROCESO-VA                  PIC 9(04).                          
115830    88 WKS-PROCESO-SIN-ERROR              VALUE 0.                            
115840    88 WKS-PROCESO-CON-ERROR              VALUE 1 THRU 100.                   
115841                                                                              
115842 01 WKS-FILE-ERROR-VA                     PIC 9(04).                          
115843*   ESTE ERROR SE USA PARA CUANDO SE ESTAN PROCESANDO LOS ARCHIVOS            
115844*   Y POR ALGUNA RAZON "ESE" ARCHIVO EN ESPECIAL NO SE PUEDE METER            
115845*   AL ORDENADO, PERO NO ES UN ERROR PARA DESCONTINUAR EL PROCESO,            
115846*   ( SIEMPRE Y CUANDO SUCEDA EN LA VALIDACION DEL HEADER ) ES MAS            
115847*   BIEN PARA INTENTAR METER OTRO ARCHIVO. LOS ARCHIVOS O SE METEN            
115848*   COMPLETOS O TRUENA AHORA SI EL PROCESO DE DISPERSION, EL P015.            
115849    88 WKS-FILE-SIN-ERROR                 VALUE 0.                            
115850    88 WKS-FILE-CON-ERROR                 VALUE 1.                            
115851                                                                              
115860 01 WKS-TIPO-DISPERSION                   PIC 9(01).                          
115870*   EN ESTA DISPERSION SE INTENTA DISPERSAR LOS MOVIMIENTOS PROVE-            
115880*   NIENTES DEL S087, DEL S152 Y DE TARJETAS.                                 
115890    88 WKS-DISPERSO-MOVTOS                VALUE 1.                            
115900*   EN ESTA DISPERSION SE  INTENTA  DISPERSAR  LA  LIBERACION  DEL            
115910*   SALDO PENDIENTE,                                                          
115920*                                                                             
115930    88 WKS-DISPERSO-SDOPEND               VALUE 2.                            
115940 01 WKS-LIBGLOBAL-SDOPEND                 PIC 9(01).                          
115950*   CUANDO SE LIBERA EL SALDO PENDIENTE A NIVEL GLOBAL  ( PANTALLA            
115960*   Q050000) SE PONE UN 1 AL INDICADOR B02-LIBERA-SDOPEN Y  CUANDO            
115970*   SE TERMINA LA DISPERSION DE LIBERACION DE SALDO  PENDIENTE  SE            
115980*   PONE UN 2, EN EL PREBATCH SE INICIALIZA A 0.                              
115990    88 WKS-LG-SP-NO-INICIADA              VALUE 0.                            
116000    88 WKS-LG-SP-INICIADA                 VALUE 1.                            
116010    88 WKS-LG-SP-CONCLUIDA                VALUE 2.                            
116020 01 WKS-STA-DISP-LSDO                     PIC 9(01).                          
116030*   ESTE INDICADOR QUE SE GUARDA EN EL CAMPO B02-STA-DISP-LSDO NOS            
116040*   INDICA EL ESTADO DE LA DISPERSION DEL ARCHIVO DE SALDO PENDIEN            
116050*   TE, PARA EL CASO DE UN REINICIO, CREAR NUEVAMENTE EL ARCHIVO O            
116060*   SOLO REINICIAR DISPERSANDO EL ARCHIVO.                                    
116070    88 WKS-DISPER-SP-NOHACORRIDO          VALUE 0.                            
116080    88 WKS-DISPER-SP-INICIA               VALUE 1.                            
116090    88 WKS-DISPER-SP-ARCHPDISP            VALUE 2.                            
116100    88 WKS-DISPER-SP-CONCLUIDA            VALUE 3.                            
116110 01 WKS-TABLA-STATUS-LG-SP.                                                   
116120    02 FILLER                             PIC X(54) VALUE                     
116130       "NO HA CORRIDO DISPERSION DEL SALPEND LIBERADO GLOBAL  ".              
116140    02 FILLER                             PIC X(54) VALUE                     
116150       "YA SE INICIO LA DISPERSION DEL SALPEND LIBERADO GLOBAL".              
116160    02 FILLER                             PIC X(54) VALUE                     
116170       "YA SE TIENE ARCHIVO PARA DISPERSAR EL SALDO PENDIENTE ".              
116180    02 FILLER                             PIC X(54) VALUE                     
116190       "YA TERMINO DISPERSION DEL ARCHIVO DE SALDO PENDIENTE  ".              
116200    02 FILLER                             PIC X(54) VALUE                     
116210       "STATUS INCORRECTO                                     ".              
116220 01 WKS-TABLA-STA-LG-SP-R REDEFINES WKS-TABLA-STATUS-LG-SP.                   
116230    02 WKS-TBL-STA-LG-SP  OCCURS 5 TIMES  PIC X(54).                          
116240 01 WKS-STATUS-BD-VA                      PIC 9(01).                          
116250    88 WKS-BD-ABIERTA                     VALUE 1.                            
116260 01 WKS-MPD-PRUEBAS-VA                    PIC 9(01).                          
116270    88 WKS-MPD-PRUEBAS                    VALUE 1.                            
116280 01 WKS-NUEVO-ORDENADO-VA                 PIC 9(01).                          
116290*   ESTE VALOR  SE  DA  CUANDO  CUALQUIERA  DE  LOS  DOS  ARCHIVOS            
116300*   ORDENADO CM O SP SE GENERAN DESDE CERO Y HAY QUE METERLES                 
116310*   ARCHIVOS A DISPERSAR.                                                     
116320    88 WKS-NUEVO-ORDENADO                 VALUE 1,2.                          
116330    88 WKS-NUEVO-ORD-CM                   VALUE 1.                            
116340    88 WKS-NUEVO-ORD-SP                   VALUE 2.                            
116350                                                                              
116360 01 WKS-EXISTE-ORD-X-DISPER               PIC 9(01).                          
116370*   ESTE VALOR SE DA CUANDO CUALQUIERA DE LOS DOS  ARCHIVOS  ESTAN            
116380*   GENERADOS Y LISTOS PARA DISPERSAR.                                        
116390    88 WKS-HAY-ORDENADO-A-DISPERSAR       VALUE 1,2.                          
116400    88 WKS-HAY-ORD-CM-A-DISPERSAR         VALUE 1.                            
116410    88 WKS-HAY-ORD-SP-A-DISPERSAR         VALUE 2.                            
116420                                                                              
116430 01 WKS-EOF-S087-VA                       PIC 9(02).                          
116440    88 WKS-EOF-S087                       VALUE 1.                            
116450 01 WKS-EOF-S152-VA                       PIC 9(02).                          
116460    88 WKS-EOF-S152                       VALUE 1.                            
116470 01 WKS-EOF-TARJ-VA                       PIC 9(02).                          
116480    88 WKS-EOF-TARJ                       VALUE 1.                            
116490 01 WKS-EOF-TARS-VA                       PIC 9(02).                          
116500    88 WKS-EOF-TARS                       VALUE 1.                            
116510 01 WKS-EOF-SDOP-VA                       PIC 9(02).                          
116520    88 WKS-EOF-SDOP                       VALUE 1.                            
116530 01 WKS-EOF-SORT-CM-VA                    PIC 9(02).                          
116540    88 WKS-EOF-SORT-CM                    VALUE 1.                            
116550 01 WKS-EOF-SORT-SP-VA                    PIC 9(02).                          
116560    88 WKS-EOF-SORT-SP                    VALUE 1.                            
116570                                                                              
118000 01 WKS-VARS-SDOPEND.                                                         
118010    02 WKS-NUM-SDOPEN                     PIC 9(08).                          
118020    02 WKS-IMP-SDOPEN                     PIC 9(12)V99.                       
118022    02 WKS-IND-ARCH-SP                    PIC 9(02).                          
118030                                                                              
118700 01 WKS-TXT-RSP-HEADER.                                                       
118702       03 WKS-TXT-RSP-HDR-TIP-REG         PIC 99B.                            
118704       03 WKS-TXT-RSP-HDR-FEC             PIC 9(08)B.                         
118706       03 WKS-TXT-RSP-HDR-HRA-MAQ         PIC 9(08)B.                         
118708       03 WKS-TXT-RSP-HDR-FEC-MAQ         PIC 9(08)B.                         
118710       03 WKS-TXT-RSP-HDR-CSI-ORI         PIC 9(02)B.                         
118712       03 WKS-TXT-RSP-HDR-CSI-DES         PIC 9(02)B.                         
118713       03 WKS-TXT-RSP-HDR-NUMCOPY         PIC 9(02)B.                         
118714                                                                              
118716 01 WKS-TXT-RSP-MOVTOS.                                                       
118718       03 WKS-TXT-RSP-MOV-TIP-REG         PIC 99B.                            
118720       03 WKS-TXT-RSP-MOV-MDA             PIC 9(02)B.                         
118722       03 WKS-TXT-RSP-MOV-SUC-MDA         PIC 9(04)B.                         
118724       03 WKS-TXT-RSP-MOV-CONTRATO        PIC 9(12)B.                         
118726       03 WKS-TXT-RSP-MOV-CLAVE           PIC 9(04)B.                         
118728       03 WKS-TXT-RSP-MOV-IMPORTE         PIC 9(12)V99B.                      
118730       03 WKS-TXT-RSP-MOV-PROD            PIC 9(04)B.                         
118732       03 WKS-TXT-RSP-MOV-INST            PIC 9(04)B.                         
118734       03 WKS-TXT-RSP-MOV-MONEDA          PIC 9(04)B.                         
118736       03 WKS-TXT-RSP-MOV-IND-LEY         PIC 9(02)B.                         
118738       03 WKS-TXT-RSP-MOV-LEYENDA         PIC X(40).                          
118740                                                                              
118742 01 WKS-TXT-RSP-TRL.                                                          
118744       03 WKS-TXT-RSP-TRL-TIP-REG         PIC 99B.                            
118746       03 WKS-TXT-RSP-TRL-NUM-REGS        PIC 9(08)B.                         
118748       03 WKS-TXT-RSP-TRL-IMP             PIC 9(16)V99B.                      
118750                                                                              
118752                                                                              
118800 01  FILE-OPER.                                                               
118900     03 FILE-OP-APLICO  PIC X(10) VALUE SPACES.                               
119000     03 FILE-OP         PIC X(27).                                            
119100     03 OP-FILE REDEFINES FILE-OP.                                            
119200        05 FILE-OP-TB   PIC X(24).                                            
119300        05 FILE-OP-CSI  PIC X(03).                                            
119400     03 FILLER          PIC X(01) VALUE SPACES.                               
119500     03 FILE-OP-FEC     PIC 9(06).                                            
119600     03 FILE-RESTO      PIC X(7) VALUE SPACES.                                
119700     03 FILE-RESTO-R REDEFINES FILE-RESTO.                                    
119800        05 FILE-FILLER1 PIC X(01).                                            
119900        05 FILE-OP-FEC-CAJ PIC 9(6).                                          
120000     03 FILE-OP-LEYENDA    PIC X(25) VALUE SPACES.                            
120100     03 FILE-OP-LEYTRAIL   PIC X(08) VALUE SPACES.                            
120200     03 FILLER             PIC X     VALUE SPACES.                            
120300     03 FILE-OP-TRAILER    PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ.                           
120400     03 FILE-OP-LEYARCH    PIC X(08) VALUE SPACES.                            
120500     03 FILLER             PIC X     VALUE SPACES.                            
120600     03 FILE-OP-ARCHIVO    PIC ZZZZ,ZZZ,ZZZ,ZZZ.ZZ.                           
124610**************************************************                            
124615*         VARS PARA HI DE AVANCE DE ARCHIVO EN PROCESO                        
124620 01 WKS-VAR-PROCESO.                                                          
124625    02 WKS-ARCH-EN-PROCESO        PIC X(42).                                  
124630    02 WKS-ARCH-EN-PROCESO-PORC   PIC Z9.99.                                  
124635    02 WKS-REG-ACTUAL             PIC 9(10).                                  
124640    02 WKS-REG-ULTIMO             PIC 9(10).                                  
124678                                                                              
124700**************************************************                            
124800* ARCHIVOS APLICADOS POR DISPERSION                                           
124900 01 WS-ARCH-APLI.                                                             
125000    02 WS-ARCH-IND2        PIC 9(04).                                         
125050    02 WS-ARCH-INDI        PIC 9(04).                                         
125100    02 WS-ARCH-IND3        PIC 9(04).                                         
125150    02 WS-ARCH-IND4        PIC 9(04).                                         
125200    02 WS-ARCH-IND1        PIC 9(04).                                         
125300    02 WS-ARCH-IND         PIC 9(04).                                         
125400    02 WS-ARCH-STATUS      PIC 9(04).                                         
125500    02 WS-ARCH-TABLA OCCURS 50 TIMES.                                         
125600       03 WS-ARCH-MACC     PIC 9(02).                                         
125700       03 WS-ARCH-FECHA    PIC 9(08).                                         
125800       03 WS-ARCH-ABOCON   PIC 9(12)V99.                                      
125900       03 WS-ARCH-CARCON   PIC 9(12)V99.                                      
126000       03 WS-ARCH-ABONCON  PIC 9(12)V99.                                      
126100       03 WS-ARCH-CARNCON  PIC 9(12)V99.                                      
126200 01 WS-B02CONTROL.                                                            
126300    02 WS-ULT-ARCH-APLI    PIC 9(08) OCCURS 30 TIMES.                         
126302                                                                              
126305  01 WS-ULT-ARCH-APLI4-S111   PIC 9(08).                                      
126307  01 WS-ULT-ARCH-APLI24-EAS   PIC 9(08).                                      
126308 77 WS-B02-DECOM-S111      PIC 9(02) .                                        
126309                                                                              
126310*****************************************************************             
126315*  WFL EJECUCION                                                *             
126320*****************************************************************             
126325                                                                              
126330 01 WS-EJECUTA-P121          PIC 9(01).                                       
126335    88 WS-88-EJECUTA-P121       VALUE 1.                                      
126340 01 WS-WFL-P121.                                                              
126345    02 FILLER                PIC X(11) VALUE "BEGIN JOB; "     .              
126350    02 FILLER                PIC X(06) VALUE "START "          .              
126355    02 WS-TIT-LOTE-P121      PIC X(41)                         .              
126360    02 FILLER                PIC X(01) VALUE "("               .              
126365    02 FILLER                PIC X(01) VALUE QUOTES            .              
126370    02 FILLER                PIC X(16) VALUE "CORRESOLO P121 1".              
126375    02 FILLER                PIC X(01) VALUE QUOTES            .              
126380    02 FILLER                PIC X(03) VALUE "); "             .              
126385    02 FILLER                PIC X(08) VALUE "END JOB."        .              
126390                                                                              
126400                                                                              
130000******************************************************************            
130010*         DISPLAYÀS CON LA LIBRERIA LJ                           *            
130100******************************************************************            
130200 01 WS-DISPLAYS.                                                              
130220    02 FILLER-D-0001                      PIC X(47) VALUE                     
130240       "INICIO DE PROCESO                       E020101".                     
130260    02 FILLER-D-0002                      PIC X(47) VALUE                     
130280       "FIN NORMAL DE PROCESO                   E020201".                     
130300    02 FILLER-D-0003                      PIC X(47) VALUE                     
130320       "FIN ANORMAL DE PROCESO                  I020202".                     
130340    02 FILLER-D-0004                      PIC X(47) VALUE                     
130360       "ERROR EN CALL SOPCOM                    E020901".                     
130380    02 FILLER-D-0005                      PIC X(47) VALUE                     
130400       "ERROR EN CALL CTLVERS AL ASIGNAR NAMELIBE020901".                     
130420    02 FILLER-D-0006                      PIC X(47) VALUE                     
130440       "ERROR AL ABRIR LA BASE DEL S500         I010101".                     
130460    02 FILLER-D-0007                      PIC X(47) VALUE                     
130480       "ERROR AL LEER REGISTRO B02 DE LA BASE   I010201".                     
130500    02 FILLER-D-0008                      PIC X(47) VALUE                     
130520       "ERROR AL HACER LOCK A REGISTRO B02      I010104".                     
130540    02 FILLER-D-0009                      PIC X(47) VALUE                     
130560       "ERROR AL HACER STORE A REGISTRO B02     I010105".                     
130580    02 FILLER-D-0010                      PIC X(47) VALUE                     
130600       "ERROR EN BEGIN-TRANSACTION              I010201".                     
130620    02 FILLER-D-0011                      PIC X(47) VALUE                     
130640       "ERROR EN END-TRANSACTION                I010201".                     
130660    02 FILLER-D-0012                      PIC X(47) VALUE                     
130680       "ERROR EN END-TRANSACTION SYNC           I010201".                     
130700    02 FILLER-D-0013                      PIC X(47) VALUE                     
130720       "ERROR AL CERRAR LA BASE DEL S500        I010102".                     
130740    02 FILLER-D-0014                      PIC X(47) VALUE                     
130760       "ERROR AL GRABAR EN ARCHIVO ORDENADO-CM  I010105".                     
130780    02 FILLER-D-0015                      PIC X(47) VALUE                     
130800       "ERROR AL LEER REGISTRO                  I010106".                     
130802    02 FILLER-D-0016                      PIC X(47) VALUE                     
130804       "                                        E010106".                     
133900                                                                              
134000 01  WS-TABLA-DISPLAYS REDEFINES WS-DISPLAYS.                                 
134010     03 WS-TBL-DISPLAYS OCCURS 16.                                            
134020        05 WS-DISP-TEXTO                   PIC X(40).                         
134030        05 WS-DISP-TIPO                    PIC X(01).                         
134040        05 WS-DISP-CODIGO                  PIC 9(06).                         
134044                                                                              
134046 01  WKS-FLAG-PROCTJ                       PIC 9(1).                          
134047        88 WS-FLAG-INTERDIA                VALUE 0.                           
134048        88 WS-FLAG-INTERDIASEM             VALUE 1.                           
134049                                                                              
134050  01  WKS-FLAG-PROYFEC                      PIC 9(1).                         
134051  01  WKS-FLAG-PROCTJEAS                    PIC 9(1).                         
134052  01  WKS-FLAG-PROCTJSEM                    PIC 9(1).                         
134053                                                                              
134060 77  WS-NO-DISPLAY                         PIC 9(11) BINARY.                  
134070 77  WS-DISP-ADICIONAL                     PIC X(30).                         
134071                                                                              
134072 01 WS-TABLA-ERRORES.                                                         
134073    03 ERROR-0001                          PIC X(54) VALUE                    
134074       "SISTEMA ORIGEN NO DADO DE ALTA                    1913".              
134075    03 ERROR-0002                          PIC X(54) VALUE                    
134076       "CLAVE INEXISTENTE                                 1901".              
134077    03 ERROR-0003                          PIC X(54) VALUE                    
134078       "SUCURSAL TRANSMISORA INVALIDA                     2003".              
134079    03 ERROR-0004                          PIC X(54) VALUE                    
134080       "                                                      ".              
134081    03 ERROR-0005                          PIC X(54) VALUE                    
134082       "SUCURSAL PROMOTORA INVALIDA                       1002".              
134083    03 ERROR-0006                          PIC X(54) VALUE                    
134084       "P.F. REINTENTE MAS TARDE, CONTRATO OCUPADO        1903".              
134085    03 ERROR-0007                          PIC X(54) VALUE                    
134086       "                                                      ".              
134087    03 ERROR-0008                          PIC X(54) VALUE                    
134088       "                                                  2008".              
134089    03 ERROR-0009                          PIC X(54) VALUE                    
134090       "CODIGO DESTINO DE SA0 INVALIDO                    1411".              
134091    03 ERROR-0010                          PIC X(54) VALUE                    
134092       "BASE DE DATOS EN MAL ESTADO                       2010".              
134093    03 ERROR-0011                          PIC X(54) VALUE                    
134094       "                                                      ".              
134095    03 ERROR-0012                          PIC X(54) VALUE                    
134096       "CONTRATO BLOQUEADO                                1102".              
134097    03 ERROR-0013                          PIC X(54) VALUE                    
134098       "CONTRATO CANCELADO                                1103".              
134099    03 ERROR-0014                          PIC X(54) VALUE                    
134100       "                                                      ".              
134101    03 ERROR-0015                          PIC X(54) VALUE                    
134102       "IMPORTE MAYOR AL LIMITE DE LA LINEA DE SOBREGIRO  1112".              
134103    03 ERROR-0016                          PIC X(54) VALUE                    
134104       "                                                      ".              
134105    03 ERROR-0017                          PIC X(54) VALUE                    
134106       "FECHA DE DISPOSICION > A FECHA LIMITE             1441".              
134107    03 ERROR-0018                          PIC X(54) VALUE                    
134108       "LIBRERIA DE CREDITO NO HABILITADA                 1443".              
134109    03 ERROR-0019                          PIC X(54) VALUE                    
134110       "PROBLEMAS CON LINEAS DE CREDITO                   1416".              
134111    03 ERROR-0020                          PIC X(54) VALUE                    
134112       "CLAVE NO PERMITIDA PARA ESTE INSTRUMENTO          1010".              
134113    03 ERROR-0021                          PIC X(54) VALUE                    
134114       "                                                      ".              
134115    03 ERROR-0022                          PIC X(54) VALUE                    
134116       "NUMERO DE REFERENCIA INVALIDA                     1115".              
134117    03 ERROR-0023                          PIC X(54) VALUE                    
134118       "EL CONTRATO NO RECIBE ABONOS                      1109".              
134119    03 ERROR-0024                          PIC X(54) VALUE                    
134120       "EL CONTRATO SOLO RECIBE ABONOS POR TRASPASO       1007".              
134121    03 ERROR-0025                          PIC X(54) VALUE                    
134122       "EL CONTRATO NO RECIBE MOVIMIENTOS DE NINGUN TIPO  1107".              
134123    03 ERROR-0026                          PIC X(54) VALUE                    
134124       "MOVIMIENTO DUPLICADO                              1413".              
134125    03 ERROR-0027                          PIC X(54) VALUE                    
134126       "FALTA DE INTEGRIDAD BASE DE DATOS                 2027".              
134127    03 ERROR-0028                          PIC X(54) VALUE                    
134128       "PANTALLA INVALIDA PARA SISTEMA DE CAPTACION       2028".              
134129    03 ERROR-0029                          PIC X(54) VALUE                    
134130       "SE DETECTO UN NUMERO DE ERROR FUERA DE RANGO      2029".              
134131    03 ERROR-0030                          PIC X(54) VALUE                    
134132       "AL EDITAR UN NUMERO ENTERO                        2030".              
134133    03 ERROR-0031                          PIC X(54) VALUE                    
134134       "AL EDITAR UN NUMERO CON 2 DECIMALES               2031".              
134135    03 ERROR-0032                          PIC X(54) VALUE                    
134136       "AL EDITAR UN NUMERO CON 3 DECIMALES               2032".              
134137    03 ERROR-0033                          PIC X(54) VALUE                    
134138       "CODIGO NO CORRESPONDE A LA NATURALEZA DE LA CVE.  1412".              
134139    03 ERROR-0034                          PIC X(54) VALUE                    
134140       "MOVIMIENTO LOCAL NO PERMITIDO PARA ESTA OFICINA   2034".              
134141    03 ERROR-0035                          PIC X(54) VALUE                    
134142       "MOVIMIENTO FORANEO NO PERMITIDO PARA ESTA OFICINA 2035".              
134143    03 ERROR-0036                          PIC X(54) VALUE                    
134144       "EL INST. NO RECIBE MOVTOS DE ESTE MEDIO DE ACCESO 2036".              
134145    03 ERROR-0037                          PIC X(54) VALUE                    
134146       "FALTA NUMERO DE AUTORIZACION                      2037".              
134147    03 ERROR-0038                          PIC X(54) VALUE                    
134148       "NUMERO DE AUTORIZACION NO NUMERICO                2038".              
134149    03 ERROR-0039                          PIC X(54) VALUE                    
134150       "                                                      ".              
134151    03 ERROR-0040                          PIC X(54) VALUE                    
134152       "PASSWORD INCORRECTO                               2040".              
134153    03 ERROR-0041                          PIC X(54) VALUE                    
134154       "FALTA TIPO DE FUNCION                             2041".              
134155    03 ERROR-0042                          PIC X(54) VALUE                    
134156       "TIPO DE FUNCION INVALIDO                          2042".              
134157    03 ERROR-0043                          PIC X(54) VALUE                    
134158       "PRODUCTO MAL TECLEADO                             2043".              
134159    03 ERROR-0044                          PIC X(54) VALUE                    
134160       "INSTRUMENTO MAL TECLEADO                          2044".              
134161    03 ERROR-0045                          PIC X(54) VALUE                    
134162       "MONEDA MAL TECLEADA                               2045".              
134163    03 ERROR-0046                          PIC X(54) VALUE                    
134164       "FALTA EL NOMBRE DEL INSTRUMENTO                   2046".              
134165    03 ERROR-0047                          PIC X(54) VALUE                    
134166       "FALTA TIPO DE PERSONA                             2047".              
134167    03 ERROR-0048                          PIC X(54) VALUE                    
134168       "TIPO DE PERSONA NO NUMERICO                       2048".              
134169    03 ERROR-0049                          PIC X(54) VALUE                    
134170       "FALTA IMPORTE                                     1905".              
134171    03 ERROR-0050                          PIC X(54) VALUE                    
134172       "IMPORTE MAL TECLEADO                              1907".              
134173    03 ERROR-0051                          PIC X(54) VALUE                    
134174       "IMPORTE NO NUMERICO                               2051".              
134175    03 ERROR-0052                          PIC X(54) VALUE                    
134176       "FALTA DEFINIR PAGO DE RENDIMIENTOS                2052".              
134177    03 ERROR-0053                          PIC X(54) VALUE                    
134178       "OPCION DE PAGO DE RENDIMIENTO MAL TECLEADA        2053".              
134179    03 ERROR-0054                          PIC X(54) VALUE                    
134180       "FALTA LA CLAVE DE RETENCION DE IMPUESTO           2054".              
134181    03 ERROR-0055                          PIC X(54) VALUE                    
134182       "CLAVE DE RETENCION DE IMPUESTO MAL TECLEADA       2055".              
134183    03 ERROR-0056                          PIC X(54) VALUE                    
134184       "SE REQUIERE UNA OPCION DE CORTE                   2056".              
134185    03 ERROR-0057                          PIC X(54) VALUE                    
134186       "SOLO SE PERMITE UNA OPCION DE CORTE               2057".              
134187    03 ERROR-0058                          PIC X(54) VALUE                    
134188       "SE REQUIERE UN MEDIO DE ACCESO                    2058".              
134189    03 ERROR-0059                          PIC X(54) VALUE                    
134190       "FALTA NUMERO DE DIAS FECHA VALOR                  2059".              
134191    03 ERROR-0060                          PIC X(54) VALUE                    
134192       "NUMERO DE DIAS FECHA VALOR MAL TECLEADO           2060".              
134193    03 ERROR-0061                          PIC X(54) VALUE                    
134194       "INSTRUMENTO PARA CAMBIO MAL TECLEADO              2061".              
134195    03 ERROR-0062                          PIC X(54) VALUE                    
134196       "CENTRALIZADORA MAL TECLEADA                       2062".              
134197    03 ERROR-0063                          PIC X(54) VALUE                    
134198       "NO SE PUEDE DAR DE ALTA SI YA EXISTE              2063".              
134199    03 ERROR-0064                          PIC X(54) VALUE                    
134200       "NO SE PUEDE DAR DE BAJA SI NO EXISTE              2064".              
134201    03 ERROR-0065                          PIC X(54) VALUE                    
134202       "NO SE PUEDE MODIFICAR SI NO EXISTE                2065".              
134203    03 ERROR-0066                          PIC X(54) VALUE                    
134204       "NO SE PUEDE DESPLEGAR SI NO EXISTE                2066".              
134205    03 ERROR-0067                          PIC X(54) VALUE                    
134206       "CAMPO DE VAL DE SEG EN CHQ INVALIDO O NO NUMERICO 2067".              
134207    03 ERROR-0068                          PIC X(54) VALUE                    
134208       "SISTEMA MAL TECLEADO                              2068".              
134209    03 ERROR-0069                          PIC X(54) VALUE                    
134210       "NO EXISTE REGISTRO B02CONTROL                     2069".              
134211    03 ERROR-0070                          PIC X(54) VALUE                    
134212       "BASE SATURADA DE TRANCODES                        2070".              
134213    03 ERROR-0071                          PIC X(54) VALUE                    
134214       "TIPO DE MOVIMIENTO INVALIDO                       2071".              
134215    03 ERROR-0072                          PIC X(54) VALUE                    
134216       "INDICADOR DE MEDIO DE ACCESO CONTRATO INVALIDO    CTRL".              
134217    03 ERROR-0073                          PIC X(54) VALUE                    
134218       "FUNC. DE L. DE C. INVALIDA                        2073".              
134219    03 ERROR-0074                          PIC X(54) VALUE                    
134220       "IND. FECHA VALOR                                  2074".              
134221    03 ERROR-0075                          PIC X(54) VALUE                    
134222       "LAS CLAVES ADICIONALES DEBEN SER DE CARGO         2075".              
134223    03 ERROR-0076                          PIC X(54) VALUE                    
134224       "ERROR LINEAS DE SERVICIO, VER LISTADO             2076".              
134225    03 ERROR-0077                          PIC X(54) VALUE                    
134226       "COMISION POR DEVOLUCION                           2077".              
134227    03 ERROR-0078                          PIC X(54) VALUE                    
134228       "TIPO LINEA DE SERVICIO                            2078".              
134229    03 ERROR-0079                          PIC X(54) VALUE                    
134230       "IND. USO DE SALDO PENDIENTE                       2079".              
134231    03 ERROR-0080                          PIC X(54) VALUE                    
134232       "IND. PERMITE ELIMINACIONES                        2080".              
134233    03 ERROR-0081                          PIC X(54) VALUE                    
134234       "FUNCION DE LINEA DE SERVICIO                      2081".              
134235    03 ERROR-0082                          PIC X(54) VALUE                    
134236       "DIAS SALVO BUEN COBRO                             2082".              
134237    03 ERROR-0083                          PIC X(54) VALUE                    
134238       "INDICADOR DE COMISION MENSUAL                     2083".              
134239    03 ERROR-0084                          PIC X(54) VALUE                    
134240       "INDICADOR DE COMISION PENDIENTE                   2084".              
134241    03 ERROR-0085                          PIC X(54) VALUE                    
134242       "CLAVE DE AVISO                                    2085".              
134243    03 ERROR-0086                          PIC X(54) VALUE                    
134244       "MOVIMIENTO AUTOMATICO                             2086".              
134245    03 ERROR-0087                          PIC X(54) VALUE                    
134246       "CVE DE COM NO NUM., INEX., NO AUTO. O = A CVE ORI.2087".              
134247    03 ERROR-0088                          PIC X(54) VALUE                    
134248       "IND. DE VERIFICA CHEQUE INVALIDO                  2088".              
134249    03 ERROR-0089                          PIC X(54) VALUE                    
134250       "IND. DE USO CUENTAS TRASPASO INVALIDO             2089".              
134251    03 ERROR-0090                          PIC X(54) VALUE                    
134252       "IND. DE TERMINAL INVALIDO                         2090".              
134253    03 ERROR-0091                          PIC X(54) VALUE                    
134254       "CUENTA UNICA INVALIDA O DEBE SER ESPACIOS         2091".              
134255    03 ERROR-0092                          PIC X(54) VALUE                    
134256       "IND. CENT. INVALIDO O DEBE SER ESPACIOS           2092".              
134257    03 ERROR-0093                          PIC X(54) VALUE                    
134258       "IND. APLICACION INVALIDO                          2093".              
134259    03 ERROR-0094                          PIC X(54) VALUE                    
134260       "SIGTE. CVE. NO NUMERICA                           2094".              
134261    03 ERROR-0095                          PIC X(54) VALUE                    
134262       "PRODUCTO, INSTRUMENTO, MONEDA INEXISTENTE         2095".              
134263    03 ERROR-0096                          PIC X(54) VALUE                    
134264       "LIMITE DE CREDITO INSUFICIENTE EN LINEA DE SERV.  2096".              
134265    03 ERROR-0097                          PIC X(54) VALUE                    
134266       "LINEA DE CREDITO TRANSACCIONAL CANCELADA          2097".              
134267    03 ERROR-0098                          PIC X(54) VALUE                    
134268       "LINEA DE CREDITO TRANSACCIONAL VENCIDA            2098".              
134269    03 ERROR-0099                          PIC X(54) VALUE                    
134270       "NO EXISTE LINEA DE CREDITO TRANSACCIONAL          2099".              
134271    03 ERROR-0100                          PIC X(54) VALUE                    
134272       "SUC. NO AUTORIZADA PARA ELIMINAR LINEA DE SERVI.  2100".              
134273    03 ERROR-0101                          PIC X(54) VALUE                    
134274       "OPERACION YA ELIMINADA EN LINEAS DE CREDITO TRAN. 2101".              
134275    03 ERROR-0102                          PIC X(54) VALUE                    
134276       "NO EXISTE AUTORIZACION A ELIMINAR EN LIN. DE SERV.2102".              
134277    03 ERROR-0103                         PIC X(54) VALUE                     
134278       "FALTA CLAVE DE TRANSACCION                        2103".              
134279    03 ERROR-0104                          PIC X(54) VALUE                    
134280       "                                                      ".              
134281    03 ERROR-0105                          PIC X(54) VALUE                    
134282       "FALTA MEDIO DE ACCESO                             2105".              
134283    03 ERROR-0106                          PIC X(54) VALUE                    
134284       "TIPO DE MEDIO DE ACCESO INVALIDO                  2106".              
134285    03 ERROR-0107                          PIC X(54) VALUE                    
134286       "FALTA TIPO DE MONEDA                              2107".              
134287    03 ERROR-0108                          PIC X(54) VALUE                    
134288       "TIPO INVALIDO DE MONEDA O NO NUMERICO             2108".              
134289    03 ERROR-0109                          PIC X(54) VALUE                    
134290       "                                                      ".              
134291    03 ERROR-0110                          PIC X(54) VALUE                    
134292       "                                                      ".              
134293    03 ERROR-0111                         PIC X(54) VALUE                     
134294       "FALTA CUENTA O CONTRATO                           2111".              
134295    03 ERROR-0112                          PIC X(54) VALUE                    
134296       "CONTRATO NO NUMERICO                              2112".              
134297    03 ERROR-0113                          PIC X(54) VALUE                    
134298       "FALTA IMPORTE 1                                   2113".              
134299    03 ERROR-0114                          PIC X(54) VALUE                    
134300       "FALTA REFERENCIA                                  1114".              
134301    03 ERROR-0115                          PIC X(54) VALUE                    
134302       "                                                      ".              
134303    03 ERROR-0116                          PIC X(54) VALUE                    
134304       "FALTA REFERENCIA ALFANUMERICA                     1923".              
134305    03 ERROR-0117                          PIC X(54) VALUE                    
134306       "SUC OPERA A CTA. DE .. NO NUMERICA                2117".              
134307    03 ERROR-0118                          PIC X(54) VALUE                    
134308       "FECHA EN CAMPO DE FECHA VALOR NO NUMERICA         2118".              
134309    03 ERROR-0119                          PIC X(54) VALUE                    
134310       "FALTA OPCION DE IMPRESION DE RECIBO               2119".              
134311    03 ERROR-0120                          PIC X(54) VALUE                    
134312       "OPCION DE IMPRESION DE RECIBO NO VALIDA           2120".              
134313    03 ERROR-0121                          PIC X(54) VALUE                    
134314       "FALTA INDICADOR DE REFERENCIA ALFANUMERICA        2121".              
134315    03 ERROR-0122                          PIC X(54) VALUE                    
134316       "SOLO SE PERMITE CAMBIA O DESPLIEGA EN FUNCION     2122".              
134317    03 ERROR-0123                          PIC X(54) VALUE                    
134318       "CLAVE DE COMISION NO NUMERICA                     2123".              
134319    03 ERROR-0124                          PIC X(54) VALUE                    
134320       "NO SE REALIZA CGO POR INSUFICIENCIA DE FONDOS (FV)2124".              
134321    03 ERROR-0125                          PIC X(54) VALUE                    
134322       "NO SE REALIZA CARGO POR INSUFICIENCIA DE FONDOS   1111".              
134323    03 ERROR-0126                          PIC X(54) VALUE                    
134324       "CLAVE DE COMISION O IVA INEXISTENTE               2126".              
134325    03 ERROR-0127                          PIC X(54) VALUE                    
134326       "NO EXISTE MOVIMIENTO A ELIMINAR                   1118".              
134327    03 ERROR-0128                          PIC X(54) VALUE                    
134328       "MOVIMIENTO PREVIAMENTE ELIMINADO                  1113".              
134329    03 ERROR-0129                          PIC X(54) VALUE                    
134330       "LA CLAVE DEL MOVIMIENTO NO PERMITE ELIMINACION    2129".              
134331    03 ERROR-0130                          PIC X(54) VALUE                    
134332       "LA APERTURA NO SE PUEDE ELI. TIENE MOVS. DESPUES  2130".              
134333    03 ERROR-0131                          PIC X(54) VALUE                    
134334       "IMPORTE NO CORRESPONDE A MOVIMIENTO A ELIMINAR    1122".              
134335    03 ERROR-0132                          PIC X(54) VALUE                    
134336       "NO EXISTE CVE. DE MOVTO. ADICIONAL EN BD          2132".              
134337    03 ERROR-0133                          PIC X(54) VALUE                    
134338       "NO PUDE ELIMINAR, EFECTUE CONTRAPARTIDA           2133".              
134339    03 ERROR-0134                          PIC X(54) VALUE                    
134340       "ERROR AL LLAMAR LIBRARY THECALENDAR               2134".              
134341    03 ERROR-0135                          PIC X(54) VALUE                    
134342       "ESTA CLAVE NO PERMITE EL CAMPO DE FECHA VALOR     2135".              
134343    03 ERROR-0136                          PIC X(54) VALUE                    
134344       "FECHA DE OPERACION MENOR QUE FECHA DE APERTURA    2136".              
134345    03 ERROR-0137                          PIC X(54) VALUE                    
134346       "FECHA DE OPERACION MAYOR QUE LA FECHA DE LINEA    2137".              
134347    03 ERROR-0138                          PIC X(54) VALUE                    
134348       "# DE DIAS F.V. > LOS PERMITIDOS EN EL INSTR.      2138".              
134349    03 ERROR-0139                          PIC X(54) VALUE                    
134350       "MOVIMIENTO F.V. EN DIA INHABIL                    2139".              
134351    03 ERROR-0140                          PIC X(54) VALUE                    
134352       "EL MOVTO F.V. ES MAYOR DE TRES CICLOS DE CORTE    2140".              
134353    03 ERROR-0141                          PIC X(54) VALUE                    
134354       "EL IMPORTE DEL MOVTO F.V. ES MAYOR DEL EXISTENTE  2141".              
134355    03 ERROR-0142                          PIC X(54) VALUE                    
134356       "EL IMP. DEL MOV. F.V. ES MAYOR QUE EL DISP. EN LC 2142".              
134357    03 ERROR-0143                          PIC X(54) VALUE                    
134358       "CLAVE DEL MOVTO. A ELIMINAR NO EXISTE EN B.D.     1424".              
134359    03 ERROR-0144                          PIC X(54) VALUE                    
134360       "BANCO QUE PRESENTO NO NUMERICO                    2144".              
134361    03 ERROR-0145                          PIC X(54) VALUE                    
134362       "FECHA DE DEVOLUCION NO NUMERICA                   2145".              
134363    03 ERROR-0146                          PIC X(54) VALUE                    
134364       "ESQUEMA CONTABLE POR DEFAULT NO NUMERICO          2146".              
134365    03 ERROR-0147                          PIC X(54) VALUE                    
134366       "SECTOR NO NUMERICO                                2147".              
134367    03 ERROR-0148                          PIC X(54) VALUE                    
134368       "ESQUEMA CONTABLE NO NUMERICO                      2148".              
134369    03 ERROR-0149                          PIC X(54) VALUE                    
134370       "NO SE DA DE BAJA POR TENER SALDO EN CIFRAS        2149".              
134371    03 ERROR-0150                          PIC X(54) VALUE                    
134372       "CAUSA DE DEVOLUCION NO NUMERICA                   2150".              
134373    03 ERROR-0151                          PIC X(54) VALUE                    
134374       "NO EXISTE EL REGISTRO DE MOVTOS ADICIONALES (B13) 2151".              
134375    03 ERROR-0152                          PIC X(54) VALUE                    
134376       "NO EXISTE MOVIMIENTO DE TRASPASOS A ELIMINAR      2152".              
134377    03 ERROR-0153                          PIC X(54) VALUE                    
134378       "SEGURIDAD NO DISPONIBLE                           2153".              
134379    03 ERROR-0154                          PIC X(54) VALUE                    
134380       "NIVEL INSUFICIENTE DE FACULTADES                  2154".              
134381    03 ERROR-0155                          PIC X(54) VALUE                    
134382       "TERMINAL NO ESTA FIRMADA                          2155".              
134383    03 ERROR-0156                          PIC X(54) VALUE                    
134384       "TRANS. NO PERMITIDA EN SEGURIDAD PARA ESTA OFICINA2156".              
134385    03 ERROR-0157                          PIC X(54) VALUE                    
134386       "PROBLEMAS CON LIBRERIA DE SEGURIDAD               2157".              
134387    03 ERROR-0158                          PIC X(54) VALUE                    
134388       "OFICINA NO ESTA EN SEGURIDAD                      2158".              
134389    03 ERROR-0159                          PIC X(54) VALUE                    
134390       "ERROR EN LOS PARAMETROS EN LLAMADO A SEGURIDAD    2159".              
134391    03 ERROR-0160                          PIC X(54) VALUE                    
134392       "OPERADOR NO TIENE REGISTRADO EL MODULO            2160".              
134393    03 ERROR-0161                          PIC X(54) VALUE                    
134394       "TRANSACCION NO REGISTRADA EN CATALOGOS (SEGURIDAD)2161".              
134395    03 ERROR-0162                          PIC X(54) VALUE                    
134396       "SE FIRMO OPERADOR DIFERENTE DEL QUE TRANSMITIO    2162".              
134397    03 ERROR-0163                          PIC X(54) VALUE                    
134398       "LSN INVALIDO                                      2163".              
134399    03 ERROR-0164                          PIC X(54) VALUE                    
134400       "OPERADOR NO ESTA FIRMADO O NO ACTIVO              2164".              
134401    03 ERROR-0165                          PIC X(54) VALUE                    
134402       "OFICINA FUERA DE RANGO                            2165".              
134403    03 ERROR-0166                          PIC X(54) VALUE                    
134404       "SEGURIDAD LEVANTANDOSE                            2166".              
134405    03 ERROR-0167                          PIC X(54) VALUE                    
134406       "RESULT DESCONOCIDO DE LA LIBRERIA DE SEGURIDAD    2167".              
134407    03 ERROR-0168                          PIC X(54) VALUE                    
134408       "TERMINAL SIN IMPRESORA ASOCIADA USANDO ESTACIONES 2168".              
134409    03 ERROR-0169                          PIC X(54) VALUE                    
134410       "LA REF NUMERICA NO ES DE 7 POSICIONES CONSECUTIVAS2169".              
134411    03 ERROR-0170                          PIC X(54) VALUE                    
134412       "CLAVE DEL MOVTO. A REIMPRIMIR NO EXISTE EN B.D.   2170".              
134413    03 ERROR-0171                          PIC X(54) VALUE                    
134414       "EL CAMBIO DE PRODUCTO-INSTRUMENTO ES EN PAREJA    2171".              
134415    03 ERROR-0172                          PIC X(54) VALUE                    
134416       "NO EXISTE REGISTRO EN CIFRAS                      2172".              
134417    03 ERROR-0173                          PIC X(54) VALUE                    
134418       "LAS CLAVES DE COMISION VAN POR PAREJAS            2173".              
134419    03 ERROR-0174                          PIC X(54) VALUE                    
134420       "LA DEVOLUCION SE PRESENTA DESPUES DE 17 DIAS      2174".              
134421    03 ERROR-0175                          PIC X(54) VALUE                    
134422       "ESTA CLAVE NO ACEPTA IMPRESION DE DOCUMENTO       2175".              
134423    03 ERROR-0176                          PIC X(54) VALUE                    
134424       "EL IMPORTE VA EN CEROS                            2176".              
134425    03 ERROR-0177                          PIC X(54) VALUE                    
134426       "NO SE PUEDE ELIMINAR UN MOVIMIENTO AUTOMATICO     2177".              
134427    03 ERROR-0178                          PIC X(54) VALUE                    
134428       "LOS DIAS PARA REHACER EL SALDO SON MAS DE 31      2178".              
134429    03 ERROR-0179                          PIC X(54) VALUE                    
134430       "EN PREBATCH NO SE PERMITEN LAS PANTALLAS DE CTRL. 2179".              
134431    03 ERROR-0180                          PIC X(54) VALUE                    
134432       "LIBERACION DE SDO GLOBAL CON FIRMA MANCOMUNADA    2180".              
134433    03 ERROR-0181                          PIC X(54) VALUE                    
134434       "NIVEL DE FACULTADES EN SEGURIDAD INSUFICIENTE     2181".              
134435    03 ERROR-0182                          PIC X(54) VALUE                    
134436       "NO FUE POSIBLE GENERAR NUMERO DE AUTORIZACION     2182".              
134437    03 ERROR-0183                          PIC X(54) VALUE                    
134438       "NO SE PERMITE REIMPRESION DE DOCTO CON ESTE MOVTO 2183".              
134439    03 ERROR-0184                          PIC X(54) VALUE                    
134440       "NO EXISTE MOVIMIENTO A REIMPRIMIR                 2184".              
134441    03 ERROR-0185                          PIC X(54) VALUE                    
134442       "NO HAY REIMPRESION DE DOCTO DE UN MOVTO ELIMINADO 2185".              
134443    03 ERROR-0186                          PIC X(54) VALUE                    
134444       "NO HAY REIMPRESION DE DOCTO DE UN MOVTO AUTOMATICO2186".              
134445    03 ERROR-0187                          PIC X(54) VALUE                    
134446       "NO SE PUEDE PROTEGER SALDO EN EL S408 POR LC VENCI2187".              
134447    03 ERROR-0188                          PIC X(54) VALUE                    
134448       "DURANTE EL BATCH SOLO SE ACEPTAN CONSULTAS        2188".              
134449    03 ERROR-0189                          PIC X(54) VALUE                    
134450       "FALTA NUMERO DE CHEQUE                            2189".              
134451    03 ERROR-0190                          PIC X(54) VALUE                    
134452       "NUMERO DE CHEQUE NO NUMERICO                      2190".              
134453    03 ERROR-0191                          PIC X(54) VALUE                    
134454       "NO EXISTE DEV. A ELIM. VERIF. AUT. Y/O SUC. CAJ.  2191".              
134455    03 ERROR-0192                          PIC X(54) VALUE                    
134456       "FAVOR DE TRANSMITIR MAS TARDE LA ELIM. DE DEVOL.  2192".              
134457    03 ERROR-0193                          PIC X(54) VALUE                    
134458       "DEVOLUCION PREVIAMENTE ELIMINADA                  2193".              
134459    03 ERROR-0194                          PIC X(54) VALUE                    
134460       "NO ES LA MISMA SUCURSAL QUE TRANSMITIO LA DEVOL.  2194".              
134461    03 ERROR-0195                          PIC X(54) VALUE                    
134462       "NUMERO DE CHEQUE NO CORRESPONDE CON REG. DE DEVOL.2195".              
134463    03 ERROR-0196                          PIC X(54) VALUE                    
134464       "FALTA SUCURSAL QUE TRANSMITIO                     2196".              
134465    03 ERROR-0197                          PIC X(54) VALUE                    
134466       "SUCURSAL QUE TRANSMITIO NO NUMERICA               2197".              
134467    03 ERROR-0198                          PIC X(54) VALUE                    
134468       "FALTA CAJA QUE TRANSMITIO                         2198".              
134469    03 ERROR-0199                          PIC X(54) VALUE                    
134470       "CAJA QUE TRANSMITIO NO NUMERICA                   2199".              
134471    03 ERROR-0200                          PIC X(54) VALUE                    
134472       "<<<<<<<<  PROBLEMAS DE DMSII  >>>>>>>>>           2200".              
134473    03 ERROR-0201                          PIC X(54) VALUE                    
134474       "EL CONTRATO NO RECIBE CARGOS                      2201".              
134475    03 ERROR-0202                          PIC X(54) VALUE                    
134476       "EL CONTRATO NO RECIBE CHEQUES                     1106".              
134477    03 ERROR-0203                          PIC X(54) VALUE                    
134478       "EL CONTRATO SOLO RECIBE CARGOS POR TRASPASO       1101".              
134479    03 ERROR-0204                          PIC X(54) VALUE                    
134480       "EL CTO RECIBE SOLO ABONOS CON CVE 1003,1009 Y 10192204".              
134481    03 ERROR-0205                          PIC X(54) VALUE                    
134482       "EL CONTRATO RECIBE SOLO CARGOS                    2205".              
134483    03 ERROR-0206                          PIC X(54) VALUE                    
134484       "EL CONTRATO NO RECIBE CHEQUES NI SALVO BUEN COBRO 2206".              
134485    03 ERROR-0207                          PIC X(54) VALUE                    
134486       "EL CTO RECIBE SOLO CGOS X TRASP Y NO RECIBE SBC   2207".              
134487    03 ERROR-0208                          PIC X(54) VALUE                    
134488       "EL CONTRATO NO RECIBE SALVO BUEN COBRO            1471".              
134489    03 ERROR-0209                          PIC X(54) VALUE                    
134490       "EL CONTRATO NO RECIBE CARGOS NI SALVO BUEN COBRO  2209".              
134491    03 ERROR-0210                          PIC X(54) VALUE                    
134492       "MEDIO DE ACCESO INEXISTENTE                       1005".              
134493    03 ERROR-0211                          PIC X(54) VALUE                    
134494       "DEP. FUERA DE PLAZA OPERAR COMO ORDEN DE ABONO    1427".              
134495    03 ERROR-0212                          PIC X(54) VALUE                    
134496       "EL MDA NO PUEDE SER DIFERENTE A CHEQUERA          2212".              
134497    03 ERROR-0213                          PIC X(54) VALUE                    
134498       "CARGO O COMISION MAYOR QUE DEPOSITO               1469".              
134499    03 ERROR-0214                          PIC X(54) VALUE                    
134500       "CLAVE NO PERMITIDA PARA APERTURAS                 2214".              
134501    03 ERROR-0215                          PIC X(54) VALUE                    
134502       "EL CONTRATO NO PUEDE SER CEROS                    2215".              
134503    03 ERROR-0216                          PIC X(54) VALUE                    
134504       "LA MONEDA ES DIFERENTE A LA DEL CONTRATO          2216".              
134505    03 ERROR-0217                          PIC X(54) VALUE                    
134506       "UN CTO DE AHORROS NO PUEDE SER DE TRASPASO        2217".              
134507    03 ERROR-0218                          PIC X(54) VALUE                    
134508       "REFERENCIA INTERNACIONAL NO NUMERICA              2218".              
134509    03 ERROR-0219                          PIC X(54) VALUE                    
134510       "INDICADOR DE LINEA DE CREDITO INVALIDO            2219".              
134511    03 ERROR-0220                          PIC X(54) VALUE                    
134512       "CONTRATO DE TRASPASO NO NUMERICO                  2220".              
134513    03 ERROR-0221                          PIC X(54) VALUE                    
134514       "IND. PARA PASAR SDO. PEND. A SDO. ACT. INVALIDO   2221".              
134515    03 ERROR-0222                          PIC X(54) VALUE                    
134516       "IND. DE ELIMINA ARCHIVO DE DISPERSION INVALIDO    2222".              
134517    03 ERROR-0223                          PIC X(54) VALUE                    
134518       "AUN NO TERMINA ELIMINACION PREVIA                 2223".              
134519    03 ERROR-0224                          PIC X(54) VALUE                    
134520       "VALIDACION DE DIGITO EN REFERENCIA INVALIDO       2224".              
134521    03 ERROR-0225                          PIC X(54) VALUE                    
134522       "IND. SEGUNDA REFERENCIA INVALIDO                  2225".              
134523    03 ERROR-0226                          PIC X(54) VALUE                    
134524       "DIA DE CORTE NO PERMITIDO                         2226".              
134525    03 ERROR-0227                          PIC X(54) VALUE                    
134526       "RESTRICCION INVALIDA                              2227".              
134527    03 ERROR-0228                          PIC X(54) VALUE                    
134528       "RESTRICCION CTA CONCENTRADORA INVALIDA            2228".              
134529    03 ERROR-0229                          PIC X(54) VALUE                    
134530       "NO ES CTA CONCEN, NO SE PUEDE DAR ALTA REST. CONC.2229".              
134531    03 ERROR-0230                          PIC X(54) VALUE                    
134532       "LA NVA. SUC. PROM. ES LA MISMA QUE LA DEL CTO.    2230".              
134533    03 ERROR-0231                          PIC X(54) VALUE                    
134534       "EL NUEVO SECTOR ES EL MISMO QUE EL DEL CONTRATO   2231".              
134535    03 ERROR-0232                          PIC X(54) VALUE                    
134536       "CAMPO DE CTA CONCENTRADORA INVALIDO               2232".              
134537    03 ERROR-0233                          PIC X(54) VALUE                    
134538       "EL CONTRATO TIENE COMISIONES PENDIENTES           2233".              
134539    03 ERROR-0234                          PIC X(54) VALUE                    
134540       "EL CTO NO SE PUEDE DESBLOQUEAR SI NO ESTA BLOQ.   2234".              
134541    03 ERROR-0235                          PIC X(54) VALUE                    
134542       "IMPORTE MAYOR A AUTORIZACIONES PENDIENTES         2235".              
134543    03 ERROR-0236                          PIC X(54) VALUE                    
134544       "IMPORTE MAYOR AL SALDO PROTEGIDO                  2236".              
134545    03 ERROR-0237                          PIC X(54) VALUE                    
134546       "EL INSTRUMENTO NO PERMITE CAMBIO A ESE DE PRODUCTO2237".              
134547    03 ERROR-0238                          PIC X(54) VALUE                    
134548       "EL INSTRUMENTO NO PUEDE CAMBIAR DE MONEDA         2238".              
134549    03 ERROR-0239                          PIC X(54) VALUE                    
134550       "EL INDICADOR DE LC YA ESTABA DESACTIVADO          2239".              
134551    03 ERROR-0240                          PIC X(54) VALUE                    
134552       "EL INDICADOR DE LC YA ESTABA ACTIVADO             2240".              
134553    03 ERROR-0241                          PIC X(54) VALUE                    
134554       "CONTRATO DE TRASPASO INEXISTENTE                  2241".              
134555    03 ERROR-0242                          PIC X(54) VALUE                    
134556       "FECHA DE DEPOSITO INVALIDA O FORMATO INCORRECTO   2242".              
134557    03 ERROR-0243                          PIC X(54) VALUE                    
134558       "LA FECHA DE DEPOSITO NO DEBE SER > A FECH CONTABLE2243".              
134559    03 ERROR-0244                          PIC X(54) VALUE                    
134560       "NECESITA SER CTA CONC. PARA EFEC. ESTA TRANS      2244".              
134561    03 ERROR-0245                          PIC X(54) VALUE                    
134562       "LA NUEVA SUC. PROM. DEBE PERTENECER AL MISMO CSI  2245".              
134563    03 ERROR-0246                          PIC X(54) VALUE                    
134564       "NUEVA SUCURSAL PROMOTORA INVALIDA                 2246".              
134565    03 ERROR-0247                          PIC X(54) VALUE                    
134566       "EL CTO. DE TRASP. DEBE SER DE LA MISMA MONEDA     2247".              
134567    03 ERROR-0248                          PIC X(54) VALUE                    
134568       "HORA INVALIDA                                     2248".              
134569    03 ERROR-0249                          PIC X(54) VALUE                    
134570       "EL INSTRUMENTO NO PERMITE CAMBIO A ESE INSTRUMENTO2249".              
134571    03 ERROR-0250                          PIC X(54) VALUE                    
134572       "TRANSACCION NO PERMITIDA PARA DIALOGO FORANEO     2250".              
134573    03 ERROR-0251                          PIC X(54) VALUE                    
134574       "SECTOR IGUAL AL DEL CONTRATO                      2251".              
134575    03 ERROR-0252                          PIC X(54) VALUE                    
134576       "CAMPO AFECTA S028 INVALIDO O NO NUMERICO          2252".              
134577    03 ERROR-0253                          PIC X(54) VALUE                    
134578       "CAMPO AFECTA S052 INVALIDO O NO NUMERICO          2253".              
134579    03 ERROR-0254                          PIC X(54) VALUE                    
134580       "CAMPO AFECTA S408 INVALIDO O NO NUMERICO          2254".              
134581    03 ERROR-0255                          PIC X(54) VALUE                    
134582       "PROBLEMAS LIB S016L422                            2255".              
134583    03 ERROR-0256                          PIC X(54) VALUE                    
134584       "EL CONTRATO NO PERTENECE AL CSI                   2256".              
134585    03 ERROR-0257                          PIC X(54) VALUE                    
134586       "MEDIO DE ACCESO INACTIVO                          2257".              
134587    03 ERROR-0258                          PIC X(54) VALUE                    
134588       "NO EXISTE LA ALTA DEL CONTRATO EN CLIENTES        2258".              
134589    03 ERROR-0259                          PIC X(54) VALUE                    
134590       "DELIMITADOR DE FIN DE TEXTO INVALIDO              2259".              
134591    03 ERROR-0260                          PIC X(54) VALUE                    
134592       "ERROR SIZE EN MENSAJE CONTABLE DE DIALOGO         2260".              
134593    03 ERROR-0261                          PIC X(54) VALUE                    
134594       "CTO CON STATUS DESCONOCIDO EN EL SISTEMA CLIENTES 2261".              
134595    03 ERROR-0262                          PIC X(54) VALUE                    
134596       "STATION NAME INVALIDO O NO NUMERICO               2262".              
134597    03 ERROR-0263                          PIC X(54) VALUE                    
134598       "                                                  XXXX".              
134599    03 ERROR-0264                          PIC X(54) VALUE                    
134600       "NO PERMITE CANCELACION, CTO. CON BLOQUEO PARCIAL  2264".              
134601    03 ERROR-0265                          PIC X(54) VALUE                    
134602       "CODIGO DE RESPUESTA DE SA0 ERRONEO                2265".              
134603    03 ERROR-0266                          PIC X(54) VALUE                    
134604       "LINEA DE CREDITO INEXISTENTE EN EL SISTEMA S408   2266".              
134605    03 ERROR-0267                          PIC X(54) VALUE                    
134606       "EXISTE LINEA DE CREDITO EN EL SISTEMA S408        2267".              
134607    03 ERROR-0268                          PIC X(54) VALUE                    
134608       "NO SE PUEDEN RECIBIR DOS MDA TIPO CONTRATO        2268".              
134609    03 ERROR-0269                          PIC X(54) VALUE                    
134610       "EL PRIMER MDA DEBE SER CONTRATO                   2269".              
134611    03 ERROR-0270                          PIC X(54) VALUE                    
134612       "CHEQUE PROTEGIDO                                  1458".              
134613    03 ERROR-0271                          PIC X(54) VALUE                    
134614       "CHEQUE CANCELADO                                  1459".              
134615    03 ERROR-0272                          PIC X(54) VALUE                    
134616       "CHEQUE ROBADO O EXTRAVIADO                        1460".              
134617    03 ERROR-0273                          PIC X(54) VALUE                    
134618       "CHEQUE PREVIAMENTE CERTIFICADO                    1135".              
134619    03 ERROR-0274                          PIC X(54) VALUE                    
134620       "CHEQUE LIBERADO CON IMPORTE DIFERENTE             1461".              
134621    03 ERROR-0275                          PIC X(54) VALUE                    
134622       "CHEQUE REVOCADO                                   1462".              
134623    03 ERROR-0276                          PIC X(54) VALUE                    
134624       "PROBLEMAS PREVENCIONES                            2276".              
134625    03 ERROR-0277                          PIC X(54) VALUE                    
134626       "NUMERO DE CHEQUE FUERA DE RANGO                   2277".              
134627    03 ERROR-0278                          PIC X(54) VALUE                    
134628       "CONTRATO BLOQUEADO POR ORDEN JUDICIAL             2278".              
134629    03 ERROR-0279                          PIC X(54) VALUE                    
134630       "INDICADOR DE REFERENCIA ALFANUMERICA INVALIDO     2279".              
134631    03 ERROR-0280                          PIC X(54) VALUE                    
134632       "PANTALLA PERMITIDA INVALIDA O NO NUMERICA         2280".              
134633    03 ERROR-0281                          PIC X(54) VALUE                    
134634       "DATO A VALIDAR INVALIDO O NO NUMERICO             2281".              
134635    03 ERROR-0282                          PIC X(54) VALUE                    
134636       "LA CVE NO PERM LA REFERENCIA NUMERICA             2282".              
134637    03 ERROR-0283                          PIC X(54) VALUE                    
134638       "LA CVE NO PERM EL IMPORTE                         2283".              
134639    03 ERROR-0284                          PIC X(54) VALUE                    
134640       "FALTA EL SEGUNDO IMPORTE                          2284".              
134641    03 ERROR-0285                          PIC X(54) VALUE                    
134642       "LA CVE NO PERM EL SEGUNDO IMPORTE                 2285".              
134643    03 ERROR-0286                          PIC X(54) VALUE                    
134644       "LA CVE NO PERM EL INDICADOR DE REF. ALFANUMERICA  2286".              
134645    03 ERROR-0287                          PIC X(54) VALUE                    
134646       "LA CVE NO PERM LA REFERENCIA ALFANUMERICA         2287".              
134647    03 ERROR-0288                          PIC X(54) VALUE                    
134648       "FALTA FECHA VALOR                                 2288".              
134649    03 ERROR-0289                          PIC X(54) VALUE                    
134650       "FALTA SUCURSAL QUE OPERA A CUENTA DE              2289".              
134651    03 ERROR-0290                          PIC X(54) VALUE                    
134652       "LA CVE NO PERM LA SUCURSAL QUE OPERA A CUENTA DE  2290".              
134653    03 ERROR-0291                          PIC X(54) VALUE                    
134654       "FALTA CAUSA DE DEVOLUCION                         2291".              
134655    03 ERROR-0292                          PIC X(54) VALUE                    
134656       "LA CVE NO PERM LA CAUSA DE DEVOLUCION             2292".              
134657    03 ERROR-0293                          PIC X(54) VALUE                    
134658       "FALTA BANCO                                       2293".              
134659    03 ERROR-0294                          PIC X(54) VALUE                    
134660       "LA CVE NO PERM EL BANCO                           2294".              
134661    03 ERROR-0295                          PIC X(54) VALUE                    
134662       "FALTA FECHA DEL DEPOSITO                          2295".              
134663    03 ERROR-0296                          PIC X(54) VALUE                    
134664       "LA CVE NO PERM LA FECHA DEL DEPOSITO              2296".              
134665    03 ERROR-0297                          PIC X(54) VALUE                    
134666       "FALTA INDICADOR DE MOVIMIENTO FORZADO             2297".              
134667    03 ERROR-0298                          PIC X(54) VALUE                    
134668       "LA CVE NO PERM INDICADOR DE MOVIMIENTO FORZADO    2298".              
134669    03 ERROR-0299                          PIC X(54) VALUE                    
134670       "FALTA AUTORIZACION DE 3ER NIVEL                   2299".              
134671    03 ERROR-0300                          PIC X(54) VALUE                    
134672       "LA CVE NO PERM LA AUTORIZACION DE 3ER NIVEL       2300".              
134673    03 ERROR-0301                          PIC X(54) VALUE                    
134674       "FALTA REFERENCIA TIPO MEDIO DE ACCESO             2301".              
134675    03 ERROR-0302                          PIC X(54) VALUE                    
134676       "LA CVE NO PERM LA REF. TIPO MEDIO DE ACCESO       2302".              
134677    03 ERROR-0303                          PIC X(54) VALUE                    
134678       "FALTA REFERENCIA MEDIO DE ACCESO                  2303".              
134679    03 ERROR-0304                          PIC X(54) VALUE                    
134680       "LA CVE NO PERM LA REF. MEDIO DE ACCESO            2304".              
134681    03 ERROR-0305                          PIC X(54) VALUE                    
134682       "FALTA REFERENCIA INTERNACIONAL                    2305".              
134683    03 ERROR-0306                          PIC X(54) VALUE                    
134684       "LA CVE NO PERM LA REFERENCIA INTERNACIONAL        2306".              
134685    03 ERROR-0307                          PIC X(54) VALUE                    
134686       "FALTA LA SUCURSAL ORDENANTE                       2307".              
134687    03 ERROR-0308                          PIC X(54) VALUE                    
134688       "LA CVE NO PERM LA SUCURSAL ORDENANTE              2308".              
134689    03 ERROR-0309                          PIC X(54) VALUE                    
134690       "FALTA EL NOMBRE DEL ORDENANTE                     2309".              
134691    03 ERROR-0310                          PIC X(54) VALUE                    
134692       "LA CVE NO PERM EL NOMBRE DEL ORDENANTE            2310".              
134693    03 ERROR-0311                          PIC X(54) VALUE                    
134694       "FALTA LA CAUSA DE LA ORDEN                        2311".              
134695    03 ERROR-0312                          PIC X(54) VALUE                    
134696       "LA CVE NO PERM LA CAUSA DE LA ORDEN               2312".              
134697    03 ERROR-0313                          PIC X(54) VALUE                    
134698       "FALTA LA CLAVE DE AVISO                           2313".              
134699    03 ERROR-0314                          PIC X(54) VALUE                    
134700       "LA CVE NO PERM LA CLAVE DE AVISO                  2314".              
134701    03 ERROR-0315                          PIC X(54) VALUE                    
134702       "FALTA EL NUMERO DE NOMINA                         2315".              
134703    03 ERROR-0316                          PIC X(54) VALUE                    
134704       "LA CVE NO PERM EL NUMERO DE NOMINA                2316".              
134705    03 ERROR-0317                          PIC X(54) VALUE                    
134706       "LA CVE NO PERM EL NUMERO DE AUTORIZACION          2317".              
134707    03 ERROR-0318                          PIC X(54) VALUE                    
134708       "LA CVE NO PUEDE SER TRANSMITIDA POR ESTA PANTALLA 2318".              
134709    03 ERROR-0319                          PIC X(54) VALUE                    
134710       "FALTA CONTRATO DE TRASPASO                        2319".              
134711    03 ERROR-0320                          PIC X(54) VALUE                    
134712       "LA CVE NO PERM RECIBIR EL CONTRATO DE TRASPASO    2320".              
134713    03 ERROR-0321                          PIC X(54) VALUE                    
134714       "FALTA LA ESTACION DE LINEA BANAMEX                2321".              
134715    03 ERROR-0322                          PIC X(54) VALUE                    
134716       "LA CVE NO PERM RECIBIR LA ESTACION DE LINEA BMX   2322".              
134717    03 ERROR-0323                          PIC X(54) VALUE                    
134718       "FALTA EL CAMPO DE VALID DE DIG EN REF             2323".              
134719    03 ERROR-0324                          PIC X(54) VALUE                    
134720       "LA CVE NO PERM EL CAMPO DE VAL DE DIG EN REF      2324".              
134721    03 ERROR-0325                          PIC X(54) VALUE                    
134722       "FALTA EL CAMPO INDICADOR DE 2A REFERENCIA         2325".              
134723    03 ERROR-0326                          PIC X(54) VALUE                    
134724       "LA CVE NO PERM EL CAMPO IND DE 2A REFERENCIA      2326".              
134725    03 ERROR-0327                          PIC X(54) VALUE                    
134726       "FALTA EL CAMPO DE VALIDACION DE DIGITO EN CHEQUE  2327".              
134727    03 ERROR-0328                          PIC X(54) VALUE                    
134728       "LA CVE NO PERM EL CAMPO DE VAL DE DIGITO EN CHQ   2328".              
134729    03 ERROR-0329                          PIC X(54) VALUE                    
134730       "FALTA EL INDICADOR DE LINEA DE CREDITO            2329".              
134731    03 ERROR-0330                          PIC X(54) VALUE                    
134732       "LA CVE NO PERM EL INDICADOR DE LINEA DE CREDITO   2330".              
134733    03 ERROR-0331                          PIC X(54) VALUE                    
134734       "FALTA EL CAMPO DE TIPO DE BLOQUEO                 2331".              
134735    03 ERROR-0332                          PIC X(54) VALUE                    
134736       "LA CVE NO PERM EL CAMPO DE TIPO DE BLOQUEO        2332".              
134737    03 ERROR-0333                          PIC X(54) VALUE                    
134738       "FALTA EL CAMPO DE NOMBRE                          2333".              
134739    03 ERROR-0334                          PIC X(54) VALUE                    
134740       "LA CVE NO PERM EL CAMPO DE NOMBRE                 2334".              
134741    03 ERROR-0335                          PIC X(54) VALUE                    
134742       "LA CVE NO PERM EL CAMPO DE TIPO DE PERSONA        2335".              
134743    03 ERROR-0336                          PIC X(54) VALUE                    
134744       "FALTA EL CAMPO DE SEGMENTO                        2336".              
134745    03 ERROR-0337                          PIC X(54) VALUE                    
134746       "LA CVE NO PERM EL CAMPO DE SEGMENTO               2337".              
134747    03 ERROR-0338                          PIC X(54) VALUE                    
134748       "FALTA EL CAMPO DE CLAVE PERSONAL BANAMEX          2338".              
134749    03 ERROR-0339                          PIC X(54) VALUE                    
134750       "LA CVE NO PERM EL CAMPO DE CVE PERSONAL BANAMEX   2339".              
134751    03 ERROR-0340                          PIC X(54) VALUE                    
134752       "FALTA EL CAMPO DE DIA DE CORTE                    2340".              
134753    03 ERROR-0341                          PIC X(54) VALUE                    
134754       "LA CVE NO PERM EL CAMPO DE DIA DE CORTE           2341".              
134755    03 ERROR-0342                          PIC X(54) VALUE                    
134756       "FALTA EL CAMPO DE RESTRICCIONES                   2342".              
134757    03 ERROR-0343                          PIC X(54) VALUE                    
134758       "LA CVE NO PERM EL CAMPO DE RESTRICCIONES          2343".              
134759    03 ERROR-0344                          PIC X(54) VALUE                    
134760       "FALTA EL CAMPO DE RESTRICCIONES CTA CONCENTRADORA 2344".              
134761    03 ERROR-0345                          PIC X(54) VALUE                    
134762       "LA CVE NO PERM EL CAMPO DE REST CTA CONCENTRADORA 2345".              
134763    03 ERROR-0346                          PIC X(54) VALUE                    
134764       "FALTA EL CAMPO DE PRODUCTO                        2346".              
134765    03 ERROR-0347                          PIC X(54) VALUE                    
134766       "LA CVE NO PERM EL CAMPO DE PRODUCTO               2347".              
134767    03 ERROR-0348                          PIC X(54) VALUE                    
134768       "FALTA EL CAMPO DE INSTRUMENTO                     2348".              
134769    03 ERROR-0349                          PIC X(54) VALUE                    
134770       "LA CVE NO PERM EL CAMPO DE INSTRUMENTO            2349".              
134771    03 ERROR-0350                          PIC X(54) VALUE                    
134772       "FALTA EL CAMPO DE SECTOR                          2350".              
134773    03 ERROR-0351                          PIC X(54) VALUE                    
134774       "LA CVE NO PERM EL CAMPO DE SECTOR                 2351".              
134775    03 ERROR-0352                          PIC X(54) VALUE                    
134776       "FALTA EL CAMPO DE CUENTA CONCENTRADORA            2352".              
134777    03 ERROR-0353                          PIC X(54) VALUE                    
134778       "LA CVE NO PERM EL CAMPO DE CUENTA CONCENTRADORA   2353".              
134779    03 ERROR-0354                          PIC X(54) VALUE                    
134780       "FALTA EL CAMPO DE NUEVA SUCURSAL PROMOTORA        2354".              
134781    03 ERROR-0355                          PIC X(54) VALUE                    
134782       "LA CVE NO PERM EL CAMPO DE NUEVA SUC PROMOTORA    2355".              
134783    03 ERROR-0356                          PIC X(54) VALUE                    
134784       "FALTA EL CAMPO DE SUCURSAL PROMOTORA              2356".              
134785    03 ERROR-0357                          PIC X(54) VALUE                    
134786       "LA CVE NO PERM EL CAMPO DE SUC PROMOTORA          2357".              
134787    03 ERROR-0358                          PIC X(54) VALUE                    
134788       "EL IMP. OBANCOS + IMP EFEC DEBE SER <= AL DEPOSITO2358".              
134789    03 ERROR-0359                          PIC X(54) VALUE                    
134790       "ESTA SUC. NO PUEDE TRANSMITIR A CUENTA DE OTRA    2359".              
134791    03 ERROR-0360                          PIC X(54) VALUE                    
134792       "INDICADOR DE MOVIMIENTO FORZADO INVALIDO          2360".              
134793    03 ERROR-0361                          PIC X(54) VALUE                    
134794       "LA AUTORIZACION NO PUEDE SER MAYOR A 99999999     2361".              
134795    03 ERROR-0362                          PIC X(54) VALUE                    
134796       "LA REFERENCIA TIPO MEDIO DE ACCESO INVALIDO       2362".              
134797    03 ERROR-0363                          PIC X(54) VALUE                    
134798       "SITUACION DE CGIROS > QUE EL IMPORTE DEL DEPOSITO 2363".              
134799    03 ERROR-0364                          PIC X(54) VALUE                    
134800       "SE EXIGE LA REFERENCIA PARA ESTA CVE EN CTA. CONC.2364".              
134801    03 ERROR-0365                          PIC X(54) VALUE                    
134802       "INDICADOR DE MEDIO DE ACCESO CHEQUERA INVALIDO    CTRL".              
134803    03 ERROR-0366                          PIC X(54) VALUE                    
134804       "INDICADOR DE MEDIO DE ACCESO TARJETA INVALIDO     CTRL".              
134805    03 ERROR-0367                          PIC X(54) VALUE                    
134806       "LA FECHA DE DEPOSITO NO PUEDE SER DIA INHABIL     2367".              
134807    03 ERROR-0368                          PIC X(54) VALUE                    
134808       "FECHA VALOR INVALIDA O FORMATO INCORRECTO         2368".              
134809    03 ERROR-0369                          PIC X(54) VALUE                    
134810       "LA FECHA VAL. NO PUEDE SER > O = A LA FECHA CONT. 2369".              
134811    03 ERROR-0370                          PIC X(54) VALUE                    
134812       "EL CONTRATO DE TRASPASO NO PUEDE REPETIRSE        2370".              
134813    03 ERROR-0371                          PIC X(54) VALUE                    
134814       "LA DEVOLUCION SE PRESENTA DESPUES DE 30 DIAS      2371".              
134815    03 ERROR-0372                          PIC X(54) VALUE                    
134816       "CAUSA DEVOL DEBE SER > 0 Y < 25, O = 51 O = 52    2372".              
134817    03 ERROR-0373                          PIC X(54) VALUE                    
134818       "EL BANCO DIGITADO ES INVALIDO                     2373".              
134819    03 ERROR-0374                          PIC X(54) VALUE                    
134820       "CHEQUE NO LIBERADO CON FONDOS EN LA CUENTA        1465".              
134821    03 ERROR-0375                          PIC X(54) VALUE                    
134822       "CHEQUE PREVIAMENTE PAGADO                         1466".              
134823    03 ERROR-0376                          PIC X(54) VALUE                    
134824       "CHEQUE INEXISTENTE                                1467".              
134825    03 ERROR-0377                          PIC X(54) VALUE                    
134826       "ESTA CLAVE NO PUEDE SER TRANSMITIDA POR CONTRATO  2377".              
134827    03 ERROR-0378                          PIC X(54) VALUE                    
134828       "ESTA CLAVE NO PUEDE SER TRANSMITIDA POR CHEQUERA  2378".              
134829    03 ERROR-0379                          PIC X(54) VALUE                    
134830       "ESTA CLAVE NO PUEDE SER TRANSMITITA POR TARJETA   2379".              
134831    03 ERROR-0380                          PIC X(54) VALUE                    
134832       "NO HAY NADA QUE APLICAR, YA SE LIBERO             2380".              
134833    03 ERROR-0381                          PIC X(54) VALUE                    
134834       "YA FUE LIBERADO EN FORMA GLOBAL                   2381".              
134835    03 ERROR-0382                          PIC X(54) VALUE                    
134836       "MEDIO DE ACCESO INACTIVO                          2382".              
134837    03 ERROR-0383                          PIC X(54) VALUE                    
134838       "MED. DE ACC. DADO DE BAJA A SOLICITUD DEL CLIENTE 2383".              
134839    03 ERROR-0384                          PIC X(54) VALUE                    
134840       "MEDIO DE ACCESO BLOQUEADO POR FALLECIMIENTO       2384".              
134841    03 ERROR-0385                          PIC X(54) VALUE                    
134842       "MEDIO DE ACCESO BLOQUEADO X ORDEN JUDICIAL        2385".              
134843    03 ERROR-0386                          PIC X(54) VALUE                    
134844       "MEDIO DE ACCESO DADO DE BAJA X CONVENIR AL BANCO  2386".              
134845    03 ERROR-0387                          PIC X(54) VALUE                    
134846       "MEDIO DE ACCESO REPORTADO COMO ROBADO             2387".              
134847    03 ERROR-0388                          PIC X(54) VALUE                    
134848       "MEDIO DE ACCESO REPORTADO COMO EXTRAVIADO         2388".              
134849    03 ERROR-0389                          PIC X(54) VALUE                    
134850       "MEDIO DE ACCESO DADO DE BAJA POR ALTA ERRONEA     2389".              
134851    03 ERROR-0390                          PIC X(54) VALUE                    
134852       "ESTATUS DESCONOCIDO DEL MEDIO DE ACCESO           2390".              
134853    03 ERROR-0391                          PIC X(54) VALUE                    
134854       "                                                      ".              
134855    03 ERROR-0392                          PIC X(54) VALUE                    
134856       "                                                      ".              
134857    03 ERROR-0393                          PIC X(54) VALUE                    
134858       "                                                      ".              
134859    03 ERROR-0394                          PIC X(54) VALUE                    
134860       "EL IMP. DE LA TRAN. DEBE SER < 10,000,000,000.00  2394".              
134861    03 ERROR-0395                          PIC X(54) VALUE                    
134862       "EL IMP. O BANC. DEBE SER < 10,000,000,000.00      2395".              
134863    03 ERROR-0396                          PIC X(54) VALUE                    
134864       "EL CTO RECIBE SOLO CARGOS 2005,2006,2007 Y 2186   2396".              
134865    03 ERROR-0397                          PIC X(54) VALUE                    
134866       "CONTRATO BLOQUEADO POR INACTIVIDAD                2397".              
134867    03 ERROR-0398                          PIC X(54) VALUE                    
134868       "CONTRATO BLOQUEADO POR FALLECIMIENTO              2398".              
134869    03 ERROR-0399                          PIC X(54) VALUE                    
134870       "CONTRATO BLOQUEADO POR CONVENIR AL BANCO          2399".              
134871    03 ERROR-0400                          PIC X(54) VALUE                    
134872       "CONTRATO TIENE SALDO PENDIENTE                    2400".              
134873    03 ERROR-0401                          PIC X(54) VALUE                    
134874       "                                                      ".              
134875    03 ERROR-0402                          PIC X(54) VALUE                    
134876       "EL CONTRATO TIENE AUTORIZACIONES PENDIENTES       2402".              
134877    03 ERROR-0403                          PIC X(54) VALUE                    
134878       "EL CONTRATO TIENE SALDO PENDIENTE BLOQUEADO       2403".              
134879    03 ERROR-0404                          PIC X(54) VALUE                    
134880       "EL CONTRATO TIENE ADEUDO EN LINEA DE CREDITO      2404".              
134881    03 ERROR-0405                          PIC X(54) VALUE                    
134882       "NO SE PERMITE CANCELACION FECVAL PARA ESTE INSTRUM2405".              
134883    03 ERROR-0406                          PIC X(54) VALUE                    
134884       "EL CTO TIENE MOVTOS POSTERIORES A LA FECHA VALOR  2406".              
134885    03 ERROR-0407                          PIC X(54) VALUE                    
134886       "CLAVE NO PERMITIDA PARA TRANSACCIONES FORANEAS    2407".              
134887    03 ERROR-0408                          PIC X(54) VALUE                    
134888       "SOLO SE PERMITEN TRANS. FORANEAS POR CHEQUERA     2408".              
134889    03 ERROR-0409                          PIC X(54) VALUE                    
134890       "LA REFERENCIA MDA DEBE SER CHEQUERA O TARJETA     2409".              
134891    03 ERROR-0410                          PIC X(54) VALUE                    
134892       "TIPO DE BLOQUEO INVALIDO                          2410".              
134893    03 ERROR-0411                          PIC X(54) VALUE                    
134894       "EL CONTRATO TIENE SALDO SALVO BUEN COBRO          2411".              
134895    03 ERROR-0412                          PIC X(54) VALUE                    
134896       "NO EXISTE REGISTRO DE LOG                         2412".              
134897    03 ERROR-0413                          PIC X(54) VALUE                    
134898       "LAS CTAS. CONCENTRADORAS NO RECIBEN MOVTOS. X CTO.2413".              
134899    03 ERROR-0414                          PIC X(54) VALUE                    
134900       "PROBLEMAS CON LIN. CRED. EN CONTRATO DE TRASPASO. 2414".              
134901    03 ERROR-0415                          PIC X(54) VALUE                    
134902       "                                                      ".              
134903    03 ERROR-0416                          PIC X(54) VALUE                    
134904       "CLAVE NO PERMITIDA EN BASE AUXILIAR               2416".              
134905    03 ERROR-0417                          PIC X(54) VALUE                    
134906       "MOVIMIENTO DUPLICADO ELIMINADO                    2417".              
134907    03 ERROR-0418                          PIC X(54) VALUE                    
134908       "USA LA PANTALLA Q050000 DEL SIST. INT. DE CAPTA.  2418".              
134909    03 ERROR-0419                          PIC X(54) VALUE                    
134910       "NO SE PUEDE HACER EL CAMB DE PROD,HOY CORTA EN CTO2419".              
134911    03 ERROR-0420                          PIC X(54) VALUE                    
134912       "NO PUEDO HACER QUE HOY CORTE EL CTO,HAY CAMB PROD 2420".              
134913    03 ERROR-0421                          PIC X(54) VALUE                    
134914       "PRODUCTO INEXISTENTE EN EL SISTEMA S408           2421".              
134915    03 ERROR-0422                          PIC X(54) VALUE                    
134916       "LIBRERIA HABILITADA CON USER DIFERENTE DE S408    2422".              
134917    03 ERROR-0423                          PIC X(54) VALUE                    
134918       "FECHA DE PROCESO INVALIDA AL ACCESAR AL S408      2423".              
134919    03 ERROR-0424                          PIC X(54) VALUE                    
134920       "LINEA DE CREDITO CASTIGADA NO RECIBE ABOS NI CGOS 2424".              
134921    03 ERROR-0425                          PIC X(54) VALUE                    
134922       "EL SALDO DEBE ESTAR EN CERO PARA PODER CANCELAR   2425".              
134923    03 ERROR-0426                          PIC X(54) VALUE                    
134924       "SOLO EXISTE LINEA DE CREDITO FORZADA EN S408      2426".              
134925    03 ERROR-0427                          PIC X(54) VALUE                    
134926       "NO SE PUEDE DAR DE BAJA EL IND. DE LC EN BASE AUX.2427".              
134927    03 ERROR-0428                          PIC X(54) VALUE                    
134928       "EL IMP. + SDO. DEBE SER < AL ADEUDO EN LIN. CRED. 2428".              
134929    03 ERROR-0429                          PIC X(54) VALUE                    
134930       "                                                      ".              
134931    03 ERROR-0430                          PIC X(54) VALUE                    
134932       "                                                      ".              
134933    03 ERROR-0431                          PIC X(54) VALUE                    
134934       "                                                      ".              
134935    03 ERROR-0432                          PIC X(54) VALUE                    
134936       "PREVENCIONES NO DISPONIBLE                        1468".              
134937    03 ERROR-0433                          PIC X(54) VALUE                    
134938       "REINTENTE NUEVAMENTE EL MOVIMIENTO                1916".              
134939    03 ERROR-0434                          PIC X(54) VALUE                    
134940       "P.F. REINTENTE MAS TARDE, CAMB DE PROD EN BASE AUX2434".              
134941    03 ERROR-0435                          PIC X(54) VALUE                    
134942       "EL PRODUCTO NO COINCIDE CON EL DEL CTO. EN S408   2435".              
134943    03 ERROR-0436                          PIC X(54) VALUE                    
134944       "CSI INVALIDO O NO NUMERICO                        2436".              
134945    03 ERROR-0437                          PIC X(54) VALUE                    
134946       "EL CONTRATO NO ESTA CANCELADO                     2437".              
134947    03 ERROR-0438                          PIC X(54) VALUE                    
134948       "MOVIMIENTO DUPLICADO PARA CTO. DE TRASPASO        2438".              
134949    03 ERROR-0439                          PIC X(54) VALUE                    
134950       "MOVIMIENTO FORANEO PREVIAMENTE RECHAZADO          2439".              
134951    03 ERROR-0440                          PIC X(54) VALUE                    
134952       "NO SE PERMITE REACT. EL CTO. EL DIA QUE SE CANCELO2440".              
134953    03 ERROR-0441                          PIC X(54) VALUE                    
134954       "IMPORTE DE OTROS BANCOS NO NUMERICO               2441".              
134955    03 ERROR-0442                          PIC X(54) VALUE                    
134956       "SEGUNDO IMPORTE NO NUMERICO                       2442".              
134957    03 ERROR-0443                          PIC X(54) VALUE                    
134958       "TERCER IMPORTE NO NUMERICO                        2443".              
134959    03 ERROR-0444                          PIC X(54) VALUE                    
134960       "IMPORTE DE EFECTIVO NO NUMERICO                   2444".              
134961    03 ERROR-0445                          PIC X(54) VALUE                    
134962       "EL IMPORTE EXCEDE EL LIMITE DE PAGO POR CUENTA    2445".              
134963    03 ERROR-0446                          PIC X(54) VALUE                    
134964       "PROBLEMAS CON S016 POR EL MOMENTO NO HAY APERTURAS2446".              
134965    03 ERROR-0447                          PIC X(54) VALUE                    
134966       "PROBLEMAS CON S016 POR EL MOMENTO NO HAY CANCEL.  2447".              
134967    03 ERROR-0448                          PIC X(54) VALUE                    
134968       "NO PUDE ELIMINAR, EL MOVTO. TIENE ORIGEN DIFERENTE2448".              
134969    03 ERROR-0449                          PIC X(54) VALUE                    
134970       "ESTA TRANSACCIONES DEBEN SER EN MONEDA NACIONAL   2449".              
134971    03 ERROR-0450                          PIC X(54) VALUE                    
134972       "NO SE TIENE EL TIPO DE CAMBIO PARA ESTA TRANSACCIO2450".              
134973    03 ERROR-0451                          PIC X(54) VALUE                    
134974       "SALDO MINIMO NO NUMERICO                          2451".              
134975    03 ERROR-0452                          PIC X(54) VALUE                    
134976       "CAMPO DE SALDO MINIMO NO PERMITIDO PARA ESTA CVE. 2452".              
134977    03 ERROR-0453                          PIC X(54) VALUE                    
134978       "CAMPO DE EFECTA RESULTADOS INVALIDO O NO NUMERICO 2453".              
134979    03 ERROR-0454                          PIC X(54) VALUE                    
134980       "CAMPO DE OCURRENCIA HISTORICO NO NUMERICO         2454".              
134981    03 ERROR-0455                          PIC X(54) VALUE                    
134982       "SIGUIENTE OCURRENCIA INVALIDA O NO NUMERICA       2455".              
134983    03 ERROR-0456                          PIC X(54) VALUE                    
134984       "OCURRENCIA INVALIDA O NO NUMERICA                 2456".              
134985    03 ERROR-0457                          PIC X(54) VALUE                    
134986       "CLAVE DE COMISION PENDIENTE NO NUMERICA           2457".              
134987    03 ERROR-0458                          PIC X(54) VALUE                    
134988       "CVE NO CONTABLE DE COMISION PENDIENTE NO NUMERICA 2458".              
134989    03 ERROR-0459                          PIC X(54) VALUE                    
134990       "SE ENVIA EN CEROS EL NUMERO DE SISTEMA AL S408    2459".              
134991    03 ERROR-0460                          PIC X(54) VALUE                    
134992       "SE ENVIA EN CEROS EL NUMERO DE PASO AL S408       2460".              
134993    03 ERROR-0461                          PIC X(54) VALUE                    
134994       "SE ENVIA EN CEROS LA SUC. PROM U OPERADORA AL S4082461".              
134995    03 ERROR-0462                          PIC X(54) VALUE                    
134996       "EL S408 TUVO ERROR AL CARGAR TASAS DEL S080       2462".              
134997    03 ERROR-0463                          PIC X(54) VALUE                    
134998       "EL S408 REPORTA UN ENVIO DE MONEDA INVALIDA       2463".              
134999    03 ERROR-0464                          PIC X(54) VALUE                    
135000       "SE ENVIA EN CEROS EL IMPORTE AL S408              2464".              
135001    03 ERROR-0465                          PIC X(54) VALUE                    
135002       "SE ENVIA DIA DE CORTE INVALIDO AL S408            2465".              
135003    03 ERROR-0466                          PIC X(54) VALUE                    
135004       "SE ENVIA UNA FUNCION ILEGAL AL S408               2466".              
135005    03 ERROR-0467                          PIC X(54) VALUE                    
135006       "SE ENVIA NUMERO DE CLIENTE EN CEROS AL S408       2467".              
135007    03 ERROR-0468                          PIC X(54) VALUE                    
135008       "LA LINEA DE CREDITO EN EL S408 SOLO ACEPTA ABONOS 2468".              
135009    03 ERROR-0469                          PIC X(54) VALUE                    
135010       "EL MOVTO F.V. DEBE SER POSTERIOR AL CAMBIO DE PRD 2469".              
135011    03 ERROR-0470                          PIC X(54) VALUE                    
135012       "SE REQUIERE HABER TRANSMITIDO EL CHEQUE CON 2001  2470".              
135013    03 ERROR-0471                          PIC X(54) VALUE                    
135014       "EL CHEQUE ST YA FUE PAGADO CON RECURSOS PROPIOS   2471".              
135015    03 ERROR-0472                          PIC X(54) VALUE                    
135016       "EL IMPORTE DEL CHEQUE ST SOBREPASA EL LIMITE      2472".              
135017    03 ERROR-0473                          PIC X(54) VALUE                    
135018       "EL CHEQUE ST YA SE PAGO USANDO LA LINEA AUTOMATICA2473".              
135019    03 ERROR-0474                          PIC X(54) VALUE                    
135020       "LA DEVOLUCION TIENE UN STATUS MAYOR DE 2          2474".              
135021    03 ERROR-0475                          PIC X(54) VALUE                    
135022       "LA DEVOLUCION GENERADA POR LA 2001 ESTA ELIMINADA 2475".              
135023    03 ERROR-0476                          PIC X(54) VALUE                    
135024       "PARA ELIMINAR, ELIMINE PRIMERO LA CLAVE ST PREVIA 2476".              
135025    03 ERROR-0477                          PIC X(54) VALUE                    
135026       "ESTA TRAN. DEBE EFECTUARSE CON FIRMA MANCOMUNADA  2477".              
135027    03 ERROR-0478                          PIC X(54) VALUE                    
135028       "FONDOS INSUFICIENTES N.L.                         2478".              
135029    03 ERROR-0479                          PIC X(54) VALUE                    
135030       "CAMPO DE CAJA QUE TRANSMITIO INVALIDA O NO NUM.   2479".              
135031    03 ERROR-0480                          PIC X(54) VALUE                    
135032       "CAMPO DE SUCURSAL QUE TRANSMITIO INVAL.O NO NUM.  2480".              
135033    03 ERROR-0481                          PIC X(54) VALUE                    
135034       "EL CONTRATO NO ESTA BLOQUEADO                     2481".              
135035    03 ERROR-0482                          PIC X(54) VALUE                    
135036       "UTILICE OPCION TELETON                            2482".              
135037    03 ERROR-0483                          PIC X(54) VALUE                    
135038       "UTILICE LA PANTALLA Q050100                       2483".              
135039    03 ERROR-0484                          PIC X(54) VALUE                    
135040       "DEPOSITO > AL PERMITIDO POR REQUISITOS INCOMPLETOS2484".              
135041    03 ERROR-0485                          PIC X(54) VALUE                    
135042       "RESTRICCION POR REQUISITOS INCOMPLETOS            2485".              
135043    03 ERROR-0486                          PIC X(54) VALUE                    
135044       "CONTRATO CANCELADO POR REQUISITOS INCOMPLETOS     2486".              
135045    03 ERROR-0487                          PIC X(54) VALUE                    
135046       "RESTRICCION POR DOCUMENTACION FALSA               2487".              
135047    03 ERROR-0488                          PIC X(54) VALUE                    
135048       "RESTRICCION POR REFERENCIA CON FRAUDE/ILICITO     2488".              
135049    03 ERROR-0489                          PIC X(54) VALUE                    
135050       "RESTRICCION POR DICTAMEN JURIDICO DECLINADO       2489".              
135051    03 ERROR-0490                          PIC X(54) VALUE                    
135052       "CONTRATO CANCELADO POR DOCUMENTACION FALSA        2490".              
135053    03 ERROR-0491                          PIC X(54) VALUE                    
135054       "CONTRATO CANCELADO POR REFERENCIA FRAUDE/ILICITO  2491".              
135055    03 ERROR-0492                          PIC X(54) VALUE                    
135056       "CONTRATO CANCELADO POR DICTAMEN JURIDICO DECLINADO2492".              
135057    03 ERROR-0493                          PIC X(54) VALUE                    
135058       "UTILICE LA PANTALLA Q0PRE11 DEL SISTEMA S127      2493".              
135059    03 ERROR-0494                          PIC X(54) VALUE                    
135060       "MEDIO DE ACCESO CANCEL. X REQUISITOS INCOMPLETOS  2494".              
135061    03 ERROR-0495                          PIC X(54) VALUE                    
135062       "MEDIO DE ACCESO CANCEL. X DOCUMENTACION FALSA     2495".              
135063    03 ERROR-0496                          PIC X(54) VALUE                    
135064       "MEDIO DE ACCESO CANCEL. X REFERENCIA FRAUDE/ILICIT2496".              
135065    03 ERROR-0497                          PIC X(54) VALUE                    
135066       "MEDIO DE ACCESO CANCEL. X DICTAMEN JURIDICO DECLIN2497".              
135067    03 ERROR-0498                          PIC X(54) VALUE                    
135068       "EL NUM. DE CONTRATO NO COINCIDE EN LINEAS DE SERV.2498".              
135069    03 ERROR-0499                          PIC X(54) VALUE                    
135070       "EL IMPORTE NO COINCIDE EN LINEAS DE SERVICIO      2499".              
135071    03 ERROR-0500                          PIC X(54) VALUE                    
135072       "PARA DAR DE ALTA ESQ. CONT. DEBE EXISTIR UN B05   2500".              
135073    03 ERROR-0501                          PIC X(54) VALUE                    
135074       "LAS BAJAS SE DAN POR LA PANTALLA 50090            2501".              
135075    03 ERROR-0502                          PIC X(54) VALUE                    
135076       "BANCO ORIGEN MAL TECLEADO                         2502".              
135077    03 ERROR-0503                          PIC X(54) VALUE                    
135078       "BANCO DESTINO MAL TECLEADO                        2503".              
135079    03 ERROR-0504                          PIC X(54) VALUE                    
135080       "NUMERO DE BANCO ORIGEN O DESTINO NO VALIDO        2504".              
135081    03 ERROR-0505                          PIC X(54) VALUE                    
135082       "LA PAREJA SEC-ESQCON DEBE TRAER VALOR O ESPACIOS  2505".              
135083    03 ERROR-0506                          PIC X(54) VALUE                    
135084       "IMPORTE > AL MAX. PARA PAGO DE CHEQUE DE OPERCRUZA2506".              
135085    03 ERROR-0507                          PIC X(54) VALUE                    
135086       "DIGITO VERIF. DE TRANSACCION CON BCMR INCORRECTO  2507".              
135087    03 ERROR-0508                          PIC X(54) VALUE                    
135088       "OFICINA NO AUTORIZADA PARA REALIZAR ESTA OPERACION2508".              
135089    03 ERROR-0509                          PIC X(54) VALUE                    
135090       "LA CUENTA NO ACEPTA CHEQUES                       2509".              
135091    03 ERROR-0510                          PIC X(54) VALUE                    
135092       "IMPORTE MAXIMO DE CARGO NO NUMERICO               2510".              
135093    03 ERROR-0511                          PIC X(54) VALUE                    
135094       "CAMPO DE IMP. MAX. DE CGO. NO PERM. PARA ESTA CVE.2511".              
135095    03 ERROR-0512                          PIC X(54) VALUE                    
135096       "FALTA CAMPO DE IMPORTE MAXIMO DE CARGO            2512".              
135097    03 ERROR-0513                          PIC X(54) VALUE                    
135098       "EL CTO. NO PUEDE RECIBIR DEPOSITOS > A $15,000.00 2513".              
135099    03 ERROR-0514                          PIC X(54) VALUE                    
135100       "NO SE PUDO CANCELAR NO HAY TASAS EN EL S080       2514".              
135101    03 ERROR-0515                          PIC X(54) VALUE                    
135102       "NO SE PUDO CANCELAR NO EXISTE INSTRUMENTO EN S500 2515".              
135103    03 ERROR-0516                          PIC X(54) VALUE                    
135104       "REFERENCIA ALFANUMERICA INVALIDA                  2516".              
135105    03 ERROR-0517                          PIC X(54) VALUE                    
135106       "IMPORTE DE DEPOSITO MENOR A MONTO MINIMO DE APERT.2517".              
135107    03 ERROR-0518                          PIC X(54) VALUE                    
135108       "LAS CLAVES 2131 Y 2132 SON SOLO P/ CTAMAE Y OPC.  2518".              
135109    03 ERROR-0519                          PIC X(54) VALUE                    
135110       "                                                      ".              
135111    03 ERROR-0520                          PIC X(54) VALUE                    
135112       "IND. LINCRED CON RESPALDO EN INV. INT. YA ACTIVADO2520".              
135113    03 ERROR-0521                          PIC X(54) VALUE                    
135114       "COMISION MAYOR QUE DISPONIBLE                     2521".              
135115    03 ERROR-0522                          PIC X(54) VALUE                    
135116       "IND. LINCRED CON RESPALDO EN INV. INT. YA DESACT. 2522".              
135117    03 ERROR-0523                          PIC X(54) VALUE                    
135118       "ELIMINACION EN DUDA                               2523".              
135119    03 ERROR-0524                          PIC X(54) VALUE                    
135120       "REFERENCIA NUMERICA = ALFANUMERICA                2524".              
135121    03 ERROR-0525                          PIC X(54) VALUE                    
135122       "INCONSISTENCIA DB MODULO DE VAL REF NUME/ALFA INEX2525".              
135123    03 ERROR-0526                          PIC X(54) VALUE                    
135124       "REFERENCIA ALFANUMERICA CON MAS DE 20 CARACTERES  2526".              
135125    03 ERROR-0527                          PIC X(54) VALUE                    
135126       "MOVIMIENTO NO PERMITIDO PARA TARJETA SKY          5527".              
135127    03 ERROR-0528                          PIC X(54) VALUE                    
135128       "NUMERO DE MODULO INVALIDO                         4528".              
135129    03 ERROR-0529                          PIC X(54) VALUE                    
135130       "INDICADOR DE RESTA DE DECENA SUPERIOR INVALIDO    4529".              
135131    03 ERROR-0530                          PIC X(54) VALUE                    
135132       "MODULO INVALIDO                                   4530".              
135133    03 ERROR-0531                          PIC X(54) VALUE                    
135134       "CAMPO DE TAMAµO DE REFERENCIA INVALIDO            4531".              
135135    03 ERROR-0532                          PIC X(54) VALUE                    
135136       "NO. DE DIGITOS DEL MODULO INVALIDO                4532".              
135137    03 ERROR-0533                          PIC X(54) VALUE                    
135138       "DIGITO A SUMAR A DIGITO VERIFICADOR INVALIDO      4533".              
135139    03 ERROR-0534                          PIC X(54) VALUE                    
135140       "CAMPO DE ALINEACION INVALIDO                      4534".              
135141    03 ERROR-0535                          PIC X(54) VALUE                    
135142       "CAMPO DE SEPARA DECENAS DE UNIDADES INVALIDO      4535".              
135143    03 ERROR-0536                          PIC X(54) VALUE                    
135144       "CAMPO DE NO A SUMAR AL RESULTADO INVALIDO         4536".              
135145    03 ERROR-0537                          PIC X(54) VALUE                    
135146       "CAMPO DE NO A RESTAR AL RESIDUO INVALIDO          4537".              
135147    03 ERROR-0538                          PIC X(54) VALUE                    
135148       "CAMPO DE NO MAXIMO DE DIGITO VERIFICADOR INVALIDO 4538".              
135149    03 ERROR-0539                          PIC X(54) VALUE                    
135150       "EL CAMPO DE NOMBRE NO PUEDE SER ESPACIOS          4539".              
135151    03 ERROR-0540                          PIC X(54) VALUE                    
135152       "EL CAMPO DE FACTOR INVALIDO                       4540".              
135153    03 ERROR-0541                          PIC X(54) VALUE                    
135154       "CLIENTE SIN SERVICIOS DE LINEA BANAMEX DIGITEM    4541".              
135155    03 ERROR-0542                          PIC X(54) VALUE                    
135156       "IMPORTE MAYOR AL PERMITIDO                        4542".              
135157    03 ERROR-0543                          PIC X(54) VALUE                    
135158       "PROBLEMAS DEL S408 AL CONSULTAR EL SALDO DEL S084 4543".              
135159    03 ERROR-0544                          PIC X(54) VALUE                    
135160       "IMPORTE DE CARGO MENOR QUE IMPORTE MINIMO DE CGO. 4544".              
135161    03 ERROR-0545                          PIC X(54) VALUE                    
135162       "COMISION A BORRAR INVALIDA O NO NUMERICA          4545".              
135163    03 ERROR-0546                          PIC X(54) VALUE                    
135164       "COMBINACION OPC. D ELIM Y COM. A BORRAR INVALIDA  4546".              
135165    03 ERROR-0547                          PIC X(54) VALUE                    
135166       "OPCION DE ELIMINACION DE COMISION INVALIDA        4547".              
135167    03 ERROR-0548                          PIC X(54) VALUE                    
135168       "MOVIMIENTO DE CARGO PENDIENTE DUPLICADO           2548".              
135169    03 ERROR-0549                          PIC X(54) VALUE                    
135170       "MOVIMIENTO DE CARGO PENDIENTE DUPLICADO ELIMINADO 2549".              
135171    03 ERROR-0550                          PIC X(54) VALUE                    
135172       "NO SE PUEDE ELIMINAR EL CGO PEND YA TIENE ABONOS  2550".              
135173    03 ERROR-0551                          PIC X(54) VALUE                    
135174       "NO EXISTE(N) COMISION(ES) PENDIENTE(S) A ELIMINAR 2551".              
135175    03 ERROR-0552                          PIC X(54) VALUE                    
135176       "DATASET A REESTABLECER INVALIDO O NO NUMERICO     2552".              
135177    03 ERROR-0553                          PIC X(54) VALUE                    
135178       "CLAVE TRANSFORMA INVALIDA O NO NUMERICO           2553".              
135179    03 ERROR-0554                          PIC X(54) VALUE                    
135180       "DATASETS A GENERAR INVALIDO O NO NUMERICO         2554".              
135181    03 ERROR-0555                          PIC X(54) VALUE                    
135182       "TIPO DE PAGO INVALIDO O NO NUMERICO               2555".              
135183    03 ERROR-0556                          PIC X(54) VALUE                    
135184       "SISTEMA ARCHIVO INVALIDO O NO NUMERICO            2556".              
135185    03 ERROR-0557                          PIC X(54) VALUE                    
135186       "NO EXISTE REGISTRO EN B24 A ELIMINAR              2557".              
135187    03 ERROR-0558                          PIC X(54) VALUE                    
135188       "NO EXISTE REGISTRO EN B25 A ELIMINAR              2558".              
135189    03 ERROR-0559                          PIC X(54) VALUE                    
135190       "ORIGEN LOCAL INVALIDO                             2559".              
135191    03 ERROR-0560                          PIC X(54) VALUE                    
135192       "INCONSISTENCIA DB MODULO EN CEROS                 2560".              
135193    03 ERROR-0561                          PIC X(54) VALUE                    
135194       "INCONSISTENCIA MODULO Y RESTA DE DECSUP           2561".              
135195    03 ERROR-0562                          PIC X(54) VALUE                    
135196       "CHEQUE CON CHVV SIN CODIGO EN EL S127             2562".              
135197    03 ERROR-0563                          PIC X(54) VALUE                    
135198       "CHEQUE CON CHVV DIFERENTE AL CODIGO EN EL S127    2563".              
135199    03 ERROR-0564                          PIC X(54) VALUE                    
135200       "CHEQUE SIN CHVV PERO CON CODIGO EN EL S127        2564".              
135201    03 ERROR-0565                          PIC X(54) VALUE                    
135202       "CODIGO SEGURIDAD NO NUMERICO                      2565".              
135203    03 ERROR-0566                          PIC X(54) VALUE                    
135204       "DIGIT. A LA DERECHA DE DIGITO VERIFICADOR INVALIDO2566".              
135205    03 ERROR-0567                          PIC X(54) VALUE                    
135206       "IND. FORZAR CODIGO SEGURIDAD INVALIDO             2567".              
135207    03 ERROR-0568                          PIC X(54) VALUE                    
135208       "EL CTO. SOLO RECIBE CARGOS DE COBZA. ELECT. PEMEX 2568".              
135209    03 ERROR-0569                          PIC X(54) VALUE                    
135210       "FALTA REGISTRO DE SBC A 6 DIAS, NO SE PUEDE ELIM. 2569".              
135211    03 ERROR-0570                          PIC X(54) VALUE                    
135212       "DEVOLS SBC T+6 SE TRANSMITEN DE 6 DIAS EN ADELANTE2570".              
135213    03 ERROR-0571                          PIC X(54) VALUE                    
135214       "LONGITUD REFERERENCIA NUMERICA INVALIDA           2571".              
135215    03 ERROR-0572                          PIC X(54) VALUE                    
135216       "LONGITUD REFERERENCIA ALFANUMERICA INVALIDA       2572".              
135217    03 ERROR-0573                          PIC X(54) VALUE                    
135218       "CHEQUE CITI INCORRECTO SIN CODIGO EN EL S127      2573".              
135219    03 ERROR-0574                          PIC X(54) VALUE                    
135220       "P.F. REINTENTE MAS TARDE, CONTRATO SUPER OCUPADO  2574".              
135221    03 ERROR-0575                          PIC X(54) VALUE                    
135222       "INDICADOR DE COMPROBANTE FISCAL INVALIDO          2575".              
135223    03 ERROR-0576                          PIC X(54) VALUE                    
135224       "RFC O CURP DE COMPROBANTE FISCAL EN ESPACIOS      2576".              
135225    03 ERROR-0577                          PIC X(54) VALUE                    
135226       "IVA DE COMPROBANTE FISCAL NO NUMERICO             2577".              
135227    03 ERROR-0578                          PIC X(54) VALUE                    
135228       "EL COMPROBANTE FISCAL NO ES PARA PERSONAS FISICAS 2578".              
135229    03 ERROR-0579                          PIC X(54) VALUE                    
135230       "INDICADOR DE USA CARACTERES ALFABETICOS INVALIDO  XXXX".              
135231    03 ERROR-0580                          PIC X(54) VALUE                    
135232       "FACTOR DE CONVERSION INVALIDO                     XXXX".              
135233    03 ERROR-0581                          PIC X(54) VALUE                    
135234       "E R R O R  F U T U R O  PORTABILIDAD S711         2581".              
135235    03 ERROR-0582                          PIC X(54) VALUE                    
135236       "USADO POR RANULFO                                 2582".              
135237    03 ERROR-0583                          PIC X(54) VALUE                    
135238       "EL CTO-PROD NO RECIBE MOVS D ESTE MEDIO DE ENTREGA2583".              
135239    03 ERROR-0584                          PIC X(54) VALUE                    
135240       "CHEQUE NO LIBERADO CON IMPORTE Y ES OBLIGATORIO   2584".              
135241    03 ERROR-0585                          PIC X(54) VALUE                    
135242       "EL CONTRATO TIENE CREDITO EN LINEA                2585".              
135243    03 ERROR-0586                          PIC X(54) VALUE                    
135244       "CAMPO OPERA ADMWIN INVALIDO                       2586".              
135245    03 ERROR-0587                          PIC X(54) VALUE                    
135246       "ESTE SERVICIO SOLO OPERA EN C218                  2587".              
135247    03 ERROR-0588                          PIC X(54) VALUE                    
135248       "NO HUBO GENERACION DE MOVTOS X CVES 638,639 Y 640 2588".              
135249    03 ERROR-0589                          PIC X(54) VALUE                    
135250       "CLAVE NO CORRESPONDE A OPERACION EN EFECTIVO      2589".              
135251    03 ERROR-0590                          PIC X(54) VALUE                    
135252       "DEBE MARCAR SI EXISTE ENTRADA/SALIDA DE EFECTIVO  2590".              
135253    03 ERROR-0591                          PIC X(54) VALUE                    
135254       "CVE UNICAMENTE PARA EFEC, PF UTILICE LA CVE CORRES2591".              
135255    03 ERROR-0592                          PIC X(54) VALUE                    
135256       "LA CVE 1019 DEBE OPERAR A TRAVES D LA PANT Q0500102592".              
135257    03 ERROR-0593                          PIC X(54) VALUE                    
135258       "IMPORTE EFECTIVO EXCLUSIVO DE LA CLAVE 1019       2593".              
135259    03 ERROR-0594                          PIC X(54) VALUE                    
135260       "VERIFICAR MARCA DE ENTRADA DE EFECTIVO            2594".              
135261    03 ERROR-0595                          PIC X(54) VALUE                    
135262       "FALTA DIGITAR * IMPORTE EFECTIVO                  2595".              
135263    03 ERROR-0596                          PIC X(54) VALUE                    
135264       "LA CUENTA NO ESTA DISPONIBLE. REINTENTE MAS TARDE 2596".              
135265    03 ERROR-0597                          PIC X(54) VALUE                    
135266       "# DE DIAS FEC. VALOR PARA CARGO A CTA CONCEN > 99 2597".              
135267    03 ERROR-0598                          PIC X(54) VALUE                    
135268       "# DIAS FEC. VALOR P/CARGO A CTA CONCEN NO NUMERICO2598".              
135269    03 ERROR-0599                          PIC X(54) VALUE                    
135270       "FALTA FECHA DE ELIMINACION DE DEPOSITO A CTACONC. 2599".              
135271    03 ERROR-0600                          PIC X(54) VALUE                    
135272       "FECHA D ELIMINACION DE DEPOSITO A CTACONC INVALIDA2600".              
135273    03 ERROR-0601                          PIC X(54) VALUE                    
135274       "LA FECHA ELIM DEPOSITO A CTACON DEBE SER DIA HABIL2601".              
135275    03 ERROR-0602                          PIC X(54) VALUE                    
135276       "NO SE PERMITE ESTE CARGO CON FECHA DEL DIA        2602".              
135277    03 ERROR-0603                          PIC X(54) VALUE                    
135278       "ESTA CLAVE ES SOLO PARA CUENTAS CONCENTRADORAS    2603".              
135279    03 ERROR-0604                          PIC X(54) VALUE                    
135280       "FECHA ELIM DEPOSITO A CTACON > A # DE DIAS HABILES2604".              
135281    03 ERROR-0605                          PIC X(54) VALUE                    
135282       "VALOR INVALIDO CAMPO NO USA LINEA DE CREDITO      2605".              
135283    03 ERROR-0606                          PIC X(54) VALUE                    
135284       "FECHA BONIFICACION MAYOR A FECHA DE PROCESO       2606".              
135285    03 ERROR-0607                          PIC X(54) VALUE                    
135286       "FECHA BONIFICACION MENOR A PERMITIDA              2607".              
135287    03 ERROR-0608                          PIC X(54) VALUE                    
135288       "NO EXISTE COMISION A BONIFICAR                    2608".              
135289    03 ERROR-0609                          PIC X(54) VALUE                    
135290       "BONIFICACIONES MAYOR A COMISIONES COBRADAS        2609".              
135291    03 ERROR-0610                          PIC X(54) VALUE                    
135292       "FALTA MES DE BONIFICACION DE COMISION             2610".              
135293    03 ERROR-0611                          PIC X(54) VALUE                    
135294       "MES DE BONIFICACION NO NUMERICO                   2611".              
135295    03 ERROR-0612                          PIC X(54) VALUE                    
135296       "FALTA AGNO DE BONIFICACION DE COMISION            2612".              
135297    03 ERROR-0613                          PIC X(54) VALUE                    
135298       "AGNO DE BONIFICACION NO NUMERICO                  2613".              
135299    03 ERROR-0614                          PIC X(54) VALUE                    
135300       "FALTA TARIFA DE BONIFICACION DE COMISION          2614".              
135301    03 ERROR-0615                          PIC X(54) VALUE                    
135302       "TARIFA DE BONIFICACION DE COMISION NO NUMERICO    2615".              
135303    03 ERROR-0616                          PIC X(54) VALUE                    
135304       "TARIFA DE BONIFICACION DE COMISION INVALIDA       2616".              
135305    03 ERROR-0617                          PIC X(54) VALUE                    
135306       "DEBE DE EXISTIR LA CVE. PARA ACUMULAR COMISION    2617".              
135307    03 ERROR-0618                          PIC X(54) VALUE                    
135308       "CLAVE PARA ACUMULAR COMISION NO NUMERICA          2618".              
135309    03 ERROR-0619                          PIC X(54) VALUE                    
135310       "TIPO DE ACUMULADO DE COMISION INVALIDO            2619".              
135311    03 ERROR-0620                          PIC X(54) VALUE                    
135312       "LA CLAVE Y EL TIPO PARA ACUMULAR VAN POR PAREJA   2620".              
135313    03 ERROR-0621                          PIC X(54) VALUE                    
135314       "INDICADOR DE TRANSMISION POR PROMOTORA INVALIDO   2621".              
135315    03 ERROR-0622                          PIC X(54) VALUE                    
135316       "NO EXISTE REGISTRO DE COMISION COBRADA PARA ELIM. 2622".              
135317    03 ERROR-0623                          PIC X(54) VALUE                    
135318       "AGNO-MES DE BONIFICACION INVALIDOS                2623".              
135319    03 ERROR-0624                          PIC X(54) VALUE                    
135320       "NO SE PUEDE REALIZAR BLOQUEO DE SDO PEND CUN      2624".              
135321    03 ERROR-0625                          PIC X(54) VALUE                    
135322       "EL SALDO PENDIENTE YA FUE LIBERADO                2625".              
135323    03 ERROR-0626                          PIC X(54) VALUE                    
135324       "IMPORTE DE BLOQUEO MAYOR AL SALDO PENDIENTE       2626".              
135325    03 ERROR-0627                          PIC X(54) VALUE                    
135326       "IMPORTE DE BLOQUEO MAYOR AL SALDO PENDIENTE BLOQ  2627".              
135327    03 ERROR-0628                          PIC X(54) VALUE                    
135328       "NO HAY SALDO PENDIENTE A BLOQUEAR                 2628".              
135329    03 ERROR-0629                          PIC X(54) VALUE                    
135330       "NO HAY SALDO A DESBLOQUEAR                        2629".              
135331    03 ERROR-0630                          PIC X(54) VALUE                    
135332       "VALOR INVALIDO CAMPO MESES DE CANCELACION AUT.    2630".              
135333    03 ERROR-0631                          PIC X(54) VALUE                    
135334       "VALOR INVALIDO CAMPO ESQUEMA DE COMISIONES        2631".              
135335    03 ERROR-0632                          PIC X(54) VALUE                    
135336       "VALOR INVALIDO CAMPO CLAVE DE AVISO CANCELACION   2632".              
135337    03 ERROR-0633                          PIC X(54) VALUE                    
135338       "NO DEBE HABER MAS CLAVES DE AVISO QUE MESES CANCEL2633".              
135339    03 ERROR-0634                          PIC X(54) VALUE                    
135340       "DEBE DE EXISTIR LA CLAVE DE RECHAZO               2634".              
135341    03 ERROR-0635                          PIC X(54) VALUE                    
135342       "CLAVE DE RECHAZO NO NUMERICA                      2635".              
135343    03 ERROR-0636                          PIC X(54) VALUE                    
135344       "MDA BLOQ X DOC.INCOMPLETA Y NO HUBO APERT EN S500 2636".              
135345    03 ERROR-0637                          PIC X(54) VALUE                    
135346       "ESTA CTA SOLO ACEPTA CANC POR EXPE. INCOMPLETOS   2637".              
135347    03 ERROR-0638                          PIC X(54) VALUE                    
135348       "ACEPTA SOLO CHQS EN TRANSITO, DEP X INVINT Y CANC 2638".              
135349    03 ERROR-0639                          PIC X(54) VALUE                    
135350       "INTENTO DE APERTURA DE CTO CANCELADO EN EL S016   2639".              
135351    03 ERROR-0640                          PIC X(54) VALUE                    
135352       "VALOR INVALIDO CAMPO SERVICIO CPAE                2640".              
135353    03 ERROR-0641                          PIC X(54) VALUE                    
135354       "CUENTA YA CON SERVICIO CPAE                       2641".              
135355    03 ERROR-0642                          PIC X(54) VALUE                    
135356       "CUENTA YA SIN SERVICIO CPAE                       2642".              
135357    03 ERROR-0643                          PIC X(54) VALUE                    
135358       "CTA. NO HABILITADA PARA ABONARSE EN CPAE          2643".              
135359    03 ERROR-0644                          PIC X(54) VALUE                    
135360       "PORCENTAJE DE COMISION RENTA MENSUAL NO NUMERICO  2644".              
135361    03 ERROR-0645                          PIC X(54) VALUE                    
135362       "IMPORTE DE CLAVE 2205 USANDO MINMAX QUEDO EN CERO 2645".              
135363    03 ERROR-0646                          PIC X(54) VALUE                    
135364       "FALTA SERVICIO CITIDIRECT                         2646".              
135365    03 ERROR-0647                          PIC X(54) VALUE                    
135366       "SERVICIO CITIDIRECT NO NUMERICO                   2647".              
135367    03 ERROR-0648                          PIC X(54) VALUE                    
135368       "SERVICIO CITIDIRECT INVALIDO                      2648".              
135369    03 ERROR-0649                          PIC X(54) VALUE                    
135370       "FALTA EL NUMERO DE CLIENTE DE CUENTAS INCORPORADAS2649".              
135371    03 ERROR-0650                          PIC X(54) VALUE                    
135372       "NUM DE CLIENTE DE CUENTAS INCORPORADAS NO NUMERICO2650".              
135373    03 ERROR-0651                          PIC X(54) VALUE                    
135374       "LA CUENTA YA TIENE ESTE SERVICIO CITI CALIFICADO  2651".              
135375    03 ERROR-0652                          PIC X(54) VALUE                    
135376       "LOS CAMPOS DEBEN SER CEROS, EXCEPTO VAL DIG EN REF2652".              
135377    03 ERROR-0653                          PIC X(54) VALUE                    
135378       "MODULO EXCLUSIVO PARA CTOS QUE OPERARAN POR S707  2653".              
135379    03 ERROR-0654                          PIC X(54) VALUE                    
135380       "SOLO SE RECIBEN DEPOSITOS REFERENCIADOS DEL S707  2654".              
135381    03 ERROR-0655                          PIC X(54) VALUE                    
135382       "CHECKBOLT NO NUMERICO                             2655".              
135383    03 ERROR-0656                          PIC X(54) VALUE                    
135384       "INDICADOR DE CHECKBOLT INVALIDO                   2656".              
135385    03 ERROR-0657                          PIC X(54) VALUE                    
135386       "FOLIO (CHECKBOLT) NO VALIDO                       2657".              
135387    03 ERROR-0658                          PIC X(54) VALUE                    
135388       "CHEQUE CON FOLIO (CHECKBOLT) NO CAPTURADO         2658".              
135389    03 ERROR-0659                          PIC X(54) VALUE                    
135390       "CHEQUE SIN FOLIO (CHECKBOLT)                      2659".              
135391    03 ERROR-0660                          PIC X(54) VALUE                    
135392       "CHEQUE CON FOLIO (CHECKBOLT) NO DISPONIBLE        2660".              
135393    03 ERROR-0661                          PIC X(54) VALUE                    
135394       "ERROR RESULT DESCONOCIDO DE CHECKBOLT             2661".              
135395    03 ERROR-0662                          PIC X(54) VALUE                    
135396       "INDICADOR USA SALDOS INTEGRADOS F/M               2662".              
135397    03 ERROR-0663                          PIC X(54) VALUE                    
135398       "INDICADOR ENVIA SALDOS PROMEDIO S084              2663".              
135399    03 ERROR-0664                          PIC X(54) VALUE                    
135400       "INDICADOR USA INVERSION INTEGRAL F/M              2664".              
135401    03 ERROR-0665                          PIC X(54) VALUE                    
135402       "INDICADOR VALIDA REGLAS PARA GENERACION EDOCTA    2665".              
135403    03 ERROR-0666                          PIC X(54) VALUE                    
135404       "INDICADOR USA INVERSION A PALZO F/M               2666".              
135405    03 ERROR-0667                          PIC X(54) VALUE                    
135406       "COPIA QUE PROCESA PROD-INST-MONEDA                2667".              
135407    03 ERROR-0668                          PIC X(54) VALUE                    
135408       "INDICADOR USA INVERSION CUENTA PROD. EMP. F/M     2668".              
135409    03 ERROR-0669                          PIC X(54) VALUE                    
135410       "MESES SIN DEP¿SITO DE NOMINA INVALIDO             2669".              
135411    03 ERROR-0670                          PIC X(54) VALUE                    
135412       "ERROR CUENTA DORMANT REQUIERE MANCOMUNACION       2670".              
135413    03 ERROR-0671                          PIC X(54) VALUE                    
135414       "INDICADOR USA BANCA DE INVERSION F/M              2671".              
135415    03 ERROR-0672                          PIC X(54) VALUE                    
135416       "INDICADRO USA OTRAS INVERSIONES F/M               2672".              
135417    03 ERROR-0673                          PIC X(54) VALUE                    
135418       "CLAVE AVISO MESES SIN DEPOSITO DE NOMINA          2673".              
135419    03 ERROR-0674                          PIC X(54) VALUE                    
135420       "ERROR AL OBTENER OPCION Y RANGO DEL S016          2674".              
135421    03 ERROR-0675                          PIC X(54) VALUE                    
135422       "NUMERO DE TEF MAL TECLEADO                        2675".              
135423    03 ERROR-0676                          PIC X(54) VALUE                    
135424       "NUMERO DE GRUPO ESQUEMA DE COMISIONES MAL TECLEADO2676".              
135425    03 ERROR-0677                          PIC X(54) VALUE                    
135426       "INDICE DE COMISION MAL TECLEADO                   2677".              
135427    03 ERROR-0678                          PIC X(54) VALUE                    
135428       "ESQUEMA TARIFARIO INCORRECTO O MAL TECLEADO       2678".              
135429    03 ERROR-0679                          PIC X(54) VALUE                    
135430       "MEDIO DE ACCESO ASIGNADO INCORRECTO O MAL TECLEADO2679".              
135431    03 ERROR-0680                          PIC X(54) VALUE                    
135432       "ESQUEMA DE COMISION MAL TECLEADO                  2680".              
135433    03 ERROR-0681                          PIC X(54) VALUE                    
135434       "FALTA ESQUEMA DE COMISION                         2681".              
135435    03 ERROR-0682                          PIC X(54) VALUE                    
135436       "SI NO HAY INDICE DE COMISION LO DEMAS NO ES VALIDO2682".              
135437    03 ERROR-0683                          PIC X(54) VALUE                    
135438       "EL PROD-INST-MNDA DE ESTE GRUPO NO EXISTE         2683".              
135439    03 ERROR-0684                          PIC X(54) VALUE                    
135440       "EL INDICE DE COMISION ESTA FUERA DE RANGO         2684".              
135441    03 ERROR-0685                          PIC X(54) VALUE                    
135442       "NO TIENE CLAVE LA COMISION EN PROD-INST-MNDA(B05) 2685".              
135443    03 ERROR-0686                          PIC X(54) VALUE                    
135444       "INDICADOR ACTUALIZA FECHA DEPOSITO DE NOMINA      2686".              
135445    03 ERROR-0687                          PIC X(54) VALUE                    
135446       "INDICADOR VALIDA STATUS MDA                       2687".              
135447    03 ERROR-0688                          PIC X(54) VALUE                    
135448       "HORA LIMITE DE COBRO GARGOS PENDIENTES            2688".              
135449    03 ERROR-0689                          PIC X(54) VALUE                    
135450       "ESQUEMA DE COMISIONES FUERA DE RANGO RENTA/CHQRA. 2689".              
135451    03 ERROR-0690                          PIC X(54) VALUE                    
135452       "ESQUEMA DE COMISIONES FUERA DE RANGO RENTA/TARJ.  2690".              
135453    03 ERROR-0691                          PIC X(54) VALUE                    
135454       "ESQUEMA DE COMISIONES FUERA DE RANGO RENTA/AMBOS  2691".              
135455    03 ERROR-0692                          PIC X(54) VALUE                    
135456       "ESQUEMA DE COMISIONES FUERA DE RANGO TRANS/CHQRA. 2692".              
135457    03 ERROR-0693                          PIC X(54) VALUE                    
135458       "ESQUEMA DE COMISIONES FUERA DE RANGO TRANS/TARJ.  2693".              
135459    03 ERROR-0694                          PIC X(54) VALUE                    
135460       "ESQUEMA DE COMISIONES FUERA DE RANGO TRANS/AMBOS  2694".              
135461    03 ERROR-0695                          PIC X(54) VALUE                    
135462       "NO EXISTE EN S080 ESQCOMI XTEF PARA PERSONA FISICA2695".              
135463    03 ERROR-0696                          PIC X(54) VALUE                    
135464       "NO EXISTE EN S080 ESQCOMI XTEF PARA PERSONA MORAL 2696".              
135465    03 ERROR-0697                          PIC X(54) VALUE                    
135466       "PRODUCTO-INST-MDA SIN TIPO DE PERSONA CARGADO     2697".              
135467    03 ERROR-0698                          PIC X(54) VALUE                    
135468       "EL DEPOSITO INICIAL DEBE SER X DISPERSION ELECTRO.2698".              
135469    03 ERROR-0699                          PIC X(54) VALUE                    
135470       "CAMPO DE SEPARA HASTA LA UNIDAD INVALIDO          2699".              
135471    03 ERROR-0700                          PIC X(54) VALUE                    
135472       "SI HASTA LA UNIDAD = SI  =>  SEP DEC DE UNI = 1   2700".              
135473    03 ERROR-0701                          PIC X(54) VALUE                    
135474       "02 CHQ PROT EN CAMARA / VERIF PREVEN FRAUD        2701".              
135475    03 ERROR-0702                          PIC X(54) VALUE                    
135476       "NO EXISTE CLAVE DE AVISO                          2702".              
135477    03 ERROR-0703                          PIC X(54) VALUE                    
135478       "CONTRATO NO RECIBE DEPOSITOS EN EFECTIVO          2703".              
135479    03 ERROR-0704                          PIC X(54) VALUE                    
135480       "RESPUESTA DE FM CON ALERTA CARGO SOSPECHOSO       2704".              
135481    03 ERROR-0705                          PIC X(54) VALUE                    
135482       "FALLA EN LA LIBRERIA L093(REVOCA FM)              2705".              
135483    03 ERROR-0706                          PIC X(54) VALUE                    
135484       "EL REG. YA EXISTE EN B01M CON STA 1 O 3           2706".              
135485    03 ERROR-0707                          PIC X(54) VALUE                    
135486       "ALERTA EN EL S127 =  1(IN PROGRESS)               2707".              
135487    03 ERROR-0708                          PIC X(54) VALUE                    
135488       "ALERTA EN EL S127 =  2(RETURN) 0 7(PAGO C/FRAUDE) 2708".              
135489    03 ERROR-0709                          PIC X(54) VALUE                    
135490       "ALERTA EN EL S127 =  5(PAGADO FORZADO)            2709".              
135491    03 ERROR-0710                          PIC X(54) VALUE                    
135492       "ALERTA EN EL S127 =  8(CALL)                      2710".              
135493    03 ERROR-0711                          PIC X(54) VALUE                    
135494       "STATUS DE ALERTAMIENTO INVALIDO                   2711".              
135495    03 ERROR-0712                          PIC X(54) VALUE                    
135496       "EN CALL A L010 PARA OBTENER FOLIO PARA FM         2712".              
135497    03 ERROR-0713                          PIC X(54) VALUE                    
135498       "CREDICHEQUE EN PROCESO DE AUTORIZACION TARJETAS   2713".              
135499    03 ERROR-0714                          PIC X(54) VALUE                    
135500       "CREDICHEQUE YA REGISTRADO, ESTATUS ERRONEOS       2714".              
135501    03 ERROR-0715                          PIC X(54) VALUE                    
135502       "CREDICHEQUE EN PROCESO DE ELIMINACION             2715".              
135503    03 ERROR-0716                          PIC X(54) VALUE                    
135504       "CREDICHEQUE PREVIAMENTE PAGADO                    2716".              
135505    03 ERROR-0717                          PIC X(54) VALUE                    
135506       "CREDICHEQUE AUTORIZACION DUPLICADA                2717".              
135507    03 ERROR-0718                          PIC X(54) VALUE                    
135508       "CREDICHEQUE REINTENTE + TARDE TARJTS NO DISPONIBLE2718".              
135509    03 ERROR-0719                          PIC X(54) VALUE                    
135510       "CREDICHEQUE REINTENTE + TARDE TARJTS CONTINGENCIA 2719".              
135511    03 ERROR-0720                          PIC X(54) VALUE                    
135512       "CREDICHEQUE NO SE PAGA CHEQUE CERTIFICADO         2720".              
135513    03 ERROR-0721                          PIC X(54) VALUE                    
135514       "CREDICHEQUE REINTENTE + TARDE SERV NO DISP EN CHQS2721".              
135515    03 ERROR-0722                          PIC X(54) VALUE                    
135516       "CREDICHEQUE FAVOR DE DAR DE ALTA LA CLAVE 3047    2722".              
135517    03 ERROR-0723                          PIC X(54) VALUE                    
135518       "CREDICHEQUE AUTORIZACION DENEGADA POR TARJETAS    2723".              
135519    03 ERROR-0724                          PIC X(54) VALUE                    
135520       "FALTA TARJETA                                     2724".              
135521    03 ERROR-0725                          PIC X(54) VALUE                    
135522       "TARJETA NO NUMERICA                               2725".              
135523    03 ERROR-0726                          PIC X(54) VALUE                    
135524       "PROBLEMAS CONSULTA MDA TJ SORIANA S500L040        2726".              
135525    03 ERROR-0727                          PIC X(54) VALUE                    
135526       "PROBLEMAS CONSULTA MDA CTO SORIANA S500L040       2727".              
135527    03 ERROR-0728                          PIC X(54) VALUE                    
135528       "DEPOSITO EXCEDE MAXIMO DE SALDO                   2728".              
135529    03 ERROR-0729                          PIC X(54) VALUE                    
135530       "DEPOSITO EXCEDE EL IMPORTE DE DEPOSITOS DEL CICLO 2729".              
135531    03 ERROR-0730                          PIC X(54) VALUE                    
135532       "DEPOSITO EXCEDE EL NUMERO DE DEPOSITOS DEL CICLO  2730".              
135533    03 ERROR-0731                          PIC X(54) VALUE                    
135534       "TARJETA BLOQUEDA POR CONVENIR AL BANCO            2731".              
135535    03 ERROR-0732                          PIC X(54) VALUE                    
135536       "TARJETA BLOQUEDA POR ROBO Y EXTRAVIO              2732".              
135537    03 ERROR-0733                          PIC X(54) VALUE                    
135538       "DESBLOQUEO SOLO SI ESTA BLOQUEADA POR CONV. AL BCO2733".              
135539    03 ERROR-0734                          PIC X(54) VALUE                    
135540       "NO SE PUDO REALIZAR LA EVOLUCION DE LA TARJETA    2734".              
135541    03 ERROR-0735                          PIC X(54) VALUE                    
135542       "LA TARJETA A EVOLUCIONAR DEBE SER LOCAL           2735".              
135543    03 ERROR-0736                          PIC X(54) VALUE                    
135544       "TARJETA A EVOLUCIONAR NO ES VALIDA                2736".              
135545    03 ERROR-0737                          PIC X(54) VALUE                    
135546       "TARJETA EN PROCESO DE EVOLUCION                   2737".              
135547    03 ERROR-0738                          PIC X(54) VALUE                    
135548       "TARJETA A EVOLUCIONAR NO EXISTE EN CLIENTES       2738".              
135549    03 ERROR-0739                          PIC X(54) VALUE                    
135550       "CONTRATO BLOQUEADO POR PRECANCELACION             2739".              
135551    03 ERROR-0740                          PIC X(54) VALUE                    
135552       "VALOR INVALIDO CAMPO MESES BLOQ SDO PROM MIN      2740".              
135553    03 ERROR-0741                          PIC X(54) VALUE                    
135554       "VALOR INVALIDO CAMPO MESES EXCESO MAXIMO DE DEPOS.2741".              
135555    03 ERROR-0742                          PIC X(54) VALUE                    
135556       "CLAVE AVISO MESES SIN SALDO PROMEDIO MINIMO       2742".              
135557    03 ERROR-0743                          PIC X(54) VALUE                    
135558       "INCORRECTO INDICADOR DE VALIDA INSTR. MONETARIO   2743".              
135559    03 ERROR-0744                          PIC X(54) VALUE                    
135560       "INCORRECTO INDICADOR DE DETALLE IMPORTE MIXTO     2744".              
135561    03 ERROR-0745                          PIC X(54) VALUE                    
135562       "LA SUMA DE IMPORTES NO ES IGUAL AL IMPORTE TOTAL  2745".              
135563    03 ERROR-0746                          PIC X(54) VALUE                    
135564       "INDICADOR DETALLE Y/O IMPORTE MAL SELECCIONADO    2746".              
135565    03 ERROR-0747                          PIC X(54) VALUE                    
135566       "DEPOSITO EXCEDE EL IMP MAXIMO POR TRANS CJ SORIANA2747".              
135567    03 ERROR-0748                          PIC X(54) VALUE                    
135568       "DEPOSITO EXCEDE EL IMP MAXIMO POR CICLO CJ SORIANA2748".              
135569    03 ERROR-0749                          PIC X(54) VALUE                    
135570       "DEPOSITO EXCEDE EL IMP MAXIMO POR DIA CJ SORIANA  2749".              
135571    03 ERROR-0750                          PIC X(54) VALUE                    
135572       "NO SE PERMITE CHQ BNM Y CHQ O BCOS MISMA TRANSAC  2750".              
135573    03 ERROR-0751                          PIC X(54) VALUE                    
135574       "PRIORIDAD INVALIDA                                2751".              
135575    03 ERROR-0752                          PIC X(54) VALUE                    
135576       "HORA LIMITE DE COBRO INVALIDA O FORMATO INCORRECTO2752".              
135577    03 ERROR-0753                          PIC X(54) VALUE                    
135578       "FECHA LIMITE D COBRO INVALIDA O FORMATO INCORRECTO2753".              
135579    03 ERROR-0754                          PIC X(54) VALUE                    
135580       "FECHA LIMITE DE COBRO DEBE SER > A FECHA CONTABLE 2754".              
135581    03 ERROR-0755                          PIC X(54) VALUE                    
135582       "CONTRATO TIENE CARGOS PROTEGIDOS                  2755".              
135583    03 ERROR-0756                          PIC X(54) VALUE                    
135584       "CARGO PROTEGIDO ELIMINADO                         2756".              
135585    03 ERROR-0757                          PIC X(54) VALUE                    
135586       "CARGO PROTEGIDO CANCELADO                         2757".              
135587    03 ERROR-0758                          PIC X(54) VALUE                    
135588       "CARGO PROTEGIDO PAGADO                            2758".              
135589    03 ERROR-0759                          PIC X(54) VALUE                    
135590       "CARGO PROTEGIDO VENCIDO                           2759".              
135591    03 ERROR-0760                          PIC X(54) VALUE                    
135592       "EL GRUPO NO TIENE CUENTAS                         2760".              
135593    03 ERROR-0761                          PIC X(54) VALUE                    
135594       "ERROR, GRUPO INVALIDO                             2761".              
135595    03 ERROR-0762                          PIC X(54) VALUE                    
135596       "PARA MODIFICAR ES NECESARIO CONSULTAR EL GRUPO    2762".              
135597    03 ERROR-0763                          PIC X(54) VALUE                    
135598       "PARA DAR DE BAJA ES NECESARIO CONSULTAR EL GRUPO  2763".              
135599    03 ERROR-0764                          PIC X(54) VALUE                    
135600       "ERROR FALTA EL NOMBRE DE GRUPO                    2764".              
135601    03 ERROR-0765                          PIC X(54) VALUE                    
135602       "ERROR, OPCION DE PAGO NO NUMERICO O INVALIDO      2765".              
135603    03 ERROR-0766                          PIC X(54) VALUE                    
135604       "ERROR, RANGO NO NUMERICO O FUERA DE RANGO         2766".              
135605    03 ERROR-0767                          PIC X(54) VALUE                    
135606       "OPCION 8/9 DEBES DIGITAR RANGO                    2767".              
135607    03 ERROR-0768                          PIC X(54) VALUE                    
135608       "ERROR, CUENTA NO NUMERICA                         2768".              
135609    03 ERROR-0769                          PIC X(54) VALUE                    
135610       "LA OPCION DE PAGO NECESITA # DE SUCURSAL          2769".              
135611    03 ERROR-0770                          PIC X(54) VALUE                    
135612       "LA OPCION DE PAGO NECESITA # DE CUENTA            2770".              
135613    03 ERROR-0771                          PIC X(54) VALUE                    
135614       "LA OPCION DE PAGO NO REQUIERE # DE SUCURSAL       2771".              
135615    03 ERROR-0772                          PIC X(54) VALUE                    
135616       "LA OPCION DE PAGO NO REQUIERE # DE CUENTA         2772".              
135617    03 ERROR-0773                          PIC X(54) VALUE                    
135618       "ERROR, FECHA DE VIGENCIA NO NUMERICA              2773".              
135619    03 ERROR-0774                          PIC X(54) VALUE                    
135620       "OPCION 8/9 SOLO ACEPTAN 999999 FEC.VIGENCIA       2774".              
135621    03 ERROR-0775                          PIC X(54) VALUE                    
135622       "ERROR EN MES DE FECHA DE VIGENCIA                 2775".              
135623    03 ERROR-0776                          PIC X(54) VALUE                    
135624       "FECHA DE VIGENCIA MENOR QUE FECHA DE PROCESO      2776".              
135625    03 ERROR-0777                          PIC X(54) VALUE                    
135626       "FECHA DE VIGENCIA NO DEBE SE MAYOR A UN A#O       2777".              
135627    03 ERROR-0778                          PIC X(54) VALUE                    
135628       "DEBES CALIFICAR   1 FISICA/ 2  MORAL              2778".              
135629    03 ERROR-0779                          PIC X(54) VALUE                    
135630       "ERROR FALTA EL NOMBRE DEL RESPONSABLE             2779".              
135631    03 ERROR-0780                          PIC X(54) VALUE                    
135632       "ERROR FALTA EN DOMICILIO                          2780".              
135633    03 ERROR-0781                          PIC X(54) VALUE                    
135634       "ERROR FALTA LA POBLACION                          2781".              
135635    03 ERROR-0782                          PIC X(54) VALUE                    
135636       "ERROR CODIGO POSTAL NO NUMERICO                   2782".              
135637    03 ERROR-0783                          PIC X(54) VALUE                    
135638       "POR FAVOR VUELVA A CONSULTAR EL GRUPO             2783".              
135639    03 ERROR-0784                          PIC X(54) VALUE                    
135640       "CUENTA NO ES PRODUCTIVA ESPECIAL                  2784".              
135641    03 ERROR-0785                          PIC X(54) VALUE                    
135642       "TIPO DE PERSONA NO CORRESPONDE A CTA.PROD.ESP.    2785".              
135643    03 ERROR-0786                          PIC X(54) VALUE                    
135644       "STATUS DE LA CUENTA NO ES ACTIVO                  2786".              
135645    03 ERROR-0787                          PIC X(54) VALUE                    
135646       "NO EXISTE NUMERO DE GRUPO                         2787".              
135647    03 ERROR-0788                          PIC X(54) VALUE                    
135648       "NO SE PUEDE DAR DE BAJA, EL GRUPO TIENE CUENTAS   2788".              
135649    03 ERROR-0789                          PIC X(54) VALUE                    
135650       "NO SE PUEDE DAR DE BAJA, EL GRUPO TIENE SUBGRUPOS 2789".              
135651    03 ERROR-0790                          PIC X(54) VALUE                    
135652       "GRUPO DADO DE BAJA                                2790".              
135653    03 ERROR-0791                          PIC X(54) VALUE                    
135654       "ERROR, NO SE PERMITE CAMBIAR DE TIPO DE GRUPO     2791".              
135655    03 ERROR-0792                          PIC X(54) VALUE                    
135656       "NO PUEDE CAMBIAR DE  OPCION                       2792".              
135657    03 ERROR-0793                          PIC X(54) VALUE                    
135658       "TIPO DE GRUPO NO PUEDE SER CAMBIADO               2793".              
135659    03 ERROR-0794                          PIC X(54) VALUE                    
135660       "YA EXISTE CONTRATO A EVOLUCIONAR                  2794".              
135661    03 ERROR-0795                          PIC X(54) VALUE                    
135662       "LA CVE NO PERMITE EL IMPORTE CON DECIMALES        2795".              
135663    03 ERROR-0796                          PIC X(54) VALUE                    
135664       "GRUPO NO REGISTRADO COMO VALIDO EN CATALOGO       2796".              
135665    03 ERROR-0797                          PIC X(54) VALUE                    
135666       "BIN NO REGISTRADO COMO VALIDO EN CATALOGO         2797".              
135667    03 ERROR-0798                          PIC X(54) VALUE                    
135668       "CAMBIO GRUPO/BIN NO PERMITIDO PARA PRD/INST       2798".              
135669    03 ERROR-0799                          PIC X(54) VALUE                    
135670       "NUM. DE GRUPO EXCEDE MAX. VALOR PERMITIDO (9999)  2799".              
135671    03 ERROR-0800                          PIC X(54) VALUE                    
135672       "NUM. DE BIN/GRUPO MAL TECLEADO                    2800".              
135673    03 ERROR-0801                          PIC X(54) VALUE                    
135674       "CAMPO DE BIN/GRUPO DEBEN SER MAYOR A CERO         2801".              
135675    03 ERROR-0802                          PIC X(54) VALUE                    
135676       "BIN O GRUPO NO EXISTE EN B41/BIN O B42/GRUPO      2802".              
135677    03 ERROR-0803                          PIC X(54) VALUE                    
135678       "BIN ES NUMERICO                                   2803".              
135679    03 ERROR-0804                          PIC X(54) VALUE                    
135680       "GRUPO SOCIO DEBE SER NUMERICO                     2804".              
135681    03 ERROR-0805                          PIC X(54) VALUE                    
135682       "ESQUEMA TARIFARIO ES NUMERICO                     2805".              
135683    03 ERROR-0806                          PIC X(54) VALUE                    
135684       "GPO. REND.INCORRECTO, VALORES PERMITIDOS 1 A 20   2806".              
135685    03 ERROR-0807                          PIC X(54) VALUE                    
135686       "GPO. COMIS.INCORRECTO, VALORES PERMITIDOS 18 A 33 2807".              
135687    03 ERROR-0808                          PIC X(54) VALUE                    
135688       "GRUPO ESQ. COMIS/REND DEBE SER NUMERICO           2808".              
135689    03 ERROR-0809                          PIC X(54) VALUE                    
135690       "GPOSOC/GPOESQCOMIS/GPOREND DEBEN SER MAYOR A CEROS2809".              
135691    03 ERROR-0810                          PIC X(54) VALUE                    
135692       "BIN/GPO/ESQTARIF DEBEN SER MAYOR A CEROS          2810".              
135693    03 ERROR-0811                          PIC X(54) VALUE                    
135694       "CLAVE DE CNTB DIVIDIDA NO DADA DE ALTA EN PRODUCTO2811".              
135695    03 ERROR-0812                          PIC X(54) VALUE                    
135696       "IND. RESULT. X SIRH DEBE SER NUMERICO(SOLO 0,1,2) 2812".              
135697    03 ERROR-0813                          PIC X(54) VALUE                    
135698       "PRODUCTO,INSTRUMENTO,MONEDA DEBEN SER > 0         2813".              
135699    03 ERROR-0814                          PIC X(54) VALUE                    
135700       "CVE.TRANS//CVE.GEN//SIRH.GEN SON NUMERICOS > 0    2814".              
135701    03 ERROR-0815                          PIC X(54) VALUE                    
135702       "CVE.TRANS O CVE.GEN NO EXISTE EN B17              2815".              
135703    03 ERROR-0816                          PIC X(54) VALUE                    
135704       "NUM. DE CLAVES DE CONTABILIDAD DIVIDIDA > 30      2816".              
135705    03 ERROR-0817                          PIC X(54) VALUE                    
135706       "CONTRATO A EVOLUCIONAR CORTA EL DIA DE HOY        2817".              
135707    03 ERROR-0818                          PIC X(54) VALUE                    
135708       "PONGA ESPACIO, CAMBIO ESQ.COM INVALIDO EN PRD/INT 2818".              
135709    03 ERROR-0819                          PIC X(54) VALUE                    
135710       "CAMPO INDICADOR CLAVE CORRESPONSALES INVALIDO     2819".              
135711    03 ERROR-0820                          PIC X(54) VALUE                    
135712       "IMPORTE DE DEPSXDIA > A PERM PARA CORRESPONSALES  2820".              
135713    03 ERROR-0821                          PIC X(54) VALUE                    
135714       "IMPORTE DE RETSXDIA > A PERM PARA CORRESPONSALES  2821".              
135715    03 ERROR-0822                          PIC X(54) VALUE                    
135716       "PONGA ESPACIOS EN ESQ.COM Y BIN PARA ESTA OPCION  2822".              
135717    03 ERROR-0823                          PIC X(54) VALUE                    
135718       "CAMBIO DE GRUPO NO PERMITIDO PARA PRD/INST        2823".              
135719    03 ERROR-0824                          PIC X(54) VALUE                    
135720       "FALTA CAPTURAR INDICADOR PAGO REND. DIFERENCIADO  2824".              
135721    03 ERROR-0825                          PIC X(54) VALUE                    
135722       "OPCION PAGO RENDI. DIFERENCIADO MAL CAPTURADO     2825".              
135723    03 ERROR-0826                          PIC X(54) VALUE                    
135724       "INDICADOR REND. DIF. NO PERMITIDO PARA PRD/INST   2826".              
135725    03 ERROR-0827                          PIC X(54) VALUE                    
135726       "IND PAGO REND DEBE ESTAR PRENDIDO P/PAGAR REN-DIF 2827".              
135727    03 ERROR-0828                          PIC X(54) VALUE                    
135728       "LOS IMPORTES DE CLAVE TRANS. MIXTA DEBEN SER > 0  2828".              
135729    03 ERROR-0829                          PIC X(54) VALUE                    
135730       "CLAVE TRANS. MIXTA NO ACEPTA MAS DE DOS IMPORTES  2829".              
135731    03 ERROR-0830                          PIC X(54) VALUE                    
135732       "CLAVE DE TRANSACCION NO ACEPTA MAS DE UN IMPORTE  2830".              
135733    03 ERROR-0831                          PIC X(54) VALUE                    
135734       "IND. ACUMULACION DE CIFRAS INVALIDO               2831".              
135735    03 ERROR-0832                          PIC X(54) VALUE                    
135736       "CLAVE NO PERMITE TRANSACCIONES MIXTAS             2832".              
135737    03 ERROR-0833                          PIC X(54) VALUE                    
135738       "IND. CLAVE MIXTA INVALIDO                         2833".              
135739    03 ERROR-0834                          PIC X(54) VALUE                    
135740       "CODIGO PRODUCTO AFEWS MAL DIGITADO                2834".              
135741    03 ERROR-0835                          PIC X(54) VALUE                    
135742       "IND ENVIO A AFEWS INVALIDO                        2835".              
135743    03 ERROR-0836                          PIC X(54) VALUE                    
135744       "EVOLUCION PREVIAMENTE REALIZADA                   2836".              
135745    03 ERROR-0837                          PIC X(54) VALUE                    
135746       "CTO NO ACTIVO P RECIBIR DEPS EN EFEC EN MONEDA EXT2837".              
135747    03 ERROR-0838                          PIC X(54) VALUE                    
135748       "CTO NO RECIBE DEPOSITOS EN EFECTIVO EN MONEDA EXT 2838".              
135749    03 ERROR-0839                          PIC X(54) VALUE                    
135750       "INDICADOR DE INACTIVIDAD INVALIDO                 2839".              
135751    03 ERROR-0840                          PIC X(54) VALUE                    
135752       "EN OPCION  C,  INDICADOR DE INACTIVIDAD = SPACES  2840".              
135753    03 ERROR-0841                          PIC X(54) VALUE                    
135754       "EN OPCION  M,  STATION NAME = SPACES              2841".              
135755    03 ERROR-0842                          PIC X(54) VALUE                    
135756       "INDICADOR PRODUCTO NOMINA INVALIDO                2842".              
135757    03 ERROR-0843                          PIC X(54) VALUE                    
135758       "VALOR INVALIDO, PRODUCTO NO ES DE NOMINA          2843".              
135759    03 ERROR-0844                          PIC X(54) VALUE                    
135760       "IND. TRASPASO A BENEFICENCIA INVALIDO             2844".              
135761    03 ERROR-0845                          PIC X(54) VALUE                    
135762       "CUENTA SOLO ACEPTA DEPOSITO INICIAL POR TRASPASO  2845".              
135763    03 ERROR-0846                          PIC X(54) VALUE                    
135764       "CUENTA GLOBAL NO EXISTE EN BASE 04                2846".              
135765    03 ERROR-0847                          PIC X(54) VALUE                    
135766       "CTO. EN PROCESO DE MIGRACION NO RECIBE MOVIMIENTOS2847".              
135767    03 ERROR-0848                          PIC X(54) VALUE                    
135768       "CUENTA GLOBAL MPS SOLO ACEPTA CARGOS,ABONOS,ELIMIN2848".              
135769    03 ERROR-0849                          PIC X(54) VALUE                    
135770       "LA CUENTA GLOBAL MPS NO SE PUEDE CANCELAR         2849".              
135771    03 ERROR-0850                          PIC X(54) VALUE                    
135772       "LA CUENTA DE LA TRANSACCION NO ES DE UNA CTA.MOVIL2850".              
135773    03 ERROR-0851                          PIC X(54) VALUE                    
135774       "LA TARJETA DE LA TRANSACCION NO ES D UNA CTA.MOVIL2851".              
135775    03 ERROR-0852                          PIC X(54) VALUE                    
135776       "EL MDA DE LA TRANSACCION NO ES DE UNA CTA.MOVIL   2852".              
135777    03 ERROR-0853                          PIC X(54) VALUE                    
135778       "LA CLAVE D/TRANSACCION NO OPERA CUENTAS MOVILES   2853".              
135779    03 ERROR-0854                          PIC X(54) VALUE                    
135780       "HA HABIDO UN SALTO DE CHEQUES, POR FAVOR VERIFIQUE2854".              
135781    03 ERROR-0855                          PIC X(54) VALUE                    
135782       "IND. FORZAR PAGO DE CHEQUE SALTADO INVALIDO       2855".              
135783    03 ERROR-0856                          PIC X(54) VALUE                    
135784       "IND. VALIDA CHEQUE SALTADO TRADICIONAL INVALIDO   2856".              
135785    03 ERROR-0857                          PIC X(54) VALUE                    
135786       "IND. VALIDA CHEQUE SALTADO CREDICHEQUE INVALIDO   2857".              
135787    03 ERROR-0858                          PIC X(54) VALUE                    
135788       "IND. VALIDA CHEQUE SALTADO INVALIDO               2858".              
135789    03 ERROR-0859                          PIC X(54) VALUE                    
135790       "LAS TRANS. DE CTAS. MOVILES NO OPERAN POR TERMINAL2859".              
135791    03 ERROR-0860                          PIC X(54) VALUE                    
135792       "HABILITA VALCHSALT ES PARA CLAVES VERIFICAN CHQE  2860".              
135793    03 ERROR-0861                          PIC X(54) VALUE                    
135794       "IMPORTE EXCEDE LIMITE/PISO AUTORIZADO PARA STANDIN2861".              
135795    03 ERROR-0862                          PIC X(54) VALUE                    
135796       "SE EXCEDIO NUM OPERACIONES AUTORIZADO PARA STANDIN2862".              
135797    03 ERROR-0863                          PIC X(54) VALUE                    
135798       "FALTA CAPTURAR INDICADOR PAGO RENDIMIENTO DIARIO  2863".              
135799    03 ERROR-0864                          PIC X(54) VALUE                    
135800       "INDICADOR PAGO RENDIMIENTO DIARIO MAL CAPTURADO   2864".              
135801    03 ERROR-0865                          PIC X(54) VALUE                    
135802       "IND PAGO REND DEBE ESTAR PRENDIDO P/PAGAR REN-DIA 2865".              
135803    03 ERROR-0866                          PIC X(54) VALUE                    
135804       "IND.NO BARRER SOLO ACEPTA VALORES X, ESPACIOS     2866".              
135805    03 ERROR-0867                          PIC X(54) VALUE                    
135806       "EN OPCIONES B,F,G, IND.NO BARRER DEBE SER ESPACIOS2867".              
135807    03 ERROR-0868                          PIC X(54) VALUE                    
135808       "LA CUENTA MOVIL DEBE CONTENER VALOR MAYOR  A CERO 2868".              
135809    03 ERROR-0869                          PIC X(54) VALUE                    
135810       "IND.REND.DIARIO SOLO SE ACTUALIZA AL INICIO DE MES2869".              
135811    03 ERROR-0870                          PIC X(54) VALUE                    
135812       "MEDIO DE ACCESO TRASPASADO A CUENTA GLOBAL        2870".              
135813    03 ERROR-0871                          PIC X(54) VALUE                    
135814       "MEDIO DE ACCESO TRASPASADO A BENEFICIENCIA        2871".              
135815    03 ERROR-0872                          PIC X(54) VALUE                    
135816       "MEDIO DE ACCESO EN CTA GLOB/BLOQ X FALLECIMIENTO  2872".              
135817    03 ERROR-0873                          PIC X(54) VALUE                    
135818       "MEDIO DE ACCESO EN CTA GLOB/BLOQ X ORDEN JUDICIAL 2873".              
135819    03 ERROR-0874                          PIC X(54) VALUE                    
135820       "MEDIO DE ACCESO EN CTA GLOB / CANCELADO           2874".              
135821    03 ERROR-0875                          PIC X(54) VALUE                    
135822       "CONTRATO BLOQUEADO POR REPOSICION EN TRAMITE      2875".              
135823    03 ERROR-0876                          PIC X(54) VALUE                    
135824       "MEDIO DE ACCESO BLOQUEADO, REPOSICION EN TRAMITE  2876".              
135825    03 ERROR-0877                          PIC X(54) VALUE                    
135826       "NO PUEDE HABER EVOLUCION NI SBC EL MISMO DIA      2877".              
135827    03 ERROR-0878                          PIC X(54) VALUE                    
135828       "PARA IND.RESULT.X SIRH = 2,ORIGEN LOCAL DEBE SER 12878".              
135829    03 ERROR-0879                          PIC X(54) VALUE                    
135830       "EL CAMPO CTOS X BEGIN/END TRANS.P130 ES NUMERICO  2879".              
135831    03 ERROR-0880                          PIC X(54) VALUE                    
135832       "INDICADOR DE CAMPO INSTRUCCION INCORRECTO         2880".              
135833    03 ERROR-0881                          PIC X(54) VALUE                    
135834       "INSTRUCCION REQUIERE EST A GEN Y TIPO DE PAGO > 0 2881".              
135835    03 ERROR-0882                          PIC X(54) VALUE                    
135836       "CLAVE X PAGAR NO NUMERICA                         2882".              
135837    03 ERROR-0883                          PIC X(54) VALUE                    
135838       "CLAVES X PAGAR DEBEN CAPTURARSE CONSECUTIVAMENTE  2883".              
135839    03 ERROR-0884                          PIC X(54) VALUE                    
135840       "NO EXISTE CLAVE POR PAGAR                         2884".              
135841    03 ERROR-0885                          PIC X(54) VALUE                    
135842       "CVEXPAGAR REQUIERE EST A GENERAR Y TIP DE PAGO >0 2885".              
135843    03 ERROR-0886                          PIC X(54) VALUE                    
135844       "IND.ACUM.VALORIZACION DEBE SER NUMERO(SOLO 0,1,2) 2886".              
135845    03 ERROR-0887                          PIC X(54) VALUE                    
135846       "CLAVE TRANSACCION DOLARES INVALIDA O NO NUMERICA  2887".              
135847    03 ERROR-0888                          PIC X(54) VALUE                    
135848       "CLAVE TRANSACCION DOLARES INEXISTENTE             2888".              
135849    03 ERROR-0889                          PIC X(54) VALUE                    
135850       "CVEXPAGAR DEBE SER > 3999 Y < 5000                2889".              
135851    03 ERROR-0890                          PIC X(54) VALUE                    
135852       "STATUS TRANSF 274 INVALIDO(SIT 0-2)(UAT,PROD 0-4) 2890".              
135853    03 ERROR-0891                          PIC X(54) VALUE                    
135854       "EL CONTRATO NO RECIBE CARGOS POR DOMICILIACION    2891".              
135855    03 ERROR-0892                          PIC X(54) VALUE                    
135856       "INDICADOR DE TRANSFER INVALIDO                    2892".              
135857    03 ERROR-0893                          PIC X(54) VALUE                    
135858       "EL DEPOSITO EN EFECTIVO <> AL MINIMO DE APERTURA  2893".              
135859    03 ERROR-0894                          PIC X(54) VALUE                    
135860       "NO PERMITE CANCELACION X REST VISITA DOMICILIARIA 2894".              
135861    03 ERROR-0895                          PIC X(54) VALUE                    
135862       "DEPOSITO SUPERA LIMITE DE CUENTA. LLAME AL TITULAR2895".              
135863    03 ERROR-0896                          PIC X(54) VALUE                    
135864       "INDICADOR INVALIDO,MESES P/ACUMULAR COMISION PEND 2896".              
135865    03 ERROR-0897                          PIC X(54) VALUE                    
135866       "03 CHQ PROT EN CAJERO SAB / VERIF PREVEN FRAUD    2897".              
135867    03 ERROR-0898                          PIC X(54) VALUE                    
135868       "CHEQUE SIN PROTECCION DE CAJERO SAB               2898".              
135869    03 ERROR-0899                          PIC X(54) VALUE                    
135870       "LINEA DE EFECTIVO INSUFICIENTE, PASAR A SUCURSAL  2899".              
135871    03 ERROR-0900                          PIC X(54) VALUE                    
135872       "NO EXISTE MOVIMIENTO A ELIMINAR EN EL S408        2900".              
135873    03 ERROR-0901                          PIC X(54) VALUE                    
135874       "NO EXISTE EL CLIENTE                              2901".              
135875    03 ERROR-0902                          PIC X(54) VALUE                    
135876       "PROBLEMAS CON LIBRERIA S408LINEFEC                2902".              
135877    03 ERROR-0903.                                                            
135878       04 FILLER                           PIC X(10) VALUE                    
135879       "DISPONIBLE".                                                          
135880       04 ERROR-0903-MONTO                                                    
135881                                  PIC ZZ,ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.              
135882       04 FILLER                           PIC X(19) VALUE                    
135883       "GENERAR LINEA T2903".                                                 
135884    03 ERROR-0904                          PIC X(54) VALUE                    
135885       "LIMITE COMPLETO, GENERAR LINEA TRANSITORIA        2904".              
135886    03 ERROR-0905                          PIC X(54) VALUE                    
135887       "FOLIO PARA AMPLIAR LINEA DE EFECTIVO NO NUMERICO  2905".              
135888    03 ERROR-0906                          PIC X(54) VALUE                    
135889       "MOVIMIENTO ELIMINADO ANTORIORMENTE EN S408LINEFEC 2906".              
135890    03 ERROR-0907                          PIC X(54) VALUE                    
135891       "NO EXISTE MONTO AUTORIZADO PARA EL CLIENTE        2907".              
135892    03 ERROR-0908                          PIC X(54) VALUE                    
135893       "MOVIMIENTO DUPLICADO EN S408LINEFEC               2908".              
135894    03 ERROR-0909                         PIC X(54) VALUE                     
135895       "INDICADOR SERVICIO GCE INVALIDO                   2909".              
135896    03 ERROR-0910                         PIC X(54) VALUE                     
135897       "CLAVE DE GCE NO PERMITIDA, NO SE TIENE EL SERVICIO2910".              
135898    03 ERROR-0911                         PIC X(54) VALUE                     
135899       "DIA DE LA SEMANA INVALIDO                         2911".              
135900    03 ERROR-0912                         PIC X(54) VALUE                     
135901       "LA HORA NO ES NUMERICA O FUERA DE RANGO           2912".              
135902    03 ERROR-0913                         PIC X(54) VALUE                     
135903       "NIVEL NO PERMITIDO PARA ESTE TIPO DE PERSONA      2913".              
135904    03 ERROR-0914                         PIC X(54) VALUE                     
135905       "NIVEL YA CALIFICADO                               2914".              
135906    03 ERROR-0915                         PIC X(54) VALUE                     
135907       "NIVEL NO VALIDO                                   2915".              
135908    03 ERROR-0916                         PIC X(54) VALUE                     
135909       "EXCEDE LIMITE DE DEPOSITOS POR NIVEL DE CUENTA    2916".              
135910    03 ERROR-0917                         PIC X(54) VALUE                     
135911       "CONTRATO BLOQUEADO NO PERMITE APART X ORD JUD PAR 2917".              
135912    03 ERROR-0918                         PIC X(54) VALUE                     
135913       "CONTRATO YA CUENTA CON IMP SOLICITA X ORD JUD PAR 2918".              
135914    03 ERROR-0919                         PIC X(54) VALUE                     
135915       "CONTRATO NO CUENTA CON IMP SOLICITA X ORD JUD PAR 2919".              
135916    03 ERROR-0920                          PIC X(54) VALUE                    
135917       "CAMPO ULTIMO MOVIMIENTO COMISIONES EPP INVALIDO   2920".              
135918    03 ERROR-0921                          PIC X(54) VALUE                    
135919       "MESES VIGENCIA COMIS EPP INVALIDO O NO NUMERICO   2921".              
135920    03 ERROR-0922                          PIC X(54) VALUE                    
135921       "CAMPO CALCULO ISR PARA COMISIONES EPP INVALIDO    2922".              
135922    03 ERROR-0923                          PIC X(54) VALUE                    
135923       "TIPO DE PAGO COMISIONES EPP INVALIDO O NO NUMERICO2923".              
135924    03 ERROR-0924                          PIC X(54) VALUE                    
135925       "CAMPO DE ELIMINAR COMISIONES VENCIDAS EPP INVALIDO2924".              
135926    03 ERROR-0925                          PIC X(54) VALUE                    
135927       "NO CALIFICAR AMBOS:  TIPO DE PAGO Y TIPO PAGO EPP 2925".              
135928    03 ERROR-0926                          PIC X(54) VALUE                    
135929       "NO CALIFICAR AMBOS:  CAL ISR EPP Y ELI VENC EPP   2926".              
135930    03 ERROR-0927                          PIC X(54) VALUE                    
135931       "F ULTMOV EPP SOLO PERMITIDO PARA CLAVES CONTABLES 2927".              
135932    03 ERROR-0928                          PIC X(54) VALUE                    
135933       "NO CALIFICAR AMBOS:  MESES VIG EPP Y CAL ISR EPP  2928".              
135934    03 ERROR-0929                          PIC X(54) VALUE                    
135935       "SI CAMPO MESES VIG EPP>0, CAMPO TIPO PAG EPP=1 O 22929".              
135936    03 ERROR-0930                          PIC X(54) VALUE                    
135937       "NO CALIFICAR AMBOS:  CAL ISR EPP Y TIPO PAGO EPP  2930".              
135938    03 ERROR-0931                          PIC X(54) VALUE                    
135939       "SI CAMPO ELI VENC EPP=X, CAMPO MESES VIG EPP>0    2931".              
135940    03 ERROR-0932                          PIC X(54) VALUE                    
135941       "SI CAMPO ELI VENC EPP=X, CAMPO TIPO PAG EPP=1 O 2 2932".              
135942    03 ERROR-0933                          PIC X(54) VALUE                    
135943       "COMISION EPP ESTA CON SALDO CERO                  2933".              
135944    03 ERROR-0934                          PIC X(54) VALUE                    
135945       "NO EXISTE REGISTRO DE COMISIONES EPP              2934".              
135946    03 ERROR-0935                          PIC X(54) VALUE                    
135947       "FALTAN CLAVES DE IVA PARA CVE DE PAGO EPP         2935".              
135948    03 ERROR-0936                          PIC X(54) VALUE                    
135949       "CONTRATO INEXISTENTE EN COMISIONES EPP (LOCAL)    2936".              
135950    03 ERROR-0937                          PIC X(54) VALUE                    
135951       "EN PREBATCH NO SE PERMITEN ESTA PANTALLA          2937".              
135952    03 ERROR-0938                          PIC X(54) VALUE                    
135953       "NO SE MARCO NINGUNA COMISION PARA ELIMINAR, USE X 2938".              
135954    03 ERROR-0939                          PIC X(54) VALUE                    
135955       "PARA ELIMINAR, SE NECESITA CONSULTA PREVIAMENTE   2939".              
135956    03 ERROR-0940                          PIC X(54) VALUE                    
135957       "COMISION NO ESTA VIGENTE, NO SE PUEDE PROCESAR    2940".              
135958    03 ERROR-0941                          PIC X(54) VALUE                    
135959       "CONTRATO SIN COMISIONES VIGENTES                  2941".              
135960    03 ERROR-0942                          PIC X(54) VALUE                    
135961       "LA SUMA DE LOS SIRH DEBE SER 100 POR REGISTRO     2942".              
135962    03 ERROR-0943                          PIC X(54) VALUE                    
135963       "FALTA SIRH PARA UNO DE LOS PORCENTAJES CAPTURADOS 2943".              
135964    03 ERROR-0944                          PIC X(54) VALUE                    
135965       "FALTA PORCENTAJE PARA UNO DE LOS SIRHS CAPTURADOS 2944".              
135966    03 ERROR-0945                          PIC X(54) VALUE                    
135967       "BAJA PERMITIDA SOLO EN PAGINA CONSULTADA          2945".              
135968    03 ERROR-0946                          PIC X(54) VALUE                    
135969       "ESQUEMA DE RENDIMIENTO ERRONEO, USE DEL 0 AL 3    2946".              
135970    03 ERROR-0947                          PIC X(54) VALUE                    
135971       "SEGMENTO DE RENDIMIENTO MAL DIGITADO              2947".              
135972    03 ERROR-0948                          PIC X(54) VALUE                    
135973       "ESQUEMA DE RENDIMIENTO MAL DIGITADO               2948".              
135974    03 ERROR-0949                          PIC X(54) VALUE                    
135975       "ESQUEMA DE RENDIMIENTO SE OPERA SOLO EN LINEA     2949".              
135976    03 ERROR-0950                          PIC X(54) VALUE                    
135977       "CUENTA GLOBAL NO SOPORTA ESQUEMAS DE RENDIMIENTOS 2950".              
135978    03 ERROR-0951                          PIC X(54) VALUE                    
135979       "PAGO DE REND. INVALIDO PARA ACTIVAR ESQ. DE REND. 2951".              
135980    03 ERROR-0952                          PIC X(54) VALUE                    
135981       "CTA. PRODUCTIVA ESPECIAL NO SOPORTA ESQ. DE REND. 2952".              
135982    03 ERROR-0953                          PIC X(54) VALUE                    
135983       "PRODUCTO NO CONTIENE ESQ. Y/O SEGMTO DE RENDIMTO. 2953".              
135984    03 ERROR-0954                          PIC X(54) VALUE                    
135985       "ESQUEMA IGUAL A CERO, PERMITE SOLO SEGMENTO CERO. 2954".              
135986    03 ERROR-0955                          PIC X(54) VALUE                    
135987       "ESQUEMA MAYOR A 0,PERMITE SOLO SGMTO MAYOR A CERO 2955".              
135988    03 ERROR-0956                          PIC X(54) VALUE                    
135989       "REINTENTE MAS TARDE, CTO DE CC NO DISPONIBLE      2956".              
135990    03 ERROR-0957                          PIC X(54) VALUE                    
135991       "CONTRATO CUENTA CONTROL INEXISTENTE               2957".              
135992    03 ERROR-0958                          PIC X(54) VALUE                    
135993       "CLAVE TRANSACCION NO PERMITIDA PARA SUBCUENTAS    2958".              
135994    03 ERROR-0959                          PIC X(54) VALUE                    
135995       "SUBCUENTA NO RECIBE SALVO BUEN COBRO T+6          2959".              
135996    03 ERROR-0960                          PIC X(54) VALUE                    
135997       "DISP.ACTUAL SC MAYOR A DISP. ASIGNADO CTA CTROL   2960".              
135998    03 ERROR-0961                          PIC X(54) VALUE                    
135999       "DISPONIBLE ACTUAL INSUFICIENTE EN SUBCUENTA       2961".              
136000    03 ERROR-0962                          PIC X(54) VALUE                    
136001       "DISPONIBLE ASIGNADO INSUFICIENTE EN CUENTA CONTROL2962".              
136002    03 ERROR-0963                          PIC X(54) VALUE                    
136003       "TRANSACCION NO PERMITIDA.CAMBIO USO CTA EN PROCESO2963".              
136004    03 ERROR-0964                          PIC X(54) VALUE                    
136005       "APERTURA CTA CTROL o SUBCTA NO PERMITE CTA PROD E 2964".              
136006    03 ERROR-0965                          PIC X(54) VALUE                    
136007       "SUBCTA Y CTA CTROL DEBEN SER MISMA COBERTURA      2965".              
136008    03 ERROR-0966                          PIC X(54) VALUE                    
136009       "DIA DE CORTE NO PERMITIDO SOLO DIA 30             2966".              
136010    03 ERROR-0967                          PIC X(54) VALUE                    
136011       "APERTURA CC SOLO CON ABONO O ASIGNACION PRESUPUES 2967".              
136012    03 ERROR-0968                          PIC X(54) VALUE                    
136013       "ACTIVAC DE SUBCTA SOLO CON ASIGNACION PRESUPUESTO 2968".              
136014    03 ERROR-0969                          PIC X(54) VALUE                    
136015       "APERTURA SUBCTA SOLO A PRODUCTOS SIN PAGO REND    2969".              
136016    03 ERROR-0970                          PIC X(54) VALUE                    
136017       "PARA TRX DE SUBCTA, INFO CTA CTROL INEXISTENTE    2970".              
136018    03 ERROR-0971                          PIC X(54) VALUE                    
136019       "CONTRATO CTO CTROL DE LA SUBCUENTA NO ACTIVO      2971".              
136020    03 ERROR-0972                          PIC X(54) VALUE                    
136021       "MONEDA SUBCTA DIFERENTE A MONEDA CTA CTROL        2972".              
136022    03 ERROR-0973                          PIC X(54) VALUE                    
136023       "CTA CTROL o SUBCTA DEBEN SER DEL CSI DE APERTURA  2973".              
136024    03 ERROR-0974                          PIC X(54) VALUE                    
136025       "PRESUPUESTO DISPONIBLE INSUFICIENTE               2974".              
136026    03 ERROR-0975                          PIC X(54) VALUE                    
136027       "MONTO A REDUC EXCEDE DIF ENTRE PRES RECIB - ASIG R2975".              
136028    03 ERROR-0976                          PIC X(54) VALUE                    
136029       "PRESUPUESTO ASIGNADO INSUFICIENTE                 2976".              
136030    03 ERROR-0977                          PIC X(54) VALUE                    
136031       "SALDO DISPONIBLE INSUFICIENTE                     2977".              
136032    03 ERROR-0978                          PIC X(54) VALUE                    
136033       "PRESUPUESTO RECIBIDO INSUFICIENTE                 2978".              
136034    03 ERROR-0979                          PIC X(54) VALUE                    
136035       "ASIGNACIONES RECIBIDAS INSUFICIENTES              2979".              
136036    03 ERROR-0980                          PIC X(54) VALUE                    
136037       "ASIGNACIONES OTORGADAS INSUFICIENTE               2980".              
136038    03 ERROR-0981                          PIC X(54) VALUE                    
136039       "ESTRUCTURA CTA CTROL EN PROCESO DE REINICIO       2981".              
136040    03 ERROR-0982                          PIC X(54) VALUE                    
136041       "USO CUENTA DEBE SER DEL SERV CTA CTROL            2982".              
136042    03 ERROR-0983                          PIC X(54) VALUE                    
136043       "LA TRANSACCION DEBE SER PARA CUENTA CONTROL       2983".              
136044    03 ERROR-0984                          PIC X(54) VALUE                    
136045       "CTA CTROL DE LA TRANS DIF A CTA CTROL DE LA SUBCTA2984".              
136046    03 ERROR-0985                          PIC X(54) VALUE                    
136047       "SE DEBE ASIGNAR PRESUPUESTO ANTES DE DISPONIBLE   2985".              
136048    03 ERROR-0986                          PIC X(54) VALUE                    
136049       "TRANSACCION USO SC Y CC. ELIMINAR CON SUBCUENTA   2986".              
136050    03 ERROR-0987                          PIC X(54) VALUE                    
136051       "FALTA TIPO DE TRANSACCION                         2987".              
136052    03 ERROR-0988                          PIC X(54) VALUE                    
136053       "TIPO DE TRANSACCION NO PERMITIDO                  2988".              
136054    03 ERROR-0989                          PIC X(54) VALUE                    
136055       "CONTRATO NO PERMITE ESTE TIPO DE TRANSACCIONES    2989".              
136056    03 ERROR-0990                          PIC X(54) VALUE                    
136057       "EL IMPORTE ES MAYOR AL SALDO A AJUSTAR            2990".              
136058    03 ERROR-0991                          PIC X(54) VALUE                    
136059       "NO PERMITE CTA PRODUCTIVA ESP A CTA CTROL O SUB   2991".              
136060    03 ERROR-0992                          PIC X(54) VALUE                    
136061       "NO PERMITE CAMBIO A CTA CTROL O SUB PARA UC 8     2992".              
136062    03 ERROR-0993                          PIC X(54) VALUE                    
136063       "NO PERM CAMB A CTA CTROL CON SERV GCE             2993".              
136064    03 ERROR-0994                          PIC X(54) VALUE                    
136065       "NO PERM CAMB A CTA CTROL A CTA BLOQUEO            2994".              
136066    03 ERROR-0995                          PIC X(54) VALUE                    
136067       "NO PERM CAMB A CTA CTROL CON CHQ EN TRANS         2995".              
136068    03 ERROR-0996                          PIC X(54) VALUE                    
136069       "NO PERM CAMB A CTA CTROL CORTE DIF 30             2996".              
136070    03 ERROR-0997                          PIC X(54) VALUE                    
136071       "NO PERM CAMB A CTA CTROL X CAMBIO PROD ESPERA T+1 2997".              
136072    03 ERROR-0998                          PIC X(54) VALUE                    
136073       "NO PERM CAMB A SUBCUENTA TIENE CTAS TRASP         2998".              
136074    03 ERROR-0999                          PIC X(54) VALUE                    
136075       "NO PERM CAMB A CTA CONTROL/SUBCUENTA LIN SOBRE    2999".              
136076    03 ERROR-1000                          PIC X(54) VALUE                    
136077       "NO PERM CAMB A SUBCUENTA AUT PEND                 3000".              
136078    03 ERROR-1001                          PIC X(54) VALUE                    
136079       "NO PERM CAMB A SUBCUENTA PAGO PEND                3001".              
136080    03 ERROR-1002                          PIC X(54) VALUE                    
136081       "NO PERM CAMB A SUBCUENTA TIENE CBII O CDIRECT     3002".              
136082    03 ERROR-1003                          PIC X(54) VALUE                    
136083       "NO PERM CAMB A SUBCUENTA CON SDOS                 3003".              
136084    03 ERROR-1004                          PIC X(54) VALUE                    
136085       "NO PERM CAMB A SUBCUENTA CON COM CPEND            3004".              
136086    03 ERROR-1005                          PIC X(54) VALUE                    
136087       "NO PERM CAMB A SUBCUENTA PAGA REND                3005".              
136088    03 ERROR-1006                          PIC X(54) VALUE                    
136089       "NO PERM CAMB CTA CTROL A USOCTA ACT               3006".              
136090    03 ERROR-1007                          PIC X(54) VALUE                    
136091       "NO PERMITE CAMBIO DE CTA CTROL A SUBCUENTA        3007".              
136092    03 ERROR-1008                          PIC X(54) VALUE                    
136093       "NO PERMITE CAMBIO DE SUBCUENTA A CTA CTROL        3008".              
136094    03 ERROR-1009                          PIC X(54) VALUE                    
136095       "NO PERM CAMB A CTA CTROL SI HOY CORTA             3009".              
136096    03 ERROR-1010                          PIC X(54) VALUE                    
136097       "NO PERM CAMB CTA CTROL O SUB FUERA DE HORARIO     3010".              
136098    03 ERROR-1011                          PIC X(54) VALUE                    
136099       "CTA CTROL O SUBCTA NO PERMITE CAMBIO SUCURSAL     3011".              
136100    03 ERROR-1012                          PIC X(54) VALUE                    
136101       "CTO CTA CTROL O SUBC TIENE ASIGNA OTORGADAS       3012".              
136102    03 ERROR-1013                          PIC X(54) VALUE                    
136103       "CTO CTA CTROL O SUB TIENE DISPONIBLE ASIGNADO     3013".              
136104    03 ERROR-1014                          PIC X(54) VALUE                    
136105       "CTO CTA CTROL O SUBCTA TIENE PRESUP RECIBIDO      3014".              
136106    03 ERROR-1015                          PIC X(54) VALUE                    
136107       "CTO CTA CTROL O SUBCTA TIENE PRESUP ASIGNADO      3015".              
136108    03 ERROR-1016                          PIC X(54) VALUE                    
136109       "CTO CTA CTROL O SUBCTA TIENE BLOQUEO              3016".              
136110    03 ERROR-1017                          PIC X(54) VALUE                    
136111       "NO SE PERMITEN CTOS.DE TRASP. A SUBCUENTAS        3017".              
136112    03 ERROR-1018                          PIC X(54) VALUE                    
136113       "CONTRATO EN PROC. DE CAMBIO A SUBCUENTAS          3018".              
136114    03 ERROR-1019                          PIC X(54) VALUE                    
136115       "NO SE PERMITE LINEA CREDITO A SUBCUENTAS          3019".              
136116    03 ERROR-1020                          PIC X(54) VALUE                    
136117       "NO SE PERMITEN REACTIVAR SUBCUENTAS               3020".              
136118    03 ERROR-1021                          PIC X(54) VALUE                    
136119       "FUNCIONALIDAD NO SE PERMITE  SERV CTA CTROL O SUB 3021".              
136120    03 ERROR-1022                          PIC X(54) VALUE                    
136121       "NO SE CUENTA CON LIGA A CUENTA CONTROL            3022".              
136122    03 ERROR-1023                          PIC X(54) VALUE                    
136123       "CONTRATO EN PROCESO CAMBIO SUBCUENTA              3023".              
136124    03 ERROR-1024                          PIC X(54) VALUE                    
136125       "NO PERM CAMB SUBCUENTA A USOCTA ACT               3024".              
136126    03 ERROR-1025                          PIC X(54) VALUE                    
136127       "CONTRATO NO ACTIVO NO PERMITE REINICIO            3025".              
136128    03 ERROR-1026                          PIC X(54) VALUE                    
136129       "REINICIO FUERA DE HORARIO                         3026".              
136130    03 ERROR-1027                          PIC X(54) VALUE                    
136131       "SUBCUENTAS CON BLOQUEO NO PERMITE REINICIO        3027".              
136132    03 ERROR-1028                          PIC X(54) VALUE                    
136133       "BLOQUEO TOTAL CTA CTROL NO PERMITE REINICIO       3028".              
136134    03 ERROR-1029                          PIC X(54) VALUE                    
136135       "CTA CTROL TIENE ASIGNA NO PERMITE REINICIO        3029".              
136136    03 ERROR-1030                          PIC X(54) VALUE                    
136137       "REINICIO DE ESTRUCTURA EN PROCESO                 3030".              
136138    03 ERROR-1031                          PIC X(54) VALUE                    
136139       "CUENTA NO PERMITE FUNCIONALIDAD DE RESETEO        3031".              
136140    03 ERROR-1032                          PIC X(54) VALUE                    
136141       "DIA DE CORTE NO PERMITIDO EN CUENTA CONTROL       3032".              
136142    03 ERROR-1033                          PIC X(54) VALUE                    
136143       "SERV CTA CTROL NO PERMITE SERV GCE                3033".              
136144    03 ERROR-1034                          PIC X(54) VALUE                    
136145       "SUBCUENTA NO PERMITE SERV CBII O CDIRECT          3034".              
136146    03 ERROR-1035                          PIC X(54) VALUE                    
136147       "NO PERMITE APAGAR IND CANC AUT A CTA CTROL O SUB  3035".              
136148    03 ERROR-1036                          PIC X(54) VALUE                    
136149       "HAY CAMBIO USO CTA                                3036".              
136150    03 ERROR-1037                          PIC X(54) VALUE                    
136151       "NO SE PERMITE EN PROC DE CAMBIO A SERV CTA CTROL  3037".              
136152    03 ERROR-1038                          PIC X(54) VALUE                    
136153       "NO SE PERMITE LINEA CREDITO A CTA CTROL O SUB     3038".              
136154    03 ERROR-1039                          PIC X(54) VALUE                    
136155       "CONTRATO EN PROC. DE CAMBIO A CTA CTROL O SUB     3039".              
136156    03 ERROR-1040                          PIC X(54) VALUE                    
136157       "CC Y SC NO PERMITE LC CONTRACTUAL                 3040".              
136158    03 ERROR-1041                          PIC X(54) VALUE                    
136159       "RESET SOLO APLICA PARA CC                         3041".              
136160    03 ERROR-1042                          PIC X(54) VALUE                    
136161       "CC NO TIENE SOLICITUD DE RESETEO                  3042".              
136162    03 ERROR-1043                          PIC X(54) VALUE                    
136163       "SALDO DISPONIBLE INSUFICIENTE PARA DESASIGNAR     3043".              
136164    03 ERROR-1044                          PIC X(54) VALUE                    
136165       "CTA CTROL DE LA TRANS NO EXISTE EN EL S500        3044".              
136166    03 ERROR-1045                          PIC X(54) VALUE                    
136167       "CANCELACION DE REINICIO FUERA DE HORARIO          3045".              
136168    03 ERROR-1046                          PIC X(54) VALUE                    
136169       "TRANSACCION FUERA DE HORARIO                      3046".              
136170    03 ERROR-1047                          PIC X(54) VALUE                    
136171       "LA TRANSACCION DEBE SER PARA SUBCUENTA            3047".              
136172    03 ERROR-1048                          PIC X(54) VALUE                    
136173       "NO SE PERMITEN SUBCUENTAS A CTOS DE TRASPASOS     3048".              
136174    03 ERROR-1049                          PIC X(54) VALUE                    
136175       "NO PERM CAMB A USOCTA ACT CON CANCAUTO            3049".              
136176    03 ERROR-1050                          PIC X(54) VALUE                    
136177       "RESTRICCION POR SUPLANTACION DE IDENTIDAD         3050".              
136178    03 ERROR-1051                          PIC X(54) VALUE                    
136179       "NO SE PERMITE CAMBIO DE RESTRICCION               3051".              
136180    03 ERROR-1052                          PIC X(54) VALUE                    
136181       "IND. ACEPTA MOV C/RESTRICCION 52 INVALIDO         3052".              
136182    03 ERROR-1053                          PIC X(54) VALUE                    
136183       "NO PERMITE BLOQUEO GCE EN VENT SELLO              3053".              
136184    03 ERROR-1054                          PIC X(54) VALUE                    
136185       "FONDOS INSUFICIENTES A BLOQUEAR GCE               3054".              
136186    03 ERROR-1055                          PIC X(54) VALUE                    
136187       "NO PERMITE BLOQUEO A CTO SIN SERV GCE             3055".              
136188    03 ERROR-1056                          PIC X(54) VALUE                    
136189       "CLAVE DE BLOQUEO NO CALIFICADA CON SERV GCE       3056".              
136190    03 ERROR-1057                          PIC X(54) VALUE                    
136191       "NO CUENTA CON BLOQUEO GCE                         3057".              
136192    03 ERROR-1058                          PIC X(54) VALUE                    
136193       "NO PERMITE DESBLOQUEO GCE EN VENT SELLO           3058".              
136194    03 ERROR-1059                          PIC X(54) VALUE                    
136195       "SALDO A DESBLOQUEAR MAYOR A BLOQUEADO GCE         3059".              
136196    03 ERROR-1060                          PIC X(54) VALUE                    
136197       "NO PERMITE DESBLOQUEO A CTO SIN SERV GCE          3060".              
136198    03 ERROR-1061                          PIC X(54) VALUE                    
136199       "CLAVE DE DESBLOQUEO NO CALIFICADA CON SERV GCE    3061".              
136200    03 ERROR-1062                          PIC X(54) VALUE                    
136201       "CONTRATO CUENTA CON SALDO BLOQUEADO GCE           3062".              
136202    03 ERROR-1063                          PIC X(54) VALUE                    
136203       "SALDO BLOQUEADO GCE INSUFICIENTE                  3063".              
136204    03 ERROR-1064                          PIC X(54) VALUE                    
136205       "CONTRATO NO TIENE SALDO BLOQUEADO GCE             3064".              
136206    03 ERROR-1065                          PIC X(54) VALUE                    
136207       "SALDO BLOQUEADO MENOR AL IMPORTE SOLICITADO       3065".              
136208    03 ERROR-1066                          PIC X(54) VALUE                    
136209       "                                                  3066".              
136210    03 ERROR-1067                          PIC X(54) VALUE                    
136211       "                                                  3067".              
136212    03 ERROR-1068                          PIC X(54) VALUE                    
136213       "CTA ORIG EXISTENTE CON STATUS NO VALIDO           3068".              
136214    03 ERROR-1069                          PIC X(54) VALUE                    
136215       "CAJA O SUC INCORRECTA                             3069".              
136216    03 ERROR-1070                          PIC X(54) VALUE                    
136217       "PRODUCTO NO VALIDO PARA REACT.                    3070".              
136218    03 ERROR-1071                          PIC X(54) VALUE                    
136219       "CTA ORIGEN NO CORRESPONDE A LA CTA GLB            3071".              
136220    03 ERROR-1072                          PIC X(54) VALUE                    
136221       "CTA GLOBAL CON ESTATUS BENEFICENCIA INVALIDO      3072".              
136222    03 ERROR-1073                          PIC X(54) VALUE                    
136223       "CTA GLOBAL CON ESTATUS NO ACTIVO                  3073".              
136224    03 ERROR-1074                          PIC X(54) VALUE                    
136225       "FECHA DE BENEFICENCIA INCORRECTA                  3074".              
136226    03 ERROR-1075                          PIC X(54) VALUE                    
136227       "CTA GLOBAL EXISTENTE NO CANCELADA                 3075".              
136228    03 ERROR-1076                          PIC X(54) VALUE                    
136229       "CONTRATO EXISTENTE NO ACTIVADO EN CLIENTES        3076".              
136230    03 ERROR-1077                          PIC X(54) VALUE                    
136231       "VALOR NO PERMITIDO INDICADOR DE ACUMULADO         3077".              
136232    03 ERROR-1078                          PIC X(54) VALUE                    
136233       "VALOR NO PERMITIDO CAMPO SALDO RETENIDO           3078".              
136234    03 ERROR-1079                          PIC X(54) VALUE                    
136235       "NO REUTILIZAR                                     XXXX".              
136236    03 ERROR-1080                          PIC X(54) VALUE                    
136237       "SALDO RET PERMITIDO P/CARGOS-NO CONTABLES         3080".              
136238    03 ERROR-1081                          PIC X(54) VALUE                    
136239       "CONTRATO NO TIENE SALDO CONGELADO DYR             3081".              
136240    03 ERROR-1082                          PIC X(54) VALUE                    
136241       "SALDO CONGELADO MENOR AL IMPORTE SOLICITADO       3082".              
136242    03 ERROR-1083                          PIC X(54) VALUE                    
136243       "VALOR NO VALIDO PARA APAGADO TOTAL                3083".              
136244    03 ERROR-1084                          PIC X(54) VALUE                    
136245       "NO REUTILIZAR                                     XXXX".              
136246    03 ERROR-1085                          PIC X(54) VALUE                    
136247       "NO REUTILIZAR                                     XXXX".              
136248    03 ERROR-1086                          PIC X(54) VALUE                    
136249       "IMPORTE CONTRAPARTIDAS NO COINCIDE VS IMPORTE TOT 3086".              
136250    03 ERROR-1087                          PIC X(54) VALUE                    
136251       "ACTUALIZACION NO REALIZADA, INTENTE MAS TARDE     3087".              
136252    03 ERROR-1088                          PIC X(54) VALUE                    
136253       "SDO DISP INSUFICIENTE X REGULACION SPEI           3088".              
136254    03 ERROR-1089                          PIC X(54) VALUE                    
136255       "NO REUTILIZAR                                     XXXX".              
136256    03 ERROR-1090                          PIC X(54) VALUE                    
136257       "SISTEMA1 DYR INVALIDO O NO NUMERICO               3090".              
136258    03 ERROR-1091                          PIC X(54) VALUE                    
136259       "CALIF VALIDA/ACUMULA O USO-SDO-RET PARA SISTEMA1  3091".              
136260    03 ERROR-1092                          PIC X(54) VALUE                    
136261       "SISTEMA2 DYR INVALIDO O NO NUMERICO               3092".              
136262    03 ERROR-1093                          PIC X(54) VALUE                    
136263       "CALIF VALIDA/ACUMULA O USO-SDO-RET PARA SISTEMA2  3093".              
136264    03 ERROR-1094                          PIC X(54) VALUE                    
136265       "RECHAZO RETIRO D EFECT X CTE SUSPENDIDO           3094".              
136266    03 ERROR-1095                          PIC X(54) VALUE                    
136267       "LIMITE EXCEDIDO RET DIA-MENSUAL                   3095".              
136268    03 ERROR-1096                          PIC X(54) VALUE                    
136269       "NO REUTILIZAR                                     XXXX".              
136270    03 ERROR-1097                          PIC X(54) VALUE                    
136271       "NO REUTILIZAR                                     XXXX".              
136272    03 ERROR-1098                          PIC X(54) VALUE                    
136273       "EL INDICADOR Y/O ID DE CSI NO TIENE UN PTB VALIDO 3098".              
136274    03 ERROR-1099                          PIC X(54) VALUE                    
136275       "CSI DUPLICADO                                     3099".              
136276    03 ERROR-1100                          PIC X(54) VALUE                    
136277       "SE DEBE DE DESPLEGAR ANTES DE CAMBIAR INFORMACION 3100".              
136278    03 ERROR-1101                          PIC X(54) VALUE                    
136279       "PTB DUPLICADO                                     3101".              
136280    03 ERROR-1102                          PIC X(54) VALUE                    
136281       "INDICADOR NO VALIDO REINTENTE                     3102".              
136282    03 ERROR-1103                          PIC X(54) VALUE                    
136283       "CAMPO AJUSTE P160 INCORRECTO                      3103".              
136284    03 ERROR-1104                          PIC X(54) VALUE                    
136285       "INDICADOR DE SIRH INVALIDO                        3104".              
136286    03 ERROR-1105                          PIC X(54) VALUE                    
136287       "EN OPCION  C,  INDICADOR DE SIRH = SPACES         3105".              
136288    03 ERROR-1106                          PIC X(54) VALUE                    
136289       "EN OPCION  M,  INDICADOR DE SIRH = SPACES         3106".              
136290    03 ERROR-1107                          PIC X(54) VALUE                    
136291       "EN OPCION  H,  INDICADOR DE INACTIVIDAD = SPACES  3107".              
136292    03 ERROR-1108                          PIC X(54) VALUE                    
136293       "EN OPCION  H,  STATION NAME = SPACES              3108".              
136294    03 ERROR-1109                          PIC X(54) VALUE                    
136295       "NO PERMTE ENVIO D FONDOS A CC TESOFE POR ESTE SIRH3109".              
136296    03 ERROR-1110                          PIC X(54) VALUE                    
136297       "INDICADOR DE SIRH SOLO PARA CTA TESOFE CONTROL    3110".              
136298    03 ERROR-1111                          PIC X(54) VALUE                    
136299       "RESTRICCION TESOFE INVALIDA                       3111".              
136300    03 ERROR-1112                          PIC X(54) VALUE                    
136301       "RESTRICCION 22 NO PERMITE CHEQUES DE CAJA         3112".              
136302    03 ERROR-1113                          PIC X(54) VALUE                    
136303       "RESTRICCION 23 NO PERMITE OP INTERNACIONALES      3113".              
136304    03 ERROR-1114                          PIC X(54) VALUE                    
136305       "RESTRICCION 24 NO RECIBE EFEC/CHQ CAJAS/INTER     3114".              
136306    03 ERROR-1115                          PIC X(54) VALUE                    
136307       "LIMITE EXCEDIDO RET MENSUAL                       3115".              
136308    03 ERROR-1116                          PIC X(54) VALUE                    
136309       "LIMITE EXCEDIDO RET DIARIO                        3116".              
136310    03 ERROR-1117                          PIC X(54) VALUE                    
136311       "PRODUCTO NO PAGA RENDIMIENTOS                     3117".              
136312    03 ERROR-1118                          PIC X(54) VALUE                    
136313       "CONTRATO CON CAMBIO DE PRODUCTO EN PROCESO        3118".              
136314    03 ERROR-1119                          PIC X(54) VALUE                    
136315       "INDICADOR SERVICIO GBNP INVALIDO                  3119".              
136316    03 ERROR-1120                          PIC X(54) VALUE                    
136317       "EXCEDE LIM. DIARIO DE DISP. LINEA DE SOBREGIRO    3120".              
136318    03 ERROR-1121                          PIC X(54) VALUE                    
136319       "FECHA INICIO D COBRO INVALIDA O FORMATO INCORRECTO3121".              
136320    03 ERROR-1122                          PIC X(54) VALUE                    
136321       "ERROR PROPIO DEL CORE FIRMA DIGITAL (S107)        3122".              
136322    03 ERROR-1123                          PIC X(54) VALUE                    
136323       "ERRROR AL GENERAR LA FIRMA (S107)                 3123".              
136324    03 ERROR-1124                          PIC X(54) VALUE                    
136325       "ERROR AL VALIDAR LA FIRMA (S107)                  3124".              
136326    03 ERROR-1125                          PIC X(54) VALUE                    
136327       "ERROR DE TIMEOUT (S107)                           3125".              
136328    03 ERROR-1126                          PIC X(54) VALUE                    
136329       "ERROR FATAL (S107)                                3126".              
136330    03 ERROR-1127                          PIC X(54) VALUE                    
136331       "NO SE PERMITE CAMBIO DE RESTRICCION A DORMANT     3127".              
136332    03 ERROR-1128                          PIC X(54) VALUE                    
136333       "CONTRATO DORMANT NO PERMIT CARGO/ABONO/CANCELACION3128".              
136334    03 ERROR-1129                          PIC X(54) VALUE                    
136335       "APERTURA RECH, CTO EN CTA GLOBAL CHECAR Q050058   3129".              
136336    03 ERROR-1130                          PIC X(54) VALUE                    
136337       "CONTRATO EN PROCESO DE MIGRACION                  3130".              
136338    03 ERROR-1131                          PIC X(54) VALUE                    
136339       "TIPO PAGO CODI SIN NOTIF DE ABONO TIEMPO REDUCIDO 3131".              
136340    03 ERROR-1132                          PIC X(54) VALUE                    
136341       "FECHA EN TIME-STAMP CON FORMATO INCORRECTO        3132".              
136342    03 ERROR-1133                          PIC X(54) VALUE                    
136343       "HORA EN TIME-STAMP CON FORMATO INCORRECTO         3133".              
136344    03 ERROR-1134                          PIC X(54) VALUE                    
136345       "SEGUNDO LIM BANXICO EN TIME-STAMP INCORRECTO      3134".              
136346    03 ERROR-1135                          PIC X(54) VALUE                    
136347       "FALTA INDICADOR BNE                               3135".              
136348    03 ERROR-1136                          PIC X(54) VALUE                    
136349       "INDICADOR BNE NO NUMERICO                         3136".              
136350    03 ERROR-1137                          PIC X(54) VALUE                    
136351       "INDICADOR BNE NO VALIDO, DEBE SER 0 o 1           3137".              
136352    03 ERROR-1138                          PIC X(54) VALUE                    
136353       "CONSULTA PREVIA ES REQUERIDA (FUNCION DESPLIEGA)  3138".              
136354    03 ERROR-1139                          PIC X(54) VALUE                    
136355       "CHQ EN TRANSITO TRANSMITIR POR SBC                3139".              
136356    03 ERROR-1140                          PIC X(54) VALUE                    
136357      "INDICADOR EXT NET INCORRECTO                      3140".               
136358    03 ERROR-1141                          PIC X(54) VALUE                    
136359       "TRANS FUERA DE HORARIO DE EXT NET                 3141".              
136360    03 ERROR-1142                          PIC X(54) VALUE                    
136361       "OPERACION NO PERMITIDA POR CONTRATO MIGRADO       3142".              
136362    03 ERROR-1143                          PIC X(54) VALUE                    
136363       "EN OPCION  C,  INDICADOR DE EXTNET = SPACES       3143".              
136364    03 ERROR-1144                          PIC X(54) VALUE                    
136365       "EN OPCION  M,  INDICADOR DE EXTNET = SPACES       3144".              
136366    03 ERROR-1145                          PIC X(54) VALUE                    
136367       "EN OPCION  H,  INDICADOR DE EXTNET = SPACES       3145".              
136368    03 ERROR-1146                          PIC X(54) VALUE                    
136369       "EN OPCION  E,  STATION NAME = SPACES              3146".              
136370    03 ERROR-1147                          PIC X(54) VALUE                    
136371       "EN OPCION  E,  INDICADOR DE INACTIVIDAD = SPACES  3147".              
136372    03 ERROR-1148                          PIC X(54) VALUE                    
136373       "EN OPCION  E,  INDICADOR DE SIRH = SPACES         3148".              
136374    03 ERROR-1149                          PIC X(54) VALUE                    
136375       "MOV EXT NET LOCAL NO PERMITIDO PARA ESTA OFICINA  3149".              
136376    03 ERROR-1150                          PIC X(54) VALUE                    
136377       "MOV EXT NET FORANEO NO PERMITIDO PARA ESTA OFICINA3150".              
136378    03 ERROR-1151                          PIC X(54) VALUE                    
136379       "OPERACION NO PERMITIDA POR CONTRATO MIGRADO       3151".              
136380    03 ERROR-1152                          PIC X(54) VALUE                    
136381       "APERTURA NO PERMITIDA POR CONTRATO MIGRADO        3152".              
136382    03 ERROR-1153                          PIC X(54) VALUE                    
136383       "CALIF EXT NET NO PERMITIDA ANTES DE FEC CLONA     3153".              
136384    03 ERROR-1154                          PIC X(54) VALUE                    
136385       "OPERACION NO PERMITIDA POR CONTRATO MIGRADO       3154".              
136386    03 ERROR-1155                          PIC X(54) VALUE                    
136387       "EXCEDE FORMAS DE PAGO PERMITIDAS PARA EXT NET     3155".              
136388    03 ERROR-1156                          PIC X(54) VALUE                    
136389       "IND CTA CONCENT EXT NET MADRE INCORRECTO          3156".              
136390    03 ERROR-1157                          PIC X(54) VALUE                    
136391       "                                                  3157".              
136392    03 ERROR-1158                          PIC X(54) VALUE                    
136393       "CTA CONCENT MADRE EXT NET NO PUEDE SER CTA ESPEJO 3158".              
136394    03 ERROR-1159                          PIC X(54) VALUE                    
136395       "NO SE ACTIVO CTA MADRE EXTNET,CTA NO CONCENTRADORA3159".              
136396    03 ERROR-1160                          PIC X(54) VALUE                    
136397       "SALDO BLOQUEADO NO NUMERICO                       3160".              
136398    03 ERROR-1161                          PIC X(54) VALUE                    
136399       "SALDO BLOQUEADO NO PUEDE SER CERO                 3161".              
136400    03 ERROR-1162                          PIC X(54) VALUE                    
136401       "SALDO BLOQUEADO MAYOR AL ABONO                    3162".              
136402    03 ERROR-1163                          PIC X(54) VALUE                    
136403       "SALDO BLOQUEADO NO PERMITIDO EN BASE AUXILIAR     3163".              
136404    03 ERROR-1164                          PIC X(54) VALUE                    
136405       "NO PUEDE ELIMINAR, SALDO BLOQUEADO INSUFICIENTE   3164".              
136406    03 ERROR-1165                          PIC X(54) VALUE                    
136407       "INDICADOR SALDO BLOQUEADO INCORRECTO              3165".              
136408    03 ERROR-1166                          PIC X(54) VALUE                    
136409       "INDICADOR DE USO SDOBLOQ A CLAVE INVALIDA         3166".              
136410    03 ERROR-1167                          PIC X(54) VALUE                    
136411       "INDICADOR SIN LIMITE DE DEPOSITO INCORRECTO       3167".              
136412    03 ERROR-1168                          PIC X(54) VALUE                    
136413       "NIVEL CTA INVALIDO O NO NUMERICO                  3168".              
136414    03 ERROR-1169                          PIC X(54) VALUE                    
136415       "CLAVE ADICIONAL INVALIDA O NO NUMERICA            3169".              
136416    03 ERROR-1170                          PIC X(54) VALUE                    
136417       "CLAVE ADICIONAL INEXISTENTE                       3170".              
136418    03 ERROR-1171                          PIC X(54) VALUE                    
136419       "INDICADOR DE COMISIÓN EXENTA INCORRECTO           3171".              
136420    03 ERROR-1172                          PIC X(54) VALUE                    
136421       "AUTORIZACION CHECKER DEBE SER NUMERICA            3172".              
136422    03 ERROR-1173                          PIC X(54) VALUE                    
136423       "AUTORIZACION INEXISTENTE                          3173".              
136424    03 ERROR-1174                          PIC X(54) VALUE                    
136425       "MAKER Y CHECKER NO DEBEN SER LA MISMA PERSONA     3174".              
136426    03 ERROR-1175                          PIC X(54) VALUE                    
136427       "SUCURSAL CHECKER DIFERENTE DE SUCURSAL MAKER      3175".              
136428    03 ERROR-1176                          PIC X(54) VALUE                    
136429       "CHECKER SOLO VALIDA TRANSACCIONES DEL DIA ACTUAL  3176".              
136430    03 ERROR-1177                          PIC X(54) VALUE                    
136431       "AUTORIZACION PREVIAMENTE APROBADA                 3177".              
136432    03 ERROR-1178                          PIC X(54) VALUE                    
136433       "CHECKER EXCEDIO NUMERO DE INTENTOS PERMITIDOS     3178".              
136434    03 ERROR-1179                          PIC X(54) VALUE                    
136435       "CAPTURA DEL CHECKER NO COINCIDE CON EL MAKER      3179".              
136436    03 ERROR-1180                          PIC X(54) VALUE                    
136437       "CAPTURA DEL CHECKER NO COINCIDE 2DO INTENTO       3180".              
136438    03 ERROR-1181                          PIC X(54) VALUE                    
136439       "PANTALLA NO PERMITIDA EN BATCH PARA MAKER/CHECKER 3181".              
136440    03 ERROR-1182                          PIC X(54) VALUE                    
136441       "                                                      ".              
136442    03 ERROR-1183                          PIC X(54) VALUE                    
136443       "                                                      ".              
136444    03 ERROR-1184                          PIC X(54) VALUE                    
136445       "                                                      ".              
136446    03 ERROR-1185                          PIC X(54) VALUE                    
136447       "                                                      ".              
136448    03 ERROR-1186                          PIC X(54) VALUE                    
136449       "                                                      ".              
136450    03 ERROR-1187                          PIC X(54) VALUE                    
136451       "                                                      ".              
136452    03 ERROR-1188                          PIC X(54) VALUE                    
136453       "                                                      ".              
136454    03 ERROR-1189                          PIC X(54) VALUE                    
136455       "                                                      ".              
136456    03 ERROR-1190                          PIC X(54) VALUE                    
136457       "                                                      ".              
136458    03 ERROR-1191                          PIC X(54) VALUE                    
136459       "                                                      ".              
136460    03 ERROR-1192                          PIC X(54) VALUE                    
136461       "                                                      ".              
136462    03 ERROR-1193                          PIC X(54) VALUE                    
136463       "                                                      ".              
136464    03 ERROR-1194                          PIC X(54) VALUE                    
136465       "                                                      ".              
136466    03 ERROR-1195                          PIC X(54) VALUE                    
136467       "                                                      ".              
136468    03 ERROR-1196                          PIC X(54) VALUE                    
136469       "                                                      ".              
136470    03 ERROR-1197                          PIC X(54) VALUE                    
136471       "                                                      ".              
136472    03 ERROR-1198                          PIC X(54) VALUE                    
136473       "                                                      ".              
136474    03 ERROR-1199                          PIC X(54) VALUE                    
136475       "                                                      ".              
136476    03 ERROR-1200                          PIC X(54) VALUE                    
136477       "                                                  XXXX".              
136478  01 WS-TABLA-ERRORES-R REDEFINES WS-TABLA-ERRORES.                           
136479     03 WS-TBL-ERRORES OCCURS 1200 TIMES.                                     
136480       05 WS-TBL-ERROR-CON1                PIC X(20).                         
136481       05 WS-TBL-ERROR-CON2                PIC X(30).                         
136482       05 WS-TBL-ERROR-NUM                 PIC 9(04).                         
136483  77 WS-IND-LEY                            PIC 9(04).                         
136484**                                                                            
136485 COMMUNICATION SECTION.                                                       
136486**                                                                            
136487   INPUT HEADER COMS-IN;                                                      
136488     PROGRAMDESG        IS COMS-IN-PROGRAM;                                   
136489     FUNCTIONSTATUS     IS COMS-IN-FUNCTION-STATUS;                           
136490     FUNCTIONINDEX      IS COMS-IN-FUNCTION-INDEX;                            
136491     USERCODE           IS COMS-IN-USERCODE;                                  
136492     SECURITYDESG       IS COMS-IN-SECURITY-DESG;                             
136493     TRANSPARENT        IS COMS-IN-TRANSPARENT;                               
136494     VTFLAG             IS COMS-IN-VT-FLAG;                                   
136495     TIMESTAMP          IS COMS-IN-TIMESTAMP;                                 
136496     STATION            IS COMS-IN-STATION;                                   
136497     TEXTLENGTH         IS COMS-IN-TEXT-LENGTH;                               
136498     STATUSVALUE        IS COMS-IN-STATUS-KEY;                                
136600     MESSAGECOUNT       IS COMS-IN-MSG-COUNT;                                 
136700     RESTART            IS COMS-IN-RST-LOC;                                   
136800     AGENDA             IS COMS-IN-AGENDA.                                    
136900                                                                              
137000   OUTPUT HEADER COMS-OUT;                                                    
137100     DESTCOUNT              IS COMS-OUT-COUNT;                                
137200     TEXTLENGTH             IS COMS-OUT-TEXT-LENGTH;                          
137300     STATUSVALUE            IS COMS-OUT-STATUS-KEY;                           
137400     TRANSPARENT            IS COMS-OUT-TRANSPARENT;                          
137500     VTFLAG                 IS COMS-OUT-VT-FLAG;                              
137600     CONFIRMFLAG            IS COMS-OUT-CONFIRM-FALG;                         
137700     CONFIRMKEY             IS COMS-OUT-CONFIRM-KEY;                          
137800     DESTINATIONDESG        IS COMS-OUT-DESTINATION;                          
137900     NEXTINPUTAGENDA        IS COMS-OUT-NEXT-INPUT-AGENDA;                    
138000     SETNEXTINPUTAGENDA     IS COMS-OUT-SET-NEXT-INPUT-AGENDA;                
138100     RETAINTRANSACTIONMODE  IS COMS-OUT-SAVE-TRANS-MODE;                      
138200     AGENDA                 IS COMS-OUT-AGENDA.                               
138300                                                                              
138400******************************************************************            
138500*     P  R  O  C  E  D  U  R  E     D  I  V  I  S  I  O  N       *            
138600******************************************************************            
138700 PROCEDURE DIVISION.                                                          
138800 DECLARATIVES.                                                                
138900 INTERRUPT-SECCION SECTION.                                                   
139000      USE AS INTERRUPT PROCEDURE.                                             
139100 INTERRUPT-BY-HI.                                                             
139200      DISALLOW INTERRUPT.                                                     
139210      MOVE "E"             TO WKS-TIPO-LJ                                     
139220      MOVE 020801          TO WKS-CODIGO-LJ                                   
139230      STRING "INTERRUPT POR OPERADOR "                                        
139240              DELIMITED BY SIZE INTO TEXTO-LJ                                 
139250      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
139400      GO TO HI-1                                                              
139500            HI-2                                                              
139600            HI-3                                                              
139700            HI-4                                                              
139800            HI-5                                                              
139900            HI-6                                                              
139950            HI-7                                                              
140000         DEPENDING ON ATTRIBUTE TASKVALUE OF MYSELF.                          
140010      MOVE "E"             TO WKS-TIPO-LJ                                     
140020      MOVE 020801          TO WKS-CODIGO-LJ                                   
140030      STRING "OPCION NO IMPLEMENTADA "                                        
140040      DELIMITED BY SIZE INTO TEXTO-LJ                                         
140050      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
140200      GO TO END-INTERRUPT-BY-HI.                                              
140300 HI-1.                                                                        
140400      COMPUTE WS-PORC-ENVIO = (WS-LLAVE-ORDCM / WS-ULTREG-ORDCM)              
140500                              * 100.                                          
140510      MOVE "E"             TO WKS-TIPO-LJ                                     
140515      MOVE 020801          TO WKS-CODIGO-LJ                                   
140520      STRING "NUM DE MENSAJES ENVIADOS "                                      
140525              WS-LLAVE-ORDCM "/" WS-ULTREG-ORDCM " "                          
140530              WS-PORC-ENVIO "%"                                               
140540      DELIMITED BY SIZE INTO TEXTO-LJ                                         
140550      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
140900      GO TO END-INTERRUPT-BY-HI.                                              
141000 HI-2.                                                                        
141010      MOVE "E"             TO WKS-TIPO-LJ                                     
141020      MOVE 020801          TO WKS-CODIGO-LJ                                   
141030      STRING "HABILITO MONITOREO DE MENSAJES "                                
141040      DELIMITED BY SIZE INTO TEXTO-LJ                                         
141050      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
141200      MOVE 1 TO WS-MONITOREO.                                                 
141300      GO TO END-INTERRUPT-BY-HI.                                              
141400 HI-3.                                                                        
141410      MOVE "E"             TO WKS-TIPO-LJ                                     
141420      MOVE 020801          TO WKS-CODIGO-LJ                                   
141430      STRING "DESHABILITO MONITOREO DE MENSAJES "                             
141440      DELIMITED BY SIZE INTO TEXTO-LJ                                         
141450      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
141600      MOVE 0 TO WS-MONITOREO.                                                 
141700      GO TO END-INTERRUPT-BY-HI.                                              
141800 HI-4.                                                                        
141900      MOVE "DISABLE PROGRAM S500P015"  TO WS-SOPCOM-COMANDO.                  
142000      CALL "SMCOMS OF SOPORTECOMS" USING  WS-SOPCOM-COMANDO                   
142100                                          WS-SOPCOM-TRABAJO                   
142200                                   GIVING WS-COMS-RESULT.                     
142300      IF WS-COMS-RESULT = 1                                                   
142310         MOVE "E"             TO WKS-TIPO-LJ                                  
142320         MOVE 020801          TO WKS-CODIGO-LJ                                
142330         STRING "NO ACEPTO DISABLE SOPCOMS "                                  
142340         DELIMITED BY SIZE INTO TEXTO-LJ                                      
142350         PERFORM 00000000-LLAMA-DISPLAY-STRING.                               
142500      GO TO END-INTERRUPT-BY-HI.                                              
142600 HI-5.                                                                        
142610      MOVE "I"             TO WKS-TIPO-LJ                                     
142620      MOVE 020801          TO WKS-CODIGO-LJ                                   
142625      STRING "ULTREG ENVIADO " WS-ULTREG-ENV                                  
142630             "ULTREG RECIBIDO "WS-ULTREG-REC                                  
142635      DELIMITED BY SIZE INTO TEXTO-LJ                                         
142640      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
142900      ACCEPT WS-ULTREG-REC.                                                   
142950      GO TO END-INTERRUPT-BY-HI.                                              
143000 HI-6.                                                                        
143010     MOVE "E"             TO WKS-TIPO-LJ                                      
143020     MOVE 020801          TO WKS-CODIGO-LJ                                    
143030     STRING "HI DADO DE BAJA "                                                
143040     DELIMITED BY SIZE INTO TEXTO-LJ                                          
143050     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
143205     GO TO END-INTERRUPT-BY-HI.                                               
143210 HI-7.                                                                        
143212     IF WKS-REG-ULTIMO = 0                                                    
143214        MOVE 0             TO WKS-ARCH-EN-PROCESO-PORC                        
143216     ELSE                                                                     
143220        COMPUTE WKS-ARCH-EN-PROCESO-PORC = ( WKS-REG-ACTUAL /                 
143230                                             WKS-REG-ULTIMO )                 
143240                                           * 100.                             
143241      MOVE "E"             TO WKS-TIPO-LJ                                     
143242      MOVE 020801          TO WKS-CODIGO-LJ                                   
143243      STRING "ARCHIVO PROCESANDOSE "WKS-ARCH-EN-PROCESO                       
143244             " ( EN " WKS-REG-ACTUAL                                          
143245             " DE "   WKS-REG-ULTIMO                                          
143246             "     "  WKS-ARCH-EN-PROCESO-PORC                                
143247             " % )"                                                           
143248      DELIMITED BY SIZE INTO TEXTO-LJ                                         
143249      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
143300 END-INTERRUPT-BY-HI.                                                         
143400      ALLOW INTERRUPT.                                                        
143500 END DECLARATIVES.                                                            
300000/*****************************************************************            
300200*                                                                *            
300400*                                                                *            
300600*          MAIN-PGM    S E C T I O N                             *            
300800*                                                                *            
301000*                                                                *            
301200******************************************************************            
301400 MAIN-PGM  SECTION.                                                           
301600 00000000-MAIN-PARAGRAPH.                                                     
301800     PERFORM 10000000-VERIFICA-VERSIONES.                                     
302000                                                                              
302200     IF WKS-PROCESO-SIN-ERROR                                                 
302400        PERFORM 20000000-DISPLAY-INICIO                                       
302600        PERFORM 30000000-CHANGE-LIBRERIAS.                                    
302800                                                                              
303000     IF WKS-PROCESO-SIN-ERROR                                                 
303200        PERFORM 40000000-VALIDA-INICIO.                                       
303400                                                                              
303600     IF WKS-PROCESO-SIN-ERROR                                                 
303800        PERFORM 50000000-PROCESO-PGM.                                         
303820*INI EAS FASE 5                                                               
303830     IF WKS-PROCESO-SIN-ERROR                                                 
303840        IF WS-88-EJECUTA-P121  AND                                            
303850           (WS-ULT-ARCH-APLI(24) = WS-ULT-ARCH-APLI(04) OR                    
303855            WS-B02-DECOM-S111    = 1                   )                      
303860           PERFORM 50060000-EJECUTA-P121.                                     
303880*FIN EAS FASE 5                                                               
304000                                                                              
304200     MOVE "DISABLE PROGRAM S500P015"  TO WS-SOPCOM-COMANDO.                   
304400     CALL "SMCOMS OF SOPORTECOMS" USING  WS-SOPCOM-COMANDO                    
304600                                         WS-SOPCOM-TRABAJO                    
304800                                  GIVING WS-COMS-RESULT.                      
305000     MOVE 1 TO WS-END-OF-PROGRAM.                                             
305200     PERFORM 001120-ESPERA-RESPUESTA UNTIL                                    
305400                                     WS-END-OF-PROGRAM = 2.                   
305600                                                                              
305800     PERFORM 80000000-FIN-PGM.                                                
306000     STOP RUN.                                                                
306200                                                                              
306400                                                                              
310000******************************************************************            
310200*                                                                *            
310400*         10000000-VERIFICA-VERSIONES                            *            
310600*                                                                *            
310800******************************************************************            
311000 10000000-VERIFICA-VERSIONES.                                                 
311200     CHANGE ATTRIBUTE TITLE OF "DISP" TO                                      
311400            "(S000)S000/UTILITY/DESPLIEGA/OBJ/LIB ON PACK."                   
311600                                                                              
311800***** SE REQUIEREN DISPLAYS CON DEFAULT PARA ERRORES AL   *****               
312000***** INICIALIZAR COMS                                    *****               
312200     PERFORM 10002300-ASIGNA-VERSION-DEFLT.                                   
312400                                                                              
312600***** SE REQUIERE INICIALIZAR COMS PARA QUE SI EXISTE UN  *****               
312800***** ERROR EN VERSIONES AL DARLE AX NO, SE DE DISABLE AL *****               
313000***** PROGRAMA EN LUGAR DE TRONAR Y SE LEVANTE NUEVAMENTE *****               
313200     PERFORM 10001000-INICIALIZA-COMS.                                        
313400                                                                              
313600*****     SE ESTABLECE LIGA CON CTLVERS                   *****               
313800     PERFORM 10000100-VERSIONES.                                              
314000                                                                              
314200*****     SE VERIFICA Y ASIGNA VERSION DE P015 EN CTLVERS *****               
314400     PERFORM 10002000-P015-EN-CTLVERS.                                        
314600                                                                              
314800 10001000-INICIALIZA-COMS.                                                    
315000*****     SE ESTABLECE LIGA CON COMS                      *****               
315200     PERFORM 0000-CHANGE-SL-DCI-Y-SOPCOMS.                                    
315400                                                                              
315600*****     OBTIENE NOMBRE DEL PROGRAMA <S500P015>          *****               
315800     PERFORM 0000-CALL-COMS-PROGRAM.                                          
316000     IF WS-COMS-RESULT NOT = 0                                                
316200        MOVE "E"          TO WKS-TIPO-LJ                                      
316400        MOVE 020901       TO WKS-CODIGO-LJ                                    
316600        STRING "ERROR EN CALL SOPCOM (PROGRAM)"                               
316800               DELIMITED BY SIZE INTO TEXTO-LJ                                
317000        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
317200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
317400                                                                              
317600*****     OBTIENE NOAPL                                   *****               
317800     PERFORM 0000-CALL-COMS-NOAPL.                                            
318000     IF WS-COMS-RESULT NOT = 0                                                
318200        MOVE "E"          TO WKS-TIPO-LJ                                      
318400        MOVE 020901       TO WKS-CODIGO-LJ                                    
318600        STRING "ERROR EN CALL SOPCOM (NOAPL)"                                 
318800               DELIMITED BY SIZE INTO TEXTO-LJ                                
319000        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
319200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
319400                                                                              
319600*****     OBTIENE DESIGNADOR DE AGENDA <OUTPUT OF LINEA>  *****               
319800     PERFORM 0000-CALL-COMS-OUTPUT.                                           
320000     IF WS-COMS-RESULT NOT = 0                                                
320200        MOVE "E"          TO WKS-TIPO-LJ                                      
320400        MOVE 020901       TO WKS-CODIGO-LJ                                    
320600        STRING "ERROR EN CALL SOPCOM (OUTPUT OF LINEA)"                       
320800               DELIMITED BY SIZE INTO TEXTO-LJ                                
321000        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
321200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
321400                                                                              
321600*****     OBTIENE DESIGNADOR DE ESTACION <DEFAULTSTATION> *****               
321800     PERFORM 0000-CALL-COMS-STATION.                                          
322000     IF WS-COMS-RESULT NOT = 0                                                
322200        MOVE "E"          TO WKS-TIPO-LJ                                      
322400        MOVE 020901       TO WKS-CODIGO-LJ                                    
322600        STRING "ERROR EN CALL SOPCOM (DEFAULTSTATION)"                        
322800               DELIMITED BY SIZE INTO TEXTO-LJ                                
323000        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
323200        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                              
323400                                                                              
323600*****     OBTIENE DATOS DEL HOST                          *****               
323800     PERFORM 0000-CALL-CSIID-HOST.                                            
324000                                                                              
324200     IF WS-DH-HOSTNAME-PBA                                                    
324400        MOVE 1    TO WKS-MPD-PRUEBAS-VA.                                      
324600                                                                              
324800 10002000-P015-EN-CTLVERS.                                                    
325000     MOVE WKS-ID-P015             TO W77-S000-MY-ID.                          
325200                                                                              
325400     MOVE "26MTP005"              TO W77-S000-MY-VERSION.                     
325600                                                                              
325800     PERFORM 20000100-CHECAME-VERSION.                                        
326000     MOVE S000-CTR-CVEERROR       TO WKS-VERIFICA-VERSIONES.                  
326200                                                                              
326400     IF WKS-MPD-PRUEBAS                                                       
326600        DISPLAY "<MPD P015> RESULT DE VERSIONES : "                           
326800                WKS-VERIFICA-VERSIONES .                                      
327000                                                                              
327200     IF WKS-88-VERS-SIN-ERROR                                                 
327400        PERFORM 10002100-OBTIENE-TITPROG                                      
327600        PERFORM 10002200-ASIGNA-VERSION-TITULO                                
327800     ELSE IF WKS-88-VERS-ERR-SI-CONTINUO                                      
328000        IF S000-CTR-CVEERROR = 1                                              
328200           PERFORM 10002300-ASIGNA-VERSION-DEFLT                              
328400        ELSE                                                                  
328600           PERFORM 10002100-OBTIENE-TITPROG                                   
328800           PERFORM 10002200-ASIGNA-VERSION-TITULO                             
329000     ELSE                                                                     
329200        MOVE "E"          TO WKS-TIPO-LJ                                      
329400        MOVE 020801       TO WKS-CODIGO-LJ                                    
329600        STRING "ERROR DE VERSIONES Y SE DECIDE NO CONTINUAR"                  
329800               DELIMITED BY SIZE INTO TEXTO-LJ                                
330000        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
330200        MOVE 1            TO WKS-ERROR-PROCESO-VA.                            
330400                                                                              
330600 10002100-OBTIENE-TITPROG.                                                    
330800     MOVE WKS-ID-P015     TO S000-CTR-LIBID.                                  
331000     PERFORM 10000500-TITPROGCTLVERS.                                         
331200                                                                              
331400 10002200-ASIGNA-VERSION-TITULO.                                              
331600     MOVE S000-CTR-NOMLIB TO WKS-TITULO-PROG.                                 
331800     MOVE WKS-TP-SISTEMA  TO SISTEMA-LJ.                                      
332000     MOVE WKS-TP-PASO     TO PASO-LJ.                                         
332200     MOVE WKS-TP-MTP      TO MTP-LJ.                                          
332400                                                                              
332600 10002300-ASIGNA-VERSION-DEFLT.                                               
332800     MOVE "S500"          TO SISTEMA-LJ.                                      
333000     MOVE "P015"          TO PASO-LJ.                                         
333200      MOVE 005             TO MTP-LJ.                                         
333400                                                                              
340000******************************************************************            
340200*                                                                *            
340400*         20000000-DISPLAY-INICIO                                *            
340600*                                                                *            
340800******************************************************************            
341000 20000000-DISPLAY-INICIO.                                                     
341200     MOVE "E"             TO WKS-TIPO-LJ.                                     
341400     MOVE 020101          TO WKS-CODIGO-LJ.                                   
341600     STRING "INICIO DE PROCESO "                                              
341800            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
342000     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
342200                                                                              
345000******************************************************************            
345200*                                                                *            
345400*         30000000-CHANGE-LIBRERIAS                              *            
345600*                                                                *            
345800******************************************************************            
346000 30000000-CHANGE-LIBRERIAS.                                                   
346200*****     OBTIENE TITULO DE LIB S500L010CTRL              *****               
346400     PERFORM 10000500-L010.                                                   
346600                                                                              
346800*****     OBTIENE TITULO DE LIB S016L422                  *****               
347000     PERFORM 10000016-L422.                                                   
347200                                                                              
347400*****     OBTIENE TITULO DE LIB GENERALSUPPORT            *****               
347600     PERFORM 10000000-GENERALSUPPORT.                                         
347800                                                                              
347900*****     OBTIENE TITULO DE LIB S006LOCSUP                *****               
348000     PERFORM 10000006-LOCSUP.                                                 
348100                                                                              
348200*****     OBTIENE TITULO DE LIB S500L040LIGA              *****               
348300     PERFORM 10000500-L040LIGAS.                                              
348400                                                                              
350000******************************************************************            
350200*                                                                *            
350400*         40000000-VALIDA-INICIO                                 *            
350600*                                                                *            
350800******************************************************************            
351000 40000000-VALIDA-INICIO.                                                      
351200*    OBTIENE FECHA Y HORA DE LA MAQUINA.                                      
351400     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
351600                                                                              
351800     PERFORM 40010000-ASIGNA-TASKFILE.                                        
352000     PERFORM 40030000-ABRE-Y-VALIDA-BASE.                                     
352200                                                                              
352400     IF WKS-PROCESO-SIN-ERROR                                                 
352600        IF WKS-LG-SP-INICIADA                                                 
352800           MOVE 2         TO WKS-TIPO-DISPERSION                              
353000           MOVE "E"       TO WKS-TIPO-LJ                                      
353200           MOVE 020801    TO WKS-CODIGO-LJ                                    
353400           PERFORM 40020000-VALIDA-STA-LSDO                                   
353600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
353800        ELSE                                                                  
354000           MOVE 1         TO WKS-TIPO-DISPERSION                              
354200           MOVE "E"       TO WKS-TIPO-LJ                                      
354400           MOVE 020801    TO WKS-CODIGO-LJ                                    
354600           STRING "EN ESTA CORRIDA SE DISPERSAN LOS ARCHIVOS DEL "            
354800                  "S087, S152 Y TARJETAS CON UN ESTATUS DE : "                
355000                  WS-STA-DISP                                                 
355200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
355400           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
355600                                                                              
355800     IF WKS-PROCESO-SIN-ERROR AND WKS-DISPERSO-MOVTOS                         
356000*       ESTOS MENSAJES INFORMATIVOS A LA LOG ACERCA DE  LA  OBTEN-            
356200*       CION DEL CONTRATO SE GENERAN SOLO CUANDO SE DISPERSAN  LOS            
356400*       ARCHIVOS DEL S087, S152 Y TARJETAS, SU VALOR SE CONTROLA              
356600*       MEDIANTE EL HI 70 AL PASO P009 DE LA L010                             
356800        IF (WKS-EM-CTO-DE-TARJETAS) OR (WKS-EM-CTO-DE-TAR-S016)               
357000           IF WKS-EM-CTO-DE-TARJETAS                                          
357200              MOVE "E"            TO WKS-TIPO-LJ                              
357400              MOVE 020801         TO WKS-CODIGO-LJ                            
357600              STRING "LA DISPERSION SE HACE CON EL CONTRATO DE "              
357800                     "TARJETAS "                                              
358000                     DELIMITED BY SIZE INTO TEXTO-LJ                          
358200              PERFORM 00000000-LLAMA-DISPLAY-STRING                           
358400           ELSE                                                               
358600              MOVE "E"            TO WKS-TIPO-LJ                              
358800              MOVE 020801         TO WKS-CODIGO-LJ                            
359000              STRING "LA DISPERSION SE HACE CON EL CONTRATO "                 
359200                 "OBTENIDO DE CLIENTES Y EN CTOS. INEXISTENTES "              
359400                 "EN EL S016 SE ASIGNA EL CONTRATO DE TARJETAS "              
359600                 DELIMITED BY SIZE INTO TEXTO-LJ                              
359800              PERFORM 00000000-LLAMA-DISPLAY-STRING                           
360000        ELSE                                                                  
360200           MOVE "E"               TO WKS-TIPO-LJ                              
360400           MOVE 020801            TO WKS-CODIGO-LJ                            
360600           STRING "LA DISPERSION SE HACE CON EL CONTRATO "                    
360800                  "OBTENIDO DE CLIENTES "                                     
361000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
361200           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
361400                                                                              
361600 40010000-ASIGNA-TASKFILE.                                                    
361800*    CODIGO PARA ASIGNAR UN NOMBRE ESTANDAR AL TASKFILE EN CASO               
362000*    DE QUE TRUENE EL P015 POR CUALQUIER RAZON.                               
362200*    OBTIENE FECHA Y HORA DE LA MAQUINA EN FORMATO AAMD                       
362400*    PERFORM 20000000-CALL-GENERALSUPPORT.                                    
362600     MOVE WKS-FEC-MAQ-AAMD-AAAA          TO WKS-FEC-MAQ-MDA-AA.               
362800     MOVE WKS-FEC-MAQ-AAMD-MM            TO WKS-FEC-MAQ-MDA-MM.               
363000     MOVE WKS-FEC-MAQ-AAMD-DD            TO WKS-FEC-MAQ-MDA-DD.               
363200                                                                              
363400     MOVE WKS-FEC-MAQ-MDA                TO WKS-TASKFILE-FEC.                 
363600     SET  MYSELF(OPTION)                 TO 1926.                             
363800     MOVE ATTRIBUTE MIXNUMBER OF MYSELF  TO WKS-TASKFILE-MIX.                 
364000     SET  MYSELF(FILECARDS)              TO WKS-TASKFILE-NOMBRE.              
364200                                                                              
364400 40020000-VALIDA-STA-LSDO.                                                    
364600     IF WKS-STA-DISP-LSDO < 0 OR > 3                                          
364800        STRING "ERROR EN ESTA CORRIDA SE INTENTA DISPERSAR EL "               
365000               "ARCHIVO DE SALDOS PENDIENTES CON UN ESTATUS DE < "            
365200               WKS-STA-DISP-LSDO " > " WKS-TBL-STA-LG-SP( 5 )                 
365400               DELIMITED BY SIZE INTO TEXTO-LJ                                
365600        MOVE 3    TO WKS-ERROR-PROCESO-VA                                     
365800     ELSE                                                                     
366000        STRING "EN ESTA CORRIDA SE DISPERSA EL ARCHIVO DE "                   
366200               "SALDOS PENDIENTES CON UN ESTATUS DE : "                       
366400               WKS-TBL-STA-LG-SP(WKS-STA-DISP-LSDO + 1 )                      
366600               DELIMITED BY SIZE INTO TEXTO-LJ.                               
366800                                                                              
367000 40030000-ABRE-Y-VALIDA-BASE.                                                 
367200     PERFORM 09000000-ABRE-BD-UPDATE.                                         
367400                                                                              
367600     MOVE 1                       TO WKS-STATUS-BD-VA.                        
367800     PERFORM 09000000-B02CONTROL-FIND.                                        
368000                                                                              
368010*    20110705 PARA TENER UNA MANERA FACIL DE REGRESARSE EN LA                 
368020*    MANERA DE OPERAR LOS POSTEOS SE IMPLEMENTO EL HI XXX EN LA               
368030*    L010 QUE INCREMENTA EN 2 LOS VALORES DE B02-ELI-MEDACC                   
368040     IF B02-ELI-MEDACC > 2                                                    
368050*       NO UTILIZA LOS TIPOS DE AUTORIZACION - ARCH TBINTER                   
368060        MOVE 0                    TO WKS-USA-TIPO-AUT-VA                      
368070        COMPUTE WKS-ELI-MEDACC = B02-ELI-MEDACC - 2                           
368080     ELSE                                                                     
368090*       SI UTILIZA LOS TIPOS DE AUTORIZACION - ARCH TBINTER                   
368100        MOVE 1                    TO WKS-USA-TIPO-AUT-VA                      
368110        MOVE B02-ELI-MEDACC       TO WKS-ELI-MEDACC.                          
368120                                                                              
368200*    MOVE B02-TIPO-PROCESO        TO WS-TIPO-PROCESO.                         
368400     MOVE B02-STA-DISP            TO WS-STA-DISP.                             
368600     MOVE B02-FECHA-LINEA         TO WS-FECHA-LIN.                            
368800     MOVE B02-NUM-CSI             TO WS-NODO.                                 
369000     MOVE B02-TC-TCAMBIO          TO WS-TC-TCAMBIO.                           
369200     MOVE B02-ARCH-DISP           TO WS-CTR-ARCDISP.                          
369400*    MOVE B02-ELI-MEDACC          TO WKS-ELI-MEDACC.                          
369600     MOVE B02-LIBERA-SDOPEN       TO WKS-LIBGLOBAL-SDOPEND.                   
369800     MOVE B02-STA-DISP-LSDO       TO WKS-STA-DISP-LSDO.                       
370000     MOVE B02-ULT-ARCH-APLI(1)    TO WS-ULT-ARCH-APLI(1).                     
370200     MOVE B02-ULT-ARCH-APLI(2)    TO WS-ULT-ARCH-APLI(2).                     
370400     MOVE B02-ULT-ARCH-APLI(3)    TO WS-ULT-ARCH-APLI(3).                     
370600     MOVE B02-ULT-ARCH-APLI(4)    TO WS-ULT-ARCH-APLI(4).                     
370800     MOVE B02-ULT-ARCH-APLI(5)    TO WS-ULT-ARCH-APLI(5).                     
371000     MOVE B02-ULT-ARCH-APLI(6)    TO WS-ULT-ARCH-APLI(6).                     
371200     MOVE B02-ULT-ARCH-APLI(7)    TO WS-ULT-ARCH-APLI(7).                     
371400     MOVE B02-ULT-ARCH-APLI(8)    TO WS-ULT-ARCH-APLI(8).                     
371600     MOVE B02-ULT-ARCH-APLI(9)    TO WS-ULT-ARCH-APLI(9).                     
371800     MOVE B02-ULT-ARCH-APLI(10)   TO WS-ULT-ARCH-APLI(10).                    
371802*INI EAS      FASE 5                                                          
371804     MOVE B02-ULT-ARCH-APLI(21)   TO WS-ULT-ARCH-APLI(21).                    
371810     MOVE B02-ULT-ARCH-APLI(22)   TO WS-ULT-ARCH-APLI(22).                    
371816     MOVE B02-ULT-ARCH-APLI(23)   TO WS-ULT-ARCH-APLI(23).                    
371822     MOVE B02-ULT-ARCH-APLI(24)   TO WS-ULT-ARCH-APLI(24).                    
371828*FIN EAS FASE 5                                                               
371829     MOVE B02-USO-FUTURO-05       TO WS-B02-DECOM-S111.                       
371830     MOVE WS-ULT-ARCH-APLI(2)     TO WS-FECHA-S111-HUB.                       
371840     MOVE 1                       TO WKS-STATUS-BD-VA.                        
371860     PERFORM 90000000-B00CTRLPASO-FIND.                                       
371880                                                                              
371900     MOVE B00-TIPO-PROCESO        TO WS-TIPO-PROCESO.                         
372000                                                                              
372020     MOVE WKS-FEC-MAQ-AAMD        TO WS-FECHA1.                               
372040     MOVE 1                       TO WS-FECHA2.                               
372060     MOVE 10                      TO WS-FUNCION.                              
372080     MOVE 13                      TO WS-FORMATO.                              
372100     PERFORM 50031700-CALENDAR.                                               
372120     MOVE WS-FECHA1               TO WS-FECHA-TAR-ANT                         
372140                                     WS-FECHA-TARSEM-ANT.                     
372160                                                                              
372200     IF WKS-MPD-PRUEBAS                                                       
372400        DISPLAY "<MPD P015> TIPO-PROCESO  " WS-TIPO-PROCESO                   
372600        DISPLAY "<MPD P015> STA-DISP      " WS-STA-DISP                       
372800        DISPLAY "<MPD P015> FECHA-LINEA   " WS-FECHA-LIN                      
372850        DISPLAY "<MPD P015> FECHA-HOY     " WKS-FEC-MAQ-AAMD                  
372900        DISPLAY "<MPD P015> FECHA-AYER    " WS-FECHA-TAR-ANT                  
373000        DISPLAY "<MPD P015> NUM-CSI       " WS-NODO                           
373200        DISPLAY "<MPD P015> TC-TCAMBIO    " WS-TC-TCAMBIO                     
373400        DISPLAY "<MPD P015> ARCH-DISP     " WS-CTR-ARCDISP                    
373600        DISPLAY "<MPD P015> ELI-MEDACC    " WKS-ELI-MEDACC                    
373800        DISPLAY "<MPD P015> LIBERA-SDOPEN " WKS-LIBGLOBAL-SDOPEND             
374000        DISPLAY "<MPD P015> STA-DISP-LSDO " WKS-STA-DISP-LSDO                 
374200        DISPLAY "<MPD P015> ARCH-APLI(1)  " WS-ULT-ARCH-APLI(1)               
374400        DISPLAY "<MPD P015> ARCH-APLI(2)  " WS-ULT-ARCH-APLI(2)               
374600        DISPLAY "<MPD P015> ARCH-APLI(3)  " WS-ULT-ARCH-APLI(3)               
374800        DISPLAY "<MPD P015> ARCH-APLI(4)  " WS-ULT-ARCH-APLI(4)               
375000        DISPLAY "<MPD P015> ARCH-APLI(5)  " WS-ULT-ARCH-APLI(5)               
375200        DISPLAY "<MPD P015> ARCH-APLI(6)  " WS-ULT-ARCH-APLI(6)               
375400        DISPLAY "<MPD P015> ARCH-APLI(7)  " WS-ULT-ARCH-APLI(7)               
375600        DISPLAY "<MPD P015> ARCH-APLI(8)  " WS-ULT-ARCH-APLI(8)               
375800        DISPLAY "<MPD P015> ARCH-APLI(9)  " WS-ULT-ARCH-APLI(9)               
376000        DISPLAY "<MPD P015> ARCH-APLI(10) " WS-ULT-ARCH-APLI(10)              
376005        DISPLAY "<MPD P015> ARCH-APLI(21) " WS-ULT-ARCH-APLI(21)              
376010        DISPLAY "<MPD P015> ARCH-APLI(22) " WS-ULT-ARCH-APLI(22)              
376015        DISPLAY "<MPD P015> ARCH-APLI(23) " WS-ULT-ARCH-APLI(23)              
376020        DISPLAY "<MPD P015> ARCH-APLI(24) " WS-ULT-ARCH-APLI(24).             
376200                                                                              
376400     IF NOT WS-TP-LINEA                                                       
376600        MOVE "I"                  TO WKS-TIPO-LJ                              
376800        MOVE 050110               TO WKS-CODIGO-LJ                            
377000        STRING "NO PUEDO DISPERSAR.. SE ESTA CORRIENDO ",                     
377200               "BATCH DEL S500, FAVOR DE REINTENTAR CUANDO ",                 
377400               "TERMINE PROCESO BATCH"                                        
377600               DELIMITED BY SIZE INTO TEXTO-LJ                                
377800        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
378000        MOVE 2                    TO WKS-ERROR-PROCESO-VA.                    
378200                                                                              
378300*INI-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
378400     PERFORM 50031750-VERIFICO-DIA-HABIL.                                     
378500*FIN-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
400000******************************************************************            
400200*                                                                *            
400400*         50000000-PROCESO-PGM                                   *            
400600*                                                                *            
400800******************************************************************            
401000 50000000-PROCESO-PGM.                                                        
401200     PERFORM 50010000-INI-O-REINI-DISPER.                                     
401400                                                                              
401600     IF WKS-PROCESO-SIN-ERROR                                                 
401800        PERFORM 50020000-PERMITIR-HIS.                                        
402000                                                                              
402200     IF WKS-PROCESO-SIN-ERROR                                                 
402400        IF WKS-NUEVO-ORDENADO                                                 
402600*          ESTA CONDICION SE CUMPLE CUANDO EL ARCHIVO  ORDENADO-CM            
402800*          O EL ORDENADO-SP SE GENERAN DESDE CERO Y  ES  NECESARIO            
403000*          METERLES LOS ARCHIVOS QUE SE VAN A DISPERSAR  Y  ADEMAS            
403200*          PEDIR AUTORIZACION A LA L010 Y ORDENAR EL ARCHIVO.                 
403400           PERFORM 50030000-GENERA-ORDENADO.                                  
403600                                                                              
403800     IF WKS-PROCESO-SIN-ERROR                                                 
404000        IF WKS-HAY-ORDENADO-A-DISPERSAR                                       
404200*          ESTA CONDICION SE CUMPLE CUANDO EL ARCHIVO  ORDENADO-CM            
404400*          O EL ORDENADO-SP ESTAN GENERADOS Y LISTOS PARA  DISPER-            
404600*          SARSE.(SE DA EN DOS SITUACIONES, EN UN REINICIO, CUANDO            
404800*          SE SUSPENDE UNA DISPERSION Y LUEGO SE LANZA  NUEVAMENTE            
405000*          EL P015 Y CUANDO SE LOGRA METER ALGUN ARCHIVO A DISPER-            
405200*          SAR, SE LE PONE AUTORIZACION Y SE ORDENA )                         
405400           PERFORM 50050000-DISPERSA-ORDENADO.                                
405600                                                                              
405800                                                                              
410000**********************************************************                    
410200*         50010000-INI-O-REINI-DISPER                    *                    
410400**********************************************************                    
410600 50010000-INI-O-REINI-DISPER.                                                 
410800     IF WKS-DISPERSO-MOVTOS                                                   
411000        IF WS-STA-DISP = 2                                                    
411200*          EL ARCHIVO ORDENADO-CM ESTA PENDIENTE POR DISPERSAR                
411400           MOVE 1                 TO WKS-EXISTE-ORD-X-DISPER                  
411500           MOVE 1                 TO WKS-HAY-ARCH-ORDCM                       
411600           PERFORM 50012000-DISPER-CM-DESDE-ARCH                              
411800        ELSE                                                                  
412000*          EL ARCHIVO ORDENADO-CM NO HA SIDO CREADO, SE DEBE CREAR            
412200           MOVE 1                 TO WKS-NUEVO-ORDENADO-VA                    
412400           PERFORM 50011000-DISPER-CM-DESDE-CERO                              
412600     ELSE                                                                     
412800        IF WKS-STA-DISP-LSDO = 2                                              
413000*          EL ARCHIVO ORDENADO-SP ESTA PENDIENTE POR DISPERSAR                
413200           MOVE 2                 TO WKS-EXISTE-ORD-X-DISPER                  
413400           PERFORM 50014000-DISPER-SP-DESDE-ARCH                              
413600        ELSE                                                                  
413800*          EL ARCHIVO ORDENADO-SP NO HA SIDO CREADO, SE DEBE CREAR            
414000           MOVE 2                 TO WKS-NUEVO-ORDENADO-VA                    
414200           PERFORM 50013000-DISPER-SP-DESDE-CERO.                             
414205                                                                              
414210     IF WKS-PROCESO-SIN-ERROR                                                 
414215        MOVE WS-NODO             TO W-ETIQ-CTRL-CSIO                          
414220        MOVE WS-FECHA-LIN        TO W-ETIQ-CTRL-FECHA                         
414225        CHANGE ATTRIBUTE TITLE OF CTRLARCH TO W-ETIQ-CTRLARCH                 
414230        IF ATTRIBUTE RESIDENT OF CTRLARCH IS = VALUE TRUE                     
414235           OPEN EXTEND CTRLARCH                                               
414240        ELSE                                                                  
414245           OPEN OUTPUT CTRLARCH                                               
414250           MOVE SPACES           TO REG-CTRL                                  
414255           MOVE 1                TO WS-LLAVE-CTRL                             
414260                                    REG-CTRL-TR                               
414265           MOVE "S500"           TO REG-CTRL-SISTEMA                          
414270           MOVE "P104"           TO REG-CTRL-PASO-DESTINO                     
414275           MOVE WS-FECHA-LIN     TO REG-CTRL-FECHA                            
414280           MOVE WS-NODO          TO REG-CTRL-CSI                              
414285           WRITE REG-CTRL INVALID KEY                                         
414290                 MOVE "E"               TO WKS-TIPO-LJ                        
414295                 MOVE 050110            TO WKS-CODIGO-LJ                      
414300                 STRING "INVALID KEY AL GRABAR REGISTRO HEADER "              
414305                        "DEL CTRLARCH, VALOR DE LA LLAVE = "                  
414310                        WS-LLAVE-CTRL                                         
414315                        DELIMITED BY SIZE INTO TEXTO-LJ                       
414320                  PERFORM 00000000-LLAMA-DISPLAY-STRING                       
414325                  MOVE 14         TO WKS-ERROR-PROCESO-VA.                    
414330     MOVE SPACES                  TO REG-CTRL.                                
414335     IF WKS-PROCESO-SIN-ERROR                                                 
414340        CLOSE CTRLARCH WITH SAVE                                              
414345        OPEN EXTEND CTRLARCH                                                  
414350        MOVE ATTRIBUTE LASTRECORD OF CTRLARCH TO WS-LLAVE-CTRL                
414355        ADD 1                     TO WS-LLAVE-CTRL                            
414360     ELSE                                                                     
414365        IF WKS-ERROR-PROCESO-VA = 14                                          
414370           MOVE 0                 TO WKS-ERROR-PROCESO-VA                     
414375           CLOSE CTRLARCH WITH PURGE.                                         
414400                                                                              
414600 50011000-DISPER-CM-DESDE-CERO.                                               
414800     MOVE WS-FECHA-LIN            TO W-ETIQ-ORD-FECHA.                        
415000     MOVE WS-NODO                 TO W-ETIQ-ORD-CSIO                          
415200                                     W-ETIQ-ORD-CSID.                         
415400     MOVE WS-CTR-ADSEQ            TO W-ETIQ-ORD-SEQ.                          
415600     ADD  1                       TO W-ETIQ-ORD-SEQ.                          
415800     MOVE W-ETIQ-ORD-SEQ          TO WS-HORA-SEQ.                             
416000     MOVE WS-ULT-ARCH-APLI(2)     TO WS-ULTFECHA-TAR.                         
416200     MOVE WS-ULT-ARCH-APLI(3)     TO WS-ULTFECHA-87.                          
416400     MOVE WS-ULT-ARCH-APLI(4)     TO WS-ULTFECHA-TARSEM.                      
416600     MOVE WS-ULT-ARCH-APLI(6)     TO WS-ULTFECHA-152.                         
416602*INI EAS FASE 5                                                               
416604     MOVE WS-ULT-ARCH-APLI(23)    TO WS-ULTFECHA-EAS.                         
416606     MOVE WS-ULT-ARCH-APLI(24)    TO WS-ULTFECHA-EASSEM.                      
416608*FIN EAS FASE 5                                                               
416800                                                                              
417000     SET ORDENADO-CM (TITLE)      TO W-ETIQ-ORDENADO.                         
417200                                                                              
417400     OPEN OUTPUT ORDENADO-CM.                                                 
417600     MOVE 1                       TO WS-LLAVE-ORDCM.                          
417800     MOVE "1"                     TO REG-ORDENADO-TR.                         
418000     MOVE ZEROS                   TO REG-ORDENADO-HEADER.                     
418200     MOVE WS-HRA-SEQ              TO REG-ORDENADO-HORA.                       
418400     MOVE WS-FECHA-LIN            TO REG-ORDENADO-FECHA.                      
418600     MOVE WS-NODO                 TO REG-ORDENADO-NODO.                       
418800     MOVE WS-ULTFECHA-87          TO REG-ORDENADO-1ERF-87.                    
419000     MOVE WS-ULTFECHA-152         TO REG-ORDENADO-1ERF-PE.                    
419200     MOVE WS-ULTFECHA-TAR         TO REG-ORDENADO-1ERF-TAR.                   
419400     MOVE WS-ULTFECHA-TARSEM      TO REG-ORDENADO-1ERF-TARSEM.                
419405*INI EAS FASE 5                                                               
419410     MOVE WS-ULTFECHA-EAS         TO REG-ORDENADO-1ERF-EAS.                   
419415     MOVE WS-ULTFECHA-EASSEM      TO REG-ORDENADO-1ERF-EASSEM.                
419420*FIN EAS FASE 5                                                               
419600     WRITE REG-ORDENADO INVALID KEY                                           
419800           MOVE "E"               TO WKS-TIPO-LJ                              
420000           MOVE 050110            TO WKS-CODIGO-LJ                            
420200           STRING "INVALID KEY AL GRABAR REGISTRO HEADER DEL "                
420400                  "ORDENADO-CM, VALOR DE LA LLAVE = "                         
420600                  WS-LLAVE-ORDCM                                              
420800                  DELIMITED BY SIZE INTO TEXTO-LJ                             
421000           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
421200           MOVE 12                TO WKS-ERROR-PROCESO-VA.                    
421400     MOVE LOW-VALUES              TO REG-ORDENADO.                            
421600                                                                              
421800 50012000-DISPER-CM-DESDE-ARCH.                                               
422000     MOVE WS-CTR-ADFECHA          TO W-ETIQ-ORD-FECHA.                        
422200     MOVE WS-NODO                 TO W-ETIQ-ORD-CSIO                          
422400                                     W-ETIQ-ORD-CSID.                         
422600     MOVE WS-CTR-ADSEQ            TO W-ETIQ-ORD-SEQ.                          
422800                                                                              
423000     SET  ORDENADO-CM (TITLE)     TO W-ETIQ-ORDENADO.                         
423200                                                                              
423400 50013000-DISPER-SP-DESDE-CERO.                                               
423600     MOVE WS-FECHA-LIN            TO W-ETIQ-ORD-SP-FECHA.                     
423800     MOVE WS-NODO                 TO W-ETIQ-ORD-SP-CSIO                       
424000                                     W-ETIQ-ORD-SP-CSID.                      
424200                                                                              
424400     SET ORDENADO-CM (TITLE)      TO W-ETIQ-ORDENADO-SP.                      
424600                                                                              
424800     OPEN OUTPUT ORDENADO-CM.                                                 
425000     MOVE 1                       TO WS-LLAVE-ORDCM.                          
425200     MOVE "1"                     TO REG-ORDENADO-TR.                         
425400     MOVE ZEROS                   TO REG-ORDENADO-HEADER.                     
425600     MOVE WKS-HRA-MAQ-HM          TO REG-ORDENADO-HORA.                       
425800     MOVE WS-FECHA-LIN            TO REG-ORDENADO-FECHA.                      
426000     MOVE WS-NODO                 TO REG-ORDENADO-NODO.                       
426200     WRITE REG-ORDENADO INVALID KEY                                           
426400           MOVE "E"               TO WKS-TIPO-LJ                              
426600           MOVE 050110            TO WKS-CODIGO-LJ                            
426800           STRING "INVALID KEY AL GRABAR REGISTRO HEADER DEL "                
427000                  "ORDENADO SP, VALOR DE LA LLAVE = "                         
427200                  WS-LLAVE-ORDCM                                              
427400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
427600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
427800           MOVE 13                TO WKS-ERROR-PROCESO-VA.                    
428000     MOVE LOW-VALUES              TO REG-ORDENADO.                            
428200                                                                              
428400 50014000-DISPER-SP-DESDE-ARCH.                                               
428600     MOVE WS-FECHA-LIN            TO W-ETIQ-ORD-SP-FECHA.                     
428800     MOVE WS-NODO                 TO W-ETIQ-ORD-SP-CSIO                       
429000                                     W-ETIQ-ORD-SP-CSID.                      
429200                                                                              
429400     SET ORDENADO-CM (TITLE)      TO W-ETIQ-ORDENADO-SP.                      
429600                                                                              
429800                                                                              
435000**********************************************************                    
435200*         50020000-PERMITIR-HIS                          *                    
435400**********************************************************                    
435600 50020000-PERMITIR-HIS.                                                       
435800     ATTACH INTERRUPT-SECCION TO ATTRIBUTE EXCEPTIONEVENT                     
436000                                           OF MYSELF.                         
436200     ALLOW INTERRUPT.                                                         
436400                                                                              
440000**********************************************************                    
440200*         50030000-GENERA-ORDENADO                       *                    
440400**********************************************************                    
440600 50030000-GENERA-ORDENADO.                                                    
440800     IF WKS-NUEVO-ORD-CM                                                      
441000        PERFORM 50031000-METE-ARCHS-MOVTOS                                    
441200     ELSE                                                                     
441400        PERFORM 50040000-METE-ARCHS-SDOPEND.                                  
441600                                                                              
445000**********************************                                            
445200 50031000-METE-ARCHS-MOVTOS.                                                  
445400**********************************                                            
445600     PERFORM 50031100-INI-METEARCHS-ORDCM.                                    
445800                                                                              
446000     PERFORM 50032000-PROCESO-ARCHS-S087.                                     
446050*INI-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
446100     IF WS-DISPERSACPE = 1                                                    
446150*FIN-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
446200     PERFORM 50033000-PROCESO-ARCHS-S152.                                     
446400     PERFORM 50031500-INICIO-BACKUP.                                          
446600     PERFORM 50034000-PROCESO-TARJETASEM.                                     
446800     PERFORM 50035000-PROCESO-TARJETA.                                        
447000     PERFORM 50031600-TERMINO-BACKUP.                                         
447200                                                                              
447400     IF WKS-HAY-ORD-CM-A-DISPERSAR                                            
447600        PERFORM 50031200-SORT-ORDENADOCM                                      
447800        PERFORM 50031300-FIN-METEARCHS-ORDCM                                  
447900        MOVE 1            TO WKS-HAY-ARCH-ORDCM                               
448000     ELSE                                                                     
448200        PERFORM 50031400-NO-HUBO-ORDCM.                                       
448400                                                                              
448600 50031100-INI-METEARCHS-ORDCM.                                                
448800     MOVE "E"             TO WKS-TIPO-LJ.                                     
449000     MOVE 020801          TO WKS-CODIGO-LJ.                                   
449200     STRING "SE MARCA LA BD COMO QUE INICIA A METERSE ARCHIVOS "              
449400            " AL ORDENADO CM"                                                 
449600            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
449800     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
450000                                                                              
450200     PERFORM 09000000-B02CONTROL-LOCK.                                        
450400     MOVE 1               TO B02-STA-DISP.                                    
450600     PERFORM 09000000-BEGIN-TRANSACTION.                                      
450800     PERFORM 09000000-B02CONTROL-STORE.                                       
451000     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
451200                                                                              
451400 50031200-SORT-ORDENADOCM.                                                    
451600     MOVE "E"             TO WKS-TIPO-LJ.                                     
451800     MOVE 020801          TO WKS-CODIGO-LJ.                                   
452000     STRING "INICIA SORT DE ARCHIVO ORDCM " W-ETIQ-ORD-FECHA                  
452200            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
452400     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
452600                                                                              
452800     MOVE 1                       TO WS-ARCH-STATUS.                          
453000     MOVE W-ETIQ-ORD-FECHA        TO WKS-FEC-CONV-AAMD.                       
453200     PERFORM 00000000-CONV-FEC-AMD-DE-6-A-8.                                  
453400     MOVE WKS-FEC-CONV-AAMD       TO WS-CTR-ADFECHA.                          
453600     MOVE W-ETIQ-ORD-SEQ          TO WS-CTR-ADSEQ.                            
453800     PERFORM 50036000-SORTEA-ORDENADO-CM.                                     
454000                                                                              
454200     MOVE "E"             TO WKS-TIPO-LJ.                                     
454400     MOVE 020801          TO WKS-CODIGO-LJ.                                   
454600     STRING "TERMINA SORT DE ARCHIVO ORDCM " W-ETIQ-ORD-FECHA                 
454800            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
455000     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
455200                                                                              
455400 50031300-FIN-METEARCHS-ORDCM.                                                
455600     PERFORM 09000000-B02CONTROL-LOCK.                                        
455800     MOVE 2                       TO B02-STA-DISP.                            
456000     MOVE WS-CTR-ARCDISP          TO B02-ARCH-DISP.                           
456200*        SE GUARDAN EN LA BASE  LOS  ULTIMOS  ARCHIVOS  APLICADOS,            
456400*        AQUI EN EL P015 Y EN EL P010 CUANDO LE LLEGA  EL  MENSAJE            
456600*        CON CLAVE 10, ESTO PORQUE SE APLICO DOBLE UN ARCHIVO,  SE            
456800*        PUDO DAR CUANDO EL P015 ENVIO EL MSG CON CVE 10 AL P010 Y            
457000*        ESTABA DETENIDO EL P010, DIERON DISABLE AL P010  Y  PURGA            
457200*        RON LA COLA DE MENSAJES Y LEVANTARON NUEVAMENTE EL  P010,            
457400*        EL P015 ENVIO LUEGO LOS RECHAZOS Y TERMINO OK. PERO NUNCA            
457600*        EL P010 ACTUALIZO EN LA BASE LOS ULTIMOS ARCHIVOS  DISPER            
457800*        SADOS.                                                               
458000*        EL ACTUALIZAR LA BASE EN EL P015 EVITA QUE SE PUEDAN APLI            
458200*        CAR LOS ARCHIVOS DOS VECES, PERO SI SE PIERDE EL  MSG  AL            
458400*        P010 CON CVE 10, EL PROBLEMA SE PRESENTARIA SOLO EN  CASO            
458600*        DE UNA RECUPERACION TOTAL CON LA LOG, PORQUE NO QUEDA GRA            
458800*        BADO EN LA LOG EL MSG CON CVE 10, PERO SI SE RECUPERA POR            
459000*        AUDITS Y LUEGO PARCIALMENTE CON LA LOG NO HAY PROBLEMA.              
459200     MOVE WS-ULT-ARCH-APLI(1)     TO B02-ULT-ARCH-APLI(1)                     
459400     MOVE WS-ULT-ARCH-APLI(2)     TO B02-ULT-ARCH-APLI(2)                     
459600     MOVE WS-ULT-ARCH-APLI(3)     TO B02-ULT-ARCH-APLI(3)                     
459650     MOVE ZEROS                   TO WS-ULT-ARCH-APLI4-S111,                  
459700                                     WS-ULT-ARCH-APLI24-EAS                   
459800***  MOVE WS-ULT-ARCH-APLI(4)     TO B02-ULT-ARCH-APLI(4)                     
459900     MOVE WS-ULT-ARCH-APLI(4)     TO WS-ULT-ARCH-APLI4-S111                   
460000     MOVE WS-ULT-ARCH-APLI(5)     TO B02-ULT-ARCH-APLI(5)                     
460200     MOVE WS-ULT-ARCH-APLI(6)     TO B02-ULT-ARCH-APLI(6)                     
460205*INI EAS FASE 5                                                               
460210     MOVE WS-ULT-ARCH-APLI(23)    TO B02-ULT-ARCH-APLI(23)                    
460215***  MOVE WS-ULT-ARCH-APLI(24)    TO B02-ULT-ARCH-APLI(24)                    
460217     MOVE WS-ULT-ARCH-APLI(24)    TO WS-ULT-ARCH-APLI24-EAS                   
460220*FIN EAS FASE 5                                                               
460400*        SE CAMBIA DE LUGAR LA ACTUALIZACION DE ARCHIVOS, YA NO               
460600*        SE REALIZA CUANDO SE LE PONE UN 3 AL STA-DISP SINO CUANDO            
460800*        SE LE PONE UN 2. LO ANTERIOR PORQUE SE DUPLICARON NUEVA-             
461000*        MENTE LOS ARCHIVOS, SE DABA DE LA SIGUIENTE FORMA, UNA               
461200*        DISPERSION QUEDABA INCONCLUSA POR ALGUNA RAZON ( 2 CASOS             
461400*        PORQUE EL S408 CAMBIA DE PROCESO MIENTRAS ESTABAMOS DIS-             
461600*        PERSANDO Y SE DA DE BAJA EL P015 EN FORMA ANORMAL) Y EN              
461800*        LA SIGUIENTE DISPERSION AUN CUANDO EL REG. TIPO 5 SE                 
462000*        ACTUALIZABA BIEN EN EL P010, DESPUES EL P015 AL GRABAR EL            
462200*        3 EN STA-DISP, ACTUALIZABA LOS ARCHIVOS, PERO ERAN LOS               
462400*        QUE ESTABAN EN LA BD ANTES DE METERLOS AL ORDENADO-CM                
462600*        QUE QUEDO PENDIENTE LO QUE CAUSABA QUE UNA SIGUIENTE                 
462800*        DISPERSION, TOMARA LOS ARCHIVOS YA DISPERSADOS.                      
463000*        AGOSTO DEL 2001                                                      
463200*        SE GUARDARA EN B02-ULT-ARCH-APLI(20) LA ULTIMA  AUTORIZA-            
463400*        CION QUE SE OBTUVO AL ORDENAR EL ARCHIVO ORDENADO-CM,  LO            
463600*        ANTERIOR PORQUE EL P010 RECHAZABA MOVIMIENTOS POR  DUPLI-            
463800*        CATES Y EL P015 LOS DABA POR BUENOS. ESTO SE DABA  DE  LA            
464000*        SIGUIENTE FORMA : EN UN MISMO DIA CONTABLE ( GENERALMENTE            
464200*        FIN DE SEMANA) HABIA VARIAS DISPERSIONES, Y COMO EN  CADA            
464400*        UNA PARA GENERAR ORDENADO-CM SE PIDE  AUTORIZACION  A  LA            
464600*        L010, ESTA DABA AUTORIZACIONES DUPLICADAS PORQUE LA DABAN            
464800*        DE BAJA ENTRE DISPERSIONES. LOA ANTERIOR PORQUE NO SE ES-            
465000*        TABA GUARDANDO ESTAS AUTORIZACIONES EN NINGUN LADO.Y COMO            
465200*        LA LLAVE DE B07 ES SUC-CAJ-AUT Y CONTRATO LLEGO A COINCI-            
465400*        DIR, AHORA EL P015 VA A GUARDAR LA ULTIMA AUTORIZACION  Y            
465600*        LA L010 AL LEVANTARSE LO TOMARA EN CUANTA PARA COMENZAR A            
465800*        GENERAR AUTORIZACIONES. NO SE TOMAN EN  CUENTA  LAS  AUTS            
466000*        QUE SE DAN PARA LOS REGISTROS DE RECHAZOS,  PERO  ES  MUY            
466200*        POCO PROBABLE PORQUE COMO SE PIDEN DESPUES DE LOS  MOVTOS            
466400*        Y SON POCAS, QUEDAN EN OTROS MOVTOS DE TERMINAL O EN  LOS            
466600*        PRIMEROS DEL ORDENADO-CM Y NO SON EL MISMO SUC-CAJ Y CTO.            
466800     MOVE WS-CTR-CONTNAUT         TO B02-ULT-ARCH-APLI(20).                   
467000     MOVE WS-CTR-CONTNAUT         TO B02-AUT-L010.                            
467200     PERFORM 09000000-BEGIN-TRANSACTION.                                      
467400     PERFORM 09000000-B02CONTROL-STORE.                                       
467600     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
467800                                                                              
468000     MOVE "E"             TO WKS-TIPO-LJ.                                     
468200     MOVE 020801          TO WKS-CODIGO-LJ.                                   
468400     STRING "SE MARCO LA BD COMO QUE TERMINA DE METER ARCHIVOS "              
468600            "AL ORDENADO-CM Y SE ACTUALIZAN LOS ULTIMOS ARCHIVOS "            
468800            "DISPERSADOS EN LA BASE DE DATOS "                                
469000            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
469200     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
469400                                                                              
469600 50031400-NO-HUBO-ORDCM.                                                      
469800     PERFORM 09000000-B02CONTROL-LOCK.                                        
470000     MOVE WS-STA-DISP     TO B02-STA-DISP.                                    
470200     PERFORM 09000000-BEGIN-TRANSACTION.                                      
470400     PERFORM 09000000-B02CONTROL-STORE.                                       
470600     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
470800     CLOSE ORDENADO-CM WITH PURGE.                                            
470900     MOVE 0               TO WKS-HAY-ARCH-ORDCM.                              
471000                                                                              
471200     MOVE "E"             TO WKS-TIPO-LJ.                                     
471400     MOVE 020801          TO WKS-CODIGO-LJ.                                   
471600     STRING "NO HUBO ARCHIVO A DISPERSAR Y "                                  
471800            " EL ARCHIVO ORDENADO-CM SE PURGA "                               
472000            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
472200     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
472400                                                                              
475000 50031500-INICIO-BACKUP.                                                      
475200     SET  R-TARJETAS (USERBACKUPNAME) TO VALUE TRUE.                          
475400     MOVE ATTRIBUTE STACKNO OF MYSELF TO CARAT-MIX.                           
475600     MOVE WS-NODO                     TO CARAT-CSI.                           
475800     MOVE WS-FECHA-LIN                TO CARAT-FECHA.                         
476000     MOVE W-ETIQ-ORD-SEQ              TO CARAT-MNEMOSEC.                      
476200     OPEN OUTPUT R-TARJETAS.                                                  
476400*    PONE FECHA DE LA LINEA A FECHA DE OPERACION EN EL ENCA-2                 
476600     MOVE W-ETIQ-ORD-SEQ              TO WKS-E2-SEQ.                          
476800     MOVE WS-FEC-LIN-DD               TO WKS-OPE-DD.                          
477000     MOVE WS-FEC-LIN-MM               TO WKS-OPE-MM.                          
477200     MOVE WS-FEC-LIN-AAAA             TO WKS-OPE-AA.                          
477400*    PONE FEC Y HRA DE LA MAQ A FEC Y HRA DE PROCESO EN EL ENCA-3             
477600     MOVE WKS-FEC-MAQ-AAMD-DD         TO WKS-PRO-DD.                          
477800     MOVE WKS-FEC-MAQ-AAMD-MM         TO WKS-PRO-MM.                          
478000     MOVE WKS-FEC-MAQ-AAMD-AAAA       TO WKS-PRO-AA.                          
478200     MOVE WKS-HRA-MAQ-HH              TO WKS-PRO-HH.                          
478400     MOVE WKS-HRA-MAQ-MM              TO WKS-PRO-MI.                          
478600     MOVE WKS-HRA-MAQ-SS              TO WKS-PRO-SS.                          
478800                                                                              
479000     MOVE 0                           TO WKS-HUBO-REGS-VA.                    
479200                                                                              
479400 50031600-TERMINO-BACKUP.                                                     
479600     IF WKS-HUBO-REGS-VA = 0                                                  
479800        PERFORM 50031610-IMPRIME-ENCABEZADOS                                  
480000        WRITE REG-TARJETAS FROM WKS-DET-NO-HUBO-MOVS AFTER 10                 
480200     ELSE                                                                     
480400        PERFORM 50031640-IMPRIME-TOTALES.                                     
480600                                                                              
480650     IF WKS-MPD-PRUEBAS                                                       
480700        CLOSE R-TARJETAS WITH SAVE                                            
480750     ELSE                                                                     
480800        CLOSE R-TARJETAS WITH RELEASE.                                        
481000                                                                              
481200 50031610-IMPRIME-ENCABEZADOS.                                                
481400     ADD  1               TO WKS-I-HOJA.                                      
481600     MOVE WKS-I-HOJA      TO WKS-HOJA.                                        
481800     MOVE SPACES          TO REG-TARJETAS.                                    
482000     WRITE REG-TARJETAS AFTER CHANNEL 1.                                      
482200     WRITE REG-TARJETAS FROM WKS-ENCA-1.                                      
482400     WRITE REG-TARJETAS FROM WKS-ENCA-2 AFTER 2.                              
482600     WRITE REG-TARJETAS FROM WKS-ENCA-3 AFTER 1.                              
482800     WRITE REG-TARJETAS FROM WKS-ENCA-DET-1 AFTER 3.                          
483000     WRITE REG-TARJETAS FROM WKS-ENCA-DET-2 AFTER 1.                          
483200     MOVE SPACES          TO REG-TARJETAS.                                    
483400     WRITE REG-TARJETAS AFTER 1.                                              
483600     MOVE 0               TO WKS-I-RENGLON.                                   
483800                                                                              
484000 50031620-MUEVE-DATOS.                                                        
484200     MOVE ORDENADO-TB-NUMTB       TO WD1-TARJ-TB.                             
484400     MOVE MOVTBINT-NUM-CTE-CM     TO WD1-CTO-TB.                              
484600     MOVE ORDENADO-TB-CLAVE       TO WD1-CVE-CM.                              
484800     MOVE ORDENADO-TB-IMPORTE     TO WD1-IMP-CM.                              
485000     ADD  1                       TO WKS-HUBO-REGS-VA.                        
485200                                                                              
485400 50031630-GRABA-BACKUP-TARJ.                                                  
485600*    EL MAXIMO DE RENGLONES POR PAGINA SON 60                                 
485800     ADD  1       TO WKS-I-RENGLON.                                           
486000     IF WKS-I-RENGLON > 46                                                    
486200        PERFORM 50031610-IMPRIME-ENCABEZADOS.                                 
486400                                                                              
486600     WRITE REG-TARJETAS FROM WKS-DETALLE-1 AFTER 1.                           
486800                                                                              
487000 50031640-IMPRIME-TOTALES.                                                    
487200     IF WKS-I-RENGLON > 34                                                    
487400        PERFORM 50031610-IMPRIME-ENCABEZADOS.                                 
487600                                                                              
487800     WRITE REG-TARJETAS FROM WKS-ENCA-TOTALES AFTER 5.                        
488000     PERFORM 50031650-VACIA-TIPOMOV VARYING WKS-IND-TM FROM 1 BY 1            
488200             UNTIL WKS-IND-TM > 3.                                            
488400                                                                              
488600 50031650-VACIA-TIPOMOV.                                                      
488800     MOVE WKS-T-TM(WKS-IND-TM)            TO WTD1-TIPO-MOV.                   
489000     MOVE WKS-TD-NUM(WKS-IND-TM,1)        TO WTD1-IGU-NUM.                    
489200     MOVE WKS-TD-IMP(WKS-IND-TM,1)        TO WTD1-IGU-IMP.                    
489400     MOVE WKS-TD-NUM(WKS-IND-TM,2)        TO WTD1-DIF-NUM.                    
489600     MOVE WKS-TD-IMP(WKS-IND-TM,2)        TO WTD1-DIF-IMP.                    
489800                                                                              
490000     WRITE REG-TARJETAS FROM WKS-TOTAL-DET-1 AFTER 2.                         
490200                                                                              
495000 50031700-CALENDAR.                                                           
495200      CALL "THECALENDAR IN LOCSUP"                                            
495400            USING WS-FUNCION,WS-FECHA1,WS-FECHA2,WS-FORMATO.                  
495600*                                                                             
495800 50031700-PROYECTA-FECHA.                                                     
496000     IF WKS-PROYECTO-FEC-87                                                   
496200        PERFORM 50031710-SIGUIENTE-DIA-HABIL                                  
496400     ELSE IF WKS-PROYECTO-FEC-152                                             
496600        PERFORM 50031720-SIGUIENTE-MES                                        
496800     ELSE IF WKS-PROYECTO-FEC-TAR                                             
497000        PERFORM 50031730-SIGUIENTE-DIA-NATURAL                                
497200     ELSE IF WKS-PROYECTO-FEC-TARSEM                                          
497400        PERFORM 50031750-SIGUIENTE-VIERNES.                                   
497600*       PERFORM 50031740-SIGUIENTEFIN-DESEMANA.                               
497800                                                                              
498000 50031710-SIGUIENTE-DIA-HABIL.                                                
498200     MOVE WKS-FEC-A-PROYECTAR-AAMD TO WS-FECHA1.                              
498400     MOVE 1                        TO WS-FECHA2.                              
498600     MOVE 13                       TO WS-FUNCION.                             
498800     MOVE 13                       TO WS-FORMATO.                             
499000     PERFORM 50031700-CALENDAR.                                               
499200     MOVE WS-FECHA1               TO WKS-FEC-PROYECTADA-AAMD.                 
499400                                                                              
499600 50031720-SIGUIENTE-MES.                                                      
499800     MOVE WKS-FEC-A-PROYECTAR-AAMD TO WKS-FEC-PROYECTADA-AAMD.                
500000     ADD  1                        TO WKS-FEC-PROY-MM.                        
500200     IF WKS-FEC-PROY-MM > 12                                                  
500400        MOVE 1                     TO WKS-FEC-PROY-MM                         
500600        ADD  1                     TO WKS-FEC-PROY-AAAA.                      
500800                                                                              
501000 50031730-SIGUIENTE-DIA-NATURAL.                                              
501200     MOVE WKS-FEC-A-PROYECTAR-AAMD TO WS-FECHA1.                              
501400     MOVE 1                        TO WS-FECHA2.                              
501600     MOVE 08                       TO WS-FUNCION.                             
501800     MOVE 13                       TO WS-FORMATO.                             
502000     PERFORM 50031700-CALENDAR.                                               
502200     MOVE WS-FECHA1               TO WKS-FEC-PROYECTADA-AAMD.                 
502400                                                                              
502600 50031740-SIGUIENTEFIN-DESEMANA.                                              
502800     MOVE 0                        TO WKS-FIN-DE-SEMANA.                      
503000     MOVE WKS-FEC-A-PROYECTAR-AAMD TO WS-FECHA1.                              
503200     MOVE 1                        TO WS-FECHA2.                              
503400     MOVE 13                       TO WS-FUNCION.                             
503600     MOVE 13                       TO WS-FORMATO.                             
503800     PERFORM 50031700-CALENDAR.                                               
504000     MOVE WS-FECHA1               TO WS-FECHA-CAL1.                           
504200     MOVE 1                       TO WS-FECHA2.                               
504400     MOVE 13                      TO WS-FUNCION.                              
504600     MOVE 13                      TO WS-FORMATO.                              
504800     PERFORM 50031700-CALENDAR.                                               
505000     MOVE WS-FECHA1               TO WS-FECHA-CAL2.                           
505200     MOVE WS-FECHA-CAL1           TO WS-FECHA1.                               
505400     MOVE 1                       TO WS-FECHA2.                               
505600     MOVE 06                      TO WS-FUNCION.                              
505800     MOVE 13                      TO WS-FORMATO.                              
506000     PERFORM 50031700-CALENDAR.                                               
506200     MOVE WS-FECHA1               TO WS-CONTADOR1.                            
506400     MOVE WS-FECHA-CAL2           TO WS-FECHA1.                               
506600     MOVE 1                       TO WS-FECHA2.                               
506800     MOVE 06                      TO WS-FUNCION.                              
507000     MOVE 13                      TO WS-FORMATO.                              
507200     PERFORM 50031700-CALENDAR.                                               
507400     MOVE WS-FECHA1               TO WS-CONTADOR2.                            
507600     PERFORM 50031740-BUSCA-FIN-SEMANA UNTIL WKS-FIN-DE-SEMANA =1.            
507800     MOVE WS-FECHA-CAL1           TO WKS-FEC-PROYECTADA-AAMD.                 
508000                                                                              
508200 50031740-BUSCA-FIN-SEMANA.                                                   
508400     IF WS-CONTADOR2 > WS-CONTADOR1                                           
508600        MOVE WS-FECHA-CAL2        TO WS-FECHA-CAL1                            
508800        MOVE WS-CONTADOR2         TO WS-CONTADOR1                             
509000        MOVE WS-FECHA-CAL2        TO WS-FECHA1                                
509200        MOVE 1                    TO WS-FECHA2                                
509400        MOVE 13                   TO WS-FUNCION                               
509600        MOVE 13                   TO WS-FORMATO                               
509800        PERFORM 50031700-CALENDAR                                             
510000        MOVE WS-FECHA1            TO WS-FECHA-CAL2                            
510200        MOVE 1                    TO WS-FECHA2                                
510400        MOVE 06                   TO WS-FUNCION                               
510600        MOVE 13                   TO WS-FORMATO                               
510800        PERFORM 50031700-CALENDAR                                             
511000        MOVE WS-FECHA1            TO WS-CONTADOR2                             
511200     ELSE                                                                     
511400        MOVE 1                    TO WKS-FIN-DE-SEMANA.                       
511600                                                                              
511800 50031750-SIGUIENTE-VIERNES.                                                  
512000     MOVE WKS-FEC-A-PROYECTAR-AAMD TO WS-FECHA1.                              
512200     MOVE 7                        TO WS-FECHA2.                              
512400     MOVE 08                       TO WS-FUNCION.                             
512600     MOVE 13                       TO WS-FORMATO.                             
512800     PERFORM 50031700-CALENDAR.                                               
513000     MOVE WS-FECHA1               TO WKS-FEC-PROYECTADA-AAMD.                 
513500                                                                              
514000*INI-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
514500 50031750-VERIFICO-DIA-HABIL.                                                 
515000     IF WKS-FEC-MAQ-AAMD = WS-FECHA-LIN                                       
515500         MOVE 1      TO WS-DISPERSACPE.                                       
516000*FIN-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
516500                                                                              
518000 50032000-PROCESO-ARCHS-S087.                                                 
518200*****************************                                                 
518400     MOVE WS-ULTFECHA-87          TO WKS-FEC-A-PROYECTAR-AAMD.                
518600     MOVE 1                       TO WKS-ARCH-A-DISP.                         
518800     PERFORM 50031700-PROYECTA-FECHA.                                         
519000     MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-87.                          
519200     MOVE 0                       TO WKS-FILE-ERROR-VA.                       
519400                                                                              
519600     PERFORM 50032100-METO-ARCHS-S087                                         
519800             UNTIL WS-ULTFECHA-87     > WS-FECHA-LIN OR                       
520000                   WKS-FILE-CON-ERROR.                                        
520200                                                                              
520400 50032100-METO-ARCHS-S087.                                                    
520600     MOVE WS-ULTFECHA-87           TO W-ETIQ-D87-FECHA.                       
520800     MOVE WS-NODO                  TO W-ETIQ-D87-CSIO                         
521000                                      W-ETIQ-D87-CSID.                        
521200     SET DISPS087 (TITLE)          TO W-ETIQ-DISPS087.                        
521400     SET DISPS087 (DEPENDENTSPECS) TO VALUE (TRUE).                           
521600     MOVE 0                        TO WKS-EOF-S087-VA.                        
521800     IF ATTRIBUTE RESIDENT OF DISPS087 IS = VALUE TRUE                        
522000        OPEN INPUT DISPS087                                                   
522200        PERFORM 50032200-VALIDA-HEADER-S087                                   
522400     ELSE                                                                     
522600        PERFORM 50032110-ALARMA-S087                                          
523800        MOVE 1            TO WKS-FILE-ERROR-VA.                               
524000                                                                              
524200     IF WKS-FILE-SIN-ERROR                                                    
524400        ADD  1                    TO WS-ARCH-IND                              
524600        MOVE 3                    TO WS-ARCH-MACC(WS-ARCH-IND)                
524800        MOVE WS-ULTFECHA-87       TO WS-ARCH-FECHA(WS-ARCH-IND)               
525000        ADD  1                    TO WS-ARCH-IND                              
525200        MOVE 1                    TO WS-ARCH-MACC(WS-ARCH-IND)                
525400        MOVE WS-ULTFECHA-87       TO WS-ARCH-FECHA(WS-ARCH-IND)               
525600        ADD  1                    TO WS-ARCH-IND                              
525800        MOVE 5                    TO WS-ARCH-MACC(WS-ARCH-IND)                
526000        MOVE WS-ULTFECHA-87       TO WS-ARCH-FECHA(WS-ARCH-IND).              
526200                                                                              
526400     IF WKS-FILE-SIN-ERROR                                                    
526600        MOVE W-ETIQ-DISPS087      TO WKS-ARCH-EN-PROCESO                      
526800        MOVE 1                    TO WKS-REG-ACTUAL                           
527000        MOVE ATTRIBUTE LASTRECORD OF DISPS087 TO WKS-REG-ULTIMO               
527200        PERFORM 50032300-LEO-ARCH-S087 UNTIL WKS-EOF-S087                     
527400        CLOSE DISPS087 WITH SAVE                                              
527600        MOVE WS-ULTFECHA-87          TO WS-ULT-ARCH-APLI(3)                   
527800                                        WS-ULT-ARCH-APLI(1)                   
528000                                        WS-ULT-ARCH-APLI(5)                   
528200        MOVE WS-ULTFECHA-87          TO WKS-FEC-A-PROYECTAR-AAMD              
528400        MOVE 1                       TO WKS-ARCH-A-DISP                       
528500                                        WKS-DISP-S087                         
528600        PERFORM 50031700-PROYECTA-FECHA                                       
528800        MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-87.                       
528810                                                                              
528820 50032110-ALARMA-S087.                                                        
528830     IF WS-ULTFECHA-87 > WS-FECHA-LIN                                         
528840        MOVE "E"          TO WKS-TIPO-LJ                                      
528850     ELSE                                                                     
528860        MOVE "O"          TO WKS-TIPO-LJ.                                     
528870     MOVE 020801          TO WKS-CODIGO-LJ                                    
528880     STRING "SE INTENTA DISPERSAR EL ARCHIVO " W-ETIQ-DISPS087                
528890            " Y NO ESTA RESIDENTE "                                           
528900            DELIMITED BY SIZE INTO TEXTO-LJ                                   
528910     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
529000                                                                              
529200 50032200-VALIDA-HEADER-S087.                                                 
529400     MOVE 1       TO WS-LLAVE-DISPS087.                                       
529600     READ DISPS087 INVALID KEY                                                
529800          MOVE "E"                TO WKS-TIPO-LJ                              
530000          MOVE 020801             TO WKS-CODIGO-LJ                            
530200          STRING "ARCHIVO " W-ETIQ-DISPS087 " NO TRAE REGISTROS "             
530400                 DELIMITED BY SIZE INTO TEXTO-LJ                              
530600          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
530800          MOVE 1          TO WKS-FILE-ERROR-VA.                               
531000                                                                              
531200     IF WKS-FILE-SIN-ERROR                                                    
531400        IF WS-DISP87-FECARC = W-ETIQ-D87-FECHA                                
531600           MOVE "E"               TO WKS-TIPO-LJ                              
531800           MOVE 020801            TO WKS-CODIGO-LJ                            
532000           STRING "PROCESO ARCHIVO " W-ETIQ-DISPS087                          
532200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
532400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
532600        ELSE                                                                  
532800           MOVE WS-DISP87-FECARC  TO WKS-DISP87-FECARC                        
533000           MOVE "O"               TO WKS-TIPO-LJ                              
533200           MOVE 010401            TO WKS-CODIGO-LJ                            
533400           STRING "EL ARCHIVO DEL S087 CON FECHA "                            
533600                  W-ETIQ-D87-FECHA " TRAE INTERNAMENTE LA FECHA "             
533800                  WKS-DISP87-FECARC " Y NO CORRESPONDEN, LLAMAR "             
534000                  "AL RESPONSABLE DEL S087 EN ING. DE SISTEMAS "              
534200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
534400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
534600           MOVE 1         TO WKS-FILE-ERROR-VA.                               
534800                                                                              
535000 50032300-LEO-ARCH-S087.                                                      
535200     PERFORM 50032400-LEO-REG-S087.                                           
535400     IF WS-DISP87-TIPREG = "9"                                                
535600        MOVE 1    TO WKS-EXISTE-ORD-X-DISPER                                  
535800                     WKS-EOF-S087-VA                                          
536000     ELSE IF WS-DISP87-TIPREG     = "2"                                       
536200        MOVE WS-DISP87-SUCPROM    TO ORDENADO-TB-SUCPROM                      
536400        MOVE WS-DISP87-CTA        TO ORDENADO-TB-NUMCONT                      
536600        IF WS-DISP87-PRODUCTO = 500                                           
536800           MOVE 3                 TO ORDENADO-TB-PRIORIDAD                    
537000           COMPUTE WS-ARCH-IND3 = WS-ARCH-IND - 2                             
537200           MOVE WS-DISP87-SUCPROM TO WS-DISP87-CTASUC                         
537400           MOVE WS-DISP87-CTA     TO ORDENADO-TB-NUMCONT                      
537600        ELSE IF WS-DISP87-PRODUCTO = 66                                       
537800           MOVE 5                 TO ORDENADO-TB-PRIORIDAD                    
538000           COMPUTE WS-ARCH-IND3 = WS-ARCH-IND                                 
538200        ELSE                                                                  
538400           COMPUTE WS-ARCH-IND3 = WS-ARCH-IND - 1                             
538600           MOVE 1                 TO ORDENADO-TB-PRIORIDAD.                   
538800                                                                              
539000     IF NOT WKS-EOF-S087 AND WS-DISP87-TIPREG = "2"                           
539200        MOVE WS-DISP87-CVETRAN    TO ORDENADO-TB-CLAVE                        
539400        MOVE WS-DISP87-IMPORTE    TO ORDENADO-TB-IMPORTE                      
539600        MOVE WS-DISP87-INDLEY     TO ORDENADO-TB-INDLEY                       
539800        MOVE WS-DISP87-CTAORI     TO ORDENADO-TB-REFDOCTO                     
539850*       ESTABAN APARECIENDO LOS REEMBOLSOS DEL S087 EN EN EDO. DE             
539900*       CUENTA EN EL APARTADO DE MEDIO DE ACCESO TARJETAS MAY 2004            
540000*                                    ORDENADO-TB-NUMTB                        
540200        MOVE WS-DISP87-SUCINI     TO ORDENADO-TB-SUCBANCO                     
540400        MOVE WS-DISP87-CAJAINI    TO ORDENADO-TB-CAJA                         
540600        MOVE WS-DISP87-PRODUCTO   TO ORDENADO-TB-PRODUCTO                     
540800        MOVE WS-DISP87-INSTRUM    TO ORDENADO-TB-INSTRUM                      
541000        MOVE WS-DISP87-LEYENDA    TO ORDENADO-TB-LEYENDA                      
541200        MOVE SPACES               TO ORDENADO-TB-REFINTNAL                    
541400        MOVE WS-NODO              TO ORDENADO-TB-NODO                         
541600        ADD  WS-DISP87-IMPORTE    TO WS-ARCH-ABOCON(WS-ARCH-IND3)             
541800        ADD  1                    TO WS-NUM-87                                
542000                                     WS-GLO-NUMREG                            
542200        ADD WS-DISP87-IMPORTE     TO WS-IMP-87                                
542400                                     WS-GLO-IMPREG                            
542600        MOVE WS-ULTFECHA-87       TO ORDENADO-TB-FECHA                        
542800        IF WS-DISP87-MONEDA = 5                                               
543000           MOVE 3                 TO ORDENADO-TB-CTAMAE-VA                    
543200           MOVE WS-DISP87-MONEDA  TO ORDENADO-TB-MONEDA                       
543400        ELSE                                                                  
543600           MOVE 1                 TO ORDENADO-TB-MONEDA.                      
543800                                                                              
544000     IF NOT WKS-EOF-S087 AND WS-DISP87-TIPREG = "2"                           
544200        PERFORM 50032500-GRABA-S087-EN-ORDCM.                                 
544400                                                                              
544600 50032400-LEO-REG-S087.                                                       
544800     ADD  1                       TO WS-LLAVE-DISPS087.                       
545000     MOVE WS-LLAVE-DISPS087       TO WKS-REG-ACTUAL.                          
545200     READ DISPS087 INVALID KEY                                                
545400          MOVE "E"                TO WKS-TIPO-LJ                              
545600          MOVE 020801             TO WKS-CODIGO-LJ                            
545800          STRING "ERROR AL LEER REGISTRO DEL ARCHIVO "                        
546000                 W-ETIQ-DISPS087                                              
546200                 DELIMITED BY SIZE INTO TEXTO-LJ                              
546400          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
546600          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
546800                                                                              
547000 50032500-GRABA-S087-EN-ORDCM.                                                
547200     MOVE "2"             TO REG-ORDENADO-TR.                                 
547400     ADD  1               TO WS-LLAVE-ORDCM.                                  
547600     WRITE REG-ORDENADO INVALID KEY                                           
547800           MOVE "E"                TO WKS-TIPO-LJ                             
548000           MOVE 020801             TO WKS-CODIGO-LJ                           
548200           STRING "ERROR AL GRABAR REGISTRO DEL ARCHIVO "                     
548400                  W-ETIQ-DISPS087 " EN EL ORDENADO-CM "                       
548600                  DELIMITED BY SIZE INTO TEXTO-LJ                             
548800           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
549000           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
549200     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
549400                                                                              
555000 50033000-PROCESO-ARCHS-S152.                                                 
555200*****************************                                                 
555400     MOVE WS-ULTFECHA-152         TO WKS-FEC-A-PROYECTAR-AAMD.                
555600     MOVE 2                       TO WKS-ARCH-A-DISP.                         
555800     PERFORM 50031700-PROYECTA-FECHA.                                         
556000     MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-152.                         
556200     MOVE 0                       TO WKS-FILE-ERROR-VA.                       
556400                                                                              
556600     PERFORM 50033100-METO-ARCHS-S152                                         
556800             UNTIL WS-ULTFECHA-152  > WS-FECHA-LIN  OR                        
557000                   WKS-FILE-CON-ERROR.                                        
557200                                                                              
557400 50033100-METO-ARCHS-S152.                                                    
557600     MOVE WS-ULTFECHA-152          TO W-ETIQ-DIS-FECHA.                       
557800     MOVE B02-NUM-CSI              TO W-ETIQ-DIS-CSID.                        
558000     SET DISPS152 (TITLE)          TO W-ETIQ-DISPS152.                        
558200     SET DISPS152 (DEPENDENTSPECS) TO VALUE (TRUE).                           
558400     MOVE 0                        TO WKS-EOF-S152-VA.                        
558600     IF ATTRIBUTE RESIDENT OF DISPS152 IS = VALUE TRUE                        
558800        OPEN INPUT DISPS152                                                   
559000        PERFORM 50033200-VALIDA-HEADER-S152                                   
559200     ELSE                                                                     
559400        MOVE "E"          TO WKS-TIPO-LJ                                      
559600        MOVE 020801       TO WKS-CODIGO-LJ                                    
559800        STRING "SE INTENTA DISPERSAR EL ARCHIVO " W-ETIQ-DISPS152             
560000               " Y NO ESTA RESIDENTE "                                        
560200               DELIMITED BY SIZE INTO TEXTO-LJ                                
560400        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
560600        MOVE 1            TO WKS-FILE-ERROR-VA.                               
560800                                                                              
561000     IF WKS-FILE-SIN-ERROR                                                    
561200        ADD  1                    TO WS-ARCH-IND                              
561400        MOVE 6                    TO WS-ARCH-MACC(WS-ARCH-IND)                
561600        MOVE WS-ULTFECHA-152      TO WS-ARCH-FECHA(WS-ARCH-IND).              
561800                                                                              
562000     IF WKS-FILE-SIN-ERROR                                                    
562200        MOVE W-ETIQ-DISPS152         TO WKS-ARCH-EN-PROCESO                   
562400        MOVE 1                       TO WKS-REG-ACTUAL                        
562600        MOVE ATTRIBUTE LASTRECORD OF DISPS152 TO WKS-REG-ULTIMO               
562800        PERFORM 50033300-LEO-ARCH-S152 UNTIL WKS-EOF-S152                     
563000        CLOSE DISPS152 WITH SAVE                                              
563050*INI-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
563100        MOVE 0                       TO WS-DISPERSACPE                        
563150*FIN-STEFANINI EBS US-1115 AUTOMATIZACION DISPERSION CPE                      
563200        MOVE WS-ULTFECHA-152         TO WS-ULT-ARCH-APLI(6)                   
563400        MOVE WS-ULTFECHA-152         TO WKS-FEC-A-PROYECTAR-AAMD              
563600        MOVE 2                       TO WKS-ARCH-A-DISP                       
563800        PERFORM 50031700-PROYECTA-FECHA                                       
564000        MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-152.                      
564200                                                                              
564400 50033200-VALIDA-HEADER-S152.                                                 
564600     MOVE 1       TO WS-LLAVE-DISPS152.                                       
564800     READ DISPS152 INVALID KEY                                                
565000          MOVE "E"                TO WKS-TIPO-LJ                              
565200          MOVE 020801             TO WKS-CODIGO-LJ                            
565400          STRING "ARCHIVO " W-ETIQ-DISPS152 " NO TRAE REGISTROS "             
565600                 DELIMITED BY SIZE INTO TEXTO-LJ                              
565800          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
566000          MOVE 1          TO WKS-FILE-ERROR-VA.                               
566200                                                                              
566400     IF WKS-FILE-SIN-ERROR                                                    
566600        IF WS-DIS152-FECARC = W-ETIQ-DIS-FECHA                                
566800           MOVE "E"       TO WKS-TIPO-LJ                                      
567000           MOVE 020801    TO WKS-CODIGO-LJ                                    
567200           STRING "PROCESO ARCHIVO " W-ETIQ-DISPS152                          
567400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
567600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
567800        ELSE                                                                  
568000           MOVE WS-DIS152-FECARC TO WKS-DIS152-FECARC                         
568200           MOVE "O"       TO WKS-TIPO-LJ                                      
568400           MOVE 010401    TO WKS-CODIGO-LJ                                    
568600           STRING "EL ARCHIVO DEL S152 CON FECHA "                            
568800                  W-ETIQ-DIS-FECHA " TRAE INTERNAMENTE LA FECHA "             
569000                  WKS-DIS152-FECARC " Y NO CORRESPONDEN, LLAMAR "             
569200                  "AL RESPONSABLE DEL S152 EN ING. DE SISTEMAS "              
569400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
569600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
569800           MOVE 1         TO WKS-FILE-ERROR-VA.                               
570000                                                                              
570200 50033300-LEO-ARCH-S152.                                                      
570210**PARA EL PROYECTO DE IMPORTE DE RENDIMIENTO BRUTO EN ADDENDA                 
570220*EL S500P015 RECIBIRA UNA NUEVA CLAVE DE TRANSACCION NO CONTABLE =            
570230**0810 (WS-CVE-NCADDENDA) DEL ARCHIVO DE DISPERSI¿N DEL P330                  
570240**POR LO QUE ESTA CLAVE SE ACUMULARA EN LOS TOTALES DE CARGOS NO              
570250**CONTABLES.                                                                  
570400     PERFORM 50033400-LEO-REG-S152.                                           
570600     IF WS-DIS152-TIPREG = "9"                                                
570800        MOVE 1    TO WKS-EXISTE-ORD-X-DISPER                                  
571000                     WKS-EOF-S152-VA                                          
571200     ELSE                                                                     
571400        MOVE 6                    TO ORDENADO-TB-PRIORIDAD                    
571600        MOVE WS-DIS152-SUCPROM    TO ORDENADO-TB-SUCPROM                      
571800        MOVE WS-DIS152-CTA        TO ORDENADO-TB-NUMCONT                      
572000        MOVE WS-DIS152-CVETRAN    TO ORDENADO-TB-CLAVE                        
572050                                     WS-CVETRAN-NCS152                        
572200        MOVE WS-DIS152-IMPORTE    TO ORDENADO-TB-IMPORTE                      
572400        MOVE WS-DIS152-CTAORI     TO ORDENADO-TB-REFDOCTO                     
572600*                                    ORDENADO-TB-NUMTB                        
572800        MOVE WS-DIS152-SUCINI     TO ORDENADO-TB-SUCBANCO                     
573000        MOVE WS-DIS152-CAJAINI    TO ORDENADO-TB-CAJA                         
573200        MOVE WS-DIS152-PRODUCTO   TO ORDENADO-TB-PRODUCTO                     
573400        MOVE WS-DIS152-INSTRUM    TO ORDENADO-TB-INSTRUM                      
573600        MOVE WS-DIS152-LEYENDA    TO ORDENADO-TB-LEYENDA                      
573800        MOVE SPACES               TO ORDENADO-TB-REFINTNAL                    
574000        MOVE WS-DIS152-INDLEY     TO ORDENADO-TB-INDLEY                       
574200        MOVE 1                    TO ORDENADO-TB-MONEDA                       
574400        MOVE WS-NODO              TO ORDENADO-TB-NODO                         
574600        ADD  1                    TO WS-NUM-152                               
574800                                     WS-GLO-NUMREG                            
575000        ADD  WS-DIS152-IMPORTE  WS-DIS152-IMPORTE2                            
575200                                  TO WS-IMP-152  WS-GLO-IMPREG                
575400        MOVE WS-ULTFECHA-152      TO ORDENADO-TB-FECHA                        
575600        IF ORD-CVE-ABOAUT                                                     
575800           ADD  WS-DIS152-IMPORTE TO WS-ARCH-ABOCON(WS-ARCH-IND)              
576000           MOVE 0                 TO ORDENADO-TB-CVETRAN2                     
576200                                     ORDENADO-TB-IMPORTE2                     
576210        ELSE                                                                  
576220        IF WS-CVE-NCADDENDA                                                   
576230           ADD  WS-DIS152-IMPORTE TO WS-ARCH-CARNCON(WS-ARCH-IND)             
576240           MOVE 0                TO ORDENADO-TB-CVETRAN2                      
576250           MOVE 0                TO ORDENADO-TB-IMPORTE2                      
576400        ELSE                                                                  
576600           MOVE WS-DIS152-CVETRAN2 TO ORDENADO-TB-CVETRAN2                    
576800           MOVE WS-DIS152-IMPORTE2 TO ORDENADO-TB-IMPORTE2                    
577000           ADD  WS-DIS152-IMPORTE    WS-DIS152-IMPORTE2                       
577200                                   TO WS-ARCH-CARCON(WS-ARCH-IND).            
577400                                                                              
577600     IF NOT WKS-EOF-S152 AND WS-DIS152-TIPREG = "2"                           
577800        PERFORM 50033500-GRABA-S152-EN-ORDCM.                                 
578000                                                                              
578200 50033400-LEO-REG-S152.                                                       
578400     ADD  1                       TO WS-LLAVE-DISPS152.                       
578600     MOVE WS-LLAVE-DISPS152       TO WKS-REG-ACTUAL.                          
578800     READ DISPS152 INVALID KEY                                                
579000          MOVE "E"                TO WKS-TIPO-LJ                              
579200          MOVE 020801             TO WKS-CODIGO-LJ                            
579400          STRING "ERROR AL LEER REGISTRO DEL ARCHIVO "                        
579600                 W-ETIQ-DISPS152                                              
579800                 DELIMITED BY SIZE INTO TEXTO-LJ                              
580000          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
580200          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
580400                                                                              
580600 50033500-GRABA-S152-EN-ORDCM.                                                
580800     MOVE "2"             TO REG-ORDENADO-TR.                                 
581000     ADD  1               TO WS-LLAVE-ORDCM.                                  
581200     WRITE REG-ORDENADO INVALID KEY                                           
581400           MOVE "E"                TO WKS-TIPO-LJ                             
581600           MOVE 020801             TO WKS-CODIGO-LJ                           
581800           STRING "ERROR AL GRABAR REGISTRO DEL ARCHIVO "                     
582000                  W-ETIQ-DISPS152 " EN EL ORDENADO-CM "                       
582200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
582400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
582600           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
582800     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
583000                                                                              
588000 50034000-PROCESO-TARJETASEM.                                                 
588200*****************************                                                 
588250                                                                              
588300     IF WS-B02-DECOM-S111 = 0                                                 
588400        MOVE WS-ULTFECHA-TARSEM   TO WKS-FEC-A-PROYECTAR-AAMD                 
588600        MOVE 4                    TO WKS-ARCH-A-DISP                          
588800        PERFORM 50031700-PROYECTA-FECHA                                       
589000        MOVE WKS-FEC-PROYECTADA-AAMD                                          
589100                                  TO WS-ULTFECHA-TARSEM                       
589200        MOVE WS-ULTFECHA-TARSEM   TO WKS-FEC-A-PROYECTAR-AAMD                 
589400        MOVE 4                    TO WKS-ARCH-A-DISP                          
589600        PERFORM 50031700-PROYECTA-FECHA                                       
589800        MOVE WKS-FEC-PROYECTADA-AAMD                                          
589900                                  TO WKS-PROXFECHA-TARSEM                     
590000        MOVE 0                    TO WKS-FILE-ERROR-VA                        
590010        MOVE 1                    TO WS-EAS-TAR                               
590200                                                                              
590400        IF WS-ULTFECHA-TARSEM NOT > WS-FECHA-LIN                              
590600           PERFORM 50034100-METO-ARCHS-TARSEM.                                
590603                                                                              
590606*INI EAS FASE 5                                                               
590609     MOVE WS-ULTFECHA-EASSEM      TO WKS-FEC-A-PROYECTAR-AAMD.                
590612     MOVE 4                       TO WKS-ARCH-A-DISP.                         
590615     PERFORM 50031700-PROYECTA-FECHA.                                         
590618     MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-EASSEM.                      
590621     MOVE WS-ULTFECHA-EASSEM      TO WKS-FEC-A-PROYECTAR-AAMD.                
590624     MOVE 4                       TO WKS-ARCH-A-DISP.                         
590627     PERFORM 50031700-PROYECTA-FECHA.                                         
590630     MOVE WKS-FEC-PROYECTADA-AAMD TO WKS-PROXFECHA-TARSEM.                    
590633     MOVE 0                       TO WKS-FILE-ERROR-VA.                       
590636     MOVE 2                       TO WS-EAS-TAR.                              
590639                                                                              
590642     IF WS-ULTFECHA-EASSEM NOT > WS-FECHA-LIN                                 
590645        PERFORM 50034100-METO-ARCHS-TARSEM.                                   
590648*FIN EAS FASE 5                                                               
590800                                                                              
591000 50034100-METO-ARCHS-TARSEM.                                                  
591003                                                                              
591006     CHANGE ATTRIBUTE NEWFILE OF MOVTBINTSEM TO VALUE FALSE.                  
591009     IF WS-PROC-TAR                                                           
591200        MOVE WS-ULTFECHA-TARSEM      TO W-ETIQ-TBSEM-FECHA                    
591400        MOVE WS-NODO                 TO W-ETIQ-TBSEM-CSI                      
591600        SET  MOVTBINTSEM(TITLE)      TO W-ETIQ-MOVTBINTSEM                    
591603        MOVE W-ETIQ-MOVTBINTSEM      TO WS-ETIQ-EAS-TAR                       
591606        MOVE W-ETIQ-TBSEM-FECHA      TO WS-ETIQ-FECHA                         
591609     ELSE                                                                     
591612        MOVE WS-ULTFECHA-EASSEM      TO W-ETIQ-TBESEM-FECHA                   
591615        MOVE WS-NODO                 TO W-ETIQ-TBESEM-CSI                     
591618        SET MOVTBINTSEM(TITLE)       TO W-ETIQ-MOVTBINTEASSEM                 
591621        MOVE W-ETIQ-MOVTBINTEASSEM   TO WS-ETIQ-EAS-TAR                       
591624        MOVE W-ETIQ-TBESEM-FECHA     TO WS-ETIQ-FECHA.                        
591627                                                                              
591800     MOVE 0                       TO WS-CARGOS WS-ABONOS.                     
592000     MOVE 0                       TO WKS-EOF-TARS-VA.                         
592200     IF ATTRIBUTE RESIDENT OF MOVTBINTSEM IS = VALUE TRUE                     
592400        OPEN INPUT MOVTBINTSEM                                                
592600        PERFORM 50034200-VALIDA-HDRYTRL-TARSEM                                
592700        MOVE 1                       TO WKS-FLAG-PROCTJSEM                    
592800     ELSE                                                                     
594200        PERFORM 50034110-ALARMA-TARSEM                                        
594400        MOVE 1            TO WKS-FILE-ERROR-VA.                               
594600                                                                              
594800     IF WKS-FILE-SIN-ERROR                                                    
594802        MOVE 1                      TO WS-EJECUTA-P121                        
594804        IF WS-PROC-TAR                                                        
595000           ADD  1                   TO WS-ARCH-IND                            
595200           MOVE 4                   TO WS-ARCH-MACC(WS-ARCH-IND)              
595400           MOVE WS-ULTFECHA-TARSEM  TO WS-ARCH-FECHA(WS-ARCH-IND)             
595410           MOVE WS-ULTFECHA-TARSEM  TO WS-ULT-ARCH-APLI(4)                    
595415        ELSE                                                                  
595420*INI EAS FASE 5                                                               
595440           ADD  1                   TO WS-ARCH-IND                            
595460           MOVE 8                   TO WS-ARCH-MACC (WS-ARCH-IND)             
595480           MOVE WS-ULTFECHA-EASSEM  TO WS-ARCH-FECHA(WS-ARCH-IND)             
595495           MOVE WS-ULTFECHA-EASSEM  TO WS-ULT-ARCH-APLI(24).                  
595500*FIN EAS FASE 5                                                               
595600                                                                              
595800     IF WKS-FILE-SIN-ERROR                                                    
596000        MOVE WS-ETIQ-EAS-TAR      TO WKS-ARCH-EN-PROCESO                      
596200        MOVE 1                    TO WKS-REG-ACTUAL                           
596400        MOVE ATTRIBUTE LASTRECORD OF MOVTBINTSEM TO WKS-REG-ULTIMO            
596600        PERFORM 50034700-AGREGA-MSG-50                                        
596800        PERFORM 50034300-LEO-ARCH-TARSEM UNTIL WKS-EOF-TARS                   
597000        CLOSE MOVTBINTSEM WITH SAVE                                           
597400        PERFORM 50034800-AGREGA-MSG-12.                                       
597410                                                                              
597420 50034110-ALARMA-TARSEM.                                                      
597430     IF (WS-FECHA-TARSEM-ANT < WS-ULTFECHA-TARSEM AND                         
597431         WS-PROC-TAR) OR                                                      
597432        (WS-FECHA-TARSEM-ANT < WS-ULTFECHA-EASSEM AND                         
597433         WS-PROC-EAS) OR                                                      
597435        WKS-DISP-S087 = 1                                                     
597440        MOVE "E"                  TO WKS-TIPO-LJ                              
597450     ELSE                                                                     
597460        MOVE "O"                  TO WKS-TIPO-LJ.                             
597470     MOVE 020801                  TO WKS-CODIGO-LJ.                           
597480     STRING "SE INTENTA DISPERSAR EL ARCHIVO "                                
597490            WS-ETIQ-EAS-TAR                                                   
597500            " Y NO ESTA RESIDENTE "                                           
597510            DELIMITED BY SIZE INTO TEXTO-LJ                                   
597520     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
597600                                                                              
597800 50034200-VALIDA-HDRYTRL-TARSEM.                                              
598000     PERFORM 50034210-VALIDA-HDR-TARSEM.                                      
598200     IF WKS-FILE-SIN-ERROR                                                    
598400        PERFORM 50034220-VALIDA-TRL-TARSEM.                                   
598600     IF WKS-FILE-SIN-ERROR                                                    
598800        MOVE "E"       TO WKS-TIPO-LJ                                         
599000        MOVE 020801    TO WKS-CODIGO-LJ                                       
599200        STRING "PROCESO ARCHIVO " WS-ETIQ-EAS-TAR                             
599400               DELIMITED BY SIZE INTO TEXTO-LJ                                
599600        PERFORM 00000000-LLAMA-DISPLAY-STRING.                                
599800                                                                              
600000 50034210-VALIDA-HDR-TARSEM.                                                  
600200     MOVE 1               TO WS-LLAVE-TBINTSEM.                               
600400     READ MOVTBINTSEM INTO WS-REG-MOVTBINTER INVALID KEY                      
600600          MOVE "E"        TO WKS-TIPO-LJ                                      
600800          MOVE 020801     TO WKS-CODIGO-LJ                                    
601000          STRING "ARCHIVO " WS-ETIQ-EAS-TAR                                   
601200                 " NO TRAE REGISTROS "                                        
601400                 DELIMITED BY SIZE INTO TEXTO-LJ                              
601600          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
601800          MOVE 1          TO WKS-FILE-ERROR-VA.                               
602000                                                                              
602200     IF WKS-FILE-SIN-ERROR                                                    
602400        IF (MOVTBINT-NUM-SYS-SEM NOT = "S111" AND WS-PROC-TAR) OR             
602500           (MOVTBINT-NUM-SYS-SEM NOT = "1751" AND WS-PROC-EAS)                
602600           MOVE "O"       TO WKS-TIPO-LJ                                      
602800           MOVE 010401    TO WKS-CODIGO-LJ                                    
603000           STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "                 
603200                  WS-ETIQ-FECHA " NO PROVIENE DEL S111"                       
603400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
603600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
603800           MOVE 1         TO WKS-FILE-ERROR-VA                                
604000        ELSE                                                                  
604200        IF MOVTBINT-INDICADOR-SEM NOT = "S"                                   
604400           MOVE "O"       TO WKS-TIPO-LJ                                      
604600           MOVE 010401    TO WKS-CODIGO-LJ                                    
604800           STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "                 
605000                  WS-ETIQ-FECHA " NO ES SEMANAL "                             
605200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
605400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
605600           MOVE 1         TO WKS-FILE-ERROR-VA                                
605800        ELSE                                                                  
606000        IF ((MOVTBINT-FEC-DIA-SEM NOT = W-ETIQ-TBSEM-DIA   OR                 
606200             MOVTBINT-FEC-MES-SEM NOT = W-ETIQ-TBSEM-MES   OR                 
606400             MOVTBINT-FEC-ANO-SEM NOT = W-ETIQ-TBSEM-ANO)  AND                
606405             WS-PROC-TAR) OR                                                  
606410           ((MOVTBINT-FEC-DIA-SEM NOT = W-ETIQ-TBESEM-DIA  OR                 
606415             MOVTBINT-FEC-MES-SEM NOT = W-ETIQ-TBESEM-MES  OR                 
606420             MOVTBINT-FEC-ANO-SEM NOT = W-ETIQ-TBESEM-ANO) AND                
606425             WS-PROC-EAS)                                                     
606600           MOVE "O"       TO WKS-TIPO-LJ                                      
606800           MOVE 010401    TO WKS-CODIGO-LJ                                    
607000           STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "                 
607200                  WS-ETIQ-FECHA " TRAE INTERNAMENTE LA "                      
607400                  "FECHA " MOVTBINT-FEC-SYS-SEM                               
607600                  " Y NO CORRESPONDE A LA FECHA EXTERNA DEL "                 
607800                  " ARCHIVO " WS-ETIQ-FECHA                                   
608000                  "LLAMAR AL RESPONSABLE DE TARJETAS "                        
608200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
608400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
608600           MOVE 1         TO WKS-FILE-ERROR-VA                                
608800        ELSE                                                                  
609000        IF MOVTBINT-CSI-SEM NOT = WS-NODO                                     
609200           MOVE "O"       TO WKS-TIPO-LJ                                      
609400           MOVE 010401    TO WKS-CODIGO-LJ                                    
609600           STRING "EL CSI INTERNO DEL ARCHIVO DE TARSEM CON "                 
609800                  "FECHA " WS-ETIQ-EAS-TAR  " TRAE EL VALOR "                 
610000                  MOVTBINT-CSI-SEM " Y NO CORRESPONDE AL CSI "                
610200                  "DONDE SE VA A DISPERSAR "                                  
610400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
610600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
610800           MOVE 1         TO WKS-FILE-ERROR-VA.                               
611000                                                                              
611200 50034220-VALIDA-TRL-TARSEM.                                                  
611400     MOVE ATTRIBUTE LASTRECORD OF MOVTBINTSEM                                 
611600                                  TO WS-LLAVE-TBINTSEM.                       
611800     ADD  1                       TO WS-LLAVE-TBINTSEM.                       
612000     READ MOVTBINTSEM INTO WS-REG-MOVTBINTER INVALID KEY                      
612200          MOVE "E"                TO WKS-TIPO-LJ                              
612400          MOVE 020801             TO WKS-CODIGO-LJ                            
612600          STRING "ARCHIVO " WS-ETIQ-EAS-TAR " NO TRAE REG TRL "               
612800                 DELIMITED BY SIZE INTO TEXTO-LJ                              
613000          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
613200          MOVE 1          TO WKS-FILE-ERROR-VA.                               
613400                                                                              
613600     IF WKS-FILE-SIN-ERROR                                                    
613800        IF MOVTBINT-TTREG = "T"                                               
614000           IF ( MOVTBINT-NUMREG NOT = WS-LLAVE-TBINTSEM - 2 )                 
614200              COMPUTE    WS-REG-TRAILER = MOVTBINT-NUMREG                     
614400              COMPUTE    WS-REG-FISICOS = WS-LLAVE-TBINTSEM - 2               
614600              MOVE WS-REG-TRAILER         TO FILE-OP-TRAILER                  
614800              MOVE WS-REG-FISICOS         TO FILE-OP-ARCHIVO                  
615000              MOVE "E"                    TO WKS-TIPO-LJ                      
615200              MOVE 020801                 TO WKS-CODIGO-LJ                    
615400              STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "              
615600                     WS-ETIQ-FECHA " DIFIERE EN NUM. DE "                     
615800                     "REGS. FISICOS " WS-REG-FISICOS                          
616000                     " VS NUM. REGS. EN TRAILER " WS-REG-TRAILER              
616200                     " LLAMAR AL RESPONSABLE DE TARJETAS "                    
616400                     DELIMITED BY SIZE INTO TEXTO-LJ                          
616600                     PERFORM 00000000-LLAMA-DISPLAY-STRING                    
616800*             MOVE 1                      TO WKS-FILE-ERROR-VA                
616810              MOVE 1                      TO WS-LLAVE-TBINTSEM                
617000           ELSE                                                               
617200              MOVE 1                      TO WS-LLAVE-TBINTSEM                
617400        ELSE                                                                  
617600           MOVE "O"                       TO WKS-TIPO-LJ                      
617800           MOVE 010401                    TO WKS-CODIGO-LJ                    
618000           STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "                 
618200                  WS-ETIQ-FECHA " VIENE SIN TRAILER "                         
618400                  " LLAMAR AL RESPONSABLE DE TARJETAS "                       
618600                  DELIMITED BY SIZE INTO TEXTO-LJ                             
618800                  PERFORM 00000000-LLAMA-DISPLAY-STRING                       
619000           MOVE 1                         TO WKS-FILE-ERROR-VA.               
619200                                                                              
619400 50034300-LEO-ARCH-TARSEM.                                                    
619600     PERFORM 50034400-LEO-REG-TARSEM.                                         
619800                                                                              
620000     IF MOVTBINT-TTREG = "T"                                                  
620200        MOVE 1    TO WKS-EXISTE-ORD-X-DISPER                                  
620400                     WKS-EOF-TARS-VA                                          
620600        PERFORM 50034600-VERIFICA-TRL-TARSEM                                  
620800     ELSE                                                                     
621000        PERFORM 50035700-PONE-REG-TAR-EN-ORDCM.                               
621200                                                                              
621400 50034400-LEO-REG-TARSEM.                                                     
621600     ADD 1                        TO WS-LLAVE-TBINTSEM.                       
621800     MOVE WS-LLAVE-TBINTSEM       TO WKS-REG-ACTUAL.                          
622000     READ MOVTBINTSEM INTO WS-REG-MOVTBINTER  INVALID KEY                     
622200          MOVE "E"                TO WKS-TIPO-LJ                              
622400          MOVE 020801             TO WKS-CODIGO-LJ                            
622600          STRING "ERROR AL LEER REGISTRO DEL ARCHIVO "                        
622800                 W-ETIQ-MOVTBINTSEM                                           
623000                 DELIMITED BY SIZE INTO TEXTO-LJ                              
623200          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
623400          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
623600                                                                              
623800 50034600-VERIFICA-TRL-TARSEM.                                                
624000     IF MOVTBINT-TOTBRUTO NOT = WS-CARGOS                                     
624200        MOVE MOVTBINT-TOTBRUTO      TO WKS-MOVTBINT-TOTBRUTO                  
624400        MOVE "E"                    TO WKS-TIPO-LJ                            
624600        MOVE 010201                 TO WKS-CODIGO-LJ                          
624800        STRING "EL ARCHIVO SEMANAL DE TARJETAS CON FECHA "                    
625000               WS-ETIQ-FECHA " DIFIERE EN IMP. DE "                           
625200               "CARGOS EN MOVS " WS-CARGOS                                    
625400               " VS IMP. DE CARGOS EN TRAILER "                               
625600               WKS-MOVTBINT-TOTBRUTO                                          
625800               DELIMITED BY SIZE INTO TEXTO-LJ                                
626000               PERFORM 00000000-LLAMA-DISPLAY-STRING.                         
626200                                                                              
626400 50034700-AGREGA-MSG-50.                                                      
626420     IF WS-PROC-TAR                                                           
626440        MOVE 93   TO ORDENADO-TB-CAJA                                         
626460     ELSE                                                                     
626480        MOVE 21   TO ORDENADO-TB-CAJA.                                        
626600     MOVE 50      TO ORDENADO-TB-CLAVE.                                       
626800     MOVE 7       TO ORDENADO-TB-PRIORIDAD.                                   
627000     MOVE 2       TO REG-ORDENADO-TR.                                         
627200     ADD  1       TO WS-LLAVE-ORDCM.                                          
627400     WRITE REG-ORDENADO INVALID KEY                                           
627600           MOVE "E"               TO WKS-TIPO-LJ                              
627800           MOVE 020801            TO WKS-CODIGO-LJ                            
628000           STRING "ERROR AL GRABAR REGISTRO CON CLAVE 50 "                    
628200                  "EN EL ORDENADO-CM "                                        
628400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
628600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
628800           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
629000     MOVE LOW-VALUES              TO REG-ORDENADO.                            
629200                                                                              
629400 50034800-AGREGA-MSG-12.                                                      
629420     IF WS-PROC-TAR                                                           
629440        MOVE 93   TO ORDENADO-TB-CAJA                                         
629460     ELSE                                                                     
629480        MOVE 21   TO ORDENADO-TB-CAJA.                                        
629600     MOVE 12      TO ORDENADO-TB-CLAVE.                                       
629800     MOVE 8       TO ORDENADO-TB-PRIORIDAD.                                   
630000     MOVE 2       TO REG-ORDENADO-TR.                                         
630200     ADD  1       TO WS-LLAVE-ORDCM.                                          
630400     WRITE REG-ORDENADO INVALID KEY                                           
630600           MOVE "E"               TO WKS-TIPO-LJ                              
630800           MOVE 020801            TO WKS-CODIGO-LJ                            
631000           STRING "ERROR AL GRABAR REGISTRO CON CLAVE 12 "                    
631200                  "EN EL ORDENADO-CM "                                        
631400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
631600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
631800           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
632000     MOVE LOW-VALUES              TO REG-ORDENADO.                            
632200                                                                              
638000 50035000-PROCESO-TARJETA.                                                    
638200**************************                                                    
638250                                                                              
638300     IF WS-B02-DECOM-S111 = 0                                                 
638400        MOVE WS-ULTFECHA-TAR      TO WKS-FEC-A-PROYECTAR-AAMD                 
638600        MOVE 3                    TO WKS-ARCH-A-DISP                          
638800        PERFORM 50031700-PROYECTA-FECHA                                       
639000        MOVE WKS-FEC-PROYECTADA-AAMD                                          
639002                                  TO WS-ULTFECHA-TAR                          
639005                                     WS-FECHA-EAS-TAR                         
639200        MOVE 0                    TO WKS-FILE-ERROR-VA                        
639205        MOVE 1                    TO WS-EAS-TAR                               
639400                                                                              
639600        PERFORM 50035100-METO-ARCHS-TARJ                                      
639800                UNTIL WS-ULTFECHA-TAR NOT < WS-FECHA-LIN OR                   
640000                      WKS-FILE-CON-ERROR.                                     
640010                                                                              
640020*INI EAS FASE 5                                                               
640030     MOVE WS-ULTFECHA-EAS         TO WKS-FEC-A-PROYECTAR-AAMD.                
640040     MOVE 1                       TO WKS-ARCH-A-DISP.                         
640050     PERFORM 50031700-PROYECTA-FECHA.                                         
640060     MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-EAS                          
640070                                     WS-FECHA-EAS-TAR                         
640080     MOVE 0                       TO WKS-FILE-ERROR-VA.                       
640090     MOVE 2                       TO WS-EAS-TAR.                              
640100                                                                              
640110     PERFORM 50035100-METO-ARCHS-TARJ                                         
640120             UNTIL WS-ULTFECHA-EAS NOT < WS-FECHA-LIN OR                      
640130                   WKS-FILE-CON-ERROR.                                        
640140*FIN EAS FASE 5                                                               
640200                                                                              
640400 50035100-METO-ARCHS-TARJ.                                                    
640600     IF (WS-ULTFECHA-TAR        > WS-ULTFECHA-TARSEM   AND                    
640800         WS-ULTFECHA-TARSEM NOT = WS-ULT-ARCH-APLI(4)  AND                    
640805         WS-PROC-TAR) OR                                                      
640810        (WS-ULTFECHA-EAS        > WS-ULTFECHA-EASSEM   AND                    
640815         WS-ULTFECHA-EASSEM NOT = WS-ULT-ARCH-APLI(24) AND                    
640820         WS-PROC-EAS)                                                         
641000        MOVE "E"                  TO WKS-TIPO-LJ                              
641200        MOVE 020601               TO WKS-CODIGO-LJ                            
641400        STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                     
641600               WS-FECHA-EAS-TAR " ES MAYOR QUE EL ARCHIVO "                   
641800               "DE TARJETAS SEMANAL NO DISPERSADO "                           
642000               DELIMITED BY SIZE INTO TEXTO-LJ                                
642200               PERFORM 00000000-LLAMA-DISPLAY-STRING                          
642400        MOVE 1                    TO WKS-FILE-ERROR-VA.                       
642600                                                                              
642800     IF WKS-FILE-SIN-ERROR                                                    
643000        IF (WS-ULTFECHA-TAR > WKS-PROXFECHA-TARSEM AND                        
643005            WS-PROC-TAR) OR                                                   
643010           (WS-ULTFECHA-EAS > WKS-PROXFECHA-TARSEM AND                        
643015            WS-PROC-EAS)                                                      
643200        MOVE "E"                  TO WKS-TIPO-LJ                              
643400        MOVE 020601               TO WKS-CODIGO-LJ                            
643600        STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                     
643800               WS-FECHA-EAS-TAR " ES MAYOR QUE EL PROXIMO "                   
644000               "ARCHIVO DE TARJETAS SEMANAL "                                 
644200               DELIMITED BY SIZE INTO TEXTO-LJ                                
644400               PERFORM 00000000-LLAMA-DISPLAY-STRING                          
644600        MOVE 1                    TO WKS-FILE-ERROR-VA.                       
644800                                                                              
645000     IF WKS-FILE-SIN-ERROR                                                    
645005        MOVE 0             TO WS-CARGOS WS-ABONOS                             
645010        MOVE 0             TO WKS-EOF-TARJ-VA                                 
645015        CHANGE ATTRIBUTE NEWFILE OF MOVTBINT TO VALUE FALSE                   
645020        IF WS-PROC-TAR                                                        
645200           MOVE WS-ULTFECHA-TAR      TO W-ETIQ-TB-FECHA                       
645400           MOVE WS-NODO              TO W-ETIQ-TB-CSI                         
645600           SET  MOVTBINT(TITLE)      TO W-ETIQ-MOVTBINTNVA                    
645605           MOVE W-ETIQ-MOVTBINTNVA   TO WS-ETIQ-EAS-TAR                       
645610           MOVE W-ETIQ-TB-FECHA      TO WS-ETIQ-FECHA                         
645615        ELSE                                                                  
645620           MOVE WS-ULTFECHA-EAS      TO W-ETIQ-TBE-FECHA                      
645625           MOVE WS-NODO              TO W-ETIQ-TBE-CSI                        
645627           MOVE 1                    TO WKS-FLAG-PROCTJEAS                    
645630           SET MOVTBINT(TITLE)       TO W-ETIQ-MOVTBINTNVAE                   
645635           MOVE W-ETIQ-MOVTBINTNVAE  TO WS-ETIQ-EAS-TAR                       
645640           MOVE W-ETIQ-TBE-FECHA     TO WS-ETIQ-FECHA.                        
645800                                                                              
646200                                                                              
646400     IF WKS-FILE-SIN-ERROR                                                    
646600        IF ATTRIBUTE RESIDENT OF MOVTBINT IS = VALUE TRUE                     
646800           OPEN INPUT MOVTBINT                                                
647000           PERFORM 50035200-VALIDA-HDRYTRL-TARJ                               
647200        ELSE                                                                  
648600           PERFORM 50035110-ALARMA-TAR                                        
648800           MOVE 1                 TO WKS-FILE-ERROR-VA.                       
649000                                                                              
649200     IF WKS-FILE-SIN-ERROR                                                    
649202        IF WS-PROC-TAR                                                        
649400           ADD  1                   TO WS-ARCH-IND                            
649600           MOVE 2                   TO WS-ARCH-MACC (WS-ARCH-IND)             
649800           MOVE WS-ULTFECHA-TAR     TO WS-ARCH-FECHA(WS-ARCH-IND)             
649810        ELSE                                                                  
649820*INI EAS FASE 3                                                               
649830           MOVE 1                   TO WKS-HAY-ARCH-EAS                       
649840           ADD  1                   TO WS-ARCH-IND                            
649860           MOVE 7                   TO WS-ARCH-MACC (WS-ARCH-IND)             
649880           MOVE WS-ULTFECHA-EAS     TO WS-ARCH-FECHA(WS-ARCH-IND).            
649900*FIN EAS FASE 3                                                               
650000                                                                              
650200     IF WKS-FILE-SIN-ERROR                                                    
650400        MOVE WS-ETIQ-EAS-TAR          TO WKS-ARCH-EN-PROCESO                  
650600        MOVE 1                       TO WKS-REG-ACTUAL                        
650800        MOVE ATTRIBUTE LASTRECORD OF MOVTBINT TO WKS-REG-ULTIMO               
651000        PERFORM 50035300-LEO-ARCH-TARJ UNTIL WKS-EOF-TARJ                     
651200        CLOSE MOVTBINT WITH SAVE                                              
651202        IF WS-PROC-TAR                                                        
651400           MOVE WS-ULTFECHA-TAR        TO WS-ULT-ARCH-APLI(2)                 
651600           MOVE WS-ULTFECHA-TAR        TO WKS-FEC-A-PROYECTAR-AAMD            
651800           MOVE 3                      TO WKS-ARCH-A-DISP                     
652000           PERFORM 50031700-PROYECTA-FECHA                                    
652100           MOVE 1                      TO  WKS-FLAG-PROYFEC                   
652200           MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-TAR                    
652201        ELSE                                                                  
652202           MOVE WS-ULTFECHA-EAS        TO WS-ULT-ARCH-APLI(23)                
652203           MOVE WS-ULTFECHA-EAS        TO WKS-FEC-A-PROYECTAR-AAMD            
652204           MOVE 1                      TO WKS-ARCH-A-DISP                     
652205           PERFORM 50031700-PROYECTA-FECHA                                    
652206           MOVE WKS-FEC-PROYECTADA-AAMD TO WS-ULTFECHA-EAS .                  
652210                                                                              
652220 50035110-ALARMA-TAR.                                                         
652230     IF (WS-FECHA-TAR-ANT < WS-ULTFECHA-TAR AND WS-PROC-TAR) OR               
652232        (WS-FECHA-TAR-ANT < WS-ULTFECHA-EAS AND WS-PROC-EAS) OR               
652235        WKS-DISP-S087 = 1                                                     
652240         MOVE "E"                 TO WKS-TIPO-LJ                              
652250     ELSE                                                                     
652260         MOVE "O"                 TO WKS-TIPO-LJ.                             
652270     MOVE 020801                  TO WKS-CODIGO-LJ.                           
652280     STRING "SE INTENTA DISPERSAR EL ARCHIVO "                                
652290             WS-ETIQ-EAS-TAR                                                  
652300             " Y NO ESTA RESIDENTE "                                          
652310     DELIMITED BY SIZE INTO TEXTO-LJ                                          
652320     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
652400                                                                              
652600 50035200-VALIDA-HDRYTRL-TARJ.                                                
652800     PERFORM 50035210-VALIDA-HDR-TARJ.                                        
653000     IF WKS-FILE-SIN-ERROR                                                    
653200        PERFORM 50035220-VALIDA-TRL-TARJ.                                     
653400     IF WKS-FILE-SIN-ERROR                                                    
653600        MOVE "E"          TO WKS-TIPO-LJ                                      
653800        MOVE 020801       TO WKS-CODIGO-LJ                                    
654000        STRING "PROCESO ARCHIVO " WS-ETIQ-EAS-TAR                             
654200               DELIMITED BY SIZE INTO TEXTO-LJ                                
654400        PERFORM 00000000-LLAMA-DISPLAY-STRING.                                
654600                                                                              
654800 50035210-VALIDA-HDR-TARJ.                                                    
655000     MOVE 1              TO WS-LLAVE-TBINT.                                   
655200     READ MOVTBINT INTO WS-REG-MOVTBINTER INVALID KEY                         
655400          MOVE "E"       TO WKS-TIPO-LJ                                       
655600          MOVE 020801    TO WKS-CODIGO-LJ                                     
655800          STRING "ARCHIVO " WS-ETIQ-EAS-TAR                                   
656000                 " NO TRAE REGISTROS "                                        
656200                 DELIMITED BY SIZE INTO TEXTO-LJ                              
656400          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
656600          MOVE 1         TO WKS-FILE-ERROR-VA.                                
656800                                                                              
657000     IF WKS-FILE-SIN-ERROR                                                    
657200        IF MOVTBINT-INDICADOR-NVO = "S"                                       
657400           MOVE "O"             TO WKS-TIPO-LJ                                
657600           MOVE 010401          TO WKS-CODIGO-LJ                              
657800           STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                  
658000                  WS-ETIQ-EAS-TAR   " TRAE INDICADOR DE SEMANAL"              
658200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
658400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
658600           MOVE 1         TO WKS-FILE-ERROR-VA                                
658800        ELSE                                                                  
659000        IF (MOVTBINT-NUM-SYS-NVO NOT = "S111" AND WS-PROC-TAR) OR             
659100           (MOVTBINT-NUM-SYS-NVO NOT = "1751" AND WS-PROC-EAS)                
659200           MOVE "O"             TO WKS-TIPO-LJ                                
659400           MOVE 010401          TO WKS-CODIGO-LJ                              
659600           STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                  
659800                  WS-ETIQ-EAS-TAR   " NO PROVIENE DEL S111"                   
660000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
660200           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
660400           MOVE 1         TO WKS-FILE-ERROR-VA                                
660600        ELSE                                                                  
660800        IF ((MOVTBINT-TAR-DIA-NVO NOT = W-ETIQ-TB-DIA   OR                    
661000             MOVTBINT-TAR-MES-NVO NOT = W-ETIQ-TB-MES   OR                    
661200             MOVTBINT-TAR-ANO-NVO NOT = W-ETIQ-TB-ANO)  AND                   
661205             WS-PROC-TAR) OR                                                  
661210           ((MOVTBINT-TAR-DIA-NVO NOT = W-ETIQ-TBE-DIA  OR                    
661215             MOVTBINT-TAR-MES-NVO NOT = W-ETIQ-TBE-MES  OR                    
661220             MOVTBINT-TAR-ANO-NVO NOT = W-ETIQ-TBE-ANO) AND                   
661225             WS-PROC-EAS)                                                     
661400           MOVE "O"              TO WKS-TIPO-LJ                               
661600           MOVE 010401           TO WKS-CODIGO-LJ                             
661800           STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                  
662000                  WS-ETIQ-EAS-TAR " TRAE INTERNAMENTE LA "                    
662200                  "FECHA " MOVTBINT-FECHA-NVO-TAR                             
662400                  " Y NO CORRESPONDE A LA FECHA EXTERNA DEL "                 
662600                  " ARCHIVO " WS-ETIQ-FECHA                                   
662800                  "LLAMAR AL RESPONSABLE DE TARJETAS "                        
663000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
663200           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
663400           MOVE 1         TO WKS-FILE-ERROR-VA                                
663600        ELSE                                                                  
663800        IF MOVTBINT-CSI-NVO NOT = WS-NODO                                     
664000           MOVE "O"              TO WKS-TIPO-LJ                               
664200           MOVE 010401           TO WKS-CODIGO-LJ                             
664400           STRING "EL CSI INTERNO DEL ARCHIVO DE TARJETAS CON "               
664600                  "FECHA " WS-ETIQ-EAS-TAR " TRAE EL VALOR "                  
664800                  MOVTBINT-CSI-NVO " Y NO CORRESPONDE AL CSI "                
665000                  "DONDE SE VA A DISPERSAR "                                  
665200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
665400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
665600           MOVE 1         TO WKS-FILE-ERROR-VA.                               
665800                                                                              
666000 50035220-VALIDA-TRL-TARJ.                                                    
666200     MOVE ATTRIBUTE LASTRECORD OF MOVTBINT TO WS-LLAVE-TBINT.                 
666400     ADD  1                                TO WS-LLAVE-TBINT.                 
666600     READ MOVTBINT INTO WS-REG-MOVTBINTER INVALID KEY                         
666800          MOVE "E"                TO WKS-TIPO-LJ                              
667000          MOVE 020801             TO WKS-CODIGO-LJ                            
667200          STRING "ARCHIVO " WS-ETIQ-EAS-TAR " NO TRAE REG TRL "               
667400                 DELIMITED BY SIZE INTO TEXTO-LJ                              
667600          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
667800          MOVE 1          TO WKS-FILE-ERROR-VA.                               
668000                                                                              
668200     IF WKS-FILE-SIN-ERROR                                                    
668400        IF MOVTBINT-TTREG = "T"                                               
668600           IF (MOVTBINT-NUMREG NOT = WS-LLAVE-TBINT - 2)                      
668800              COMPUTE    WS-REG-TRAILER = MOVTBINT-NUMREG                     
669000              COMPUTE    WS-REG-FISICOS = WS-LLAVE-TBINT - 2                  
669200              MOVE WS-REG-TRAILER         TO FILE-OP-TRAILER                  
669400              MOVE WS-REG-FISICOS         TO FILE-OP-ARCHIVO                  
669600              MOVE "E"                    TO WKS-TIPO-LJ                      
669800              MOVE 020801                 TO WKS-CODIGO-LJ                    
670000              STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "               
670200                     WS-ETIQ-EAS-TAR " DIFIERE EN NUM. DE "                   
670400                     "REGS. FISICOS " WS-REG-FISICOS                          
670600                     " VS NUM. REGS. EN TRAILER " WS-REG-TRAILER              
670800                     " LLAMAR AL RESPONSABLE DE TARJETAS "                    
671000                     DELIMITED BY SIZE INTO TEXTO-LJ                          
671200              PERFORM 00000000-LLAMA-DISPLAY-STRING                           
671400*             MOVE 1                      TO WKS-FILE-ERROR-VA                
671410              MOVE 1      TO WS-LLAVE-TBINT                                   
671600           ELSE                                                               
671800              MOVE 1      TO WS-LLAVE-TBINT                                   
672000        ELSE                                                                  
672200           MOVE "O"               TO WKS-TIPO-LJ                              
672400           MOVE 010401            TO WKS-CODIGO-LJ                            
672600           STRING "EL ARCHIVO DE TARJETAS DIARIO CON FECHA "                  
672800                  WS-ETIQ-EAS-TAR " VIENE SIN TRAILER "                       
673000                  " LLAMAR AL RESPONSABLE DE TARJETAS "                       
673200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
673400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
673600           MOVE 1                 TO WKS-FILE-ERROR-VA.                       
673800                                                                              
674000 50035300-LEO-ARCH-TARJ.                                                      
674200     PERFORM 50035400-LEO-REG-TARJ.                                           
674400                                                                              
674600     IF MOVTBINT-TTREG = "T"                                                  
674800        MOVE 1    TO WKS-EXISTE-ORD-X-DISPER                                  
675000                     WKS-EOF-TARJ-VA                                          
675200        PERFORM 50035600-VERIFICA-TRL-TARJ                                    
675400     ELSE                                                                     
675600        PERFORM 50035700-PONE-REG-TAR-EN-ORDCM.                               
675800                                                                              
676000 50035400-LEO-REG-TARJ.                                                       
676200     ADD 1                        TO WS-LLAVE-TBINT.                          
676400     MOVE WS-LLAVE-TBINT          TO WKS-REG-ACTUAL.                          
676600     READ MOVTBINT INTO WS-REG-MOVTBINTER  INVALID KEY                        
676800          MOVE "E"                TO WKS-TIPO-LJ                              
677000          MOVE 020801             TO WKS-CODIGO-LJ                            
677200          STRING "ERROR AL LEER REGISTRO DEL ARCHIVO "                        
677400                 WS-ETIQ-EAS-TAR                                              
677600                 DELIMITED BY SIZE INTO TEXTO-LJ                              
677800          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
678000          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
678200                                                                              
678400 50035600-VERIFICA-TRL-TARJ.                                                  
678600     IF MOVTBINT-TOTBRUTO NOT = (WS-ABONOS + WS-CARGOS)                       
678800        COMPUTE WS-IMP-FISICOS = WS-ABONOS + WS-CARGOS                        
679000        MOVE MOVTBINT-TOTBRUTO    TO WKS-MOVTBINT-TOTBRUTO                    
679200        MOVE "E"                  TO WKS-TIPO-LJ                              
679400        MOVE 010201               TO WKS-CODIGO-LJ                            
679600        STRING "EL ARCHIVO DE TARJETAS CON FECHA "                            
679800               WS-ETIQ-FECHA " DIFIERE EN IMP. DE "                           
680000               "CARGOS + ABONOS EN MOVS " WS-IMP-FISICOS                      
680200               " VS IMP. DE CARGOS + ABONOS EN TRAILER "                      
680400               WKS-MOVTBINT-TOTBRUTO                                          
680600               DELIMITED BY SIZE INTO TEXTO-LJ                                
680800        PERFORM 00000000-LLAMA-DISPLAY-STRING.                                
681000                                                                              
681200 50035700-PONE-REG-TAR-EN-ORDCM.                                              
681400     IF NOT MOVTINT-BIN-CTAMAE-DLS                                            
681600        MOVE 1         TO WKS-MOVTO-A-CTAMAE-VA                               
681800     ELSE                                                                     
682200        MOVE 2         TO WKS-MOVTO-A-CTAMAE-VA.                              
682800     MOVE MOVTBINT-NUMTB          TO ORDENADO-TB-NUMTB.                       
683000     MOVE 66                      TO ORDENADO-TB-PRODUCTO                     
683200*    IF NOT MOVTINT-BIN-CTAMAE-DLS                                            
683400*       MOVE 6                    TO ORDENADO-TB-INSTRUM                      
683600*       MOVE 1                    TO ORDENADO-TB-MONEDA                       
683800*    ELSE                                                                     
684000*       MOVE 5                    TO ORDENADO-TB-INSTRUM                      
684200*       IF WKS-MOVTO-A-CTAMAEDLS-EN-MN                                        
684400*          MOVE 1                 TO ORDENADO-TB-MONEDA                       
684600*       ELSE                                                                  
684800*          MOVE 5                 TO ORDENADO-TB-MONEDA.                      
685000     MOVE MOVTBINT-REFNAL-NVO     TO ORDENADO-TB-REFDOCTO.                    
685200     MOVE MOVTBINT-SUCURSAL-NVO   TO ORDENADO-TB-SUCPROM.                     
685400     MOVE 0                       TO ORDENADO-TB-CTACHEQ.                     
685600     MOVE MOVTBINT-IMPBRUTO-NVO   TO ORDENADO-TB-IMPORTE.                     
685700*INI EAS FASE 3                                                               
685800*    IF MOVTBINT-CVETRANS-NVO = 99                                            
686000        IF MOVTBINT-CVES-D-COMIS                                              
686200           MOVE 0                 TO ORDENADO-TB-IMPORTE.                     
686300*FIN EAS FASE 3                                                               
686400     MOVE 03                      TO ORDENADO-TB-ORIGEN.                      
686600     ADD  01                      TO ORDENADO-TB-SEQ.                         
686800     MOVE MOVTBINT-NEGPOB-NVO     TO ORDENADO-TB-LEYENDA.                     
687000     MOVE 342                     TO ORDENADO-TB-SUCBANCO.                    
687200*    MOVE 93                      TO ORDENADO-TB-CAJA.                        
687220*INI EAS FASE 3                                                               
687240     IF MOVTBINT-ORIGEAS-NVO = 2                                              
687260        MOVE 21                   TO ORDENADO-TB-CAJA                         
687280     ELSE                                                                     
687300        MOVE 93                   TO ORDENADO-TB-CAJA.                        
687320     MOVE MOVTBINT-ORIGEAS-NVO    TO ORDENADO-TB-ORI-EAS.                     
687340     MOVE MOVTBINT-IMPTAUT-NVO    TO ORDENADO-TB-IMP-AUT.                     
687360*FIN EAS FASE 3                                                               
687400     MOVE 0                       TO ORDENADO-TB-CAUSA.                       
687600     MOVE MOVTBINT-REFINTNAL-NVO  TO ORDENADO-TB-REFINTNAL.                   
687800     IF WKS-MOVTO-A-CTAMAEMN-EN-MN                                            
688000        MOVE MOVTBINT-FECHMOVAMD-NVO TO WKS-FEC-CONV-AAMD                     
688200        PERFORM 00000000-CONV-FEC-AMD-DE-6-A-8                                
688400        MOVE WKS-FEC-CONV-AAMD    TO ORDENADO-TB-FECHA                        
688600     ELSE                                                                     
688800        MOVE 0                    TO ORDENADO-TB-FECHA.                       
689000*    SI LAS CLAVES 584,585,613 Y 615 LLEGAN FVALOR AL P010, NO  SE            
689200*    ACUMULA LA COMISION EN EL HISTORICO EN EL  P010  Y  EL   P105            
689400*    TAMPOCO ACUMULA POR SER FECHA VALOR, POR  LO  QUE  SE   ENVIA            
689600*    CON FECHA DE LINEA PARA QUE LO ACUMULE EL P105.                          
689605*    SE AGREGAN LAS CLAVES 700 Y 701                                          
689800*    IF MOVTBINT-CVES-D-COMIS OR MOVTBINT-REF-SECLIN = 003024                 
689900     IF MOVTBINT-CVES-D-COMIS OR MOVTBINT-CVETRANS-NVO = 3024                 
690000        MOVE WS-FECHA-LIN         TO ORDENADO-TB-FECHA.                       
690200     MOVE WKS-MOVTO-A-CTAMAE-VA   TO ORDENADO-TB-CTAMAE-VA.                   
690220*INI EAS FASE 3                                                               
690240     IF WKS-SI-USA-TIPO-AUT                                                   
690260        MOVE MOVTBINT-CVEAUT-NVO  TO ORDENADO-TB-TIP-AUT.                     
690280     MOVE MOVTBINT-CVETRANS-NVO TO ORDENADO-TB-CLAVE.                         
690400*    PERFORM 50035720-ASIGNA-CLAVES.                                          
690600     PERFORM 50035730-ASIGNA-PRIORIDADES.                                     
690700*FIN EAS FASE 3                                                               
690800                                                                              
691000     IF ORDENADO-TB-CLAVE > 1999 AND < 3000                                   
691200        MOVE 3                    TO ORDENADO-TB-INDLEY                       
691400     ELSE                                                                     
691600        MOVE 0                    TO ORDENADO-TB-INDLEY.                      
691800                                                                              
692000     IF WKS-EM-CTO-DE-TARJETAS                                                
692200        MOVE MOVTBINT-NUM-CTE-CM  TO ORDENADO-TB-NUMCONT                      
692300        MOVE 6                    TO S422-78-CTA-CVEINST                      
692400     ELSE                                                                     
692600        PERFORM 50035750-BUSCA-CTO-EN-CLIENTES                                
692700        PERFORM 50035740-BUSCA-CTO-EN-L040LIGA                                
692800        IF ORDENADO-TB-NUMCONT = 999999999999                                 
693000           IF WKS-EM-CTO-DE-TAR-S016                                          
693200              MOVE MOVTBINT-NUM-CTE-CM    TO ORDENADO-TB-NUMCONT              
693400           ELSE                                                               
693600              MOVE 0                      TO ORDENADO-TB-NUMCONT.             
693610                                                                              
693620     IF NOT MOVTINT-BIN-CTAMAE-DLS                                            
693630        MOVE S422-78-CTA-CVEINST  TO ORDENADO-TB-INSTRUM                      
693640        MOVE 1                    TO ORDENADO-TB-MONEDA                       
693650     ELSE                                                                     
693652*INI BSR. PERFILES DOLARES                                                    
693660        MOVE 15                   TO ORDENADO-TB-INSTRUM                      
693680        MOVE 1                    TO ORDENADO-TB-MONEDA.                      
693690*FIN BSR. PERFILES DOLARES                                                    
693700*INI EAS FASE 3                                                               
693720*     IF ORDENADO-TB-ORI-EAS = 2                                              
693740*        COMPUTE WS-ARCH-IND4 = WS-ARCH-IND                                   
693760*     ELSE                                                                    
693780*        COMPUTE WS-ARCH-IND4 = WS-ARCH-IND - 1.                              
693800                                                                              
694000     IF ORD-CVE-ABONOS OR ORD-CVE-ABOAUT                                      
694200        ADD MOVTBINT-IMPBRUTO-NVO TO WS-ARCH-ABOCON(WS-ARCH-IND)              
694400                                     WS-ABONOS                                
694600                                     WS-GLO-IMPREG                            
694800     ELSE IF ORDENADO-TB-CLAVE = 526                                          
695000        ADD MOVTBINT-IMPBRUTO-NVO TO WS-ARCH-CARNCON(WS-ARCH-IND)             
695100        ADD MOVTBINT-IMPTAUT-NVO  TO WS-ARCH-CARNCON(WS-ARCH-IND)             
695200     ELSE IF ORDENADO-TB-CLAVE = 527                                          
695400        ADD MOVTBINT-IMPBRUTO-NVO TO WS-ARCH-ABONCON(WS-ARCH-IND)             
695500        ADD MOVTBINT-IMPTAUT-NVO  TO WS-ARCH-ABONCON(WS-ARCH-IND)             
695600     ELSE IF ORDENADO-TB-CLAVE = 577                                          
695800        ADD MOVTBINT-IMPBRUTO-NVO TO                                          
695900                                  WS-ARCH-CARNCON(WS-ARCH-IND)                
696000                                  WS-CARGOS                                   
696050        ADD MOVTBINT-IMPTAUT-NVO  TO                                          
696100                                  WS-ARCH-CARNCON(WS-ARCH-IND)                
696150                                  WS-CARGOS                                   
696200     ELSE IF ORD-CVE-D-COMIS                                                  
696400        NEXT SENTENCE                                                         
696600     ELSE                                                                     
696800        ADD MOVTBINT-IMPBRUTO-NVO TO WS-ARCH-CARCON(WS-ARCH-IND)              
697000                                     WS-CARGOS                                
697200                                     WS-GLO-IMPREG                            
697204        ADD MOVTBINT-IMPTAUT-NVO TO WS-ARCH-ABONCON(WS-ARCH-IND).             
697226                                                                              
697228*INI BSR. MONEDA ORIGEN                                                       
697230*    IF MOVTBINT-REF-SECLIN = 002131 OR 002132                                
697232     IF MOVTBINT-CVETRANS-NVO = 2131 OR 2132                                  
697234*FIN EAS FASE 3                                                               
697236        MOVE MOVTBINT-IMPDLLS-VNO   TO ORDENADO-TB-INTIMP-DLLS                
697238        MOVE MOVTBINT-CODMONEDA-NVO TO                                        
697240                                     ORDENADO-TB-INTCODIGO-MONEDA             
697242     ELSE                                                                     
697244        MOVE 0                      TO ORDENADO-TB-INTIMP-DLLS                
697246                                     ORDENADO-TB-INTCODIGO-MONEDA.            
697248*FIN BSR. MONEDA ORIGEN                                                       
697250     MOVE MOVTBINT-ID-NEGOCIO       TO ORDENADO-TB-ID-NEGOCIO.                
697255                                                                              
697260*INI-STEFANINI TIPO DE CAMBIO                                                 
697265*    IF MOVTBINT-REF-SECLIN = 002131 OR 002132                                
697266     IF MOVTBINT-CVETRANS-NVO = 2131 OR 2132                                  
697270        MOVE MOVTBINT-TC-BANXICO    TO ORDENADO-TB-TC-BANXICO                 
697275        MOVE MOVTBINT-MARK-UP-EMISOR TO ORDENADO-TB-MARK-UP-EMI               
697280        MOVE MOVTBINT-TC-VALMER     TO ORDENADO-TB-TC-VALMER                  
697285     ELSE                                                                     
697290        MOVE 0                      TO ORDENADO-TB-TC-BANXICO                 
697295                                       ORDENADO-TB-MARK-UP-EMI                
697300                                       ORDENADO-TB-TC-VALMER.                 
697305*FIN-STEFANINI TIPO DE CAMBIO                                                 
697315*INI EAS FASE 4                                                               
697325     MOVE MOVTBINT-INSTITUCION-ID-NVO   TO                                    
697335          ORDENADO-TB-INSTITUCION-ID    .                                     
697345     MOVE MOVTBINT-INTAPLICACION-ID-NVO TO                                    
697355          ORDENADO-TB-INTAPLICACION-ID  .                                     
697365     MOVE MOVTBINT-INTAUTH-CODE-NVO     TO                                    
697375          ORDENADO-TB-INTAUTH-CODE      .                                     
697385*FIN EAS FASE 4                                                               
697395                                                                              
697400     ADD  1      TO WS-GLO-NUMREG.                                            
697600                                                                              
697800     PERFORM 50035710-GRABA-S111-EN-ORDCM.                                    
698000                                                                              
698200 50035710-GRABA-S111-EN-ORDCM.                                                
698400     MOVE "2"             TO REG-ORDENADO-TR.                                 
698600     ADD  1               TO WS-LLAVE-ORDCM.                                  
698800     WRITE REG-ORDENADO INVALID KEY                                           
699000           MOVE "E"                TO WKS-TIPO-LJ                             
699200           MOVE 020801             TO WKS-CODIGO-LJ                           
699400           STRING "ERROR AL GRABAR REGISTRO DEL ARCHIVO "                     
699600                  WS-ETIQ-EAS-TAR " EN EL ORDENADO-CM "                       
699800                  DELIMITED BY SIZE INTO TEXTO-LJ                             
700000           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
700200           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
700400     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
700600                                                                              
700800 50035720-ASIGNA-CLAVES.                                                      
700820*    SE INCLUYE EL TIPO DE AUTORIZACION QUE VIENE DE TARJETAS                 
700840*    PARA QUE SEA ENVIADO AL PASO P010 MEDIANTE EL FORMATO                    
700860*    VARIABLE "uW".                                                           
700870     IF WKS-SI-USA-TIPO-AUT                                                   
700880        MOVE MOVTBINT-CVEAUT-NVO  TO ORDENADO-TB-TIP-AUT.                     
701000     IF MOVTBINT-CVETRANS-NVO = 13                                            
701200        MOVE 526                TO ORDENADO-TB-CLAVE                          
701400     ELSE IF MOVTBINT-CVETRANS-NVO = 14                                       
701600        MOVE 527                TO ORDENADO-TB-CLAVE                          
701800     ELSE IF MOVTBINT-CVETRANS-NVO = 15                                       
702000        MOVE 577                TO ORDENADO-TB-CLAVE                          
702200     ELSE IF MOVTBINT-CVETRANS-NVO = 62                                       
702210        IF MOVTBINT-REF-SECLIN = 2131                                         
702212           MOVE 2131            TO ORDENADO-TB-CLAVE                          
702400        ELSE                                                                  
702600           MOVE 2020            TO ORDENADO-TB-CLAVE                          
703600     ELSE IF MOVTBINT-CVETRANS-NVO = 66 OR 68                                 
703605*INI BSR. MONEDA ORIGEN 2                                                     
703610        IF MOVTBINT-CVETRANS-NVO = 68 AND                                     
703615                                MOVTBINT-REF-SECLIN = 2132                    
703620           MOVE 2132            TO ORDENADO-TB-CLAVE                          
703800        ELSE                                                                  
703805*FIN BSR. MONEDA ORIGEN 2                                                     
704000           MOVE 2018            TO ORDENADO-TB-CLAVE                          
705000     ELSE IF MOVTBINT-CVETRANS-NVO = 72                                       
705200        IF WKS-MOVTO-A-CTAMAEMN-EN-MN                                         
705400           MOVE 2017            TO ORDENADO-TB-CLAVE                          
705600        ELSE                                                                  
705800           MOVE 0               TO ORDENADO-TB-CLAVE                          
706000     ELSE IF MOVTBINT-CVETRANS-NVO = 30                                       
706400           MOVE 1014            TO ORDENADO-TB-CLAVE                          
707400     ELSE IF MOVTBINT-CVETRANS-NVO = 40                                       
707600        IF WKS-MOVTO-A-CTAMAEMN-EN-MN                                         
707800           MOVE 1015            TO ORDENADO-TB-CLAVE                          
708000        ELSE                                                                  
708200           MOVE 0               TO ORDENADO-TB-CLAVE                          
708400     ELSE IF MOVTBINT-CVETRANS-NVO = 99                                       
708420*       ANTERIORMENTE (ENE 2004 O - ) SOLO  SE  PERMITIAN  RECIBIR            
708440*       COMO CVE 99 LOS  SIGUIENTES  TIPOS  DE  CLAVES  QUE  ESTAN            
708460*       COMENTADAS, DE  AHORA  EN  ADELANTE  SE  PEERMITE  RECIBIR            
708480*       CUALQUIER CLAVE EN REF-SECLIN CON UN 99 EN LA CVE ORI.                
708600*       IF MOVTBINT-CVES-D-COMIS OR MOVTBINT-CVES-D-CGOEXT OR                 
708800*          MOVTBINT-CVES-ABOAUT                                               
709000           MOVE MOVTBINT-REF-SECLIN       TO ORDENADO-TB-CLAVE                
709200*       ELSE                                                                  
709400*          MOVE 0               TO ORDENADO-TB-CLAVE                          
709600     ELSE                                                                     
709800        MOVE 0                  TO ORDENADO-TB-CLAVE.                         
709802                                                                              
709804*INI BSR. PERFILES DOLARES                                                    
709806     IF MOVTINT-BIN-CTAMAE-DLS                                                
709808        PERFORM 50035715-ASIGNA-CLAVES-DLS.                                   
709810                                                                              
709812 50035715-ASIGNA-CLAVES-DLS.                                                  
709814     IF ORDENADO-TB-CLAVE      = 1014                                         
709816           MOVE 1195            TO ORDENADO-TB-CLAVE                          
709818     ELSE IF ORDENADO-TB-CLAVE = 1015                                         
709820           MOVE 1196            TO ORDENADO-TB-CLAVE                          
709822     ELSE IF ORDENADO-TB-CLAVE = 1021                                         
709824           MOVE 1197            TO ORDENADO-TB-CLAVE                          
709826     ELSE IF ORDENADO-TB-CLAVE = 2018                                         
709828           MOVE 2387            TO ORDENADO-TB-CLAVE                          
709830     ELSE IF ORDENADO-TB-CLAVE = 2020                                         
709832           MOVE 2388            TO ORDENADO-TB-CLAVE                          
709834     ELSE IF ORDENADO-TB-CLAVE = 2131                                         
709836           MOVE 2394            TO ORDENADO-TB-CLAVE                          
709838     ELSE IF ORDENADO-TB-CLAVE = 2132                                         
709839           MOVE 2395            TO ORDENADO-TB-CLAVE                          
709840     ELSE IF ORDENADO-TB-CLAVE = 2139                                         
709841           MOVE 2425            TO ORDENADO-TB-CLAVE                          
709842     ELSE IF ORDENADO-TB-CLAVE = 2220                                         
709844           MOVE 2405            TO ORDENADO-TB-CLAVE                          
709846     ELSE IF ORDENADO-TB-CLAVE = 2221                                         
709848           MOVE 2406            TO ORDENADO-TB-CLAVE.                         
709850*FIN BSR. PERFILES DOLARES                                                    
710000                                                                              
710200 50035730-ASIGNA-PRIORIDADES.                                                 
710210                                                                              
710212     IF WKS-FLAG-PROYFEC = 1 AND WKS-FLAG-PROCTJEAS = 1 AND                   
710214        WKS-FLAG-PROCTJSEM = 1                                                
710216        MOVE 1    TO  WKS-FLAG-PROCTJ.                                        
710218                                                                              
710220     IF MOVTBINT-CVETRANS-NVO = 577                                           
710230        MOVE 7 TO ORDENADO-TB-PRIORIDAD                                       
710240     ELSE                                                                     
710250     IF (WS-ULTFECHA-TAR > WS-ULTFECHA-TARSEM) AND                            
710255         WS-FLAG-INTERDIA                                                     
710260        IF MOVTBINT-CVES-NOCONT                                               
710270           MOVE 8  TO ORDENADO-TB-PRIORIDAD                                   
710280        ELSE                                                                  
710290           MOVE 9  TO ORDENADO-TB-PRIORIDAD                                   
710300     ELSE                                                                     
710310     IF MOVTBINT-CVES-NOCONT                                                  
710320        MOVE 2  TO ORDENADO-TB-PRIORIDAD                                      
710330     ELSE                                                                     
710340        MOVE 4  TO ORDENADO-TB-PRIORIDAD .                                    
710400*      IF MOVTBINT-CVETRANS-NVO NOT = 15                                      
710600*        ESTAMOS DISPERSANDO EL MOVSTBINTER                                   
710800*         IF WS-ULTFECHA-TAR > WS-ULTFECHA-TARSEM                             
711000*            IF MOVTBINT-CVETRANS-NVO = 13 OR 14                              
711200*               MOVE 8             TO ORDENADO-TB-PRIORIDAD                   
711400*            ELSE IF MOVTBINT-CVETRANS-NVO = 99                               
711600*               IF MOVTBINT-CVES-NOCONT                                       
711800*                  MOVE 8          TO ORDENADO-TB-PRIORIDAD                   
712000*               ELSE                                                          
712200*                  MOVE 9          TO ORDENADO-TB-PRIORIDAD                   
712400*            ELSE                                                             
712600*               MOVE 9             TO ORDENADO-TB-PRIORIDAD                   
712800*         ELSE                                                                
713000*            IF MOVTBINT-CVETRANS-NVO = 13 OR 14                              
713200*               MOVE 2             TO ORDENADO-TB-PRIORIDAD                   
713400*            ELSE IF MOVTBINT-CVETRANS-NVO = 99                               
713600*               IF MOVTBINT-CVES-NOCONT                                       
713800*                  MOVE 2          TO ORDENADO-TB-PRIORIDAD                   
714000*               ELSE                                                          
714200*                  MOVE 4          TO ORDENADO-TB-PRIORIDAD                   
714400*            ELSE                                                             
714600*               MOVE 4             TO ORDENADO-TB-PRIORIDAD                   
714800*      ELSE                                                                   
715000*        ESTAMOS DISPERSANDO EL MOVSTBINTERSEM                                
715200*         MOVE 7                   TO ORDENADO-TB-PRIORIDAD.                  
715205                                                                              
715210 50035740-BUSCA-CTO-EN-L040LIGA.                                              
715212     IF MOVTINT-BIN-TARJPREP AND                                              
715214        ORDENADO-TB-NUMCONT = 999999999999                                    
715216        PERFORM 50035745-BUSCA-CTO-EN-BD04.                                   
715218                                                                              
715220 50035745-BUSCA-CTO-EN-BD04.                                                  
715222     MOVE LOW-VALUES                 TO WS-S500-L040-ENTRADA-03               
715224                                        WS-S500-L040-SALIDA-03.               
715226     MOVE ORDENADO-TB-NUMTB          TO WS-S500-L040-03-TARJ-I.               
715228                                                                              
715230     PERFORM 20000500-S500L040-DA-CONTRATO.                                   
715232                                                                              
715234     IF W88-S500-L040-RS-OK                                                   
715236        MOVE WS-S500-L040-03-CTO-S   TO ORDENADO-TB-NUMCONT                   
715238                                        WD1-LG-CTO                            
715240        MOVE 11                      TO S422-78-CTA-CVEINST                   
715242        MOVE WS-S500-L040-03-SUCP-S  TO ORDENADO-TB-SUCPROM                   
715272     ELSE                                                                     
715274        MOVE 999999999999            TO ORDENADO-TB-NUMCONT                   
715276        MOVE "E"                     TO WKS-TIPO-LJ                           
715278        MOVE 020901                  TO WKS-CODIGO-LJ                         
715280        MOVE WS-S500-L040-RESULT     TO WS-R422-ERROR-FMT                     
715282                                        WD1-LG-ERR                            
715284        MOVE WS-S500-L040-03-TARJ-I  TO WS-R422-TARJETA                       
715286        STRING "ERROR (" WS-R422-ERROR-FMT                                    
715288               ") EN EL LLAMADO AL ENTRY POINT "                              
715290               "S500L040_DAME_CONTRATO IN S500L040LIGA "                      
715292               "AL BUSCAR LOS DATOS DE LA TARJETA "                           
715294                WS-R422-TARJETA                                               
715296               DELIMITED BY SIZE INTO TEXTO-LJ                                
715298*       PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
715300        MOVE SPACES                  TO TEXTO-LJ.                             
715400                                                                              
715600 50035750-BUSCA-CTO-EN-CLIENTES.                                              
715800     MOVE LOW-VALUES              TO E422-78-CTR-ENTRADA.                     
716000     MOVE ORDENADO-TB-NUMTB       TO E422-78-MDA-NUMERO.                      
716200     MOVE 0                       TO WD1-78-ERR WD1-78-CTO                    
716400                                     WKS-ERROR-VA                             
716410                                     WD1-LG-ERR WD1-LG-CTO                    
716600                          WD1-78-CTE WD1-07-ERR WD1-07-CTO.                   
716800                                                                              
717000     PERFORM 20000016-L422-CON-XMEDIO.                                        
717200                                                                              
717400     IF R422-78-CTR-ERROR = 0                                                 
717600        MOVE S422-78-CTA-NUM      TO WD1-78-CTO                               
717800        MOVE S422-78-CTE-NUM      TO WD1-78-CTE                               
717900        PERFORM                   50035770-SUC-PROMOTORA                      
718000        IF MOVTINT-BIN-CTASREL                                                
718200           IF MOVTINT-BIN-TARJ-SKY                                            
718300*INI EAS FASE 3                                                               
718400*             IF MOVTBINT-CVETRANS-NVO = 99 AND (                             
718600*                MOVTBINT-CVES-D-COMIS OR MOVTBINT-CVES-ABOAUT )              
718650              IF MOVTBINT-CVES-D-COMIS OR MOVTBINT-CVES-ABOAUT                
718700*FIN EAS FASE 3                                                               
718800*                POR TARJETA SKY SOLO DEBEN DE LLEGAR LAS CVES  DE            
719000*                COMIS 0584 Y 0585 Y NO SE DEBEN DE ACEPTAR CARGOS            
719200*                O ABONOS                                                     
719205*                SE AGREGAN 700 Y 701                                         
719400                 PERFORM 50035760-CTA-RELACIONADA                             
719600              ELSE                                                            
719800                 MOVE 0                   TO ORDENADO-TB-NUMCONT              
720000                 MOVE 3                   TO ORDENADO-TB-STAELIM              
720200                 MOVE 5525                TO ORDENADO-TB-NERRORELI            
720400           ELSE                                                               
720600*             LAS TARJETAS DE ACCESO TOTAL SE MIGRAN A VISA O MAST            
720800*             ERCARD CLASICAS Y A LAS CUENTAS MAESTRA OPCION CUAND            
721000*             O SE APERTURAN SE LES DA CLASICA Y SI TIENEN UN SALD            
721200*             O MAYOR A 25,000.00 SE LES ASIGNA TARJ ORO.                     
721400              IF S422-78-CTA-NUMPROD = 66 AND                                 
721600                 ( S422-78-CTA-CVEINST = 6 OR 7 OR 8 OR 11 OR                 
721610                                        12 OR 14 )                            
721800                 MOVE S422-78-CTA-NUM     TO ORDENADO-TB-NUMCONT              
722000              ELSE                                                            
722200                 PERFORM 50035760-CTA-RELACIONADA                             
722400        ELSE                                                                  
722600           MOVE S422-78-CTA-NUM   TO ORDENADO-TB-NUMCONT                      
722800     ELSE                                                                     
723000        MOVE 1                    TO WKS-ERROR-VA                             
723200        MOVE 999999999999         TO ORDENADO-TB-NUMCONT                      
723400        MOVE "E"                  TO WKS-TIPO-LJ                              
723600        MOVE 020901               TO WKS-CODIGO-LJ                            
723800        MOVE R422-78-CTR-ERROR    TO WS-R422-ERROR-FMT                        
724000                                     WD1-78-ERR                               
724200        MOVE E422-78-MDA-NUMERO   TO WS-R422-TARJETA                          
724400        STRING "ERROR (" WS-R422-ERROR-FMT                                    
724600               ") EN EL LLAMADO AL ENTRY POINT "                              
724800               "S016_L422_CON_XMEDIO AL BUSCAR LOS DATOS DE LA "              
725000               "TARJETA " WS-R422-TARJETA                                     
725200               DELIMITED BY SIZE INTO TEXTO-LJ                                
725400*       PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
725500        MOVE SPACES               TO TEXTO-LJ.                                
725600                                                                              
725800     IF ORDENADO-TB-NUMCONT NOT = MOVTBINT-NUM-CTE-CM                         
726000        MOVE 2            TO WKS-IND-ID                                       
726200        PERFORM 50031620-MUEVE-DATOS                                          
726400        PERFORM 50031630-GRABA-BACKUP-TARJ                                    
726600     ELSE                                                                     
726800        MOVE 1            TO WKS-IND-ID.                                      
727000                                                                              
727200     IF ORDENADO-TB-CLAVE < 1000                                              
727400        MOVE 1            TO WKS-IND-TM                                       
727600     ELSE                                                                     
727800        MOVE 2            TO WKS-IND-TM.                                      
728000                                                                              
728200     ADD  1       TO WKS-TD-NUM(WKS-IND-TM,WKS-IND-ID)                        
728400                     WKS-TD-NUM(3,WKS-IND-ID).                                
728600     ADD  ORDENADO-TB-IMPORTE     TO                                          
728800                     WKS-TD-IMP(WKS-IND-TM,WKS-IND-ID)                        
729000                     WKS-TD-IMP(3,WKS-IND-ID).                                
729200                                                                              
729400 50035760-CTA-RELACIONADA.                                                    
729600     MOVE LOW-VALUES              TO E422-07-CTR-ENTRADA.                     
729800     MOVE 0500                    TO E422-07-CTR-NUMSIST.                     
730000     MOVE 0015                    TO E422-07-CTR-NUMPASO.                     
730200     MOVE S422-78-CTE-NUM         TO E422-07-CTE-NUM.                         
730400     MOVE S422-78-CTA-NUMPROD     TO E422-07-CTA-NUMPROD.                     
730600     MOVE S422-78-CTA-CVEINST     TO E422-07-CTA-CVEINST.                     
730800     MOVE S422-78-CTA-NUMPREF     TO E422-07-CTA-NUMPREF.                     
731000     MOVE S422-78-CTA-NUM         TO E422-07-CTA-NUM.                         
731200     MOVE 1                       TO E422-07-CTR-CVERELCTA.                   
731400     MOVE 1                       TO E422-07-CTR-NUMREG.                      
731600                                                                              
731800     PERFORM 20000016-L422-CTASREL.                                           
732000                                                                              
732200     IF R422-07-CTR-ERROR = 0                                                 
732400        MOVE S422-07-CTA-NUMREL(1)   TO ORDENADO-TB-NUMCONT                   
732600                                        WD1-07-CTO                            
732800     ELSE                                                                     
733000        MOVE 2                    TO WKS-ERROR-VA                             
733200        MOVE 999999999999         TO ORDENADO-TB-NUMCONT                      
733400        MOVE "E"                  TO WKS-TIPO-LJ                              
733600        MOVE 020901               TO WKS-CODIGO-LJ                            
733800        MOVE R422-07-CTR-ERROR    TO WS-R422-ERROR-FMT                        
734000                                     WD1-07-ERR                               
734200        MOVE E422-07-CTE-NUM      TO WS-R422-CONTRATO                         
734400        STRING "ERROR (" WS-R422-ERROR-FMT                                    
734600               ") EN EL LLAMADO AL ENTRY POINT "                              
734800               "S016_L422_CTASREL AL BUSCAR CONTRATO DE CUENTA "              
735000               "MAESTRA RELACIONADO CON CONTRATO SKY "                        
735200               "TARJ " WS-R422-TARJETA " CTE " WS-R422-CONTRATO               
735400               DELIMITED BY SIZE INTO TEXTO-LJ                                
735600*       PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
735605        MOVE SPACES               TO TEXTO-LJ.                                
735610                                                                              
735620 50035770-SUC-PROMOTORA.                                                      
735630     MOVE 0                          TO WS-S016-0103-RESULT.                  
735640     MOVE LOW-VALUES                 TO WS-S016-0103-ENTRADA                  
735650                                        WS-S016-0103-SALIDA.                  
735660     MOVE S422-78-CTA-NUM            TO WS-S016-0103-CTA-NUM-I.               
735670     MOVE 2                          TO WS-S016-0103-CTR-OPCION-I.            
735680                                                                              
735690     PERFORM 20000016-L422-B04SXCTAPRD.                                       
735700                                                                              
735710     IF WS-S016-0103-RESULT = 0                                               
735720        MOVE WS-S016-0103-CTA-NUMSUC-S TO ORDENADO-TB-SUCPROM.                
735800                                                                              
740000 50036000-SORTEA-ORDENADO-CM.                                                 
740200*****************************                                                 
740400     PERFORM 50036100-AGREGA-REGS-ORDCM.                                      
740450     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE FALSE                        
740500        OPEN I-O ORDENADO-CM.                                                 
740550     MOVE ATTRIBUTE UNITS OF ORDENADO-CM TO W77-UNITS.                        
740600     MOVE ATTRIBUTE MAXRECSIZE OF ORDENADO-CM TO WS-MAXRECSIZE.               
740610     MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-LASTREC.                  
740620     ADD 1                                    TO WS-LASTREC.                  
740630     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE TRUE                         
740640        CLOSE ORDENADO-CM WITH SAVE.                                          
740650*    CONVERTIR MAXRECSIZE A PALABRAS EN CASO DE SER NECESARIO                 
740660     IF W77-UNITS NOT = 0                                                     
740670        IF (FUNCTION MOD(WS-MAXRECSIZE,6)) > 0                                
740680           COMPUTE WS-MAXRECSIZE =                                            
740690                   FUNCTION DIV(WS-MAXRECSIZE,6) + 1                          
740700        ELSE                                                                  
740710           COMPUTE WS-MAXRECSIZE =                                            
740720                   FUNCTION DIV(WS-MAXRECSIZE,6).                             
740730*    SE CALCULA EL MEMORY SIZE TRATANDO DE TENER UN MINIMO                    
740740*    500000 PALABRAS, QUE ERA LO QUE TENIA FIJO ANTES DE ESTO,                
740750*    Y UN MAXIMO DE HASTA 258435000 PALABRAS.                                 
740760     IF (WS-LASTREC / 16) > (500000 / (WS-MAXRECSIZE + 3))                    
740770        COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE +  3)                       
740780                                   *(WS-LASTREC   / 16))                      
740790                                  + 1500                                      
740800        IF W77-MEMORY-SIZE > 258435000                                        
740810           COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE + 3)                     
740820                                      *FUNCTION DIV(                          
740830                                        (258435000 - 1500 ),                  
740840                                        (WS-MAXRECSIZE + 3)))                 
740850                                     + 1500                                   
740860        ELSE                                                                  
740870           NEXT SENTENCE                                                      
740880     ELSE                                                                     
740890        COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE + 3)                        
740900                                   *FUNCTION DIV(500000,                      
740910                                     (WS-MAXRECSIZE + 3)))                    
740920                                  + 1500.                                     
740930*    SE CALCULA EL DISK SIZE                                                  
741200     COMPUTE WS-WORDSORT = WS-MAXRECSIZE * WS-LASTREC * 2.5.                  
741220     MOVE "E"             TO WKS-TIPO-LJ.                                     
741240     MOVE 020101          TO WKS-CODIGO-LJ.                                   
741260     STRING "MEMORY SIZE ", W77-MEMORY-SIZE, " WORDS,",                       
741280            "DISK SIZE   ", WS-WORDSORT, " WORDS"                             
741300            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
741320     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
741400     SORT SORTEO-CM ON ASCENDING KEY SORTEO-TIPREG                            
741600                                     SORTEO-PRIORIDAD                         
741800                                     SORTEO-CLAVE                             
742000          USING  ORDENADO-CM                                                  
742200          OUTPUT PROCEDURE 50036500-AGREGA-AUTS-ORDCM                         
742400                             MEMORY SIZE W77-MEMORY-SIZE WORDS                
742600                             DISK SIZE WS-WORDSORT WORDS.                     
742800                                                                              
743000 50036100-AGREGA-REGS-ORDCM.                                                  
743200     PERFORM 50036110-GRABA-ARCHSAPLI-ORDCM.                                  
743400     PERFORM 50036120-PONE-TOTSXARCH-ORDCM.                                   
743600     PERFORM 50036170-GRABA-PRIMERTRL-ORDCM.                                  
743800     PERFORM 50036180-ACTLIZA-HDR-ORDCM.                                      
744000                                                                              
744200 50036110-GRABA-ARCHSAPLI-ORDCM.                                              
744400     MOVE 10                      TO ORDENADO-B02-CLAVE.                      
744600     MOVE WS-ULT-ARCH-APLI(1)     TO ORDENADO-B02-ULT-ARCH(1).                
744800     MOVE WS-ULT-ARCH-APLI(2)     TO ORDENADO-B02-ULT-ARCH(2).                
745000     MOVE WS-ULT-ARCH-APLI(3)     TO ORDENADO-B02-ULT-ARCH(3).                
745200     MOVE WS-ULT-ARCH-APLI(4)     TO ORDENADO-B02-ULT-ARCH(4).                
745400     MOVE WS-ULT-ARCH-APLI(5)     TO ORDENADO-B02-ULT-ARCH(5).                
745600     MOVE WS-ULT-ARCH-APLI(6)     TO ORDENADO-B02-ULT-ARCH(6).                
745800     MOVE WS-ULT-ARCH-APLI(7)     TO ORDENADO-B02-ULT-ARCH(7).                
746000     MOVE WS-ULT-ARCH-APLI(8)     TO ORDENADO-B02-ULT-ARCH(8).                
746200     MOVE WS-ULT-ARCH-APLI(9)     TO ORDENADO-B02-ULT-ARCH(9).                
746400     MOVE WS-ULT-ARCH-APLI(10)    TO ORDENADO-B02-ULT-ARCH(10).               
746405*INI EAS FASE 5                                                               
746410     MOVE WS-ULT-ARCH-APLI(21)    TO ORDENADO-B02-ULT-ARCH(21).               
746415     MOVE WS-ULT-ARCH-APLI(22)    TO ORDENADO-B02-ULT-ARCH(22).               
746420     MOVE WS-ULT-ARCH-APLI(23)    TO ORDENADO-B02-ULT-ARCH(23).               
746425     MOVE WS-ULT-ARCH-APLI(24)    TO ORDENADO-B02-ULT-ARCH(24).               
746430*FIN EAS FASE 5                                                               
746600     MOVE "5"                     TO REG-ORDENADO-TR.                         
746800     ADD  1                       TO WS-LLAVE-ORDCM.                          
747000     WRITE REG-ORDENADO INVALID KEY                                           
747200           MOVE "E"               TO WKS-TIPO-LJ                              
747400           MOVE 020801            TO WKS-CODIGO-LJ                            
747600           STRING "ERROR AL GRABAR REGISTRO DE ULTIMOS ARCHIVOS "             
747800                  "APLICADOS EN EL ORDENADO-CM "                              
748000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
748200           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
748400*          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
748600     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
748800                                                                              
749000     IF WKS-MPD-PRUEBAS                                                       
749200        DISPLAY "<MPD P015> ULTIMOS ARCHIVOS APLICADOS "                      
749400        DISPLAY "<MPD P015> ULTARCHAPLI(1)  " WS-ULT-ARCH-APLI(1)             
749600        DISPLAY "<MPD P015> ULTARCHAPLI(2)  " WS-ULT-ARCH-APLI(2)             
749800        DISPLAY "<MPD P015> ULTARCHAPLI(3)  " WS-ULT-ARCH-APLI(3)             
750000        DISPLAY "<MPD P015> ULTARCHAPLI(4)  " WS-ULT-ARCH-APLI(4)             
750200        DISPLAY "<MPD P015> ULTARCHAPLI(5)  " WS-ULT-ARCH-APLI(5)             
750400        DISPLAY "<MPD P015> ULTARCHAPLI(6)  " WS-ULT-ARCH-APLI(6)             
750600        DISPLAY "<MPD P015> ULTARCHAPLI(7)  " WS-ULT-ARCH-APLI(7)             
750800        DISPLAY "<MPD P015> ULTARCHAPLI(8)  " WS-ULT-ARCH-APLI(8)             
751000        DISPLAY "<MPD P015> ULTARCHAPLI(9)  " WS-ULT-ARCH-APLI(9)             
751200       DISPLAY "<MPD P015> ULTARCHAPLI(10) " WS-ULT-ARCH-APLI(10)             
751205       DISPLAY "<MPD P015> ULTARCHAPLI(21) " WS-ULT-ARCH-APLI(21)             
751210       DISPLAY "<MPD P015> ULTARCHAPLI(22) " WS-ULT-ARCH-APLI(22)             
751215       DISPLAY "<MPD P015> ULTARCHAPLI(23) " WS-ULT-ARCH-APLI(23)             
751220       DISPLAY "<MPD P015> ULTARCHAPLI(24) " WS-ULT-ARCH-APLI(24).            
751400                                                                              
751600 50036120-PONE-TOTSXARCH-ORDCM.                                               
751800     MOVE 0       TO WS-ARCH-IND2.                                            
752000     PERFORM 50036130-LEE-TBL-TOTSXARCH VARYING WS-ARCH-IND1                  
752200             FROM 1 BY 1 UNTIL WS-ARCH-IND1 > WS-ARCH-IND.                    
752400                                                                              
752600 50036130-LEE-TBL-TOTSXARCH.                                                  
752800     ADD  1       TO WS-ARCH-IND2.                                            
753000     PERFORM 50036140-MUEVE-TBL-TOTSXARCH.                                    
753200     IF WS-ARCH-IND1 = WS-ARCH-IND OR                                         
753400        WS-ARCH-IND2 = 5                                                      
753600        PERFORM 50036150-LIMPIA-REG-ORDCM VARYING WS-ARCH-INDI                
753800                FROM 6 BY 1 UNTIL WS-ARCH-INDI > 10                           
754000        PERFORM 50036160-GRABA-TOTSXARCH-ORDCM                                
754200        MOVE 0    TO WS-ARCH-IND2.                                            
754400                                                                              
754600 50036140-MUEVE-TBL-TOTSXARCH.                                                
754800     MOVE WS-ARCH-MACC (WS-ARCH-IND1)     TO                                  
755000                      ORDENADO-AR-SISTEMA    (WS-ARCH-IND2).                  
755200     MOVE WS-ARCH-FECHA(WS-ARCH-IND1)     TO                                  
755400                      ORDENADO-AR-FECHA      (WS-ARCH-IND2).                  
755600     MOVE W-ETIQ-ORD-SEQ                  TO                                  
755800                      ORDENADO-AR-HHMM       (WS-ARCH-IND2).                  
756000     MOVE WS-ARCH-STATUS                  TO                                  
756200                      ORDENADO-AR-STATUS     (WS-ARCH-IND2).                  
756400     MOVE WS-ARCH-ABOCON(WS-ARCH-IND1)    TO                                  
756600                      ORDENADO-AR-IMPABOC    (WS-ARCH-IND2).                  
756800     MOVE WS-ARCH-ABONCON(WS-ARCH-IND1)   TO                                  
757000                      ORDENADO-AR-IMPABONC   (WS-ARCH-IND2).                  
757200     MOVE WS-ARCH-CARCON(WS-ARCH-IND1)    TO                                  
757400                      ORDENADO-AR-IMPCARC    (WS-ARCH-IND2).                  
757600     MOVE WS-ARCH-CARNCON(WS-ARCH-IND1)   TO                                  
757800                      ORDENADO-AR-IMPCARNC   (WS-ARCH-IND2).                  
758000                                                                              
758200     IF WKS-MPD-PRUEBAS                                                       
758400      DISPLAY "<MPD P015> DEL RENGLON " WS-ARCH-IND1 " DEL ARCH"              
758600              " AL RENGLON " WS-ARCH-IND2 " DEL REG ORDCM "                   
758800      DISPLAY "<MPD MACC   (" WS-ARCH-MACC (WS-ARCH-IND1)      ")"            
759000      DISPLAY "<MPD FECHA  (" WS-ARCH-FECHA(WS-ARCH-IND1)      ")"            
759200      DISPLAY "<MPD HHMM   (" ORDENADO-AR-HHMM(WS-ARCH-IND2)   ")"            
759400      DISPLAY "<MPD STATUS (" ORDENADO-AR-STATUS(WS-ARCH-IND2) ")"            
759600      DISPLAY "<MPD ABOCON (" WS-ARCH-ABOCON(WS-ARCH-IND1)     ")"            
759800      DISPLAY "<MPD ABONCON(" WS-ARCH-ABONCON(WS-ARCH-IND1)    ")"            
760000      DISPLAY "<MPD CARCON (" WS-ARCH-CARCON(WS-ARCH-IND1)     ")"            
760200      DISPLAY "<MPD CARNCON(" WS-ARCH-CARNCON(WS-ARCH-IND1)   ")".            
760400                                                                              
760600 50036150-LIMPIA-REG-ORDCM.                                                   
760800     MOVE 0     TO    ORDENADO-AR-FECHA      (WS-ARCH-INDI)                   
761000                      ORDENADO-AR-HHMM       (WS-ARCH-INDI)                   
761200                      ORDENADO-AR-STATUS     (WS-ARCH-INDI)                   
761400                      ORDENADO-AR-IMPABOC    (WS-ARCH-INDI)                   
761600                      ORDENADO-AR-IMPABONC   (WS-ARCH-INDI)                   
761800                      ORDENADO-AR-IMPCARC    (WS-ARCH-INDI)                   
762000                      ORDENADO-AR-IMPCARNC   (WS-ARCH-INDI).                  
762200                                                                              
762400 50036160-GRABA-TOTSXARCH-ORDCM.                                              
762600     MOVE 11              TO ORDENADO-AR-CLAVE.                               
762800     MOVE "4"             TO REG-ORDENADO-TR.                                 
763000     ADD  1               TO WS-LLAVE-ORDCM.                                  
763200     WRITE REG-ORDENADO INVALID KEY                                           
763400           MOVE "E"               TO WKS-TIPO-LJ                              
763600           MOVE 020801            TO WKS-CODIGO-LJ                            
763800           STRING "ERROR AL GRABAR REGISTRO DE TOTALES X ARCHIVO "            
764000                  "EN EL ORDENADO-CM "                                        
764200                  DELIMITED BY SIZE INTO TEXTO-LJ                             
764400           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
764600*          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
764800     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
765000                                                                              
765200 50036170-GRABA-PRIMERTRL-ORDCM.                                              
765400     MOVE "9"                     TO REG-ORDENADO-TR.                         
765600     MOVE 888888                  TO REG-ORDENADO-TRAILER.                    
765800     MOVE WS-GLO-NUMREG           TO REG-ORDENADO-NUMTRL.                     
766000     MOVE WS-GLO-IMPREG           TO REG-ORDENADO-IMPTRL.                     
766200     ADD  1                       TO WS-LLAVE-ORDCM.                          
766400     WRITE REG-ORDENADO INVALID KEY                                           
766600           MOVE "E"               TO WKS-TIPO-LJ                              
766800           MOVE 020801            TO WKS-CODIGO-LJ                            
767000           STRING "ERROR AL GRABAR REGISTRO DE ULTIMOS ARCHIVOS "             
767200                  "APLICADOS EN EL ORDENADO-CM "                              
767400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
767600           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
767800           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
768000     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
768200     CLOSE ORDENADO-CM WITH SAVE.                                             
768400                                                                              
768600     IF WKS-MPD-PRUEBAS                                                       
768800        DISPLAY "<MPD P015> AL GRABAR PRIMER TRL DEL ORDENADO-CM "            
769000                "WS-GLO-NUMREG " WS-GLO-NUMREG                                
769200                " WS-GLO-IMPREG " WS-GLO-IMPREG.                              
769400                                                                              
769600 50036180-ACTLIZA-HDR-ORDCM.                                                  
769800     OPEN I-O ORDENADO-CM.                                                    
770000     MOVE 1       TO WS-LLAVE-ORDCM.                                          
770200     READ ORDENADO-CM INVALID KEY                                             
770400          MOVE "E"               TO WKS-TIPO-LJ                               
770600          MOVE 020801            TO WKS-CODIGO-LJ                             
770800          STRING "ERROR AL LEER REGISTRO HEADER DEL ORDENADO-CM "             
771000                 "PARA ACTUALIZAR ULTIMOS ARCHIVOS APLICADOS "                
771200                 DELIMITED BY SIZE INTO TEXTO-LJ                              
771400          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
771600          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
771800     MOVE WS-ULT-ARCH-APLI(6)     TO REG-ORDENADO-ULTF-PE.                    
772000     MOVE WS-ULT-ARCH-APLI(2)     TO REG-ORDENADO-ULTF-TAR                    
772200     MOVE WS-ULT-ARCH-APLI(3)     TO REG-ORDENADO-ULTF-87.                    
772400     MOVE WS-ULT-ARCH-APLI(4)     TO REG-ORDENADO-ULTF-TARSEM.                
772405*INI EAS FASE 5                                                               
772410     MOVE WS-ULT-ARCH-APLI(23)    TO REG-ORDENADO-ULTF-EAS.                   
772415     MOVE WS-ULT-ARCH-APLI(24)    TO REG-ORDENADO-ULTF-EASSEM.                
772420*FIN EAS FASE 5                                                               
772600     WRITE REG-ORDENADO INVALID KEY                                           
772800           MOVE "E"               TO WKS-TIPO-LJ                              
773000           MOVE 020801            TO WKS-CODIGO-LJ                            
773200           STRING "ERROR AL REGRABAR REGISTRO HDR DEL ORDENADO-CM"            
773400                  " PARA ACTUALIZAR ULTIMOS ARCHIVOS APLICADOS "              
773600                  DELIMITED BY SIZE INTO TEXTO-LJ                             
773800           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
774000           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
774200     MOVE LOW-VALUES              TO REG-ORDENADO.                            
774400     MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-LASTREC.                  
774600     CLOSE ORDENADO-CM WITH SAVE.                                             
774800                                                                              
775000 50036520-SOLICITA-AUTORIZACION.                                              
775200     MOVE 15      TO WS-I-SAD-PASO.                                           
775400     MOVE 4       TO WS-I-SAD-COPIA.                                          
775600     MOVE 1       TO WS-I-SAD-INDAUT.                                         
775800     MOVE 0       TO WS-I-SAD-INDFOR.                                         
776000     PERFORM 20000500-SOLAUTDIA-CALL.                                         
776200     IF WS-L010-RESULT > 0                                                    
776400        MOVE "E"                  TO WKS-TIPO-LJ                              
776600        MOVE 020901               TO WKS-CODIGO-LJ                            
776800        STRING "ERROR EN EL LLAMADO DE SOL DE AUTORIZACION "                  
777000               WS-L010-RESULT                                                 
777200               DELIMITED BY SIZE INTO TEXTO-LJ                                
777400        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
777600        CHANGE ATTRIBUTE STATUS OF MYSELF TO -1                               
777800     ELSE                                                                     
778000        MOVE WS-O-SAD-AUT         TO WS-CTR-CONTNAUT                          
778200        IF REG-ORDENADO-TR      = "4"  OR "5"                                 
778400           NEXT SENTENCE                                                      
778600        ELSE                                                                  
778800           MOVE WS-CTR-CONTNAUT   TO ORDENADO-TB-AUTORIZ.                     
779000                                                                              
785000**********************************                                            
785200 50040000-METE-ARCHS-SDOPEND.                                                 
785400**********************************                                            
785600     PERFORM 50040100-INI-METEARCH-ORDSP.                                     
785800                                                                              
786000     PERFORM 50041000-PROCESO-SALDOPEND.                                      
786200                                                                              
786400     IF WKS-HAY-ORD-SP-A-DISPERSAR                                            
786600        PERFORM 50040200-SORT-ORDENADOSP                                      
786800        PERFORM 50040300-FIN-METEARCH-ORDSP                                   
787000     ELSE                                                                     
787200        PERFORM 50040400-NO-HUBO-ORDSP.                                       
787400                                                                              
787600 50040100-INI-METEARCH-ORDSP.                                                 
787800     MOVE "E"             TO WKS-TIPO-LJ.                                     
788000     MOVE 020801          TO WKS-CODIGO-LJ.                                   
788200     STRING "SE MARCA LA BD COMO QUE INICIA A METERSE ARCHIVOS "              
788400            "DE SALDO PENDIENTE AL ORDENADO SP"                               
788600            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
788800     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
789000                                                                              
789200     PERFORM 09000000-B02CONTROL-LOCK.                                        
789400     MOVE 1               TO B02-STA-DISP-LSDO.                               
789600     PERFORM 09000000-BEGIN-TRANSACTION.                                      
789800     PERFORM 09000000-B02CONTROL-STORE.                                       
790000     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
790200                                                                              
790400 50040200-SORT-ORDENADOSP.                                                    
790600     MOVE "E"             TO WKS-TIPO-LJ.                                     
790800     MOVE 020801          TO WKS-CODIGO-LJ.                                   
791000     STRING "INICIA SORT DE ARCHIVO ORDSP " W-ETIQ-ORD-SP-FECHA               
791200            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
791400     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
791600                                                                              
791800     PERFORM 50042000-SORTEA-ORDENADO-SP.                                     
792000                                                                              
792200     MOVE "E"             TO WKS-TIPO-LJ.                                     
792400     MOVE 020801          TO WKS-CODIGO-LJ.                                   
792600     STRING "TERMINA SORT DE ARCHIVO ORDSP " W-ETIQ-ORD-SP-FECHA              
792800            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
793000     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
793200                                                                              
793400 50040300-FIN-METEARCH-ORDSP.                                                 
793600     PERFORM 09000000-B02CONTROL-LOCK.                                        
793800     MOVE 2                       TO B02-STA-DISP-LSDO.                       
794000     MOVE WS-CTR-CONTNAUT         TO B02-AUT-L010.                            
794200     PERFORM 09000000-BEGIN-TRANSACTION.                                      
794400     PERFORM 09000000-B02CONTROL-STORE.                                       
794600     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
794800                                                                              
795000     MOVE "E"             TO WKS-TIPO-LJ.                                     
795200     MOVE 020801          TO WKS-CODIGO-LJ.                                   
795400     STRING "SE MARCO LA BD COMO QUE TERMINA DE METER ARCHIVOS "              
795600            "DE SALDO PENDIENTE AL ORDENADO SP"                               
795800            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
796000     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
796200                                                                              
796400 50040400-NO-HUBO-ORDSP.                                                      
796600     PERFORM 09000000-B02CONTROL-LOCK.                                        
796800     MOVE WKS-STA-DISP-LSDO       TO B02-STA-DISP-LSDO.                       
797000     PERFORM 09000000-BEGIN-TRANSACTION.                                      
797200     PERFORM 09000000-B02CONTROL-STORE.                                       
797400     PERFORM 09000000-END-TRANSACTION-SYNC.                                   
797600     CLOSE ORDENADO-CM WITH PURGE.                                            
797800                                                                              
798000     MOVE "E"             TO WKS-TIPO-LJ.                                     
798200     MOVE 020801          TO WKS-CODIGO-LJ.                                   
798400     STRING "NO HUBO ARCHIVOS A DISPERSAR Y "                                 
798600            " EL ARCHIVO ORDENADO SP SE PURGA "                               
798800            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
799000     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
799200                                                                              
801000 50041000-PROCESO-SALDOPEND.                                                  
801050****************************                                                  
801051*R4-COPIAS-2011. Por Copias Bach el P015 debe procesar 3 archivos             
801053*de SALDOPEND, pero el R4 se instala en produccion el 25/09/2011              
801055*por lo que en la primera dispersion el P015 solo encotraria 2                
801057*archivos, dado esto se evita que el P015 disperse 3 archivos                 
801059*hasta despuôs de la primera ejecuciÿn del Batch ya con 3 copias.             
801100     MOVE 0               TO WKS-FILE-ERROR-VA.                               
801150        PERFORM 50041000-PROC-ARCHS-SDOPEND                                   
801200                VARYING WKS-IND-ARCH-SP FROM 1 BY 1                           
801250                UNTIL   WKS-IND-ARCH-SP > 3 OR WKS-FILE-CON-ERROR.            
801300                                                                              
801350 50041000-PROC-ARCHS-SDOPEND.                                                 
801400     MOVE WS-FEC-LIN-AAAA          TO W-ETIQ-SP-FEC-AA.                       
801450     MOVE WS-FEC-LIN-MM            TO W-ETIQ-SP-FEC-MM.                       
801500     MOVE WS-FEC-LIN-DD            TO W-ETIQ-SP-FEC-DD.                       
801550     MOVE B02-NUM-CSI              TO W-ETIQ-SP-CSIO                          
801600                                      W-ETIQ-SP-CSID.                         
801650     MOVE WKS-IND-ARCH-SP          TO W-ETIQ-SP-SEQ.                          
801700     SET SALDOSPEN(TITLE)          TO W-ETIQ-SALDOSPEN.                       
801750     SET SALDOSPEN(DEPENDENTSPECS) TO VALUE (TRUE).                           
801800     MOVE 0                        TO WKS-EOF-SDOP-VA.                        
801850                                                                              
801900     IF ATTRIBUTE RESIDENT OF SALDOSPEN IS = VALUE TRUE                       
801950        OPEN INPUT SALDOSPEN                                                  
802000        PERFORM 50041200-VALIDA-HEADER-SDOPEN                                 
802050     ELSE                                                                     
802100        MOVE "O"          TO WKS-TIPO-LJ                                      
802150        MOVE 020801       TO WKS-CODIGO-LJ                                    
802200        STRING "SE INTENTA DISPERSAR EL ARCHIVO " W-ETIQ-SALDOSPEN            
802250               " Y NO ESTA RESIDENTE "                                        
802300               DELIMITED BY SIZE INTO TEXTO-LJ                                
802350        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
802400        MOVE 1            TO WKS-FILE-ERROR-VA.                               
802450                                                                              
802500     IF WKS-FILE-SIN-ERROR                                                    
802550        MOVE W-ETIQ-SALDOSPEN     TO WKS-ARCH-EN-PROCESO                      
802600        MOVE 1                    TO WKS-REG-ACTUAL                           
802650        MOVE ATTRIBUTE LASTRECORD OF SALDOSPEN TO WKS-REG-ULTIMO              
802700        PERFORM 50041300-LEO-ARCH-SDOPEN UNTIL WKS-EOF-SDOP                   
802750        CLOSE SALDOSPEN WITH SAVE.                                            
802800                                                                              
802850 50041200-VALIDA-HEADER-SDOPEN.                                               
802900     MOVE 1       TO WS-LLAVE-SALDOSPEN.                                      
802950     READ SALDOSPEN INVALID KEY                                               
803000          MOVE "E"                TO WKS-TIPO-LJ                              
803050          MOVE 020801             TO WKS-CODIGO-LJ                            
803100          STRING "ARCHIVO " W-ETIQ-SALDOSPEN " NO TRAE REGISTROS "            
803150                 DELIMITED BY SIZE INTO TEXTO-LJ                              
803200          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
803250          MOVE 1          TO WKS-FILE-ERROR-VA.                               
803300                                                                              
803350     IF WKS-MPD-PRUEBAS                                                       
803400        MOVE WS-REG-SDOPEN-TIP-REG TO WKS-TXT-RSP-HDR-TIP-REG                 
803450        MOVE WS-REG-SP-HDR-FEC     TO WKS-TXT-RSP-HDR-FEC                     
803500        MOVE WS-REG-SP-HDR-HRA-MAQ TO WKS-TXT-RSP-HDR-HRA-MAQ                 
803550        MOVE WS-REG-SP-HDR-FEC-MAQ TO WKS-TXT-RSP-HDR-FEC-MAQ                 
803600        MOVE WS-REG-SP-HDR-CSI-ORI TO WKS-TXT-RSP-HDR-CSI-ORI                 
803650        MOVE WS-REG-SP-HDR-CSI-DES TO WKS-TXT-RSP-HDR-CSI-DES                 
803700        MOVE WS-REG-SP-HDR-NUMCOPY TO WKS-TXT-RSP-HDR-NUMCOPY                 
803750        DISPLAY "<MPD P015> DATOS DEL HEADER SALDOSPEN "                      
803800                WKS-TXT-RSP-HEADER.                                           
803850                                                                              
803900     IF WKS-FILE-SIN-ERROR                                                    
803950        IF WS-REG-SP-HDR-FEC = WS-FECHA-LIN                                   
804000           NEXT SENTENCE                                                      
804050        ELSE                                                                  
804100           MOVE WS-REG-SP-HDR-FEC TO WKS-SDOPEN-FECARC                        
804150           MOVE "O"               TO WKS-TIPO-LJ                              
804200           MOVE 010401            TO WKS-CODIGO-LJ                            
804250           STRING "EL ARCHIVO DE SALDOS PENDIENTES CON FECHA "                
804300               W-ETIQ-SP-FECHA " TRAE INTERNAMENTE LA FECHA "                 
804350               WKS-SDOPEN-FECARC " Y NO CORRESPONDEN, LLAMAR "                
804400               "AL RESPONSABLE DEL BATCH DEL S500 EN ING."                    
804450               " DE SISTEMAS "                                                
804500               DELIMITED BY SIZE INTO TEXTO-LJ                                
804550           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
804600           MOVE 1         TO WKS-FILE-ERROR-VA.                               
804650                                                                              
804700     IF WKS-FILE-SIN-ERROR                                                    
804750        IF WS-REG-SP-HDR-NUMCOPY = W-ETIQ-SP-SEQ                              
804800           MOVE "E"               TO WKS-TIPO-LJ                              
804850           MOVE 020801            TO WKS-CODIGO-LJ                            
804900           STRING "PROCESO ARCHIVO " W-ETIQ-SALDOSPEN                         
804950                  DELIMITED BY SIZE INTO TEXTO-LJ                             
805000           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
805050        ELSE                                                                  
805100           MOVE WS-REG-SP-HDR-NUMCOPY     TO WKS-SDOPEN-NUMCOPY               
805150           MOVE "O"                       TO WKS-TIPO-LJ                      
805200           MOVE 010401                    TO WKS-CODIGO-LJ                    
805250           STRING "EL ARCHIVO DE SALDOS PENDIENTES CON NUMCOPY "              
805300               W-ETIQ-SP-SEQ " TRAE INTERNAMENTE NUMERO DE COPIA "            
805350               WKS-SDOPEN-NUMCOPY " Y NO CORRESPONDEN, LLAMAR "               
805400               "AL RESPONSABLE DEL BATCH DEL S500 EN ING."                    
805450               " DE SISTEMAS "                                                
805500               DELIMITED BY SIZE INTO TEXTO-LJ                                
805550           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
805600           MOVE 1         TO WKS-FILE-ERROR-VA.                               
805650                                                                              
808400 50041300-LEO-ARCH-SDOPEN.                                                    
808500     PERFORM 50041400-LEO-REG-SDOPEN.                                         
808600     IF WS-REG-SP-TP-TRL                                                      
808800        MOVE 1    TO WKS-EOF-SDOP-VA                                          
808820        IF WKS-IND-ARCH-SP = 2                                                
808840           MOVE 2    TO WKS-EXISTE-ORD-X-DISPER                               
808860        ELSE                                                                  
808880           NEXT SENTENCE                                                      
808900     ELSE                                                                     
809000        MOVE 3                         TO ORDENADO-TB-PRIORIDAD               
809100        MOVE WS-REG-SP-MOV-SUCPROM-MDA TO ORDENADO-TB-SUCPROM                 
809120                                          ORDENADO-TB-SUCBANCO                
809140        MOVE 52                        TO ORDENADO-TB-CAJA                    
809200        MOVE WS-REG-SP-MOV-CONTRATO    TO ORDENADO-TB-NUMCONT                 
809300        MOVE WS-REG-SP-MOV-CLAVE       TO ORDENADO-TB-CLAVE                   
809400        MOVE WS-REG-SP-MOV-IMPORTE     TO ORDENADO-TB-IMPORTE                 
809500        MOVE WS-REG-SP-MOV-PROD        TO ORDENADO-TB-PRODUCTO                
809600        MOVE WS-REG-SP-MOV-INST        TO ORDENADO-TB-INSTRUM                 
809700        MOVE WS-REG-SP-MOV-MONEDA      TO ORDENADO-TB-MONEDA                  
809800        MOVE WS-REG-SP-MOV-IND-LEY     TO ORDENADO-TB-INDLEY                  
809900        MOVE WS-REG-SP-MOV-LEYENDA     TO ORDENADO-TB-LEYENDA                 
810000        MOVE WS-NODO                   TO ORDENADO-TB-NODO                    
810100        MOVE WS-FECHA-LIN              TO ORDENADO-TB-FECHA                   
810200        ADD  1                         TO WKS-NUM-SDOPEN                      
810300        ADD  WS-REG-SP-MOV-IMPORTE     TO WKS-IMP-SDOPEN.                     
810400                                                                              
810500     IF NOT WKS-EOF-SDOP                                                      
810600        PERFORM 50041500-GRABA-SDOPEN-EN-ORDCM.                               
810700                                                                              
810800 50041400-LEO-REG-SDOPEN.                                                     
810900     ADD  1                       TO WS-LLAVE-SALDOSPEN.                      
811000     MOVE WS-LLAVE-SALDOSPEN      TO WKS-REG-ACTUAL.                          
811100     READ SALDOSPEN INVALID KEY                                               
811200          MOVE "E"                TO WKS-TIPO-LJ                              
811300          MOVE 020801             TO WKS-CODIGO-LJ                            
811400          STRING "ERROR AL LEER REGISTRO DEL ARCHIVO "                        
811500                 W-ETIQ-SALDOSPEN                                             
811600                 DELIMITED BY SIZE INTO TEXTO-LJ                              
811700          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
811800          CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                            
811900                                                                              
812000*    IF WKS-MPD-PRUEBAS                                                       
812100*       IF WS-REG-SP-TP-MOV                                                   
812200*       MOVE WS-REG-SDOPEN-TIP-REG     TO WKS-TXT-RSP-MOV-TIP-REG             
812300*       MOVE WS-REG-SP-MOV-MDA         TO WKS-TXT-RSP-MOV-MDA                 
812400*       MOVE WS-REG-SP-MOV-SUCPROM-MDA TO WKS-TXT-RSP-MOV-SUC-MDA             
812500*       MOVE WS-REG-SP-MOV-CONTRATO    TO WKS-TXT-RSP-MOV-CONTRATO            
812600*       MOVE WS-REG-SP-MOV-CLAVE       TO WKS-TXT-RSP-MOV-CLAVE               
812700*       MOVE WS-REG-SP-MOV-IMPORTE     TO WKS-TXT-RSP-MOV-IMPORTE             
812800*       MOVE WS-REG-SP-MOV-PROD        TO WKS-TXT-RSP-MOV-PROD                
812900*       MOVE WS-REG-SP-MOV-INST        TO WKS-TXT-RSP-MOV-INST                
813000*       MOVE WS-REG-SP-MOV-MONEDA      TO WKS-TXT-RSP-MOV-MONEDA              
813100*       MOVE WS-REG-SP-MOV-IND-LEY     TO WKS-TXT-RSP-MOV-IND-LEY             
813200*       MOVE WS-REG-SP-MOV-LEYENDA     TO WKS-TXT-RSP-MOV-LEYENDA             
813300*       DISPLAY "<MPD P015> ( " WS-LLAVE-SALDOSPEN " ) "                      
813400*               WKS-TXT-RSP-MOVTOS                                            
813500*       ELSE                                                                  
813600*       MOVE WS-REG-SDOPEN-TIP-REG     TO WKS-TXT-RSP-TRL-TIP-REG             
813700*       MOVE WS-REG-SP-TRL-NUM-REGS    TO WKS-TXT-RSP-TRL-NUM-REGS            
813800*       MOVE WS-REG-SP-TRL-IMP         TO WKS-TXT-RSP-TRL-IMP                 
813900*       DISPLAY "<MPD P015> ( " WS-LLAVE-SALDOSPEN " ) "                      
814000*               WKS-TXT-RSP-TRL.                                              
814100*                                                                             
814200                                                                              
814300 50041500-GRABA-SDOPEN-EN-ORDCM.                                              
814400*    IF WKS-MPD-PRUEBAS                                                       
814500*       DISPLAY "<MPD P015> SE GRABA ( " WS-LLAVE-SALDOSPEN " ) ".            
814600*                                                                             
814700     MOVE "2"             TO REG-ORDENADO-TR.                                 
814800     ADD  1               TO WS-LLAVE-ORDCM.                                  
814900     WRITE REG-ORDENADO INVALID KEY                                           
815000           MOVE "E"                TO WKS-TIPO-LJ                             
815100           MOVE 020801             TO WKS-CODIGO-LJ                           
815200           STRING "ERROR AL GRABAR REGISTRO DEL ARCHIVO "                     
815300                  W-ETIQ-SALDOSPEN " EN EL ORDENADO-CM "                      
815400                  DELIMITED BY SIZE INTO TEXTO-LJ                             
815500           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
815600           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
815700     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
815800                                                                              
820000 50042000-SORTEA-ORDENADO-SP.                                                 
820200     PERFORM 50042100-GRABA-TRL-ORDSP.                                        
820250     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE FALSE                        
820300        OPEN I-O ORDENADO-CM.                                                 
820350     MOVE ATTRIBUTE UNITS OF ORDENADO-CM TO W77-UNITS.                        
820400     MOVE ATTRIBUTE MAXRECSIZE OF ORDENADO-CM TO WS-MAXRECSIZE.               
820405     MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-LASTREC.                  
820410     ADD 1                                    TO WS-LASTREC.                  
820415     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE TRUE                         
820420        CLOSE ORDENADO-CM WITH SAVE.                                          
820425*    CONVERTIR MAXRECSIZE A PALABRAS EN CASO DE SER NECESARIO                 
820430     IF W77-UNITS NOT = 0                                                     
820435        IF (FUNCTION MOD(WS-MAXRECSIZE,6)) > 0                                
820440           COMPUTE WS-MAXRECSIZE =                                            
820445                   FUNCTION DIV(WS-MAXRECSIZE,6) + 1                          
820450        ELSE                                                                  
820455           COMPUTE WS-MAXRECSIZE =                                            
820460                   FUNCTION DIV(WS-MAXRECSIZE,6).                             
820465*    SE CALCULA EL MEMORY SIZE TRATANDO DE TENER UN MINIMO                    
820470*    500000 PALABRAS, QUE ERA LO QUE TENIA FIJO ANTES DE ESTO,                
820475*    Y UN MAXIMO DE HASTA 258435000 PALABRAS.                                 
820480     IF (WS-LASTREC / 16) > (500000 / (WS-MAXRECSIZE + 3))                    
820485        COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE +  3)                       
820490                                   *(WS-LASTREC   / 16))                      
820495                                  + 1500                                      
820500        IF W77-MEMORY-SIZE > 258435000                                        
820505           COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE + 3)                     
820510                                      *FUNCTION DIV(                          
820515                                        (258435000 - 1500 ),                  
820520                                        (WS-MAXRECSIZE + 3)))                 
820525                                     + 1500                                   
820530        ELSE                                                                  
820535           NEXT SENTENCE                                                      
820540     ELSE                                                                     
820545        COMPUTE W77-MEMORY-SIZE = ((WS-MAXRECSIZE + 3)                        
820550                                   *FUNCTION DIV(500000,                      
820555                                    (WS-MAXRECSIZE +  3)))                    
820560                                  + 1500.                                     
820720*    SE CALCULA EL DISK SIZE                                                  
821000     COMPUTE WS-WORDSORT = WS-MAXRECSIZE * WS-LASTREC * 2.5.                  
821020     MOVE "E"             TO WKS-TIPO-LJ.                                     
821040     MOVE 020101          TO WKS-CODIGO-LJ.                                   
821060     STRING "MEMORY SIZE ", W77-MEMORY-SIZE, " WORDS,",                       
821080            "DISK SIZE   ", WS-WORDSORT, " WORDS"                             
821100            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
821120     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
821200     SORT SORTEO-CM ON ASCENDING KEY SORTEO-TIPREG                            
821400                                     SORTEO-PRIORIDAD                         
821600                                     SORTEO-CLAVE                             
821800          USING  ORDENADO-CM                                                  
822000          OUTPUT PROCEDURE 50036500-AGREGA-AUTS-ORDCM                         
822200                             MEMORY SIZE W77-MEMORY-SIZE WORDS                
822400                             DISK SIZE WS-WORDSORT WORDS.                     
822600                                                                              
822800 50042100-GRABA-TRL-ORDSP.                                                    
823000     MOVE "9"                     TO REG-ORDENADO-TR.                         
823200     MOVE 888888                  TO REG-ORDENADO-TRAILER.                    
823400     MOVE WKS-NUM-SDOPEN          TO REG-ORDENADO-NUMTRL.                     
823600     MOVE WKS-IMP-SDOPEN          TO REG-ORDENADO-IMPTRL.                     
823800     ADD  1                       TO WS-LLAVE-ORDCM.                          
824000     WRITE REG-ORDENADO INVALID KEY                                           
824200           MOVE "E"               TO WKS-TIPO-LJ                              
824400           MOVE 020801            TO WKS-CODIGO-LJ                            
824600           STRING "ERROR AL GRABAR REGISTRO TRL AL ARCHIVO "                  
824800                  "ORDENADO-SP DE SALDOS PENDIENTES  "                        
825000                  DELIMITED BY SIZE INTO TEXTO-LJ                             
825200           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
825400           CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                           
825600     MOVE LOW-VALUES      TO REG-ORDENADO.                                    
825700     MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-LASTREC.                  
825800     CLOSE ORDENADO-CM WITH SAVE.                                             
826000                                                                              
826200     IF WKS-MPD-PRUEBAS                                                       
826400        DISPLAY "<MPD P015> AL GRABAR TRL DEL ORDENADO SP "                   
826600                "WKS-NUM-SDOPEN " WKS-NUM-SDOPEN                              
826800                " WKS-IMP-SDOPEN " WKS-IMP-SDOPEN.                            
827000                                                                              
830000****************************************************************              
830100*         50036500-AGREGA-AUTS-ORDCM SECTION.                  *              
830200****************************************************************              
830300 50036500-AGREGA-AUTS-ORDCM SECTION.                                          
830400 50036500-AUTS-ORDENADOCM.                                                    
830500     OPEN OUTPUT ORDENADO-CM.                                                 
830600     MOVE 0       TO WS-LLAVE-ORDCM.                                          
830700     PERFORM 50036510-LEE-ARCH-SORT UNTIL WKS-EOF-SORT-CM.                    
830800     CLOSE ORDENADO-CM WITH SAVE.                                             
830900                                                                              
831000 50036510-LEE-ARCH-SORT.                                                      
831100     RETURN SORTEO-CM AT END                                                  
831200            MOVE 1                TO WKS-EOF-SORT-CM-VA                       
831300            MOVE WS-LLAVE-ORDCM   TO WS-ULTREG-ORDCM.                         
831400                                                                              
831500     IF NOT WKS-EOF-SORT-CM                                                   
831600        ADD  1                    TO WS-LLAVE-ORDCM                           
831700        MOVE REG-SORTEO-CM        TO REG-ORDENADO                             
831800        IF SORTEO-TIPREG  > "1" AND < "9"                                     
831900           PERFORM 50036520-SOLICITA-AUTORIZACION.                            
832000                                                                              
832100     IF NOT WKS-EOF-SORT-CM                                                   
832200        WRITE REG-ORDENADO INVALID KEY                                        
832300              MOVE "E"            TO WKS-TIPO-LJ                              
832400              MOVE 020801         TO WKS-CODIGO-LJ                            
832500              STRING "ERROR AL GRABAR REGISTRO EN ORDENADO CM "               
832600                     "YA CON AUTORIZACION "                                   
832700                     DELIMITED BY SIZE INTO TEXTO-LJ                          
832800              PERFORM 00000000-LLAMA-DISPLAY-STRING                           
832900              CHANGE ATTRIBUTE STATUS OF MYSELF TO -1.                        
833000                                                                              
833100     IF NOT WKS-EOF-SORT-CM                                                   
833200        MOVE LOW-VALUES TO REG-ORDENADO.                                      
833300                                                                              
835000****************************************************************              
835100*         50050000-DISPERSIONES SECTION.                       *              
835200****************************************************************              
835300 50050000-DISPERSIONES SECTION.                                               
835400**********************************************************                    
835500*         50050000-DISPERSA-ORDENADO                     *                    
835600**********************************************************                    
835700 50050000-DISPERSA-ORDENADO.                                                  
835800     IF WKS-HAY-ORD-CM-A-DISPERSAR                                            
835900        PERFORM 50051000-DISPERSO-ARCH-MOVTOS                                 
836000     ELSE                                                                     
836100        PERFORM 50052000-DISPERSO-ARCH-SDOPEN.                                
836200                                                                              
840800 50051000-DISPERSO-ARCH-MOVTOS.                                               
841000      OPEN I-O ORDENADO-CM.                                                   
841100      MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-ULTREG-ORDCM.            
841200      MOVE 1 TO WS-LLAVE-ORDCM.                                               
841300      PERFORM 001100-LEE-ENVIA UNTIL WS-EOF-ORDCM = 1.                        
841400*     STOP "FIN PRIMERA VUELTA"                                               
841500**                                                                            
841600*** EFECTUA UN SEGUNDO ENVIO PARA REINTENTAR MOVTOS. PENDIENTES               
841700**                                                                            
841800      IF WS-END-OF-PROGRAM = 0                                                
841900         MOVE 1 TO WS-LLAVE-ORDCM                                             
842000         MOVE 0 TO WS-EOF-ORDCM                                               
842100         MOVE 1 TO WS-SGDA-VUELTA                                             
842200         PERFORM 001100-LEE-ENVIA UNTIL WS-EOF-ORDCM = 1                      
842300         IF WS-END-OF-PROGRAM = 0                                             
842400            MOVE 2 TO WS-SGDA-VUELTA                                          
842500            MOVE 0 TO WKS-ESPERO-VA                                           
842600            PERFORM 001120-ESPERA-RESPUESTA UNTIL                             
842700                                  WS-ULTREG-ENV = WS-ULTREG-REC               
842800                                  AND WKS-PASARON-N-MIN                       
842900            PERFORM 002030-LEE-RECHAZOS                                       
843000            MOVE 3 TO WS-SGDA-VUELTA                                          
843100            PERFORM 001100-LEE-ENVIA UNTIL WS-EOF-ORDCM = 1                   
843200            IF WS-END-OF-PROGRAM = 0                                          
843300               PERFORM 001120-ESPERA-RESPUESTA UNTIL                          
843400                       WS-ULTREG-ENV = WS-ULTREG-REC OR                       
843500                       WS-END-OF-PROGRAM > 0.                                 
843600                                                                              
843700      IF WS-END-OF-PROGRAM = 0                                                
843800         PERFORM 09000000-B02CONTROL-LOCK                                     
843900         MOVE 3           TO B02-STA-DISP                                     
843920         MOVE WS-ULT-ARCH-APLI4-S111  TO B02-ULT-ARCH-APLI(4)                 
843940         MOVE WS-ULT-ARCH-APLI24-EAS  TO B02-ULT-ARCH-APLI(24)                
844000         PERFORM 09000000-BEGIN-TRANSACTION                                   
844100         PERFORM 09000000-B02CONTROL-STORE                                    
844200         MOVE 0           TO WS-EOF-ARCH                                      
844300         PERFORM 09000000-END-TRANSACTION-SYNC.                               
844400                                                                              
844500 001100-LEE-ENVIA.                                                            
844600      ADD 1 TO WS-LLAVE-ORDCM.                                                
844700      READ ORDENADO-CM INVALID KEY                                            
844800           MOVE "E"             TO WKS-TIPO-LJ                                
844900           MOVE 010106          TO WKS-CODIGO-LJ                              
845000           STRING "ENCONTRE FIN ARCHISUPERRECONTRASORPRENDENTE "              
845100                  DELIMITED BY SIZE INTO TEXTO-LJ                             
845200           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
845300           MOVE 1 TO WS-EOF-ORDCM.                                            
845400      IF REG-ORDENADO-TR      = "9"                                           
845500          MOVE 1 TO WS-EOF-ORDCM                                              
845600         IF WS-IND-ELIDISP = 0 OR                                             
845700            REG-ORDENADO-TRAILER = 999999                                     
845800            MOVE "E"             TO WKS-TIPO-LJ                               
845900            MOVE 020801          TO WKS-CODIGO-LJ                             
846000            STRING "TERMINO ENVIO A S500 " WS-LLAVE-ORDCM                     
846100                   DELIMITED BY SIZE INTO TEXTO-LJ                            
846200            PERFORM 00000000-LLAMA-DISPLAY-STRING.                            
846300                                                                              
846400     IF WS-EOF-ORDCM = 0                                                      
846500        IF WKS-MSG-12-ENVIADO AND                                             
846600           (ORDENADO-TB-TIPERROR = 0 OR 1)                                    
846700           MOVE "E"                   TO WKS-TIPO-LJ                          
846800           MOVE 020801                TO WKS-CODIGO-LJ                        
846900           STRING "ES EL PRIMER MSG DESPUES DEL MSG CON CVE 12 "              
847000                  "Y SE ESPERARA 20 SEGUNDOS ANTES DE ENVIARSE "              
847100                  DELIMITED BY SIZE INTO TEXTO-LJ                             
847200           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
847300           WAIT (20)                                                          
847400           MOVE 0        TO WKS-MSG-12-ENVIADO-VA.                            
847500                                                                              
847600     IF WS-EOF-ORDCM = 0                                                      
847700        IF ORDENADO-TB-CLAVE =  12 AND                                        
847800           (ORDENADO-TB-TIPERROR = 0 OR 1)                                    
847900           MOVE "E"                   TO WKS-TIPO-LJ                          
848000           MOVE 020801                TO WKS-CODIGO-LJ                        
848100           STRING "ES EL MSG CON CVE 12 Y SE ESPERARA 20 SEGUNDOS"            
848200                  " ANTES DE ENVIARSE, TERMINAN LAS CLAVES 0577  "            
848300                  DELIMITED BY SIZE INTO TEXTO-LJ                             
848400           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
848500           WAIT (20)                                                          
848600           MOVE 1        TO WKS-MSG-12-ENVIADO-VA.                            
848700                                                                              
848800      IF WS-EOF-ORDCM = 0                                                     
851000         IF ORDENADO-TB-TIPERROR = 0 OR 1                                     
851100            IF ORDENADO-TB-CLAVE =  50                                        
851200               MOVE 2                     TO WS-TB-TIPERROR                   
851300               MOVE 0                     TO WS-TB-NUMERROR                   
851400               MOVE WS-LLAVE-ORDCM        TO WS-LLAVE-CONF                    
851500               PERFORM 001190-CONFIRMA-ORDENADO                               
851600               MOVE "E"                   TO WKS-TIPO-LJ                      
851700               MOVE 020801                TO WKS-CODIGO-LJ                    
851800               STRING "SE INICIA LA DISPERSION DE CLAVES 0577, EN"            
851900                      " EL ARCHIVO ESTA LA CVE 50 QUE NO SE ENVIA"            
852000                      DELIMITED BY SIZE INTO TEXTO-LJ                         
852100               PERFORM 00000000-LLAMA-DISPLAY-STRING                          
852200            ELSE                                                              
852300*           SOLO SE ENVIA EL REGISTRO BAJO  ALGUNA  DE  LAS  TRES             
852400*           SIGUIENTES SITUACIONES:                                           
852500*           1) NO HA SIDO CONFIRMADO EL MSG 12.                               
852600*           2) EL MSG  12  HA  SIDO  CONFIRMADO  Y  EL  NUMERO  DE            
852700*              REGISTRO ES MAYOR AL REGISTRO CON MSG 12.                      
852800*           3) EL MSG  12  HA  SIDO  CONFIRMADO  Y  EL  NUMERO  DE            
852900*              REGISTRO ES MENOR AL REGISTRO CON MSG 12 Y LA CLAVE            
853000*              NO ES NI 0526 NI 0527.                                         
853100            IF NOT WKS-MSG-12-CONFIRMADO                   OR                 
853200               ( WKS-MSG-12-CONFIRMADO AND                                    
853300                 WS-LLAVE-ORDCM > WKS-LLAVE-MSG-12 )       OR                 
853400               ( WKS-MSG-12-CONFIRMADO AND                                    
853500                 WS-LLAVE-ORDCM < WKS-LLAVE-MSG-12 AND                        
853600                 NOT ( ORDENADO-TB-CLAVE = 0526 OR 0527 ) )                   
853700               PERFORM 001110-ENVIA-MENSAJE.                                  
853800                                                                              
854000 001110-ENVIA-MENSAJE.                                                        
854050      MOVE SPACES TO WS-MENSAJE-DIALOGO.                                      
854100      MOVE "F"          TO WS-HDR-PREFIJO.                                    
854150      MOVE 0            TO WS-HDR-APLIDESTINO                                 
854200                           WS-HDR-APLIORIGEN.                                 
854250                                                                              
855100         MOVE WS-NODO   TO WS-HDR-CSIDESTINO                                  
855150                           WS-HDR-CSIORIGEN.                                  
855200                                                                              
855250      MOVE 0            TO WS-HDR-LSNORIGEN                                   
855300                           WS-HDR-COMPUT-ORIGEN                               
855350                           WS-HDR-NIVSEG                                      
855400                           WS-HDR-SCREEN                                      
855450                           WS-HDR-SEGURIDAD.                                  
855500      MOVE "Y"                  TO WS-HDR-STA-TIPO.                           
855550      MOVE ORDENADO-TB-SUCBANCO TO WS-HDR-STA-SUC.                            
855600      MOVE "I"                  TO WS-HDR-STA-PRIV.                           
855650      MOVE ORDENADO-TB-CAJA     TO WS-HDR-STA-CAJA.                           
855700      MOVE 02                   TO WS-HDR-RESULT.                             
855750**                                                                            
855770      IF WKS-HAY-ORD-CM-A-DISPERSAR                                           
855800         MOVE 050010            TO WS-HDRAMP-TCDESTINO                        
855820      ELSE                                                                    
855840         MOVE 050016            TO WS-HDRAMP-TCDESTINO.                       
855850      MOVE 050015            TO WS-HDRAMP-TCORIGEN.                           
855900**                                                                            
855950      MOVE 0500              TO WS-SA0-DES-APLI                               
856000                                WS-SA0-ORI-APLI.                              
856050      IF ORD-CVE-CARGOS  OR ORD-CVE-CGOAUT                                    
856100         MOVE 10             TO WS-SA0-DES-CODIGO                             
856150                                WS-SA0-ORI-CODIGO                             
856200      ELSE                                                                    
856250      IF ORD-CVE-ABONOS  OR ORD-CVE-ABOAUT                                    
856300         MOVE 20             TO WS-SA0-DES-CODIGO                             
856350                                WS-SA0-ORI-CODIGO                             
856400      ELSE                                                                    
856450      IF ORD-CVE-AUTORIZ                                                      
856500         MOVE 30             TO WS-SA0-DES-CODIGO                             
856550                                WS-SA0-ORI-CODIGO                             
856600      ELSE                                                                    
856650      IF ORD-CVE-NCONT                                                        
856700         MOVE 70             TO WS-SA0-DES-CODIGO                             
856750                                WS-SA0-ORI-CODIGO                             
856800      ELSE                                                                    
856850      IF ORD-CVE-P015                                                         
856900         MOVE 73             TO WS-SA0-DES-CODIGO                             
856950                                WS-SA0-ORI-CODIGO                             
857000      ELSE                                                                    
857050      IF ORD-CVE-ELIM                                                         
857100         MOVE WS-TIPO-ELIM   TO WS-SA0-DES-CODIGO                             
857150                                WS-SA0-ORI-CODIGO.                            
857200      MOVE ORDENADO-TB-CLAVE TO WS-SA0-DES-SUBCODIGO                          
857250                                WS-SA0-ORI-SUBCODIGO.                         
857300      MOVE 1               TO WS-SA0-DIRECCION.                               
857350      MOVE 1200            TO WS-SA0-LONG.                                    
857400      MOVE 120             TO WS-SA0-TIEMPO-ESPERA.                           
857450      MOVE 01              TO WS-SA0-CODI-RESPUESTA.                          
857500**                                                                            
857550      MOVE "000"           TO WS-SA2-ID.                                      
857600      MOVE "B"             TO WS-SA2-VERSIONB.                                
857650      MOVE "A"             TO WS-SA2-VERS-DATOP.                              
857700      MOVE 0               TO WS-SA2-CLASE                                    
857750                              WS-SA2-ESTADO.                                  
857800      MOVE 1               TO WS-SA2-MODO.                                    
857850      MOVE WS-HDR-STA-SUC  TO WS-SA2-ENT-NUM-ORIGEN.                          
857900      MOVE WS-HDR-STA-PRIV TO WS-SA2-TIPOCAJA-ORIGEN.                         
857950      MOVE WS-HDR-STA-CAJA TO WS-SA2-NUMCAJA-ORIGEN.                          
858000      MOVE WS-LLAVE-ORDCM       TO WS-SA2-AUTORIZACION.                       
858050      MOVE WS-FECHA-LIN TO WS-SA2-FECHA-TRANSAC.                              
858100      ACCEPT WS-HORA FROM TIME.                                               
858150      MOVE WS-HHMMSS       TO WS-SA2-HORA-TRANSAC.                            
858200      MOVE 00              TO WS-SA2-MODALIDAD.                               
858250      MOVE SPACES          TO WS-SA2-OPERADOR                                 
858300                              WS-SA2-VERS-DATOP.                              
858350      MOVE 1               TO WS-POINTER.                                     
858400*     MOVE SPACES          TO WS-SC-FILLER.                                   
858450      MOVE ORDENADO-TB-CLAVE   TO WS-SC-CLAVE-TRANS                           
858500      IF ORDENADO-TB-CLAVE = 10                                               
858550         MOVE ORDENADO-B02-ULT-ARCH(1) TO WS-SB2-ULT-ARCH-APLI(1)             
858600         MOVE ORDENADO-B02-ULT-ARCH(2) TO WS-SB2-ULT-ARCH-APLI(2)             
858650         MOVE ORDENADO-B02-ULT-ARCH(3) TO WS-SB2-ULT-ARCH-APLI(3)             
858700         MOVE ORDENADO-B02-ULT-ARCH(4) TO WS-SB2-ULT-ARCH-APLI(4)             
858750         MOVE ORDENADO-B02-ULT-ARCH(5) TO WS-SB2-ULT-ARCH-APLI(5)             
858800         MOVE ORDENADO-B02-ULT-ARCH(6) TO WS-SB2-ULT-ARCH-APLI(6)             
858850         MOVE ORDENADO-B02-ULT-ARCH(7) TO WS-SB2-ULT-ARCH-APLI(7)             
858900         MOVE ORDENADO-B02-ULT-ARCH(8) TO WS-SB2-ULT-ARCH-APLI(8)             
858950         MOVE ORDENADO-B02-ULT-ARCH(9) TO WS-SB2-ULT-ARCH-APLI(9)             
859000        MOVE ORDENADO-B02-ULT-ARCH(10) TO WS-SB2-ULT-ARCH-APLI(10)            
859005*INI EAS FASE 5                                                               
859010        MOVE ORDENADO-B02-ULT-ARCH(21) TO WS-SB2-ULT-ARCH-APLI(21)            
859015        MOVE ORDENADO-B02-ULT-ARCH(22) TO WS-SB2-ULT-ARCH-APLI(22)            
859020        MOVE ORDENADO-B02-ULT-ARCH(23) TO WS-SB2-ULT-ARCH-APLI(23)            
859025        MOVE ORDENADO-B02-ULT-ARCH(24) TO WS-SB2-ULT-ARCH-APLI(24)            
859030*FIN EAS FASE 5                                                               
859050      ELSE                                                                    
859100      IF ORDENADO-TB-CLAVE =  11                                              
859150         PERFORM 001116-MUEVE-ARCHDIA                                         
859200           VARYING WS-ARCH-IND2 FROM 1 BY 1 UNTIL WS-ARCH-IND2                
859250           > 10                                                               
859300      ELSE                                                                    
859350      IF ORDENADO-TB-CLAVE =  12                                              
859400         NEXT SENTENCE                                                        
859450      ELSE                                                                    
859500      IF ORDENADO-TB-CLAVE = 1 OR 2 OR 13 OR 14 OR 15 OR 16 OR                
859550         (ORD-CVE-ELIM AND  WS-TIPO-ELIM =  74)                               
859600         MOVE ORDENADO-TB-NUMCONT  TO WS-SRE-CONTRATO                         
859650         MOVE ORDENADO-TB-IMPORTE  TO WS-SRE-IMPORTE                          
859700         MOVE ORDENADO-TB-AUTORIZ  TO WS-SRE-AUTORIZACION                     
859750         MOVE ORDENADO-TB-PRODUCTO TO WS-SRE-PRODUCTO                         
859800         MOVE ORDENADO-TB-INSTRUM  TO WS-SRE-INSTRUM                          
859850         MOVE ORDENADO-TB-MONEDA   TO WS-SRE-MONEDA                           
859900      ELSE                                                                    
859950         MOVE ORDENADO-TB-SUCPROM TO WS-SC-NUM-SUCURSAL                       
860000         MOVE ORDENADO-TB-NUMCONT TO WS-SC-NUM-CTA-CTO                        
860050         PERFORM 001119-MUEVE-TIPMEDACC                                       
860100         IF ORD-CVE-NCONT OR ORD-CVE-AUTORIZ OR                               
860150           (ORD-CVE-ELIM AND (WS-TIPO-ELIM = 31 OR 74))                       
860200            MOVE 0                    TO WS-SNC-REFERENCIA                    
860250**  AUTORIZ DE ORDENADO                                                       
860300            MOVE ORDENADO-TB-AUTORIZ  TO WS-SNC-AUTORIZACION                  
860350            MOVE ORDENADO-TB-IMPORTE  TO                                      
860400                                   WS-SNC-IMPORTE-AUTORIZACION                
860410*INI EAS FASE 3                                                               
860420            ADD ORDENADO-TB-IMP-AUT TO WS-SNC-IMPORTE-AUTORIZACION            
860430*FIN EAS FASE 3                                                               
860450            MOVE ORDENADO-TB-MONEDA   TO WS-SNC-MONEDA-AUT                    
860455            MOVE ORDENADO-TB-REFINTNAL-N  TO WS-SNC-NVO-NUM-TEF               
860460            MOVE ORDENADO-TB-TIP-AUT  TO WS-SNC-TIP-AUT                       
860500         ELSE                                                                 
860550            MOVE ORDENADO-TB-IMPORTE  TO WS-SC-IMPORTE                        
860600            MOVE ORDENADO-TB-MONEDA   TO WS-SC-MONEDA                         
860650*           PERFORM 001118-MUEVE-FORZADO                                      
860700            PERFORM 001118-MUEVE-FECHA                                        
860750            MOVE ORDENADO-TB-REFDOCTO TO WS-SC-REFERENCIA                     
860800            PERFORM 001118-MUEVE-REFALFA                                      
860850            PERFORM 001118-MUEVE-MEDACC                                       
860900            PERFORM 001118-MUEVE-REFINTNAL                                    
860950            PERFORM 001118-MUEVE-IMPORTE2                                     
860951*INI BSR. MONEDA ORIGEN                                                       
860952            PERFORM 001118-MUEVE-MONEDA-ORIGEN                                
860953*FIN BSR. MONEDA ORIGEN                                                       
861000** AUTORIZ DE ORDENADO                                                        
861050            PERFORM 001118-MUEVE-AUTORIZ                                      
861100*           PERFORM 001118-MUEVE-SISORI                                       
861110            PERFORM 001118-MUEVE-TIP-AUT                                      
861130            PERFORM 001118-MUEVE-ID-NEGOCIO                                   
861131*INI-STEFANINI TIPO DE CAMBIO                                                 
861132            PERFORM 001118-MUEVE-TIPO-CAMBIO                                  
861133*FIN-STEFANINI TIPO DE CAMBIO                                                 
861135*INI EAS FASE 3                                                               
861140            PERFORM 001118-MUEVE-IMP-AUT                                      
861145*FIN EAS FASE 3                                                               
861146*INI EAS FASE 4                                                               
861147            PERFORM 001118-MUEVE-REFERENCIA3                                  
861148            PERFORM 001118-MUEVE-REFERENCIA4                                  
861149*FIN EAS FASE 4                                                               
861150            PERFORM 001118-MUEVE-PUNTO.                                       
861200      IF WS-IND-ELIDISP = 1 AND WS-CVE-RESP > 0                               
861250         MOVE WS-CVE-RESP TO ORDENADO-TB-CLAVE.                               
861300      PERFORM 002000-ENVIA-COMS.                                              
861350      IF COMS-OUT-STATUS-KEY = 0 OR 96                                        
861400         MOVE WS-SA2-AUTORIZACION TO WS-ULTREG-ENV                            
861450         PERFORM 001120-ESPERA-RESPUESTA                                      
861500         IF WS-HDR-RESULT = 32                                                
861550            MOVE 97              TO COMS-IN-STATUS-KEY                        
861600            MOVE "I"             TO WKS-TIPO-LJ                               
861650            MOVE 020801          TO WKS-CODIGO-LJ                             
861700            STRING "(REC) APLICACION S500 NO DISPONIBLE, SE HAN "             
861750                   "ENVIADO " WS-LLAVE-ORDCM " REGISTROS "                    
861800                   DELIMITED BY SIZE INTO TEXTO-LJ                            
861850            PERFORM 00000000-LLAMA-DISPLAY-STRING                             
861900            MOVE 1 TO WS-EOF-ORDCM WS-EOF-CTOS                                
861950                      WS-FIN-ANORMAL                                          
862000                      WS-END-OF-PROGRAM                                       
862050         ELSE                                                                 
862100            NEXT SENTENCE                                                     
862150      ELSE                                                                    
862200         MOVE COMS-OUT-STATUS-KEY TO WKS-COMS-OUT-STATUS-KEY                  
862250         MOVE "E"             TO WKS-TIPO-LJ                                  
862300         MOVE 020801          TO WKS-CODIGO-LJ                                
862350         STRING "STAT SEND-COMS " WKS-COMS-OUT-STATUS-KEY                     
862400                DELIMITED BY SIZE INTO TEXTO-LJ                               
862450         PERFORM 00000000-LLAMA-DISPLAY-STRING                                
862500         MOVE 1              TO WS-TB-TIPERROR                                
862550         MOVE 0              TO WS-TB-NUMERROR                                
862600         MOVE WS-LLAVE-ORDCM TO WS-LLAVE-CONF                                 
862650         PERFORM 001190-CONFIRMA-ORDENADO                                     
862700         IF COMS-OUT-STATUS-KEY = 97                                          
862750            MOVE "I"             TO WKS-TIPO-LJ                               
862800            MOVE 020801          TO WKS-CODIGO-LJ                             
862850            STRING "APLICACION S500 NO DISPONIBLE, SE HAN "                   
862900                   "ENVIADO " WS-LLAVE-ORDCM " REGISTROS "                    
862950                   DELIMITED BY SIZE INTO TEXTO-LJ                            
863000            PERFORM 00000000-LLAMA-DISPLAY-STRING                             
863050            MOVE 1 TO WS-EOF-ORDCM WS-EOF-CTOS                                
863100                      WS-FIN-ANORMAL                                          
863150                      WS-END-OF-PROGRAM.                                      
863200 001116-MUEVE-ARCHDIA.                                                        
863250    MOVE   ORDENADO-AR-SISTEMA    (WS-ARCH-IND2)  TO                          
863300                WS-SAR-SISTEMA    (WS-ARCH-IND2)                              
863350    MOVE   ORDENADO-AR-FECHA      (WS-ARCH-IND2)  TO                          
863400                WS-SAR-FECHA      (WS-ARCH-IND2)                              
863450    MOVE   ORDENADO-AR-HHMM       (WS-ARCH-IND2)  TO                          
863500                WS-SAR-HHMM       (WS-ARCH-IND2)                              
863550    MOVE   ORDENADO-AR-STATUS     (WS-ARCH-IND2)  TO                          
863600                WS-SAR-STATUS     (WS-ARCH-IND2)                              
863650    MOVE   ORDENADO-AR-IMPABOC    (WS-ARCH-IND2)  TO                          
863700                WS-SAR-IMPABOC    (WS-ARCH-IND2)                              
863750    MOVE   ORDENADO-AR-IMPABONC   (WS-ARCH-IND2)  TO                          
863800                WS-SAR-IMPABONC   (WS-ARCH-IND2)                              
863850    MOVE   ORDENADO-AR-IMPCARC    (WS-ARCH-IND2)  TO                          
863900                WS-SAR-IMPCARC    (WS-ARCH-IND2)                              
863950    MOVE   ORDENADO-AR-IMPCARNC   (WS-ARCH-IND2)  TO                          
864000                WS-SAR-IMPCARNC   (WS-ARCH-IND2).                             
864050                                                                              
864100 001118-MUEVE-FORZADO.                                                        
864150     IF ORD-CVE-VOUCHER-NAL                                                   
864200        MOVE 1    TO WS-SC-MOV-FORZADO.                                       
864250                                                                              
864300 001118-MUEVE-FECHA.                                                          
864350     IF ORDENADO-TB-PRODUCTO = 66                                             
864400       IF ORDENADO-TB-FECHA NOT = WS-FECHA-LIN                                
864450           MOVE ORDENADO-TB-FECHA TO WS-FECHA                                 
864500           STRING "D",WS-FECHA DELIMITED BY SIZE INTO                         
864550               WS-SC-FTO-VARIABLE POINTER WS-POINTER.                         
864600 001118-MUEVE-REFALFA.                                                        
864650     IF ORDENADO-TB-LEYENDA   > SPACES  AND ORDENADO-TB-INDLEY > 0            
864700        MOVE ORDENADO-TB-LEYENDA TO WS-LEYENDA                                
864750        MOVE ORDENADO-TB-INDLEY  TO WS-INDLEY                                 
864800        STRING "B",WS-INDLEY,WS-LEYENDA DELIMITED BY SIZE INTO                
864850               WS-SC-FTO-VARIABLE POINTER WS-POINTER.                         
864900 001118-MUEVE-MEDACC.                                                         
864950     MOVE 0 TO WS-TIPMEDACC                                                   
865000     IF ORDENADO-TB-CTACHEQ > 0                                               
865050        MOVE 1                   TO WS-TIPMEDACC                              
865100        MOVE ORDENADO-TB-SUCPROM TO WS-SUCCH                                  
865150        MOVE ORDENADO-TB-CTACHEQ TO WS-CTACH                                  
865200     ELSE                                                                     
865250     IF ORDENADO-TB-NUMTB  > 0                                                
865300        MOVE 2                   TO WS-TIPMEDACC                              
865350        MOVE ORDENADO-TB-NUMTB   TO WS-TARJETA.                               
865400     IF WS-TIPMEDACC > 0                                                      
865450        STRING "C",WS-TIPMEDACC,WS-TARJETA DELIMITED BY SIZE INTO             
865500              WS-SC-FTO-VARIABLE POINTER WS-POINTER.                          
865550 001118-MUEVE-REFINTNAL.                                                      
865600     IF ORDENADO-TB-REFINTNAL > SPACES                                        
865650        STRING "F",ORDENADO-TB-REFINTNAL DELIMITED BY SIZE INTO               
865700              WS-SC-FTO-VARIABLE POINTER WS-POINTER.                          
865750 001118-MUEVE-AUTORIZ.                                                        
865800*    MOVE ORDENADO-TB-AUTORIZ TO WS-AUTORIZ                                   
865850*    STRING "R",WS-AUTORIZ DELIMITED BY SIZE INTO                             
865900*           WS-SC-FTO-VARIABLE POINTER WS-POINTER.                            
865902*    20090403 se detecto que se estan generando autorizaciones con            
865904*    mas de 6 digitos, y se truncan, lo que ha causado que  en  un            
865906*    mismo dia contable cuando a un contrato se  le  apliquen  dos            
865908*    movimientos y el segundo movimiento tiene la  misma  aut  del            
865910*    primero (porque con mucha "suerte" le toco la  misma  aut  al            
865912*    truncarse) el P010 lo rechaza por movto  duplicado,  pero  el            
865914*    P015 lo considera como  "bueno"  y  realmente  se  causa  una            
865916*    diferencia contable porque no se aplica en el S500 pero en el            
865918*    listado de dispersion se muestra como aplicado.                          
865920     MOVE ORDENADO-TB-AUTORIZ TO WS-AUTORIZ-8                                 
865922     STRING "uC",WS-AUTORIZ-8 DELIMITED BY SIZE INTO                          
865924            WS-SC-FTO-VARIABLE POINTER WS-POINTER.                            
865950 001118-MUEVE-SISORI.                                                         
866000     IF WS-STA-DISP NOT = 7                                                   
866050        IF ORDENADO-TB-PRIORIDAD = 2 OR 4 OR 7 OR 8 OR 9                      
866100           MOVE 111 TO WS-SISORI                                              
866150        ELSE                                                                  
866200        IF ORDENADO-TB-PRIORIDAD = 6                                          
866250           MOVE 152 TO WS-SISORI                                              
866300        ELSE                                                                  
866350        IF ORDENADO-TB-PRIORIDAD = 5 OR 1 OR 3                                
866400           MOVE  87 TO WS-SISORI                                              
866450        ELSE                                                                  
866500           MOVE 500 TO WS-SC-TIPMEDACC.                                       
866550      STRING "T",WS-SISORI  DELIMITED BY SIZE INTO                            
866600             WS-SC-FTO-VARIABLE POINTER WS-POINTER.                           
866605 001118-MUEVE-TIP-AUT.                                                        
866610*    SE INCLUYE EL TIPO DE AUTORIZACION QUE VIENE DE TARJETAS                 
866615*    PARA QUE SEA ENVIADO AL PASO P010 MEDIANTE EL FORMATO                    
866620*    VARIABLE "uW".                                                           
866622     IF WS88-ORDENADO-TB-TIP-AUT                                              
866625        STRING "uW", ORDENADO-TB-TIP-AUT DELIMITED BY SIZE INTO               
866630               WS-SC-FTO-VARIABLE POINTER WS-POINTER.                         
866650 001118-MUEVE-PUNTO .                                                         
866700      STRING "."  DELIMITED BY SIZE INTO                                      
866750             WS-SC-FTO-VARIABLE POINTER WS-POINTER.                           
866752*INI-STEFANINI TIPO DE CAMBIO                                                 
866754 001118-MUEVE-TIPO-CAMBIO.                                                    
866756      IF ORDENADO-TB-TC-BANXICO = ZEROES                                      
866758         MOVE SPACES               TO WS-TCAM-BANX                            
866760      ELSE                                                                    
866762         MOVE ORDENADO-TB-TC-BANXICO TO WS-TCAM-BANX-R.                       
866764                                                                              
866766      IF ORDENADO-TB-MARK-UP-EMI = ZEROES                                     
866768         MOVE SPACES               TO WS-TCAM-COM                             
866770      ELSE                                                                    
866772         MOVE ORDENADO-TB-MARK-UP-EMI TO WS-TCAM-COM-R.                       
866774                                                                              
866776      IF ORDENADO-TB-TC-VALMER = ZEROES                                       
866778         MOVE SPACES               TO WS-TCAM-VALM                            
866780      ELSE                                                                    
866782         MOVE ORDENADO-TB-TC-VALMER TO WS-TCAM-VALM-R.                        
866784                                                                              
866786      IF ORDENADO-TB-INTIMP-DLLS > 0                                          
866788         STRING "m", WS-AGRUPADOR-TC, WS-FILLER-TC                            
866790         DELIMITED BY SIZE                                                    
866792                     INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER.              
866794*FIN-STEFANINI TIPO DE CAMBIO                                                 
866796*INI EAS FASE 3                                                               
866798  001118-MUEVE-IMP-AUT .                                                      
866800       MOVE ORDENADO-TB-IMP-AUT TO WS-IMPORTE-AUTO .                          
866802       MOVE ORDENADO-TB-ORI-EAS TO WS-ORIGEN-EAS   .                          
866804                                                                              
866806       IF WS-IMPORTE-AUTO > 0 AND WS-ORIGEN-EAS = 2                           
866808          STRING "vF",WS-IMPORTE-AUTO DELIMITED                               
866810          BY SIZE INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER .                
866826*FIN EAS FASE 3                                                               
866828*INI EAS FASE 4                                                               
866830  001118-MUEVE-REFERENCIA3.                                                   
866832      MOVE ORDENADO-TB-ORI-EAS TO WS-ORIGEN-EAS   .                           
866834      IF WS-ORIGEN-EAS = 2                                                    
866836         MOVE ORDENADO-TB-INTAUTH-CODE TO WS-INTAUTH-CODE                     
866838         MOVE ORDENADO-TB-NUMTB        TO WS-NUMTB                            
866839         MOVE SPACES                   TO WS-FILLER-12                        
866840         STRING "n",WS-INTAUTH-CODE DELIMITED BY SIZE                         
866842                    SPACES FOR 01                                             
866844                    WS-NUMTB        DELIMITED BY SIZE                         
866846                    WS-FILLER-12    DELIMITED BY SIZE                         
866848                    INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER .              
866850                                                                              
866852  001118-MUEVE-REFERENCIA4.                                                   
866854      MOVE ORDENADO-TB-ORI-EAS TO WS-ORIGEN-EAS   .                           
866856      IF WS-ORIGEN-EAS = 2                                                    
866858         MOVE ORDENADO-TB-REFINTNAL                                           
866860              TO WS-REFINTNAL                                                 
866862         MOVE ORDENADO-TB-INSTITUCION-ID                                      
866864              TO WS-INSTITUCION-ID-NVO                                        
866866         MOVE ORDENADO-TB-INTAPLICACION-ID                                    
866868              TO WS-INTAPLICACION-ID                                          
866869         MOVE SPACES                                                          
866870              TO WS-FILLER-02                                                 
866871         STRING "o",WS-REFINTNAL          DELIMITED BY SIZE                   
866872                    " "                                                       
866874                    WS-INSTITUCION-ID-NVO DELIMITED BY SIZE                   
866876                    "/"                                                       
866878                    WS-INTAPLICACION-ID   DELIMITED BY SIZE                   
866880                    WS-FILLER-02          DELIMITED BY SIZE                   
866882                    INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER .              
866884*FIN EAS FASE 4                                                               
866886  001118-MUEVE-IMPORTE2 .                                                     
866888      MOVE ORDENADO-TB-IMPORTE2 TO WS-IMPORTE2                                
866900      IF WS-IMPORTE2  > 0                                                     
866950         MOVE ORDENADO-TB-CVETRAN2 TO WS-CVETRAN2                             
867000         MOVE ORDENADO-TB-IMPORTE2 TO WS-IMPORTE2                             
867050         STRING "L",WS-IMPORTE2,WS-CVETRAN2 DELIMITED                         
867100         BY SIZE INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER.                  
867105                                                                              
867110 001118-MUEVE-ID-NEGOCIO.                                                     
867115      MOVE ORDENADO-TB-ID-NEGOCIO TO WS-ID-NEGOCIO                            
867120      IF WS-ID-NEGOCIO > 0                                                    
867125          STRING "Z", WS-ID-NEGOCIO DELIMITED BY SIZE INTO                    
867130                 WS-SC-FTO-VARIABLE POINTER WS-POINTER.                       
867135                                                                              
867150 001119-MUEVE-TIPMEDACC.                                                      
867200      MOVE 0                   TO WS-SC-TIPMEDACC .                           
867250      IF ORDENADO-TB-PRIORIDAD = 1 OR 6                                       
867300         MOVE 1                TO WS-SC-TIPMEDACC.                            
867302                                                                              
867304*INI BSR. MONEDA ORIGEN                                                       
867306 001118-MUEVE-MONEDA-ORIGEN.                                                  
867308      IF ORDENADO-TB-INTIMP-DLLS > 0                                          
867310         MOVE ORDENADO-TB-INTIMP-DLLS      TO WS-IMPDLLS-ORI                  
867312         MOVE ORDENADO-TB-INTCODIGO-MONEDA TO WS-CODMONEDA-ORI                
867313         MOVE SPACES                       TO WS-FILLER-ORI                   
867314         STRING "l",WS-CODMONEDA-ORI,WS-IMPDLLS-ORI,WS-FILLER-ORI             
867315         DELIMITED BY SIZE                                                    
867316                     INTO WS-SC-FTO-VARIABLE POINTER WS-POINTER.              
867318*FIN BSR. MONEDA ORIGEN                                                       
867320                                                                              
867350 001120-ESPERA-RESPUESTA.                                                     
867400      MOVE 0 TO WS-ESPERACOMS-TIPO-EVENTO.                                    
867450      PERFORM 002010-ESPERA-SOPCOMS UNTIL                                     
867500              WS-ESPERACOMS-TIPO-EVENTO NOT = 0.                              
867550      IF WS-ESPERACOMS-TIPO-EVENTO NOT = 1                                    
867600         IF WS-SGDA-VUELTA NOT = 2                                            
867650            MOVE WS-ESPERACOMS-TIPO-EVENTO TO                                 
867700                 WKS-ESPERACOMS-TIPO-EVENTO                                   
867720            MOVE COMS-IN-STATUS-KEY  TO WKS-COMS-IN-STATUS-KEY                
867750            MOVE "E"             TO WKS-TIPO-LJ                               
867800            MOVE 020801          TO WKS-CODIGO-LJ                             
867850            STRING "ESPERACOMS " WKS-ESPERACOMS-TIPO-EVENTO                   
867870                   " COMS-IN-STATUS-KEY " WKS-COMS-IN-STATUS-KEY              
867900                   DELIMITED BY SIZE INTO TEXTO-LJ                            
867950            PERFORM 00000000-LLAMA-DISPLAY-STRING.                            
868000*     IF WS-MONITOREO = 1                                                     
868050*        DISPLAY "S500-P015: O HEADER  "WS-HEADER-SECAS                       
868100*        DISPLAY "S500-P015: O HDR AMP "WS-HDR-AMPLIADO                       
868150*        DISPLAY "S500-P015: O SA0     "WS-MSG-SA0                            
868200*        DISPLAY "S500-P015: O SA2     "WS-MSG-SA2                            
868250*        DISPLAY "S500-P015: O MSG     "WS-SOL-MOVCONTABLE.                   
868300                                                                              
868350      IF WS-ESPERACOMS-TIPO-EVENTO = 1 OR 5                                   
868400         IF COMS-IN-STATUS-KEY = 99                                           
868450            IF WS-END-OF-PROGRAM = 1                                          
868500               MOVE 2 TO WS-END-OF-PROGRAM                                    
868550            ELSE                                                              
868600               MOVE "I"             TO WKS-TIPO-LJ                            
868650               MOVE 020801          TO WKS-CODIGO-LJ                          
868700               STRING "RECIBI DISABLE INESPERADO *******"                     
868750                      DELIMITED BY SIZE INTO TEXTO-LJ                         
868800               PERFORM 00000000-LLAMA-DISPLAY-STRING                          
868850               MOVE 3             TO WS-END-OF-PROGRAM                        
869100         ELSE                                                                 
869150            MOVE WS-SA2-AUTORIZACION TO WS-LLAVE-CONF                         
869200                                   WS-ULTREG-REC                              
869250            IF WS-SA2-ESTADO = 1                                              
869300           OR  (WS-SA2-ESTADO = 2 AND (WS-RESR-CLAVE-RECHAZO =1413            
869350                                       OR  1113))                             
869400               MOVE 2 TO WS-TB-TIPERROR                                       
869450               MOVE 0 TO WS-TB-NUMERROR                                       
869500               PERFORM 001190-CONFIRMA-ORDENADO                               
869550            ELSE                                                              
869555            IF WS-SA2-ESTADO = 2 AND WS-RESR-CLAVE-RECHAZO = 2588             
869560               MOVE 2                     TO WS-TB-TIPERROR                   
869565               MOVE WS-RESR-CLAVE-RECHAZO TO WS-TB-NUMERROR                   
869570               PERFORM 001190-CONFIRMA-ORDENADO                               
869575            ELSE                                                              
869600            IF WS-SA2-ESTADO = 2 AND WS-RESR-CLAVE-RECHAZO = 1443             
869650               MOVE "I"             TO WKS-TIPO-LJ                            
869700               MOVE 020901          TO WKS-CODIGO-LJ                          
869750               STRING "LA LIBRERIA DEL S408 NO ESTA DISPONIBLE, "             
869800                      "VERIFICARLO Y LANZAR DE NUEVO EL P015 "                
869850                      DELIMITED BY SIZE INTO TEXTO-LJ                         
869900               PERFORM 00000000-LLAMA-DISPLAY-STRING                          
869950               MOVE 1 TO WS-EOF-ORDCM WS-EOF-CTOS                             
870000                         WS-FIN-ANORMAL                                       
870050                         WS-END-OF-PROGRAM                                    
870100            ELSE                                                              
870150            IF WS-SA2-ESTADO = 0                                              
870200               MOVE 1           TO WS-TB-TIPERROR                             
870250               MOVE 0           TO WS-TB-NUMERROR                             
870300               PERFORM 001190-CONFIRMA-ORDENADO                               
870350            ELSE                                                              
870400               MOVE 3                    TO WS-TB-TIPERROR                    
870450               MOVE WS-RESR-CLAVE-RECHAZO TO WS-TB-NUMERROR                   
870500               PERFORM 001190-CONFIRMA-ORDENADO                               
870550       ELSE                                                                   
870600         IF WS-END-OF-PROGRAM = 1 OR WS-SGDA-VUELTA = 2                       
870650            NEXT SENTENCE                                                     
870700         ELSE                                                                 
870750            MOVE 1              TO WS-TB-TIPERROR                             
870800            MOVE 0              TO WS-TB-NUMERROR                             
870850            MOVE WS-LLAVE-ORDCM TO WS-LLAVE-CONF                              
870900            PERFORM 001190-CONFIRMA-ORDENADO.                                 
870950                                                                              
871000*    SE PONEN EN LA LOG DE CORRIDA DEL P015 LOS MSGS RETRASADOS               
871050     IF WKS-ESTAMOS-EN-ESPERA AND                                             
871100        WS-ULTREG-REC < WKS-ULTMSG AND                                        
871150        WS-ESPERACOMS-TIPO-EVENTO = 1                                         
871200        PERFORM 000000-GRABA-MSG-RETRASADO.                                   
871250                                                                              
871300*    VERIFICAR SI INICIA O NO EL TIEMPO DE ESPERA PARA CAPTURAR               
871350*    MENSAJES DE LA RED QUE SE ATRASARON CON RESPECTO AL ULTIMO               
871400*    MENSAJE ENVIADO Y QUE YA FUE RECIBIDO,  ESTO  SOLO  EN  LA               
871450*    SEGUNDA VUELTA DE ENVIO DE MENSAJES.                                     
871452                                                                              
871454     IF WS-SGDA-VUELTA > 1                                                    
871456           IF WS-ULTREG-REC NOT = WS-ULTREG-REC-ANT                           
871458              MOVE WS-ULTREG-REC TO WS-ULTREG-REC-ANT                         
871460              MOVE 0             TO WS-ULTREG-REC-IGUAL                       
871462           ELSE                                                               
871464              IF WS-ULTREG-REC-ANT > 0 AND                                    
871466                 WS-ESPERACOMS-TIPO-EVENTO = 4                                
871468                 IF WS-ULTREG-REC-IGUAL < 30                                  
871470                    ADD 1        TO WS-ULTREG-REC-IGUAL                       
871472                 ELSE                                                         
871474                    MOVE WS-ULTREG-ENV TO WS-ULTREG-REC                       
871476                                          WS-ULTREG-REC-ANT.                  
871478                                                                              
871500     IF WS-ULTREG-ENV  = WS-ULTREG-REC AND                                    
871550        WS-SGDA-VUELTA = 2 AND                                                
871600        NOT WKS-ESTAMOS-EN-ESPERA                                             
871650        PERFORM 000000-INICIO-ESPERA.                                         
871700                                                                              
871750     IF WKS-ESTAMOS-EN-ESPERA                                                 
871800        PERFORM 000000-VERIF-FIN-ESPERA.                                      
871850                                                                              
871900 001190-CONFIRMA-ORDENADO.                                                    
872150     PERFORM 001192-CONFIRMA-ARCHIVO.                                         
872200                                                                              
872250 001192-CONFIRMA-ARCHIVO.                                                     
872300      MOVE 0 TO WS-INVKEY-CONF.                                               
872350      MOVE WS-LLAVE-ORDCM TO WS-LLAVE-ORDCM-PTE.                              
872400      IF WS-LLAVE-CONF NOT = WS-LLAVE-ORDCM                                   
872450         MOVE WS-LLAVE-CONF  TO WS-LLAVE-ORDCM                                
872500         PERFORM 001194-LEE-CONFIRMACION.                                     
872550      IF WS-INVKEY-CONF = 0                                                   
872600         IF WS-IND-ELIDISP = 0                                                
872650            IF ORDENADO-TB-TIPERROR = 2                                       
872700               MOVE 1 TO WS-INVKEY-CONF                                       
872750            ELSE                                                              
872800               MOVE WS-TB-TIPERROR TO ORDENADO-TB-TIPERROR                    
872850               MOVE WS-TB-NUMERROR TO ORDENADO-TB-NUMERROR                    
872900               PERFORM 001196-CONFIRMA-MSG-12                                 
872950         ELSE                                                                 
873000            IF WS-TB-TIPERROR = 2 AND ORDENADO-TB-STAELIM = 3                 
873050               MOVE 4              TO ORDENADO-TB-STAELIM                     
873100               MOVE WS-TB-NUMERROR TO ORDENADO-TB-NERRORELI                   
873150            ELSE                                                              
873200               IF ORDENADO-TB-STAELIM = 2 OR 4                                
873250                  MOVE 1 TO WS-INVKEY-CONF                                    
873300               ELSE                                                           
873350               IF WS-TB-TIPERROR = 3 AND (WS-TB-NUMERROR = 1111 OR            
873400                                                           1408)              
873450                  IF ORDENADO-TB-STAELIM = 0                                  
873500                     MOVE 1              TO ORDENADO-TB-STAELIM               
873550                     MOVE WS-TB-NUMERROR TO ORDENADO-TB-NERRORELI             
873600                  ELSE                                                        
873650                     MOVE 3              TO ORDENADO-TB-STAELIM               
873700                     MOVE 1437           TO ORDENADO-TB-NERRORELI             
873750               ELSE                                                           
873800                  MOVE WS-TB-TIPERROR TO ORDENADO-TB-STAELIM                  
873850                  MOVE WS-TB-NUMERROR TO ORDENADO-TB-NERRORELI.               
873900      IF WS-INVKEY-CONF = 0                                                   
873950         WRITE REG-ORDENADO INVALID KEY                                       
874000               MOVE "E"             TO WKS-TIPO-LJ                            
874050               MOVE 010105          TO WKS-CODIGO-LJ                          
874100               STRING "ERROR AL GRABAR EN ARCHIVO ORDENADO-CM "               
874150                      "EL REGISTRO CONFIRMADO "                               
874200                      DELIMITED BY SIZE INTO TEXTO-LJ                         
874250               PERFORM 00000000-LLAMA-DISPLAY-STRING.                         
874300      MOVE LOW-VALUES TO REG-ORDENADO.                                        
874350      MOVE WS-LLAVE-ORDCM-PTE TO WS-LLAVE-ORDCM.                              
874400 001194-LEE-CONFIRMACION.                                                     
874450      READ ORDENADO-CM INVALID KEY                                            
874500           MOVE 0015                      TO WS-NO-DISPLAY                    
874550           MOVE "PARA CONFIRMAR        "  TO WS-DISP-ADICIONAL                
874600           PERFORM 00000000-LLAMA-DISPLAY-ADIC                                
874650           MOVE 1 TO WS-INVKEY-CONF.                                          
874700                                                                              
874750 001196-CONFIRMA-MSG-12.                                                      
874800*    CONFIRMAR EL MSG 12 SIGNIFICA QUE DESPUES DE EL,  VIENEN  LOS            
874850*    PLANCHADOS DE AUTORIZACIONES SEMANALES Y  YA  NO  ES  VALIDO,            
874900*    ENVIAR EN UNA SEGUNDA RONDA LOS REGISTROS CON CVE 0526 O 0527            
874950*    ANTERIORES EN FECHA A LA AUTORIZACION DE PLANCHADO SEMANAL.              
875000*    UNA  ALTA  DE  AUTORIZACION  ( CVE  0526 )  O  UNA  BAJA   DE            
875050*    AUTORIZACION (CVE 0527) ANTERIORES NO SE HAN  CONFIRMADO  POR            
875100*    ALGUNA DE LAS SIGUIENTES DOS RAZONES :                                   
875150*       EL MSG CON CVE 0526 O 0527 ANTERIORES EN FECHA A LA                   
875200*       AUTORIZACION DE PLANCHADO SEMANAL                                     
875250*       1) NO HA REGRESADO AL P015.                                           
875300*       2) COMS LO REGRESA PORQUE NO LO PUDO ENTREGAR.                        
875350     IF ORDENADO-TB-CLAVE =  50                                               
875400        MOVE WS-LLAVE-ORDCM       TO WKS-LLAVE-MSG-12                         
875450        MOVE 1                    TO WKS-MSG-12-CONFIRMADO-VA.                
875500                                                                              
875550 002000-ENVIA-COMS.                                                           
875600      MOVE 1                      TO COMS-OUT-COUNT.                          
875650      MOVE 0                      TO COMS-OUT-STATUS-KEY.                     
875700      MOVE WS-SA0-LONG            TO COMS-OUT-TEXT-LENGTH.                    
875750      MOVE WS-AG-SALIDA-DESG      TO COMS-OUT-AGENDA.                         
875800      MOVE WS-DEFAULTSTATION-DESG TO COMS-OUT-DESTINATION.                    
875850      SEND COMS-OUT FROM WS-MENSAJE-DIALOGO.                                  
875900      IF WS-MONITOREO = 1                                                     
875950         MOVE "E"             TO WKS-TIPO-LJ                                  
876000         MOVE 020801          TO WKS-CODIGO-LJ                                
876050         STRING "I HEADER  "     WS-HEADER-SECAS                              
876100                "I HDR AMP "     WS-HDR-AMPLIADO                              
876150                "I SA0     "     WS-MSG-SA0                                   
876200                "I SA2     "     WS-MSG-SA2                                   
876250         DELIMITED BY SIZE INTO TEXTO-LJ                                      
876300         PERFORM 00000000-LLAMA-DISPLAY-STRING                                
876350         MOVE WS-SOL-MOVCONTABLE TO WS-DISPLAY                                
876400         MOVE "E"             TO WKS-TIPO-LJ                                  
876450         MOVE 020801          TO WKS-CODIGO-LJ                                
876500         STRING "I MSG1    "     WS-DISPLAY1                                  
876550*               "I MSG2    "     WS-DISPLAY2                                  
876600*               "I MSG3    "     WS-DISPLAY3                                  
876650*               "I MSG4    "     WS-DISPLAY4                                  
876700         DELIMITED BY SIZE INTO TEXTO-LJ                                      
876750         PERFORM 00000000-LLAMA-DISPLAY-STRING                                
876760         STRING "I MSG2    "     WS-DISPLAY2                                  
876770         DELIMITED BY SIZE INTO TEXTO-LJ                                      
876780         PERFORM 00000000-LLAMA-DISPLAY-STRING.                               
876800      IF WS-HDR-RESULT = 32                                                   
876850         MOVE 97 TO COMS-OUT-STATUS-KEY.                                      
876900 002010-ESPERA-SOPCOMS.                                                       
876950      CALL "ESPERACOMS OF SOPORTECOMS"                                        
877000           USING  WS-ESPERACOMS-TIEMPO                                        
877050           GIVING WS-ESPERACOMS-TIPO-EVENTO.                                  
877100      IF WS-ESPERACOMS-TIPO-EVENTO = 1 OR 5                                   
877150         PERFORM 002020-RECEIVE-COMS                                          
877200      ELSE                                                                    
877250      IF WS-ESPERACOMS-TIPO-EVENTO = 2                                        
877300         MOVE 0 TO WS-ESPERACOMS-TIPO-EVENTO                                  
877350         ACCEPT WS-MENSAJE                                                    
877400      ELSE                                                                    
877450      IF WS-ESPERACOMS-TIPO-EVENTO = 3                                        
877500         MOVE 0 TO WS-ESPERACOMS-TIPO-EVENTO                                  
877550      ELSE                                                                    
877600      IF WS-ESPERACOMS-TIPO-EVENTO = 4                                        
877650         NEXT SENTENCE                                                        
877700      ELSE                                                                    
877750         MOVE WS-ESPERACOMS-TIPO-EVENTO   TO                                  
877800              WKS-ESPERACOMS-TIPO-EVENTO                                      
877850         MOVE "E"             TO WKS-TIPO-LJ                                  
877900         MOVE 020801          TO WKS-CODIGO-LJ                                
877950         STRING "EVENTO NO CONOCIDO "                                         
878000                "EL REGISTRO CONFIRMADO "                                     
878050                WKS-ESPERACOMS-TIPO-EVENTO                                    
878100                DELIMITED BY SIZE INTO TEXTO-LJ                               
878150         PERFORM 00000000-LLAMA-DISPLAY-STRING.                               
878152                                                                              
878154     IF WS-ESPERACOMS-TIPO-EVENTO = 5                                         
878156        IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE FALSE                     
878158           MOVE WS-ESPERACOMS-TIPO-EVENTO TO                                  
878160                WKS-ESPERACOMS-TIPO-EVENTO                                    
878162           MOVE COMS-IN-STATUS-KEY  TO WKS-COMS-IN-STATUS-KEY                 
878164           MOVE "E"                 TO WKS-TIPO-LJ                            
878166           MOVE 020801              TO WKS-CODIGO-LJ                          
878168           STRING "(ARCHIVO ORDENADO-CM CLOSED) ESPERACOMS "                  
878170                  WKS-ESPERACOMS-TIPO-EVENTO                                  
878172                  " COMS-IN-STATUS-KEY " WKS-COMS-IN-STATUS-KEY               
878174                  DELIMITED BY SIZE INTO TEXTO-LJ                             
878176           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
878178           IF COMS-IN-STATUS-KEY NOT = 99                                     
878180              MOVE 0                TO WS-ESPERACOMS-TIPO-EVENTO.             
878200                                                                              
878250 002020-RECEIVE-COMS.                                                         
878300      RECEIVE COMS-IN MESSAGE INTO WS-MENSAJE-DIALOGO                         
878350      NO DATA                                                                 
878400         NEXT SENTENCE.                                                       
878450                                                                              
878500 000000-INICIO-ESPERA.                                                        
878550*    OBTIENE FECHA Y HORA DE LA MAQUINA EN FORMATO AAMD                       
878600*    LA FECHA DE MAQUINA LA DEJA EN WKS-FEC-MAQ-AAMD                          
878650     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
878700                                                                              
878750*    SACA LA HORA EN LA QUE LLEGO EL ULTIMO MSG PARA ESPERAR                  
878800*    A PARTIR DE AHI, N MINUTOS.                                              
878850     MOVE WKS-HRA-MAQ-HH          TO WS-HORA-HH-INI-ESP                       
878900                                     WS-HORA-HH-FIN-ESP.                      
878950     MOVE WKS-HRA-MAQ-MM          TO WS-HORA-MM-INI-ESP                       
879000                                     WS-HORA-MM-FIN-ESP.                      
879050     ADD  WKS-MINUTOS-A-ESPERAR   TO WS-HORA-MM-FIN-ESP.                      
879100     IF WS-HORA-MM-FIN-ESP > 59                                               
879150        DIVIDE WS-HORA-MM-FIN-ESP BY 60 GIVING WS-ESPERA-COCIENTE             
879200               REMAINDER WS-ESPERA-RESIDUO                                    
879250        ADD  WS-ESPERA-COCIENTE   TO WS-HORA-HH-FIN-ESP                       
879300        MOVE WS-ESPERA-RESIDUO    TO WS-HORA-MM-FIN-ESP                       
879350        IF WS-HORA-HH-FIN-ESP > 23                                            
879400           DIVIDE WS-HORA-HH-FIN-ESP BY 24                                    
879450                  GIVING    WS-ESPERA-COCIENTE                                
879500                  REMAINDER WS-ESPERA-RESIDUO                                 
879550           MOVE WS-ESPERA-RESIDUO TO WS-HORA-HH-FIN-ESP.                      
879600                                                                              
879650*    SE OBTIENE EL ULTIMO MSG DEL ARCHIVO QUE SE ENVIA                        
879700     MOVE WS-ULTREG-ENV           TO WKS-ULTMSG.                              
879750                                                                              
879800*    PONE LA HORA DE INICIO DE ESPERA EN LOG DEL P015                         
879850     MOVE "E"                     TO WKS-TIPO-LJ.                             
879900     MOVE 020801                  TO WKS-CODIGO-LJ.                           
879950     STRING "SIENDO EL MENSAJE # " WKS-ULTMSG " EL ULTIMO,"                   
880000            " SE INICIA EL TIEMPO DE ESPERA PARA MENSAJES RETRASA"            
880050            "DOS A LAS " WKS-HRA-MAQ-HH  ":" WKS-HRA-MAQ-MM                   
880100            ":" WKS-HRA-MAQ-SS " Y TERMINA A LAS "                            
880150            WS-HORA-HH-FIN-ESP ":" WS-HORA-MM-FIN-ESP                         
880200            ":" WKS-HRA-MAQ-SS                                                
880250            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
880300     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
880350                                                                              
880400*    SE ENCIENDE EL BOOLEANO DE QUE ESTAMOS EN TIEMPO DE ESPERA.              
880450     MOVE 1       TO WKS-ESTAMOS-EN-ESPERA-VA.                                
880500                                                                              
880550 000000-GRABA-MSG-RETRASADO.                                                  
880600     MOVE "E"                     TO WKS-TIPO-LJ.                             
880650     MOVE 020801                  TO WKS-CODIGO-LJ.                           
880700     STRING "LLEGA MENSAJE RETRASADO  " WS-LLAVE-CONF                         
880750            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
880800     PERFORM 00000000-LLAMA-DISPLAY-STRING.                                   
880850                                                                              
880900 000000-VERIF-FIN-ESPERA.                                                     
880950*    SACA LA HORA PARA VERIFICAR SI YA TRANSCURRIERON N MINUTOS               
881000     PERFORM 20000000-CALL-GENERALSUPPORT.                                    
881050                                                                              
881100     IF WKS-HRA-MAQ-HH > WS-HORA-HH-FIN-ESP                                   
881150        MOVE 1                    TO WKS-ESPERO-VA                            
881200        MOVE 0                    TO WKS-ESTAMOS-EN-ESPERA-VA                 
881250     ELSE IF WKS-HRA-MAQ-HH = WS-HORA-HH-FIN-ESP                              
881300        IF WKS-HRA-MAQ-MM NOT < WS-HORA-MM-FIN-ESP                            
881350           MOVE 1                 TO WKS-ESPERO-VA                            
881400           MOVE 0                 TO WKS-ESTAMOS-EN-ESPERA-VA.                
881450                                                                              
881500     IF WKS-PASARON-N-MIN                                                     
881550        MOVE "E"                  TO WKS-TIPO-LJ                              
881600        MOVE 020801               TO WKS-CODIGO-LJ                            
881650        STRING "SE TERMINA EL TIEMPO DE ESPERA PARA MENSAJES RETR"            
881700               "ASADOS A LAS " WKS-HRA-MAQ-HH  ":"                            
881750               WKS-HRA-MAQ-MM ":" WKS-HRA-MAQ-SS                              
881800               DELIMITED BY SIZE INTO TEXTO-LJ                                
881850        PERFORM 00000000-LLAMA-DISPLAY-STRING.                                
881900                                                                              
882000 002030-LEE-RECHAZOS.                                                         
882050      MOVE 0 TO WS-EOF-ORDCM.                                                 
882100      PERFORM 002035-LEE-ARCHORDCM VARYING WS-LLAVE-ORDCM FROM 2              
882150              BY 1 UNTIL WS-EOF-ORDCM = 1.                                    
882200      SUBTRACT 1 FROM WS-LLAVE-ORDCM.                                         
882250      PERFORM 002050-ARMA-RECHAZOS.                                           
882300 002035-LEE-ARCHORDCM.                                                        
882350      READ ORDENADO-CM INVALID KEY                                            
882400                       MOVE 1 TO WS-EOF-ORDCM.                                
882450      IF REG-ORDENADO-TR = "9"                                                
882500         MOVE 1 TO WS-EOF-ORDCM.                                              
882550      IF WS-EOF-ORDCM = 0 AND REG-ORDENADO-TR = "2"                           
882600         IF ORD-TB-CTAMAEMN-EN-MN OR ORD-TB-OTROS-MOVTOS                      
882650            MOVE 1        TO WKS-IND-MONEDA                                   
882700         ELSE IF ORD-TB-CTAMAEDLS-EN-MN                                       
882750            MOVE 2        TO WKS-IND-MONEDA                                   
882800         ELSE                                                                 
882850            MOVE 3        TO WKS-IND-MONEDA.                                  
882852                                                                              
882854     IF WS-EOF-ORDCM = 0                         AND                          
882856        REG-ORDENADO-TR = "2"                    AND                          
882858        ( ORDENADO-TB-TIPERROR = 0 OR 1 OR 3 )                                
882860        IF ORDENADO-TB-PRODUCTO = 66             AND                          
882862           ( ORDENADO-TB-INSTRUM = 11 OR 12 )                                 
882864*INI EAS FASE 3                                                               
882866           IF ORDENADO-TB-ORI-EAS = 2                                         
882868              MOVE 4 TO WKS-IND-TOTREC-PIM                                    
882870           ELSE                                                               
882872              MOVE 2 TO WKS-IND-TOTREC-PIM                                    
882874        ELSE                                                                  
882876        IF ORDENADO-TB-ORI-EAS = 2                                            
882878           MOVE 3 TO WKS-IND-TOTREC-PIM                                       
882880        ELSE                                                                  
882882           MOVE 1 TO WKS-IND-TOTREC-PIM .                                     
882884*           MOVE 2         TO WKS-IND-TOTREC-PIM                              
882886*        ELSE                                                                 
882888*           MOVE 1         TO WKS-IND-TOTREC-PIM.                             
882890*FIN EAS FASE 3                                                               
882900      IF WS-EOF-ORDCM = 0 AND                                                 
882950         ORDENADO-TB-TIPERROR = 0 OR 1 OR 3                                   
883000         AND REG-ORDENADO-TR = "2"                                            
883050         IF ORD-CVE-ABONOS OR ORD-CVE-ABOAUT                                  
883100            ADD ORDENADO-TB-IMPORTE TO                                        
883150                WS-TOTRECABO(WKS-IND-TOTREC-PIM,                              
883170                             ORDENADO-TB-PRIORIDAD,WKS-IND-MONEDA)            
883200            IF ORDENADO-TB-CLAVE = 3024                                       
883250               SUBTRACT ORDENADO-TB-IMPORTE FROM                              
883300               WS-TOTRECABO(WKS-IND-TOTREC-PIM,                               
883320                            ORDENADO-TB-PRIORIDAD,WKS-IND-MONEDA)             
883350            ELSE                                                              
883400               NEXT SENTENCE                                                  
883450         ELSE                                                                 
883500         IF ORD-CVE-CARGOS OR ORD-CVE-CGOAUT                                  
883550            ADD ORDENADO-TB-IMPORTE TO                                        
883600                WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                              
883620                             ORDENADO-TB-PRIORIDAD,WKS-IND-MONEDA)            
883650            IF ORDENADO-TB-CLAVE = 4053                                       
883700               ADD ORDENADO-TB-IMPORTE2 TO                                    
883750               WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                               
883770                            ORDENADO-TB-PRIORIDAD,WKS-IND-MONEDA)             
883800            ELSE IF ORD-CVE-ISR-CGOAUT                                        
883850*              LOS MOVIMIENTOS RECHAZADOS QUE MANDA  EL  S152  CON            
883900*              CLAVE 4009 QUE SEAN RECHAZADOS,  NO  DEBEN  GENERAR            
883950*              INICIATIVA, PERO SI SALEN EN EL LISTADO DE RECHAZOS            
884000               SUBTRACT ORDENADO-TB-IMPORTE FROM                              
884050               WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                               
884070                            ORDENADO-TB-PRIORIDAD,WKS-IND-MONEDA).            
884100                                                                              
884150     IF WS-EOF-ORDCM = 0 AND                                                  
884200        ORDENADO-TB-TIPERROR = 0 OR 1 OR 3                                    
884250        AND REG-ORDENADO-TR = "2"                                             
884300        PERFORM 002040-SUC-D-CTO-RECHAZADO.                                   
884350                                                                              
884400 002040-SUC-D-CTO-RECHAZADO.                                                  
884450     MOVE LOW-VALUES                 TO WS-S016-0103-ENTRADA.                 
884500     MOVE ORDENADO-TB-NUMCONT        TO WS-S016-0103-CTA-NUM-I.               
884550     MOVE 2                          TO WS-S016-0103-CTR-OPCION-I.            
884600                                                                              
884650     PERFORM 20000016-L422-B04SXCTAPRD.                                       
884700                                                                              
884750     IF WS-S016-0103-RESULT = 0                                               
884800        MOVE WS-S016-0103-CTA-NUMSUC-S TO ORDENADO-TB-SUC-RCHAZO              
884850     ELSE                                                                     
884900        MOVE ORDENADO-TB-SUCPROM     TO ORDENADO-TB-SUC-RCHAZO                
884950        MOVE "E"                     TO WKS-TIPO-LJ                           
885000        MOVE 020901                  TO WKS-CODIGO-LJ                         
885050        MOVE WS-S016-0103-RESULT     TO WS-R422-ERROR-FMT                     
885100        MOVE WS-S016-0103-CTA-NUM-S  TO WS-R422-CONTRATO                      
885150        STRING "ERROR (" WS-R422-ERROR-FMT                                    
885200               ") EN EL LLAMADO AL ENTRY POINT "                              
885250               "S016_L422_B04SXCTAPRD AL BUSCAR LA SUC. PROM. "               
885300               "DEL CONTRATO " WS-R422-CONTRATO                               
885350               DELIMITED BY SIZE INTO TEXTO-LJ                                
885400*       PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
885420        MOVE SPACES                  TO TEXTO-LJ.                             
885450                                                                              
885500     WRITE REG-ORDENADO INVALID KEY                                           
885550           MOVE 0014                      TO WS-NO-DISPLAY                    
885600           MOVE "LA SUC DEL RECHAZO    "  TO WS-DISP-ADICIONAL                
885650           PERFORM 00000000-LLAMA-DISPLAY-ADIC.                               
885700                                                                              
885750 002050-ARMA-RECHAZOS.                                                        
885800      MOVE 0              TO WS-EOF-ORDPTE.                                   
885850      MOVE WS-LLAVE-ORDCM TO WS-LLAVE-ORDCM-PTE.                              
885900      PERFORM 002055-VE-SIHAY-REGISTROS UNTIL WS-EOF-ORDPTE = 1.              
885950      SUBTRACT 1 FROM WS-LLAVE-ORDCM.                                         
886000      MOVE  1 TO ORDENADO-TB-NUMCONT  ORDENADO-TB-CAJA.                       
886050      MOVE WS-OCCAS(WS-NODO) TO ORDENADO-TB-SUCPROM.                          
886100      MOVE  0 TO ORDENADO-TB-NUMTB                                            
886150                 ORDENADO-TB-CTACHEQ  ORDENADO-TB-REFDOCTO                    
886200                 ORDENADO-TB-ORIGEN   ORDENADO-TB-CAUSA                       
886250                 ORDENADO-TB-STAELIM  ORDENADO-TB-FECHA                       
886300                 ORDENADO-TB-TIPERROR ORDENADO-TB-NUMERROR                    
886350                 ORDENADO-TB-MOVAELIM.                                        
886400                                                                              
886410     PERFORM 002055-ARMAREGS-INI-X-RECHS                                      
886420             VARYING WKS-IND-TOTREC-PIM FROM 1 BY 1                           
886430             UNTIL   WKS-IND-TOTREC-PIM > 4.                                  
886510                                                                              
886520      MOVE 999999 TO REG-ORDENADO-TRAILER.                                    
886530      ADD 1 TO WS-LLAVE-ORDCM                                                 
886540      MOVE "9"                TO REG-ORDENADO-TR                              
886550      WRITE REG-ORDENADO INVALID KEY                                          
886560            MOVE 0014                      TO WS-NO-DISPLAY                   
886570            MOVE "SDO EN EL TRAILER     "  TO WS-DISP-ADICIONAL               
886580            PERFORM 00000000-LLAMA-DISPLAY-ADIC.                              
886590      MOVE LOW-VALUES TO REG-ORDENADO.                                        
886600                                                                              
886700      MOVE WS-LLAVE-ORDCM-PTE TO WS-LLAVE-ORDCM.                              
886750 002055-VE-SIHAY-REGISTROS.                                                   
886800      ADD 1 TO WS-LLAVE-ORDCM.                                                
886850      READ ORDENADO-CM INVALID KEY                                            
886900           MOVE 1 TO WS-EOF-ORDPTE.                                           
886950      IF REG-ORDENADO-TRAILER = 999999                                        
887000         MOVE 1 TO WS-EOF-ORDPTE.                                             
887050      IF WS-EOF-ORDPTE = 0                                                    
887100         MOVE 0   TO WS-EOF-ORDCM                                             
887150         MOVE 74  TO WS-TIPO-ELIM                                             
887200         MOVE 534 TO ORDENADO-TB-CLAVE                                        
887250         MOVE 0   TO ORDENADO-TB-TIPERROR                                     
887300                     ORDENADO-TB-NUMERROR                                     
887350         MOVE "2"                TO REG-ORDENADO-TR                           
887400         WRITE REG-ORDENADO INVALID KEY                                       
887450               MOVE 0014                      TO WS-NO-DISPLAY                
887500               MOVE "ELIM NCONT            "  TO WS-DISP-ADICIONAL            
887550               PERFORM 00000000-LLAMA-DISPLAY-ADIC.                           
887600         IF WS-EOF-ORDPTE = 0                                                 
887650             MOVE LOW-VALUES TO REG-ORDENADO.                                 
887700                                                                              
887705 002055-ARMAREGS-INI-X-RECHS.                                                 
887710     PERFORM 002060-ARMAREG-RECHAZOS                                          
887715             VARYING WS-IND-TR FROM 1 BY 1                                    
887720             UNTIL   WS-IND-TR > 9.                                           
887725                                                                              
887750 002060-ARMAREG-RECHAZOS.                                                     
887800     PERFORM 02070-ARMA-RECHAZOS-XMONEDA VARYING WKS-IND-MONEDA               
887850             FROM 1 BY 1 UNTIL WKS-IND-MONEDA > 3.                            
887900                                                                              
887950 02070-ARMA-RECHAZOS-XMONEDA.                                                 
888050** WS-IND-TR , ORDENADO-TB-PRIORIDAD                                          
888100**                                                                            
888150**       1   CHEQUES -S087                                                    
888200**       3   AHORROS -S087                                                    
888250**       2,4,7,8,9 TARJETAS                                                   
888300**       5   CTA MAE -S087                                                    
888350**       6   S152                                                             
888400** WKS-IND-MONEDA ES EL INDICE QUE INDICA :                                   
888450**  1    ES UN RECHAZO DE UN MOVTO A UNA CTAMAE DE MN EN MN.                  
888500**  2    ES UN RECHAZO DE UN MOVTO A UNA CTAMAE DE DLS EN MN.                 
888550**  3    ES UN RECHAZO DE UN MOVTO A UNA CTAMAE DE DLS EN DLS.                
888555** WKS-IND-TOTREC-PIM ES EL INDICE QUE INDICA :                               
888560**  1    ES UN RECHAZO DE UN MOVIMIENTO A UNA TARJETA LIGADA A UN             
888565**       PRODUCTO INSTRUMENTO DIFERENTE A 66-11 O 66-12                       
888570**  2    ES UN RECHAZO DE UN MOVIMIENTO A UNA TARJETA LIGADA A UN             
888575**       PRODUCTO INSTRUMENTO IGUAL A 66-11 O 66-12                           
888576**  3    ES UN RECHAZO DE UN MOVIMIENTO A UNA TARJETA LIGADA A UN             
888578**       PRODUCTO INSTRUMENTO DIFERENTE A 66-11 O 66-12 EAS                   
888580**  4    ES UN RECHAZO DE UN MOVIMIENTO A UNA TARJETA LIGADA A UN             
888582**       PRODUCTO INSTRUMENTO IGUAL A 66-11 O 66-12 EAS                       
888584                                                                              
888600     MOVE 1               TO WS-CVEREC-ABO                                    
888650     MOVE 2               TO WS-CVEREC-CGO                                    
888670     MOVE WS-IND-TR       TO ORDENADO-TB-PRIORIDAD.                           
888700     MOVE 1               TO ORDENADO-TB-NUMCONT ORDENADO-TB-CAJA             
888750     IF WS-IND-TR = 3                                                         
888800        MOVE 500          TO ORDENADO-TB-PRODUCTO                             
888850        MOVE 6            TO ORDENADO-TB-INSTRUM                              
888900        MOVE 1            TO ORDENADO-TB-MONEDA                               
889000     ELSE IF WS-IND-TR = 1                                                    
889050        MOVE 1            TO ORDENADO-TB-PRODUCTO                             
889100        MOVE 1            TO ORDENADO-TB-INSTRUM                              
889150        IF WKS-IND-MONEDA = 1                                                 
889200           MOVE 1         TO ORDENADO-TB-MONEDA                               
889250        ELSE                                                                  
889300           MOVE 5         TO ORDENADO-TB-MONEDA                               
889400     ELSE IF WS-IND-TR = 6                                                    
889450        MOVE 1            TO ORDENADO-TB-PRODUCTO                             
889500        MOVE 3            TO ORDENADO-TB-INSTRUM                              
889550        MOVE 1            TO ORDENADO-TB-MONEDA                               
889600     ELSE                                                                     
889650        MOVE 66           TO ORDENADO-TB-PRODUCTO                             
889700        IF WKS-IND-MONEDA = 1                                                 
889720           IF WKS-IND-TOTREC-PIM = 1                                          
889750              MOVE 6      TO ORDENADO-TB-INSTRUM                              
889800              MOVE 1      TO ORDENADO-TB-MONEDA                               
889810           ELSE                                                               
889820              MOVE 12     TO ORDENADO-TB-INSTRUM                              
889830              MOVE 1      TO ORDENADO-TB-MONEDA                               
889850        ELSE                                                                  
889898*INI BSR. PERFILES DOLARES                                                    
889900            MOVE 15       TO ORDENADO-TB-INSTRUM                              
889902*FIN BSR. PERFILES DOLARES                                                    
889950            MOVE 5        TO ORDENADO-TB-MONEDA.                              
890025                                                                              
890050     IF WS-TOTRECABO(WKS-IND-TOTREC-PIM,                                      
890070                     WS-IND-TR,WKS-IND-MONEDA) > 0                            
890100        PERFORM 02080-INICIATIVA-ABO-TARJCRED.                                
890150                                                                              
890200     IF WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                                      
890220                     WS-IND-TR,WKS-IND-MONEDA) > 0                            
890250        PERFORM 02080-INICIATIVA-CGO-TARJCRED.                                
890255                                                                              
890260*INI EAS FASE 3                                                               
890265 02080-CAJA-EAS-TAR.                                                          
890270     IF WKS-IND-TOTREC-PIM = 3 OR 4                                           
890275        MOVE 22 TO ORDENADO-TB-CAJA                                           
890280     ELSE                                                                     
890285        MOVE 1  TO ORDENADO-TB-CAJA .                                         
890290*FIN EAS FASE 3                                                               
890300                                                                              
890350 02080-INICIATIVA-ABO-TARJCRED.                                               
890400*    LA CVE 1 ES DE ABONO, EN LA MONEDA QUE TRAE EL REGISTRO                  
890450*    LA CVE 2 ES DE CARGO, EN LA MONEDA QUE TRAE EL REGISTRO                  
890500*    LA CVE 13 ES DE ABONO, EN MONEDA 1.                                      
890550*    LA CVE 14 ES DE CARGO, EN MONEDA 1.                                      
890600*    LA CVE 15 ES DE ABONO, EN MONEDA 5.                                      
890650*    LA CVE 16 ES DE CARGO, EN MONEDA 5.                                      
890700     MOVE 0                       TO WS-EOF-ORDCM.                            
890750     MOVE WS-TOTRECABO(WKS-IND-TOTREC-PIM,                                    
890770                       WS-IND-TR,WKS-IND-MONEDA)                              
890800                                  TO ORDENADO-TB-IMPORTE.                     
890850     MOVE 1                       TO ORDENADO-TB-CLAVE.                       
890900     IF WKS-IND-MONEDA = 2                                                    
890950        MOVE 13                   TO ORDENADO-TB-CLAVE.                       
891000     IF WS-IND-TR = 2 OR 4 OR 7 OR 8 OR 9                                     
891020        IF WKS-IND-TOTREC-PIM = 1                                             
891050           MOVE 342               TO ORDENADO-TB-SUCBANCO                     
891070        ELSE                                                                  
891072*          20071015 El S111 no pudo separar el envio  al  S500  de            
891074*          los vouchers de Tarjetas Soriana  ( 66-11 y 66-12 ) por            
891076*          Sucursal (las TJ normales con Suc 342 y las de  Soriana            
891078*          con Suc 7532 ), por lo que  los  rechazos  tambien  los            
891080*          quieren en la Suc 342.                                             
891090*          MOVE 7532              TO ORDENADO-TB-SUCBANCO                     
891095           MOVE  342              TO ORDENADO-TB-SUCBANCO                     
891100     ELSE                                                                     
891150        MOVE WS-OCCAS(WS-NODO)    TO ORDENADO-TB-SUCBANCO.                    
891200     PERFORM 02080-CAJA-EAS-TAR.                                              
891250     ADD 1                        TO WS-LLAVE-ORDCM                           
891300     PERFORM 50036520-SOLICITA-AUTORIZACION                                   
891350     MOVE 3                       TO REG-ORDENADO-TR                          
891400     WRITE REG-ORDENADO INVALID KEY                                           
891450           MOVE 0014                      TO WS-NO-DISPLAY                    
891500           MOVE "RECHAZOS 1            "  TO WS-DISP-ADICIONAL                
891550           PERFORM 00000000-LLAMA-DISPLAY-ADIC.                               
891600                                                                              
891650     MOVE 511                     TO ORDENADO-TB-SUCBANCO.                    
891660*INI EAS FASE 3                                                               
891670     IF WKS-IND-TOTREC-PIM = 3 OR 4                                           
891680        MOVE 40 TO ORDENADO-TB-CAJA .                                         
891690*FIN EAS FASE 3                                                               
891700     MOVE 2                       TO ORDENADO-TB-CLAVE.                       
891750     IF WKS-IND-MONEDA = 2                                                    
891800        MOVE 16                   TO ORDENADO-TB-CLAVE                        
891850        COMPUTE ORDENADO-TB-IMPORTE ROUNDED =                                 
891900                WS-TOTRECABO(WKS-IND-TOTREC-PIM,                              
891920                             WS-IND-TR,WKS-IND-MONEDA) /                      
891950                WS-TC-TCAMBIO.                                                
892000     ADD  1                       TO WS-LLAVE-ORDCM.                          
892050     PERFORM 50036520-SOLICITA-AUTORIZACION                                   
892100     MOVE 3                       TO REG-ORDENADO-TR                          
892150     WRITE REG-ORDENADO INVALID KEY                                           
892200           MOVE 0014                      TO WS-NO-DISPLAY                    
892250           MOVE "RECHAZOS 2            "  TO WS-DISP-ADICIONAL                
892300           PERFORM 00000000-LLAMA-DISPLAY-ADIC.                               
892350                                                                              
892400 02080-INICIATIVA-CGO-TARJCRED.                                               
892450     MOVE 0                       TO WS-EOF-ORDCM.                            
892500     MOVE WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                                    
892520                       WS-IND-TR,WKS-IND-MONEDA)                              
892550                                  TO ORDENADO-TB-IMPORTE.                     
892600     MOVE 2                       TO ORDENADO-TB-CLAVE.                       
892650     IF WKS-IND-MONEDA = 2                                                    
892700        MOVE 14                   TO ORDENADO-TB-CLAVE.                       
892750     IF WS-IND-TR = 2 OR 4 OR 7 OR 8 OR 9                                     
892770        IF WKS-IND-TOTREC-PIM = 1                                             
892800           MOVE 342               TO ORDENADO-TB-SUCBANCO                     
892820        ELSE                                                                  
892822*          20071015 El S111 no pudo separar el envio  al  S500  de            
892824*          los vouchers de Tarjetas Soriana  ( 66-11 y 66-12 ) por            
892826*          Sucursal (las TJ normales con Suc 342 y las de  Soriana            
892828*          con Suc 7532 ), por lo que  los  rechazos  tambien  los            
892830*          quieren en la Suc 342.                                             
892840*          MOVE 7532              TO ORDENADO-TB-SUCBANCO                     
892845           MOVE  342              TO ORDENADO-TB-SUCBANCO                     
892850     ELSE                                                                     
892900        MOVE WS-OCCAS(WS-NODO)    TO ORDENADO-TB-SUCBANCO.                    
892950     PERFORM 02080-CAJA-EAS-TAR.                                              
893000     ADD 1                        TO WS-LLAVE-ORDCM                           
893050     PERFORM 50036520-SOLICITA-AUTORIZACION                                   
893100     MOVE 3                       TO REG-ORDENADO-TR                          
893150     WRITE REG-ORDENADO INVALID KEY                                           
893200           MOVE 0014                      TO WS-NO-DISPLAY                    
893250           MOVE "RECHAZOS 3            "  TO WS-DISP-ADICIONAL                
893300           PERFORM 00000000-LLAMA-DISPLAY-ADIC.                               
893350                                                                              
893400     MOVE 511                     TO ORDENADO-TB-SUCBANCO.                    
893410*INI EAS FASE 3                                                               
893420     IF WKS-IND-TOTREC-PIM = 3 OR 4                                           
893430        MOVE 40 TO ORDENADO-TB-CAJA .                                         
893440*FIN EAS FASE 3                                                               
893450     MOVE 1                       TO ORDENADO-TB-CLAVE                        
893500     IF WKS-IND-MONEDA = 2                                                    
893550        MOVE 15                   TO ORDENADO-TB-CLAVE                        
893600        COMPUTE ORDENADO-TB-IMPORTE ROUNDED =                                 
893650                WS-TOTRECCGO(WKS-IND-TOTREC-PIM,                              
893670                             WS-IND-TR,WKS-IND-MONEDA) /                      
893700                WS-TC-TCAMBIO.                                                
893750     ADD  1                       TO WS-LLAVE-ORDCM.                          
893800     PERFORM 50036520-SOLICITA-AUTORIZACION                                   
893850     MOVE 3                       TO REG-ORDENADO-TR                          
893900     WRITE REG-ORDENADO INVALID KEY                                           
893950           MOVE 0014                      TO WS-NO-DISPLAY                    
894000           MOVE "RECHAZOS 4            "  TO WS-DISP-ADICIONAL                
894050           PERFORM 00000000-LLAMA-DISPLAY-ADIC.                               
894100     MOVE LOW-VALUES TO REG-ORDENADO.                                         
894150                                                                              
930000 50052000-DISPERSO-ARCH-SDOPEN.                                               
930100     OPEN I-O ORDENADO-CM.                                                    
930200     MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM TO WS-ULTREG-ORDCM.             
930300     MOVE 1                                   TO WS-LLAVE-ORDCM.              
930400     PERFORM 001100-LEE-ENVIA UNTIL WS-EOF-ORDCM = 1.                         
930500*     STOP "FIN PRIMERA VUELTA"                                               
930600**                                                                            
930700*** EFECTUA UN SEGUNDO ENVIO PARA REINTENTAR MOVTOS. PENDIENTES               
930800**                                                                            
930900      IF WS-END-OF-PROGRAM = 0                                                
931000         MOVE 1 TO WS-LLAVE-ORDCM                                             
931100         MOVE 0 TO WS-EOF-ORDCM                                               
931200         MOVE 1 TO WS-SGDA-VUELTA                                             
931300         PERFORM 001100-LEE-ENVIA UNTIL WS-EOF-ORDCM = 1                      
931400         IF WS-END-OF-PROGRAM = 0                                             
931500            MOVE 2 TO WS-SGDA-VUELTA                                          
931600            MOVE 0 TO WKS-ESPERO-VA                                           
931700            PERFORM 001120-ESPERA-RESPUESTA UNTIL                             
931800                                  WS-ULTREG-ENV = WS-ULTREG-REC               
931900                                  AND WKS-PASARON-N-MIN .                     
932000                                                                              
932100     IF WS-END-OF-PROGRAM = 0                                                 
932200        PERFORM 09000000-B02CONTROL-LOCK                                      
932300        MOVE 3            TO B02-STA-DISP-LSDO                                
932400        MOVE 2            TO B02-LIBERA-SDOPEN                                
932500        PERFORM 09000000-BEGIN-TRANSACTION                                    
932600        PERFORM 09000000-B02CONTROL-STORE                                     
932700        PERFORM 09000000-END-TRANSACTION-SYNC.                                
932800                                                                              
950000***********************************************************                   
950100*         90000000 RUTINAS DE LA BASE DE DATOS            *                   
950200***********************************************************                   
950300 09000000-ABRE-BD-UPDATE.                                                     
950400     OPEN UPDATE S500BD01CAPTACION ON EXCEPTION                               
950500          MOVE 4                  TO WKS-ERROR-PROCESO-VA                     
950600          MOVE "E"                TO WKS-TIPO-LJ                              
950700          MOVE 020801             TO WKS-CODIGO-LJ                            
950800          PERFORM 09000000-ERRORES-DMSII                                      
950900          STRING "ERROR AL ABRIR LA BASE DE DATOS "                           
951000                 "ERROR " WKS-DMCATEGORY                                      
951100                 " TIPO " WKS-DMERRORTYPE                                     
951200                 " ESTR " WKS-DMSTRUCTURE                                     
951300                 DELIMITED BY SIZE INTO TEXTO-LJ                              
951400          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
951500          CALL SYSTEM DMTERMINATE.                                            
951600                                                                              
951700 09000000-B02CONTROL-FIND.                                                    
951800     PERFORM 90000002-B02CONTROL-FIND.                                        
951900     IF WS-STATUS-BASE > 0                                                    
952000        MOVE 5                  TO WKS-ERROR-PROCESO-VA                       
952100        MOVE "E"                TO WKS-TIPO-LJ                                
952200        MOVE 020801             TO WKS-CODIGO-LJ                              
952300        PERFORM 09000000-ERRORES-DMSII                                        
952400        STRING "ERROR AL LEER REGISTRO B02 DE LA BASE "                       
952500               "ERROR " WKS-DMCATEGORY                                        
952600               " TIPO " WKS-DMERRORTYPE                                       
952700               " ESTR " WKS-DMSTRUCTURE                                       
952800               DELIMITED BY SIZE INTO TEXTO-LJ                                
952900        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
953000        CALL SYSTEM DMTERMINATE.                                              
953100                                                                              
953200 09000000-B02CONTROL-LOCK.                                                    
953300     PERFORM 90000002-B02CONTROL-LOCK.                                        
953400     IF WS-STATUS-BASE > 0                                                    
953500        MOVE 6                  TO WKS-ERROR-PROCESO-VA                       
953600        MOVE "E"                TO WKS-TIPO-LJ                                
953700        MOVE 020801             TO WKS-CODIGO-LJ                              
953800        PERFORM 09000000-ERRORES-DMSII                                        
953900        STRING "ERROR AL HACER LOCK A REGISTRO B02 DE LA BASE "               
954000               "ERROR " WKS-DMCATEGORY                                        
954100               " TIPO " WKS-DMERRORTYPE                                       
954200               " ESTR " WKS-DMSTRUCTURE                                       
954300               DELIMITED BY SIZE INTO TEXTO-LJ                                
954400        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
954500        CALL SYSTEM DMTERMINATE.                                              
954600                                                                              
954700 09000000-B02CONTROL-STORE.                                                   
954800     PERFORM 90000002-B02CONTROL-STORE.                                       
954900     IF WS-STATUS-BASE > 0                                                    
955000        MOVE 7                  TO WKS-ERROR-PROCESO-VA                       
955100        MOVE "E"                TO WKS-TIPO-LJ                                
955200        MOVE 020801             TO WKS-CODIGO-LJ                              
955300        PERFORM 09000000-ERRORES-DMSII                                        
955400        STRING "ERROR AL HACER STORE A REGISTRO B02 DE LA BASE "              
955500               "ERROR " WKS-DMCATEGORY                                        
955600               " TIPO " WKS-DMERRORTYPE                                       
955700               " ESTR " WKS-DMSTRUCTURE                                       
955800               DELIMITED BY SIZE INTO TEXTO-LJ                                
955900        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
956000        CALL SYSTEM DMTERMINATE.                                              
956100                                                                              
956200 09000000-BEGIN-TRANSACTION.                                                  
956300     PERFORM 90000000-BEGIN-TRANSACTION.                                      
956400     IF WS-STATUS-BASE > 0                                                    
956500        MOVE 8                  TO WKS-ERROR-PROCESO-VA                       
956600        MOVE "E"                TO WKS-TIPO-LJ                                
956700        MOVE 020801             TO WKS-CODIGO-LJ                              
956800        PERFORM 09000000-ERRORES-DMSII                                        
956900        STRING "ERROR EN BEGIN TRANSACTION "                                  
957000               "ERROR " WKS-DMCATEGORY                                        
957100               " TIPO " WKS-DMERRORTYPE                                       
957200               " ESTR " WKS-DMSTRUCTURE                                       
957300               DELIMITED BY SIZE INTO TEXTO-LJ                                
957400        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
957500        CALL SYSTEM DMTERMINATE.                                              
957600                                                                              
957700 09000000-END-TRANSACTION.                                                    
957800     PERFORM 90000000-END-TRANSACTION.                                        
957900     IF WS-STATUS-BASE > 0                                                    
958000        MOVE 9                  TO WKS-ERROR-PROCESO-VA                       
958100        MOVE "E"                TO WKS-TIPO-LJ                                
958200        MOVE 020801             TO WKS-CODIGO-LJ                              
958300        PERFORM 09000000-ERRORES-DMSII                                        
958400        STRING "ERROR EN END TRANSACTION "                                    
958500               "ERROR " WKS-DMCATEGORY                                        
958600               " TIPO " WKS-DMERRORTYPE                                       
958700               " ESTR " WKS-DMSTRUCTURE                                       
958800               DELIMITED BY SIZE INTO TEXTO-LJ                                
958900        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
959000        CALL SYSTEM DMTERMINATE.                                              
959100                                                                              
959200 09000000-END-TRANSACTION-SYNC.                                               
959300     PERFORM 90000000-END-TRANSACTIONSYNC.                                    
959400     IF WS-STATUS-BASE > 0                                                    
959500        MOVE 10                 TO WKS-ERROR-PROCESO-VA                       
959600        MOVE "E"                TO WKS-TIPO-LJ                                
959700        MOVE 020801             TO WKS-CODIGO-LJ                              
959800        PERFORM 09000000-ERRORES-DMSII                                        
959900        STRING "ERROR EN END TRANSACTION SYNC "                               
960000               "ERROR " WKS-DMCATEGORY                                        
960100               " TIPO " WKS-DMERRORTYPE                                       
960200               " ESTR " WKS-DMSTRUCTURE                                       
960300               DELIMITED BY SIZE INTO TEXTO-LJ                                
960400        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
960500        CALL SYSTEM DMTERMINATE.                                              
960600                                                                              
960700 09000000-CIERRA-BD.                                                          
960800     CLOSE S500BD01CAPTACION ON EXCEPTION                                     
960900           MOVE 11                 TO WKS-ERROR-PROCESO-VA                    
961000           MOVE "E"                TO WKS-TIPO-LJ                             
961100           MOVE 020801             TO WKS-CODIGO-LJ                           
961200           PERFORM 09000000-ERRORES-DMSII                                     
961300           STRING "ERROR AL CERRAR LA BASE DE DATOS "                         
961400                  "ERROR " WKS-DMCATEGORY                                     
961500                  " TIPO " WKS-DMERRORTYPE                                    
961600                  " ESTR " WKS-DMSTRUCTURE                                    
961700                  DELIMITED BY SIZE INTO TEXTO-LJ                             
961800           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
961900                                                                              
962000 09000000-ERRORES-DMSII.                                                      
962100     MOVE DMSTATUS(DMCATEGORY)    TO WKS-DMCATEGORY.                          
962200     MOVE DMSTATUS(DMERRORTYPE)   TO WKS-DMERRORTYPE.                         
962300     MOVE DMSTATUS(DMSTRUCTURE)   TO WKS-DMSTRUCTURE.                         
962400                                                                              
965200 00000000-LLAMA-DISPLAY-STRING.                                               
965300     MOVE WKS-TIPO-LJ                     TO TIPO-LJ.                         
965400     MOVE WKS-CODIGO-LJ                   TO CODIGO-LJ.                       
965500     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
965600     MOVE SPACES                          TO TEXTO-LJ.                        
965700                                                                              
965800 00000000-LLAMA-DISPLAY-NORM.                                                 
965900     MOVE WS-DISP-TEXTO (WS-NO-DISPLAY)   TO TEXTO-LJ.                        
966000     MOVE WS-DISP-TIPO  (WS-NO-DISPLAY)   TO TIPO-LJ.                         
966100     MOVE WS-DISP-CODIGO(WS-NO-DISPLAY)   TO CODIGO-LJ.                       
966200     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
966250     MOVE SPACES                          TO TEXTO-LJ.                        
966300                                                                              
966400 00000000-LLAMA-DISPLAY-ADIC.                                                 
966500     STRING WS-DISP-TEXTO (WS-NO-DISPLAY),WS-DISP-ADICIONAL                   
966600            DELIMITED BY SIZE INTO TEXTO-LJ.                                  
966700     MOVE WS-DISP-TIPO  (WS-NO-DISPLAY)   TO TIPO-LJ.                         
966800     MOVE WS-DISP-CODIGO(WS-NO-DISPLAY)   TO CODIGO-LJ.                       
966900     CALL "LJ IN DISP" USING CONTADOR-LJ,MENSAJE-LJ.                          
966950     MOVE SPACES                          TO TEXTO-LJ.                        
966952                                                                              
966954***********************************************************                   
966956* EJECUTA P121 MEDIANTE EL WFL LOTE CUANDO PROCESA        *                   
966958* EL ARCHIVO MOVSTBINTERSEM                               *                   
966960***********************************************************                   
966962                                                                              
966964 50060000-EJECUTA-P121.                                                       
966966                                                                              
966968   MOVE ZEROS         TO S000-CTR-CVEERROR .                                  
966970   MOVE "S500JBATCH"  TO S000-CTR-LIBID    .                                  
966972   PERFORM 20000100-DAME-TIT-VERS          .                                  
967000                                                                              
967100   IF WKS-MPD-PRUEBAS AND S000-CTR-CVEERROR = 0                               
967200      DISPLAY "<MPD P015> EJECUTA CORRESOLO P121".                            
967300                                                                              
967400   IF S000-CTR-CVEERROR = 0                                                   
967500      MOVE S000-CTR-NOMLIB TO WS-TIT-LOTE-P121                                
967600      CALL SYSTEM WFL USING WS-WFL-P121                                       
968000   ELSE                                                                       
968200      MOVE "E"           TO WKS-TIPO-LJ                                       
968400      MOVE 020801        TO WKS-CODIGO-LJ                                     
968600      STRING "ERROR AL OBTENER TITLE S500JBATCH DE VERSIONES "                
968800             DELIMITED BY SIZE INTO TEXTO-LJ                                  
969000      PERFORM 00000000-LLAMA-DISPLAY-STRING.                                  
969200                                                                              
970000***********************************************************                   
970100*         80000000-FIN-PGM                                *                   
970200***********************************************************                   
970300 80000000-FIN-PGM.                                                            
970400     IF WKS-BD-ABIERTA                                                        
970500        PERFORM 09000000-CIERRA-BD.                                           
970600                                                                              
970700     IF WKS-PROCESO-CON-ERROR                                                 
970800        MOVE "E"           TO WKS-TIPO-LJ                                     
970900        MOVE 020801        TO WKS-CODIGO-LJ                                   
971000        STRING "FIN ANORMAL DE PROCESO "                                      
971100             DELIMITED BY SIZE INTO TEXTO-LJ                                  
971200        PERFORM 00000000-LLAMA-DISPLAY-STRING                                 
971300     ELSE                                                                     
971400        MOVE "E"           TO WKS-TIPO-LJ                                     
971500        MOVE 020801        TO WKS-CODIGO-LJ                                   
971600        STRING "FIN NORMAL DE PROCESO "                                       
971700             DELIMITED BY SIZE INTO TEXTO-LJ                                  
971800        PERFORM 00000000-LLAMA-DISPLAY-STRING.                                
971900                                                                              
971902     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE TRUE                         
971904        IF ATTRIBUTE OPEN OF CTRLARCH IS = VALUE TRUE                         
971906           MOVE SPACES               TO REG-CTRL                              
971908           ADD 1                     TO WS-LLAVE-CTRL                         
971910           MOVE 3                    TO REG-CTRL-TR                           
971912           MOVE ATTRIBUTE LASTRECORD OF ORDENADO-CM                           
971914                                     TO REG-CTRL-TOT-REG                      
971916           ADD 1                     TO REG-CTRL-TOT-REG                      
971918           MOVE ATTRIBUTE AREASIZE OF ORDENADO-CM TO WS-AREASIZE              
971920           COMPUTE REG-CTRL-CAP-MAX  = WS-AREASIZE * 15000                    
971922           IF WKS-DISPERSO-MOVTOS                                             
971924              MOVE 50001801          TO REG-CTRL-LLAVE                        
971926              WRITE REG-CTRL INVALID KEY                                      
971928                 MOVE "E"            TO WKS-TIPO-LJ                           
971930                 MOVE 050110         TO WKS-CODIGO-LJ                         
971932                 STRING "ERROR AL GRABAR REGISTRO DE MOVTOS "                 
971934                     "50001801 DEL CTRLARCH, VALOR DE LA LLAVE = "            
971936                     WS-LLAVE-CTRL                                            
971938                     DELIMITED BY SIZE INTO TEXTO-LJ                          
971940                 PERFORM 00000000-LLAMA-DISPLAY-STRING                        
971942           ELSE                                                               
971944              MOVE 50008901          TO REG-CTRL-LLAVE                        
971946              WRITE REG-CTRL INVALID KEY                                      
971948                 MOVE "E"            TO WKS-TIPO-LJ                           
971950                 MOVE 050110         TO WKS-CODIGO-LJ                         
971952                 STRING "ERROR AL GRABAR REGISTRO DE SDOPTE "                 
971954                     "50008901 DEL CTRLARCH, VALOR DE LA LLAVE = "            
971956                     WS-LLAVE-CTRL                                            
971958                     DELIMITED BY SIZE INTO TEXTO-LJ                          
971960                 PERFORM 00000000-LLAMA-DISPLAY-STRING.                       
971962                                                                              
972000     IF ATTRIBUTE OPEN OF ORDENADO-CM IS = VALUE TRUE                         
972100        CLOSE ORDENADO-CM WITH SAVE.                                          
972120                                                                              
972140     IF ATTRIBUTE OPEN OF CTRLARCH IS = VALUE TRUE                            
972160        CLOSE CTRLARCH WITH SAVE.                                             
972200                                                                              
972250*NOR-INI CONCILIACION EAS-HUB                                                 
972300                                                                              
972350     IF WS-B02-DECOM-S111 = 1                                                 
972400        IF WKS-HAY-ARCH-EAS = 0                                               
972450           NEXT SENTENCE                                                      
972500        ELSE                                                                  
972520           PERFORM 80001000-VALIDA-ARCH-EASHUB                                
972550           PERFORM 80001000-GENERA-ARCH-EASHUB                                
972600     ELSE                                                                     
972650        PERFORM 80001000-VALIDA-ARCH-EASHUB                                   
972700        IF ATTRIBUTE RESIDENT OF EAS-HUB IS = VALUE TRUE                      
972750           NEXT SENTENCE                                                      
972800        ELSE                                                                  
972850        IF WKS-HAY-ARCH-EAS = 1                                               
972900           PERFORM 80001000-GENERA-ARCH-EASHUB                                
972950        ELSE                                                                  
973000        IF WS-ULT-ARCH-APLI(2) = WS-FECHA-S111-HUB                            
973050           NEXT SENTENCE                                                      
973100        ELSE                                                                  
973150           PERFORM 80001000-GENERA-ARCH-EASHUB.                               
973200                                                                              
973250 80001000-VALIDA-ARCH-EASHUB.                                                 
973300     MOVE WS-NODO                  TO W-ETIQ-HUB-CSI.                         
973350     ACCEPT WKS-FECHA-MAQ          FROM DATE.                                 
973400     MOVE 20                       TO WKS-FEC-MAQ-CC                          
973450     MOVE WKS-FECHA-MAQ8           TO W-ETIQ-HUB-FECHA.                       
973500     CHANGE ATTRIBUTE TITLE OF EAS-HUB TO W-ETIQ-EAS-HUB.                     
973550                                                                              
973600 80001000-GENERA-ARCH-EASHUB.                                                 
973650*    MOVE WS-NODO                  TO W-ETIQ-HUB-CSI.                         
973700*    ACCEPT WKS-FECHA-MAQ          FROM DATE.                                 
973750*    MOVE 20                       TO WKS-FEC-MAQ-CC                          
973800*    MOVE WKS-FECHA-MAQ8           TO W-ETIQ-HUB-FECHA                        
973850*    MOVE 0                        TO WS-SEC WS-SS-LIBRE.                     
973900*    PERFORM 80001125-BUSCA-SS UNTIL WS-SS-LIBRE = 1.                         
973950*    SET  EAS-HUB(TITLE)           TO W-ETIQ-EAS-HUB.                         
974000                                                                              
974050     OPEN OUTPUT EAS-HUB.                                                     
974100     PERFORM 80001150-ESC-HEADER-EAS-HUB.                                     
974150                                                                              
974200     IF WKS-HAY-ARCH-EAS = 1                                                  
974250        OPEN I-O ORDENADO-CM                                                  
974300        MOVE 1                     TO WS-LLAVE-ORDCM                          
974320        MOVE 0                     TO WS-EOF-ORDCM                            
974350        PERFORM 80001100-LEE-ORDENADO                                         
974400        PERFORM 80001100-MUEVE-ORDENADO UNTIL WS-EOF-ORDCM = 1                
974450        CLOSE ORDENADO-CM WITH SAVE.                                          
974500                                                                              
974550     PERFORM 80001150-ESC-TRAIL-EAS-HUB.                                      
974600     CLOSE EAS-HUB WITH SAVE.                                                 
974650*     IF WS-ETIQ-HUB-SS = 02 AND WS-DIA-SEM > 1                               
974700*        MOVE W-ETIQ-EAS             TO W-ETIQ-HUB-NOM                        
974750*        CHANGE ATTRIBUTE TITLE OF EAS-HUB TO W-ETIQ-EAS-HUB.                 
974800                                                                              
974850     MOVE WKS-FECHA-MAQ8           TO WS-FECHA1.                              
974900     MOVE 0                        TO WS-FECHA2.                              
974950     MOVE 6                        TO WS-FUNCION.                             
975000     MOVE 13                       TO WS-FORMATO.                             
975050     PERFORM 50031700-CALENDAR.                                               
975100     MOVE WS-FECHA1                TO WS-DIA-SEM.                             
975150     IF S000-CTR-CVEERROR = 0                                                 
975200*    IF WS-ETIQ-HUB-SS = 02                                                   
975250        IF WS-DIA-SEM > 1                                                     
975300           PERFORM 80001250-ENVIO-EAS-HUB.                                    
975350*          PERFORM 80001150-REGRESA-SEC02.                                    
975400                                                                              
975450* 80001125-BUSCA-SS.                                                          
975500*     ADD 1                          TO WS-SEC.                               
975550*     MOVE WS-SEC                    TO WS-ETIQ-HUB-SS.                       
975600*     CHANGE ATTRIBUTE TITLE OF EAS-HUB TO W-ETIQ-EAS-HUB-SS.                 
975650*     IF ATTRIBUTE RESIDENT OF EAS-HUB IS = VALUE TRUE                        
975700*        NEXT SENTENCE                                                        
975750*     ELSE                                                                    
975800*        MOVE 1                      TO WS-SS-LIBRE.                          
975850                                                                              
975900* 80001150-REGRESA-SEC02.                                                     
975950*     WAIT (10)                                                               
976000*     CHANGE ATTRIBUTE TITLE OF EAS-HUB TO W-ETIQ-EAS-HUB                     
976050*     IF ATTRIBUTE RESIDENT OF EAS-HUB IS = VALUE TRUE                        
976100*        OPEN I-O EAS-HUB                                                     
976150*        CHANGE ATTRIBUTE TITLE OF EAS-HUB TO W-ETIQ-EAS-HUB-SS               
976200*        CLOSE EAS-HUB WITH SAVE.                                             
976250                                                                              
976300 80001100-LEE-ORDENADO.                                                       
976350                                                                              
976400     READ ORDENADO-CM INVALID KEY                                             
976450          MOVE "E"              TO WKS-TIPO-LJ                                
976500          MOVE 010106           TO WKS-CODIGO-LJ                              
976550          STRING "ENCONTRE FIN ARCHISUPERRECONTRASORPRENDENTE "               
976600                 DELIMITED BY SIZE INTO TEXTO-LJ                              
976650          PERFORM 00000000-LLAMA-DISPLAY-STRING                               
976700          MOVE 1 TO WS-EOF-ORDCM.                                             
976750                                                                              
976800 80001100-MUEVE-ORDENADO.                                                     
976850                                                                              
976900     MOVE ORDENADO-TB-CLAVE     TO WKS-TB-CLAVE.                              
976950     MOVE ORDENADO-TB-CAJA      TO WKS-TB-CAJA.                               
977000     MOVE ORDENADO-TB-PRIORIDAD TO WKS-TB-PRIORIDAD                           
977050     MOVE ORDENADO-TB-TIPERROR  TO WKS-TB-TIPERROR                            
977100                                                                              
977150     IF REG-ORDENADO-TR = "2"                                                 
977200        PERFORM 80001200-VALIDA-EASHUB.                                       
977250                                                                              
977300     ADD 1                      TO WS-LLAVE-ORDCM.                            
977350     PERFORM 80001100-LEE-ORDENADO.                                           
977400                                                                              
977450 80001150-ESC-HEADER-EAS-HUB.                                                 
977500     MOVE 01                    TO REG-HUB-TR.                                
977550     MOVE W-ETIQ-HUB-FECHA      TO REG-HUB-FECHA.                             
977600     MOVE "S500"                TO REG-HUB-SISORI.                            
977650     MOVE "S015"                TO REG-HUB-SISDES.                            
977700     MOVE "ARCHIVO ACEPTADOS Y RECHAZADOS HUB           "                     
977750                                TO REG-HUB-DESC.                              
977800     MOVE SPACES                TO REG-HUB-HDR-SPACES.                        
977850     ADD 1                      TO WS-LLAVE-EASH.                             
977900     WRITE REG-HUB INVALID KEY                                                
977950           MOVE "E"             TO WKS-TIPO-LJ                                
978000           MOVE 020801          TO WKS-CODIGO-LJ                              
978050           STRING "ERROR AL GRABAR REGISTRO HDR DEL EAS-HUB"                  
978100           DELIMITED BY SIZE INTO TEXTO-LJ                                    
978150           PERFORM 00000000-LLAMA-DISPLAY-STRING                              
978200           WAIT (30)                                                          
978250           WRITE REG-HUB INVALID KEY                                          
978300                 MOVE "E"       TO WKS-TIPO-LJ                                
978350                 MOVE 020801    TO WKS-CODIGO-LJ                              
978400                 STRING "ERROR AL GRABAR REGISTRO HDR DEL EAS-HUB"            
978450                 "POR 2DA OCASION, SE GENERA ARCHIVO SIN HEADER "             
978500                 DELIMITED BY SIZE INTO TEXTO-LJ                              
978550                 PERFORM 00000000-LLAMA-DISPLAY-STRING.                       
978600                                                                              
978650 80001150-ESC-TRAIL-EAS-HUB.                                                  
978700     MOVE 09                       TO REG-HUB-TR.                             
978750     MOVE WS-EASHUB-NUMREG-OK      TO REG-HUB-REGOK.                          
978800     MOVE WS-EASHUB-NUMREG-NOOK    TO REG-HUB-REGNOOK.                        
978850     MOVE SPACES                   TO REG-HUB-TRL-SPACES.                     
978900     ADD  1                        TO WS-LLAVE-EASH.                          
978950     WRITE REG-HUB INVALID KEY                                                
979000           MOVE "E"                TO WKS-TIPO-LJ                             
979050           MOVE 020801             TO WKS-CODIGO-LJ                           
979100           STRING "ERROR AL GRABAR REGISTRO TRAILER EAS-HUB "                 
979150                  DELIMITED BY SIZE INTO TEXTO-LJ                             
979200           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
979250                                                                              
979300 80001200-VALIDA-EASHUB.                                                      
979350     IF WKS-TB-CLAVE = 12 OR 50 OR 577                                        
979400        NEXT SENTENCE                                                         
979450     ELSE                                                                     
979500     IF WKS-TB-CAJA = 21 AND                                                  
979550        (WKS-TB-PRIORIDAD = 2 OR 4 OR 7 OR 8 OR 9)                            
979600        PERFORM 80001210-LLENA-REG-EAS-HUB                                    
979650        PERFORM 80001250-ESCRIBE-EAS-HUB.                                     
979700                                                                              
979750 80001210-LLENA-REG-EAS-HUB.                                                  
979800     MOVE 02                           TO REG-HUB-TR.                         
979850     MOVE ORDENADO-TB-SUCPROM          TO HUB-TB-SUCPROM.                     
979900     MOVE ORDENADO-TB-NUMCONT          TO HUB-TB-NUMCONT.                     
979950     MOVE ORDENADO-TB-NUMTB            TO HUB-TB-NUMTB                        
980000                                          HUB-TB-NUMTB-REF3.                  
980050     MOVE ORDENADO-TB-PRODUCTO         TO HUB-TB-PRODUCTO.                    
980100     MOVE ORDENADO-TB-INSTRUM          TO HUB-TB-INSTRUM.                     
980150     MOVE ORDENADO-TB-CLAVE            TO HUB-TB-CLAVE.                       
980200     MOVE ORDENADO-TB-IMPORTE          TO HUB-TB-IMPORTE.                     
980250     MOVE ORDENADO-TB-REFINTNAL        TO HUB-TB-REFINTNAL                    
980300                                          HUB-TB-REFINTNAL-REF4.              
980350     MOVE WKS-TB-CAJA                  TO HUB-TB-CAJA.                        
980400     MOVE ORDENADO-TB-FECHA            TO HUB-TB-FECHA.                       
980450                                                                              
980500     IF WKS-TB-TIPERROR = 0 OR 1                                              
980550        MOVE 0001                      TO HUB-TB-NUMERROR                     
980600        MOVE "PEND. DE DISPERSON"      TO HUB-TB-CAUSAERR                     
980650     ELSE                                                                     
980700     IF WKS-TB-TIPERROR = 2                                                   
980750        MOVE 0000                      TO HUB-TB-NUMERROR                     
980800        MOVE SPACES                    TO HUB-TB-CAUSAERR                     
980850     ELSE                                                                     
980900     IF WKS-TB-TIPERROR = 3                                                   
980950        MOVE ORDENADO-TB-NUMERROR      TO HUB-TB-NUMERROR                     
981000        MOVE SPACES                    TO HUB-TB-CAUSAERR                     
981050        PERFORM 80001210-BUSCA-LEYENDA-HUB                                    
981100                VARYING WS-IND-LEY FROM 1 BY 1                                
981150                UNTIL   WS-IND-LEY > 1200                                     
981200        IF HUB-TB-CAUSAERR = SPACES                                           
981250           MOVE "ERR NO ESPECIFICADO"  TO HUB-TB-CAUSAERR.                    
981300                                                                              
981350     MOVE ORDENADO-TB-INTAUTH-CODE     TO HUB-TB-INTAUTH-CODE.                
981400     MOVE ORDENADO-TB-INSTITUCION-ID   TO HUB-TB-INSTITUCION-ID.              
981450     MOVE ORDENADO-TB-INTAPLICACION-ID TO HUB-TB-INTAPLICACION-ID.            
981500     MOVE SPACES                       TO HUB-SPACES-1                        
981550                                          HUB-SPACES-2                        
981600                                          HUB-SPACES-3                        
981650                                          HUB-SPACES-4.                       
981700     MOVE "/"                          TO HUB-DIAG-1.                         
981750     MOVE SPACES                       TO REG-HUB-REG-SPACES.                 
981800                                                                              
981850     IF WKS-TB-TIPERROR = 2                                                   
981900        ADD 1                          TO WS-EASHUB-NUMREG-OK                 
981950     ELSE                                                                     
982000        ADD 1                          TO WS-EASHUB-NUMREG-NOOK.              
982050                                                                              
982100 80001210-BUSCA-LEYENDA-HUB.                                                  
982150                                                                              
982200     IF ORDENADO-TB-NUMERROR = WS-TBL-ERROR-NUM(WS-IND-LEY)                   
982250        MOVE WS-TBL-ERROR-CON1(WS-IND-LEY) TO HUB-TB-CAUSAERR                 
982300        MOVE 1201                          TO WS-IND-LEY.                     
982350                                                                              
982400 80001250-ESCRIBE-EAS-HUB.                                                    
982450     ADD 1                     TO WS-LLAVE-EASH.                              
982500     WRITE REG-HUB INVALID KEY                                                
982550           MOVE "E"            TO WKS-TIPO-LJ                                 
982600           MOVE 010105         TO WKS-CODIGO-LJ                               
982650           STRING "ERROR AL GRABAR EN ARCHIVO EAS-HUB "                       
982700                  DELIMITED BY SIZE INTO TEXTO-LJ                             
982750           PERFORM 00000000-LLAMA-DISPLAY-STRING.                             
982800                                                                              
982850 80001250-ENVIO-EAS-HUB.                                                      
982900                                                                              
982950     MOVE "ENVIACONHUB"                       TO WS-WFLP197-PARAM.            
983000     MOVE W-ETIQ-HUB-FECHA                    TO WS-WFLP197-FECHA.            
983050     MOVE ZEROS                               TO S000-CTR-CVEERROR            
983100     MOVE "S500JBATCH"                        TO S000-CTR-LIBID.              
983150     PERFORM 20000100-DAME-TIT-VERS.                                          
983200                                                                              
983250     IF WS-DH-NOM-EQUIPO = "ACYPBETA. "                                       
983300        MOVE "ACCESSCODE=90834844/GEML1234; " TO WS-TIT-LOTE-ACCE             
983350     ELSE                                                                     
983400        MOVE SPACES                           TO WS-TIT-LOTE-ACCE.            
983450                                                                              
983500     MOVE S000-CTR-NOMLIB                     TO WS-WFLP197-LOTE .            
983550     CALL SYSTEM WFL USING WS-WFLP197.                                        
983600                                                                              
987400 COPY "S500/INC/PRO/25MTP005".                                                
